[
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "iam-1",
        "review_rating": "8",
        "review_title": "Bergman knows how to make you think.",
        "review_detailed_main": "Bergman has been seen by many as being a depressing film makes, who speaks above the heads of most people. Thank God someone does! In this piece of genius, we are asked to consider who God is; what makes a life worthwhile; and whether human nature alters through the generations, or is it just the costumes that change? As usual, the answers are to be provided by the audience. We must chose for ourselves what we think is 'right' or 'just'. Bergman uses the usual pattern for him - a man is on a journey (life) and meets people who are going along the same road (friends and family), and they all head toward the end of their trip (death). They stop in for obligatory visits with relatives and for food (as we all do), receive an honourary degree (fame & success?), and then send the children off to a party held in our honour that we do not attend (funeral). What happens along the way is important, but we always end up in the same place - the end. Wonderful editing techniques, good story, good images, fantastic acting, and more ideas and questions to ponder than one film can hold - or so you thought. It's only after the film ends that these ponderings come to you. During the film, you simply watch a man travel from his home to another city, but this is far from what the film is about. See this film once, think about the questions it poses, then rewind and see it again. You will be rewarded for doing so."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "thxrvg",
        "review_rating": "9",
        "review_title": "A Magnificent Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "exceptionally well made",
        "review_detailed_main": "Although I'm not the biggest Ingmar Bergman fan, I have really enjoyed some of his movies--especially the one that are not so pessimistic. Although the underlying theme of this movie is aging and impending death, the movie is NOT all pessimism. If it had been, it would have lost my interest early on. Instead, I really enjoyed the film--particularly the fine acting by Victor Sjöström as Professor Borg.\n\nThe professor is well-respected for his work as a doctor. However, despite his success in his career, he is a failure in his personal relationships. His emotional baggage over the years has prevented him from allowing himself to be close to those he truly loves. This theme mirrors one of the subplots of Through a Glass Darkly, where a father is being destroyed inside by his daughter's mental illness but he CANNOT allow himself to show his anguish--choosing instead to hide in his room with his tears. It is interesting that the same man playing Borg's son (Gunnar Björnstrand) plays the father only a few years later in Through a Glass Darkly.\n\nFortunately, unlike Through a Glass Darkly, there IS evidence that the professor is willing to change his persona, as he begins to open up more through the course of the movie. This appears to be assisted through extensive soul searching and dreams the professor has concerning his past and his own mortality--along with experiences he has during a long drive down the coast of Sweden. Because of this, even his extremely strained relationship with his son appears to hold some hope of improvement by the film's end. This hope for change lifts this movie above some Bergman films that only wallow in hopelessness.\n\nFYI--The Criterion version of this DVD is nice due to its running commentary as well as the accompanying documentary. Get this version if you have the chance.\n\nAlso FYI--After watching many Bergman films and reading about his life, I detect quite a bit of autobiography in this film and his own stuggles with intimacy."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jonr-3",
        "review_rating": "10",
        "review_title": "A cathartic viewing experience",
        "review_detailed_main": "I'd seen \"Wild Strawberries\" as a college freshman when it was first released, and knew right away I'd be a Bergman fan from then on.\n\nI watched it again just last night, January 2004, at age 63, and needless to say got a whole different perspective on the film. Where the surrealist touches, moody photography, and incredibly smooth direction had made the big hit with me as a near boy, as an aging man I found myself--I hesitate to say painfully, but...well, closely--identifying with old Isak Borg in his strange pilgrimage, both interior and exterior, the day he receives his honorary degree at the cathedral in Lund.\n\nIn the last twenty minutes or so of the movie, I found tears running down my face, not from any thrilling sentimental browbeating (I doubt if Mr. Bergman shot five seconds' worth of sentimentality in his whole long career!) but simply from the cumulative emotional impact of this simple, powerful story and its probing revelation of human character, desire, and chagrin.\n\nBy the time the film ended, I felt wrung out, disoriented, happy and deeply sad at the same time: it's the experience the Greeks wanted their tragedies to convey to the spectator; they spoke of \"katharsis.\" I experienced it firsthand when I had the great good fortune to see a production (in English) of \"Medea.\" I walked away in tears and scarcely able to think straight for an hour or so.\n\nThe same thing happened with \"Wild Strawberries.\" This is one of the handful of films I unhesitatingly rate a \"ten.\"\n\nA side note: I watched the Criterion Collection DVD. Before the film itself, I watched the hour-long interview conducted in 1998 by Jorn Donner included on the disc. It was remarkable to see how the film Bergman shot ca. 1957 contains many elements that were to be present in his later life--like a foreshadowing of his own old age."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "DennisLittrell",
        "review_rating": "10",
        "review_title": "When film was an art form",
        "review_detailed_main": "In this symbolic tale of an old man's journey from emotional isolation to a kind of personal renaissance, Ingmar Bergman explores in part his own past, and in doing so rewards us all with a tale of redemption and love.\n\nVictor Sjostrom, then 80 years old, stars as Professor Isak Borg whose self-indulgent cynicism has left him isolated from others. Sjostrom, whose work goes back to the very beginning of the Swedish cinema in the silent film era, both as an actor and as a director, gives a brilliant and compelling performance. All the action of the film takes place in a single day with flashbacks and dream sequences to Borg's past as Borg wakes and goes on a journey to receive a \"Jubilee Doctor\" degree from the University of Lund. Bergman wrote that the idea for the film came upon him when he asked the question, \"What if I could suddenly walk into my childhood?\" He then imagined a film \"about suddenly opening a door, emerging in reality, then turning a corner and entering another period of one's existence, and all the time the past is going on, alive.\"\n\nBibi Andersson plays both the Sara from Borg's childhood, the cousin he was to marry, and the hitchhiker Sara who with her two companions befriends him with warmth and affection. The key scene is when the ancient Borg in dreamscape comes upon the Sara of his childhood out gathering wild strawberries. Borg looks on (unnoticed of course) as his brother, the young Sigfrid, ravishes her with a kiss which she returns passionately; and, as the wild strawberries fall from her bowl onto her apron, staining it red, Borg experiences the pain of infidelity and heartbreak once again. Note that in English we speak of losing one's \"cherry\"; here the strawberries symbolize emotionally much the same thing for Sara. Later on in the film as the redemption comes, the present day Sara calls out to Borg that it is he that she really loves, always and forever. Borg waves her away from the balcony, yet we are greatly moved by her love, and we know how touched he is.\n\nThe two young men accompanying Sara can be seen as reincarnations of the serious and careful Isak Borg and the more carefree and daring Sigfrid. It is as though his life has returned to him as a theater in which the characters resemble those of his past; yet we are not clear in realizing whether the resemblance properly belongs in the old man's mind or is a synchronicity of time returned.\n\nMemorable is Ingrid Thulin who plays Mariana, the wife of Borg's son who accompanies him on the auto trip to Lund. She begins with frank bitterness toward the old man but ends with love for him; and again we are emotionally moved at the transformation. What Bergman does so very well in this film is to make us experience forgiveness and the transformation of the human spirit from the negative emotions of jealousy and a cold indifference that is close to hate, to the redemption that comes with love and a renewal of the human spirit. In quiet agreement with this, but with the edge of realism fully intact, is the scene near the end when Borg asks his long time housekeeper and cook if they might not call one another by their first names. She responses that even at her age, a woman has her reputation to consider. Such a gentle comeuppance meshes well with, and serves as a foil for, all that has gone on before on this magical day in an old man's life.\n\nSee this for Bergman who was just then realizing his genius (The Seventh Seal was produced immediately before this film) and for Sjostrom who had the rare opportunity to return to film as an actor in a leading role many decades past him prime, and made the most of it with a flawless performance, his last major performance as he was to die three years later.\n\n(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Galina_movie_fan",
        "review_rating": "10",
        "review_title": "One of Master's Most Optimistic, Profound, And Warmest Films.",
        "review_detailed_main": "I first saw \"Wild Strawberries\" many years ago at one of the special screenings in the small theater in Moscow. It was the first Bergman's film I ever saw. This picture is amazing in its emotional impact and in my opinion is one of Bergman's most optimistic, profound, and warm films.\n\n\"Wild Strawberries\" provides sincere, intelligent, and emotional contemplations of life's disappointment, regrets, and losses. The main character, seventy-eight-year-old Professor Isak Borg is forced to see his life in a true and painful light, but he also would learn that there is hope.\n\nSparkling cinematography by Gunnar Fisher and superb acting of Bergman's regulars \u0096 Ingrid Thulin, Bibi Anderson, Gunnar Bjornstrand, Max von Sydow and especially, the great silent film director, Victor Sjostrom as Professor Borg add to many delights of \"Wild Strawberries\" which also include Bergman's writing/directing with his famous mixing of conscious and unconscious, dreams and reality, the past and the present in the same scene."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "wiseowl-5",
        "review_rating": "10",
        "review_title": "Film as an art form",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "pooch-8",
        "review_rating": "",
        "review_title": "One of Bergman's greatest achievements",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "evanston_dad",
        "review_rating": "10",
        "review_title": "Stunning Bergman Masterpiece -- Maybe His Best?",
        "review_detailed_main": "\"Wild Strawberries\" profoundly moved me. The theme -- an old man coming up fast on death and wondering if his life has had any meaning -- is an old one for Bergman, and one which he explored ad nauseum throughout the subsequent decades. But here Bergman approaches the question with an uncharacteristic optimism and sense of hope. For once, he seems to come close to finding some peace with the unknowns of life that obviously preoccupied him as an artist, and the movie he gives us is sad but immensely warm; resigned but calm and reflective.\n\nAn unequivocal masterpiece, and only one of a handful of Bergman films (\"Persona\" and \"Cries and Whispers\" being two others) that don't drive me over the edge when I watch them now.\n\nGrade: A+"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "SanTropez_Couch",
        "review_rating": "10",
        "review_title": "First Bergman",
        "review_detailed_main": "During the first scene of \"Wild Strawberries,\" I didn't think I'd be able to get through it -- the Swedish was so alien to me it sounded almost comical; it seemed as if every word ended with an \"eer\" sound. But quickly the beautiful black and white photography caught my eye and I was drawn into Isak Borg's story, or rather, his self-examination.\n\nThe progression of the film is fantastic. Early in the film, Isak has an apparition within a dream and the small events leading up to it, within the dream, are quite brilliant. Throughout the rest of the film there are dreams and recollections; newly discovered secrets of the past that Isak sees for the first time. As he says in the film, \"Dreams, as if I must tell myself something I won't listen to when I'm awake.\"\n\nHow Bergman shows us the characters is terrific. It's a like a relaxed puzzle that doesn't emphasize any sort of urgency to figure things out. The story unfolds beautifully as we get a deeper sense of Isak, who I assume is an alter ago of Ingmar Bergman at that stage of his life (he was thirty-nine when the film was released).\n\nIt pains me to know that the majority of people my age would rather watch an Adam Sandler movie or \"The Rock\" than something like this. Hey, I liked \"Big Daddy\" and I love Nicolas Cage, but \"Wild Strawberries\" is one of the few films I've seen that could possibly change the way I live my life. I'm always interested in listening to what aged people have to say about their own life because, well, it can only give me tips about my own, and that's what this film does in a way.\n\nThere is one sequence in the film that is frightening and \"arty,\" and I don't completely grasp what it means beyond Isak's deterioration and his realization of how people actually feel towards him (he's told earlier in the film as well, but he seems to accept this \"verdict\" more readily), but it doesn't take away from the film; rather, it's an interesting addition to an otherwise satisfying experience. In fact, it's probably the most vital part of the movie -- Isak may not like it, bbut once he gets past it, he has the option to develop.\n\nI don't know if the film is a masterpiece -- it's my introduction to Bergman, so once I see \"Cries and Whispers,\" \"Fanny and Alexander,\" \"Persona\" and \"The Seventh Seal\" (if I can get through it, this time) I'll come back to this film with a new perspective, or at least see it as a part of Bergman's whole. I do think this is a great film of its type. It's the kind of film that may require viewings every five or so years, as a sort of reminder.\n\nPauline Kael once said that she didn't think much of Bergman because she'd done her share of soul-wrestling and it wasn't that difficult. The film isn't as challenging as I was expecting it to be, in fact, it's a walk in the park. It's pleasant and rich and beautiful, and the title seems perfect after you've seen the film. It's all about wild strawberries.\n\n****"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ma-cortes",
        "review_rating": "7",
        "review_title": "Emotional and symbolic masterpiece by the genius Ingmar Berman",
        "review_detailed_main": "¨ Wild strawberries¨ is a spellbinding masterpiece by the great Ingmar Bergman with brilliant acting by Victor Sjostrom (Sweden first movie filmmaker and star , best known for his silent work , who died three years later , aged 81) and awesome cinematography by Gunnar Fischer ; showing a rich tapestry of fears , dreams , anxieties , memories and occasionally over-symbolic frames . This Bergman's landmark film is developed in Sweden , after living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence , taking place a sentimental voyage . This the story about an aging scientist on the rout to accept a prize and he must come to terms with nightmares , surrealist dreams and guilt .\n\nThe movie displays haunting and powerful scenes ,it's plenty of intellectual images which stay forever in the mind ; resulting to be one of Bergman's warmest and therefore finest movies . Brooding and thought-provoking screenplay , Ingmar Bergman wrote the script while he was in hospital and thought the movie with Victor Sjöström in mind and riddled with a real feeling the joys of youth , age and nature . Although sometimes is slow moving ,however the thoughtful screenplay is narrated with intelligence and sensitivity but are developed ethics and moral issues as death , God , religion , family and aging . Surrealist and impressive images as when the coffin falling from the hearse , one of Bergman's own recurring dreams . Victor Sjostrom , Swedish cinema's best known pioneer and in his final screen appearance , gives a surprisingly moving interpretation as a professor on a touching journey to his redemption . The movie is marvelously paced and acted , and realizes an excellent Sweden reunion actors with usual Bergman's players (Ingrid Thulin , Bibi Andersson , Max Von Sidow as a gas station keeper and Gunner Lindblon, among others) , showing the different characters and exploring their apprehensions , ambitions, fears and circumstances .\n\nGlimmer and riveting cinematography by Gunner Fischer (The seventh seal) , he's deemed by many to be one of the world's greatest cameraman , he achieved give the movies on the most natural and simplest look imaginable . Cinematographer Gunnar Fischer says that several scenes had to be shot indoors due to Victor Sjöström's poor health , \"We had to make some very bad back-projection in the car because we never knew if Victor would come back alive the next day.\" Gunnar was subsequently replaced by Sven Nykvist (won an Oscar for Fanny and Alexander) as Bergman's cinematographer . ¨Smultronstället¨ is wonderfully directed by Bergman ,it's a real masterpiece who made his major impact gaining international acclaim and winning Gloden Globe 60 , for the best Foreign film . His realization was during an impressive golden period from 1957-1968 when Bergman made stunning masterpieces, plenty of richly observed characters : The seventh seal , Persona, The communicants , The silence , Virgin spring , Hour of wolf . Rating: Magnificent, but is considered by many (along with The seventh seal) to be the Bergman's best ."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Vincentiu",
        "review_rating": "10",
        "review_title": "The only reality",
        "review_detailed_main": "A gorgeous movie about memory and hope. A trip and a form of catharsis. It is not a story of an old man who discovers images of his past, about a marital crisis or some teenagers. It is not a confession. It is a mirror. The same crisis is the \"gift\" of everybody. The same silence, fear and desire are the refuge of a man, a woman, a n American or Irakian. At a moment, at a single moment, you discover your past like only reality. Like your real skin, your only voice, your essential eye. It is not strange. We are the fruits of some experiences. Some books, some people, a family, a child or a wife are the Ganymedes of our hours, our evolution, our death. Our freedom, our gestures, our smile are the trees of their presence. Isak Borg is the image of a age. Our age who grow-up in the noise of every day. The isolation is only way to be yourself. The way to Lund, the relation with Agda, the empty attitude, the projection in Evald, the words are the symbols of a clock who is seed of our conscience. Childhood is only reality of our life."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "gavin6942",
        "review_rating": "7",
        "review_title": "Farewell, Victor Sjostrom",
        "review_detailed_main": "After living a life marked by coldness, an aging professor (Victor Sjöström) is forced to confront the emptiness of his existence.\n\nStar Victor Sjöström had been a gem of Swedish cinema for decades. He worked primarily in the silent era; his best known films include \"The Phantom Carriage\" (1921), \"He Who Gets Slapped\" (1924) and \"The Wind\" (1928). Bergman said this film could not have been made without him, and it makes sense. Not only was Bergman influenced by these early Swedish films, but it makes sense to have a man at the end of his distinguished career.\n\nThe real standout performance (besides Sjostrom) is Bibi Andersson, who plays Sara. Is it any surprise she starred in more than ten Bergman-directed pictures, including \"Smiles of a Summer's Night\", \"The Seventh Seal\", \"Brink of Life\", \"The Magician\", \"The Passion of Anna\", \"The Touch\" and \"Persona\". If Bergman had a muse, it was Andersson.\n\nBergman has been a strong influence on Woody Allen, and \"Wild Strawberries\" has influenced a whole series of Allen films: \"Stardust Memories\", \"Another Woman\", \"Crimes and Misdemeanors\", and \"Deconstructing Harry\". No less a person than Stanley Kubrick said this was his second favorite film of all time."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "fred3f",
        "review_rating": "4",
        "review_title": "A Contrarian View",
        "review_detailed_main": "As I look at all the 10 star reviews that others have given this film I wonder if I am being foolhardy in daring to say something to the contrary. I am and have been for many years a Bergman fan. I eagerly saw most of his films as they were released. I love nearly all of them - this one being an exception. Certainly the film is worth seeing - any Bergman film is. But this one is often cited as his best, and there I would strongly disagree. It is about an academic and although professor Borg has to face some of his demons, he comes out on top in then end. I understand why this film is so popular. Academics see themselves in professor Borg and academics have a lot of influence on what is considered art and what isn't. Borg ends up looking good at the end of the film, and academics, although they have their faults like anyone else, like to think that they are worthy of the respect that their position commands. In many, many cases they are - and this is not a diatribe against academics. I just think that Bergman let this character off too easily, particularly when you compare the way he treats his other characters in movies like \"The Hour of the Wolf\", \"The Silence\", \"Shame\" and so on. He plumbs the depths of the soul and takes no prisoners. \"Wild Strawberries\" starts out that way, when the professor flashes back to the key points in his life where he turned away from love, life and reality in favor of academic honor. But ultimately Bergman backs down. The professor, having seen the errors of a lifetime in a few short hours, is shown to be wiser and a better man now as he receives his honorary award. Bergman does not do this in his other films. For me this gives a certain falsity to \"Wild Strawberries\" that I don't see in \"Persona\" for example. Well, everyone will probably disagree with me, - this is such an acclaimed film - but sometimes it is valuable to hear a contrarian opinion even when you don't agree with it."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "sol-kay",
        "review_rating": "8",
        "review_title": "One last time around the strawberry patch.",
        "review_detailed_main": "(Slight Spoilers) A man's life journey is all seen through a number of dreams and hallucinations on his trip, some 400 miles, to the town of Lund where he's to receive a lifetime achievement award for his 50 or so years of service to his fellow man as a doctor and a professor of medicine at his alma mater the Cathedral of Lund.\n\nDisturbed by a dream he had the night before Isak Borg decides to take a ride by car, not plane, to Lund for a ceremony thats to be in his honor for his work as a man of medicine. Isak's maid for some 40 years Agda is very upset with her boss' and good friends decision and decides to stay at home, she'll eventually show up at the ceremony, feeling that the old man has somehow lost control of his senses. It turns out that the long car trip together with his daughter-in-law Marianne was one of the best decision that he made in his long life, Isak is 78 years old. The trip that Isak takes will bring back past memories that he so desperately tried to hide from himself. That past will in effect make him not only a better person but bring back the feeling of humanity that he lost not only for himself over these long and empty years. Not only for Isak but for those close to him whom he more or less also lost contact with. Isak,in both his dreams and memories, is seen as a man who is unable to show any real feelings for those around and close to him in the fear of either being rejected as well as showing himself to be hurt by their negative responses.\n\nThis defect in Isak personality has cost him the love of his life Sara when he was a young man who rejected him for his handsome and openly aggressive older brother Sigfried. We also see that Isak's marriage to his wife, who had long since passed away, Karin was anything but happy with her disgusted with his inability to show her any real feelings and emotions as a husband. Were also shown, in one of Isak's dreams, that she had an affair with another man Ake Fridell, who was anything but passive with her like her husband Isak was, some 40 years ago behind his back. That may have possibly resulted in the birth of his only child his son, who's also a doctor, Evald Marriane's husband.\n\nSeeing his 96 year-old mother on his way to Lund we see in her the same human defect that he has in that all of her ten children, who with the exception of Isak are now deceased, never bothered to visit her in her old age. The only time that they had anything to do with her was when they wanted money from the old lady. This coldness and inability to have any attachment to her children is shown not only in both Isak and his mother but in his son Evald who's so disgusted with life and what it had to offer him, like a beautiful and caring wife like Marianne. Evald threatened to walk out on Marianne when after he found out of her being pregnant, I guess by him, she refused his demand of her getting an abortion.\n\nIsak is helped on his long trip to Lund not only by Marianne but a number of people they meet and in some cases give a ride along the way. This included a young girl and two of her friend going on a trip to Italy ironically named Sara, a virtual twin of the Sara that he loved and lost as a young man. Later Sara together with Anders and Victor who later as a singing group serenade a surprised and grateful, to the point of tears, Isak after he received his award. Meeting among others along the way to far flung Lund a bickering couple Mr. & Mrs. Alman, who almost had Isak and his passengers killed in a head-on car crash. Isak also met a gas station attendant, Henrik, who was so impressed and grateful by what he did for him and his wife in the past , delivered their first child, that he refused to get paid for filling up Isak's gas-tank.\n\nBy the time Isak got to Lund and received his lifetime achievement award to the attendance and cheering of the entire town he not only realized all the good that he did as a man of medicine all these years but also all the hurt that he gave to others, if unintentional. With the little time that he has left, Isak was to pass away three years later at the age of 81, Isak is determined to make up for it.\n\nSweet touching yet simple little film about one man's journey back in time who sees how he missed out on the many wonderful things that life had to offer him by being blind to them. Now given a second chance Isak would try as best as he can to both re-live and at the same time correct his past mistakes."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Gene-32",
        "review_rating": "",
        "review_title": "Bergman's Masterpiece Confronts us with the Important Question.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Xstal",
        "review_rating": "8",
        "review_title": "Reflections of an Aging Pedant...",
        "review_detailed_main": "The laws of life are hard to follow, they'll often lead to mournful sorrow, because there are no hard set rules, except those conjured by naive fools. So when the hands fall off the clock, the sands of time run out and stop, it's far too late to contemplate, your influence on your own fate. So as your winters fast approach, cold days of melancholic reproach, observe the worlds that could have been, compare them to the ones you've seen. It's seldom late to change your mind, free yourself from pedantic grind, to avoid worst case scenario, having scattered seed, in sterile furrow.\n\nVictor Sjöström is outstanding as the reflective pedant who's missed the boat."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "dr_of_lube",
        "review_rating": "10",
        "review_title": "Better late than never; tragicomedy ending with hope",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ian_harris",
        "review_rating": "10",
        "review_title": "One of the very, very best",
        "review_detailed_main": "Quite simply one of the very, very best movies I have ever seen. Saw it recently for the second time, some 15 to 20 years after seeing it for the first time. First time round I was the age and stage of the traveling youngsters and saw the world through their eyes. This time I could identify more with the son and daughter-in-law characters with just as much conviction. The subtlety and sophistication of this movie defy description. It simply has to be seen to be believed. If you've never seen it, don't just sit there, go see the movie."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "nqure",
        "review_rating": "8",
        "review_title": "Cinema as an art form",
        "review_detailed_main": "Bergman's films, to state the blindingly obvious, are the complete antithesis of the mindcandy (A Beautiful Mind) presented to cinemagoers in sterile multiplexes. They are almost like cinematic art forms, meditations on life and its meanings but, like many works of art, they can be obscure, challenging and demand patience to understand their underlying subtexts. Even after a 2nd viewing!\n\n'Wild Strawberries' deals with the past, memories & regrets. It's about an inner journey about one man's subjective state of mind as he sees nostalgic memories of childhood & lost love (regret), surreal visions of denial (mortality) and unsettling weird dreams which hint at a self-awareness and truth that he cannot face in reality.\n\nI was touched by Victor Sjostrom's performance as the elderly Prof. Isak Borg reflecting upon his life, and moved by the final emotional scenes where he achieves an inner peace. Is it slightly deceiving, a cop-out that Borg finds peace at the sight of his father and mother, 'the point before betrayal, before the messiness of life' intervenes as another reviewer stated? Well, I think it's commonly accepted that most people, as they grow older, tend to remember more from their past & childhoods. Why? Perhaps because it reminds them of a time of lost innocence.\n\nWhat I found quite difficult to understand was how Isak is supposed to be this cold-hearted rationalist; Sjostrom's touching depiction makes this troubled old man quite endearing (viz the young travelling companions affection for him). Perhaps, as the opening suggests, this is a man who has shied away from intimate contact, whose coldness drove his unhappy late wife into the arms of another and who has approached life solely on his own (egotistic) terms leading to loneliness.\n\nThis is where the allusion to wild strawberries becomes significant as it is the symbol of regeneration: through his inner journey, mixing dream & reality, Borg sees the truth about his life and its emptiness. The film charts his growing intimacy with his daughter-in-law and an eventual inner peace.\n\nThe film sounds typically Scandinavian in its gloom but it is also a celebration of youth as well as a study of mortality and one man's mind. It's also not without comedy, particularly the old Prof's relationship with his housekeeper Agfa and the absurd boxing match about 'God'(Bergman parodying himself) between the two young hitchhikers.\n\nWhat makes the film so intriguing is how characters/situations often reflect one another (Borg & his son, their coldness and attitude to life); these parallels extend to the point where characters even play dual roles: Bibi Andersson as Sara (the lost love & then the young vivacious traveller) and a cruel husband who later appears as the stern examiner in an unsettling dream. It's a highly complex pattern of subtle connections (stream of consciousness)that, as Borg states at the end, forms some sort of logical order. ....................................................................................................................\n\n2021 addition. I recently heard Charles Causley's poem 'Eden Rock' which is about the older poet encountering his parents as he remembers them when young, and they beckon him to cross the drifting stream (the passage between life & death).\n\n'Crossing is not as hard as you might think.\"\n\nI'm not sure I understand all the meanings in this film, but feel the above poem illuminates the final scene of the film, perhaps with the old Professor coming to terms with his life & mortality."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "manjits",
        "review_rating": "10",
        "review_title": "A gem among the history of movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Degree7",
        "review_rating": "6",
        "review_title": "The search for meaning.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "TheLittleSongbird",
        "review_rating": "10",
        "review_title": "Another one of Bergman's best",
        "review_detailed_main": "Ever since I first saw Wild Strawberries, like with The Seventh Seal, Fanny and Alexander and Cries and Whispers, I was blown away by how well made and thought provoking it was(it is one of his more accessible films too). Ingmar Bergman's direction as ever is superb, there is a certain warmth to how he composes and conveys everything. Wild Strawberries looks gorgeous, it is beautifully shot with atmospheric lighting and scenery. It isn't a Bergman film either without memorable images, and Wild Strawberries has those certainly. Some people may find the symbolism of the nightmares with the handless clocks and runaway hearses somewhat overpowering, I didn't think so, I found them very haunting and even fascinating to watch. It is the more beautiful images where Wild Strawberries really drew me in, the memories of the idyllic summers are among Bergman's most beautiful and finest moments. The score fits perfectly, while the script is incredibly thought-provoking, and the story contrasts innocence with the expectancy of youth with bitterness with the regrets of old age very movingly. Victor Sjöström is on magisterial form being both frosty and vain as his character seizes the chance for redemption. Overall, one of Bergman's finest, a wonderful film in all regards. 10/10 Bethany Cox"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "aciessi",
        "review_rating": "7",
        "review_title": "The Sweet Smell of Sorrow",
        "review_detailed_main": "Ingmar Bergman is the quintessential, existential filmmaker. To me, he is the black angel of cinematic death, and please, I mean that in the best way possible. He's most famous for attempting to answer the questions that all of us want answered. What is the meaning of life? What happens when we die? Is there a god? Is there a heaven or a hell? Bergman is always asking these questions in his film, and always, does he find interesting answers and hypothesis formed by these questions. He uses his actors and his framing abilities to help drive home the main idea of these films, and thus, his movies are notoriously not very hard to understand. Most importantly, he has an ability to make us understand the answers, and to help us understand ourselves. Bergman is an introspective filmmaker by definition, and because of that, his films have become so cherished and remembered for being so. In a period slightly before his heyday, no film makes a better example of his unique cinematic mission than \"Wild Strawberries\"\n\n\"Wild Strawberries\" focuses on an elderly professor, Dr. Isak Borg, who lives by himself with his common-law wife in Stockholm. After a lifelong journey of achieving greatness in himself and academia, he has been invited to Lund University to receive an honorary degree. He gets in a car with his daughter-in-law, Marianne, and together they travel to Lund. Through the travel, Isak is haunted by his own thoughts and dreams that have accumulated after years of isolation and reflection. At the not-so-ripe age of 78, Isak want's to understand what led him to this strange point of his life, where he went wrong, and what on Earth will happen next? He is remembered of the place of his childhood, where the wild strawberries grew. A time when he romanced his young, beautiful cousin, Sara, before being stolen from him by his older, arrogant brother Sigfrid. Before going on the trip, he has a vivid, terrible nightmare of being old, as a dead body follows him through a city street and a hearse crashed in front of him, revealing a clone of himself in a casket. Through the ways of the trip, and through the hitchhikers he meets along the way, his mind keeps racing and the dreams of his past and future keep following him. The journey becomes so strenuous and visceral to his memory, that by the time he arrives at his destination, his psyche is entirely cleansed, and he is greeted with the memory of a peaceful fishing trip with his family.\n\nWhat Bergman is doing here is experimenting with time and space, through memory and reflection. His style reminds me of \"Hiroshima Mon-Amour\", considering that there is no clear pattern between what happens in the moment, and what happens in the past. Bergman is giving us a deconstructed narrative that in essence, gives us a clear indication of the kind of crisis that Isak is going through. As a man that has been through everything and nothing, his mind is racing, much like our own, of scenarios that did and didn't happen. This is quite an interesting introspective device that Bergman uses. He is making movies about people, the exact way that we think about each other. Bergman typically uses characters that wrestle with their own identity, and bravely ask questions that might have no answers. Thus, it doesn't take much interpretation of the audience to understand, because all of the questions and answers are presented on screen.\n\n\"Wild Strawberries\" is a very entertaining, beautiful piece to that effect. The entire time, I was haunted, confused, and rightfully engaged with Isak and the characters he meets. My favorite scene of the film is the nightmare at the beginning. The surrealism of this section is frightening and so wonderfully imaginative. I loved the giant eyeglasses that appeared over his head, as well as the dead man with no face that appears to him in the middle of the street. Bergman was really experimenting with some wonderful visual concepts, especially for the 1950's. I thought the acting, was also very real and interesting to watch. Bergman was always known to be a director for actors, and in this film especially, he makes his actors play these characters as real people, not merely as stage personas. What we get because of that is a real, frightening portrayal of an older man, and seeing that alone is fascinating.\n\nIn conclusion, \"Wild Strawberries\" is a dark and interesting classic about the struggle of understanding our fate, and without question, it should regarded as one of the great films of Ingmar Bergman."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "disinterested_spectator",
        "review_rating": "5",
        "review_title": "A Nice Old Man Just Can't Catch a Break",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "blue-7",
        "review_rating": "10",
        "review_title": "Bergman's WILD STRAWBERRIES Stunning on DVD",
        "review_detailed_main": "Ingmar Bergman's WILD STRAWBERRIES, on the Criterion DVD version, is nothing short of stunning. Picture, sound and English Subtitles have never been as fine as seen here. Having viewed this 1957 film during its first U.S. release in 1959, when I was 21 years-old, it was quite involving to return to it 43 years later. Like the Professor of the story, I too often reflect upon choice made along lifes path and wonder what might have been if different choices had been made. Victor Sjostron as Proffesor Isak Borg gives the performance of a life-time! What a magnificent face this man had! Bergman films can be quite dark and depressing, but his THE SEVENTH SEAL and WILD STRAWBERRIES are marvelous, thought-provoking dramas that lift the spirit. BEWARE: There are two other DVD releases, one from Asia and one from Brazil -- but neither of these have been cleaned up like the Criterion version. The sound for instance -- I have seen the dream sequence at the beginning of the film when the Professor walks through empty streets, sees handless clocks, a carriage carrying a casket with his body -- a scene with almost complete silence,BUT prints on 16mm, VHS and even Laser Disc all contain a great deal of surface noise. In the Criterion version, the silence is almost complete. And the picture is perfection -- blacks & whites that sparkle and no film blemishes or dirt-- a picture that is a wonder to behold. Peter Cowie's Commentary is outstanding and very worth while. The 90 Documentary from Swedish Television, INGMAR BERGMAN ON LIFE AND WORK is quite fascinating. Bergman, then in his early 80's, is very articulate and thoughtful in his discussion. Over the years Bergman has come to the conclusion that when we die we are no more -- and he has stated that conclusion gives him great peace. BUT his conversation in this documentary puts a wrinkle in his conclusion. He speaks of his final marriage to a woman for over 20 years and of her passing. He can not believe that SHE does not exist anymore. He often has the feeling that she is near him and that she still influences decisions he makes. He can accept not being for himself but not for her. Bergman is getting closer to the truth then he realizes. . . death is not the end -- but only the beginning. When he finally passes from this early life and finds that he still \"is\" -- I wonder if he'll wish he could change the focus of his later film work. Be that as it may -- WILD STRAWBERRIES and THE SEVENTH SEAL are two of the finest films of the last century -- in my humble opinion."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "VictorFrankenstein",
        "review_rating": "9",
        "review_title": "Excellent Movie from the Master",
        "review_detailed_main": "Grim Drama deals with an old man (Victor Sjostrom) who is on his way to get an honorary doctorate degree after 50 years as a doctor. He is accompanied by his daughter-in-law (Ingrid Thulin). The trip becomes a relicing of the old man's life as he realizes he led an empty life due to his stuffiness , egotism and inability to really love and feel. Nightmares, dreams and reminiscences are expertly blended as space and time are broken to work on the various levels on the man's thoughts.\n\nPicture sometimes talks too much in philosophical asides, but it remains a searching pictorial analysis of a man's life. Expert directorial touches and notations of director Ingmar Bergman, and the dignified miming of oldtime director Sjostrom, plus other fine thespic additions, make this an offbeater. It's a personal and profound work."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jameskinsman",
        "review_rating": "10",
        "review_title": "One of the most beautiful films",
        "review_detailed_main": "Ostensibly simple on first analysis, Wild Strawberries, alongside the work of Bresson, Dreyers Le Passion De Jeanne D'Arc and Murnau's Sunrise, is one of those very special, transcendent assets of cinema able to inspire us in a deep and spiritual way. Bergman's achievement to tell a heartfelt story with a very human message juxtaposed with image after image of stunning beauty is something so rare and so very remarkable. I wont go into a deep analysis of this beautiful masterpiece, as many other users on here have done so. All I will do is simply describe one of the films most lyrically sublime scenes.\n\nNear the end of the film, as Isak Borg lies in bed, his son asks him how his heart is (meaning his physical health). Being a doctor of considerable talent and having a tradition of being practical and sensible in his work, you would expect him to tell his son of his failing health. However after his subsequent journey, both physical and spiritual, his attentions are now turned toward his emotional and spiritual well being, a part of himself he has neglected for many years. He simply replies that his heart is fine, and that he is happy and content. In this single moment, we understand that Isak has reached a moment of catharsis, but it also tells us something about every one of us. We strive constantly for physical wealth and materialistic products of our lives and jobs, but we must remember the simple but extremely rewarding pleasures that determine the happiest of individuals."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "rogierr",
        "review_rating": "",
        "review_title": "Sokrates said it, and a certain Ingmar Bergman too",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "apmahd",
        "review_rating": "10",
        "review_title": "A magnificent film",
        "review_detailed_main": "In \"Smultronstallet\", the elderly professor Isak Borg, on his way to receive an honorary degree, uses the journey to discover and understand himself and the effect he has had on others. The action converts past and present, reality and fantasy, the present harshly and starkly lit, the earlier memories more relaxed and lyrical as if, for an old man, the past - that other country - was better than the time and place he inhabits now. Each new character, each reminiscence as it springs up in the mind of professor reveals something new about him - his failings, his shortcomings, the reasons why, in his apparently successful and honored old age, he is alone and lonely. This is, admittedly, an uneven film, verbally over explicit, but it is packed with vivid imagery - an early dream sequence, both mysterious and yet significant; a disenchanted couple squabbling fiercely in a car; the sad beauty of Marianne, unhappy daughter-in-law; the words, memories and gestures of professor's mother; the distancing effect produced by the device of having the professor visiting his own past unseen by those who shared it with him; the meeting with Akerman. It is a sombre, striking work, uncompromising in its examination of the protagonist and Victor Sjostrom, in his last screen role, is splendid. For me, this film is the proof for to believe Ingmar Bergman the best best European director of the last century."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "vitaleralphlouis",
        "review_rating": "10",
        "review_title": "Quietly spellbinding -- The Best Movie Ever Made",
        "review_detailed_main": "The film summary missed the point altogether. The professor (doctor) made no \"bad choices\" in his life; no, the \"choice\" that cast a shadow on the professor's entire life was Sara's choice in loving the professor's brother and rejecting the professor. Sara was/is the girl He loved, the girl he will always love; with that light taken out of his life everything remaining is coldness; the quiet hell of living life in the absence of love; an infection that effects his wife, his son, but oddly not the people he served as a doctor. As the story progresses, the professor witnesses a much younger Sara and her two rival young men, an exact reflection of his own situation decades ago. As the loneliness generated the coldness in his life, the one radiant light was his quiet and close-guarded memory of the love he had for Sara, and in the final scene we watch the old man view paradise as he looks back on the time when Sara was still with him, with his family at a country get-together. What adds to the emotional wallop is the realization that the old man is Ingmar Bergman's projection of himself some 40 years hence, Bergman, a man loved by many beautiful women, yet he can see (and fear) the devastation which can destroy even a strong person if such person loses the spark of irreplaceable love. Immediately following this movie, I evaluated my own life; resolving drastic action to avoid (if possible) the pitfall Bergman warned us about with this powerful movie."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "rube2424",
        "review_rating": "10",
        "review_title": "One of the Great Films of All Time",
        "review_detailed_main": "I was a junior in college when I came down to NYC for a day and saw WILD STRAWBERRIES in its first run at the Beekman Theater. From that day to today it has been in my top five films of all time and one that I watch over and over again.\n\nEverything works in what I consider to be director Ingmar Bergman's masterpiece. The story is simple, though so loaded with meaning and symbolism that it can be dissected frame by frame. Isak Borg, an old doctor and teacher living in Stockholm, Sweden is to be honored for a lifetime of work, in Lund, a Cathedral town many miles away. After waking from a terrible nightmare in which he envisions his own mortality, Borg decided to drive to Lund, taking his daughter in law, who has been staying with him, as she is estranged from Borg's son Evald, with him. The journey, which takes up the major part of the film, is one of self revelation as Borg slips back and forth in time in his dreams, and faces the stark reality of the cold, impersonal person he has become. Only at the end of his journey, is there redemption.\n\nThe cast is flawless with the luminous Ingrid Thulin as the daughter in law, and Bibi Anderson in a dual role as Sara, the girl Borg wanted to marry and Sara, a hitchhiking youngster, who helps in Borg dealing with understanding his loss. But is famed director Victor Sjostrom as Borg that stays forever in your mind. (Indeed, the second to last close up of him in the film, has to be one of film's all time most memorable moments. In an astounding bit of acting, Sjostrom, like a Swedish Scrooge, turns from an old, icy pedant, into a human being right before our eyes. What a magnificent performance.\n\nThe direction of Ingmar Bergman, the crystal clear black and white photography of Gunnar Fischer and the music by Erik Nordgren meld together into a seamless work of art that stays with you long after the final frame.\n\nIf you have never seen WILD STRAWBERRIES, now is the perfect time as it has been released on a beautiful DVD by Criterion. If you have seen it, watch it again, as you will be amazed at all the new things you find with every viewing.\n\nWILD STRAWBERRIES is a magnificent achievement!!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Thanos_Alfie",
        "review_rating": "7",
        "review_title": "The change of a man...",
        "review_detailed_main": "\"Wild Strawberries\" is a drama movie in which we have a man who was loyal to science and in his carrier for all of his life and he never felt love, passion or some emotions from someone else. Because of his work he will be granted an honorable title and because this ceremony will take place in another city he decides to go by car and not with airplane as he had planned before. And everything will change in this trip.\n\nI really liked this movie because it shows us how a person's way of thinking and even feeling can change due to some facts or incidents that take place. In addition to this we can observe that because of some incidents or because of some people and the conversations that we have with them can change many things to us or we will reconsider some decisions that we had took. Ialso liked this movie because of the plot which I found brilliant. I also believe that the interpretation of Victor Sjöström who played as Dr. Isak Borg was really great and also the interpretation of Ingrid Thulin who played as Marianne Borg was equally good.\n\nFinally I have to say that \"Wild Strawberries\" is a great movie to watch because after watching this movie I am sure that you will start thinking a little bit different. And of course you will reconsider some things that we have as granted and we should not all of us in our lives."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Agent10",
        "review_rating": "10",
        "review_title": "An almost mythical-style film",
        "review_detailed_main": "I watched this film for a class, and virtually everyone groaned over the development. I was the only one with an open mind, and I was thankful for such a condition of spirit. While this film was at times slow, the morphing of different worlds created quite an experience, one which was spiritual and eerie. The dream sequences were amazing, examining the doctor's state of mind through the use of imagery and allegorical conventions. A good film for anyone to experience, and you get to Max von Sydow as a young man."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "PandoraIsALady",
        "review_rating": "7",
        "review_title": "The road called \"life\"",
        "review_detailed_main": "The journey that Bergman takes us on vicariously through Wild Strawberries is a road adventure of past experiences and mistakes. Compared to an American road trip film, where the actual adventure lies in self discovery, Wild Strawberries is quite different—instead Bergman permits us into the memories of an old, egocentric man named Dr. Isak Borg who clings to past emotional attachments and his failures.\n\nIn this film, nostalgia is more or less a \"bittersweet\" experience. Instead of reminiscing about his childhood and his deceased wife, old and weathered Professor Borg analyzes himself and his past choices negatively. Borg's character challenges the stigma \"the older, the wiser\" due to his sterile personality and obviously stubborn disposition—he is emotionally unavailable for the majority of the story. However, in contrast, the film as a whole represents the sad and inevitable changes one endures over a lifetime and is amazingly quite human. The film stands alone as incredibly accessible and simplistic in its meaning and content, a film which truly speaks to the audience about coping with mortality, the significance of life, and the importance of the relationship with your loved ones, friends, family, and ultimately yourself."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mrglenngrant",
        "review_rating": "2",
        "review_title": "Beyond me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Snow Leopard",
        "review_rating": "",
        "review_title": "Thoughtful & Thought-Provoking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "anton-6",
        "review_rating": "10",
        "review_title": "One of the best films ever made!!!",
        "review_detailed_main": "Bergman himself says that he got the idea for this film when he walked in his grandmothers house and suddenly he saw a lot of memories from his own childhood.Just as Orson Welles in \"Citizen Kane\" Victor Sjöström gives an magnificent performance.The superb use of flashbacks and Gunnar Fisher´s cinematography is some of the best I have seen.The film has many masterful dream sequence and I think that it´s one of the best films ever made.5/5"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Xtrordinary",
        "review_rating": "10",
        "review_title": "Wonderful.",
        "review_detailed_main": "I haft to say that I am not normally a huge fan of the \"beautiful\" movies, at top I can get through American Beauty and after that its dead to me. But I saw that this was going to be on the TV that night I thought that I should at least see ONE of Ingmar Bergmans movies since he is, arguably, the best Swedish director ever.\n\nI cried several times during this movie and I was just so touched by how beautiful everything can be or how horrible.\n\nThis is one of those \"Haft to see before you die\" movies according to me so go see it!\n\n(By the way I am Swedish and this isn't like how we normally speak... Even I didn't pick up every single word he he.)"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Tamphex",
        "review_rating": "10",
        "review_title": "Flawless",
        "review_detailed_main": "I could never hope to do justice to this film in writing. I could ramble on and on about it, spouting adjectives like \"warm\", \"funny\", \"honest\", \"chilling\", \"captivating\", \"intelligent\" and \"poignant\", but what would be the point of that? Other, more eloquent reviewers have already said it better than me. I'd just like to say that it's a shame many dismiss Bergman's work as the epitome of pretentious, incomprehensible, depressing foreign cinema for art-house snobs, when it really is anything but. Unlike the stereotypical Bergman film, Smultronstället is all at once terrifyingly honest and beautifully uplifting. The performances by Victor Sjöström, Ingrid Thulin and Gunnar Björnstrand are beyond description, and the script by Bergman himself has to rank among the best ever written. Not to mention the direction, which is by turns spine-tingling and heartbreaking, and the unforgettable cinematography by Gunnar Fischer. Smultronstället manages to combine flawless and impressive technical aspects with an understandable story that is timeless and easy to relate to. No other film does this as well as this one, which is why I don't hesitate to call it the greatest film ever made."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mls4182",
        "review_rating": "10",
        "review_title": "A beautiful masterpiece in every way",
        "review_detailed_main": "I have never been so touched by a film. Beautifully written and filmed. I really can't add much more to the wonderful reviews before me."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "wcook3",
        "review_rating": "8",
        "review_title": "A cold start to a warm ending.",
        "review_detailed_main": "Wild Strawberries\n\nWild Strawberries, written and directed by Ingmar Bergman is an interesting film in the mere fact that it is difficult to predict the conclusion before film's end. Bergman's use of light and dark scenes to create a sense of the character and atmosphere is wonderfully achieved in this outstanding film of the late 1950s.\n\nThe opening scene of the movie provides the viewer an excellent synopsis of Dr. Isak Borg's life and family. The scene acquaints the viewer with his son, mother, house keeper, deceased wife and the doctor himself.\n\nThe first dream by Dr. Borg is dark and puzzling due mainly to its unclear meaning and uncanny nature. The street is deserted and clear. Dr. Borg approaches a clock and looks, but it is without hands. He looks at his pocket watch and it is also without hands. The black and white scene is subdued and calm, but draws the viewer in all the while guessing what's next. The scene is without music and progresses with the sound of a heart beat that quickens with each step taken as he walks along the desolate boulevard. When Dr. Borg approaches a man, the man turns and lacks a face. Shortly after, a cart-drawn casket passes and knocks its wheel off after colliding with a lamp post. The casket falls, opens, and a hand hangs exposed. Dr. Borg approaches the casket preparing to look inside when the hand reaches and clutches his hand. Surprised and frightened, he struggles to free the grip and soon recognizes that the face of the man in the casket is his own.\n\nThe movie was filled with Dr. Borg's puzzling dreams and remembrances of his early life, but much of the charm and warmth that is contained throughout the movie is owed to the secondary characters. Dr. Borg's daughter-in-law, Marianne is a delight to watch because she can smile like an angle and can be bluntly frank, all at the same time. Her stunning classic looks and assured mannerism helps the movie in a great way. Agda has lived with the doctor as his housekeeper for forty years. She and Dr. Borg hysterically argues as if man and wife. She knows the doctor well and understands him like the other people in his life do not. Sara, the young girl who wakes the doctor as he lay near the wild strawberries is a joy to watch. She shows the doctor new ways to look at the world by not taking anything too seriously. She takes in all that life has to offer and brings out the joy. Her slight touch to the doctor's face while they drove is one of the warmest scenes in the film and defines her loving character. There are many warm moments in the film, and many moments of darkness. The beginning of the film was dark, puzzling, and melancholy, and the end of the film was warm, bright and full of life and tenderness. The movie brought to mind, Charles Dickens' Scrooge, from A Christmas Carol. Although Professor Borg was not nearly as cold and unpleasant as Mr. Scrooge, he did however isolate and distance himself from his wife, friends, and family. His cruelty was hidden by his charm, but affected people quite similar to Mr. Scrooge's nasty mannerisms. On several occasions, in dreams and reality, Dr. Borg had to endure scrutiny from family members about his coldness. While driving to Lund, Marianne charmingly reminded him of his lack of warmth, love, and understanding and how she only knows him as a father-in-law. Marianne also lets on to Dr. Borg that his own son hates him; words that rang in the doctor's head. The doctor's dreams pointed out to him how he isolated the important parts of life and the people who cared for him. During one of Dr. Borg's dreams, he was taken by a teacher to see his dead wife. She was in a grassy field where she was making love to another man. Afterwards, she sat there talking to the man about her husband not caring, not giving her the attention she needed and how he would dismiss the entire event as his fault, but she says he does not mean any of it, because \"he is cold as ice.\" Dr. Borg also became puzzled by a pocket watch that once belonged to his father. His mother showed him the watch and had wanted to give it to her grandson. The watch was missing the hands, just as the one in his dream. Throughout the movie, Dr. Borg let more and more of his old ways die and by the end of the day he was beginning to live and be happy. The crabby old coot that emerged at the beginning of the movie, softened and begin to see how happy he could be if he allowed himself. The Drive with the good people that Dr. Borg was fortunate to have accompany him, allowed him to experience the love and joy of others."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "PKC",
        "review_rating": "9",
        "review_title": "A Life in Isolation",
        "review_detailed_main": "A successful, respected doctor and professor near the end of his life looks back on it with regret and nostalgia. Bergman uses dreams and allegorical images and characters to illustrate his idea that the greatest waste of a life is to live it isolation.\n\nWild Strawberries is also light and humorous in places, with a gentle and loving depiction of the doctor's family in his youth (though I think it's important that we never see the doctor interacting with his past family until the very end). He is ultimately redeemed, and Bergman is stating, I think, that there is hope for us to change even until the very end of our lives, and that such change is worth undertaking.\n\nOne of the great strengths of this movie, and of Bergman's work in general, is that he creates characters who function successfully as both \"types\" -- embodiments of ideas, philosophies, or points of view -- and also as credible individuals in a narrative about whom we care. That's difficult to do."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "grandisdavid",
        "review_rating": "6",
        "review_title": "Very good but overrated",
        "review_detailed_main": "I just started a complete Bergman cycle as I hadn't seen any of his movies and was quite ashamed of it! This is my third one, I saw Sawdust & Tinsel and the Seventh Seal yesterday. Seventh Seal was very profound and original, although I was disappointed by the quality of the Black&White photography. I still graded it much higher than wild strawberries.\n\nHere, the acting is excellent, the directing is unsurprisingly excellent too. The storyline is very profound so are the dialogs and before all there's grace. Although the soundtrack is disappointing and the photography still doesn't deserve any awe.\n\nI was interested by this story of an old man looking back at his life; some people compared it to About Schmidt, on a similar subject it's true, but not as profound. An equally profound movie on this subject that I think is superior (despite some slow and long passages) is ETERNITY AND A DAY by Theo Angelopoulos. Bruno Ganz moves me much more than Sjostrom and the symbols all along make the dreams more subtle. The photography is better and the discreet soundtrack accompanies magnificently the pictures.\n\nIn conclusion, wild Strawberries is a very good movie but we may have done better since and it seems to me that it's a little bit overrated."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Chaves7777",
        "review_rating": "10",
        "review_title": "So, what you think? ... is God exist?",
        "review_detailed_main": "Before \"Smultronstället\", i have never seen a movie of Ingmar Bergman. I always heard him. But not more. Then i heard about \"Smultronstället\" so, i rent it. I don't know that it was one of the most beautiful films about life that i have ever seen.\n\n\"Smultronstället\" told us the analizations of past of an old doctor. He is going to receive an award for 50 years of work. He travel with the wife of his son. In the road, they begin a travel of feelings and remembers, where the dreams of this old doctor are important characters. \"Smultronstället\" is a masterpiece because makes you feel a warm air. Because is an exploration of your soul and the human been past. No matter if you are old or you are young,. That is the thing that makes so important \"Smultronstället\". This film relation all ages and mixed in an awesome retrospective of life. Every fact of the life of this doctor is represented in each of one person that appears in the road of his life. All the characters have a meaning that represents the past (love, family, career) of this old doctor. At the same time it makes you realize about the truly important facts in life, and this makes it talks in an universal language.\n\nI love \"Smultronstället\" because is a perfect movie. Is cozy, meanful, understandable and nice. And here is my question... Why don't do movies like this anymore? *Sorry for the mistakes... well, if there any."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "onepotato2",
        "review_rating": "6",
        "review_title": "I used to be able to watch this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "in1984",
        "review_rating": "3",
        "review_title": "Old Man on a Boring Road Trip",
        "review_detailed_main": "Old professors on road trips, no matter how many fully dressed blonds you add, will probably never provide much wildness or strawberries, especially if they spend more time with them dreaming as they snooze during the trip then take in the landscape and people. Ingmar definitely failed despite apparently the entire country of Sweden voting to the contrary for their film hero.\n\nHe hints that he may be attempting irony, but that really doesn't work outside of a few instances where the actors pull it off.\n\nOne way the irony could have worked is if the film is understood more like Robot and Frank involving an old man nearing death with a failing brain. It might be seen as an allegory in why making plans based on a dream you have the night before is unlikely to add wildness or strawberries to your day.\n\nThe film seems more like that of a young, naive director playing with university ideas and quite possibly trying to antagonize a professor he hated, or simply fool him into grading the film highly by not committing to anything and leaving it open for interpretation.\n\nAt best, it's an interesting look into the Summer conventions and traditions of Sweden in the 1950s where pipe smoking is viewed as healthy and marrying cousins is normal. All this can be better achieved through some clips of the film, an actual documentary, and some photo essays. You'll also have the benefit of knowing it rather than wondering if you're lost in somebody's bad dreams."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "rainking_es",
        "review_rating": "8",
        "review_title": "100% Bergman",
        "review_detailed_main": "An old professor goes to the University in which we teach, they're gonna honor him after 50 years teaching. During the journey this old man that's kind and cold, generous and unable to express any feelings, he'll get into some dreaming that will make him face some ghosts of the past.\n\nReflections about life and death, about the youth and its holy innocence.\n\nAs you may know Bergman's movies are not for any kind of audiences, if you0're gonna watch \"Wild strawberries\" you have to know what you're getting in to. There are many people that thinks that in Ingmar Bergman's stories never happens anything\u0085 poor devils.\n\n*My rate: 8/10"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "eibon09",
        "review_rating": "",
        "review_title": "One of My Favorite Bergman Pics",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Hitchcoc",
        "review_rating": "10",
        "review_title": "A Film About Redemption",
        "review_detailed_main": "About thirty years ago I was totally into art films. I went to college film festivals and art theaters. It was an experience. Unfortunately, I was a little too wet behind the ears to have the proper appreciation. I am now retracing my steps and watching these films again, and now I'm seeing why they've withstood the test of time. This is a tremendous film with so much humanity and so much sadness. It's about all of us who have lived out lives a bit thoughtlessly. I think of Kurosawa's \"Ikiru\" as an example of the ultimate in that category. The good doctor has all he can do to make his way to receive an honorary degree. He brings along his daughter-in-law who really doesn't like him mostly because of what he has done to make his son a cynical, harsh man. He has been beset by dreams with faceless men and handless clocks, where time stands still. He is terrified. As we go along we realize that time often does heal and when we repress what really bothers, we flatten out the rough edges. On the long drive, human beings do what they often do. They begin to forgive and understand. If the doctor is an old inflexible being, it becomes obvious that he has had enough when his daughter-in-law levels with him. He begins to draw up his past for review. He sees that his basic sterility was as destructive as if he had been cruel.\n\nThe deciding factor is a group of kids going to Italy. The travelers pick them up and their infectious youth begins to come to the fore. They begin to offer new insights to the two unhappy people.\n\nThere is so much in this movie that I can't begin to tell all here. Let the real critics do that, but this is ultimately about how we need to forgive and forget and let life into us. There are some wonderful religious arguments that are, thankfully, never resolved. Everyone is put to the test and the movie teaches us some valuable lessons."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "MovieAddict2016",
        "review_rating": "10",
        "review_title": "A beautiful, moving masterpiece - Bergman's best",
        "review_detailed_main": "The Swedish Professor Isak Borg (Victor Sjöström) embarks on a journey to Lund in order to receive an award for lifelong achievement in the medical field. After his house maid refuses to go with him (\"We're not married!\") he finds his daughter-in-law (Bibi Andersson) inviting herself along. Little does he know that she holds a great contempt for her father-in-law and is only accompanying him as a way of easily confronting him and expressing her true feelings.\n\nPainfully wounded by the prospect of his own daughter-in-law hating him, Borg begins to reflect upon his life in a series of visions, flashbacks and hazy dream sequences.\n\nThis is my favorite Ingmar Bergman film. Although it's a close call, I'd say this is his overall best movie and is wonderfully, beautifully shot. It's tasteful, just the right running length (short enough not to contain any unnecessary scenes and long enough to feel satisfied when it's over).\n\nThe point here -- underneath all the layers -- is that we don't have a very long time on earth, and we should make the most out of it. Borg realizes as a frail old man that he has ruined his own life and has no happy memories.\n\nIt is Bergman's \"Citizen Kane\" or \"Ikiru\" -- a poignant reflection on humanity and a film that, ultimately, can change the way you look at life -- if you open up enough to let it."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "petter_olsen99",
        "review_rating": "10",
        "review_title": "Why bother getting up in the morning?",
        "review_detailed_main": "A surefire cure for the blues (works for me anyway, I need to see this film once a year or so). One of the few Bergman films that are positive and life-affirming. Easily in my top three list of all time favourites."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Quinoa1984",
        "review_rating": "9",
        "review_title": "Great. And yet Bergman made greater",
        "review_detailed_main": "The dream sequences will have chills running down your spine without a doubt, and is where Wild Strawberries excels and shows Bergman pushing ground.\n\nAnd having said that I can say this might be (on first watch) a slightlu over-rated picture. Of course there is much to look for, admire, and saturate with his tale of an old professor/doctor on his way to get a degree who looks back on his life, but the road trip scenes, while somewhat fascinating, can't hold a candle to the work that is displayed in the first dream. We see clocks with no hands (no time left for the old timer), a man with a very tightened face, and a coffin that falls right in front of the old man with himself inside of it, reflecting him. That this is one of Bergman's most evocative and powerful scenes goes to show why the film is so praised, and with the other dreams we see much insight into his fears and doubts on his life and what it's meant. But a number of the scenes go nowhere or ponder on events that slow the film down. Wild Strawberries is a film that can be judged as a display of perfect sorrow or longish observation, you decide. Plenty of beautiful outdoor scenery shots though; Max Von Sydow has a cameo as a gas station attendant. Grade: A."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "robbiedarkko",
        "review_rating": "9",
        "review_title": "Where the heart is...",
        "review_detailed_main": "An elderly Professor of Medicine is due to collect a lifetime achievement award at Lund University in Sweden. The night before, he has a wicked dream - laced with typical Bergman symbolism. He awakes early - partly perturbed, partly bemused - and decides to take a long, scenic route to the University, in his car, bypassing places of his youth.\n\nHis daughter-in-law joins him for a lift and they set off by themselves, leaving his long serving housekeeper somewhat agitated. Along the way, they come into contact with different types of people, stopping at times for a rest. The Professor falls asleep on more than one occasion, and it is during his dreams - which unlike the one at the start of the film, now seem to be retracted memories - that he begins to chip away at the ice cover around his heart.\n\nThe end may come rather suddenly for some, but if you have been feeling the gist of the story as it has progressed this likely will not be the case.\n\nAnother thing which some people may not like is the black and white photography. Those people would be wise to still give this film a chance - mainly because of the way Bergman can handle this particular medium: there is none of the stuffiness or atmospheric smothering that misuse of black and white brings; the sky does look bright, the youth's skin does look full of youthfulness.\n\nKeep in mind this is not a film that overbears it's message; concentrate on it from start to finish and you may just learn something of yourself."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "avidnewbie",
        "review_rating": "7",
        "review_title": "Meticulous and Languid",
        "review_detailed_main": "I begin this review with an acknowledgement that viewing this film 56 years after it's initial debut has diminished it's impact for me. Some of the techniques, both in story telling and in visual stimuli are very dated. Although I can appreciate the care and attention to detail utilized in the making of the film it does not deliver anything that I have not seen before. Mostly it conveys a familiar message in an time and tradition that may have been ground breaking in it's day but is not now. The photography is beautiful. The characters are not singular in their originality or their behavior. I recognize many of the actors from other Bergman films such as the Magician, The Seventh Seal and the Virgin Spring. This is a nice little movie about an old man reflecting on his past on an important date in his life. Good but not necessarily a classic. Classic in the sense that it is from a classic era of film making and by a heralded director no less but it does not reside in my top 100 movies of all time. Perhaps that opinion is a byproduct of my era? Perhaps it's not. There are other films made before this one that I regard much more highly. Gone with the wind, Double Indemnity, Spellbound, Casablanca, Citizen Kane, Sunrise, Pride of the Yankees, Key Largo and 12 Angry Men are all old films yet they suit my sensibilities better."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "erratic1983",
        "review_rating": "10",
        "review_title": "A film that urges us to concern ourselves with what really counts; our personal wild strawberries",
        "review_detailed_main": "If you stay in a distance, you won't get any connection. If you don't give love, you won't get any. You won't be happy, for sure. You won't have a clue about the meaning of life, the real essence of it- the WILD STRAWBERRIES of YOUR life. To comprehend this last phrase, you will have to think of the wild strawberries as they stand in the Scandinavian countries (where this movie comes from). They are pretty rare to find. If and when you find them, they won't even put out your hunger (as any other food, easily found in your refrigerator would accomplish). You don't really need them. But that's the whole point, the true value they carry.\n\nThe film begins with Isak Borg making a trip to another town to get an award for his great achievements as a doctor. But, unexpectedly, this journey will be of a very different nature. He will pass from known places that will wake up memories well hidden in the unconscious, places which will take care for the development of this nature. He will meet personas who will play a part in this. He will go through situations that will ring a revealing bell of truth, they will be a strong reality check... for him and the audience...\n\nIngmar Bergman, with his flawless masterpiece, presents to us the meaning of life in something like 90 minutes. Many films, especially in the '00s, have tried to walk through this path, but we easily reach the conclusion that they have achieved very little as we watch wild strawberries. In the same time, Bergman gives us a punch in the face. It's a painful procedure; to see what really counts and then realise you haven't valued it as you should all the previous years of your life until this moment of realisation. That you have not given it the time and space that fits to it, that you have spent your time and emotional space (the only things that really belong to you in this world) in other unimportant matters (like arguing about the existence of god ;-) ).\n\nBergman's \"wild strawberries\" have a sublime flavor and during their digestion comes real personal valuation and change. I have seen hundreds of movies, but this is the one I always looked for. Thank you mr. Bergman.\n\n10 out of 10"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "SnoopyStyle",
        "review_rating": "7",
        "review_title": "interesting Film",
        "review_detailed_main": "Dr. Isak Borg is 78 and getting a honorary degree. He sets out on a long car ride from Stockholm to Lund. He is joined by his pregnant daughter-in-law Marianne who doesn't like his harden coldness. She is planning to separate from his only son Evald. He has various dreams and nightmares which bring his past to life.\n\nIngmar Bergman dives into an old man's re-evaluation of his life. This is definitely more art film than popcorn movie. It has some great sections although it is possible something that isn't compelling to me right now. Isak's cold distance does put me at arm's length. He's not a particularly fun character for me to follow but it is interesting."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "iquine",
        "review_rating": "4",
        "review_title": "Subtle Reflections",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "my favorite film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mirzahat",
        "review_rating": "10",
        "review_title": "Needs to be watched over and over again",
        "review_detailed_main": "This movie is simply universally great, just because it deals with life's extremely important questions: How to deal with disappointments in life? How to overcome them? How to find beauty in every day? How to fill the inner emptiness? It reminds us that the family should always be a major factor in our lives and if create distance to the family, our lives will get cold. It is the mastery of Bergman who brings this questions to life, to visualize the fears of the protagonist. Even the old professor, who lived his live in emotional isolation seems to find his peace by exploring the memories about his family and resolving existing conflicts. Well I always thought that memories will vanish like \"tears in rain\", but no, since this movie I know that my memories about my family are there to bring me peace and joy. Simply a great movie and must see for everyone."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Nigel_Tufnel",
        "review_rating": "10",
        "review_title": "Brilliant piece of filmmaking detailing a man's disappointments.",
        "review_detailed_main": "Smultronstallet or Wild Strawberries, by Swedish director Ingmar Bergman, is one of the greatest films ever. Its cinematography, screenplay, acting, and directing are superb. This motion picture is amazing in its emotional impact and in my opinion is better than Bergman's other masterwork, The Seventh Seal. I say this because although Seventh Seal's plot is more ominous and the ending is a little more well done, Wild Strawberries could actually make you change your outlook on life. Great films do this. Just look at \"One Flew over the Cuckoo's Nest\", \"The Deer Hunter\", \"Platoon\", \"Natural Born Killers\", and \"JFK\", among others. Overall, a fantastic film that deserves many viewings and more attention than bloated American Hollywood blockbusters.\n\n4/4 stars"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "iamkilgoretrout",
        "review_rating": "9",
        "review_title": "One of Bergman's finest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Kagegroo",
        "review_rating": "10",
        "review_title": "Pure Movie Magic",
        "review_detailed_main": "A High for me, this movie blew me completely away. Ingmar Bergman creates a real nightmare in this movie, kind of funny but i had a similar nightmare few years ago a it's so scary and surreal. Movie is from Sweden and naturally people in it talk in Swedish so it's subtitles but must be very well done the translating because every word seems to fit perfectly and every scene also fits perfect to the story. They don't make them like these anymore is something i was sure i would never say, but i have never seen anything like this before or after there is something Mr Bergman put in this movie thats makes it this special. The cast here is wonderful Bibi Anderson as Sara is a thing of beauty and as a nice plus her acting here is good, The old professor is acted by Victor Sjöström and what a great performance bravo i say. funny but i have only seen good films from Sweden o know they must have made some bad ones but i will hunt down all of Ingmar Bergman i watch them. I recommended the Criterion version cause Criterion equals quality."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "sol-",
        "review_rating": "8",
        "review_title": "My brief review of the film",
        "review_detailed_main": "A metaphoric road film full of symbolism, this film has gained the status as one of Ingmar Bergman's best films. It is uneven, with gaps between the most spectacular and meaningful sequences, however the film certainly has enough in it to rate as a great film. Victor Sjöström is excellent as the old man reflecting on his past and trying to sort out his emotions, and the camera-work is simply beautiful. The (too few) nightmarish dream segments are very well done: surreal and quite frightening to a degree. The film pushes the boundaries with some aspects though, such as how the protagonist is able to remember events that he never witnessed himself, and a time factor that can only be discussed in light of events that happen towards the end of the film. There a small number of things that one can quibble about here, but the overall film stands up strong. It is relatively pleasant, quite well acted, and the bits that are done well are done very well."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "newday98074",
        "review_rating": "10",
        "review_title": "A Favorite",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ArmandoManuelPereira",
        "review_rating": "7",
        "review_title": "At First Drab, Then Progressively More Interesting And Profound.",
        "review_detailed_main": "For the first 30 or 40 minutes I was inclined to dis-like what I was watching. It seemed to me just a load of drab existentialism. Then at some point I started to make out the thread, and its progression, and it became interesting, and profound even. Then just at the point where it could have been ruined, it ended satisfyingly, and with a sense of optimisim, which warmed my heart."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Bunuel1976",
        "review_rating": "10",
        "review_title": "WILD STRAWBERRIES (Ingmar Bergman, 1957) ****",
        "review_detailed_main": "This is still one of Bergman’s finest and, actually, it seems to me that the film improves with each viewing. It was certainly an inspired choice to cast elderly ex-director Victor Sjostrom in the lead, while the main female roles are filled by the luscious Ingrid Thulin (here in one of her best showcases) and a radiant Bibi Andersson (in two roles no less, both named Sara!). Other important members of Bergman’s stock company of actors appear in bit-parts: even Gunnar Bjornstrand in the pivotal role of Sjostrom’s son and Thulin’s husband is only in a couple of scenes; a blonde Gunnel Lindblom plays Andersson’s sister (during Sjostrom’s recollections); and, most incongruously, Max von Sydow turns up as a gas-station owner grateful to doctor Sjostrom for services rendered in the past!\n\nWILD STRAWBERRIES also features two of cinema’s most unforgettable dream sequences – Sjostrom’s character meeting his own corpse while walking a deserted city street and, later, his humiliating exam for a doctor’s degree (by and in front of the people he met during the day’s journey on the way to picking up an award for his distinguished career). The film presents a simple but eventful, episodic narrative that is brimming with reflections and insights about family, love and duty; invariably, these have marked the personality of the protagonist (rendered somewhat cold by regrets and disappointments) and now lead to either reconciliation or resignation on his part with his earlier life – it’s as if Bergman was doing his own version of “A Christmas Carol”!\n\nAs usual, spirituality (the eternal debate on the existence of God) is touched upon here via semi-humorous incidents – a bickering middle-aged couple and two young students (both in love with the second character played by Andersson) who determine to settle the argument with a fistfight! By the way, in earlier viewings of WILD STRAWBERRIES, I used to resent Bergman’s rather contemptuous depiction of the twins (being one myself, I can attest to the fact that such siblings don’t speak in unison as depicted here – though it happens on occasion, for instance, that my brother and I discover to have shared parallel thoughts!); thankfully, however, the two characters’ participation in the film doesn’t last for very long."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "crculver",
        "review_rating": "7",
        "review_title": "Victor Sjostrom, major figure of early European cinema, gives the performance of his career in old age as a man haunted by the past",
        "review_detailed_main": "The actor, screenwriter and director Victor Sjöstrom was a major figure in the silent film of the early 20th century. Decades later, when film had long since transitioned to talkies and Sjöstrom had disappeared from the scene, focusing instead on theatre, Ingmar Bergman called him back for the 1957 effort WILD STRAWBERRIES. And instead of trying to evoke the great achievements of Sjöstrom's younger days, Bergman let this now 78-year-old man depict with no holds barred what old age and the thought of imminent death are really like.\n\nAs the film opens, we are introduced to Professor Isak Borg (Sjöstrom), who started out as a provincial doctor but made some new medical discoveries and established a shining career in academia. Borg must travel to the distant Swedish city of Lund to accept an honorary degree from the university there, and he decides to drive the whole distance. He is accompanied by his daughter-in-law Marianne (Ingrid Thulin), who had been staying with him after a row with Borg's son Evald, and who eventually takes the wheel for the old man. Along the way they pick up three young hitchhikers, and later they get into a fender-bender with an unhappy married couple.\n\nInitially Borg's housekeeper and Marianne are puzzled that the elderly professor wants to drive all that way, but we soon discover that the route passes some places from Borg's younger days. Flashbacks that are shown during stops, and the professor's own dreams as he doses off, reveal feelings of regret and guilt that the old man had been harbouring all his life. The three hitchhikers in the bloom of youth remind Borg even more sharply of his elderly state, and the married couple only serves as a reminder of his own unhappy family life. He is tormented by the thought that he has little time left to set things right with those close to him that he had alienated years, even decades, before.\n\nWILD STRAWBERRIES is very touching, and it is one of those films where the main character is played in such a great bit of acting that all the other details hardly matter. Still, the supporting roles are memorable. Bibi Andersson plays two roles that are worlds apart. In one, Andersson is the main hitchhiker character, a sort of liberated woman and tomboy. The other role is Borg's early love interest, a woman reflective of upper-class society in early 20th-century Sweden with all its strict ideas about proper female behaviour. Other longtime members of Bergman's stable appear: Max von Sydow as a rural petrol station attendant, and Gunnar Björnstrand as Borg's son that takes all too after the old man.\n\nIn spite of the film's strengths, I must admit that WILD STRAWBERRIES is not among my favourite Bergman efforts. It seems especially flawed by one subplot: among the hitchhikers that Borg takes, two of them are always squabbling about whether God exists. I find this bears very little relationship with the protagonist's dilemma (Borg himself doesn't muse on what they say), and instead it's like Bergman was trying to shoehorn in the religious themes of his other major films of this era, such as THE SEVENTH SEAL. Still, even what I feel to be lesser Bergman is still great cinema, and I imagine most viewers will enjoy this poignant tale."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Kdosda_Hegen",
        "review_rating": "2",
        "review_title": "Simple concept, simple execution - one of the most boring films ever.",
        "review_detailed_main": "It's just a film about a man who keeps remembering his past and fidns emptiness everythere. Boring, meaningless crap."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "postmanwhoalwaysringstwice",
        "review_rating": "",
        "review_title": "Important and Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "book_diva",
        "review_rating": "10",
        "review_title": "Such a well-done movie...I encourage you to see it...twice!",
        "review_detailed_main": "The dream sequences in this black and white movie are very jarring...Contrast them with the old Doctor's remembered past and his journey through the present: you are taken on a poignant ride through loneliness to a fulfilling conclusion. All the actors are charming in their own ways and the film is bursting with nuances and beautifully-shot scenes. Bergman's film is a classic...timeless."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "bejomin",
        "review_rating": "10",
        "review_title": "A masterpiece of film.",
        "review_detailed_main": "Ingmar Bergman is, upon review, often-times seen as a master of portrayal of the human condition. In this instance, it must be said, that I cannot agree more.\n\nIf one is perceptive enough to appreciate cinematographic endeavour older than thirty years (i.e. in monochrome and/or with subtitles) then this film is definitely worth viewing - the sheer subtlety of portrayal of human emotion in breath-taking. In short, please watch this film if you are prepared for an almost tearful recollection of the human condition, as observed by a character who has observed 70 years of life and it's cruelties."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "abscissa1",
        "review_rating": "9",
        "review_title": "Bergman Speaks to the Big Questions",
        "review_detailed_main": "Although I do not agree that this film presents \"renewed belief in mankind,\" it is certainly a dramatic epic that consoles a lonely spirit. I prefer this to Bergman's Seventh Seal (1957), because for me the images and themes are more immediate and relevant. From the Freudian to the postmodern, you will find it in this film. It is not a cute pseudo intellectual movie that rewards with cheap plot twists and predictable fates, but rather a deep and intense journey into the soul of a man with a cold and dark heart. For the aging, for the lonely, for the misguided, this film is confrontational in its challenges to our beliefs of time, social relationships, and ethics."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "alvaro-veloso",
        "review_rating": "9",
        "review_title": "i've never seen such hard dialogs, such hard film",
        "review_detailed_main": "During the first scene of \"Wild Strawberries,\" I didn't think I'd be able to get through it -- the Swedish was so alien to me it sounded almost comical; it seemed as if every word ended with an \"eer\" sound. But quickly the beautiful black and white photography caught my eye and I was drawn into Isak Borg's story, or rather, his self-examination.\n\nThe progression of the film is fantastic. Early in the film, Isak has an apparition within a dream and the small events leading up to it, within the dream, are quite brilliant. Throughout the rest of the film there are dreams and recollections; newly discovered secrets of the past that Isak sees for the first time. As he says in the film, \"Dreams, as if I must tell myself something I won't listen to when I'm awake.\" How Bergman shows us the characters is terrific. It's a like a relaxed puzzle that doesn't emphasize any sort of urgency to figure things out. The story unfolds beautifully as we get a deeper sense of Isak, who I assume is an alter ago of Ingmar Bergman at that stage of his life (he was thirty-nine when the film was released).\n\nIt pains me to know that the majority of people my age would rather watch an Adam Sandler movie or \"The Rock\" than something like this. Hey, I liked \"Big Daddy\" and I love Nicolas Cage, but \"Wild Strawberries\" is one of the few films I've seen that could possibly change the way I live my life. I'm always interested in listening to what aged people have to say about their own life because, well, it can only give me tips about my own, and that's what this film does in a way.\n\nThere is one sequence in the film that is frightening and \"arty,\" and I don't completely grasp what it means beyond Isak's deterioration and his realization of how people actually feel towards him (he's told earlier in the film as well, but he seems to accept this \"verdict\" more readily), but it doesn't take away from the film; rather, it's an interesting addition to an otherwise satisfying experience. In fact, it's probably the most vital part of the movie -- Isak may not like it, bbut once he gets past it, he has the option to develop.\n\nI don't know if the film is a masterpiece -- it's my introduction to Bergman, so once I see \"Cries and Whispers,\" \"Fanny and Alexander,\" \"Persona\" and \"The Seventh Seal\" (if I can get through it, this time) I'll come back to this film with a new perspective, or at least see it as a part of Bergman's whole. I do think this is a great film of its type. It's the kind of film that may require viewings every five or so years, as a sort of reminder.\n\nPauline Kael once said that she didn't think much of Bergman because she'd done her share of soul-wrestling and it wasn't that difficult. The film isn't as challenging as I was expecting it to be, in fact, it's a walk in the park. It's pleasant and rich and beautiful, and the title seems perfect after you've seen the film. It's all about wild strawberries."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "pere-25366",
        "review_rating": "10",
        "review_title": "Spellbinding and a viscerally stimulating piece of art by Bergman",
        "review_detailed_main": "\"Wild Strawberries\", or Smultronstället (the original title), was one of two absolute gems Ingmar Bergman wrote in 1957, the other being The Seventh Seal. In both films, we witness the journey of a disillusioned man in pursuit of life satisfaction, an explanation to their existence. We are then introduced to a series of flashbacks, which will reveal a great deal about how they have been shaped into who they have become.\n\nThe story is of aging professor Dr. Isak Borg and his feelings of remorse near the end of his life compelling him to seek out answers or at least some type of meaning. \"I hate resentful people\" he ironically mutters, though we are given the brief impression that it is all people he despises. As he travels to Lund with his disarmingly candid daughter-in-law, Marianne, to accept an honorary degree, he will encounter both people and places that will elicit memories, both the good and the bad, of his past, as we watch his feelings of melancholy gradually morph into the affirmation of life of which he was always searching for.\n\nSo much of \"Wild Strawberries\" is, at its core, extraordinarily nuanced, with each new experience revealing another layer of our grouchy protagonist. \"The place where wild strawberries grow\", he gaily reminisces about at the film's beginning. I like to believe that, like 'Rosebud' in Citizen Kane, the wild strawberries serve as an emblem of the innocence in our youth, a memory that evokes hope and sheer joy, parts of life that many people will, as they grow older, seek to regain in some form or another.\n\nThis film had me in a complete lost for words. It is able to connect with you on such an emotional, profoundly deep level beyond explanation. The cinematography is done with such care, with each detail almost emerging with a consciousness of its own. There is so much life in every frame, whether it being in the forest, the wild strawberry field. The acting and direction is subtle and true-to-life, as we feel that we are witnessing the telling of a genuine life story rather than observing a film. It is, in simplest terms, pure cinematic art."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "thomasranum",
        "review_rating": "9",
        "review_title": "a great movie",
        "review_detailed_main": "This movie is great and I suggest that everyone to see it. anyone who gives this movie a bad rating probably did not understand it for what it is worth and the probably do not appreciate a good artistic movie. Bergman is great and this is his best movie in my opinion maybe besides the seventh seal. (well those are the only two Bergman films I have seen but Wild Strawberries in my opinion is better than the seventh seal.) The movie is very artistic and the dialog is very good. It is too bad that movies like this are not made anymore then again I don't know if any other director would have the ability to create movies like Bergman ever again."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Vartiainen",
        "review_rating": "6",
        "review_title": "Bah Humbug",
        "review_detailed_main": "There are certain themes that connect Ingmar Bergman's films together, despite them being so dissimilar with one another in terms of story and subject matters. He goes from a medieval knight to a psychological thriller about two women in a beach cabin. From a period costume drama to a road trip movie about a professor yearning for the days of his youth. That last one being Wild Strawberries in a nutshell.\n\nYet all these films have a distinguishing cinematography and style uniquely Bergman. They're also thematically similar. You can see thoughts about death, mortality, the meaning of life and the existence of self in all of them. This film focuses most heavily on the meaning of life. How much are we shaped by our youth, how much weight the individual aspects of our life have, what is the proper balance between the sentimentality of relationships and the responsibilities of career.\n\nAnd so on, and so on. It's probably the most thoughtful film I've yet seen from Bergman. Also the most prone to symbolism and art tropes. Usually I'm against those, unless done really well, but with Bergman they are, more often than not, and he's also really blatant and honest with them. He wants you to notice all the little tricks and touches, instead of hiding them in the background for only true cinephiles to find and appreciate.\n\nWild Strawberries is worth a watch if you've liked other Bergman film - especially The Seventh Seal - and/or if you like a film with a lot of panache when it comes to the art of making films. It bears some resembles to the Christmas Carol on a story-level, without being a Christmas movie at all, so if you're interested in that, you might want to check it out as well."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "lasttimeisaw",
        "review_rating": "9",
        "review_title": "Wild Strawberries- Last movie you want to see before you dead.",
        "review_detailed_main": "The famous \"Wild Strawberries\", Ingmar Bergman's masterpiece, so glad to watch it finally! An old professor, had a strange dream, in which he saw a faceless dead man and a clock without pointers. The metaphor of the dream made him look back into his nearly 80 -year-old life.\n\nHis selfishness and apartness hurt a lot of people around him, he lost his first love to his cousin because his passive personality though he loved her so much. His relationship with his mother is tolerable because they are so alike, he inherited the apathy from his mother and passed it to his own son, a lamentable biological heredity.\n\nWhen the professor decided to receive an award for him, he drove to the ceremony with his daughter-in-law who had just disputed with her husband about the unborn baby. On their way they met different people, the professor recalled the memories of his youth, and found the true meaning of life, death, love, hurt etc...\n\nLife goes on, the inertia drives us to neglect who we're, we may lose, regret and hesitate to a lot of things, among which are treasure, some we could have seized at that moment but the inertia inside deterred us. How can we see ourselves clear and transparent? We're not god so maybe we can't, so at least we can do as much as possible to be near it.\n\nThis film contains too much things about what a man could learn, so it needs to be re-watched many times. The subtle feeling, complex thoughts, vulnerable emotions and meaningful words can truly touch the deepest part of my heart."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "bandw",
        "review_rating": "7",
        "review_title": "Bergman lite",
        "review_detailed_main": "I came to this movie after having watched several of Bergman's others; \"The Seventh Seal,\" \"Through a Glass Darkly,\" \"The Silence,\" and \"Winter Light,\" among others. I always had to be in the mood for one of those emotionally draining experiences, so, in a suitably heavy mindset I watched \"Wild Strawberries.\" Many of the Bergman themes are present: lost love, loneliness, marital and family dysfunction, God versus science, anxiety, isolation, and fear of death. However, the touch seemed lighter than expected, provoking only a wistful melancholy.\n\nThe storyline is simple, being that of 78 year old Professor Isak Borg (Victor Sjöström) traveling by car from Stockholm to Lund to receive honorary recognition for his lifetime of service in the medical profession. Initially he is accompanied on the trip by his attractive daughter-in-law, but they are joined along the way by a young girl and her two male companions as well as a bitterly cynical middle-aged couple. If you are wondering how all of the people fit into Borg's car, it is rather large and old - befitting its owner, as Borg comments. A Bergman road movie is a novelty in and of itself and makes seeing this a must for any Bergman fan.\n\nIn the opening scene Borg (who narrates the film) says that he has chosen to withdraw from most personal interactions, since they seem to dwell on interminable discussions about people and their motivations which, one assumes, bore him. He remarks on this as leaving him rather lonely, but this seems more of a remark than a complaint.\n\nEarly on we are treated to a Daliesque dream sequence that led me to feel that we were indeed going to go deeply into the psyche of Dr. Borg, but the ponderous tone created by the dream is not carried over into the remainder of the movie. The dream is spectacularly realized and, while I assume that Freud would have a field day with it, its meaning beyond having a life without much time left inducing a fear of loneliness and death escapes me. I think the dream sequence misleads us as to what is coming. It establishes the main premise, but sets the wrong tone.\n\nToward the end of the movie we are offered another lengthy dream sequence - an anxiety dream about being unprepared for an examination (that is commonly experienced by most academics) together with revelations of the infidelity of Borg's long since dead wife and a searing interrogation by the wife who comments, \"You know so much, and you don't know anything.\"\n\nSandwitched between these heavier dreams the trip itself is almost lighthearted at times, primarily due to the exuberance and beauty of the young Bibi Anderson. This is not to say that Professor Borg is not hit with some weighty accusations by his daughter-in-law, like being told he is selfish and ruthless, and that his son hates him. It is fun to see Max von Sydow playing a gas station attendant who expresses thanks to Borg for services once rendered.\n\nProbably all old people wind up in Borg's position of looking back on their lives and summing up. And there are many who have regrets about foregoing personal relationships in favor of career, as Borg does. But, in the end it is difficult to see Borg as an anguished or tragic person. He made choices, some good and some bad, just like we all do. Maybe he could have had more personal happiness with different choices, who can tell. By opting for more personal happiness, maybe his talents as an honored scientist would have been lost to society. Is the social good of a life less valuable than personal satisfaction? Besides, at an old age Borg has a devoted housekeeper who is almost a surrogate wife, he is well off, he is honored by his peers, he is still intellectually active, he is engaged enough to recite poetry, and, importantly, he is still flexible and thoughtful enough to be changed by his experiences. After his long day he has had not only sobering, wounding experiences, but also the delight in his young companions and the satisfaction of being publicly honored. He is able to integrate these experiences and, near the end of life, find peace rather than confusion and despair.\n\nWoody Allen's \"Another Woman\" has been compared to this movie. Indeed Allen's movie was surely inspired by \"Wild Strawberries,\" and I think it is the superior movie - deeper and more involving."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "preppy-3",
        "review_rating": "1",
        "review_title": "Another \"classic\" that is hopelessly outdated",
        "review_detailed_main": "An elderly professor is on his way to get an award for his work. While traveling he thinks about his past, his family, friends and how he got to be where he is. Unfortunately the viewer is forced to watch it also!\n\nI'm a big fan of movies and I've seen other Bergman films but all the adoration this man has gotten puzzles me. His films are somber, grim (except for \"Smiles of a Summer Night\") and (basically) nothing ever happens in them! His \"insights\" into characters are ridiculously predictable and his little \"lessons\" about life are just laughable. I won't deny that some of his films LOOK beautiful and there's some good acting but the films themselves are boring. I heard this was a classic and should be seen by anyone interested in cinema. What I saw was a boring, grim and depressing drama that offered nothing new or interesting that I haven't seen before...and better done! The acting was good but I didn't care and wasn't interested one bit in the characters or situations. This may have been cutting edge in 1957--but I doubt it. Another overpraised drama from Bergman."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "haustin-1",
        "review_rating": "",
        "review_title": "Professor's diploma is honorary.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "classicsoncall",
        "review_rating": "9",
        "review_title": "\"You know so much, and you don't know anything.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ackstasis",
        "review_rating": "8",
        "review_title": "\"I have a habit of recalling scenes from childhood to calm me. So it was this evening.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "AlsExGal",
        "review_rating": "9",
        "review_title": "It's like the ghosts of Christmas past got the wrong address...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "pietror_se",
        "review_rating": "9",
        "review_title": "about",
        "review_detailed_main": "Well, i live in Sweden in 6 years now and i can say that they generally have a problem like shown in the movie. but even for somebody coming from other cultural background i believe it has much and much to say. especially the thing with omission of the anticlimax - it will simply bring you to create your own. perfect - in every sense that the technology of '56 allowed. It really touched me, maybe because i am just in the phase of '37 which means reevaluating your entire life. And this really showed me how could i end, if i don't pay attention (means stays here in Sweden - no offense meant, simply other culture). generally this is a miracle movie which will work above the time."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "tobiqq1",
        "review_rating": "9",
        "review_title": "It's the story of a man's parallel journey to a tribute and his suppressed painful past.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "sarahlotfyb",
        "review_rating": "9",
        "review_title": "Meaningful & Philosophical",
        "review_detailed_main": "From my point of view; the movie is trying to preview a life span of a person starting from the very sweet childhood going through youth as feelings and energy overtakes everything inside a young person. After that comes kind of a dark place which is elderdom; where everything seems lost and fading. When you must face yourself and your reality alone! It's time to harvest your life fruits mainly about your inner self that you were distracted away from it during most of your life. So the movie is a beautiful journey through life in the form of a story in a movie. I do recommend it."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "lostcinematheq",
        "review_rating": "6",
        "review_title": "Leave him alone!",
        "review_detailed_main": "What was supposed to be a movie about a dying old man trying to find escape after realizing how he's destroyed the relationships around him, instead came off to me like a bunch of people being cruel to a poor old man just trying to enjoy his final days. I wanted to jump inside the screen and tell all these characters to leave the poor man alone and let him die in peace! For that alone, it has to be good for it to get that much of a reaction out of me. Also had some really good dream sequences. But it still wasn't something I'd ever watch again or suggest."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "sjjvdberg",
        "review_rating": "10",
        "review_title": "The very best . Remarkable evocation of the atmosphere of dreams and memories",
        "review_detailed_main": "I saw this film in the early sixties, and still have vivid memories of it. What struck me then was how close Bergman came to evoking the atmosphere of those dreams that linger with us for years or decades. And the atmosphere in which our oldest and most cherished memories are wrapped. Probably the most 'atmospheric' movie I've ever seen. I concur with the reviewer who called it the very, very best. This was my impression as an adolescent -- I look forward to seeing it again when my copy arrives, and re-evaluating it as an old man (like old Isaak).\n\nThere will, of course always be those who prefer their Quentin Tarantinos, just as there are those who prefer to open their nuts with ten-pound hammers."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jose-cruz53",
        "review_rating": "7",
        "review_title": "Not very impressed",
        "review_detailed_main": "I wasn't very much impressed by this film. I know it is artsy and sophisticated, though, it is still more accessible than most other Bergman films. I would only say that Fanny and Alexander is more accessible, though this film here actually has a plot and well developed characters, which is unusual for Bergman films. Some of his films are only a showing of symbolism, such as The Seventh Seal, this one is also very artsy, though it doesn't sacrifice traditional narrative.\n\nBut I didn't found it very entertaining. The low visual quality hurt, as the fact that it is black and white (I simply do not like black and white very much: color makes things much better looking) and the score was also very uninteresting.\n\nOverall, I would recommend it for someone who likes artsy drama films. It isn't, however, an entertaining film for the masses. And yes, I like to be entertained."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Monkey-D-Luffy",
        "review_rating": "3",
        "review_title": "Swedish actresses were far cuter than Hollywood ones then.",
        "review_detailed_main": "I was caught unawares by the mellifluous verbiage of the Swedish language. The guy playing Isak had a lilting, singsong voice that held one's attention. I managed to understand most of the movie, which is a direct one despite its symbolism, or rather because of the symbolism. The thing about Isak is that he doesn't seem very much sophisticated. His fear is visceral but there's no raw insight to back it up. Maybe he was a simpleton in a gentleman's clothing. I didn't understand the reason for the title though. Regardless, Wild Strawberries didn't come even close to dislodging 12 Angry Men as my favorite movie of 1957, let alone the best film of all time. Ingmar Bergman, I must say, had something new to show, but he didn't show it, he said it. That's his sin. Hope you've found this review useful."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "vm001k",
        "review_rating": "",
        "review_title": "a good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "itzgasparpt",
        "review_rating": "10",
        "review_title": "One of Bergman's finest",
        "review_detailed_main": "If you want to start a journey through Bergman movies this is the first you should pick. With Victor Sjöström, swedish movie legend, this is a film that explores existentialism by representing the emptiness the old professor felt after a life of coldness. A movie that includes the present and the past, the dream and the reality and full of flashbacks. Isak's dreams and nightmares either represent his good times as a child or death in a very surrealist way."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "faaizy",
        "review_rating": "9",
        "review_title": "Sheer Quality!",
        "review_detailed_main": "This has to be one the greatest black and white movies I have ever seen. Although I watched this movie in a not so good print, it did not make a great difference, because the movie itself was mind blowing. Even though the story-line is not very thrilling, yet it keeps you in its grip. You wont get bored for a second while watching it, at least I didn't. The acting done by the cast is also pretty good. You would feel as if you are there experiencing it yourself. It contains scenes of both emotions and comedy. The movie just flows on and keeps you in wonder what will the ending be. Its a soft and a light movie, a perfect piece to end your weekend with. It's a must watch."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "anthonyf94",
        "review_rating": "9",
        "review_title": "Life as deconstructed time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "alinebrayner",
        "review_rating": "9",
        "review_title": "Subtle, light and inspiring",
        "review_detailed_main": "The most delicate of all Bergman's movies. A delightful reflection of time passing by and how we shape ourselves over time."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Sinth01",
        "review_rating": "8",
        "review_title": "Journey back to the childhood",
        "review_detailed_main": "Smultronstället is not a movie about a plot with many twists and great tragedies. It is a story about an aging man and his journey spiced with the memories and the dreams he witnesses about himself. Ingmar Bergman creates the tension and the feelings from minimum amount of events, from which non remain unnecessary and from a small amount of characters that all have their own personality and place in the movie. The gorgeous Swedish summer gives a life full background and a great contrast to the old professor preparing for his end.\n\nAlthough the movie is definitely not made for everyone's taste due to its minimal action and the very slow storytelling, it is an indescribable strong and wise movie about the aging, youth and the life itself. journey that will help us to gaze back into the past and help us to remember our own wild strawberry patch."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "the red duchess",
        "review_rating": "10",
        "review_title": "Bergman's rich, deceptive masterpiece (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "FilmOtaku",
        "review_rating": "7",
        "review_title": "Introspection and nostalgia",
        "review_detailed_main": "\"Wild Strawberries\", Ingmar Bergman's classic film in which an elderly physician examines his life while traveling to receive an honorary award for his years of service is probably not a household name, but it should be seen. Professor Isak Borg (Sjostrom) has been living alone for years with only his housekeeper to keep him company, as he has alienated his grown son and his daughter in law. His cold demeanor and brusque mannerisms don't help to win him many friends, so on the advent of the award ceremony, while his daughter in law drives him there he reflects on his past and things that happened/decisions he made that led him to become the man he has, and led to the life he is living. Whether they are nightmarish dreams about death, or bona fide memories he experiences while they visit his childhood home along the way, each occurrence makes him more introspective (and a bit frightened) about his life and the lives of those around him.\n\n\"Clarity\" is not the first word that comes to mind when I think of Bergman, but the words \"introspective\" and \"provocative\" do. \"Wild Strawberries\" was like a less sentimental \"Goodbye Mr. Chips\", and even has some similarities to \"Deconstructing Harry\". After experiencing Bergman films like \"The Seventh Seal\", I was expecting there to be a lot of room for interpretation, and what I got was a beautiful, interesting and thought-provoking study of a man who didn't realize all that he had lost until he finally allowed himself (or forced himself, depending on which way you want to look at it) to come to terms with certain turning points in his life, some of which he had complete control over, and some which were decided for him.\n\nBergman's black and white cinematography is gorgeous and artful, and Sjostrom's performance is heartfelt and natural. The supporting cast is good as well. If you're trying to get someone to get into Bergman films, this may be a good warm-up before exposing them to \"The Seventh Seal\" or even \"Persona\". With \"Wild Strawberries\", Bergman proves once again that he is one of the most thought-provoking and creative directors of the 20th century. I would definitely recommend this film. 7/10 --Shelly"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "noxhitman",
        "review_rating": "10",
        "review_title": "Great direction, memorable images and flawless acting. A wonderful film",
        "review_detailed_main": "One of the best black and white movies ever made is Wild Strawberries. Ingmar Bergman gives a masterful direction and his b&w work is so superior to other directors that all scenes are impressive. A cruel, touching story about an old man who has to confront loneliness and aging. A must see for any Bergman fan and for all the people who are looking for great films. One thing i noticed in Bergman's films is that he has kinda an obsession for wild strawberries, watch \"The Seventh Seal\" and you'll agree with me.\n\n10/10"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ivanmessimilos",
        "review_rating": "6",
        "review_title": "Too artsy for me",
        "review_detailed_main": "I'm sorry, but I can't give a higher rating to a film I didn't fully understand. Visually, I really liked the film, it looks beautiful. The structure is demanding since we have a \"normal\" story, flashbacks and dreams, here I have to pay tribute to Bergman for deciding on such a way of storytelling at all. However, I didn't connect all the scenes and it didn't all make sense to me. It is clear to me that this is about difficult topics such as existence, the meaning of life, human relationships, but obviously the problem is in me as not every scene was clear to me."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Alwayssomething",
        "review_rating": "3",
        "review_title": "ironically, the dream sequences were the only thing that kept me awake.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "tomfla-09348",
        "review_rating": "",
        "review_title": "Mesmerising",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ofpsmith",
        "review_rating": "10",
        "review_title": "The tragic personal life of a man who seems to have gotten lost in his career.",
        "review_detailed_main": "Dr. Isak Borg (Victor Sjostrom) is a complex character that many of us can probably relate to. He is a successful scientist who has made a career for himself and has stayed in it ever since. Isak is a successful man on the outside but he has a cold personality that interfered with the relationship between him and his wife Karin Borg(Gertrud Fridh) and his son Dr. Evald Borg (Gunnar Bjornstrand). Now an elderly man Isak gets up one day to attend an award ceremony in his honor. But as his daughter in law Marianne Borg (Ingrid Thulin) drives him to his destination they make many stops along the way. In each way Isak is reminded of his life. From his childhood to him as an adult. he learns from each stop what his life has meant to people in positive and negative ways. He sees what he has done for science and progress but at the same time is reminded of his own bitterness and coldness. Ingmar Bergman I know has made some really great films but this is by far his best. Dare I say it but it's even better then The Seventh Seal. Bergman shows us a man who has achieved much success but in the process has shut himself outside of his own life. I highly recommend this movie. The acting and story are fantastic."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Bob Pr.",
        "review_rating": "10",
        "review_title": "Very satisfying; a coming to terms with one's life near its close",
        "review_detailed_main": "Last night, at our monthly film series \"Great Films @ the Cathedal,\" we showed Ingmar Bergman's \"Wild Strawberries.\" This film is one of his early films that propelled Bergman's recognition by his peers as one of the greatest and influential film directors of all time. It's a psychological drama about a Swedish physician (Dr. Isak Borg), later a professor, coming to terms with his life in his elder years: his mistakes, weaknesses, his successes, his strengths.\n\nKnowing Bergman's life in the family in which he grew up helps one better understand both this film as well as his others. Bergman's mother was a fairly strong-willed nurse while his father was also strong-willed and a very strict Lutheran pastor who later was appointed pastor to the King of Sweden. Bergman's father was punitive with his son, e.g., putting him in a dark closet for hours as a young child as a reaction to any wrong he considered his son had done. Young Ingmar was entranced by the stained glass in his father's churches -- their saints, angels, devils, scenes from Biblical stories. Ingmar's father and mother did NOT have a comfortable, happy marriage. One sees echoes of these experiences in the issues, the traits and behaviors of the characters Bergman gives us as both a scriptwriter and film director.\n\nBergman described how the germ of this \"WS\"'s narrative came to him while he was driving across Sweden and passing through the town in which he grew up. He imagined going to homes in which he'd once lived--opening the door and observing life and his relatives as they had been and then, after a bit--exiting through the door back to life in the present. So this device (plus some troubling dreams) is used to help jolt his main character, Dr. Borg, into reassessing his attitudes and behavior.\n\nMy explorations of my own family plus my work as a family therapist helped me appreciate this movie very much. One sees ample instances of how some of these traits are transmitted and cascade through the generations. The tone at the end of the film is largely satisfying to most. Our group unanimously thought \"WS\" ranked among the very best of the best films we've seen this season.\n\nVictor Sjöström, a renowned Swedish film director and former actor who played Dr. Borg, was in somewhat precarious health throughout the filming and died not long after completing this film.\n\nFWIW, the title \"Wild Strawberries\" refers to a scene in the movie in which a young woman goes to a patch of little known wild strawberries to pick some as a succulent gift for a relative."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "PKC",
        "review_rating": "9",
        "review_title": "A Life Well-spent?",
        "review_detailed_main": "A successful, respected doctor and professor near the end of his life looks back on his years with regret and nostalgia. Bergman uses dreams and allegorical images and characters to support his thesis that the greatest waste of a life is to live it in isolation.\n\n\"Wild Strawberries\" is also light and humorous in places, with a gentle and loving depiction of the doctor's family in his youth (though I think it's important that we never see the doctor interacting with his past family until the very end). He is ultimately redeemed at the end, and Bergman is saying, I think, that there is hope for us to change even until the very end of our lives, and that change is worth undertaking.\n\nOn the whole, \"Wild Strawberries\" makes an affirmative statement. One of the strengths of this movie, and of Bergman's work in general, is his ability to create characters who function successfully as both \"types\" -- embodiments of ideas, philosophies or points of view -- and also as credible individuals in a narrative about whom we care. That's difficult."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "knucklebreather",
        "review_rating": "10",
        "review_title": "Simply perfect",
        "review_detailed_main": "Too often, I think, movies get caught up with exploring negative topics: crime, evil or disturbed people, dark family secrets. Any kind of positive message or happy ending is written off as a fake Hollywood Ending. In \"Wild Strawberries\", Ingmar Bergman reminds us a film can be positive and uplifting yet not seem the least bit hokey, and that's what I'm most thankful for when it comes to this film.\n\n\"Wild Strawberries\" has a simple enough plot: an aging professor, full of regrets about his life, travels across Sweden (to the surprise of his maid and son, who had his day planned for him) on his way to a ceremony in honor of him. On his way he goes places and meets people who bring out positive and negative memories about his life, and all the while he is having haunting dreams. All of this results in a sweet yet powerful message delivered with a crescendo in the closing moments of the film. If a movie is to have a clear message, this is certainly a fine way to do it."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "chaswe-28402",
        "review_rating": "9",
        "review_title": "Sensing his time will soon be up",
        "review_detailed_main": "Victor Sjöström acts a 78 year old man in this 1957 film, and he was actually 78 himself. He died in January 1960, aged 80. Given his long experience as a director, and actor, first in silent films and later on the stage, it's as if he was directing himself in an equivalent account of his own personal life in this car journey south through Sweden down to Lund. The absence of hands on the clocks, and his own hand pulling him into the ghostly coffin indicate his anticipation that the end is near. The viewer is exceptionally powerfully drawn into the reality of what is taking place, as the aging man revisits the scenes of his past. Ingmar Bergman described himself as allowing his actors increasing freedom in self-direction, in terms of both action and dialogue. This attitude seems almost to have been initiated with this performance by Sjöström. It is an immensely effective film, but I've docked one star, as the hitchhikers struck me as irritating and unconvincing; besides wearing silly-looking shorts."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "panchodh_12",
        "review_rating": "8",
        "review_title": "An existential road movie through life",
        "review_detailed_main": "This movie takes the audience through life, it makes us reflect on ourselves, it forces to reconsider our path. We see Isak, an old doctor who, on his way of receiving a honorary award, is confronted with his entire life, and the way that life changed him. He realizes that he aid his selfishness with loneliness, and that time took away his joy to live. The characters of Isak's mother, on one side, and Marianne and Evald on the other, remind us that this drama is recurrent in every human life, like a self-repeating prophecy that haunts all generations: Is it worth living? Should we even bother bringing new creatures to this meaningless world? How can we avoid falling into the trap of loneliness eventually?\n\nOn their trip to Lund, Isak and Marianne pick up two very different groups of people. First, there's Sara, Viktor and Anders; young, happy, and cheerful. They are still innocent and worried about the existence of God and the beauty of art. Then, they pick up a bitter married couple that are constantly arguing with each other. These passengers mirror Isak's stages in life, from his cheerful youth to an already cynical marriage, the path that Marianne and Evald also seem to be taking. It is meaningful, then, that Marianne forces the married couple to leave the car. In the end, what prevails is the desire to live happily.\n\nThough, like all Bergman's movies, the plot moves a bit too slowly for modern audiences' taste, this should not overshadow the depth of this movie, so rarely found in today's cinema. Wild Strawberries is an insightful movie that brings us all to the bottom of human existence."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "cengelm",
        "review_rating": "6",
        "review_title": "Pretty Boring and Unbelievable",
        "review_detailed_main": "At the age of 78 a retired physician finds his life to have been empty and meaningless. At that age men are hardly reflective, from my experience. Usually they are convinced that everything they did was right, specially when life was determined by success. But that is not all: he even has a 98(!) year old mother who contributes to his reflection. Pacing is always slow and the dialogue had a sedative effect on me. After seeing some of the dream sequences I almost started dreaming myself. So now you are warned.\n\n6 / 10"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ZildjianDFW",
        "review_rating": "10",
        "review_title": "My Favorite Bergman",
        "review_detailed_main": "I remember, back when I was in high school, I was just starting to get into film, at least as more than just a cheap way to kill a couple of hours. I'd heard a lot about Bergman, about how he was one of the all-time greats, so I decided to watch \"The Seventh Seal\". Frankly, I wasn't overly impressed. I've seen it again since then, and I liked it a lot better the second time, but my first impression was disappointment. But not long afterward, I decided to get back on the horse and give Bergman one more shot. The second movie I tried was \"Wild Strawberries\", and that was another story altogether.\n\nThe story is a relatively simple one. Professor Isak Borg (Victor Sjöström), an aging physician, is traveling to Lund to receive an honorary degree. Accompanying him is his daughter-in-law, Marianne (Ingrid Thulin). Along the way, they make various acquaintances – a trio of young travelers, an embittered married couple, Borg's mother, a former patient, etc. Each of these encounters recalls some memory, some event in Borg's life, recollections of his childhood, his family, his estranged wife, his boyhood sweetheart. Over the course of the film, Borg's life is reconstructed before our eyes, and through HIS eyes, we see our own questions being asked, our own tribulations being explored.\n\nThe film has its share of many typical Bergman trademarks: psychology, existential angst, questions of the existence of God, strange dream sequences, feelings of loneliness, and an exploration of the apparent meaninglessness of life. But at the same time, the film has a warmth that you don't often get from Bergman, as well as glimmers of hope, a sense that maybe all isn't lost after all.\n\nThe acting is solid throughout, and the performance delivered by Sjöström is particularly touching, portraying a tired, trouble man, struggling with his own stubborn, judgmental, alienating tendencies.\n\nI've seen many Bergman films since I first saw \"Wild Strawberries\", and he's come to be one of my favorite directors, but to this day, \"Wild Strawberries\" is my favorite of his films. To me, it's one of his most cohesive, well-conceived, clearly executed films, and its impact survives repeated viewings. I recommend it highly, especially to people who are new to Bergman, or who watched another of his films and weren't impressed."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "thinbeach",
        "review_rating": "7",
        "review_title": "The road trip of life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mihaelalescan",
        "review_rating": "5",
        "review_title": "Expected more",
        "review_detailed_main": "I had high expectations from this movie as it was Tarkovsky's favorite, but I was disappointed.\n\nThe acting is unfortunately bad, except for the professor Borg. There are way too many random scenes that have no actual meaning in the movie's composition, for example the dream that the professor had. It was just put there without any meaning to the plot.\n\nAlso, I felt like the author wanted this movie to be philosophical, which is definitely felt, but the final product is highly flawed, random and uninteresting.\n\nI give it a 5 stars because I liked the topic- Old man remembering scenes from his childhood.\n\nAll in all, the movie is really nothing special and I wouldn't watch it again."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Too Cultivated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "blanche-2",
        "review_rating": "10",
        "review_title": "Beautiful, uplifting film",
        "review_detailed_main": "Victor Sjostrom stars in Ingmar Bergman's Wild Strawberries, from 1957.\n\nAs most everyone knows, Victor Sjostrom was the Swedish and Hollywood director Victor Seastrom who ultimately quit directing and acted full-time in theater and film. I don't think multitalented covers it. His acting, as his directing, is magnificent.\n\nHere he is Professor Isak Borg, a man about to get a prestigious award. As he contemplates his life, however, he has strange dreams. As he talks to his daughter-in-law (Ingrid Thulin), he realizes that the only difference between his life and death is the coffin. In choosing a lonely, cutoff existence and a life of cold detachment, Borg realizes that he is already dead.\n\nThis sounds like depressing Bergman, but in fact, Isak learns something as he travels to get his award. Along the way, he and his daughter-in-law Marianne agree to give a ride to some young people, two boys and a girl named Sara, which is the name of Isak's first love, his cousin. Like the woman he loved, Sara is being sought after by both boys, and she flirts with each one. In Isak's life, his Sara fell for his brother. The situation brings back Isak's childhood to him, and he relives family experiences when he visits his old home and later, his 96-year-old mother and sees her own coldness.\n\nIsak and Marianne also give a ride to a married couple whose car has broken down. But their fighting is reminiscent of Isak's own marriage (and Marianne's to Isak's son, too, for that matter), and Marianne asks them to get out of the car.\n\n\"Wild Strawberries,\" referring to the strawberries that grew on the land of Isak's family home, is the story of a man coming to grips with his life - a life full of accomplishment but not many human connections.\n\nThe most striking thing about this black and white film is the cinematography - the starkness of Isak's dreams, the family all in white against the Swedish landscape - so many stunning images.\n\nPeople call this film optimistic and uplifting, and it is. It is also profound, emotional, and very warm. Sjostrom shows us a charming old man whose niceness is on the surface only. While Marianne says that she doesn't like him very much, the young people love him and buy into his facade because they sense the real man he is afraid to show others.\n\nBergman tells us that life's questions aren't answered right away - sometimes, it takes a lifetime."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Aaron_West",
        "review_rating": "9",
        "review_title": "Life: in retrospect.",
        "review_detailed_main": "An intriguing, contemplative and melancholic film from Ingmar Bergman.\n\nWild Strawberries is a powerful meditation of life, with all its choices and the regret that spawns from them.\n\nVictor Sjöström gives a precise and personal performance, authenticating Bergman's astoundingly screenplay.\n\nTechnicalities don't truly matter with films like Wild Strawberries, but never the less; the cinematography is soft, artful visual poetry. The sound design and score might not be but they function fine as an drivers of the narrative without making it an impersonal experience.\n\nOverall, Wild Strawberries may not be the magnum opus that Persona is, but it is still an empowering personal and deftly poetic study of life."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "elvircorhodzic",
        "review_rating": "10",
        "review_title": "\"The place where wild strawberries grow!\"",
        "review_detailed_main": "WILD STRAWBERRIES is a romantic drama that could cause some confusion and rebellion of the human spirit for the viewers. One very cold and realistic story about the differences in human emotions and aging is full of strange harmony. An aged professor of medicine examines his life while traveling to university where he taught for years in order to receive an honorable mention. His estranged daughter in law travels with him and the two of them visited many important places from his past.The Professor meets, on this journey,interesting people and they become part of his fantasy...\n\nThe atmosphere is grim and scenery is presented in the form of a beautiful wasteland. They are a kind of symbol of solitude, loneliness and leached life. However, the three youngest protagonists try to disturb this harmony. Young people are full of life, even if that life does not make sense.\n\nMr. Bergman has symbolically linked every appearance, details, events, things and objects together. He connects them in a life story. A certain conflict in the character is visible in this film. Youth, playfulness and innocence against old age, remorse and guilt.\n\nVictor Sjöström as Professor Isak Borg is a cold and egoistic old man. Wild strawberries are a symbol of love in his youth. However, wild strawberries have chosen someone else. His story is real, touching and painful. He is a character who is admired, but never loved.\n\nIngrid Thulin as Marianne Borg is a woman who tries to understand the cold emotion. However, she yields under her own emotions. Gunnar Björnstrand as Evald Borg is an unwanted son and a ruthless husband. He rejected his life for no reason. However, he understands the difference between love and loneliness. Bibi Andersson as Sara is a playful girl who has two wooers. She will awaken deeply buried memories in an old man.\n\nThe story, perhaps, is not sufficiently simple and clear. Life is not simple. Redemption is not the point of this story. Life is strange and tortuous path between emptiness and self-realization. Some people manage to fill their emptiness with emotions. Some people fail. Understanding and reconciliation between the different characters are the point in this movie.\n\nMr. Bergman is a genius."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "marcin_kukuczka",
        "review_rating": "10",
        "review_title": "Psychological masterwork",
        "review_detailed_main": "Our world filled with adverts and illusions hardly occurs to remark the old age of man. Deep within a reality where beauty and carnal desires take over, seldom is there room for elderly people. Would an old person make for a good leading character in the jungle of muscled idols?\n\nIn fact, more than 50 years ago the master director of Swedish origin, Ingmar Bergman, proved that to be possible. An old man, Isak Borg (Victor Sjostrom) with his rich experience and subtle psyche is able to win viewers' hearts, is capable of inviting us to join him in the journey through his life, to shed a tear sometimes, to laugh a bit when needed in order to learn modesty and ask for forgiveness... That is the uniqueness of the greatly psychological picture I have seen and would never forget - WILD STRAWBERRIES.\n\nLet me first look deeper at the idea of the content as it appears, rightly so, that there are no useless aspects in this masterful film. The old professor Isak Borg is presented to us before the credits as a very intellectual pedant. He has a family but...they go on existing in the photos that we see on his desk rather than in mutual understanding and good co-existence. Soon, the elderly professor invites us deeper into his inner worlds: he has a dream filled with thrill, symbols, angst odd mystery and... as he wakes up, we encounter his outside world, people around him... What begins is a long journey he sets for with his daughter-in-law Marianne (Ingrid Thulin) from the capital city to the cathedral of Lund where he is to receive the honorary doctorate. What a privilege! Yet, he does not see it this way. It does not occur to satisfy him much. There is something else he longs for in the depth of his mind.\n\nAll the tension is about to fill our imagination when they stop at the old mansion, the very spot where Isak played as a child, spent lovely days of youth, the youth full of dreams, achievements and losses...He starts to live his life again within his memory, all images and stream of events are so clear, all the people so close, including the beautiful love of his life, Sara (Bibi Andersson) and the whole family with cute twins who cannot learn to speak only when spoken to and deaf uncle Aron who indeed loves the song. The past blends with the presence, dreams with reality, memories with fantasies...\n\nThe psychology is expressed throughout the film from the Freudian aspect of angst, dreams, desires to the very development of reconciliation and forgiveness. The images combined with sounds and symbols (consider for instance the dream sequence) leave a powerful impact in each viewer. The strange combination between events and people resembles a truly genuine insight into the psyche of the character, into his interior worlds and the exterior world. Here, I should add that everything seems to be, on the one hand, individual, on the other hand, deeply rooted within the fascinating country - Sweden, its landscape, its atmosphere and its society. Doesn't this journey through Sweden symbolize it in a way? But now let me focus on one man who makes the film a true rarity.\n\nThe great psychology manifested in the film is possible to achieve thanks to the leading performance of Victor Sjostrom (the great Swedish actor and silent director - just to mention his PHANTOM CARRIAGE which had overwhelmed Bergman himself). Sjostrom does a marvelous job, he occurs to be unique and powerful and, at the same time, the most convincing and transcendent. He seems to represent his character's feelings in the most astonishing and authentic manner. Seldom do we find such a flawless performance. Here, what is left to me is just quote the director of the film, Ingmar Bergman, who said: \"Sjostrom's face shone, it emanated light - a reflection of a different reality, hitherto absent. His whole appearance was soft and gentle, his glance joyful and tender. It was like a miracle.\"\n\nThe supporting cast also constitute a very authentic development of different psyches within the professor's exterior world. Just to mention Bibi Andersson who plays Sara, the woman who meant most in Isak's life, yet the woman whom he lost. Gunnar Bjornstrand does a fine job as Isak's desperate son, Evald. His despair combined with sophisticated psyche emanates from the screen. It is the woman, Marianne (Ingrid Thulin), who finds striking similarity between him and his father. Except for others, a mention must be made of Naima Wifstrand who portrays Isak's cold mother. Ms Wifstrand, who was once a queen of the operettas in Stockholm, highlights the most memorable aspects of a reclusive bitterness and coldness of her character. Besides, I think that Professor's housewife is another character that needs special attention. She symbolizes the opposite aspect of a psyche, someone in contrast with the Professor: not a great intellect but rather simplicity. She is so angry with him due to some minor obstacles, but, finally, respects him in the solemnity at Lund...\n\nAll in all, WILD STRAWBERRIES is a timeless masterwork of psychology, a film that will capture you, absorb you to the very core no matter if you are young or elderly. It is also a wonderful lesson of life, of old age that has its angst, its regret, its bitterness, perhaps, but also the dignity of inner beauty that does not require much from the exterior world: just a heartfelt smile, a nice word or a beautiful song of love sung in your youthful enthusiasm. 10/10"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "dhaufrect",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "\"Wild Strawberries\" is an Ingmar Bergman masterpiece and a must see for all reliable moviegoers. The black and white medium is a must for this dramatic story of an older doctor with self doubts about his own existence. The cast is dynamic. The subtitles are easily seen and one has to put this one on his or her must see list. It does not have the drama attributed to his other dynamic work, \"The Virgin Spring\", also performed in Swedish with subtitles."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "conono",
        "review_rating": "10",
        "review_title": "Simply Breathtaking",
        "review_detailed_main": "After a bit of mannered symbolism in an introductory dream sequence, Bergman gets right down to business, and his business is as profound as any I've seen treated in film. Fortunately, the treatment itself isn't heavy-handed, and the story line remains entertaining while it slowly grips you with a more important message as an elderly man attempts to make sense of his life.\n\nPay close attention to this film, and your effort will be rewarded. It's a cautionary tale about the mistakes you might make in your own life, about how ego can be its own undoing, and how giving in to fear can cause you to waste your time on this earth.\n\nThe film-making is consistently masterful, yet generally understated. I can't think of a better work; it remains my favorite film, ever, by anyone.\n\nFinally, after you've seen \"Wild Strawberries\", don't miss Woody Allen's foul-mouthed, harsh, and hilarious remake, \"Deconstructing Harry\"."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mieriks",
        "review_rating": "6",
        "review_title": "A great story, but a stumbling execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "AP_FORTYSEVEN",
        "review_rating": "9",
        "review_title": "Bergman never disappoints.",
        "review_detailed_main": "My Rating : 9/10\n\nI picked this up as it was Stanley Kubrick's 2nd favourite film in the only list he made. So...what can I say about it? Well, it's exactly what the storyline says it is. It's a story about an old man who revisits his life's old memories from childhood to marriage to all his close relationships.\n\nI liked the dream-like visuals of Bergman. There's nothing negative to write about. I've also read the screenplay and gives further insights into what went into it's making. Classic stuff."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "JoeytheBrit",
        "review_rating": "7",
        "review_title": "Another Bergman Road Movie",
        "review_detailed_main": "Veteran filmmaker Victor Sjostrom plays Dr Isak Borg, a man who has shunned social contact where possible, who is nearing the end of his life. Borg decides to drive to the other end of the country to collect an honorary doctorate in recognition of his work, and is accompanied by his daughter-in-law, Marianne (Ingrid Thulin). Although Borg is supposed to be something of a misanthropist, he doesn't really come across as one in the film; in fact he comes across as quite a pleasant old chap. This could be because of a dream he recently had in which he wanders deserted city streets before coming across a clock with no hands and a carriage containing a coffin within which lies his own body. It's an undeniably powerful sequence – and must have been even more so back in 1957 – and it indicates to both Isak and the audience that death is not far away.\n\nThis realisation triggers a series of hallucinations which cause Isak to re-assess his life, and the incidents that resulted in him becoming the way he is. We learn that the woman he really loved left him for another man, an act which he perhaps has regarded as one of feckless cruelty, but which his hallucination informs us was actually a tortuous decision.\n\nIsak and Marianne stop on the way to visit Isak's 96-year-old mother who lives alone, and largely unvisited, in a detached old house. There is little intimacy between mother and son, and it becomes evident that Isak was an unwanted child (much like Bergman). It's perhaps easy, then, to see the genetic conditioning that led Isak down the path he chose.\n\nThe film continues in this revelatory vein for its relatively brief running time, and it is never less than an intelligent and absorbing tale. Isak and Marianne pick up hikers on their travels: a young girl – played by Bibi Andersson, who also plays Sara, Isak's lost love – and her two male companions, whose situation mirrors that of Isak's Sara, and a bickering married couple, with whom Isak relates because they remind him of his own troubled marriage to a wife long dead.\n\nWild Strawberries is one of those films that tempts the viewer into ever deeper thought: the more you think about it, the more you realise you've yet to uncover. The best films are like this: you keep peeling away one layer only to reveal another underneath – and while they don't provide the visceral thrill of more popular films, they are undoubtedly infinitely more rewarding. The subject matter might be grim – coming to terms with the imminent end of one's life, the nature of death, and the perilous path misinformed decisions can lead us down – but Wild Strawberries isn't a depressing film. It's not exactly uplifting, either, but it has something to say, and says it in an intelligent and insightful way. Victor Sjostrom, whose last film this would be, gives a near perfect performance as old Isak. He was 78 when the film was made – the same age as the character he plays – and in poor health, a fact which ironically enhances the realism of his performance."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Aoi_kdr",
        "review_rating": "5",
        "review_title": "Que sera sera.",
        "review_detailed_main": "This is a road movie of a doctor who expected his own death.\n\nAt fist, the member of the driving was his son's wife who hates him. On their way, they met two boys and a girl who are in a love triangle and a couple which have a quarrel each other. He visits the familar places and those make him looked back himself. Even if he's prouds of him by his excellent life and rich popularity, the another sides of him are egoistic and discriminatory when he looked back it in detail. Everyone is so.\n\nI haven't much experience to be satisfied with this movie. But everyone who gets old and has long lives won't necessarily understand it though. Some young smart people notice it, but some old people have cloudy eyes. Or they just don't want to find it maybe. Generally, they mostly remember a lot of things they couldn't control. However, actually the number of things they could control are more than that maybe. Sometimes regret helps them. Que sera sera."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "MB002k",
        "review_rating": "",
        "review_title": "better then expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Cosmoeticadotcom",
        "review_rating": "9",
        "review_title": "Great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "AbhiMathews",
        "review_rating": "9",
        "review_title": "At the end of the day, was it worth it?",
        "review_detailed_main": "Rarely do films evoke such emotion and nostalgia out of me. Although outdated and set in olden society, many of the themes are prevalent and generally forgotten in society's high tempo. We tend to go through life, completing daily tasks and essentially not living life and enjoying its facets.\n\nWhat is family? Just your reproductive offspring and people you speak with on occasion? What is the purpose of life? To just have fun and enjoy your time on this planet?\n\nWild Strawberries is a commendable film since it displays the inner conflicts we all go through to seek meaning. No one really knows what their time on Earth is for. At the end of the day, will we be satisfied with all we have done and left undone? Movies generally focus on entertainment and try to provide a platform for audiences to enjoy themselves and superficially relate with characters. I truly believe the connection viewers built with Isak was a deeper one since this misunderstood elderly man is just trying to find his way in life like we all are.\n\nWhen we're on our deathbeds and nearing the end of our time, will we be happy with the life and legacy we are leaving behind and ready to go?"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "rajarpitara",
        "review_rating": "10",
        "review_title": "A signature of Bergman's filmmaking.",
        "review_detailed_main": "For anyone just starting with Bergman, they should have a look on the Wild Strawberries. It's a perfect film to understand Bergman's philosophical standpoint and how he used it to create cinematic masterpieces one after the other.\n\nThe film follows an old worried man who've spent his whole life as a cold arctic plate. If we look around ourselves, such characters are not in dearth, but rarely have we found films which provide a character study of such sort. Bergman not only gives us a realistic portrayal of Isak Borg, but he also uses him to put forward the profound ideas of death, religion, and family.\n\nApart from having a very well-written screenplay, Wild Strawberries is so good on its visuals that dialogues appear to be ornamentations rather than a necessity. In the very first scenes, for example, the constant ticking of clock, close-ups, lonely roads in the dream sequence, and details as such tell a lot about the character even without any lines.\n\nBergman also utilizes few other characters such as Marianne, Isak's mother, the three friends, a middle aged couple among others to reflect life to Isak. The coldness of his mother, the unhappy marriage life of the couple, the liveliness of the friends, and the effects of having a cold companion which Marianne depicts: all of these force Isak to accept the emotional constraints he has put on himself in the past. He is going to get an honour, but his life\n\nBut he is not an evil of any kind. The brief scene involving Max von Sydow tell us about the humanitarian aspect of the old man. After around 90 minutes with him, we see hope as the camera captures his calm demeanor in a beautiful closeup.\n\nWild Strawberries is a beautiful film, one which stays with you for long, and makes you look for yourself in a moment or conflict in the film."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mikeyjwill",
        "review_rating": "10",
        "review_title": "What is really important in life?",
        "review_detailed_main": "Great film. One must rewatch. What is important in life? Is it perspective? Missed opportunity? Second chances? Human interaction and friendships? Forgiveness and saying I'm sorry or ultimately love?We all know saying sorry with real intent is very powerful. There are a lot of life lessons in this gem thus one of the few 10/10 ratings for me. It is definitely not the type of film to watch to get a thrill or to view to create a certain mood, however, a film that you watch introspectively, a film that is deep and perhaps a film to reflect on purposely regarding your \"own life.\""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "wes-connors",
        "review_rating": "10",
        "review_title": "Victor Sjöström Goes the Distance",
        "review_detailed_main": "Lonely, and fearing death, elderly doctor Victor Sjöström (as Isak Borg) takes a long drive to the city of Lund; there, he is to receive an Honorary Award, for his lifetime of service. Accompanying Mr. Sjöström is daughter-in-law Ingrid Thulin (as Marianne Borg), who is estranged from Sjöström's hateful son. Ms. Thulin, and the people he meets during the drive, prompt Sjöström's recollections of a sad life. But, three hitch-hikers: romantic Bibi Anderson (as Sara), spiritual Folke Sundquist (as Anders), and scientific Björn Bjelfvenstam (as Viktor) provide Sjöström with salvation, and symbolize hope for the future.\n\nThe first sign of brilliant programming is having housekeeper Jullan Kindahl (as Agda) interrupt Mr. Sjöström's dialogue at the point the he mentions his deceased wife. After the credits, director Ingmar Bergman sets the stage, with a surrealistic nightmare. Then, his subtly haunting drama unfolds\u0085\n\n\"Smultronstället\" aka \"Wild Strawberries\" is a uniquely beautiful Bergman piece. Sjöström (also an extraordinary director) ends his outstanding career with one of the most graceful, delicate \"last performances\" in cinema.\n\nPleasant dreams, Mr. Sjöström.\n\n********** Smultronstället (12/26/57) Ingmar Bergman ~ Victor Sjöström, Bibi Andersson, Ingrid Thulin, Gunnar Björnstrand"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ilpohirvonen",
        "review_rating": "10",
        "review_title": "Past.. and memories of fears and choices made in life",
        "review_detailed_main": "Ingmar Bergman made several modern films in the 1950's, which dealt with social issues. He started to build his reputation with The Naked Night (1953) and Summer with Monika (1953). In 1957 Bergman's two films The Seventh Seal and Wild Strawberries got released. Those films together ensured his place as the most important filmmaker of his time. Ingmar Bergman achieved to create such high reputation that people still today see him as one of the most influential directors of all time. He, as all great artists, managed to create his own unique world vision.\n\nWild Strawberries is about Dr. Isak Borg, an old doctor who goes for a short trip with his car. In result of coincidence, four youngsters join his trip. The trip that lead Isak Borg to the extreme of self-examination. Wild Strawberries is a story of a journey to past, dreams, nightmares, memories, fears and the choices made in life.\n\nIngmar Bergman's films are clearly European modernism, and his films are actually the finest example of it. Its cinematography, narrative and use of light and shadow are very modern. He has defined how to create this kind of atmospheres. He was a true master of cinema. The beautiful themes of Wild Strawberries brilliantly reflect to the cinematography."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "GiraffeDoor",
        "review_rating": "7",
        "review_title": "The one really good Bergman",
        "review_detailed_main": "Fun and well formed little character study with several neat dream sequences.\n\nIt's kind of funny sometimes, and it's also very poignant a lot of the time.\n\nViktor Sjostrom's character is one of the few really well developed characters in all of Bergman's Oeuvre. He plays him with a vibrant fuddi-duddiness that is delightful without undermining the sense of pathos."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "851222",
        "review_rating": "9",
        "review_title": "A great movie about reflecting on life and death",
        "review_detailed_main": "Greetings from Lithuania.\n\n\"Wild Strawberries\" (1957), created by a legendary Ingmar Bergman reflects on life, death, childhood and what it takes to achieve a lot in your life via carrier, but missing upon beautiful moments in your life and most important family - all this is seen trough the eyes on an old man. That said, this is a very easy movie to watch - its beautifully acted written and directed. Also while the themes i mentioned can sound hard, this movie is lighthearted and kinda makes you think after it ends about your life - where you are at this moment and that it shouldn't be to late to change it if you don't want to end up as this old man of whose carriers achievements appreciation comes not from a family, but a young unknown people with a heart.\n\nOverall, \"Wild Strawberries\" is a superbly involving, smart, moving movie that you will definitely can see and appreciate it. Great movie."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "6",
        "review_title": "I couldn't get What's the big deal in being cold and realising it at the end of your life. What's so there in this film?",
        "review_detailed_main": "Wild Strawberries (1957) : Brief Review -\n\nI couldn't get What's the big deal in being cold and what's so there in this film? I don't understand why this film is known as Classic for years when there actually nothing like deep thought or self realisation in it. An old professor, Isak who has been a cold guy all his life recalls the events happened in his life during a journey to University where he is going to recieve an honour. Those main real events of his life didn't look so sad as they are shown or acknowledged in the film. In young age he is in love with the girl Sara who adores him for being tender but marries his Brother instead. Was that so big fault here? Then Isak marries to another woman who is not happy with him being cold and does not hesitate to accept having an affair outside, but after all Iska being cold doesn't really care about it. She dies (god knows how) and Isak spend rest of his life lonely. His mother and son are similar in nature and that's why lonely in thier lives. So what's the big deal being Cold? Actually Isak was loved for being Kind by some people then what's the big deal if he couldn't have any woman in life? Does that really make enough ingredients for a film that is Called Classic? I doubt. Actually there is nothing much wrong being cold as far as you're smart and honest and there are many such people in the world then i don't understand why this small issue has been treated as if it means all the life of a man. Isak never looked a bad or an evil guy in the film so his self realisation of loneliness doesn't make much sense and that too when he has almost finished living his life. I am still trying to figure out why this film got tremendous acclaim and what's there which is so much life-changing or thought provoking in the film. This film isn't gonna change a bit in my life then what's the outcome of it? I would like to recommend this film as a decent watch but Classic? Not by far, at least for me.\n\nRATING - 6/10*\n\nBy - #samthebestest"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "moritzherz",
        "review_rating": "5",
        "review_title": "Strong movie with a life lesson!",
        "review_detailed_main": "To be honest I just watched the movie because of its high rating and its place in the top 250 list. But after watching it I am happy that I did that. Wild Strawberries serves a great story, life lesson inclusive, and was entertaining in its 90 minutes. Acting is good aswell, especially the old man is portrayed brilliantly and carries the story.\n\nIngmar Bergmann is a great director, he really knows what to do. Next I will watch Persona another one of his films.\n\nIn conclusion I recommend this movie to everyone that wants to experience the 50s and to people that already saw a Bergmann movie and liked it."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Fiona-39",
        "review_rating": "",
        "review_title": "Excellent stuff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "davidmvining",
        "review_rating": "10",
        "review_title": "Gentle, harsh, and great.",
        "review_detailed_main": "Wild Strawberries was one of the first Ingmar Bergman movies that I ever saw. I watched it for the first time about fifteen years ago, and I haven't seen it since. It's been a movie that I've always spoken very highly of, but also one that I've grown to remember less and less over the years.\n\nWell, when my mother bought me the 39-movie collection of Ingmar Bergman films from the Criterion Collection, I decided that there was no way that I wasn't going to go through every film, whether I've seen it or not, in the order that the collection recommends. It's not a chronological order, but one designed to demonstrate the three major stages of Bergman's career. Wild Strawberries is movie number four in the curated order.\n\nAnyway, the story of Isak Borg taking the long way south to a ceremony in his honor is amazingly affecting. I see a lot of parallels to Kurosawa's Ikiru in terms of theme and, to a lesser extent, tone. Considering that they were released only 5 years apart, it's not hard to imagine that Kurosawa's film influenced Bergman's, if only indirectly. Reading what I have about the conception of Wild Strawberries, I've seen nothing to indicate as much.\n\nHowever, there's still a story of an old man, filled with regret, looking back over his life. In both films, the central characters decide to do something with their remaining years. It's much more pronounced in Ikiru with the building of the playground, but Borg, as he looks back over his life and his failures as husband and father, also looks to the future, in particular, around his son and daughter-in-law. His regrets around the past he tries to mend by perhaps trying to mend the relationship troubles that his son and daughter-in-law are going through, a relationship that, he says, reminds him of his own loveless relationship with his deceased wife.\n\nThe film overall really is a balance between travelling backwards and forwards at the same time. There's a literal travel forward as Borg drives south towards what little there is of his own future, as well as the future of his line manifested in his son, but there's also the travel backwards, where he stops the care to visit the house where his family spent their summers in his childhood. He sees scenes that he never actually witnessed (where he's described as being on the other side of the lake), and what he sees are bright and pristinely white portraits of life at the time. This flashback contains a bright almost theatricality that creates an unreality around the action, which is appropriate since Borg is inventing the whole thing (or living out an invention he's previously created). He also visits his mother where he finds an old picture of him and the brother who stole his childhood love away from him, a relationship that produced several children in juxtaposition to Borg's single (potentially unwanted, and most likely illegitimate) child.\n\nIt is this dual journey, including the dueling back and forth between two young suitors both fighting for Bibi Anderson (one a minister in training and the other a doctor in training) about the nature and existence of God, which Borg just watches with detached bemusement. The only thing that ends up allowing the two young men to set aside their differences is when the three youths decide to honor Borg and his lifetime of work. And here, I think, is the key to the message of the film. Borg is unsatisfied with his life because he never loved his wife and was cruelly disciplinarian to his son. He was dedicated to his work (despite having obvious concerns about his ability in that regard through a late dream sequence) instead of his family, and when he falls to sleep in his son's guest bedroom, he has just seen his son and daughter-in-law reconciled and dreamed of seeing his own mother and father at that isolated house in the Swedish countryside. What made Borg happy wasn't his accomplishments, but his long ignored attachments to actual people.\n\nIt's a wonderfully humanist tale from a director who is more well-known for existential dread and stark images rather than a gentle touch.\n\nWild Strawberries, much like Ikiru, is one of my favorites precisely for those attributes, how well they are executed, and how much they contrast with the rest of the respective directors' work."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ElMaruecan82",
        "review_rating": "10",
        "review_title": "In Search of Lost Time ... paved by success, but ruled by mistakes ...",
        "review_detailed_main": "What a poetic coincidence! The night after I finished my second experience of Ingmar Bergman's \"Wild Strawberries\", I couldn't sleep, invaded by countless thoughts about the purpose of my life, questioning every single choice I had to make since I was given that privilege, and ultimately wondering which path my sentimental life would have taken, had my heart not picked the chosen one.\n\n\"Wild Strawberries\" chronicles a series of occurrences such as melancholic reveries, nightmares, nostalgic reminiscences or real-life encounters during the unforgettable journey of Dr. Isaak Borg, an affable and educated 78-year old physician, who must travel from Stockholm to Lund to receive a Doctoris Jubilaris celebrating the 50th year after his doctorate. From our perspective, there's no doubt that Isaak was and is still an honorable man. Early in the film, he stops at a gas station and a young Max Von Sydow recalls the days when Isaak was a general practitioner, speaking very highly of good old Doctor Isaak Borg.\n\nIf not a flawless man, Isaak immediately inspires our respect and admiration, and this is a credit to the Swedish veteran actor Victor Sjöström who exudes a powerful mixture of charismatic wisdom and sympathetic shyness. These traits are often branded as coldness by his entourage, but we personally suspect that only a defensive mind, such as his pregnant daughter-in-law Marianne, played by a breathtakingly beautiful Ingrid Thullin, would be so critical of Isaak's manners. However, as the story progresses, and as we get deeper in the relationships between Isaak and his mother, and with his son Ewald, played by the inevitable Gunnar Björnstrand, we realize that maybe, Isaak inherited from his mother (and Ewald from Isaak) this strange capability to inspire defensive mechanisms from the others. And maybe the key of some mistakes that might have undermined his life can only be drained from the well of memories.\n\n\"Wild Strawberries\" features an enigma of a man told from the others' perspectives. Given its surrealistic undertones, the film is ahead of its time, but not quite. I found personally ironic that Bergman loathed so much \"Citizen Kane\" when he unconsciously borrowed some elements from Orson Welles, except that the mystery doesn't focus on a man who's dead, but on a man who contemplates death at the twilight of his life, and wonders which other paths could have brought more happiness in his life. And as a genuine genius, Bergman understood the value of the road-movie format for character studies, that would inspire such memorable movies as \"Five Easy Pieces\", \"Easy Rider\", Woody Allen's \"Deconstructing Harry\" or Alexander Payne's \"About Schmidt\".\n\nThe road format is indeed crucial, as if the way that leads to our soul's abysses were like some tortuous roads with as many encounters as there are facets in our personalities. During Isaak's journey, the most significant moment occurs when he picks up three young hitchhikers among them a lively blonde girl, Sara, played by a young Bibi Anderson. And Papa Isaak (the tender nickname she gives him) grows reciprocally fond of her, thinking back of Sara, her youth's sweetheart, as if she was resurrecting the old sparkle that defined his younger years, or reopened the concealed wound of having let Sara slip from his hands, to one of his cousins.\n\nEach scene of \"Wild Strawberries\" carries a symbolic resonance, an embittered couple reminds of his failed marriage and a sordid episode where he symbolically lost his wife and didn't try to conquer her back, out of guilt or an apathetic weakness, surrendering to the humiliating weight of fatality. The most significant episode of the film is still the titular one, where plunged in a deep meditation, Isaak finds himself in his family cottage at the seaside, with Sara, the girl he used to court in the wild strawberries patch. Ingmar, like Proust for literature, invented a symbol to define the most cherished places of our childhood. Sadly enough, Isaak's cookie-Proust left a bitter taste.\n\nAnd while the pieces of the puzzle are assembled during this unforgettable road trip, Borg's odyssey highlights many aspects of his life and memories, inviting us in retrospect to question the value of our own lives. As usual, in Bergman's films, there are two levels of appreciations, as we follow the story of protagonists, we're tunneled into our own soul and are invited to meditate on the meaning of our lives, even more because we (contrarily to Isaak) can afford hope. And so does Marianne who embodies our perspective and refuses to see her husband inheriting the same traits Isaak took from her mother.\n\nMarianne's future is the fresh air that extinguishes some of Isaak's demons. For it is wise to learn from our mistakes, but even wiser and nobler to help other people to learn from ours. And this might be what the 'wild strawberries' stands for, a cinematic metaphor for this state of felicity following a great achievement. As a poet said: it's when you have reached the mountain top, that you shall begin to climb. No doubt that Isaak was finally climbing his way to some peace of mind at the end of the journey.\n\n\"Wild Strawberries\" is a humanistic masterpiece inviting us to discover ourselves, to find eternal peace and happiness through our memories. This is not 'inner child' material but a survival move guided by the nihilism induced by life as a linear movement toward death, ruled by mistakes, but paved by achievements, the very tools we use to build a personal history and connect it with our family's, thus contributing to the never-ending transmission of life.\n\nIf Isaak's experience can contribute to the happiness of his son, his daughter-in-law or a young stranger, his life had a purpose after all... in this vaster scheme driven by the superior forces Ingmar Bergman tried to touch through his Art, like he did, the same year with another masterpiece: \"The Seventh Seal\"."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "philthegreatone-786-63058",
        "review_rating": "9",
        "review_title": "A masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "gbill-74877",
        "review_rating": "9",
        "review_title": "Reflections of life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "phobonnika",
        "review_rating": "10",
        "review_title": "The 8th greatest film of all time.",
        "review_detailed_main": "What is it, where is it, how will it affect me? After living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence during a journey across Sweden to receive his honorary degree, filled with flashbacks and dream sequences. The market throughout the dead centre years of the 20th century offered the world a considerably large collection of epic-style films orientating around the subjects of introspection, recollection of past lives and regret from all corners of the atlas. As you'd expect it just so happened to become the case that Bergman's finest hour is the gold standard of such an exploit: its sombre tone from the word go mixed with the melodic Swedish-language screenplay make for a truly moving, thought provoking and memorable feature film which explores the aforementioned facets of seasoned-to-misery ageing protagonist Dr Isak Borg (Victor Sjöström). Laced with flashbacks that remain deeper, more beautiful and more poetic throughout than those of its rivals, Bergman guides Smultronstället with his steady and knowledgeable hand through a Viennese waltz of charming and calming rhetoric and retrospect of dear thought and organisation. When writing about Smultronstället, one has to mention the famous dream sequence, where Borg travels through an empty city: with broken clocks, paper thin faces and a chilling atmosphere that really establishes Smultronstället as not solely a homely film of no distress. The flashbacks provide an insight into the exquisitely crafted life of the many-faced protagonist, funnel towards a cumulative emotional impact of this simple, powerful story and its probing revelation of human character, desire, and chagrin. My grandmother, an immigrant from Sweden, translated a version of Smultronstället and it has remained her personal jewel throughout the years for a fraction of the reasons I've mentioned. On top of its emotional amicability and the journey it shows us into the reminiscent mind of a fascinating character, it shows us moreover an equally brilliant journey through Southern Sweden in its aesthetic glory, with the black and white lens never subtracting from it, until we reach Borg's 'smultronstället', literally translated as wild strawberry patch or 'a place of sentimental meaning'. Never has a lovelier journey been created and realised, with such brutal honesty, a revelation of a life lived of mixed emotions and receptions, and incomparable dream sequences."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "RodrigAndrisan",
        "review_rating": "9",
        "review_title": "A very Swedish film!",
        "review_detailed_main": "I did not lived in Sweden, nor did I visited it, but I've seen enough Swedish movies to have an opinion. Ingmar Bergman, Arne Mattsson, Bo Widerberg, Jan Troell, Lasse Hallström, etc., and, last but not least, Victor Sjöström(as director) himself (the lead actor in this film). Excepting Liv Ullmann and Harriet Andersson, in the cast are all the big names that Ingmar Bergman would work in his films after this, all the outstanding actors: Bibi Andersson, Ingrid Thulin, Gunnar Björnstrand, Max von Sydow (in a small role). A sad and disturbing film."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "barberoux",
        "review_rating": "7",
        "review_title": "Touches of cruelty",
        "review_detailed_main": "\"Wild Strawberrys\" wasn't as obtuse as other Bergman films. I thought it was an touching examination of an old, bitter man's realization of his life's end. From recollection's and comments from his traveling group he realizes he has become a mean, old b***ard. There were touches of cruelty the movie. Isak, his son Evald, their mother and the couple they were in a car accident with, all show signs of cruelty. They were mean, cold and bitter. Marianne seems to notice and comment on the behavior as if she were the conscience of the movie. She was played by a young Ingrid Thulin and was gorgeous. She was also memorable as Karin in \"Cries and Whispers\". Bibi Andersson played an almost Sandra Dee type character. It seems only the young people were happy in this movie and as they grew older they became mean and bitter. It wasn't a real happy movie. The ending was a bit more uplifting. Overall a good movie and a nice introduction to Bergman movies."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "quinimdb",
        "review_rating": "9",
        "review_title": "Wild Strawberries",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "stimpy_tr",
        "review_rating": "6",
        "review_title": "Wild strawberries...",
        "review_detailed_main": "Weird story of a morose 78-year-old professor is presented. I don't know why it is rated so high. I cannot quite agree with others. I didn't feel empathy wih the unlovely old man who is not liked by anybody and seems to have deserved it. He is about to die and still keeps thinking of the money he lent to his son. He may represent a stereotypical nordic person, but that would not be appealing to everyone.\n\nIt can be interesting to depict a dream about death at the time but today it is not. On the other hand, the philosophical/religious conversations remain shallow and are not comparable to their French counterparts. The only interesting part is the flashback to his youth and the title of the movie."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "kevino-4",
        "review_rating": "",
        "review_title": "One of My Favorite Films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "XxEthanHuntxX",
        "review_rating": "8",
        "review_title": "A faboulusly artistic journey of the valous in life",
        "review_detailed_main": "A philosophical movie, tragic yet very heartwarming and full of comedy. The photo is adorable. A true masterpiece from a filmmaking perspective. Extremely well thought out and beautiful dialogues and story. The various places, memories and dream sequences draw a three-dimensional picture of a man - with all his weaknesses, flaws and his vulnerability. The feelings and the thoughts of loneliness and emptiness are just below the surface, and the films sens moral arrives so diligently by your doorstep. Victor Sjöström, Bibi Andersson and a multitude of other actors, played their role outstandingly well in this movie"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "grantss",
        "review_rating": "10",
        "review_title": "Superb Ingmar Bergman drama - profound and emotional.",
        "review_detailed_main": "Dr. Isak Borg, 78, is a renowned physician and researcher. His life's experiences have left him cold, distant and uncaring. Now he is traveling to be awarded an honorary degree by a university, a reward for his life's work. Driving with his daughter-in-law Marianne, currently estranged from his son Ewald (whose personality seems to be following that of his father's), he finds himself reminiscing about his past, especially his 20s. He has also been having strange dreams, dreams that remind him of the person he has become, and potentially what lies ahead for him.\n\nIncredibly thought-provoking and emotional movie. A metaphor for life and what you make of it. As someone who could understand how Isak could get that way, and even endorse how he feels, this was an eye- opening, and potentially life-changing, movie.\n\nWhile many of Bergman's movies are sombre and depressing, this, having started that way, turns it all around, channeling the negativity to find something positive. A very nostalgic and uplifting movie. Also, not that predictable in its positivity. The upliftment sneaks up on you...\n\nWonderful film."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "valleyjohn",
        "review_rating": "8",
        "review_title": "My First Bergman film",
        "review_detailed_main": "When classic foreign cinema is talked about Ingmar Bergman is usually one of the first names to be mentioned but amazing, Wild Strawberries is the first Bergman film I have seen and it certainly won't be the last .\n\nThis is the story of retired doctor , Isak Borg , who travels with his unhappy daughter-in-law, in order to receive an honorary degree . Along the way, they encounter a series of hitchhikers, each of whom causes the elderly doctor to muse upon the pleasures and failures of his own life.\n\nI really enjoyed this film despite at times not fully understanding it . It's a film about reflection , regret and redemption . In many ways it reminded me of A Christmas Carol and It's a wonderful life .\n\nAll these films are about a men who are shown the error of their ways but in this case through dreams and reflection . It's a film that makes you think about how you have behaved in life and if you could have been a better person .\n\nThe dream sequences are great and look superb . The metaphors and symbols about life , puzzle the doctor but deep down he knows what they mean .\n\nAnother thing that struck me is how beautiful the Swedish women are . Ingrid Thulin especially . The light on her face made look incredibly beautiful.\n\nI look forward to my next Ingmar Bergman movie ."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "sunheadbowed",
        "review_rating": "10",
        "review_title": "The hands on the clock.",
        "review_detailed_main": "'Wild Strawberries' opens with an old man (Victor Sjöström, hitting the perfect tone throughout the film) and his surreal dream, in which he confronts a clock with no hands and a misplaced coffin with the reaching, gripping hands of a corpse. How we all long to remove the hands from the clock, but death will always reach for us; every day its fingers come closer, and it magnifies our past, our memories, our history.\n\nThis is Bergman's most Surrealist film (there are shades of Buñuel, Deren and even Cocteau), and one of his most compassionate and warm -- if anyone tells you that Bergman is simply the harbinger of misery and existential dread, this is the film to prove them wrong. That's not to say that the film doesn't bear a wistful sadness at its core, as all Bergman films do, but his tenderness can be overlooked.\n\nA beautiful film, and a great Bergman starting point for those who don't feel ready to jump headfirst into the suffocating intensity of something like 'Cries and Whispers'."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Movie_Muse_Reviews",
        "review_rating": "8",
        "review_title": "Another beautifully painted contemplative portrait of mortality",
        "review_detailed_main": "To compare \"Wild Strawberries\" to a story that's a bit more grounded (yet still part fantasy), what instantly comes to mind is \"A Christmas Carol.\" Though that classic is much more exaggerated, it shares that reflective spirit, sense of personal regret and un-fulfillment and the desire to make amends. The difference is that in \"Wild Strawberries\" we need no ghosts - - only Ingmar Bergman as our guide.\n\nIsak is a very old professor on his way to Lund, Sweden with his daughter-in-law to receive an honorary award, when in his aging state he's confronted by dreams of his childhood and consequent past regrets. On the trip, he also meets some vivacious young people and a bickering couple who continue to steer him toward a path of using his last days/months/years to bring meaning into his life.\n\nReleased at the same time as Bergman classic \"The Seventh Seal,\" \"Strawberries\" is also incredibly contemplative and full of incredibly philosophical dialogue. Both films confront themes of mortality, but \"Strawberries\" is the more hopeful of the two. Although we pity Isak and the film's other characters who seem to have failed miserably to suck any joy or positive meaning from life, there's nothing imminently bad or unavoidable -- there is great capacity for betterment.\n\nBergman's excellence as a director resonates throughout the film through its opening scene with ticking clocks and first major dream sequence on the barren streets to the final zoom-ins and close-ups. His every shot is a portrait of an emotion or at the least of a man caught somewhere between the past and death. Like all great classic/black and white directors, Bergman understands the powerful moments of his story and reserves his best just for them.\n\nAlthough Bergman creates more pity than empathy (though it could be my fault I've always struggled to really find personal epiphany in viewing his stories) and his language more intentionally mystical at times than intrinsically inspired, he manages to capture the uncertainty he's trying to address better than anyone else; His portrait of emotion brings us closer to life's toughest questions than any other director has ever dared.\n\nIt's the hopeful ending, however, that really makes \"Wild Strawberries\" a great film. Despite Bergman showing us a mirror that's very tough to look at for an extended period of time, he never suggests that we can't look into it and change whatever it is we don't like. It's that outlet that makes the thematic difficulty of the film all that much easier to bear.\n\n~Steven C\n\nVisit my site http://moviemusereviews.com"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "khanbaliq2",
        "review_rating": "10",
        "review_title": "Director Ingmar Bergman adopted a humanistic approach for this classic study in isolationism.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "rachelrose-87356",
        "review_rating": "7",
        "review_title": "Movie Review Profits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "runamokprods",
        "review_rating": "8",
        "review_title": "Yet another Bergman classic that I liked and admired, but didn't love on first viewing",
        "review_detailed_main": "An old doctor (a magnificent performance by Victor Sjostrom) takes a car trip to receive an award for 50 years in medicine, accompanied by his daughter in law, and some teenage hitchhikers they pick up.\n\nHe is tormented by highly symbolic dreams (beautifully done), and by the realization he has kept himself at an emotional distance from others and the world, and now his life is racing towards it's end.\n\nQuite moving in spots, but somehow never ended up with as much power as I expected.\n\nTwo critics' notes made sense to me. One said that, for as great and transparent as Sjostrom's performance is, he is so sweet and likable a presence it's hard to reconcile him with a man his daughter in law openly admits she doesn't like because of his cold nature.\n\nThe other point – which could also be applied to 'The Seventh Seal' is that the film seems less special today because the stylistic barriers it broke and the doors it opened (an almost totally subjective film, dream sequences of depth and meaning, etc) have since become a familiar part of film grammar. But at the time, this was something new and brave. Another to re-see."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "JuniorMint",
        "review_rating": "",
        "review_title": "insightful film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "gustavojensen-98259",
        "review_rating": "8",
        "review_title": "WHEN ONE DAY IN LIFE CAN OPEN OUR EYES ABOUT YOUR WHOLE LIFE",
        "review_detailed_main": "Wild strawberries 1957 When one day in life can open our eyes to everything we've been through, whether we've made the right choices and even our way of being is called into question. Dr. BORG (Victor Sjostrom) a financially and professionally successful widower makes a car trip to receive a prize, but on this trip he ends up passing through places from his childhood and opening his eyes to the visions of the vivid memories he witnesses, his eternal beloved who currently married his brother, his mother and his son who alone treat the feeling of loneliness very deeply perhaps due to his selfishness and Dr. BORG can see all of this only after that day when he gives a ride to some people who, talking about life, opens it up to his eyes. His family picked wild strawberries as a child, but even so he could have had a name more closely linked to the protagonist. Director Ingamar Bergman's plans are the most psychological in the history of cinema, he has a quick dollie or zoom for important expressions of the character, but it is not comical like Quentin Tarantino's, always trying to cut as little as possible always brings a lot of reality and drama of the scenes. A genius!!!"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "h-28658",
        "review_rating": "8",
        "review_title": "One of the great retrospective films.",
        "review_detailed_main": "Recognizing that there exists an inherent melancholy in nostalgia, one that strikes back with each painful return to the present."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "arighnachatterjee",
        "review_rating": "8",
        "review_title": "Bergman and his element of loneliness",
        "review_detailed_main": "An old professor who has been lonely for long, having cut off relations with close relatives is on a road trip with a relative to receive his honorary award. During the trip he is wandering off in his childhood of the bitter sweet and nostalgic memories. In his memories there happens to be repentance, sadness and joviality. He also meets a few people along the trip which makes him experience their behaviour. Ingmar Bergman knows to touch hearts and make you think. I think he's obsessed with the concept of loneliness. The screenplay is brilliant. The film is quite high-key and has the ability to make you nostalgic without being too gloomy. Ingmar Bergman makes art!"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "architectdh",
        "review_rating": "10",
        "review_title": "Of loneliness melancholy and childhood love",
        "review_detailed_main": "I have watched this movie several times, each time discovering new meanings. The strongest message Bergman is imparting to us is that old people suffer loneliness, melancholy, and sadness in their old age. The movie is imbued with surreal vignettes, which Bergman uses with great skill to reinforce his messages. It evolves through several vignettes accompanied by thoughtfully crafted dialogues.\n\nThe story begins with the main character Isak Borg introducing himself by lamenting about long-lost human relationships he had abandoned. Immediately after the viewer is introduced to the movie's main theme, the fear of old age and death.\n\nIn the first and likely the most powerful vignette of the movie, our protagonist dreams of walking through a deserted town. While looking at the town clock and his pocket watch, he sees that both have no hands, a clear sign that the end is approaching, yet the time is unknown. Similarly, a watch without hands scene repeats when Borg visits his mother. He then approaches a man from behind and taps on his shoulder. When the man turns, he reveals himself to have an amorphous undefined face with closed eyes, he falls and dissolves. A horse-led carriage carrying a death coffin appears, bumps into a pole, and disintegrates. The coffin cracks open revealing a hand trying to pull the frightened Borg inside the coffin where he sees himself. Our protagonist then wakes up.\n\nMemories resurface in a second strong vignette when Borg meets his childhood sweetheart Sara (played by Bibi Andeson), at their childhood home \"the place where wild strawberries grow\".\n\nIn another strong vignette, Sara asks Borg to look into the mirror so he can see himself, how he is now an old man while she has never changed. This further upsets the old fearful Borg.\n\nWhile the protagonist's dreams throughout are bad, the movie ends with a pleasant one. An idyllic image, one in which Borg is led by Sara to see his parents sitting by the lake with his father fishing.\n\nA thoughtful rendition of 'things' from life presented by a great master."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Xyler852",
        "review_rating": "8",
        "review_title": "It's a Wonderful Life - not really.",
        "review_detailed_main": "I watched this on YouTube. Thanks to whoever posted it.\n\nSometimes I wonder what the reviews of a movie would be if the viewers saw the movie and didn't know who directed it or weren't familiar with any of the actors. Would the reviews be as good or does a movie with a famous director or actor get a bump to a higher rating?\n\n\"Wild Strawberries\" was such a film for me as one who didn't know the actors and knew little of the director and his work except what I read in an old \"Leonard Maltin's Movie Guide\".\n\nReview: The film is very good with wonderful; acting, storyline, dialogue and diverse characters, each going through his or her own bleak ordeal. Despite the gloominess, the film ends on an upbeat note. So if you are unfamiliar with director Ingmar Bergman or Swedish actors from the 1950s, \"Wild Strawberries\" is well worth watching.(Warning: This movie contains no superheroes, literal or figurative.)"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "grnhair2001",
        "review_rating": "9",
        "review_title": "An entertaining film as well as a classic",
        "review_detailed_main": "This director's name conjured up for thoughts of gloomy, impenetrable, symbol-laden fare that one might have to examine ad nauseum in a film critique class. I had avoided watching his films for thirty-five years because of the heaviness of heart, the weariness that these prejudices caused me.\n\nHowever, this film is just a darned good movie. I laughed aloud several times during the film at the interactions between the very real seeming characters. The protagonist learns something about life during the progress of his journey. The dream sequences, far from being tedious or thrumming me on the head with their symbolism, are, to my mind, the most accurate depiction of the dream state I've seen on film. In no way is this film dated. (except, perhaps in that the beautiful women seem normal size rather than the unhealthily thin monstrosities we are forced to watch these days).\n\nWatching this (the Criterion collection version with subtitles) has made me want to see more Bergman films to see if any of the optimism and accuracy of this film are in his other films."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "elenaki-71837",
        "review_rating": "7",
        "review_title": "Okey",
        "review_detailed_main": "Good acting, thoughtful monologues, interesting symbolism. For me the professor didn't look like the cold person he was accused to be during the whole film. Also some cringy scenes."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "kshirasagarnag",
        "review_rating": "8",
        "review_title": "\"Wild Strawberries \"is a realisation of universal truth that the life of human is sweet-sour experience just like Strawberry sometimes its Wild strawberries.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "christopher-underwood",
        "review_rating": "7",
        "review_title": "Not really a fun film",
        "review_detailed_main": "Not really a fun film but certainly wonderful photography and some of the dialogue just a little not very funny. The early dreams are excellent with a little surrealism and just some of the people in the car about rather too long. Victor Sjostrom is just splendid but maybe a little too sad as gradually we are forced to see the emptiness of his existence. The young Bibi Andersson and Ingrid Thulin are fine and will go on so much more."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "SteelBlue82",
        "review_rating": "",
        "review_title": "Reminiscing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "axb",
        "review_rating": "9",
        "review_title": "Old Man reacquires his humanity during a road trip",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "ssssgelojun",
        "review_rating": "10",
        "review_title": "wild strawberries",
        "review_detailed_main": "Beginning: An old dog, a very tidy bookstore, an old pedant writing at his desk, sipping wine, the room quiet enough to the ticking of the clock, begins an objective and proud self-appraisal. To enjoy loneliness, inevitably for the comment of the laity, to earn enough bread, for the love of science, not to waste time proud.\n\nThen, began Mr. Doctor's strange dream: strange empty street, no hour clock, a person's back with withered features, turned around but turned into blood, the drone slowly drove through a coffin, his dead caught his living. The dream was full of emptiness and death, strangeness, fear, danger.\n\nAs the doctor grew old, and perhaps lived for a long time, the concept of time became blurred, day after day after similar day. Death is near, and you have to walk between fear and relief.\n\nThe camera turns and wakes up from a dream, starting the stubborn professor and the maid's trivial argument about whether to leave early or late to collect the prize. The old professor was as stubborn as a child.\n\n\"The essence of life is solitude, and the end of solitude is the field of wild strawberries.\" -wild strawberries"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "IdlyViswanath",
        "review_rating": "8",
        "review_title": "A Heartwarming Tale of A Character's Turn Around",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Turfseer",
        "review_rating": "8",
        "review_title": "An Enigmatic Metamorphosis: Unlocking Another Masterful Bergman Drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "truemythmedia",
        "review_rating": "10",
        "review_title": "One of the Best from one of the Best",
        "review_detailed_main": "\"Wild Strawberries\" is one of the most important films I have seen (for me personally; it might not be for you). It's a film that makes me laugh, that brings me close to tears, and one that makes me meditate very deeply about the way I live my own life, and how the choices I make now may impact others for years to come. Bergman has created a quiet, profound, and very human journey through an elderly man's life, and through that journey he holds up a mirror for the viewer to examine him or herself. Bergman was on of the best directors to ever work in cinema, and Wild Strawberries is one of his very best films."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "yusufpiskin",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "A beautiful meditation on the intersections of the past and the present. This is firstly explored on a personal level, our protagonist's road trip also functioning as a catalyst for journeys back in time: the juxtaposition of moving forward, propelled by an external force, yet looking backwards at every point.\n\nSuch is our experience of time that in moving forward we always glance backwards - I am reminded of Vonnegut's superb comment on the story of Lot's wife in his novel Slaughterhouse Five, that to look back is to be human, especially when we are forbidden. The wonderful observation from all of this in Wild Strawberries is that the past and the present do exist together, that the former forges the latter and that though time affects us in a linear fashion we experience it in a different way, a more flexible way.\n\nThis meditation is only further deepened by the inclusion of the younger generation. These young characters play at adulthood and echo what came before - the older generation see themselves in them. Interestingly, where our protagonist finds nothing but sorrow and regret in the past, they fetishise it in a naive way - using him as their symbol, an anchoring point to an illusory past. They glorify the oldness of the old man, seeing him as an antique and simplifying him with their perspective.\n\nWhat we learn is that all of this is false, the past is not a thing to be but on a pedestal or feared, the past exists in the present."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jordondave-28085",
        "review_rating": "7",
        "review_title": "Down memory lane",
        "review_detailed_main": "(1957) Wild Strawberries/ Smultronstället (In Swedish with English subtitles) DRAMA\n\nWritten and directed by Ingmar Bergman that has former elderly doctorate, Isak Borg (Victor Sjöström) being gruff upon him going on a road trip from Stockholm to Lund, Sweden. Driving along with him is his pregnant daughter-in-law, Marianne (Ingrid Thulin) who plans to separate from her husband, Isak's only son. It was at this point, and during the ride, Isak Borg goes back to memory lane. Making him to reevaluate his life after making a few stops, from the area he grew up to the time he met his first love. Watching this movie reminded me about the Twilight Zone episode \"The Trouble with Templeton\" shown in 1960, and again in \"It's A Wonderful Life\" from 1946. The fourth of 13 movies Ingmar Bergman collaborated with Bibi Anderson."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "lowenand",
        "review_rating": "9",
        "review_title": "Bergman at his peak",
        "review_detailed_main": "In Wild Strawberries (original title: Smultronstället) we follow professor Isak Borg played by the mesmerizing Victor Sjöström. One of the masters of world cinema with a career spanning from 1912 to 1957 as actor and director, here he gives the role of a lifetime. He told Bergman that he was too tired to take the role, then he changed his mind on one stipulation, that the shooting for the day would be over before his daily late afternoon drink. Bergman quickly agreed, and the shooting of the film turned into one of the director's most fond memories.\n\nSjöström's professor undertakes a journey both by car and spiritually. Stopping by the place where he picked wild strawberries as a youth, his memories come flooding back. For the rest of the movie the story interweaves between the present and the memories of the moments that have most shaped his life. On his journey from Stockholm to Lund, he also meets several characters that perfectly fit in with his memories and his questions to himself.\n\nAt the end of the journey Isak comes to a conclusion, a change must come. Is it too late?\n\nEveryone should watch this movie."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "paul2001sw-1",
        "review_rating": "7",
        "review_title": "Early fruit",
        "review_detailed_main": "'Wild Strawberries' is a surprisingly accessible Ingmar Bergman film: the story of an aged doctor who is drawn to reflect on what has made him the person that he is. What's interesting is the depth of the psychology here: this movie was made in 1957, and for it's day, the sophistication of the characterisation is quite astonishing, render it in colour and you could easily believe that it dates from decades later. The style, however, is talky, the cast do their job but the whole experience lacks a little of the intensity of Bergman's later work. Nonetheless, it's a shrewd insight into the nature personality, and ahead of it's time."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "nickandrew",
        "review_rating": "",
        "review_title": "Interesting piece of foreign film-making",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "arthur_tafero",
        "review_rating": "8",
        "review_title": "Wild Strawberries: One of Bergman's Best",
        "review_detailed_main": "During the 1960s, it was quite fashionable to overanalyze Bergman films. Some of his films were good, others were boring, and a few are really gems of cinema. Not every film from any director is good; they all have ones they would like to forget. This film is actually quite simple; if you are arrogant and self-righteous, you have a good chance of being lonely when you enter old age. This is really a cautionary tale; a bit like A Christmas Carol, but without the Future. I can identify with the professor, because I am one as well. I have been arrogant and self-righteous in the past as well. And I have suffered the consequences of my poor behavior as a result. Luckily, I am a half dozen years younger than the professor in the film, which gives me a little time to recover, but not a lot. Bibi Anderson is excellent as well as Skostrom in the lead role. Bergman films always have an excellent supporting cast; especially the housekeeper. Honors like an honorary doctoral degree mean very little in comparison to fostering your personal relationships with other people; particularly family. That is the cautionary aspect of this film."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "HuntersFilmReviews",
        "review_rating": "10",
        "review_title": "Life, love, hate, regret, desires. A deep examination of a man done better than any other film in history.",
        "review_detailed_main": "Wild Strawberries Dir. Ingmar Bergman (1957)\n\nI must first preface this review by telling you that I am 15 years old as of two weeks ago. During quarantine I was often extremely bored because of the minimal school work I was receiving and the repetitive nature of the video games I was playing. As an escape to try and find something better to do with my time I began watching movies. I started out with some of the very highest IMDB rated movies that interested me. The Shawshank Redemption, The Godfather Trilogy, Schindler's List, One Flew over the Cuckoos Nest, Pulp Fiction and Fight Club. I was amazed and completely riveted by the new emotions and worlds I was experiencing. As time went on I attempted to expand my taste and watch some new and unfamiliar styles/types of film making. I wanted to watch some classics so I watched 12 Angry Men (A personal favorite), Casablanca, and Citizen Kane. I was dissatisfied with my opinions on these films because with the exception of 12 Angry Men, they weren't all that enjoyable. Sure, I could see where these films got some of the praise from because they were certainly well made all around. But where was the enjoyment factor? Are \"classics\" not meant to be enjoyed, but rather be discussed in film school In front of a bored class? Last night my entire perspective on that question changed. I had given The Seventh Seal a go sometime In June and was absolutely bored out of my mind and felt like a total idiot. From that point on I felt intimidated and nervous to start a film by a director like Tarkovsky, Kurosawa, or Bergman. For some reason while scrolling through my HBO Max watchlist last night, I decided to watch Wild Strawberries. Wild Strawberries is truly a remarkable stamp on film making and deserves more respect than it gets. The story is touching and human, something everybody can relate with. I don't want to talk about this movie more than I should. After all, I went into Wild Strawberries blind and I wouldn't have wanted to experience it any other way. If you have read my review up to this point and haven't seen Bergman's masterpiece that Is Wild Strawberries, check it out. It's firmly in my ten favorite films of all time and is enjoyable beyond belief."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "dexter10meg",
        "review_rating": "10",
        "review_title": "the image of strawberries",
        "review_detailed_main": "The image of strawberries is central/// To this old prof who's really gone mental/// He confronts old age/// Without any rage/// After all, life's just existential."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jamie T",
        "review_rating": "8",
        "review_title": "Bergman is the man",
        "review_detailed_main": "I,like many others became aware of Bergman through the films of Woody Allen.And on seeing this film I could see not only scenes that have influenced him,but also the style of his direction.I found the scenes when the professor goes back to see his past,i would say reminiscent,but this was obviously from years before,of 'Annie Hall' & 'Crimes & Misdemeanors',among others.\n\nI saw 'Wild strawberries' as part of a season of Bergman films at my local cinema and it surprised me how great the film was.I had previously seen 'Smiles of a summer night',and I knew that this was going to be a far bleaker film.The opening dream sequence is as alarming & frightening as anything I have seen.And I find the scenes between the proffesor and his daughter in law to be very moving.The film was also comical,when we see the twins in the flash backs to his past.\n\nI became interested in film only a few years ago and through Woody Allen,I have found that there is great talent beyond Hollywood,not only talent but 'Wild Strawberries','The virgin spring' & 'Smiles of a summer night' would be classed as some of the best films I have seen,and seeing them at the cinema is certainly a welcome relief from the usual fluff that is released in the summer."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "charchuk",
        "review_rating": "8",
        "review_title": "Emotionally disconnected",
        "review_detailed_main": "I guess my problem with it is that I found the story to be too conventional and I wasn't as emotionally impacted at the film's end as I should have been. The wonderfully surreal dreams and nightmares and flashbacks do a terrific job of outlining Isak's character and his empty life, but I felt that the story in the present didn't accurately reflect what the stories of the past implied. The elder Isak wasn't cold, wasn't harsh, and didn't deserve the loneliness which had crept over him. And, as such, I felt like his character didn't really grow over the course of the narrative, as I didn't think he was that distant to begin with. There's some redemption to be found with his son, of course, but why was that redemption required? I just thought Isak's character didn't fit within the context of the flashbacks.\n\nI suppose I'll probably like it better once I understand Bergman more and watch it again, but for now, I'll just have to be disappointed."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jatinneversaydie",
        "review_rating": "9",
        "review_title": "My first Bergman and i am moved",
        "review_detailed_main": "This movie provides a very pleasant ,calming experience while working on the theme of old age ,loneliness and regret . You start the movie by not liking the protagonist and by the time you end , you have a teardrop for him. Victor Sjostrom has masterfully conveyed the emotions with minimum dialogue.This movie tears your heart to realize that loneliness can be so painful and that one needs to value the relationships in their lives. Some might need to be old to understand and to put oneself in the shoes of Isak."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "kenjha",
        "review_rating": "7",
        "review_title": "Typical Bergman",
        "review_detailed_main": "An old professor reflects on his life. This is a typical Bergman film in that it touches on big themes like love, marriage, death, and God. The handling of these themes is not as heavy handed as in \"The Seventh Seal,\" although the symbolism is too obvious (handless clock = death). Sjostrom is quite good as the professor. Thulin is also fine as his daughter-in-law. Andersson is lovely as the cousin he loved as a young man and regrets not marrying. Apparently in Sweden it is socially acceptable to marry one's cousin. A contrived plot device has Andersson also playing a young woman by the same name as the professor's cousin that he happens to meet in old age, a lazy metaphor for lost youth."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "njp-76097",
        "review_rating": "10",
        "review_title": "Credit for the Car",
        "review_detailed_main": "I think Dr. Borg's car deserves a credit too. It seems to be a Packard 1937. Thank you."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "btongninjaturtle",
        "review_rating": "7",
        "review_title": "Beautiful slice of life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "sl006k",
        "review_rating": "",
        "review_title": "A Feel-Good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "keithhmessenger",
        "review_rating": "10",
        "review_title": "Life's Regrets...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "gonthedon",
        "review_rating": "9",
        "review_title": "Philosophical, existentialist, masterful made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "SpaaceMonkee",
        "review_rating": "9",
        "review_title": "A Powerful, Introspective Journey",
        "review_detailed_main": "Professor Isak Borg is heading into town for an important day: he's about to receive an honorary doctorate to commemorate his lifetime of achievement. The physical journey, however, transforms into an existential one as the Professor faces both the eerie forebodings of his dreams and the personal memories sparked by the physical locations along the way. With his daughter-in-law and a few other passengers joining in on the trek, Professor Borg faces down his own loneliness and must reckon with the factors that caused it. Against the backdrop of societal recognition for notable professional accomplishment, Isak Borg confronts his own profound shortcomings as a human being.\n\nShot with innovative camerawork and told through a series of expertly interweaved memories, dreams, and present-day encounters, Wild Strawberries plants the viewer in the shoes of Professor Borg, forcing us to ask the same fundamental questions about life. It's a wonderful movie that makes you think, while also holding out the hope that redemption is possible, even after a long series of missteps."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "maribabins",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Warmed my heart. One of the most beautiful film that i've seen in my life"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "hyisz",
        "review_rating": "10",
        "review_title": "Bergman's best film!",
        "review_detailed_main": "This film shows a man haunted by his past, by his decisions throughout his life. Every aspect in this movie is fascinating. I believe this is one of Bergman's very personal works."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "tpb-filipe",
        "review_rating": "10",
        "review_title": "Wonderful",
        "review_detailed_main": "An awesome movie. Such a realistic, it makes we think about what really matters in life."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "briancham1994",
        "review_rating": "7",
        "review_title": "Subdued emotion",
        "review_detailed_main": "This film has a very subdued style that unravels emotions in a slow way. It follows the reminiscence of an old doctor who has become bitter and cynical with age. At no point is there any dramatic climax or crescendo to rouse the audience. Instead, we are treated to the man's journeys through his past, both inner (his dreams and fantasies) and outer (interacting with the hitchhikers and married couple). Throughout these scenes, small revelations unfold that show the key emotional points in the man's life which affects the way he sees the people he has met in real life. His time is up but he is not condemned as a person as he learns to connect more fully with his past self and those around him. This film is to be commended for its artistic use of constant poignancy, but it does drag at times."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "frankde-jong",
        "review_rating": "10",
        "review_title": "A road movie encompassing a whole life",
        "review_detailed_main": "\"Wild strawberries\" tells us the story of emiritus professor Isak Borg (Victor Sjöström), travelling from Stockholm to Lund to accept an honorary degree. At first sight Isak Borg seems a friendly old man, but already at the beginning of the film he proves that he is not by the way he treats his housekeeper.\n\nThe rest of the movie is not only a roadmovie (from Stockholm to Lund) but through the places he visits and the memory's these places evoke we also learn a lot about the (selfish) life of professor Borg (as he does himself!). Bergman uses three storytelling techniques to underline the egocentric personality of Borg.\n\nThe first is the conversations he has with his daughter in law Marianne (Ingrid Thulin).\n\nThe second is the interaction with the three hitchikers (2 boys and 1 girl) they pick up. The girl has to choose which of the boys she likes more, the one who is very intellectual or the one who is very sensitive. The girl looks very much like professor Borgs first love (which we met in dream sequence number 2). Not coincidentally these two girls are played by the same actress (Bibi Andersson).\n\nThe third are the three dream sequences. I already mentioned the second dream sequence in which professor Borg meets his first love. The first dream sequence is maybe the most famous. In this sequence professor Borg wanders in a city in which the clocks have no clock hands, hinting at mortality. This first dream sequence made me think of the famous scenes designed by Salvador Dali in Hitchcocks \"Spellbound\" (1945). The third dream sequence maybe not the best known but is in my opinion the most relevant with respect to the theme of the film. In this scene professor Borg has to pass an exam. Much to his surprise the examiner does not ask technical questions but personal questions, to which professor Borg does not know the answers. The exam closes with the following dialogue:\n\nProfessor Isak Borg: (In Professor Borg's dream) And the punishment? The Examiner: I don't know. The usual, I suppose. Professor Isak Borg: The usual? The Examiner: Loneliness.\n\nAt the end of the film there is some sort of redemption. At 76 it is still not too late te change something for the better."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "CinemaSerf",
        "review_rating": "7",
        "review_title": "Wild Strawberries",
        "review_detailed_main": "There's a great scene near the start of this film that sees an horse-drawn hearse get it's wheel caught between the kerb and a lamp-post. The horses persist in moving forward, the wheel comes off and we have a coffin exposed in the middle of a deserted street. A passer-by approaches the coffin only to find it's occupant still alive - and, worse still, it's him! It's \"Dr. Borg\" (Victor Sjöström). Is it portentous? Well it made me smile anyway, as does quite a lot of this thought-provoking drama. It centres around this learned man who is to travel to Lund next day to receive a great honour for his services to the medical profession. In the middle of the night, he disturbs his no-nonsense housekeeper \"Agda\" (a charming effort from Julian Kindahl) announcing plans to drive from Stockholm rather than fly. She's irked and is having none of this nonsense, but she makes his breakfast and packs his case. It's at breakfast that his pregnant daughter-in-law \"Marianne\" (Ingrid Thulin) decides to invite herself along. En route, it becomes clear that she despises the old man, and her bluntness rather shocks him. He readily admits he's a pedantic old grouch, but somehow this cuts him to the quick. After a stop for some petrol at the garage of \"Henrik\" (Max Von Sydow), they pick up some hitch-hikers. Firstly, a group of young and enthusiastic people and then a squabbling couple who seem to thrive on being unpleasant to each other. As we travel, the journey and their companions start him reminiscing about his own life, about the mother of his son and about the joys and tragedies of his own life. It's only when he arrives for his ceremony that he begins to reassess his life, his perspectives and his priorities. Sjöström is super here. He really carries off the role in almost \"Scrooge\"-like fashion. He has taken the emotionally easy way out for much of his life and now finds himself in an unfulfilling cul-de-sac from which it not might be possible to escape. Thulin also delivers well as the deliberately provocative and seemingly unkind woman who spares him none of the knife. There is plenty of humour - dark and mischievous, and we take quite an interesting look at just how toxic introspection can be - at any age. As ever with this director, questions of religiosity and God are never far away, but here they are delivered in a manner than the characters address rather than having us to do that work - and that makes this a far more relaxed, if that word can be used about Ingmar Bergman - and gentle rummage through his theological baggage. The plot is busy and entertaining, and there are plenty of other characters enmeshed in the narrative that give us an opportunity to come up for a breather now and again, and I think this might be one of my favourites from this man."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mikealike",
        "review_rating": "",
        "review_title": "\"You are a coward! Yes I am\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "suryanmukul",
        "review_rating": "9",
        "review_title": "Heart touching for all humans !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "8",
        "review_title": "Good",
        "review_detailed_main": "It was an interesting movie, it's different and has a good plot.\n\nIt was good movie."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "lilballa08",
        "review_rating": "10",
        "review_title": "sooooooooo funny",
        "review_detailed_main": "Bad film ? only occasionally funny ? rubbish ! this film is hilarious , its so funny , the cinema was in tears watching it . This film really is a must see for comedy fans , because it's really not bad its great . You really will enjoy this film . It's funny , younger kids and teenagers will love it , but adult will like it too , its something for everyone who likes comedy . so freakin funny! THis movie was hilarious!!!It was predictable i admit, but the jokes were super funnya.\n\nIt's hard to find a Bergman movie which isn't funny, and this is even harder to classify as, 'not funny'...because it is the funniest! I gotta admit I haven't laughed this hard since Citizen Kane!"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jboothmillard",
        "review_rating": "8",
        "review_title": "Wild Strawberries",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Koundinya",
        "review_rating": "10",
        "review_title": "\"A man who doesn't spend time with his family can never be a real man.\"- Don Vito Corelone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "riadmsh",
        "review_rating": "9",
        "review_title": "really stands the meaning it wanna convey",
        "review_detailed_main": "Loveless marriage...loneliness...self-centered...coldness...all these human natures r so stingy.....this film....if properly understood....really stands the meaning it wanna convey"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "bachi_2805",
        "review_rating": "7",
        "review_title": "A memorable must watch, though mostly boring",
        "review_detailed_main": "Most scenes are memorable and the acting is great. But the film could have benefitted with editing out many pointless scenes and placing some new ones (I know, I'm asking for too much).\n\nIt's subtle, as are all of Bergman films, but it has its moments of brilliance (which are also subtle).\n\nThe main character is a lovely old man, yet he is the villain (this is also subtle).\n\nPersonally, I would have the guys going to Italy simply go to Italy without ever stepping on this film. They crack some laughs, but they are totally off topic and steal too much screen time.\n\nBlack and white is properly utilised, creating some memorable scenes. But some compositions were as bland as any other boring stretched out 50s road trip flick.\n\nTo summarise, I liked the opening and closing scenes (subtly great), the middle could have done with some editing."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "StevePulaski",
        "review_rating": "10",
        "review_title": "Raw strawberries with a sweetness and an identifiable zing",
        "review_detailed_main": "Despite the amount of weight Ingmar Bergman's Wild Strawberries brings to the table, there's an incredible amount of ease and earnestness in its story, blooming from its leads and the overall subject matter that it so brilliantly handles. Unlike his previous effort, The Seventh Seal, made the same year as this, Bergman unfolds more of a Charles Dickens-esque story, more centered on the modern world rather than the Middle Ages, and a one about how a man can see his childhood memories with piercing clarity, yet can not fathom or even begin to be piece together his present life.\n\nThe man is Professor Isak Borg, played by the marvelous director Victor Sjöström. Isak is the bossy and stubborn professor of bacteriology, who resides in a small home with just a house maid for company. He must make the lengthy trip from Stockholm to Lund to receive an honorary degree after graduating from Lund University fifty years ago. Ingrid Thulin is Marianne, his pregnant daughter-in-law who is planning to divorce her husband once the baby is born. She views her father-in-law much like the rest of the world; snotty, ungrateful, and unimportant.\n\nIt is during this long car trip that Isak begins to see through to his inner-self. This newfound exercise is assisted by three different groups of people he encounters. One is the relationship with his close family, which is closed-off to his mother, daughter-in-law, and son. Another is with people he encounters while on the road, like a bickering married couple, who relationship is apparently physically and verbally abusive, along with a group of young hikers. And the final relationship is with the man's own psyche, which writer/director Bergman does not hesitate to plunge deeply into.\n\nWe see Isak's psyche through metaphoric and sometimes disturbing dream sequences, one of which takes place right at the beginning of the film. The dream involves Isak walking down an empty road, disillusioned and confused. The clocks do not have hands on them, and everything appears washed-out and unusually bright. We see a horse-drawn carriage collide into a pole, releasing one of its wooden wheels. The horse scurry off frightened when a casket falls off the carriage, opening slightly, revealing its contents to be those of Isak's. The \"body\" attempts to pull him in right before Isak can snap back into reality. That scene plays like a short film in itself and is surreal and poignant, offering more than words could ever.\n\nWild Strawberries is a treat everyone should indulge in. It provided me with one of the most thought-provoking characters I've ever seen - someone who can connect and get on the good side of those he just meets, but truly takes advantage of and detaches himself from those close to him - and gave me one of the rawest and interesting dramas I have yet to see.\n\nStarring: Victor Sjöström, Bibi Andersson, Ingrid Thulin, and Gunnar Björnstrand. Directed by: Ingmar Bergman."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "yanda_ever",
        "review_rating": "7",
        "review_title": "Good, but boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "bobsgrock",
        "review_rating": "",
        "review_title": "The art form of life.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "FernandoRainer",
        "review_rating": "9",
        "review_title": "A Redemption Governed by Hope.",
        "review_detailed_main": "The film is a neutral interpretation of death and aging, with perfect acting.\n\nThe story is about a great professional with imperfect relationships, but he is willing to change despite his pessimistic traits about mature life.\n\nThe main character's trajectory is like a box of surprises, some bad in his eyes and others good. The film is subtle like life, it plays tricks, reliving memories, feelings, memories and preparing us for a new phase of maturity, a new stage of life.\n\nWild Strawberries captivates us in every scene, it is a gentle film, like an embrace of life, it is a redemption governed by hope. Each character represents ideas and phases of life, together they form a very strong point of view, a period, a phase after that, a cycle, in short, life."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jounimak",
        "review_rating": "10",
        "review_title": "The best movie I have ever seen",
        "review_detailed_main": "I saw Bergman's Wild Strawberries first about fifteen years ago. Since then I have watched the film at least once every year. Every time I watch it the same deep emotions are wakened. I most preferably watch it alone at home, so I don't have to hide my tears. Think about it. A 52 years old rough man shedding tears over a movie.\n\nThe film tells us that it is never too late to change your ways, if you want to. Old professor begins to see and analyze mistakes he has made in his life, hurting all people closest to him. Cold, cynical, indifferent attitude has infected also his son Evald, whose wife has come to stay with our professor. During one day, guided by his daughter-in-law and his own memories and nightmares, professor Borg seems to realize that he needs to start a new path in his life.\n\nThis is Bergman at its best. A serious film in which there is humor and beautiful scenes to make this masterpiece easy to watch. This movie really is above all comparison, only 10 points because no chance to give more, 100/10 would be fair :-)."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mehobulls",
        "review_rating": "8",
        "review_title": "My favorite of his I think.",
        "review_detailed_main": "Is everything we do in this world will deliver something someday? This film does not give you an answer, but consideration. As well as all things in this world, the answer is yourself. I really like how Bergman makes stable tempo and film pacing. Bibi Anderson played 2 roles very well. So many allegories are applied in this film, but that is precisely the metaphor that makes us aware of the meaning of the story."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "BenT17",
        "review_rating": "8",
        "review_title": "Thought-provoking and inventive",
        "review_detailed_main": "Wild Strawberries is the second Ingmar Bergman movie I've watched, and I'm starting to seriously consider going through his entire discography. Both this and Persona feel incredibly ahead of their time and inventive in how they utilize the medium to tell stories and explore theme. The level of creativity and craftsmanship pulsating through nearly every frame of these films is amazing, and I'm seriously impressed in how Wild Strawberries and Persona are both equal parts artsy surrealist pieces and grounded narrative dramas.\n\nAs for Wild Strawberries in particular, I became promptly interested in watching it after stumbling across an excerpt of the iconic opening dream sequence online, which, in its full glory, is just as entrancing as I had hoped. The entire film is so astoundingly poetic and rich with meaning, yet Bergman rarely comes across as heavy-handed.\n\nOverall, it's awfully close to being a 9.0, but, although I was consistently enveloped in the film's melancholy and doldrums, there rarely came a singular moment that hit me inordinately hard emotionally. Regardless, this is a timeless film with even more timeless themes. Plus, its final message is surprisingly inspiring, warm, and hopeful, especially considering Bergman's notorious nihilism.\n\n8.9 / 10."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "glakshmiratan",
        "review_rating": "10",
        "review_title": "An ontologival incestigation by Suffering's last son",
        "review_detailed_main": "Like Dostoevsky, Hamsun, Strindberg, Kafka and Camus, Bergman throws himself in front of the reader. After reading his autobiography, you are forced to ask yourself, \"was Isak Ingmar?\" Is the movie a window into the greatest exponent of the 20th centuries art form? Or, is it a mirror for us to reach inside and grab by the throat a future that seems inevitable? No artist since Bernini has depicted pain as Bergman has. In Wild Strawberries Bergman has a given a man, frail, worn of by Christian in-action (in the Niezschean sense). It is arguably the most positive, this-life-enforcing movie that can viewed. I have refrained from quoting any specifics. I would hate to ruin the movie for someone who is harping on whether to spend 90 minutes on it. My suggestion, do it; thrice over; every year.\n\nThis movie, along with Hamsun's Hunger, Dostoevsky's Notes, is the pinnacle of man's love for the dirt that hides under his nails.\n\n(I am amazed at how different the subtitle are on a criterion disc. I feel they are literal, often compromising the poetic essence that is present in other non-criterion discs sold by the Swedish Art Institute. I am torn apart as to which is better, but, if you are like me, and see Bergman as a genius whose essence is to be captured in full, see both. I would advice looking at Walter Arndt's introduction to Eugene Onegin, and the difficulties of translating Pushkin. I cannot help but wonder if Bergman is looking at us with scorn for sullying his legacy.)"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "evening1",
        "review_rating": "8",
        "review_title": "\"No intimacies for me, thank you\" v. Don't hold back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "rdiogotg",
        "review_rating": "10",
        "review_title": "Thank you",
        "review_detailed_main": "If you don't adore this film, you should (finally) go on and try to read a book ( as small as it is) from its first word to its last"
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "PedroPires90",
        "review_rating": "7",
        "review_title": "Ok",
        "review_detailed_main": "This is praised as one of the favourite film of many directors, so I was expecting a masterpiece. I didn't feel it was.\n\nI had the same issue I usually have with Bergman's films: the 2nd act. He usually introduces very well the characters and the main themes and the third acts are usually strong (even if I was not entirely satisfied with this very final scene), but the middle is usually...boring and repetitive. Here a bit more because is overcrowded with flashbacks and exposition.\n\nEither way, when the film works, it really works. Some dialogue is fantastic, the evolution of the relationship with the daughter-in-law really well done and it makes you think about life, choices and happiness in general. I just feel that some films work on the same themes in a better way and were much more impactful to me."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "lso-soares",
        "review_rating": "9",
        "review_title": "Beautiful filme about old age",
        "review_detailed_main": "Wild Strawberries (Smultronstallet) is a 1957 Swedish production, in black and white, directed by Ingmar Bergman.\n\nIn the cast, also director Victor Sjostrom in the role of Izak, an elderly doctor who reviews his life while traveling in his car to another city in which he will receive an important award at Lund University. There is also the beautiful Bibi Andersson, a constant actress in Bergman's films, playing the double role (Sara/Hitchhiker). In the present, she is the young woman Izak gives a lift to, and in the past, the young woman the doctor courted.\n\nDreams and thoughts indicate that the famous doctor, with fifty years of profession, fears the approaching death.\n\nIn this whirlwind of thoughts, he rethinks his actions and approaches his daughter-in-law Marianne (Ingrid Thulin), his faithful maid Agda (Jullan Kindahl), also elderly, and his son Evald Borg (Gunnar Bjornstrand).\n\nA contrast between the vigor of youth, both in the physique and in attitudes and debates, and old age, with an emphasis on wisdom, recognition for work and why not, the grumpy characteristic of the elderly.\n\nBeautiful film about old age.\n\nReviewing it once more, this time for a class on the Bergman Cycle of the Film Analysis Club (Cinema with Theory), I transported myself to the 80s, in a hectic session of the Cine Clube of the Academic Directory of the Faculty of Economic Sciences at UFMG , where I graduated in Economic Sciences.\n\nRight after the film was shown, in a poor VHS copy, the debate was heated, reproducing, in the school auditorium, the discussion about religion that young people have in one of the scenes of the film.\n\nA must-see for all those who love cinema."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "jamesjustice-92",
        "review_rating": "10",
        "review_title": "Crumbling place",
        "review_detailed_main": "I rarely watch movies in another language. For some reason it doesn't make me enjoy it as much as I could have if I would have known what the people are saying right away instead of looking at the bottom of the screen all the time and reading their lines. That's what makes silent movies stand out above all - there are intertitles for explaining and we don't miss out on the characters' play. But it is hardly a worthy reason not to watch a movie.\n\n\"Smultronstället\" was directed by Ingmar Bergman and the title can be translated in many ways such as \"cuddle the faith lightly\" which gives out a philosophical undertone behind the movie but doesn't make a good title whatsoever; another version is \"crumbling place\" which is probably the closest to the main idea but worldwide this gem of Bergman's is known as \"Wild strawberries\" or \"The wild strawberry patch\". And I just love foreign language movies for it - they give you so much food for thoughts without even having to have you watched the movie, just by showing you the title.\n\nThe first time I watched \"Wild strawberries\" was in 2010 when I was a sophomore at the university and I remember liking it instantly. Now, twelve years later, nothing's changed. This movie is still the best work of Bergman's (although I've seen some of his movies, this one is simply out of reach from the rest); it may not have the best visuals and from time to time you can't help thinking that you're watching a sound motion picture but in the silent movie style or a stage play in the theater or even a book itself played scene by scene - and it all sums up into a true masterpiece with a thoughtful plot that leaves you thinking for hours afterwards, well-written and vivid characters with the lives of their own (even the secondary ones) and brilliant direction by Bergman who had put a big part of himself in this great work.\n\nI also would like to point out Victor Sjöström, the director and actor, one of the pioneers of Swedish cinematography from the silent era, whose outstanding performance had led \"Smultronstället\" right into my heart."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "noahgibbobaker",
        "review_rating": "8",
        "review_title": "In comparison to 'The Seventh Seal'.",
        "review_detailed_main": "It's hard not to look at 'Wild Strawberries' as a companion to 'The Seventh Seal' - and a contradiction or supplement. If 'The Seventh Seal' is Bergman' acceptance of death, 'Wild Strawberries' serves as his acceptance of regret... an acceptance that 'The Seventh Seal' does not share. The idea that death is best without regret is huge in that film, while in 'Wild Strawberries' death is still embraced, and not without remorse. Life isn't lived without regret."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "patryk-czekaj",
        "review_rating": "8",
        "review_title": "Wild, wild strawberries..",
        "review_detailed_main": "Wild Strawberries should be considered essential viewing for anyone, who wants to get in touch with Ingmar Bergman's great directorial career. It's one of those movies, along with The Seventh Seal, that discuss the theme of a meaningful journey, covered with existential dilemmas and spiritual moralities.\n\nDr. Isaak Borg, an old and very acclaimed professor, is about to travel from Stockholm to Lund in order to receive an honorary degree. Normally he would've taken the plane, but due to a eerie dream that haunted him the previous night he starts to reminisce about his whole life, and finally decides to ride there by car, just to have some time for himself and those piercing thoughts of various matters. Yet, along with him comes his daughter-in-law Marianne. In a series of honest exchange of views Isaak realizes how meaningless and full of void his life has been up to this point. He shut out all of the relationship that he had and concentrated only on his selfish life made up of hard work and materialistic needs. Even though he achieved respect in the scientific world, in the humanity's entity he has been dead for a long time now. Emotionless and cold- as-ice, he wasn't able to take care of any person that longed for his attention.\n\nSomewhere along the road they stop at the house where Isaak grew up. His hazy memory shows him a few scenes from his early life, and how really bitter and depressing it has been. Without love and warmth, even from the girl he wanted to marry, he blocked his deepest emotions and became as ruthless as the people he was surrounded by. And it all passes down in the family, as it seems that his son is as heartless and dismal as his father. Thoughts of death occur on a daily basis, as if the pain of being alive was too hard to bear.\n\nIt's really paradoxical, that the only people that ever thought of him as a nice and friendly man were those, who didn't know him one bit: the family at the gas station, and the three young people he took along on the ride.\n\nBergman placed them fantastically in the story to present a sharp contrast between the cheerful young fellows and a sorrowful, nearly dead, old man contemplating his empty life. There is also a notion of the existence of God that those three characters bring onto the screen.\n\nIt's as if Bergman wanted to evaluate Borg's fatalism with contradicting it with the possibilities of an afterlife. His body is still functioning, but in the spiritual meaning he is long gone.\n\nOn the side of cinematography, this divine problem is also brilliantly shown by the nightmare that haunted Borg that night. He stands on a street, in a place devoid of time, where people melt and die. Then comes the metaphorical black stagecoach carrying a coffin with Borg inside. Is he still alive, or is he dead? An image that would scary anyone, I suppose.\n\nIn the end apart from deep empathy I somehow felt happy, as the final scenes provide some kind of a reprieve for Borg. Even though he lead a life of emptiness and was never kind to anyone, and valued death over life itself, at the end of the day he finally caught a glimpse of what real remorse may feel like."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mordinn",
        "review_rating": "8",
        "review_title": "A simple story about various important topics",
        "review_detailed_main": "The film is simply magnificent, it talks about simple things. And yet these are the most important things in our lives. It's about loneliness, about the long life of a person who has gone through a during his life, about his memories and dreams. About thoughts whether he spent his life \"the right way\" and the realization that maybe not everything should have been done the way it happened, and, despite being late, still attempting to fix it.\n\nThe movie leaves very bright feelings after watching it. The film is filled with a bittersweet sense of melancholy.\n\nA great work, no more and no less. Simple and ingenious."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "paulclaassen",
        "review_rating": "7",
        "review_title": "What if...?",
        "review_detailed_main": "78-Year old Professor Isak Borg is about to receive an honorary degree in Lund. After a disturbing dream, he impulsively decides to drive by car from Stockholm to Lund instead of flying. His daughter-in-law Marianne, who has been visiting him, decides to travel with him. As we learn later, Marianne is married to Isak's son, Evald, but is planning to separate from him because she is pregnant with their first child, and he does not want children.\n\nAlong the trip he meets a young girl named Sara, her boyfriend Anders and friend Viktor (although she can't really make up her mind whom she loves most), who hitches a ride with him. On the journey, he recalls memories from his past, and reflects in reminisce on his life. At times past and present intertwines, with an aged Isak reliving his past.\n\nI found the film very entertaining, and also quite funny. His mother, Mrs Borg, especially was hilarious. Victor Sjöström delivered a heartfelt performance as Isak, a man who came face to face with many regrets and disappointments he suffered over the years. There's also the burning question \"What if...?\" The film effectively illustrates how a simple decision effects the course of life, and how different it could have been had you decided otherwise."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "x_manicure_x",
        "review_rating": "7",
        "review_title": "Poetic",
        "review_detailed_main": "The most uneventful road trip of the history cinema, along with an old man's bittersweet memories and life reflections. Like Proust's infamous madeleine, Isak Borg's strawberries trigger a series of idyllic flashbacks and disturbing nightmares that make him realize how little he knows about the world, how he was after all the leading cause of his own pain and loneliness. It's an incredibly poetic and melancholic film, but I have to confess that I expected it to get much deeper into the characters' psyche."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "dshrinet",
        "review_rating": "",
        "review_title": "Loneliness and memories from the past",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Scodelli",
        "review_rating": "8",
        "review_title": "Existential Journey",
        "review_detailed_main": "An old, aging professor goes on a trip to accept an honorary degree.\n\nThe film uses this as a backdrop to consider death, meaning, legacy and the profundities of life.\n\nThe plot is mainly existential rather than physical.\n\nThroughout the journey, through a series of flashbacks and dreams, parts of the old man's life are revealed.\n\nAnd the dreams reflect his history but also engage with the nature and themes of his life and personhood.\n\nHe starts the journey as a cold and inconsiderate man. Yet the journey(inward and outward) exerts it's influence.\n\nI am amazed at the script of this film. How it smoothly and artfully navigates the series of dreams, flashbacks and the physical journey.\n\nIt is a profound work of art. The direction is masterful, of course.\n\nIt is a profound exploration of death, meaning, legacy, destiny. Artfully expressed in many ways.\n\nIt doesn't force any specific conclusion upon us. But instead remains open ended.\n\nThat is a strength of the film. There is this exploration. And within that exploration a profundity arises that's affecting in a very fundamentally human way.\n\nCriterion calls this movie \"a very humane film\".\n\nAnd it is. Though it deals with some dark themes it's hopeful and infused with moral undercurrent.\n\nThere's a gentleness and a wholesome quality to this film.\n\nAbout how our main character grows throughout the film.\n\nI consider this a great introduction to art house cinema.\n\nThe themes and ideas explored give this film a great re-watchability.\n\nThe direction is wonderfully artistic. The camera work, iconic images, the film's nuance, it's masterful script.\n\nIt's a great and thought provoking film."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Alex_Lo",
        "review_rating": "8",
        "review_title": "Extraordinary!!",
        "review_detailed_main": "Anyone who wants to write dialogue and characters for a book, stage play or a film should have seen this film. And that's just the tip of the iceberg ..."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "denis-23791",
        "review_rating": "8",
        "review_title": "A thoughtful look at life, love and family values",
        "review_detailed_main": "The professor's road trip to his award ceremony turns into a journey to his past, his memories and the question what might have been and why things turned out the way they did. He learns a lesson in compassion and friendliness while he ponders the purpose of life. Very well played and directed. Charming cliche selection of pretty women. Picture book like staging of family memories and impactful dream sequences."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "zzhhhqing",
        "review_rating": "9",
        "review_title": "I hope I won't have so much confession and stubbornness when I reach the end of my life.",
        "review_detailed_main": "I have never felt this kind of loneliness in my short 20-year life. In fact, I am even more cruel and even cruel than him. I thought that I could be invincible. Maybe I was wrong."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "zeekwunlau",
        "review_rating": "7",
        "review_title": "Smultronstället",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "alireza-akhlaghi84",
        "review_rating": "7",
        "review_title": "Think Deeper",
        "review_detailed_main": "This time will come, and how good it is that there are movies to practice flexibility before we become statuesque, autocratic and dictatorial human beings. Above all, these movies remind us to be better throughout our lives. Isaac is a representative of many people even today. Those who think that because they have successfully followed the path, then they have followed the right path. No it's not like that. We have to move logic and emotion together. Somewhere our feelings should overcome our logic and somewhere else vice versa. Apart from the drama of the film, the aspect of reminding and re-education of the film was attractive to me because I, as an audience, should get more benefit from the film I watch.\n\nAlireza.akhlaghi.official."
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Shannon-32",
        "review_rating": "",
        "review_title": "Interesting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "krational66",
        "review_rating": "7",
        "review_title": "balance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "fenrir-41170",
        "review_rating": "7",
        "review_title": "Comment on its non-linear narrative and attempt at Isak's Diary entry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "federovsky",
        "review_rating": "",
        "review_title": "Sophomoric musings on mortality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "An Introspective Piece On Loneliness, Remorse, Faith, Forgiveness & Self-Reflection",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "mkql",
        "review_rating": "",
        "review_title": "A Hodgepodge of Philosophy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "eowyn_in_gondor",
        "review_rating": "",
        "review_title": "Deserves a remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0050986",
        "movie_name": "Wild Strawberries",
        "movie_rating": "8.1",
        "review_username": "Miele-3",
        "review_rating": "",
        "review_title": "\"Wild strawberries\" is a completely boring film about a boring old man, his boring son and the rest of the boring family.",
        "review_detailed_main": ""
    }
]