[
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "mad_men",
        "review_rating": "5",
        "review_title": "It all happened these last 10 years.",
        "review_detailed_main": "If you are not a Spice Girls fan or if you expect something serious you are not gonna like this movie for ovbious reasons. People just want to slag them off cos they were huge and they made mistakes but don't care for what they represented, marketed or not.\n\nBut if you are a Spice Girls fan or like them you must have noticed that a lot of the things from this movie have become true, therefore it is really funny to watch it now a days... and find this hidden things.\n\nAlso if you've followed their solo carrers you must know that, they respected everything they used to stand for. This movie is full of good messages presented in a way for the young fan base that they had back then, people that now have grown up believing in good values that should come back.\n\nAre they gonna make it in time for their performance?? We'll find out soon. ;)"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "solid-rock800",
        "review_rating": "5",
        "review_title": "A decently fun bit of nothing",
        "review_detailed_main": "Y'know, usually when a movie has basically no plot, that's be enough to totally knock it down. Spice World has a plot that's like, thinner than paper thin - and this might sound like I'm giving you a spoiler here, but trust me, I'm not, haha - it's basically that you've got the Spice Girls, and they do some stuff, and it kind of all strings together somehow. But because the girls are so fun to watch, and there are some pretty funny jokes and random humour in it, it manages to keep its head above the water despite having no plot to speak of.\n\nSo y'know, if you want a fun bit of nothing that doesn't make a ton of sense but leaves you feeling kinda good nonetheless, this is a good movie choice."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Howlin Wolf",
        "review_rating": "5",
        "review_title": "Completely unremarkable in every way, shape and form...",
        "review_detailed_main": "... but that statement alone immediately makes it superior to any number of \"Wannabe\" (Arggghhhh!) Oscar-winners that are actually pretentious cr*p. I know it's a cliche, but this film has a clear idea of its place in the scheme of things, and it knows it's not got a shot of toppling \"Citizen Kane\" from the public's affections, so it just sets out to have fun. Whether the audience will be doing the same is a different matter entirely. If you can stomach random sequences strung together with barely an excuse for a plot, and countless jokes that can most kindly be described as of the 'hit & miss' variety, you should be alright. Hey, if you watch this movie of your own volition and STILL feel you are justified in complaining that it's awful, you deserve everything you get. Myself, I think it's churlish to overly criticise such a harmless piece of fluff that is obviously desperate to be liked. So I won't. It's about as good as could have been reasonably expected. (There I go, damning it with faint praise!)\n\nIncidentally, of the girls, only Victoria shows the ability to at least deliver a line adequately. Having said that, don't expect her to be appearing in a Scorsese movie anytime soon (There I go again... !)\n\nWe'll just ignore the fact that numerous actors belittle their art in various cameo appearances. (Grant, Hoskins & Cumming, I'm looking at you!) Notice I didn't include Roger Moore in that group. I didn't think it appropriate. After all, this is just his level."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "TheEoghShowOld",
        "review_rating": "",
        "review_title": "In a league of its own",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "cossallpsycho",
        "review_rating": "1",
        "review_title": "MAKE THEM STOP!!!!!!",
        "review_detailed_main": "Oh, what has the world come to. I'm worried for the sanity of everyone who has watched this and even more worried for those who haven't seen it and are going to...For the sake of mankind don't do it. This is quite simply a terrible movie. It's not funny in the slightest, after approximately 20 seconds the girls become unbearable and make me want to break something. I know that this movie is not really about the acting but trying would have helped. Admittedly I am not exactly the biggest Spice Girls fan but I am extremely open minded but it doesn't matter how open minded you are, it is close to impossible to enjoy this big, ugly, embarrasing piece of film. I hope to God that they don't do a sequel."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "mm64",
        "review_rating": "1",
        "review_title": "Only movie I've ever walked out on",
        "review_detailed_main": "I went to see this film with several friends in the winter of 97. My only comment is that this movie is the only film I have ever walked out on. It is, without a doubt, the most waste-of-time move I have ever seen! This, coming from a person who generally likes tacky \"B\" movies."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sgtdraino",
        "review_rating": "1",
        "review_title": "Had to see it for Richard O'Brien and Meat Loaf, felt sorry for them.",
        "review_detailed_main": "Had always heard this movie was NOT good, and was never a fan of the Spice Girls, so until now had avoided this one like the plague. But my buddy insisted that it is one of those movies you can enjoy BECAUSE it's bad, a la MST3K.\n\nAnd then I heard that this movie had both Richard O'Brien and Meat Loaf in it, two stars from Rocky Horror Picture Show. I was interested to see those two actors together in a movie again, so I decided to give Spice World a try.\n\nI do not exaggerate when I say Spice World was one of the most horrifying and painful viewing experiences I have ever witnessed, and that's even accounting for the fact that I was able to (thank you Lord) skip through the millions of vacuous musical numbers using my tivo.\n\nI don't think there was a single good performance in this movie, not even by the real actors in it. Meat Loaf and Richard O'Brien are, of course, wasted. Few speaking lines, no musical contributions, really just cameos.\n\nFor those who like bad movies (i.e. enjoy making fun of them MST3K style), this is still NOT a good movie for you. I think that's because the movie is already supposed to be a comedy. For some reason, it's difficult to crack funny jokes at a bad comedy. Maybe that's why MST3K never used comedies in their show. The bad humor cancels out your good humor, somehow.\n\nAnyway, a movie to avoid at all costs. Zero stars."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "adam b",
        "review_rating": "1",
        "review_title": "Every bit as good as their music . . . unfortunately.",
        "review_detailed_main": "I was actually pretty apathetic of the Spice Girls until I saw this movie, but this is too much. This is the first English-speaking movie I've seen that requires English subtitles so you can figure out what the little darlings are saying. Fortunately, there's no plot, so you just treat it like a 90 minute long music video. For an added challenge, see if you can resist the urge to keep from clawing your own eyes out of their sockets while protecting your ears from bleeding while the gals sing and prance their way into your spleen. A spice world is a cruel world, indeed."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "liam-tully",
        "review_rating": "1",
        "review_title": "''spice girls forever!'' well at least until weve made enough money!",
        "review_detailed_main": "Well i cant blame them.They made pop ''careers'' without beein able to sing,so i suppose it was only natural for these squawking unintentional anti feminists to assume they could make a movie without beein able to act!Bad script,worse songs and terrible acting aside,this film SUCKS on one major factor-the ridiculous ''we're all pals''image thrown in our faces by all of the girls.This movie is even worse in hindsight because now its more obvious than then that all of this was fake,the girls were a manufactured band and some of them actually hated each other.Although its not possible to score this film zero anyway,i would still score it one point for one thing,at least appearing in this crap and exposing a SEVERE lack of talent,has meant that there is no risk of Victoria Beckham being offered a movie role.Be thankful for small graces!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sapienza",
        "review_rating": "1",
        "review_title": "Well, at least I didn't go blind.",
        "review_detailed_main": "I went to see Spice World on opening night with some friends (no, I am *not* a 12-year old Girl -- I'm a 21-year old College Student), fully expecting to see a 2-hour long commercial for the Spice Girls. The only other people in the theater with us were some teeny-boppers dressed up like the Spice Girls and some gangsta wannabes, who were probably hoping that there might be a flash of nudity. By the end of the movie, the wannabes had thrown all their drink ice at the movie screen and were booing it out loud. This is one reason not to watch this movie, even on video at home. There is a chance the ice you throw at the tv screen may somehow harm it, and your booing will wake the neighbors.\n\nThe teeny-boppers were not impressed with everyone else's responses to the film (violent vomiting, painful spasms), but I'm sure they've seen it another 40 times on video, alternating it with viewings of Titanic.\n\nIn short, this is a bad movie. A very, very, very bad movie. If you have read Douglas Adams' \"Hitchhiker's Guide to the Galaxy\", then think of it this way: it is only slightly better than a Vogon poetry reading.\n\nI wouldn't advise you to see it, but if you do, look out for:\n\n1. The suits the tv guy wears. He's a pretty spiffy dresser.\n\n2. The bus-jumping scene. This was just kitschy enough to *actually* be funny.\n\n3. Roger Moore. Pity him. He was once a Bond."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "matrix29",
        "review_rating": "1",
        "review_title": "Great girls, worthless movie",
        "review_detailed_main": "The Spice Girls deserved the brutal fall from grace for this cinematic blunder. Although the girls are talented and have full personalities they are buried under tons of lousy plot twists. It starts great and then comes the moronic \"drama\" moments with Roger Moore (what a waste of a greatly talented actor) then the other \"drama\" with Bob Hoskins & Mark McKinney which serves only to irritate and detract. Every \"drama\" scene drains the movie of any fun shown before. Half way into the film it becomes really bad. Frankly I felt the director said, \"We got their money, who cares what they see next?\" Then the film becomes a cheap montage of lousy sets and action. What is truly sad is that the Spice Girls do have talent and actually interesting personalities. They deserved a good movie to showcase their skills. And this movie dragged them off the stage. I was a fan and I felt exploited and insulted by this worthless film. I hate the Spice Girls because of this film. It bluntly stated, \"We feel our fans are idiots. They'll gladly buy any cheap item we drop in their laps.\" This movie has made me disgusted with the Spice Girls. They obviously care as little for their fans as they did with their careers. The only movie that I ever walked out on (and I've seen some unbearable stinkers in my time)."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "briparker",
        "review_rating": "10",
        "review_title": "Is it REALLY a 10/10 star...no",
        "review_detailed_main": "Is it REALLY a 10/10 star...no. But for pure nostalgia, goofy fun, and to counteract the grouches who hate fun, I'm giving it a 10. Girl power, b*****s."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "passthepopcorn6",
        "review_rating": "6",
        "review_title": "Nostalgic...",
        "review_detailed_main": "When I was seven and this movie came out, it was the biggest thing around. Everyone wanted to be the Spice Girls. After they split up and weren't cool anymore, everyone forgot about the movie. But ho, ho, what's this? Years later, here I am cleaning out my old Disney and Barney videos and stumble across my old friend that I used to watch everyday. Even at my old age of fifteen, never failed to crack me up.\n\nObviously, this isn't meant to be a contender for Oscars. Anyone can see that. But I can't find much to hate about a movie that's practically the visual to go along with the song \"Girls just wanna have fun.\" That's all it is, fun. And a lot of good fun at that. It's just a guilty pleasure, and it's so much fun to watch it with old friends singing into hair brushes and wearing feather boas. You just need to keep in mind that it was publicity for their new record and it's not meant to be one of those heavy movies you over-analyze. Recommendation: This movie is much funner when you watch it jumping up and down on a couch like a seven year old."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "SteveNo96",
        "review_rating": "1",
        "review_title": "have you never been afraid?",
        "review_detailed_main": "I actually was forced to watch this by my cousins at the time. This movie made me want to gag but at the same time, these kids who were 9 to 11 years old enjoyed it immensely. Now they've all moved onto bigger and better bands and I still have bad memories that will probably stay around forever."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "Entertaining silly fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "bek-12",
        "review_rating": "1",
        "review_title": "YAAARRRGGHHH! THE PAIN!",
        "review_detailed_main": "My God, this is a Truly Horrid Movie. All this movie has going for it is some good looking girls (and the music, if you like their music, which I don't). The acting is horrible, the plot is infantile (at best), and the dialog is stupid. AVOID AT ALL COSTS.\n\nAn interesting side-note... almost everyone either voted 1 or 10. I suspect the people that voted 10 will mature in a few years and block out this embarrassing portion of their childhood."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Brade",
        "review_rating": "1",
        "review_title": "make the pain stop!",
        "review_detailed_main": "Could it be the worst film ever? Possibly.\n\nCould it be used to extract information from even the most dangerous of spies? Definitely.\n\nSheer torture does not even begin to explain this film. Obviously you should like the Spice Girls if you hope to enjoy this movie, but how can any sane person appreciate such a contrived group of utter fakes? Those who are manipulated by our society's every whim, that's who..."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "claudja777",
        "review_rating": "1",
        "review_title": "Mah!",
        "review_detailed_main": "Without a plot. Without any idea of cinema or common sense. Impossible to watch without feeling embarrassed for them.Can Roger Moore deal with the fact he was in it? It's not even enough funny- or better, is not funny at all- to become a \"cult\".It's just filthy garbage who can be justified just with the fact that some actors in the cast -and the \"director\" too- probably needed to pay the rent. a LOT . And the girls? \"like to shot on the red cross\".Left me so speechless I can't even fill the ten lines ,maybe I should just report the reactions of the public-age average:15 years- who started to shout and to destroy the sits of the theater like not even on that scene of \"Ed Wood\",which movies were,compared to this- pretty good ."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "marctillerman",
        "review_rating": "1",
        "review_title": "Even the popcorn sucked!",
        "review_detailed_main": "Bad, horrible, awful, waste of time, useless, and brain-numbing. Even theses words do not accurately describe this modern day masterpiece. If you are thinking about seeing this movie, then do it!! The taste that it will leave in your mouth will be enough to remind you to NEVER see one of these teeny bop movies again. If you are as stupid as I to be hooked into a FREE showing of this movie, I would ask for a refund!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Gosunkugi",
        "review_rating": "1",
        "review_title": "Can you say ego trip?",
        "review_detailed_main": "I have no idea what the point of this movie was, but something tells me it was just one big ego trip (Or ego TRIPE?) for the Spice Girls. They made a movie that made no sense, was just one stupid joke after the other, and... well, it sucked. That's all you can say about this trash."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "movieboy-6",
        "review_rating": "1",
        "review_title": "being stabbed is much more enjoyable!!!",
        "review_detailed_main": "I can't believe I actually confess to seeing \"Spiceworld\"! I was once a fan of the girls, sadly to say. Then came this wretched and loathesome piece of s**t. It had no plot and was nothing but a publicity stunt for the Spice Girls. It wasn't even a good publicity stunt; they could've guest starred on Lamb Chop and had a better outcome. The thought that I actually paid $4.00 to see this undescribable crapfest makes me want to sit down and weep! If you are masochistic and enjoy inflicting pain upon yourself, go see \"Spice World\"; trust me, it hurts. Worst movie ever made. F- (if there were anything lower, this movie would get it)"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Vanity, thy name is Spice....",
        "review_detailed_main": "I'm not even sure if you can call SPICE WORLD a movie, per se. That's because instead of having actors and a plot, the film plays like a giant advertisement for this prefabricated \"super group\". In other words, the cynical folks who brought us this \"film\" were basically trying to squeeze every last drop from the franchise and sell more records. Fortunately for the world, the group was already on their way out and the film made much more of a fizzle than a sizzle at the box office (thank God).\n\nAs with other vanity products, the actors really cannot act and have the charisma of cheese. While I know this may sound like sacrilege to some, this is a lot like Paul McCartney's vanity opus, GIVE MY REGARDS TO BROADSTREET. Like this other film, lots of glitzy locales, special guest stars and noise were all used to try to hide the fact that the singers were not all that talented as actresses. Had all the glitz been removed, you would have been left with...well...nothing. So, instead there are a billion costume changes, crazy sets and pointless cameos--all to hide the utter vapid nature of the film.\n\nOverall, a total waste of time for anyone but a Spice Girl zombie-fan. I saw it because I am a masochist--otherwise, don't bother."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "elfgirl_amek",
        "review_rating": "8",
        "review_title": "Have Fun with it",
        "review_detailed_main": "It was made to be silly. There's nothing in this movie that's meant to offend anyone. It's a silly, fun-loving, harmless movie. I enjoyed it when I was 8 and I still do now at 18. Anyone who takes this movie seriously, needs to relax, have fun, enjoy the goofiness. This movie is one you can enjoy with your friends, family and young children DON'T have to be sent out of the room for inappropriate action.\n\nIt's silly, remember that. It's supposed to make you laugh!\n\nAll the girls are young, and the band still together. A few years later, everything fell apart for them. Enjoy the youth and laughter while you can."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "6",
        "review_title": "Made me wanna zigga zig, ah!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "Oh dear lord...",
        "review_detailed_main": "Let's just be brutally honest here; this is a Spice Girls vehicle. No doubt about it. From the biggest hater of the film to the biggest fan of the girls, everyone might as well admit from the very beginning: this film was primarily (and, in the opinion of many, purely) made to promote the Spice Girls as well as their then-new album. The moment you realize/accept that fact is the moment that this film gets easier to sit through. However, it still is very, very hard to sit through, and the majority of the people I know wouldn't be able to sit through the entirety of this mess of a film, not even to satisfy the most basic human instincts of curiosity by finding out what happens in the end. The film pretty much plays like a 90-minute promotional video, or a compilation of music videos with pointless plot in-between each performance to keep the music from getting to be too much. Newsflash: the people who would willingly watch this would most likely be just as happy with a 90-minute compilation of music videos or live performances; they don't care about the film itself. I'm not saying that every single Spice Girls fan hated, or even disliked the film itself(I'm not even claiming that one single fan didn't enjoy seeing the girls being \"themselves\"); what I am saying is that they wouldn't have cared if this feature was a 90-minute long music video, instead of the barely coherent mess that the movie is. But, back to the point I was trying to make; the film is a Spice Girls movie. Not a comedy, or a music movie, but a Spice Girls movie. Made entirely for the fans. This, of course, means that the movie is exclusively enjoyable for the fans... and now that the girl-band is no longer a hot subject, and it's no longer \"in\" to like them, their fan-base has been reduced to a minimum. Therefore, now, only seven years after the film was made(or a few years ago, for that matter; ever since they stopped being popular) the film will only appeal to those who are still fans. As you have probably figured out by everything I've written up to this point, I am not, nor have I ever been a fan of the girls. They are charming, sure, their songs are catchy(admit it, even you've hummed along one or two of their singles when it came on the radio), and they are, undeniably, quite attractive, but that's all there is to it... and that's certainly not enough to carry a feature film, once they're no longer famous. Of course, the director probably didn't think about that, and merely made the film to capitalize on their popularity. Oh well. The film now belongs in the same category as one of those films made about some famous guy/girl/group of people that people no longer care about... probably all inspired by The Beatles(unless someone came before them... I'm not sure if they were the first bands to do feature films). The thing is, The Beatles not only were popular back when they made their films, some 30-40 years ago; they still are popular. The Spice Girls aren't. They were merely the newest of the popular teen-bands... and they didn't last much longer than most others. Now, that's enough for the analyzing, on to the review. The plot is barely coherent and poorly paced, constantly throwing new characters into the story, that appear for a few minutes only to disappear again, as well as introducing subplots that are never used to full advantage. The acting is atrocious. The characters are tired stereotypes. The cinematography is forgettable and unimaginative. The humor is British humor at its worst(I think, at least; I haven't seen enough British comedies to determine if there is a lower level than this). All in all, the film have little to offer(apart from one or two clever references and some good self-parodying in one or two places) to anyone but Spice Girls fans. I recommend this exclusively to Spice Girls fans. It's to painful to sit through for virtually anyone else, even if it's just to laugh at the pure stupidity of it. Everyone but Spice Girls fans: Avoid at all costs. 1/10"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Ace-38",
        "review_rating": "",
        "review_title": "Cheesy, Goofy, Silly, and lots of fun to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "K.C.-3",
        "review_rating": "1",
        "review_title": "Whoa, was that a movie?",
        "review_detailed_main": "A friend and myself take great interest in following pop culture and entertainment trends... Enough so that we occasionally trek to Los Angeles just to be closer to the aura of the entertainment world. I was in London when the Spice Girls went to the top of the charts there, so I witnessed their phenomenon twice.\n\nThat in mind- I must say that \"Spice World\" has got to be, hands down, the worst movie that I have ever seen. The acting is just outright uninspired and lousy. The plot line... well.. let's just say you won't have to think much during this movie.\n\nIt is so bad that we both have recommended it to friends on the premise that you'll never see another movie as bad as it. :) Personally I nominate the birth scene for worst acted scene in the history of the entertainment world.\n\nLooking for similar pictures? Check out \"Cool as Ice\", Vanilla Ice's movie of the same genre. It's actually a little better than this one."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "preppy-3",
        "review_rating": "1",
        "review_title": "Wish I could have voted lower than \"1\"",
        "review_detailed_main": "I saw this \"thing\" (I can't bring myself to say \"movie\") back in 1997 when it came out. I went partially out of curiosity and partially because it got some good reviews. I was appalled! The girls can't act, can't dance, certainly can't sing and have no personality between them. There was no plot, all the \"jokes\" were unfunny, all the reputable actors that agreed to show up look embarassed (as they should be). I usually sit through any movie no matter how bad, but I walked out on this one. Just simply everything about it was BAD!!!! And, no it wasn't good enough for laughs. I couldn't even think out things to yell at it...it's one of those movies you just watch in disbelief that something this terrible could be filmed and released. THank God, they're not making a sequel! To be avoided at all costs!!!!!!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Greatwhitewhale",
        "review_rating": "2",
        "review_title": "No, Spice girls, no",
        "review_detailed_main": "Only the Beatles can get away with doing good movies. The Spice girls deserved that Razzie award, could they BE Steven Seagal if he was a British woman?\n\nImpressive cameos (Roger Moore, Meat Loaf, Bob Hoskins) and not-impressive (Neil Fox). It's terrible, it tried to be a Hard day's night, it's not.\n\nAwful, crap, I could go on forever."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sqeaston9",
        "review_rating": "1",
        "review_title": "The oldest profession",
        "review_detailed_main": "Once upon a time there were The Spice Girls. They introduced us to 'girl power', a thinly disguised effort to use sex to sell manufactured pop music, potato chips and fizzy drinks to little kids and morons. And then there was this travesty of a movie.\n\nThis is very much like other exploitation movies made to cash in on popular music groups in the past, but with all the good elements removed. There is nothing redeemable about this whatsoever, it's pure trash, and since the 'music' of The Spice Girls has no longevity neither does this.\n\nIf you want to pick this up along with the girl's entire back catalogue of CDs, I recommend checking out the bargain bins in charity shops. You shouldn't have a problem finding it all, and then at least something positive will have come out of this."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Li_85",
        "review_rating": "1",
        "review_title": "Stinker..Disaster..Worst film of the decade",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "J-12",
        "review_rating": "1",
        "review_title": "I would rather see two old ladies slapping each other",
        "review_detailed_main": "This movie to put simple is the worst film this year. when a video game featuring a character named Dancin has better songs and a better plot somthing is wrong,very wrong"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "timmerdo",
        "review_rating": "1",
        "review_title": "In any movie you can usually pull out one line or scene as some kinda saving grace...",
        "review_detailed_main": "In any movie you can usually pull out one line or scene as some kinda saving grace even the worst movie in the world could have a bad joke that is just fun to tell. I've suffered through Spice World and I must say that it has one line and one image that will forever make me and my friends who saw it laugh. Now I'm going to ruin the whole movie by telling it to you so you don't have to go rent it. Basically the whole story is about George Wendt wanting to make a movie about the Spice Girls. He's sitting there explaining the Plot. They get to a scene when oh my god they're running late for a concert so they hop in their bus and rush along to make it to the show. Of course on their way a draw bridge is going up and they do the same old \"Speed\" scene. The producer they are selling this Idea to says sounds expensive and George Wendt quickly replies \"Doesn't have to be\" and they cut to a picture of a little matchbox replica of the Spice Girls Bus going over a model Drawbridge. Just Hilarious!! But the rest of the movie was horrid jokes were much worse and it was so bad that any other scenes were just a waste of time to even remember. It wasn't even one of those bad movies that you could have a good time watching because it's bad. There is that one scene and that is the only speck of this movie even worth watching."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "decoyss",
        "review_rating": "10",
        "review_title": "Celebration of 90s and spice girls",
        "review_detailed_main": "Very simple rule; If you like Spice Girls, you would enjoy every second of the movie even credits. Which I did.I watched many many many many times. if you don't like them so don't watch it you will find something to criticize in every scene."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "kathco",
        "review_rating": "6",
        "review_title": "Much better & much funnier than you'd think",
        "review_detailed_main": "This movie is FUN. And the sad thing is that most people are too close-minded to see that. The general consensus seems to be: \"It's the Spice Girls in a movie? It's going to be awful!\" and either they never see the movie, or they allow their prejudices to judge the movie for them.\n\nFirstly, let me say that I am not, and was never, a Spice Girls fan. I was way too old for their target market when they were popular, and whilst one or two of their songs had catchy tunes, some were downright annoying. They were a very cleverly manufactured girl band in a time when that market was wide-open. Giving each girl a distinctive character and style was a stroke of genius on the part of their 'creators', and while they didn't have particularly strong voices (except perhaps for Mel C), they didn't have particularly bad ones either. I've heard far worse. So I went into this movie purely out of curiosity, expecting it to be somewhere between awful and merely silly, but I ended up enjoying myself thoroughly. Also, my 65-year-old father loves this movie, and he saw it only having heard vaguely of the Spice Girls, but not knowing their music at all. Yes, Spiceworld is an exploitation movie; BUT it does an excellent job at it! What I loved most was the way it poked fun at itself all the way through. The character of the screenwriter pitching his idea to the girls' manager (brilliantly played by Richard E. Grant) saying \"It's obvious to us that the Spicegirls are movie stars!\", when it's obvious that they're not, and everyone knows it - there's even a scene at the beginning where he says, \"Yes, but can they ACT?\" and his boss responds with, 'Who cares?\", or similar. I loved that. And while the girls CAN'T really act (some are worse than others; I've read that Victoria was the only one who had taken acting lessons before, but I can't say it showed since I thought she was the weakest link), it's obvious that they're having fun with the script, and they don't do too badly at all.\n\nThe script was another great surprise to me; it's full of good lines and funny characters that poke fun at themselves and their stereotypes. An example of this is the great Roger Moore playing the \"Chief\", who is presumably the Big Boss of the Spice Girls. We only ever see him on the phone with Clifford the manager (Richard E. Grant), and every time we do he is stroking, in pure Bond Villain (or Dr Evil) fashion, a small white animal on his lap. But every time you see him he has a different animal; first it's a cat, then a rabbit, a tiny white pig etc. I thought that was such a great way of poking fun at the stereotype of the villain always having a white pet. And then the character himself has these fantastically enigmatic, senseless, but hysterical lines, like: \"When the rabbit of chaos is pursued by the ferret of disorder through the fields of anarchy, it is time to hang your pants on the hook of darkness. Whether they're clean or not.\" and: \"The headless chicken can only know where he's been. He can't see where he's going. Do not be that chicken.\" I love that off-the-wall humour, and this movie is full of it. Of course, some people just don't GET that kind of humour, which is fine by me as long as it doesn't make them slam the film because of it.\n\nOther moments I love, which elevate this film from could-have-been-dodgy to funny, are the casting of Meatloaf as the Spice Girls bus driver, and then having him say lines like: {on fixing the clogged toilets} \"Hey, I love these girls. I'll do anything for them...but I won't do that!\" - which is, of course, a play on Meatloaf's hit song \"Anything for Love\". Also the parody of the stereotypical characters of the girls, which of course were made up for them anyway, like Victoria not knowing what to wear, and Mel C saying \"It must be really hard for you, Victoria, trying to decide whether to wear the little Gucci dress, or the little Gucci dress, or the little Gucci dress\", and Victoria responding \"Exactly!\", or when Victoria falls into the Thames and continues to scream for help once she's been rescued, and yelling \"This dress is dry-clean only!\", or Geri saying \"Calm down, haven't you ever heard of the word 'compromisation'?\" There are scores of these great moments but they really work better in the film than if I wrote them down here. All I'm saying is that this movie is not ever in a million years as bad as everyone makes it out to be. Yes, it's not the greatest, but then most films aren't. It's so much funnier than you'd think, and yes it has its cheesy moments, but sometimes it's SUPPOSED to be cheesy! That's where it's funny. I really don't understand why this film, whose only aim was to be FUN, and in this it succeeded more than admirably in my opinion, is in IMDb's Worst."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "dragonslayer_2000",
        "review_rating": "1",
        "review_title": "Anyone know how these people get a movie... Please tell me.",
        "review_detailed_main": "Pointless, too-long and worst acting ever I hate this movie. It was like watching a train wreck with hot British women. The acting is so bad. It makes me wish I was watching anything else. Even a movie with another singer/Actress. I'm looking at you J.Lo. Do you think that David Beckman saw this movie before marrying that chick. Me neither. Lame, Lame. Why is it that every pop star feels the need to express themselves though acting as well (not that they write they own music). Didn't they realize that we can't stand the way they are in the public eye as it is. Quick rundown; it starts lame, then gets lamer and then boring, then so boring you wish they would just give up and start the credits early."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "GalaxyGa",
        "review_rating": "",
        "review_title": "This was never meant to be serious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "johnnyboyz",
        "review_rating": "2",
        "review_title": "Can you say 'Bad'? Can you say 'Terrible'? Can you say 'Disaster'?",
        "review_detailed_main": "About half way through Spice World, it dawned on me that it wasn't going to get any better than the level it was maintaining and a nasty thought hit me: \"when people ask me why I actually motivated myself to sit down and watch this all the way through, I am going to have to think of something to say in reply rather than merely shrug and look down at the floor in embarrassment.\" I found myself for the next ten minutes thinking up various excuses I could use as reasons but eventually settled for 'Curiosity'.\n\nYes; when a film is so bad it motivates you to actually think up reasons you're going to have to say to people when they ask you why you watched it, it's struggling. As it was with Thunderbirds, I was curious as to know what the hell it was all about. I was old enough to remember the Spice Girls and old enough to dislike them but distinctly recall this film getting released. Following the break up and now apparent reunification, Spice World as a film doesn't even hold together as a piece of nostalgic nonsense that should be good enough to kill a few hours as we watch global female icons strut around in little costumes and sing silly little songs. Spice World does not even give us the luxury of having a plot; instead it is more of a documentary-come-spoof of not only the band in question but certain generic films of yesteryear. This means it plays out more like Epic Movie than anything else.\n\nSpice World is really just one massive contradiction. It contradicts itself, its characters contradict what they want to be and how they want to be seen as and even the immediate ending contradicts whether or not it is a film within a film. At the time of the Spice Girls, there was very much an atmosphere of the band wanting to take over. The title of this film: 'Spice World' suggests a world full of 'spice'; the video for the song of the same name is set in a dystopian future where everything is exactly that; the 'V' sign the girls use to signify girl power is commonly associated with 'victory', ie; Victory, girl power rules'; there is also the familiar sight of a band cashing in on consumerism and globalisation as they make their presence more known around the world. But rather than Spice World posing as some sort of political/musical version of Battleship Potemkin; its scenes play out more like a retread of films that we've already seen. Roger Moore was James Bond and he spoofs the Bond villain persona; Richard E. Grant sits and listens to film pitches alá The Player and the final incident involving a bomb blowing up not only means the film is confused as to whether its fiction or not but whether or not it thinks the fourth wall is reparable once it has been broken.\n\nThe worst example of contradictory content in the film comes very early on when the girls are sitting in a bus, that looks more like an actual room than anything else, discussing how they hate being seen as the 'baby'; the 'posh one' the 'scary one', etc. Fine you think, maybe they are getting sick of that but what follows is an immediate counteraction to their complaint in the form of a montage showing each of the girls dressed as Wonder Woman, Marilyn Monroe and then of each other. The girls go from wearing their clothes, acting dumb and stating that \"there's more to us than just our persona tags\" to..........wearing even more clothes and costumes and acting in an even dumber manner. You can imagine the thought process: so Ginger Spice doesn't like to be called Ginger Spice anymore; \"Ok, I know; I'll dress up like Wonder Woman and crack a whip.\" Yes, I can see there's so much more to you than your generic tags. The other glaring example of contradiction in this film that the girls fall foul of comes in the form of their allegiances. Nearer the beginning of the film rather than the middle, the girls talk about how important their fans are to them; this idea returns to haunt them since the actual final third revolves around a dilemma the girls face: stay with a friend as they give birth and shun fans waiting at the gig or vice-versa. There should be no argument: they've established their fans come first but what happens is they counter balance their priorities by staying in the hospital with their pregnant friend.\n\nSpice World is a film that does absolutely no favours for anyone and that includes the girls themselves. The Spice Girls come across as plastic, one-dimensional and rather stupid; frequently getting their priorities, beliefs and ideas mixed up with one another; never giving us the impression these are smart and good people making smart and good music. The film's portrayal of Italians and homosexuals is disappointing as is the incompetent film crew consisting of a black man and a fat person; the way the bad guy is a fat, spitting Australian bent on magazine sales who has an English assistant is horrible; the film's narrative wants us to believe that stuff being printed in the newspapers by a man who gets the scoops in an impossible manner is entertaining and realistic but it's just silly. There just isn't enough space to cover all the things horribly wrong with this film but I am surprised this didn't destroy the Spice Girls when it first came out. Cheap laughs; a nasty narrative; horrible archetypes and so many times in which the focus band of the title come across as incompetent is enough to label this trash, 'trash'."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Sherazade",
        "review_rating": "1",
        "review_title": "The worst excuse for a film I have ever seen!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "We're Sorry, World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "hales_r_us",
        "review_rating": "1",
        "review_title": "this is the biggest piece of crap ever made",
        "review_detailed_main": "I don't get why so many people are giving this movie \"it's really not too bad\" reviews. It is on of the worst movies ever made. The Spice Girls cannot act, the dialogue sounds like it was written by my 4 year old nephew, and the happenings are so unrealistic to the point that i can't find any humor in it. For example the Spice Girls get out of their bus to use the bathroom in the woods and run into a bunch of aliens that look as though they're wearing cardboard costumes and then the aliens ask if there are any tickets for the concert and ask for autographs. HA HA HA. Or all those fictional daydream scenes ie the one when the girls have all had like 10 kids and they're old and worn out... I can't believe that a group of extremely respectable actors agreed to be in this movie but it probably will be a permanent bruise in their careers. It's really no wonder that the redhead left the group soon after this movie was released and the group went straight downhill from there. Please, please, PLEASE don't waste your money or your time watching this peice of cinematic crap."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "nummber13",
        "review_rating": "2",
        "review_title": "horrible!",
        "review_detailed_main": "total waste of time........even if you are a red blooded male."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "rekley",
        "review_rating": "3",
        "review_title": "Worst movie of all time",
        "review_detailed_main": "A couple of friends and I rented this movie because we had nothing to do. After the first five minutes we just had to turn it off. Not even a five year old girl would like this movie. I dont know what they where thinking when making this movie"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "bobo89",
        "review_rating": "1",
        "review_title": "don't ever watch this movie close to an open flame",
        "review_detailed_main": "This film is probably one of the worst films i have ever seen. With it's supposed comic relief and even worse acting. This one couldn't avoid a rating higher then a 1. which is what I gave it.The films worst moments were ( not including the whole film) the pointless alien scene in which the spice girls who have everything on their stupid bus. Have to go to the bathroom in the woods. Then suddenly they find aliens. then the movie goes on. I was confused. Plus there was the pointless 6th spice girl that really was just annoying. So basically this movie was not too good."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Dimcrusader",
        "review_rating": "10",
        "review_title": "Hilarious",
        "review_detailed_main": "I have watched this film several times and still have fun doing so. Victoria alone is worth the watch. That woman is indeed a great -and underrated- comedian, I wish (no pun intended) she was acknowledged for that. The rest of the girls are just adorable. Loved the singing bits, songs and reworks from their hit singles we all love are performed. The film satirises their rose to fame and everyday life while at the peak of SpiceMania. I am a huge fan of British comedy, and this movie is a great piece of that. I doesn't matter how young or old you are, this movie is for everyone and it will surely make you smile."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "LuckyFour-LeafClover",
        "review_rating": "7",
        "review_title": "Something of a Guilty Pleasure",
        "review_detailed_main": "While I found Ginger and Posh Spice hot growing up I wasn't really particularly a Spice Girls fan. But as years went on I found myself liking them and their music and thinking back on them fondly.\n\nThis film came out around the peak of their popularity in 1997. It's a pretty silly movie with a silly plot but as I said it's a guilty pleasure for me"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Budd-5",
        "review_rating": "1",
        "review_title": "Embarrasing!",
        "review_detailed_main": "What was I thinking? Why did I go see Spiceworld? Nearly every critic said it was rubbish but hey I had to make my own mind up. Note: From now on listen to the critics - they know what they're talking about.\n\nThis film is an embarassment. The girls can't act. Not one of them seems comfortable in front of the camera. Baby Spice - stop sucking those lollipops, it's not cute, it's retarded. Sporty Spice - her voice is like a constant drilling in my ears. Ginger Spice - I'm so glad she left the group. Posh Spice - my goldfish has a better personality. Scary Spice - well, she was the best of a bad bunch.\n\nRichard E.Grant seems to be as embarassed as I was while starring in the film. The cameos from famous faces are only successful when they don't have to be on the screen with the Spicegirls. Roger Moore is quite funny and Bob Hoskins doesn't shame himself.\n\nI don't know what genre you'd put this in. It can't be classified as a comedy because it's not funny. It can't be classified as a musical because these girls can't sing. I think the only genre fitting is a disaster movie - this is a natural disaster!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "teesa",
        "review_rating": "",
        "review_title": "Wow, ouch that had to hurt!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "goldgreen",
        "review_rating": "1",
        "review_title": "A wasted opportunity",
        "review_detailed_main": "The point at which the world's love affair with the Spice Girls ended. Prior to this they got by on a mix of cheek, charm, enthusiasm and luck. Here they seemed to believe their own bulls**t. e.g \"We're big pop stars now, we can do anything. Acting, no problem\" While they trained to sing and dance, they are clueless as actors. To be fair half of the blame lies with a script that appears to have undergone no re-writing and a TV director who has no feel for the big screen. Much of the locations are way too bland for what was then the world's hottest pop act. In fairness it was probably rushed because they had a tour/ album lined up. What should have been a laugh was one of the most excruciating 90 minutes I have spent at the cinema."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "TedEBear",
        "review_rating": "1",
        "review_title": "It doesn't have a coming attractions trailer...",
        "review_detailed_main": "It has fair warning. I guess this is one of those where if you aren't a fan of the original, then you aren't going to like the film. Well, I tried watching on the basis of \"it might be so bad it'll be good\" but was sorely disappointed (I almost screamed at the TV when Richard O'Brien first came on, \"RICHARD! WHY?! WHY!?\") Mind you, I wasn't expecting High Art; I couldn't believe how insipid the whole thing was. The interior of their tour bus had to be the size of a football field, and the statues around London had more personality than the group. And would SOMEBODY tell them to either swallow the mush they're eating or spit it out? I couldn't understand 95% of what they were saying, and I'm a regular PBS viewer!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "NBK-2",
        "review_rating": "1",
        "review_title": "AWFUL",
        "review_detailed_main": "Arguably the worst movie ever made. It really just is a PR-stunt by the Spice Girls.The only bright thing(s) about this film must be two of the actors, named Roger Moore and Richard E. Grant.I don't quite see the point in this film. Strangely, even though they are Spice-fans, my sisters loved it. They're just 8 and 6, but anyway..... I won't even bother to start to write what the film was about, because, in my opinion, the film wasn't about anything. THIS FILM SUCKED! 1/10 NBK"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Beta_Gallinger",
        "review_rating": "3",
        "review_title": "Regardless of what you think of the Spice Girls' music, this is an unfocused mess!",
        "review_detailed_main": "I remember during the Spice Girls' heyday in the late 90's, I despised them for a while. When I think back, I don't know exactly why I did, but I was only eleven/twelve years old at the time, so I've obviously changed a bit since then. Right now, I'm basically indifferent to the group, so I don't have any strong feelings about their reunion. Anyway, I obviously wouldn't have even thought of watching this movie back in the day, but a decade after it first came out, I have finally watched it, and have learned that I wasn't missing much.\n\nThe film shows the Spice Girls (Melanie B, Melanie C, Emma, Victoria, and Geri) as they travel around in England on their double-decker bus, meeting lots of people, and sometimes having fun, but also experiencing all sorts of trouble. Meanwhile, a newspaper editor named Kevin McMaxford, who hates the Spice Girls, is spreading rumours about them to try and ruin their reputation, and a film director named Piers Cuthbertson-Smyth keeps coming up with silly movie ideas for the band. The five pop stars have a gig coming up in a few days at the Royal Albert Hall in London, but as it draws near, a lot gets in their way!\n\nSome love the Spice Girls and some hate them, but regardless of that, as a film, \"Spice World\" is a very poor effort. The story isn't very well-written, carelessly slopped together, and it seems a lot of things were just thrown in, such as the group meeting extraterrestrial fans. The film often seems rushed, jumping from one scene to another too quickly. The script, which was clearly just slopped together as well, is very poor, with both the band members and other characters blurting out lines which are supposed to be funny, but are just ridiculous! Almost all the gags in the film (yes, this is a comedy) are lame. I never laughed, and none of the gags ever gave me a full smile. Lastly, the ending of the film is a tad abrupt.\n\nNow, if I were a big Spice Girls fan, I'm sure that would have helped a bit, as a good number of their songs are featured in this film, whether in full or in part, but I still certainly wouldn't have cared for much else in the film. I think I've made it clear that regardless of the music, this is one unfocused mess of a film! It was probably meant for the group's preteen fans mainly. I remember a lot of them, the majority of them girls, but there were definitely quite a few boys as well, and I'm sure most of these fans liked it. However, the movie really doesn't have a lot for most people, apart from the songs for fans, and sadly, that is not enough to make up for the extremely poor quality of \"Spice World\"."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Mike-DD",
        "review_rating": "2",
        "review_title": "Sing - don't act",
        "review_detailed_main": "Girl-bands (or boy-bands for that matter) should just stick to what they know best - singing and making music videos, and this movie serves to prove my point. With their zero acting ability, the movie more than bored me. The only reason I (and my friends) continued watching was the concert and singing parts. Only then were they in their element. Should have rented a video of the concert. Cost the same and I get to see and hear more singing, and no acting at all."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "FlashCallahan",
        "review_rating": "1",
        "review_title": "Stop right now.......thank you very much.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Spice Up Your World By Not Watching This Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "smike-79851",
        "review_rating": "10",
        "review_title": "Spicey",
        "review_detailed_main": "Don't let the critics fool you. This film is lovable and entertaining. The spice Girls were huge in America and the UK in the 90s and even towards past 2000. This film is a hit for all spice girl fan and must own on DVD and bluray."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "BandSAboutMovies",
        "review_rating": "6",
        "review_title": "Better than expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Cragan",
        "review_rating": "3",
        "review_title": "'Flying Circus' it isn't.....",
        "review_detailed_main": "I have to admit, right off the bat, that this movie could have been a LOT worse. By making a silly, overlong music video, the Spice Girls took the conservative route and played up to their strengths: cloying cuteness and over-produced tunes. Having said that, this is still a mess.... every attempt at 'zany' humor seems contrived, and every time I saw former '007' Roger Moore on-screen, I almost cried. (If you need money that bad, Roger, come talk to me... I'll help you out... anything but this, man....) The Girls put every drop of energy they can into this fiasco, but you can't bring a dead script to life, even with this much Spice in the mix. If you want a FUNNY music parody, check out 'This Is Spinal Tap.'"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Dudles",
        "review_rating": "",
        "review_title": "As good as it was ever likely to be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Zalus",
        "review_rating": "1",
        "review_title": "If you aren`t that careful you`ll hate the songs too",
        "review_detailed_main": "Checking out the recent comments most of the people have nothing to tell about this Spicey movie. The fans just repeat themselves: I love the Spice Girls, I love this movie. And, well, the others are just standing and thinking `What on Earth can I say?` I`m afraid there`s not much you can mention after watching this movie: yeah, the girls are beautiful, but can they really act? I think, not. They haven`t even managed to play themselves. That`s a pity. And there`s a lot more waste in this movie: what the hell are those ACTORS massing around in this Spice Sh*te? Hey Bob, Richard, Stephen and errr... Roger! Why don`t you just borrow money if you need it..."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Quicksand",
        "review_rating": "1",
        "review_title": "Did the filmmakers even TRY?",
        "review_detailed_main": "Just because they made a movie about the Spice Girls doesn't mean it will automatically be good. In fact, this movie is so bad I couldn't even find stuff to make fun of. It's also living proof that the filmmakers could have released anything, no matter how bad, and Spice Girls fans still would have turned out on droves to see it.\n\nWhich is exactly what the filmmakers did. Kind of scary, really."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "carface214",
        "review_rating": "3",
        "review_title": "Inoffensive, but lame and forgettable",
        "review_detailed_main": "(possible spoilers...I don't know if I have to say this)\n\nFirst of all I don't hate Spice Girls, their music is OK but this movie isn't worth any time unless you are some home sick 12 year old kid. I watched this several years ago and there is nothing cool (unless you really love their fashion) and there is nothing really exciting (unless your some horny prick love to watch their skimpy outfit). The story is simply empty other than these bunch of skimpy dressed girls fooling around all over London and a brief encounter of some kind of aliens. Some cameos, mostly British stars doesn't do much to enrich this move. Overall this move is inoffensive, almost harmless, but very very low on entertainment. If you are in for their music, just watch their music video and save your time."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "rivertam26",
        "review_rating": "4",
        "review_title": "Not for everyone but fun for a select audience",
        "review_detailed_main": "There's no way around this is in fact a pretty awful movie. That being said it can also be a bit of fun for the right audience. The movie is a spoof of itself taking the Spinal Tap approach. It's nonsensical and works more as an advertisement for the soundtrack which is kind of successful. There are spies, aliens, insidious gossip columned and more ad the girls play vigoursly into there set stereotypes trying to make us believe they have been friends since they were kids. Most of it doesn't work but there are some funny and clever bits and the movie is surprisingly feminist and not as annoying as it should be. You'll know if your it's audience as soon as it begins. All in all it's an extremely guilty pleasure that I mostly enjoyed.\n\nBudget: $25m Domestic Box Office: $29m Worldwide Box Office: $151m\n\n3/5"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "boz75",
        "review_rating": "4",
        "review_title": "Great for Spice Girls Fans and nostalgic people - not sure about everyone else!",
        "review_detailed_main": "I used to think this band were actually good back when they came out and that, potentially, they could have had status similar to Abba. I admit that was wrong and do not believe that ever happened, but nonetheless the Spice Girls had some decent songs with Viva Forever being one of my favourites actually from any group. This movie itself is ...well... OK I guess and would be watchable for people who were fully aware and interested in them in the mid-90s, but I am not sure anyone else will really get into this film. The acting and script are not the best out there to be honest, and there is little else that stands out for me to add on about this film. Spice Girl fans will undoubtedly enjoy this a lot nonetheless, but I could not recommend it to anyone else."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "briancham1994",
        "review_rating": "3",
        "review_title": "What even is this?",
        "review_detailed_main": "I'm not sure how to describe this. Absolutely nothing is coherent and there is no plot to speak of. The characterisation, jokes and music are just scattered randomly. It feels like each half-minute was made by completely different people who had no communication with each other."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "derektrotteresq",
        "review_rating": "1",
        "review_title": "It's up there with Batman & Robin as one of the worst films ever.......",
        "review_detailed_main": "Spiceworld - This is a movie that actually makes me want to vomit blood, it is a homage to all that is unholy in this world and was made by lucifer himself. I would rather have my testicles surgically removed with a rusty steak knife than to ever watch it again. How they managed to get so many big name stars to appear in this pile of drivel is beyond comprehension. I am aware that they are (and i use this term very loosely!' 'musicians' and this movie was supposed to be 'a bit of fun' but its only fun if you're the kind of person that enjoys train spotting (the practise of, not the movie)or flashing people with a dirty rain mack. I have nothing but utter contempt for this film that can be likened only to having rusty nails driven into my fingers using a concrete breezeblock."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Lemon_Stick",
        "review_rating": "10",
        "review_title": "Just what you expect from Brit-Pop low budget movie.",
        "review_detailed_main": "I was very early tweens when the Spice Girls dominated the world, and I remember the film coming out to cinemas; counting down the days till I could go see it! As a child and massive fan I found the film entertaining as it was to cracked up to be, it was all the phenomenon of the time. Looking back now it was a great time for me enjoying it and themselves as a girl group enjoying massive success and this is why I can accept why the film may not be any BAFTA hands down winner, obviously the film was never meant to be! It was written by their managers wife! And has too many more than subtle references about Britain. The acting is cheesy but no way did it tarnish any of the many important actors/comedians/singers who cameo'd in this film because as I remember Richard E. Grant saying it was just so great to be part of the experience, it really was a time-line in history. Now who cares whether he was lying or being honest we know he is an actor who gets paid big bucks, but the fact Roger Moore was in this film and Meatloaf, I don't think you can call them all sellouts. Fact is Spice Girls did make an impact on us all, this is just a bit of history left to show their mark."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "johnnysugar",
        "review_rating": "7",
        "review_title": "Clever and energetic, and not nearly as bad as you've heard",
        "review_detailed_main": "In the 1990's, the Spice Girls were the reigning queens of pop, selling countless amounts of records across the world. An unprecedented marketing blitz followed, culminating in the film \"Spice World.\" Backlash was inevitable, and many were ready to dismiss the film or praise the film solely based on their dislike or enjoyment of the Spice Girls' music. When reviewed as a film in its own right, \"Spice World\" is a very entertaining movie with its tongue always firmly in its meta-textual cheek.\n\nThe Spice Girls -- Geri Halliwell (Ginger), Melanie Brown (Scary), Emma Bunton (Baby), Melanie Chisholm (Sporty), and Victoria Adams (Posh, now Victoria Beckham) -- play themselves. The Girls are getting ready for their first live concert in Royal Albert Hall, but their preparation is beset with several obstacles, including the overdue pregnancy of the Girls' best friend (\"AbFab\"'s Naoko Mori) and a vicious tabloid editor (Barry Humphries) that wants to see them ruined so he can the ensuing headlines will sell millions of papers. A host of supporting characters add to the mix, including the Girls' high-strung manager (Richard Grant), an insidious paparazzo (Richard O'Brien), a clueless documentary film-maker (Alan Cumming), and a Hollywood producer/screenwriter duo (George Wendt/Mark McKinney) relentless pitching ideas to the Girls' manager for movie spin-offs.\n\nThe Girls do play themselves to a point, but they are more accurately playing themselves as the public sees them. Sporty is always on an exercise bike, for instance, and Baby is never without a lollipop or stuffed animal. They live up to their stereotypes and play them to the ultimate hilt. The Girls themselves seem relaxed, with the most confident performance coming from Geri, who seems quite natural on the screen. Mel B and Emma both seem almost as relaxed, but Mel C seems like she needs a little more coaching on screen presence. Victoria, unfortunately, looks quite uncomfortable whenever the camera focuses on her, and in some scenes she actually comes off as resentful that she had to star in this film.\n\nThe director, Bob Spiers, is best known perhaps for his work on the series \"Absolutely Fabulous\", and he brings the same comic hand to this film has he did to that supremely funny show. The comedy is played light, never too much over-the-top, although a good deal of silliness is inserted. Dramatic moments are often muted by a small joke or bit of campy melodrama. Nothing is ever taken too seriously, and the film clips along at a good pace, peppered with hilarious fantasy sequences, knowing self-parody, and satirical jabs at everything from hospital drama to action movie car chases.\n\nThe film is full of cameos as well, including both musicians and non-musicians. Elvis Costello turns up as a bartender, while Meatloaf plays the driver of the Spice Bus (a double-decker bus emblazoned with SPICE on its roof). Jennifer Saunders shows up as a bitchy fashionista, while Bob Hoskins' role is too funny to give away here.\n\nIt's easy to see why some people dislike the film, however. The soundtrack tries to fit as many Spice Girls songs as possible into the film, which is to be expected, but the songs themselves are of a wildly varying quality, from the rousing \"Spice Up Your Life\" to the questionable \"Viva Forever.\" It's also hard to buy the Girls' backstory as struggling musicians, and the film lacks any kind of dramatic tension, which may be intentional, but it gives the film a fluffy quality that does not appeal to everybody. Some moments in the film now seem oddly indicative of future events: about a year of the release, Geri would leave the group and the Girls' next album without her would signal the end of the act, with all the Girls going on to solo careers of amazingly diverse success (Geri and Mel C have score the best, while nobody wants to hear Victoria's album, ever). Keep this in mind during the fantasy sequence with Stephen Fry as a square judge.\n\nAll in all, \"Spice World\" is a very entertaining diversion. It's a pop song in film format: it's airy, fun, and slightly mindless, but for a while you forget about your worries. Certainly not as bad as people have made it out to be, but one to avoid if you really just don't like the Spice Girls. 7 out of 10."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "peteranderson",
        "review_rating": "3",
        "review_title": "Dreadful, but good for fans!",
        "review_detailed_main": "I give this a 3.\n\nSingers can never ever act so what is the point in them acting? That is the question I raise. Dreadful, Hiddious and bad. The acting was unbelievable. It didn't hit target audiences who were left disappointed, it didn't reach out it's goals for genre as they were barely hit either. The only comedy came from a few humourers one liners which proved the films success. A few dramatic stunts and a reasonable storyline saw this through. It was a good film for fans, but for everyone else and on a judging point of view it wasn't very good at all! A 3."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "maconpornstar",
        "review_rating": "",
        "review_title": "Oh Come on,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "dancingqueensw4",
        "review_rating": "1",
        "review_title": "The good, the bad, the Spice World movie.",
        "review_detailed_main": "Being a bit of a film fanatic, I was always of the opinion that no matter what the film, good or bad, it's worth watching. You can delight in the great ones and laugh at the ones that were really really awful. This film changed that opinion. I tried, but unlike any other film, I could not find it funny that I wasted my time watching it.\n\nIt has NO plot. The acting was not just bad, it was so bad it made their singing ability look good... and they were playing themselves! Really, how hard can that be? Don't get me wrong, I'm aware it was suppose to be silly and not taken seriously, but I'm pretty sure it was also suppose to be entertaining... which it wasn't. It just bounced from boring scene to boring scene not linking them in anyway.\n\nEven if you like the spice girls, no amount of nostalgia would be worth watching this film. If you're looking for a walk down memory lane your better off watching Bugsy Malone, Labyrinth, Moonwalker, pretty much anything from the early 90s. Besides, this film made me forget what I liked about the spice girls in the first place. After watching this film, I went from a secret fan, to seeing the spice girls as the people that got me to spend my time and money on the worst film ever made."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Spice World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "fancypatches",
        "review_rating": "1",
        "review_title": "So bad...",
        "review_detailed_main": "I remember watching this movie when I was around six, and loving it. I borrowed it from my cousin about a million times. Recently, I raided my cousins movie collection to find something to borrow, and when I saw Spice World, I thought, why not? It would be fun taking a trip down memory lane. Now that I have seen it again, I'm not entirely sure how I ever managed to watch the entire thing. It's quite possibly one of the worse movies I've ever seen. The plot was crap, the acting was crap, the best thing about it was the music (which isn't even that great itself) and if I wanted to hear SG music, I'd buy a CD. Believe me, you wouldn't want to waste your time or your money on this low budget,mediocre film. I've seen it, and now I can't help but wonder exactly how many hours I spent watching this movie throughout my life, that I'll never get back."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "cloudstrife-3",
        "review_rating": "1",
        "review_title": "Funny, and not in a good way..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Tracy_Terry_Moore",
        "review_rating": "3",
        "review_title": "Oh, the colors!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "emm",
        "review_rating": "4",
        "review_title": "The spice is right. The movie is wrong.",
        "review_detailed_main": "Please, whatever you do, count me out as a Spice Girls fan! You've probably had the chance to read at least 100 of my commentaries on all kinds of movies on this site, so what difference does SPICE WORLD make as long as a forgettably single viewing is just fine. I won't say that is a pretty lousy timekiller. It just isn't worth the appeal, even with five singing Barbie dolls who can dress. The movie is a lot of kidding around, but it actually has its heart in the right place in satirizing movie references and showing off its \"Girl Power\". There! You've got the formula, but you've got it all worn thin after (yup!) one single viewing, not 700!\n\nBut wait! A star-studded cast isn't complete without the delightful likes of Posh, Baby, Sporty, Scary, and Ginger (one of which is gone in reality), and they're getting an extra fifteen minutes of fame selling movie tickets. We'll see in the near future if they can start taking advantage of their acting more seriously. Paul, Ringo, John, and George can do MUCH better! Not only does this rip off The Beatles, but it wasn't even intended to! As you easily know, this movie was put out within a year following the Spice Girls' rapid rise to fame and fortune, and so you have here a rush job in the making. It all goes to show why promoting big name franchises pays off in these high-tech days, without a whole lot of \"movie\" to back it up (Are you paying attention, Sony?).\n\nSooner or later, you're gonna find SPICE WORLD sitting right next to those New Kids On The Block tapes in the thrift stores, and even the GARBAGE PAIL KIDS MOVIE on the dusty shelves of hidden stockrooms. I must call upon any current Spice Girls fan who loved this movie to hang on to what you got. Just like The Beatles proved, the next thirty years will compare to a glass of wine. History is sweet, right? For me and other anti-fans of Top 40 pop music, this movie simply doesn't cut it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "KnatLouie",
        "review_rating": "4",
        "review_title": "C'mon, it ain't THAT bad...",
        "review_detailed_main": "Okay, if you forget that the plot is quite lame, and that none of the girls give any real memorable acting performances, and if you pay notice to Bob Hoskins in that 5 second-appearance, and if you like Richard E. Grant's hairdo, then this movie is at least a 5/10!... (I gave it 4/10, just to follow the bandwaggon...sooorry!)\n\nAnyways, their touring bus is quite cool (with the Union Jack all over it), and the girls were in their prime, so that gives the movie a little edge upwards... Best music-group-trying-to-exploit-their-market-value-film since \"The Commitments\"!!...(note: that movie was 10 times better than this one..)\n\nWell then, SPICE UP your life, and watch this movie!.. (or just go and clip your toenails) Viva forever...or something..."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "imdb-9908",
        "review_rating": "8",
        "review_title": "To *HECK* with all the naysayers!",
        "review_detailed_main": "SPICEWORLD is a good, enjoyable movie. It is NOT Cinéma Vérité, nor is it supposed to be. You want a deep, poignant movie? A thriller? An action-flick? Watch something else. This movie is a farce, and was intended to be only that, nothing more. You people who didn't like the movie are expecting LORD OF THE RINGS or something, and this will never reach that level. But for a fun, energetic, insane romp with countless nods to classic movies, stars, and actors, this is perfect.\n\nThe Spice Girls had their time in the limelight and used it to produce essentially a theatrically-released extended music video. If you're old enough to remember M-TV when it was actually JUST a music video channel, this is what SPICEWORLD is (think of the classic Michael Jackson video/movies like THRILLER where it was music and a bit of story tossed in for good measure). Nope, not Oscar\u0099 material by a long shot, but still quite enjoyable.\n\nOh yes... one last thing: I saw this movie on PPV in 1998 and immediately fell in love with it and the Spice Girls. I was 28 then, and even though I'm 36 now, I still enjoy this movie for what it is. Perhaps that's because I'm OLD ENOUGH to know what it ISN'T."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "charlotte-yonge",
        "review_rating": "6",
        "review_title": "Cool off the spice girls...",
        "review_detailed_main": "Okay, like all you fellow IMDb members, I'm a lover of a movies. But once in a while, a film like this should be making people laugh, not moan about the million things wrong with it.\n\nI haven't watched this flick in ages, but yesterday I was in a \"take-a-look-at-stuff-from-the-past\" mood, found the tape whilst doing my spring cleaning, and so I popped the tape in.\n\nI was a little biased the last time I watched it, being an 8 year old Spice Girls fanatic, but this time I took the film into serious consideration. Don't you get it? It's a satire about film making... And with the fabulous cameos (Elvis Costello, Elton John, MEATLOAF!! just to name a few..)how could you not love it? Just a teensy bit?\n\nTrust me, the British know film, and they know what they're doing with this one. Instead of showing one \"real\" side of the spice girls, they've shoved 50 years of stereotypical rubbish into one movie. You've got people trying to make a movie, a documentary, and the tabloids trying to break the girls apart, along with aliens, hot Italian models and random deja vus. All in one. So, cool off IMDb... if you don't take yourself too seriously and want to step back into the 90s for a good laugh, watch this."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "jnnywatt",
        "review_rating": "1",
        "review_title": "What a joke!",
        "review_detailed_main": "How this movie was ever made is beyond me. Yes the music was catchy, but didn't need to be turned into a movie. Should of saved your money..."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "jimjam20-2",
        "review_rating": "",
        "review_title": "Truly horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Tito-8",
        "review_rating": "4",
        "review_title": "It's not THAT bad",
        "review_detailed_main": "Okay, so the number of jokes that went \"thud\" were plentiful, but there were a few redeeming qualities to this generally weak movie. Surprisingly enough, I'd actually have to say that the Spice Girls were rather enjoyable in this flick, and I genuinely feel that they could make a good movie so long as the script writers actually gave the plot some thought. I also thought that they poked fun at themselves quite nicely, and even showed a bit of talent for comedy. A BIT. Unfortunately, you can't help but feel that this film was thrown together in far too short a time to actually have a good final result."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "migrorycoconut",
        "review_rating": "1",
        "review_title": "Ed Wood is given a run for his money...",
        "review_detailed_main": "I hated to watch this garbage, but I couldn't look away. Anyone who dares to see this movie will feel like a deer in headlights. I had to gnaw on my own leg in order to keep my sanity. It was that bad. And the Spices Girls... were they even trying to act? And all the cameos of famous people like Roger Moore, Hugh Laurie, Steven Fry, everyone, you name it.\n\nThe memorable moment in this movie is the Spice Bus jumping over an opening drawbridge (In case you don't know, the Spice Bus is this huge triple-decker bus with the Union Jack painted on the side). That single shot of a clay bus flying over a cardboard bridge on fishing line made my day.\n\nI come with a warning: NEVER... SEE... SPICE-WORLD! If you value your life, spend your money on something else instead."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "SkullScreamerReturns",
        "review_rating": "4",
        "review_title": "I would hate this...but I won't do that",
        "review_detailed_main": "Spice World was in some \"worst\" list so I got interested. I like a good bad film every now and then. And it didn't disappoint. It's quite a bad movie but not painfully bad. It's quite pointless and partially boring but has enough funny moments to avoid falling into the worst ever category. Having Roger Moore and Meat Loaf in the cast and delivering some subtle funny moments were highlights for me.\n\nIt's the kind of \"so bad it's good\" kind of movie. It manages to be so super cheesy that it redeems itself somehow, and even if my mind says I should hate it I just can't. If you ever have a marathon of cheesy/bad/funny movies, this is a good addition."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "MichaelMRamey",
        "review_rating": "5",
        "review_title": "So Bad Its Good?",
        "review_detailed_main": "This movie is nostalgic for me because I group during the Spice Girls craze. It was only recently I revisited the film and sure it didn't hold up to the nostalgia I built up for it but it was fun nonetheless. There really is no plot, it goes off the rails and feature many meta jokes, some of which got a genuine laugh from me. It was nice to escape into a 90s time capsule for a little while and feel like a kid again."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "r96sk",
        "review_rating": "5",
        "review_title": "Spice Girls as musicians: yes! Spice Girls as actresses: not quite",
        "review_detailed_main": "What a throwback.\n\nThat very split average rating chart makes for interesting reading; suppose it's down to a mixture of Spice Girls fans, people who have nostalgia for the film itself and people who have little to no knowledge of them before viewing. I'm at the nostalgia level, I'd say.\n\nI remember watching 'Spice World' when I was very young and liking it, not sure to what degree but I certainly remember it. I undoubtedly enjoyed their music growing up, entirely truthfully... they did some bangers, don't @ me.\n\nAs for the film, which I probably haven't seen in 15+ years, I'll put it this way: Spice Girls as musicians: yes! Spice Girls as actresses: not quite. It's extremely cheesy and the acting is very subpar, but the likeability of Melanie Brown, Emma Bunton & Co. at least keeps it watchable; to me, anyway.\n\nRichard E. Grant commits to his role, while they also got James Bond himself, Roger Moore, involved. There are also a number of cameos. Their music is entwined well, I wouldn't class myself as a fan but I rate a fair amount of their songs.\n\nI can understand if you dislike this, I truly can, but I found it alright to be honest. I definitely wouldn't say it's anything good, or all that close, though. Fans of the group will love it, I presume."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "noise_pollution1618",
        "review_rating": "1",
        "review_title": "Was there a point?",
        "review_detailed_main": "Why? WHY?!??!?!??!?!!? This is beyond ridiculous. They could not possibly have been making a movie in their right minds. They must have had ecstasy slipped into their drinks or something of that nature because there is no other possible reason. My friend said this movie was so bad it was funny so I figured what the heck, I'll give it a shot. And funnily enough, it wasn't as bad as she said it was. It was worse. A lot worse. Trust me, this movie is what they make you watch in hell. If you're thinking, what's the plot, I'll laugh it at you, not because you've asked a silly question, but because of this movies absence of plot. Its unbelievable. There simply is not a single hint of a plot anywhere. Its just the same vacant looking girls with bad music running around bumping aimlessly into things. Don't touch it, talk about it, or even think about it. This thing makes a baboon's rear end look good."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "alrobertson314",
        "review_rating": "2",
        "review_title": "A slap in the face to feminism",
        "review_detailed_main": "The movie fails to transcend from pop stardom, even with the use of a contrived \"metafictional\" plot line. The narrative is weak, if not non-existent, the multiple lines of action never being clarified or given motivation for existing. The girls have no motivation as characters and act as if they are paper cutouts brought to life whose only desires are to \"go crazy.\"\n\nThe girls' antics only re-enforced the idea that: women are incompetent of dealing with problems aside from fashion and childbirth, profit is always more important than safety or artistry, and being good looking is what gets people through life.\n\nAn overly trashy movie, for an overly trashy era."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "living-green-589-398639",
        "review_rating": "10",
        "review_title": "One of my favs",
        "review_detailed_main": "Nostalgia is strong with this one! Have seen it too many times to count, is fun and silly and makes you want to dance :D"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "EdwardNashtonReeves",
        "review_rating": "6",
        "review_title": "Fun film meant for fans, but virtually plot less",
        "review_detailed_main": "At the age of 9 I was a Spice Girls fan. And I immensely enjoyed it in the cinema. Now I do realize how silly actually this movie was. Spice World is, and is meant to be, purely the fan-fantasy featuring five of their favorite singers doing... well, whatever. The film goes around with several subplots, one more forgettable than the other. But throughout we do see Spice Girls interacting (and overacting). When you are a child fan, that is how you imagine they must spend some of their free time, or at least, you fantasize about it in a similar fashion. Their personalities in the film are actually only exaggerated versions on what stereotype their nicknames presented them with.\n\nIf you are not a Spice Girls fan, do not see this film. You will probably not enjoy. Unless you are looking something 'so bad it's good'. Film goes nowhere and gives you nothing, unless you are a fan and enjoy seeing them on big screen, mostly singing familiar songs, bickering and having fun. It is definitely a plus if you are in a super-funny mode and ready to have some laugh with them and at them.\n\nMy diagnostics: 8/10 for fans, 3/10 for everyone else."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "I_Ailurophile",
        "review_rating": "4",
        "review_title": "It has its moments. It also, mostly, doesn't even try.",
        "review_detailed_main": "Anyone who grew up during a certain timeframe can't have not come across the Spice Girls to some degree in the late 90s. Actively listening to their music, or watching their movie, well, that's another matter. Even if one enjoys a genre generally, movies emphasizing music are a separate issue, elevating ham-handedness to another level that one must specifically prepare themselves for. Then there are the broader questions of whether those known for their music can also act, of whether the comedy will land, of the quality of the story - and how much English flavor will be lent to a feature about an English musical group that has international appeal. Suffice to say that there were already a lot of factors hanging over this film before it even entered production. Let's not beat around the bush: this is possibly worth watching as a matter of curiosity, or for those who are huge fans of someone involved. Yet if you're looking for earnest entertainment value in any capacity, 'Spice World' is almost certainly not the picture for you.\n\nI genuinely appreciate the work of the hair and makeup artists, and the costume designer. The production design and art direction are swell. The filming locations are splendid, and it's a small joy to see what roles were whipped up to provide cheeky cameos for a wide array of actors, musicians, and otherwise celebrities. (Having the most fun themselves, and likewise probably bringing the most to the movie, are Richard O'Brien and Roger Moore, among others.) Even speaking as someone who never paid particular attention to the Spice Girls when they were the talk of the town, I'd be lying if I said I didn't like (at least some of) the music, and the dance choreography. Furthermore, to the credit of writer Kim Fuller above all, I can honestly say there's some real humor here. There's some fine wit in the dialogue and scene writing, even at its most ridiculous, and some facets of parody and referential comedy, too. Some of the exaggerated characterizations are entertaining in and of themselves; more infrequently, some sight gags or physical comedy come off pretty well, too. Whatever else is true of this picture, I had a good time watching in at least some measure.\n\nThat's the good news. There's also a lot of bad news, however, foremost of which is that the plot is astoundingly thin - yes, there is an actual plot on hand. But it's effectively the very literal least that could possibly be penned to provide an excuse for stringing together the various scenes and ideas, and it's managed so weakly that one could be forgiven for supposing that it was the last thing Fuller put in his screenplay. Furthermore, far removed from the cleverness that 'Spice World' can claim at one time or another, too much of the would-be comedy boils down to \"Haha! Isn't this so silly?!\" I know conventional wisdom says that puns are the lowest form of comedy, but the folks who hold to that ethos have clearly never watched a picture that wanted them to laugh just for the mere fact that someone or something is behaving in an abnormal manner. I thought Seth MacFarlane went low with the common tactic of 'Family Guy' of wanting us to get our chuckles from \"Look! A thing you recognize! Isn't this great?!\"; sadly, the approach here is worse. And that dovetails into one more crucial criticism, which is that too much of the amusement this film would seek to provide is pretty much a precursor to MacFarlane after all: the mere presence of the Spice Girls, partaking in whatever the script and director Bob Spiers are requiring of them, is supposed to be Enough. Well, sorry to disappoint, friends, but except for the most diehard Spice fans at the absolute zenith of their popularity, that tack is nowhere near enough.\n\nI don't think this is so bad as to deserve the full ire it has gotten in the past twenty-five years. Despite what the Stinkers Awards have to say, I don't think this is anywhere close to deserving to be counted among the \"100 worst movies of the twentieth century\"; I've seen too many other features that were far worse. It's worth repeating that I did get some honest laughs out of this; there's some real fun to be had. 'Spice world' does have some measurable intelligence behind its craft. It's just regrettable that there's not more, for too many of these ninety minutes rely on the cheapest of all possible gags, and apply the least of all effort to entertain. With a bit more care, this could have been more meaningfully enjoyable; instead, it's noteworthy and memorable for all the wrong reasons. Indeed, again: unless you're one of those Spice Girls diehards, I don't know how much need there is to see this, save for the direly curious. Yes, you could do much worse, but at the same time, with so many other flicks you could be watching, why spend time with this one?"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Lady-of-Rohan",
        "review_rating": "",
        "review_title": "Oh c'mon! It's not THAT bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "Not so Spicy Trash - Worst of 1998",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "pleiades10",
        "review_rating": "5",
        "review_title": "Cute, playful, and bouncy... Much like the Spice's tunes.",
        "review_detailed_main": "What's wrong with pop music? I personally enjoy listening to upbeat melodies with strong harmonies, and the Spice Girls certainly deliver that on their albums.\n\nThe Spice World movie is essentially the cinematic equivalent of their bubble gum pop. A thin plot serves to link a variety of sketches together. Some are quite funny (Bob Hoskins' cameo comes to mind...), and some just leave you staring open mouthed (the alien visitation.) Although I would have loved to have been the alien that got to... well, you'll see the scene yourself.\n\nIt's an ambitious effort, and you gotta love George Wendt in anything he does.\n\nWhile it's doubtful the Spices will return to the plateau of popularity they achieved back in 97 and 98... this movie will stick around as a guilty pleasure. A movie that you don't dare admit to your friends that you have even seen, but when you get the chance, you happily stick with it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "culwin",
        "review_rating": "4",
        "review_title": "Dumb but harmless",
        "review_detailed_main": "Well it's not great, but far from worthy of being in the IMDB bottom 100. It's really just a series of loosely linked skits with dumb cartoony jokes. I would say it's almost for kids, but it's full of references and humor that kids (and maybe non-Brits) wouldn't get. Also loaded with mostly British celebrities, many of whom were past their prime even when this was released. I'm not sure many fans of the Spice Girls at the time were also fans of Meat Loaf, Richard O'Brien, or Bob Hoskins. But I could be wrong. Anyhow, there were several dumb jokes that made me chuckle, so I can't be too harsh on it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "dsnw43253",
        "review_rating": "5",
        "review_title": "All you need to know",
        "review_detailed_main": "The only thing really terrible in this film is the Spice Girls. Other than them, the film as actually O.K. Maybe it would be a lot better if it was based on a fictional pop group. Also, like most films made in the late sixties, it represents the period in which it was made in."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "capelladewdrop",
        "review_rating": "2",
        "review_title": "Was in love with this movie when I was 15",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "DukeEman",
        "review_rating": "4",
        "review_title": "Goodbye!",
        "review_detailed_main": "Not a bad piece of crap to watch on a drizzly Sunday afternoon while ironing the clothes. The gags fly in at every chance they get with the help of a few surprise appearances from notable stars and musicians. What the Monkeys did in HEAD for the 60's is what this movie will do for the 90's. Not much!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "KristenM90",
        "review_rating": "9",
        "review_title": "Just a Good Laugh!",
        "review_detailed_main": "I love this movie simply because it's a good laugh. The acting is terrible, the plot is cheesy, but I love it all the same. You watch this movie, and you're going to think it's the worst excuse for a singing group promoting itself ever. And you'll be right. It is bad. But that's what makes it so great! It's a cheesy movie full of cheesy jokes. It's not supposed to be an academy award winner. It should be the first of the genre \"Cheesy for the sake of being Cheesy\". I mean, if Meatloaf voluntarily in this movie, we all know that it's not to be taken seriously. Mr. \"Bat-Out-Of-Hell\" himself wouldn't be in one of these movies to try and earn his acting credibility. Love this movie for what it is. A cheesy good laugh to watch if you're depressed."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "LeonardKniffel",
        "review_rating": "6",
        "review_title": "Surprisingly Entertaining for Hype",
        "review_detailed_main": "Suprisingly entertaining, this farce about the pop singing sensation the Spice Girls, makes fun of itself and the silly excesses of the times. The movie has been described as a \"madcap musical adventure\" and an \"extended music video\" as the five girls ride around in the double-decker Spice Bus and encounter extra-terrestrials, a haunted castle, and other camp phenomena as they gear up for their first live concert at London's Royal Albert Hall, all the while singing some twenty songs that made them popular."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "angeltutee",
        "review_rating": "2",
        "review_title": "Nostalgic",
        "review_detailed_main": "When i was 7 i thought this film was great! I loved every minute of it!! But i watch it now and's really not that great! but it brings back loads of memories! It's a good movie for British kids who grew up with the spice girls but if you've never heard of them then don't bother to watch it, you just won't get it. If you like the spice girls and all their songs it's good for that. but as for a decent believable storyline; it's rubbish. So, if you're a nostalgic 14-19 year old who grew up in the spice girls era and you feel like reminiscing about old times, rent it out or buy it cheap from a charity shop. If you own it keep it, to remember a good GIRL POWER band from the 90s.\n\nIf you hate this film just remember who it was aimed at: Kids, Mainly girls aged between 5 and 10!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "tayster12-5",
        "review_rating": "",
        "review_title": "What Did You Expect?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "FatPhil",
        "review_rating": "3",
        "review_title": "Of course they're only in it for the money, but so were The Beatles",
        "review_detailed_main": "Not worth the vitriol or hate.\n\nAt least find something to laugh at, even if it's some some unexpected reference, or even a self-reference: \"But I won't do that\"; \"It's expensive! ... Um, not necessarily.\".\n\nHave a snigger at some of the vignettes - Richard O'Brien's late night appearance; every scene with Roger Moore or Barry Humphries; and who can forget the not necessarily expensive thing (yes, it gets two points)?\n\nHas it aged well, given that I'm first watching it in 2024? Of course it has! Every property it was imbued with upon its inception and creation it still has, be that good, bad, or terrible. Maybe like a stinky cheese, it's possibly better than it was because we now know how complete a snapshot of late-90s peak girl power it was.\n\nI'm not asking for anyone to enjoy the movie, but at least be honest, you did laugh a few times, didn't you?"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Leofwine_draca",
        "review_rating": "1",
        "review_title": "As bad as it gets",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "kellidee",
        "review_rating": "5",
        "review_title": "Cuter than I expected",
        "review_detailed_main": "True, they aren't worthy of Oscars. True, they are a little hard to take seriously. And true...their music wasn't the most thought-out music.\n\nBut could you dance to it? Yes. I was once a die-hard fan and as a result I still remember the lyrics to Wannabe. But they of course wouldn't last forever and personally, this movie is a darling movie for people who know not to take it seriously. (In other words, for people who are deathly afraid of ruining their image by admitting they thought it was cute). It's not the best movie ever made. But it made me go \"rah rah Britain\" after the credits rolled.\n\nAnd no, I will never buy it. But I'm not gagging and rolling my eyes trying to prove I'm too \"cool\" for it either."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "specsbecs",
        "review_rating": "8",
        "review_title": "Its a fun movie - no brains required",
        "review_detailed_main": "I've read comments about this movie being awful - and OK so its not something you have to use your brains for, but its FUNNY! These are the greatest pop legends of the 90's, Girl Power shook the world and so of course they were gonna exploit it for all their worth, but the thing that makes this pop band movie so much better than any other are the cameos, the list is endless.\n\nIts got more start turns than an Austin Powers movie, and thats saying something, and great thing is everyone has a sense of humour about their own position, even the girls themselves.\n\nI grew up with the Spice Girls and was a major fan - I'm 19 now but watching it now i find it even funnier - cos now i understand the jokes that flew over my head 8 years ago, and i know exactly who all these brilliant actors and musicians who make their cameos.\n\nIt has great lines, a great and beautiful cast and shows the lives of the spice girls at their most normal and bizarre at the height of their fame, for the young girls the world over who loved the spice girls this is a great film to bring back the memories of almost 10 years ago.\n\nA must for fans - avoid if you had no love for these girls"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "seh-7",
        "review_rating": "7",
        "review_title": "Good for what it is - schtick",
        "review_detailed_main": "Let's face it... the Spice Girls were never going to make a high-brow movie.\n\nI love this piece of fluff for it being just that... a piece of fluff. As infuriating as the whole \"Girl Power!\" while flashing your boobs thing was, it was an interesting phase in pop culture. And for once it was women doing it! The film is actually surprisingly funny. Very well written, the witty lines totally surprised me (didn't expect them to have the collective grey matter to pull it off...) A classic case of a good comedy being put together by having a good team behind them. Lots of fun poked at themselves, which is what makes it, I think, very funny indeed - the girls aren't afraid to completely take the p**s out of themselves. (or they weren't afraid, in those days - the progression of Victoria \"Posh\" Beckham into pop culture paranoia makes you wonder if they'd do it as well now) All up, take it for what it is - a cheesy flick about a pop band phenomenon. Quite funny, but never likely to break any major ground!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "aleris-47883",
        "review_rating": "10",
        "review_title": "It's different and that's okay",
        "review_detailed_main": "I can't believe this has 3 stars. If something isn't your typical made movie people just hate instead of being open minded. The true fans will adore it no matter what, such as myself. To me it may not make total sense but I still love it! I love their music and them."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "justinsbaby291",
        "review_rating": "6",
        "review_title": "Spice World",
        "review_detailed_main": "OK, this movie was a totally pre-teen chick flick. It was incredibly corny, but hey i Kind of liked it. I was a fan of the spice girls, and their acting wasn't to to bad. I suggest no one to watch this if you're over the age of 14 and if your a guy. lol It's really just about them performing and being themselves, not a lot to it. OK, apparently i need to write more to post this comment.Ummm It's a cute movie, If you have daughters that are small they would probably like it. I never thought the Spice girls would be in a movie till this came out, it was pretty unexpected.Overall this move wasn't extremely bad, it was more like aimed at a certain audience."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "jess_martello",
        "review_rating": "10",
        "review_title": "This movie was cheesy enough to be awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "cschult5",
        "review_rating": "7",
        "review_title": "Light-hearted fun",
        "review_detailed_main": "Being a massive Spice Girls fan when they were popular (I was a mere 12- or 13-year-old at the time), I really enjoyed the movie. Even now, as I remember the movie, I still think it's pretty good. For a movie with a British pop group, sure it's no \"A Hard Day's Night\" (the famous Beatles 1964 feature), but it's still fun. The music (while not the greatest) is infectious pop, the laughs are good, and the acting is good (not necessarily referring to the Spice Girls themselves, but the supporting roles). Although the Spice Girls do a bang-up job at portraying themselves as shown through the media and their so-called personas. I give it a 7 because it's not the best movie ever, but because it's a fun movie and for me, it's a stroll down memory lane."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "jessyalice-45621",
        "review_rating": "10",
        "review_title": "Spice girls fans will probably only appreciate this film",
        "review_detailed_main": "This is a very light hearted, fun, cameos are everywhere I can't list them all, songs are obviously brilliant! Have a night in watch this film with friends comedy is a bit tongue and cheek don't take the film too seriously and have a laugh!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "steggymeggy",
        "review_rating": "7",
        "review_title": "Come on people!",
        "review_detailed_main": "I have to say I am biased. I loved this movie when I was younger; I just find the Spice Girls to be fun. This movie has a wonderful imagination. There is the perfect amount of silliness to keep the older viewer watching. In my opinion, they have copious talent that today's popular female singers (eg, Lindsey Lohan, Britney Spears, Hillary Duff) couldn't dream of. For example, how many people, at any point in time, actually enjoyed watching one of their movies? I prefer to stay out of the 'popular' music of today, for I find it extremely lacking. The Spice Girls also stand more for 'girl power,' whereas today's singers won't have anything to do with it if it doesn't deal with ultimate dependence on a guy. I'll say it again, I love this movie. It's an enigma to me how movies as horrible as Napoleon Dynamite end up with higher ratings."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "aoifemoni",
        "review_rating": "10",
        "review_title": "Haters gonna hate",
        "review_detailed_main": "People rating this amazing movie poorly need to get a life. Spice up your life"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "The_Movie_Cat",
        "review_rating": "6",
        "review_title": "\"Can they act? Did anyone care if Marilyn Monroe could act?\"",
        "review_detailed_main": "I was stunned to find the panning this film got. Okay, it's not high art, but it's a good laugh, surely?\n\nOne thing removed from this film in just two years is the veneer of satire. Released in England at a time when the media had begun a predictable backlash and the Spice Girls were about to jettison their manager, this tale of dictating management and not-that-subtle Robert Maxwell spoofs was vaguely on the money. Now that such things are behind the group, and they are indeed back in media favour (for marriages and babies more than the music, and without Geri) this edge is stripped from the film.\n\nSo, what are we left with? Well, the girls aren't about to threaten the Academy Awards, though \"Baby Spice\", who had acted professionally before the group, is noticeably stronger than the rest. Characterisation is strictly one-dimensional, with the constant \"Gucci dress\" fixations of Victoria and crowbarred-in football associations of \"Sporty\" the most irritating element. Suprisingly, the loudest member, Mel G, has the least material foisted on her, and takes the minor role in all the amateurish vignettes. Baby is allowed to smile cutely, and Geri is the brunt of a cavalcade of bra jokes. But this isn't so bad, surely? To spend 90 minutes in the company of five pretty girls, well, four pretty girls, three, well, two, surely, isn't so hard.\n\nUnfortunately, the lack of on-screen presence the girls generate means that they have to be supported by a wide variety of actors, and even other pop stars that achieve a greater presence in momentary cameos (look out for the great scene with Elvis Costello, forced to work as a barman now times are hard). George Wendt, Richard O'Brien, Barry Humphries and even Meatloaf add an air of interest to proceedings, meaning that when the camera switches back to the stars it does tend to sag.\n\nWhen the girls do start to get interesting is when they're performing their songs. Though as most of their songs are remixed or rejigged snippets, this would surely fail to attract the teeny-tot audience at which the film is primarily aimed. As I've said, there are moments of attempted satire, though these are less well-aimed barbs than poorly-aimed damp squibs.\n\nYet still I contend: songs, girls, Roger Moore sending himself up rotten and Richard E.Grant overacting enormously. Not a classic, certainly, but surely good for a throwaway laugh?"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Hot",
        "review_detailed_main": "I like the bit where the toilet got blocked on the bus"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "slouns",
        "review_rating": "6",
        "review_title": "Spice Girls 4ever",
        "review_detailed_main": "So Spice World came out a month after the Titanic. It had some stiff competition. While everybody was obsessing about Leonardo DiCaprio, I was obsessed about Spice World.\n\nI got to see it in theatres during a school day because my sister and I both had head lice and had to stay home. (Our hair was already shampooed with the special stuff and in a bun by the time we went to the movie)\n\nI still have no idea what the friend who was pregnant had to do with anything, but babies are just part of the plot line sometimes. And a lot of people love babies.\n\nBut I loved the Spice Girls and still do, and I have my Spice Girls diary still.\n\nThis movie doesn't have the most rich content, but I didn't go to the movies as a 6 year old for that. I went to see my idols that I had pretended to be in my room as I danced hours on end. I went for the music. These songs still identify my youth.\n\nP.S. I cried when the Spice Girls broke up the first time."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Christopher_Eck_Arvstrand",
        "review_rating": "10",
        "review_title": "This spiced me up real goood! Made me wanna zigga zig, ah!",
        "review_detailed_main": "It's bracingly clever. Spice World is self-aware, and doesn't hesitate in owning the fact that the Spice Girls - and subsequently, their fame - are totally artificial, an invention on the part of record label executives with a complicit media. The band was, of course, created by a record label and not organically - similar to the way a reality TV producer might assemble a cast."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "MrsKat38",
        "review_rating": "7",
        "review_title": "Could be better",
        "review_detailed_main": "This movie could definitely be better but what can I say it was made in the 90's. I did enjoy it for the most part though. I still watch it once in a while. Some of the parts in this movie should have been taken out and not used at all because they were really boring and well stupid. But other than that the movie was overall good."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Lucyinthesky72",
        "review_rating": "10",
        "review_title": "A stupid--but fun, regardless--movie",
        "review_detailed_main": "Sure this movie is pretty stupid, and so are the Spice Girls, but really, there is no way it's as bad as the Lizzie Maguire movie, What a Girl wants, and the list goes on. Sure its kinda ridiculous and unrealistic, but its made for tween girls. And even if you aren't one, its a fun thing to watch. Especially if you used to like them (oh come on, don't deny it--practically every girl did around 1997)it's a pretty strange experience, always thinking \"Oh my god, what the heck was I thinking????\" And this movie doesn't get boring...just a bit embarrassingly bad. It was pretty amusing for me to think back to how much STUFF they had--they weren't a band, they were a merchandising chain!! But, all things considered, I give it:\n\n5/10"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "zacklotker",
        "review_rating": "6",
        "review_title": "Spice World",
        "review_detailed_main": "This is a fun movie even though it can be kind of corny and over the top.\n\nIt's a star vehicle for the Spice Girls who were very popular at the time and releasing their second album. A lot of in-jokes are made about this over the course of the movie.\n\nThe plot is extremely paper-thin. Their manager, Clifford is trying to get them to a gig, but they keep running into hijinks. In a meta side story the writer of the movie is coming up with adventures for them to go on. These adventures are supposed to highlight their unique attributes. For example, Emma is cute and no one would suspect her of being bad. Sporty is sporty. Posh is stylish."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "twistednerves",
        "review_rating": "8",
        "review_title": "Just shut your brain off for some guilty fun.",
        "review_detailed_main": "Spice World is not brilliant cinema. It's utter pap. But it's hilarious if you can get over the fact that the movie is intended to be taken as seriously as the Spice Girls themselves: that is, NOT AT ALL. The movie is a ridiculously campy, plot hole-ridden piece of movie cake.\n\nThere are appearances by Elton John, Alan Cumming and even Meatloaf and all of it just adds to the fact that time will look back on Spice World as a campy gem. Go consult a list of Oscar winners if you want a proper film. The Spice Girls did what even Britney Spears couldn't do -- make a movie that proves to be irreverent and mocking enough to win over the hearts of any willing skeptic.\n\nMemo to Victoria Beckham/Posh Spice: Please spare us any future records and take a break from fashion -- you missed your calling as a comic actress."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "movielovershelbs",
        "review_rating": "7",
        "review_title": "A Fun and Nostalgic Movie",
        "review_detailed_main": "This movie was a cornerstone of my childhood and I unironically love this movie. It is silly, entertaining, over the top and just FUN. The very definition of kitsch and it is great. It doesn't take itself seriously and that is what give it it's charm. I grew up as a massive Spice Girls fan and my VHS copy of Spice World was my prize possession. Its not winning awards, but it won my heart. If you are a fan of the Spice Girls and are feeling nostalgic, this is a great movie to have a good laugh. Like I said, it isn't an award winner by any meanings, but it does what a movie should: entertain you."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "words_like_violence_brea",
        "review_rating": "10",
        "review_title": "Simply the best!....(better than all the rest)",
        "review_detailed_main": "I really couldn't disagree more with everyone on this site. I think that The Spice Girls movie is one of, if not THE greatest film ever made. The seriousness of the entire movie as a whole, is overwhelming, The directors sheer ability to create a certain atmospheres when shooting is exciting and fresh.\n\nThe capabilities of all five girls performance as independent actresses are presented professionally. The odd comical points throughout are clear, precise and witty. The scriptwriter must be very proud of himself/herself...(I'm not sexist)\n\nThis isn't coming from a person who's never been outside and happened to watch only the spice girls movie, but I feel that I have a great and accurate movie judgement.\n\nI feel that the spice girls movie is seriously better than \"The Godfather\""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "simontemplar777",
        "review_rating": "",
        "review_title": "It's Great !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "KateBrad",
        "review_rating": "7",
        "review_title": "Just the fluff I needed",
        "review_detailed_main": "I happened upon this movie after a late night working, and it was just what I needed. Some people chalk it up to the fact that I was dreadfully tired and under stress, but for whatever reason, Spice World made me very happy. People criticize the movie, and the Spice Girls themselves, but I think they are expecting things that the Spice Girls never intended to deliver! Spice World wasn't intended to be a documentary, or a social commentary... just a bit of a laugh in the middle of a storm of pop culture!\n\nSo I'm standing up against the cynicism expected for my age group, the jaded, thrust into the world college students and beyond, and shouting to the world that I'm okay, you're ok, and Spice World is okay! And it is okay to have a little silly movie with a little cheese on top."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "tonystanley-22214",
        "review_rating": "10",
        "review_title": "Fun movie. Not to be taken seriously",
        "review_detailed_main": "This film is just pure fun. So 90s and a reminder to how much the spice girls achieved! Pure fun"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Avoid!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "simoncoram-06766",
        "review_rating": "7",
        "review_title": "Wouldn't watch it a second time.",
        "review_detailed_main": "Packed full of stars, with very little to do. Nonsensical, lacking a coherent, sensible storyline, but worth it to see Rog (at 70) dancing to the Spice Girls. 👍"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "pseudo-3",
        "review_rating": "10",
        "review_title": "Love the Spice Girls!!! Love the movie??",
        "review_detailed_main": "Now I'm the first to admit that I am a huge Spice fanatic. But the movie, eeehhh, I just don't know. It's not that it was awful or anything, but it's not one of my top ten! The Spice girls should stick to singing, but not in the movies!! They sounded absolutely awful, and I got really sick of hearing all of the same songs that I've been hearing for the past few years. They had only 1 unreleased song in that whole movie!! The opening credits had the theater in hysterics though, it was soooo cheesy!! I don't know why George Wendt, Mark McKinney and so many others were in this, they really didn't have any real purpose in the movie, the producers probably could have saved a little bit of money and hired some absolute no-namers to play the exact same parts!! And the whole Alien scene. Come on now, that was way too dumb, even for my cheesy self. The last fifteen minutes was the most entertaining. The main thing this movie does prove, is that the Spice Girls are easy on the eyes, and that they have GREAT shoes!! I'd say that if you are over 15, you should steer clear of this movie, unless you're a Spice fan, and you are REALLY inebriated!! although I did give it a 10/10. Cuz I was Really inebriated when I watched it!!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "getmeagasmask",
        "review_rating": "",
        "review_title": "Only meant for a limited audience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Little-Mikey",
        "review_rating": "6",
        "review_title": "an incredibly stupid movie",
        "review_detailed_main": "This is an incredibly stupid movie for one simple reason. It is SUPPOSED to be an incredibly stupid movie. The girls are cute, perky, sexy and talented! (\"Talented\"? OK, three out of four ain't bad.) To appreciate the movie, one must see the movie for what it is, a satire! The movie was described as a \"mockumentary\" because it basically made fun of everything within reach and some things that were out of reach, like the extraterrestrials who traveled across the galaxies to get autographs from the Spice Girls! C'mon, lighten up! This movie was never meant to inspire or stimulate the intellect. It was made strictly for laughs. The Spice Girls even made fun of themselves. Anything is fair game! The first time I saw \"Spice World\" was in 1998 when I took my daughter, then 10, to the movies. Although she enjoyed it (she was big on the Spice Girls at that time), for me it was sheer torture and an insult to my intelligence. I wanted to cover my face and hope that nobody saw me. I felt that the movie was an excellent example of intellectual manslaughter! If this wasn't bad enough, when the movie was released on video, my daughter wanted the video as well. So we got to see the movie in the privacy of our home. Oh boy! But seeing the movie in the spirit that it was made in, was a totally different experience. It was actually entertaining in a corny way! It definitely qualifies as a candidate for the Golden Turkey Award because it is so bad that it's good! The great and talented Sir Roger Moore obviously read the script before he agreed to contribute his talents to this movie. So it is obviously that he saw the movie for what it was meant to be, a satire, or as they put it it, a mockumentary.\n\nThe movie was loosely based on the Beatles' HARD DAY'S NIGHT. (OK, before you Beatles fans go into a frenzy over that remark, let me explain and redeem myself!) The movie is about a wildly popular group as they tour the country. In 1964, the Beatles traveled by train. In 1997, the Spice Girls traveled by their ridiculously luxurious bus. The scene around the bus should serve as a tip off that this movie is not meant to be taken seriously! Both movies involved a villain who hated the main attraction of the movie.\n\nSo unless you are an \"old teenager\" with fond memories of the \"good old days\" (the 1990s), you may want to lock the door, put on a set of head phones (or turn the volume down low so nobody can hear what you are trying to watch) before putting this movie on.\n\nThen, just lighten up and try not to take everything so damned seriously. You may actually find yourself enjoying this awful movie!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "skistar123",
        "review_rating": "9",
        "review_title": "Enjoyable and light hearted!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "kirk.wagstaff",
        "review_rating": "",
        "review_title": "Embarassing to watch, even more embarrasing to be caught watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "emilie8605",
        "review_rating": "7",
        "review_title": "waste of singing",
        "review_detailed_main": "What an attempt to score more money over girl power! the movie was tacky, outrageously stupid, and the jokes were so pathetic. the spice girls, who are known as a british girl group that give preteens the abilties to feel better about themselves and to have girl power really should have talked to their manager and checked over and over that this is the way to reel in the dough. so what is the true definition of girl power? If the movie was a huge sign of girl power, since they say it over and over and over again, then i get the point that girl power is high shoes and short skirts and pure garbage. i give them the credit for their singing, i like their singing. but the acting really must go somewhere far far away, and thank the lord another movie wasnt made. they should have done a live concert and then made into a dvd special collectors item, and thrown in some free stickers. that could have made more money than that movie ever couldve made with the sales of owning it and seeing it in the cinema. if you were ever a spice girl crazed fan, who felt the need to view every item of girl power produced, trust me when i say that you are NOT missing anything if you never saw this. (F F-)"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "emmas_stalker",
        "review_rating": "9",
        "review_title": "A comical, fictional plot on a hectic and famous life",
        "review_detailed_main": "When i was 8 years old Spice Girls were what i lived for, they were my everything and when this movie came out it was like my life was complete. If you were in on the Spice Girls phenomenon then you will most likely love this movie, purely because it is the spice girls and the appreciation for them will give tolerance for this movie.\n\nThe plot is basically following the girls around for a while before their concert at Albert Hall in London, but it's scripted. There are many many memorable moments from this film that every time it comes up in conversation people will always quote. One being the 'bus going over the bridge' scene and instead of having the stunt proceed a clay model is used.\n\nThe script is very funny and will get a laugh from even the most skeptical. With the soundtrack all Spice Girl songs be sure to bop along with the familiar beats.\n\nAll in all i would recommend this movie to anyone who wants to have a good time and remember back in the days when you were Sporty Spice and life didn't really have that many dramas."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "BlackJack_B",
        "review_rating": "",
        "review_title": "Not a movie, more like a documentary. With BS.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "timothygartin",
        "review_rating": "7",
        "review_title": "Super Fun Contemporary Musical",
        "review_detailed_main": "I think this movie is a lot of fun to watch. It reminds me a lot of \"Chitty Chitty Bang Bang\" in its narrative style. The Spice Girls are very endearing and the musical numbers are fun. The espionage plot is ridiculous, but it is supposed to be.\n\nI enjoy this movie more each time I watch it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "krick",
        "review_rating": "8",
        "review_title": "I loved it, it was much better than \"Something about Mary\"",
        "review_detailed_main": "I laughed far more at this movie than while watching \"Something about Mary\". The humor in this movie, while stupid, never approached the \"scrotum in the zipper\" level. The movie features tons of great cameo spots but actors you love. If the movie was really that awful, would there be all these great people in it? Also, the Executive producer was Simon Fuller of \"American Idol\" fame. I'll be the first to admit that the plot is paper thin and yes, the jokes are corny in spots. But the movie totally succeeds at it's goal and should be appreciated for what it is, which is simply a fun film. Definitely worth picking up. You can easily find it on DVD for under $10."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sugar-24",
        "review_rating": "",
        "review_title": "not a good present",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Laurelin Took",
        "review_rating": "7",
        "review_title": "A cute play on so many Beatles films.",
        "review_detailed_main": "If you hate the Spice Girls, you will probably hate this movie. If not, it is actually a fun ride, drawing heavily upon the Beatles films, like A Hard Day's Night and Magical Mystery Tour. This movie's best quality is that it doesn't take itself seriously. It is silly, and is meant to be so. A good time for those who don't mind \"Girl Power.\""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "kanahandiscord",
        "review_rating": "10",
        "review_title": "chill, it's not bad, it's a parody.",
        "review_detailed_main": "It's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love.\n\nIt's a comedy / parody with smart easter eggs. Wise quotes from the Chief. How far would go some people for some news pictures.\n\nIf you see this movie, you will finally find out what Meatloaf won't do for love."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "HallmarkMovieBuff",
        "review_rating": "",
        "review_title": "The ultimate derivative work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "gazlaz",
        "review_rating": "6",
        "review_title": "Camp fun, best watched with several beers!",
        "review_detailed_main": "OK, OK, OK - camp is a rather overused word these days - mainly by those wishing to damn with faint praise something they saw and liked in spite of themselves. I too had reservations about this movie - pop stars and acting do not usually combine - however, that is not the point of SpiceWorld.\n\nEssentially, this is a send up of the manufactured band and the industry that surrounds it. We have all the key elements - five girls who have assigned 'characters' which are not how they see themselves, a megalomaniac manager who will stop at nothing to get the girls to perform, the tabloid editor who reviles the media monster he has created.\n\nThere is no plot to speak of - the girls are heading to the Royal Albert Hall for their first gig - and , erm, that's it. Along the way they have some adventures, with both the actors and the girls sending themselves up outrageously.\n\nParticularly funny is Richard E Grant as the manager and Roger Moore's one liners - 'when the speeding melon hits the wall etc' are priceless.\n\nUltimately, SpiceWorld is a fun piece of non threatening fluff that will make you smile. It never set out to change the world and never will."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "cleonilsonjr",
        "review_rating": "10",
        "review_title": "Fun and entertaining",
        "review_detailed_main": "I really don't get why this movie has such low score on this website. It's story is fun, cohesive and entertaining. Its not a movie to be taken seriously, and the greatness of it is exactly the bad acting of the 5 girls (Especially Victoria). Even though its 100% acted, it gives us the real personality of each one of the girls, plus, you get to listen to the songs we all know and love. A must watch for all the spice fans and not fans."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Mmyers2003",
        "review_rating": "",
        "review_title": "these kind of films don't work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "wackjumgirl",
        "review_rating": "7",
        "review_title": "Watch it for the movie, not the actresses.",
        "review_detailed_main": "Ok, so maybe Spice World features the Spice Girls. I'm not a fan but I saw this movie anyway.\n\nWell it was hilariously funny. The Spice Girls are obviously good natured enough (either that or very very greedy) that they would make a movie that pokes so much fun at themselves.\n\nThe story line actually made a little bit of sense too. Well it wasn't logical, but it was cohesive enough that you wouldn't get lost.\n\nSo in the end, it was very funny; which gives it high marks. After all, it is a comedy. Go in ready to watch, quit complaining about the stars, and just enjoy the show."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "miss_langevin",
        "review_rating": "10",
        "review_title": "10 years later...",
        "review_detailed_main": "I was packing boxes because i was moving away and I find a box of old VSH's in my closet. So I start going trough them and I fall on Spice World. I decided to watch it. WHen that movie came out in 1997 i'd watch it almost every day. Back then I was about 6 or 7 now I'm 16, and i have to admit I found it really good for a movie of the 90's it brought back a lot of good memories of my childhood. People that say this movie sucked don't realize that this movie wasn't made to be serious it was made for fun, of course its not the best movie but i'll still give it a 10 because of the effort they made for this film. The Spice Girls were my childhood hero and I actually still listen to Melanie C's new solo album Beautiful Intentions and think she's great."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Wild-2",
        "review_rating": "",
        "review_title": "IT SUCKS!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "pumpkin34",
        "review_rating": "6",
        "review_title": "Possible cult status looming ?",
        "review_detailed_main": "Now that the dust has settled and that the Spice Girls have stopped annoying everyone - replaced by weaker, duller, more stupid pap bands -, it's time to watch \"Spice World\" unprejudiced. And realize it's not as bad as you might fear (or everyone said when it was released). In fact, the Spice Girls vehicle is even enjoyable as shallow, but not so dumb entertainment, with a good camp quotient. The self deprecating humor is a good surprise, and the girls seemed to know where they were going - that is, nowhere fast as a \"band\" or musical talents. And the cameos are sometimes really hysterical - I dare you not to laugh at Sir Bob Geldof after his makeover. OK, \"A Hard Day's Night\" it may quite not be, but I wish every teen exploitation movie were as smart as this one. And I bet it will gain cult status over the years. Fear not and be among the first to jump on that particular nostalgia bandwagon !"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "hannahamontgomery",
        "review_rating": "10",
        "review_title": "Amazing!",
        "review_detailed_main": "So funny. So self aware. It's not supposed to be an Oscar-worthy movie. Just spice up your life and enjoy it!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "zingy",
        "review_rating": "",
        "review_title": "It's all about fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Tereza",
        "review_rating": "7",
        "review_title": "I Shouldn't Have Liked This, But ...",
        "review_detailed_main": "BUT ... I DID! I rented this movie for only one reason: I am a HUGE fan of Alan Cumming, and I was curious what the heck he was doing in this movie. Well, Alan's role was not worthy of his enormous talent, but shockingly I found this movie, as a whole, entertaining. I was even more shocked to find that a couple of the girls actually had some talent (I won't name names to protect the worshipers) I've never paid attention to the Spice Girls -- their music is okay, but not something I would buy. There were some really lame parts to the movie (the flashes to the future, the whole baby thing, etc.), but overall it was somewhat amusing. It's too bad that it was all fabricated -- they should have taken a Madonna \"Truth or Dare\" approach -- maybe then the critics would have been more kind. However, I liked the cameo performances by Elton John, Bob Hoskins, etc. and I loved the takes on other movies and songs (e.g. Spice Girl Five aka Tarantino's Fox Force Five in Pulp Fiction, etc. and Meatloaf's line about \"I won't do that\"). Anyway, I don't know who to recommend this movie to. After seeing the movie, those who hate them will only hate them more, and those who love them continue to do so. Perhaps people, as myself, who are ambivalent about the Spice Girls could like this movie."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "arsenalmejordelmundo",
        "review_rating": "10",
        "review_title": "cool stuff...best film ever ever ever",
        "review_detailed_main": "When I was seven and this movie came out, it was the biggest thing around. Everyone wanted to be the Spice Girls. After they split up and weren't cool anymore, everyone forgot about the movie. But ho, ho, what's this? Years later, here I am cleaning out my old Disney and Barney videos and stumble across my old friend that I used to watch everyday. Even at my old age of fifteen, never failed to crack me up.\n\nObviously, this isn't meant to be a contender for Oscars. Anyone can see that. But I can't find much to hate about a movie that's practically the visual to go along with the song \"Girls just wanna have fun.\" That's all it is, fun. And a lot of good fun at that. It's just a guilty pleasure, and it's so much fun to watch it with old friends singing into hair brushes and wearing feather boas. You just need to keep in mind that it was publicity for their new record and it's not meant to be one of those heavy movies you over-analyse. Recommendation: This movie is much funner when you watch it jumping up and down on a couch like a seven year old.\n\nIS THIS NOT THE BEST FILM EVER??!?!?!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "ScreenStarlet",
        "review_rating": "",
        "review_title": "Best of Spice!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "merigold_josh",
        "review_rating": "7",
        "review_title": "a funny romp with those five buubly spices",
        "review_detailed_main": "This movie although short on plot is long on laughs. The way the girls poked fun at themselves was a very sound idea. The cameos were all brilliant. I really liked Meatloaf I thought he did a fine job as the girls bus driver. But most of all we were given the opportunity to watch the girls. The 90 or so minutes is well spent just to see the girls. In the future Emma aka baby spice will act again keep your eyes open for this blond bombshell."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "SyncSessions",
        "review_rating": "10",
        "review_title": "Wonderful movie",
        "review_detailed_main": "This is the best movie I have ever seen. These 5 women are true stars, and shine in their brilliant performances in this film. Spice World has it all; comedy, friendship, girl power, and fantastic music. They really know how to give the fans what they want. The costumes are flashy and the plots and goofy and interesting. Every movie needs a good alien scene. Not to mention one with guys' asses showing through the cut outs in shiny purple jumpsuits. The only ridiculously unbelievable part of this movie is the bad guy, who wants to see the demise of the Spice Girls. The notion that anyone could dislike these five music geniuses is heinous. Overall, this movie gives people a reason to live."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Gandalfe",
        "review_rating": "",
        "review_title": "I'm rather embarrassed to say I liked it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "norbert26275",
        "review_rating": "7",
        "review_title": "Don't take this movie too seriously!!!!",
        "review_detailed_main": "This is actually a very funny movie if you do not take the spice girls to seriously. It is full of slapstick comedy and numerous in-jokes. It's the 'This is spinal tap' for the 90's. I am serious!!! And it's not just the spice girls you get but also a wonderful set of great actors who know that the spice girls are taking the piss out of them selves and play along."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "MarissaWalrus",
        "review_rating": "10",
        "review_title": "An euphoric experience that everyone essentially must enjoy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "GOWBTW",
        "review_rating": "",
        "review_title": "NOT MUCH OF A MOVIE, MORE LIKE AN DOCU/MOCUMENATRY OF SOME SORT",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Bondo20",
        "review_rating": "7",
        "review_title": "Better than most would expect.",
        "review_detailed_main": "The most disappointing aspect of this movie is that too many people will write this movie off strictly because it stars the Spice Girls. Sure, it may not feature much of a plot and the acting is rather bad, but for what it is worth it proves to be an enjoyable, funny film. As their music is running throughout the movie, if you truly can't stand it, you will not like it. But if you like the music or can at least manage, Spice World is worth watching once, or in my case about ten times. After all, sometimes you need to fulfill that guilty pleasure of watching a substance free movie."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "giomarc91",
        "review_rating": "10",
        "review_title": "The Spice Girls were,are and will be the most successful female band.........",
        "review_detailed_main": "The Spice World movie is a great movie.I think this movie does not deserves to be in the bottom 100 of all the movies. For the ones who think this movie is rubbish , i would recommended them to watch it again. Come on all Spice Girls fans let's try to remove the Spice World movie from the bottom 100 , we can do it. I think the girls should love the Spice Girls because they're Feminist , and that's a really good and important thing. My favorite is Emma Bunton , i think she's so sexy and in the other hand she's so sweet. I also really like Geri Halliwell , i like her personality and i think she have had a hard life , she deserves to have a good life. I hope the Spice Girls come back together for a 10th year reunion.Does anybodye knows how can i contact the Spice Girls??? If anybody knows please contact me at gio_9391@hotmail.com Thanks Giovannixxx"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "smoothie-4",
        "review_rating": "7",
        "review_title": "campy",
        "review_detailed_main": "Spice World reminds me of those fab four movies of the 60s. Those movies were primairly made for their fans. The same can be said for Spice World: a Hard Day's Night 1997, but with 5 lovelies instead of 4 mop toped guys. If you try to take this movie too seriously then you will miss the point: it's not supposed to be that way folks. Enjoy this film for what it brings to Spice lovers around the globe, silly fun and nothing more."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "beccam",
        "review_rating": "8",
        "review_title": "its all about the laughs",
        "review_detailed_main": "This movie is great if you feel sad and need some cheesiness to make you feel good. It is always good to watch a movie like this by yourself or with a bunch of friends so you can be awesome and dance around when they break out in one of the lame lyric songs! don't worry i dance too. Although the movie is not the most exciting and action-packed, it sure will make you laugh. So its settled then! watch this movie if you need to laugh ( but a fair warning: go to the bathroom first because you don't want to pee you pants laughing) this is a great movie to watch, but if you are looking for an action packed movie, and expect lots of great features and are also a huge movie critique then try and watch something else, but if you have a great sense of humor then this is a movie for you.\n\nOh and just for the record the popcorn was great!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "PowerpuffNita2",
        "review_rating": "6",
        "review_title": "A decent S.O.M.(State of mind) Picture",
        "review_detailed_main": "First of all, we all know that Spice World isn't the best film ever made. However it's not a bad as...well...You-Know-What starring B.A. and J.Lo.\n\nBut back to Spice World.\n\nI think it depends on your state of mind when you're viewing this potential camp classic. You might enjoy this if you (a)in a Party-Hearty mood, or (b) If your day is sucking and you are not in the mood to think for 90 minutes.\n\nIf you are the type who critiques the hell out of every single film, you might want to reconsider."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "beanomanL8",
        "review_rating": "10",
        "review_title": "spice girls rule forever and ever",
        "review_detailed_main": "I love the Spice Girls because i am a gay girl who loves anything camp. Don't insult my girls, or i'll bite your corny bottoms with my beautiful fish lips.\n\nAnyway, being serious...I think this is pretty good for a girl band. Considering Mcflys (Just my luck) attempt to act was dismal, Spice girls have always been the best and this just proves it. Such a simple storyline and funny quotes make this film more deserving of an Oscar than Titanic. just one thing though..Does Victoria Beckham have any talent at all? apart from popping out babies, spending money and losing weight? Amen to that. I heart Mel C. x"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "mitseloc",
        "review_rating": "7",
        "review_title": "maturing like a fine wine",
        "review_detailed_main": "I remember watching this when it first came out and it was OK but nothing special. Recently I came across a copy and gave it a second viewing, and found it a great laugh and a very pleasurable way to spend eighty-odd minutes. In a time when so many people in the entertainment business take themselves so seriously it is great to watch the five girls make fun of themselves, they knew their acting ability was minimal, except perhaps for Geri, who may have a future in this field. The plot works on several levels, on one hand it can be seen as pure slapstick but also their are more serious threads running through it, such as press intrusion, media distortion of offhand comments (such as Geri's remark about the pope) and the girl's dilemma of balancing their responsibilities between their management and loyalty to a friend (Nicola). This film came out at a time when you couldn't watch TV or open a paper without seeing articles about the Spice Girls, I think many people were put off the girls by this and hence the negative reaction to the film initially. If you can watch this with an open mind just sit back and allow your self to have a laugh at the comedy, enjoy the music and perhaps take on board some of the serious questions the film poses."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "bnamommy9281",
        "review_rating": "10",
        "review_title": "Wonderful Pure Fun",
        "review_detailed_main": "Spice World was a movie that I enjoyed highly,because the Spice Girls were just so cheerful,zany,cooky,and crazy and they made this film absolutely lovable!!!I loved their singing in this film and the Spice Girls did a wonderful job at delivering one heart-stopping performance that was filled with laughter and ecstasy.This movie was meant to be just pure crazy fun,and If you actually took this movie seriously you're stupid,because it's not a movie to be taken seriously,it's comedy and you're supposed to laugh,which I did.Spice World will always be in my heart as one of the best films ever,because I felt it had everything in it to be a perfect movie that made you smile constantly"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Zorro-3",
        "review_rating": "7",
        "review_title": "Good clean fun",
        "review_detailed_main": "People hate this film because it is fluffy and because it features a bubble-gum band. I am not really a fan (my kids are) but I think that musically The Spice Girls are as okay as any other bubble-gum band. However, what could have been really a stupid boring movie, actually WASN'T. It was really quite tight (proving that fluff can be tight). It was cute, funny, fast-moving and had several worthy gags.\n\nRather reminded me of \"Stop Making Sense\" (which of course featured a MUCH greater band)."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Stompgal_87",
        "review_rating": "10",
        "review_title": "One of my favourites, whether of all-time or from my childhood with great music and laughs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "noni-10",
        "review_rating": "7",
        "review_title": "Funny Nostalgic Movie",
        "review_detailed_main": "This movie evokes fond memories of those '60s band movies. I am sometimes reminded of The Monkees, other times I'm reminded of The Beatles in \"A Hard Day's Night\" and \"Help\".The movie centers around the five girls on tour. Many mishaps ensue.If you're a fan of the Spice Girls, or band movies, you'll probably like this one.Cameos include Elton John, Elvis Costello,Bob Hoskins, Stephen Fry and Hugh Laurie."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "onefabbyally",
        "review_rating": "10",
        "review_title": "9 Years On, Forever Brilliant!",
        "review_detailed_main": "Spiceworld has received so many unfair beatings from the public, I suppose you have to expect it as the Spice Gals were one of those groups you either brutally hated, or, overly adored, I'm with the latter majority.\n\nThe Spice Girls were a huge part of my growing up, Their music comforted many a depression, and This Movie made me smile!!!, Even after 9 whole years queuing up on that freezing cold boxing day to see my laydee idols in action cinematic styleee! This movie has never failed to deliver a smile to my face.\n\nFUN FUN FUN - Long Live Scary, Baby, Ginger, Posh & Sporty"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "amyangel96",
        "review_rating": "7",
        "review_title": "I thought I would hate this...",
        "review_detailed_main": "but I really enjoyed it! It's a fun, fluffy, colorful, brainless yet very funny and enjoyable film. Even if you are not a Spice Girls fan, consider giving this one a chance. Invite over a bunch of friends, make lots of popcorn, and enjoy. If the movie doesn't make you laugh, making fun of the movie will."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "chris-dp3",
        "review_rating": "10",
        "review_title": "Probably the best film ever to grace the big screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "atomicblue",
        "review_rating": "",
        "review_title": "Guilty pleasure... big time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "LeRoyMarko",
        "review_rating": "6",
        "review_title": "For the fans only",
        "review_detailed_main": "You must be a fan of the Spice Girls to enjoy that one. There's actually no real story and without the music, there would be nothing. I would agree with some that there should be more songs in the movie. This movie will grow old pretty face. In 10 years when the Girls will probably be long gone from the music scene, there will small or no interest at all in watching this one.\n\n6 out of 10."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "johnny-jane",
        "review_rating": "10",
        "review_title": "a bunch of under dressed women in a bus",
        "review_detailed_main": "staggering brilliance. moving beyond the words of mankind. i was moved, moved to tears. it is like looking into the face of god and seeing him smiling back saying 'i love you' and to prove my love i give give a new world, a better world, a spice world! this is clearly a symbolic story of original sin. Adam went against god and tasted the forbidden fruit. so to is this film a forbidden fruit. it was originally to be coveted by god alone but he has clearly blessed mankind by implanting the story into the director's mind and causing them to show just what magnificence the humanity can create and the sheer, pure, beautiful artwork that mankind has to offer. me thinks that i shed a tear when the girls met the alien creatures. for are we not all aliens at heart. this film will truly stand the test of time."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "GaRbAge-3",
        "review_rating": "",
        "review_title": "Hmm....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "iwatcheverything",
        "review_rating": "6",
        "review_title": "A Good Time Doing Nothing",
        "review_detailed_main": "This film has no real plot but who cares. Once again I ask you why did you rent this film if you are looking for substance. That would have been a waste of your time. The film is for fun and nothing else. Well maybe looking at some hot girls for an hour but that is about all. There is one reference Meat Loaf makes to one of his songs that is pretty funny. Once again a watchable film that is in the bottom 100. What kind of people are renting these films? Check yourself next time your in the video store and if you don't like movies with no real plot then don't see them."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "pegmeg",
        "review_rating": "8",
        "review_title": "spice up your life!",
        "review_detailed_main": "When i was about 7 or 8 i LOVED the Spice Girls! I went to see them in concert, had loads of merchandise and all their Cd's! I was so excited about the movie coming out, i cant remember my initial thoughts on it but i have always thought it was a funny movie. I think the plot was good although parts i didn't get such as the guy who wants to make a movie of the spice girls and the creepy photographer. Overall the film gives off a feel good image and a let your hair down one. The spice girls different personalities make it good viewing too. I think at times the movie tried to be too serious forgetting the fact that some of the story lines were a bit too silly and that the spice girls aren't professional actors. However the funnier and less strained scenes were brilliant such as the bits at the old house and the photo-shoot. Now being nearly 18 i am well out of the movies original target audience, although i was when it was released! So now being older i can pick up on things that are not good but that doesn't take away my initial love of the movie. Also people seem to be dissing the spice girls on here, for them i will say this they were and still are one of if not the biggest girl band of all time, their songs are catchy and original and they were a strong young women who made valuable contributions to music!!!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Corp Hix",
        "review_rating": "",
        "review_title": "Good Fun Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "shieldspt",
        "review_rating": "6",
        "review_title": "Entertainment & Fun",
        "review_detailed_main": "This film succeeds for me in being exactly what it set out to be ... light hearted, low-effort, feel-good ENTERTAINMENT. It's strength lies in the self-parody - not only of the Spice Girls themselves but also some of the other cameo guest appearances [...some of which probably won't be appreciated by a non-UK audience].\n\nProbably best watched (as I did!) with a cinema full of kids during the peak of the Spice Girls craze. Now that bubble has burst much of the appeal (& humour) has died with it. Still, it was FUN while it lasted."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "madge_ano",
        "review_rating": "10",
        "review_title": "Spice up ya life...",
        "review_detailed_main": "Well, this movie was really--at first. It started off with them singing a \"new\" song. It was okay, but then after certain parts I think the writers got lazy and that's why the end of it sucked. It was a HUGE flop at the box office and now I know why.\n\nI saw it the other day. But, if you're not a fan of the Spice Girls, DO NOT watch this movie. But if you are a fan, I say go and watch it. It'll be a nice little remebrance of the 90s! Gah, I have to have over ten lines. Now to waste time... Victoria Beckham's fat in this movie. Melanie C isn't all dykie. Geri Halliwell comes off as a know it all b!tch. Emma Bunton and Melanie Brown kinda play backseat in this."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "brother ian",
        "review_rating": "",
        "review_title": "I quite like it really...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "MovieFan983",
        "review_rating": "7",
        "review_title": "If you don't like the Spice Girls why did you see it?",
        "review_detailed_main": "People have been saying oh this movie was horrible, then why did you go see it? Oh Spice girls are bad then why did you go see it? I don't personally love the Spice Girls but they are ok and I thought Spice World was an enjoyable movie. One thing I think all you guys who don't like Spice Girls, but went and saw it are closeted Spice Girls fans. I give it a 7 out of 10"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "stitch_groover",
        "review_rating": "10",
        "review_title": "A whole SpiceWorld of fun",
        "review_detailed_main": "This film is a blast! Definitely not to be taken seriously (some people act like they were expecting Shakespeare here), it's a funny, charming, witty and light hearted romp through a week or so in the life of the Spice Girls. Of course, the girls play stereotyped versions of themselves - Mel C is always exercising, while Baby is constantly sucking lollipops and Posh obsesses over which black Gucci dress to wear.\n\nThe girls aren't bad actors; they seem quite natural, which is probably not as easy as it sounds when making a film. The plot is quite simple, but the twists and turns it takes (eg the screen writers explaining their premise to Richard E Grant becomes a narrative of the girls actually doing the crazy things that so far have only been committed to paper) make it a wild ride.\n\nMy favorite part of the film is the incredible special effect of the double decker Spice bus leaping over an open drawbridge. The build up to this scene was perfectly tense, and the climax of the scene was brilliantly conceived and executed. I've seen this film many times over the last few years. Andjust so you know, I'm a 32 year old, straight Australian male."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "Rancid junk food . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "rfrfreak67",
        "review_rating": "10",
        "review_title": "Best movie ever",
        "review_detailed_main": "Spice world has completely touched my life forever. All you losers out there who are like this is a horrible movie are absolutely positively insane. I love this movie so much I can't even describe it. Spice world is a classic. It's more of a classic than the Wizard of Oz or like Snow white and the 7 dwarfs. I know when spice world first came I was like oh my god. Me and my friends use to each be one of the spice girls and we would recite every word of the movie and sing every song. I mean seriously we still sit and watch it sometimes just to bring back the memories and because we love it so much. All and all it rocks you can't deny. You know you love it you just don't want to admit it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "oogy_boogy",
        "review_rating": "",
        "review_title": "\"they don't just sing...\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "green_daisy",
        "review_rating": "6",
        "review_title": "What?",
        "review_detailed_main": "The Spice Girls are great but they need to stick to singing not acting.There was no plot but it had big shoes!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "BoSoX6292",
        "review_rating": "10",
        "review_title": "Spice Up Your Life!",
        "review_detailed_main": "I remember when I was seven and I went to see the Spice Girls in concert with my sister and cousin, it was the best concert of my life. Back then everyone wanted to be them and if you did not like the Spice Girls girls did not like you. When I got their video Spice World I was in heaven. I used to watch it everyday. Their kind of like Hanson though you could love a band so much and then they kind of leave the seen or you grow up and think your too old for them, well I do not think I ever grew out of them or got mad when they left the seen. When their CD Forever came out I know i bought it the first day it came out and this movie makes me laugh even after so many years. Every so often my sister, cousin, and I get together and watch the video for fun. If you have not seen this video your life is not complete!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "vixen_taylor2003",
        "review_rating": "",
        "review_title": "should watch it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "meganisis",
        "review_rating": "10",
        "review_title": "The Spice Girls big adventure... :D",
        "review_detailed_main": "---Contains No Spoilers\n\nI know they were a pop band which was meant for a short shelf life but come on people this is a great family movie. I find it humorous and exciting every time that I watch it. No matter what you say you can't deny that this is a crappy movie, it might not hold anything important for the world and it may have been a ploy for popularity of the Spice Girls... but it was a cute movie! Besides if you hate the plot you can just stare at Geri (Ginger Spice)'s beautiful body run around he-he! So please, give this film a chance. \"Hold on to your knickers girls!\" Best Line Ever."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "pink_summers",
        "review_rating": "10",
        "review_title": "The fun time",
        "review_detailed_main": "\"Spice Girls\" What good memories does those two words bring back?\n\nI remember renting this when I was seven years of age with my best friends, happily enjoying a kiddie sleepover. Little did I realize back then how bad the acting was, how it now seems like a low budget movie, and how it was poorly directed. However, at seven years of age what did I care? They were my superstars that I hung posters up on my room. They were the girls I looked for inspiration, this ladies who were my idols at the tender age of seven. While watching this movie I got excited and loved singing to the songs with all my best friends. So what if it isn't a award winning performance? I will find this \"ancient\" movie in my attic one day thinking back to the 90s, and I will blow the dust off of the paper cover protecting the video cassette. What good memories it brings back.\n\nIf you were young at the time and loved the Spice Girls, then by all means watch it for those memories. If you were never a fan or never knew about them, don't watch it. I guess it's just a movie for us who have been fans screaming on the couch when we were in grade one."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "berryblizzard",
        "review_rating": "10",
        "review_title": "stop hating this movie!",
        "review_detailed_main": "so this movie came out when i was about 7 years old. i don't know when i first saw it but it was sometime maybe a couple years after. then last summer it was on TV and i watched it and i still loved it, and i was 15 at that time. it is definitely the most random and most fun movie i have ever seen. i love how they just break out into song at any time and i love all the songs that they sing. it's so much fun to watch. i was talking to my friends about it a few months ago and they all still love it too. the people who hate this movie are the people who watched this movie expecting it to have some great plot and amazing dialog. that's just not how the movie is supposed to be watched. it is not meant to be something you watch seriously. it is supposed to be fun and remind you maybe of what it was like to be a kid. that's definitely what i think of when i watch it. just sing along and forget about your problems. and don't hate a movie that wasn't meant to be an academy award winner, it's just supposed to be fun!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Tiffxrawr",
        "review_rating": "8",
        "review_title": "They Spiced Up My Life",
        "review_detailed_main": "I loved this film when I was seven and I still love it today. I think that for any Spice Girls fan, this was a great movie. The acting may not have been Oscar worthy, but I feel they did a great job making their audience laugh acting as themselves. Though some of the scenes could be considered corny or out of place, this film was overall very entertaining to its target audience: the fans. It is not for everyone. Just as I will never love the movie Purple Rain as much as my mother did due to her generation's love for Prince, not many will love Spice World the way Spice Girls fans do.\n\nThe Spice Girls were positive role models in the 90's for girls like me. Scary Spice inspired me to love my huge curly hair. Sporty Spice inspired me to embrace my inner tom-boy. Their songs were catchy and widely popular for a while. Their movie venture may not have been as successful as their songs. However, it was not a total flop. Spice World had a wacky but interesting story line and a few compelling sub-story lines. This will always be considered one of my favorite movies"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sadie_m_lady",
        "review_rating": "10",
        "review_title": "A great fun piece of entertainment",
        "review_detailed_main": "I truly do not understand why some movies are available and some aren't this one should be it's such fun and the music is great completely and totally too much fun not to be available to watcH"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sanja_van_huet",
        "review_rating": "8",
        "review_title": "Hidden Gem - You need to look closely",
        "review_detailed_main": "I was doubtful about this movie but my daughter insisted we watch it together. I was amazed at how art house it was – with throw backs to the old Beatles movie genre and other madcap '70's and 80's productions (Thunderbirds, the Monkees, etc). Apart from the catchy music and the generally enjoyable overacting – the all star cast makes it a genuine 'spot the actor' vehicle. (For example: this from http://filmbabble. blogspot.com/2007/06/20 -great-modern-movie-cameos.html : \"Elvis Costello as a bartender and credited as 'Himself' Costello plays a nice tongue-in-cheek note as the Girls talk about their possible flash-in-the-pan prospects\".) It spoofs everything about those bad movies we loved to watch – model buses jumping over model bridges, E.T. (the Movie) in 'bad green coats', the Magical Mystery Tour amazing bus, media moguls (Rupert Murdoch anyone?), Hollywood 'run and go' action movies, over-sexed Italian dancers etc. The more I watched the more I saw. I drove my daughter crazy pointing out ... 'hey that is a takeoff from ...'. If you are studying cinema or just have a movie trivia interest, Spice World certainly gives you more to argue about than Citizen Kain (sorry Orsen) or Pret-a-Porter (apologies to Robert too). If this movie was written by the Directors wife – she was a movie buff. It is better than you think!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "chicdrummer",
        "review_rating": "8",
        "review_title": "Still one of my favorites",
        "review_detailed_main": "I'm a bit biased because I'm a card-carrying member of the pre-teen Spice mania but I love this movie. The cameos, the jokes (they still hit for me anyway), the absurdity, and, of course, the soundtrack.\n\nIt's not a serious film and it doesn't pretend to be. They poke fun at themselves and the industry as a whole. This film takes on the tabloids the way \"Josie and the Pussycats\" took on pop music as a whole. The cleverness is hidden behind the absurdity.\n\nAre they Oscar winning actresses? No, of course not. But you can tell they had a great time filming and I've seen much higher rated films that I've enjoyed way less."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "luckycharmz7",
        "review_rating": "10",
        "review_title": "Terrific!",
        "review_detailed_main": "I personally have loved this movie since I was about 7 years old, the first time I saw it with a friend. Although I'm 14, I still love it, and me and one of my friends watch it just for old times sake. It's not a movie everyone is going to like, though. I know that I love it because I grew up with the Spice Girls. It's a fun movie with lots of Girl Power, which is great because it shows how good of a time even 25 year old women can have singing songs about \"My Boy Lollipop\" on a speedboat with a couple 10 year olds! It's a feel good movie to watch with your best buds, especially if you know they won't make fun of you for watching it. It's definitely worth it though, I have it on tape, and watch it to this day! Fun movie! P.S. It's not supposed to sound smart and dignified - it's supposed to be stupid, not the most intelligent thing you've ever seen."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "brettmcneill",
        "review_rating": "10",
        "review_title": "Please don't hate me. The best bad movie ever!",
        "review_detailed_main": "First off i only gave this movie a 10 to get it out of the bottom 100 because it doesn't deserve to be there. Second, how don't people find this movie hilarious and entertaining? I'm a guy and I remember i watched this movie because i thought Baby Spice was hot and then i found myself laughing my a** off.\n\nPlot: Spice girls have five days to prepare for their first live gig and they meet the most wackiest characters on earth.\n\nOK yeah there is no plot but it doesn't matter. The jokes and the characters keep me laughing and having a fun time.\n\nBottom line: THE BEST BAD MOVIE EVER!\n\nGrade: ***/****"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "AnimagusGirl",
        "review_rating": "9",
        "review_title": "It DEFINITELY depends...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "frankmcgowan-official",
        "review_rating": "10",
        "review_title": "These girls know how to have fun! They even made their own movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "People! People! Please!",
        "review_detailed_main": "Movies with pop stars taking the silver screen are the best in the world! No joke, people! No joke! And this movie is such a notable example! Yeah, I remember the late 90s very well; in addition to all the young girls screaming for bands like \"N*Sync,\" \"The Backstreet Boys,\" \"98 Degrees\" and others, as well as voting for such music videos on TRL on un-MTV (LOL), there was a girl band all the way across the pond from the greatest country in the universe, the United Kingdom! And they were known as...the Spice Girls! So people, if you like Europe, or England, or if you're a guy who needs a good movie with lots and lots of pretty English girls in it, then this is the one! 10 stars out of 10 stars! Yes!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "surfdog",
        "review_rating": "10",
        "review_title": "Just plain fun",
        "review_detailed_main": "Just a fun movie that never takes itself or the stars too seriously. Add a few cameos and a couple of in-jokes and you've got a better movie than anything the Lads of Liverpool came up with and it's certainly more enjoyable then that other predictable \"titanic\"-sized snore-fest of 1997."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "motleyspice",
        "review_rating": "10",
        "review_title": "Best movie in all of history!!!",
        "review_detailed_main": "Describing the greatness of this movie in 1000 words or less is impossible, but I will try to give it the justice it deserves. The \"Speed\" rip-off scene, ALONE, beats most movies in their entirety. This was a documentary of sorts, obviously making fun of themselves. If you can't see the genius in this film, then you deserve to be called a name that I can't print here. This movie is a great way to see the spice girls in action if you missed their 1998 tour. They perform all of their hits. You can't take a movie to seriously, when it has sill quotes in it, like, my personal favorite (and senior yearbook quote), \"The headless chicken cannot see where it is going, it can only remember where it has been. Do not be that chicken.\" My husband and I knew we were destined for each other because we both share an affinity for all things spice girls. The humor in this movie is timeless, and unsurpassed. SPICE GIRLS FOREVER!!! SUMMER TOUR 1998 <3 BEST SHOW EVER!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "DuplexPenthouse",
        "review_rating": "10",
        "review_title": "Its the Spice Girls",
        "review_detailed_main": "In my personal opinion i thought that this film should have been made the best film ever made. I loved this film and i have got it on DVD and i watch it every Saturday night.\n\nI believe that this film has been critised because it contains the spice girls and is about the spice girls I disagree! I love this film because it is good.\n\nIt is my favourite film and my favourite part in it is where there is the symbolism and analogy to life in general. I think that this analogy has raised important questions in my life and will make me a better person.\n\nIt is such a profound and immerse film. I insist that you should watch it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "clever-7",
        "review_rating": "10",
        "review_title": "10 if u're a fan - 0 if u were the victim",
        "review_detailed_main": "As a ex - spice girl fan I have to say I loved it, I watch it a million times and i never got tired of it. After they split they became crap and i only follow Geri now.\n\nBut anyway, the movie... this is one of those movies that you either LOVE or HATE.. well that depends if you went to see it cuz u were a spice girl fan or you were force to see it cuz your girlfriend or boyfriend (which in this case he's gay and if he's gay it means you're a gal too) or you daughter or son (ohh surprise!! your son is gay!!!, lets face it.. all spice boys are gays and don't tell me that's not true cuz in the spice girl fan club they were 80% males.. and they were ALL gay or bi, some out of the closet and some of them not at all) or however wanted to see it made you go and you just had to cope with it.\n\nall being said.. I'm outta here."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "bobsteimle",
        "review_rating": "10",
        "review_title": "Fantastic Fun and Music for the Whole Family",
        "review_detailed_main": "There hasn't been a collection of this much feminine beauty in one group since the Lennon Sisters. I love their music. I love their happy attitude about life. I love the light-hearted, jovial way this movie presents itself. It's a spoof. If people weren't so uptight, it would receive a much higher rating than it has. I'm almost fifty years old, and I have nine children. I have probably watched this movie over a hundred times. When I first got the DVD, I watched it with my kids almost every day. My wife thinks it just because I'm in love with the girls, whom I do think are beautiful, but it's actually because of the jokes. It's not just a few; the movie is full of them. I see it as being as funny as Monty Python or Benny Hill. It's the kind of humor you love to quote. I highly recommend it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "damond-1",
        "review_rating": "10",
        "review_title": "love it",
        "review_detailed_main": "this film is one of the best I've ever seen. It's funny, and smart- just the combination the Spices should have! I definitely recommend it to any 90's fan, any former fan, or anybody who wants to watch a funny, cool, and enjoyable movie. The reason I wanted to watch it at first was because I wanted to remember the fun old days. It wins with flying colors. All of the Spice Girls have their own fun charm, and it's hard to hate them (unlike the crappy celebrities of today). SpiceWorld can take you back to a time when music was fun and cool, not a big puddle of self-pity. Some parts may not be quite exceptable for a younger viewer, though that's why it's rated PG. Everyone needs to see this movie, it's truly awesome!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "trimbo",
        "review_rating": "8",
        "review_title": "Oh come on... it's fun!",
        "review_detailed_main": "You complainers are no fun. This flick is pure entertainment. I laughed out loud many times. I was a Spice Girl hater as well, but I had a blast watching Spice World."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "swilber",
        "review_rating": "10",
        "review_title": "See this movie, it's hilarious!",
        "review_detailed_main": "People instantly dismiss this movie because the Spice Girls are the stars, but give it a chance. This movie may not have any philosophical undertones, but it truly accomplishes its task - to make you laugh! I've seen this movie probably about 7 times now and I still laugh like crazy while watching it."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "RobLangilledotcom",
        "review_rating": "8",
        "review_title": "What's the big deal.",
        "review_detailed_main": "All these comments about how bad a movie this is, blah blah blah, is just an example of people's spite over something they don't like. (For example, the Steamroller that was The Spice Girls Phenomenon.)\n\nIf you look past all of the rhetoric that the whiney, know-better, know-it-all, tough-guy-behind-my-17\"-monitor-internet-supremicists like to blow their hot air into, you will see that this movie is nothing but a dollop of haphazard fun.\n\nMy daughter and I have watched it numerous times, just because of the fun, laughs, and pokes of humour it dictates. (I also think the Spice Girls are hot, and I have no problem watching them jump around.)\n\nIt features spunky actors, silly writing, cute British film tributes/references, neat cameos, fun music (if you like that kind of music that doesn't refer to killing, sex, or whining), and is an obvious ride on the merchandising train that the Spice Girls were.\n\nThere is nothing stupid, or bad about this movie. It's just simple fun. (And it features Sporty Spice!)\n\nIf you were expecting an Oscar contender, than you obviously have little clue about what this movie brings to the table. And if you think this movie was bad, and nothing but a bandwagon money grab, then you probably haven't seen Tomb Raider.\n\nI recommend this movie to people who have no preconceived notions, no prejudices against our little Pop-Tarts featured in this movie, and just want a giggle."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "notoriousaurus",
        "review_rating": "10",
        "review_title": "Beautiful, simply beautiful.",
        "review_detailed_main": "It is a shame that most movies fail where an outrageous comedy such as Spice World succeeds. The back of the laserdisc that I purchased without seeing compared the movie as a cross between A Hard Day's Night and This Is Spinal Tap. You couldn't have a better comparison.\n\nI am not the biggest Spice girls fan, but writing this review in 2001 long after their 15 minutes of fame are over, I can be a little less closed-minded.\n\nHere is some questions that you in 2001 (and beyond) may ask of this movie:\n\n1) Is this movie is funny?\n\nYes it is, I agree that if you liked A Hard Day's Night you will enjoy Spice World also. It is funny in the very same nature. A pop sensation gets into all sorts of trouble when they have to be both a pop-group and true to themselves. It leads to some hilarious sequences, some in a dream state.\n\n2) Do I have to like the Spice Girls to enjoy Spice World?\n\nIt helps, looking back now on the \"Spice phenomenon\" of 1997-1998 I can think of no real reason why I disliked them, they are decent singers and each had their own distinctive style to them. It is funny in retrospect how much this group DID NOT share in the same style as the Backstreet Boys and N*Sync. The Spice Girls were separate entities, while today's boy bands aren't. The movie revels in this, each bit of dialog having wit and coming exactly from the lips of the characters that say them. Everything fits together beautifully and is seamless. Anyone with a sense of fun can enjoy this movie.\n\n3) Does the movie have camp appeal?\n\nAbsolutely. You have many many fun and campy scenes. Hear Roger Moore say \"A chicken without a head can only know where it came from, but cant see where it's going. Don't be that chicken!\" or hear Victoria tell Geri how to help a sick boy out, \"Why don't you take your top off for him?--I know I was just joking.\" To which Geri replies, \"I know. No real point in that though, his eyes are sealed shut--Oh look NOW there open!\" At it's very least Spice World has HUGE camp appeal and look for the hilarious Bob Hoskins cameo!\n\n4) Is watching Spice World a religious experience?\n\nNo. But you will have a good time if you have any sense of humour, and that is what movies are all about. Check it out, I bet you will like it!\n\nPeace out,\n\nShawn"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "KylieLover",
        "review_rating": "8",
        "review_title": "\"Sunday drivers, and it's only Saturday...\"",
        "review_detailed_main": "This movie has got better with yea-ts for me. I was a huge fan of the girls back then, and at first I thought this movie was stupid. But know that I've re-watched it, all I can say is that gets better. The line I'm using as summary is just an ace line from the only Spice that brings a good performance: Victoria. Don't know if she's playing herself and she just cartoonize herself even more. She has the best lines and she knows how to bring em.\n\nThe stupid situations are getting better. Nothing compares with the scene when they are in the country house and start to talk about they nightmares. Or when they see themselves as moms. They had really good charm."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "angel4l",
        "review_rating": "8",
        "review_title": "Actually Quite Funny",
        "review_detailed_main": "I didn't expect this movie to be as good as it was. I though it was sooo hilarious. I only saw it because Alan Cumming was in it but now I am very glad I saw it. The Spice Girls wer actually very good actresses and Alan was wonderful as well. This movie is a must see for anyone with a youthful sense of humor or who loves pop music."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "stylnbry",
        "review_rating": "10",
        "review_title": "The FUNNIEST movie I've ever seen!!!",
        "review_detailed_main": "This movie is absolutely HILARIOUS!!! I hated the Spice Girls before my friend made me watch this movie, and now I LOVE them! This movie is one of the funniest movies I've ever seen in my life, and I watch comedies all the time. This is definitely my new favorite movie."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "FilmBuff-34",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "I'm not a huge Spice Girl fan but i really liked this. I am a male, so this might look odd that I was watching Spice World, well at first when it came to video I wouldn't let it in the house, Then it came on HBO and I watched it and loved it. For men, watch it at least twice, once to stare, then to listen. Girls you can watch it for the music and the comedy, just watch it though."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "x-25",
        "review_rating": "10",
        "review_title": "A refreshing comedy laced with self-irony.",
        "review_detailed_main": "Even though I enjoy good drama's and whatnot as much as the next person, to watch a silly and trippy romp through England's country with those incredibly adorable Spices was really refreshing. To be able to sit back and just have a good time was something I think everyone needs to do, and to watch this movie is just the flavor. It's good for a culture that's taking itself so seriously these days."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "girlpxwer",
        "review_rating": "10",
        "review_title": "Fantastic!",
        "review_detailed_main": "This movie is fun, unique, and you'll like it even if you're not a fan of the highly-successful girl group. It's not In-Your-Face Spice, and they even poke fun at themselves. I give it five stars, for being an instant slapstick comedy classic."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "alain-aouad",
        "review_rating": "9",
        "review_title": "Funny and light! A Good feel movie about Pop stars lives...",
        "review_detailed_main": "This movie has everything related to the pop life in it, a comedic thrilling ride in the lives of a pop star band! The paparazzi, the fame, the fans, the back clash, the media, the managers, the shows and of course the greatest girl band the world has and will ever see: The Spice Girls! The Spice girls in a way gathered all the pop life elements in their movie, mocking even themselves, they tried to show the world that this is all a fun ride and you must enjoy every minute of it while it lasts, and this is what they did in their 2 years world domination rally! You can't watch this movie though if you're a pop music or Spice Girls hater, if you are into pop and into light comedy and cheesy jokes then this movie is for your eyes only (a little wink to Roger Moore's cameo). Relax, get your best friend with whom you spent most of the 90's hearing ace of base and Take that on your CD player and enjoy this movie for old times sake! Now the acting, the plot, the script etc... They all fade into the background when you've got the Spice girls up front doing their thing! So stop complaining about this movie, it is not just another Oscar Submission, its supposed to be a funny ride and a silly joke for God's sake, lighten up and enjoy it for what it is!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "MelanieC",
        "review_rating": "10",
        "review_title": "Set prejudices aside, and you will thoroughly enjoy this film.",
        "review_detailed_main": "I know, it's a movie by the Spice Girls. But that is exactly the point. If you sit down and watch the movie as a movie made by the Spice Girls without analyzing it like an art house film, you will find that the movie is filled with interesting quirks, and hilarious cameos (Meatloaf is the bus driver, it doesn't get funnier). The movie is not a film, it is the Spice Girls remaking a \"Hard Day's Night.\" But, you have to take that grain of salt in order to watch it. Those that despise the Spice Girls will probably never be convinced of it's humor and wittines, but those with open minds may see that this movie really does have something to offer (especially to the college age indie rock fan, if you have the sense of humor typically associated with this crowd, you may piss yourself laughing.)"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "SpiceLux",
        "review_rating": "10",
        "review_title": "I can't believe I like this!",
        "review_detailed_main": "After reading an Entertainment Weekly review on STARSHIP TROOPERS, I went to the store to rent it. Grabbed the wrong case out of new releases and, unbeknownst to me, had rented SPICE WORLD. I watched it anyway, laughed, giggled and tapped my toes. It's a dumb film, but then so was ROCK 'N ROLL HIGH SCHOOL & GET CRAZY but they're still fun! It had some genuine silly moments, some good lines and their personalities added to the fun. I still giggle just thinking about Posh doing the obstacle course --- you go girl!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "klinsi18",
        "review_rating": "10",
        "review_title": "I love the Spice Girls!",
        "review_detailed_main": "Even though the plot of the film is not eye-catching, people should not just treat it as entertainment only. This movie also tells us the life of those in the limelight and what they do and have to overcome. Only matured people will know how to appreciate \"Spice World\". This movie also has the good aspects such as the settings. They are beautiful."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "TribeXENA",
        "review_rating": "10",
        "review_title": "Best movie from a band in years!",
        "review_detailed_main": "I loved this movie!. I highly recommend it to any one who is or ever was a Spice Girl fan. This movie is very funny, the Spice Girls poke fun at themsevles though out the movie, showing themselves, as the critics put them down as, a self-absorbed band!Which makes it all the better. I myself have seen it in the Theatre 5 times! Who knows how many times I've seen it on video!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "trish990",
        "review_rating": "10",
        "review_title": "One for the Fans",
        "review_detailed_main": "This film is definitely only enjoyable if you are a fan of The Spice Girls, but why on earth would you be watching it if you weren't?\n\nIt is very amusing, and I admire the way the girls send themselves up. It would have been better if there had been more music though, but overall a worthy effort."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "SuGa",
        "review_rating": "",
        "review_title": "It was alright",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "alexstinks",
        "review_rating": "10",
        "review_title": "Brilliant fun movie for any Spice Girls fan!",
        "review_detailed_main": "I love this film so much! I was brought up in the 90s listening to the Spice Girls and I was obsessed with them!\n\nI remember a family member bought me this on VHS and I loved it! It was just fun! Clearly it's not the type of movie that's supposed to be taken seriously. It is just supposed to be more of a spoof movie about the Spice Girls! I love the songs, costumes, crazy scenes! I also really enjoyed the cameo appearances from Meatloaf, Elton John and co. It was exciting for my as a child watching this.\n\nI love it even now! Brings back great memories! I can't fault it for what it is! It is just a piece of light hearted fun!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Crap_Connoisseur",
        "review_rating": "",
        "review_title": "A Classic Of World Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "disco_diamond",
        "review_rating": "10",
        "review_title": "This is a treat for spice girls fans",
        "review_detailed_main": "This movie is hilarious. It is stupid and that is why it's funny. There have been some people comparing this with Glitter or Crossroads, but there is a big fat difference between those \"movies\" and this one. The spice girls are playing themselves and they are making fun of themselves as opposed to Britney Spears who thinks she can act. This movie takes the mickey out of the whole spice phenomenon. It is rediculous- for example when it suddenly rains inside the building, or the whole movie pitching idea with the bomb. You need to have a sense of humor to enjoy this."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "glgioia",
        "review_rating": "",
        "review_title": "Worth a Watch to Judge for Yourself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "inkygrrl",
        "review_rating": "10",
        "review_title": "For the fans",
        "review_detailed_main": "It's very much for the fans. It's not Mystic River but that's not what you'd watch it for!\n\nIt's just a week or so in the lead up to the girls doing a massive concert at the Royal Albert Hall and all the problems that happen along the way.\n\nI'm 20 now but at the time I was a huge fan and loved the happy colourful film as it plods along nicely, I still pull it out occasionally for a bit of reminiscing!\n\nDefinitely for the fans...and little kids who'll watch anything colourful! :)"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "VerhoHo",
        "review_rating": "10",
        "review_title": "What were you expecting?",
        "review_detailed_main": "Give this film some credit. Gimmick flicks like this are usually unwatchable trash. Sure the jokes were lame and not one of the Spices can act, but was it really any worse than any of Richard Lester's Beatles films? The homages were funny and I'm sure they were much appreciated by film-literate parents who were forced to sit through it. I am definItely not a fan, but watching the film on DVD was quite an experience. The musical sequences were so well done that I almost enjoyed the music. It's beautifully photographed candy for the eyes."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "matlock-6",
        "review_rating": "9",
        "review_title": "The movie you love to hate. So quit hating!",
        "review_detailed_main": "This movie is not nearly as bad as people would have you think. Instead, it's a victim of the huge Spice Girls backlash of the late 1990s, when the market was saturated with Spice Girls this and that.\n\nBasically, a copycat of \"A Hard Days Night\" with the Beatles, the movie does what it was intended to do: appeal to 11 year old girls. Other people, particularly adults, who so violently HATE this are a little disturbed, in my opinion. It's not supposed to be shakespeare and the girls never claimed to be Lawrence Olivier. It's silly, dumb and sugary sweet, and there's nothing wrong with that at all.\n\nWhen I was in college, this was the weekly free movie (we got to see one movie of their choosing a week for free if we showed our student ID at the door). People hooted and hollered and derided it to no end, but secretly I'm sure they all liked it on some level, just like I did. See, it's not COOL to like the Spice Girls.\n\nA harmless family movie that you can rent and enjoy with your young daughters, without worrying about foul language, violence and sexual innuendo."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "kylehaines96",
        "review_rating": "9",
        "review_title": "A Guilty Pleasure.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "nichkeiy",
        "review_rating": "10",
        "review_title": "Hilariously Ridiculous",
        "review_detailed_main": "I'm surprised this movie has scored just 3 stars! Sure, I wasn't expecting a 10- but perhaps I would have guessed a 5 or maybe even 6. This movie made me laugh, I thought i would hate it but I found it really quite hilarious- It was ridiculous but in a funny and deliberate way. It wasn't like it was trying to get the thought provoking film award and failed, a cinematic masterpiece was not the agenda here- but a little bit of fun which I believe it definitely succeeded in doing.\n\nThe crew making the documentary on the spice girls, the two guys who are \"brain storming\" film ideas for the spice girls to star in, the spice girls manager and then his boss are all just hilarious. In fact the whole thing is hilarious- This movie is not made to be taken seriously! The whole thing is a deliberate joke! Do people not see this?\n\nI don't know what people expected from this movie for it to fail so much in their expectations to warrant such a low rating. I am all for movies like \"Copper Mountain\" scoring hopefully VERY low ratings (I recommend you go see it just so you can boast you have seen the worst movie of all time) as it was a movie whose ABSOLUTE ridiculousness was not deliberate or entertaining- but the horror which is \"Copper Mountain\" has scored level with \"Spice World\", absolutely unfair.\n\n\"Spice World\" succeeded brilliantly in what it set out to do- be hilariously ridiculous."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Bas-7",
        "review_rating": "10",
        "review_title": "It converted me! Even anti-Spices can find humour and entertainment!",
        "review_detailed_main": "I wasn't a Spice fan until after I'd seen the movie. Originally I went for a laugh (and boy, did I laugh!) but I've become a hard out Spice Girl fan! There are so many cameos, puns, inside jokes, and advanced jokes, it really is wasted on children (no matter how much they say they enjoyed it!). Me and my friend were guffawing along for almost the whole way. From the hilariously advanced one-liners to the stupidest dialogues - it will keep you in hysterics. The acting may be worse than on other movies, but the costuming, humour, action and music of these 5 (now 4) girls will catch your attention (and your heart). I now own both their cds, a few singles, dozens of posters and books, and of course the video! Spice up ya life and see it! See ya at Albert Hall!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Cath-o",
        "review_rating": "8",
        "review_title": "Wonderfully funny!",
        "review_detailed_main": "It may not be a critically acclaimed masterpiece that illustrates the redeeming traits of mankind, but it is funny. It is not sophisticated humor, but it is humor. As a general guide, if you liked the MONTY PYTHON movies, this should be right up your ally--campy, British humor!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "ospice05",
        "review_rating": "10",
        "review_title": "Too Much of Something...Isn't that bad.",
        "review_detailed_main": "OK, I think a lot of people really don't get this movie. This movie was not made to win an Oscar. If you watch this movie, the girls are making fun themselves. One thing about the Spice Girls was, they had a lot of control of what they did. They knew, that trying to make a serious movie would be a huge mistake. This movie is so enjoyable for anyone. Yes it is stupid, but in a really enjoyable way. The were a great group who knew what they were doing. Still enjoyable today. There are so many great appearances from great actors. They have Meat Loaf, Allan Cumming, Elton John, Elvis Costello, and the funny Roger Moore. With music and dance, and outrageous clothing, this movie is definitely a movie that will make the girls remembered for their enthusiasm, and their ability to make fun of themselves."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "good_girl",
        "review_rating": "8",
        "review_title": "Better than I expected",
        "review_detailed_main": "I went to see this film to mock the Spice Girls because I hated them. Soon in to the film I realised that they were mocking themselves so I just settled back and enjoyed it :) It is funny and light with wonderful cameo appearances. I now don't hate the Spice Girls and have bought the video. It's strange how things turn around...."
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "So What Do You Want? How About An Actual Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Joe 25",
        "review_rating": "10",
        "review_title": "I LOVE this movie!!!!!!!!!!!!!!",
        "review_detailed_main": "I LOVE this flick! The Spice Girls are very talented, and in this movie, they prove that again. The movie is cool, and the songs are great. The soundtrack is just incredible! I could go on and on raving about this movie, but It would take much more space to do so. Spice Girls fans will dig this movie, especially me!!!!!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Coxer99",
        "review_rating": "",
        "review_title": "Spice World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "leighabc123",
        "review_rating": "10",
        "review_title": "Number 38 On The Worse Movies Of All Times List?",
        "review_detailed_main": "Yes this movie was stupid. But is was funny. We also got to hear the Spice Girls' beautiful voices in this movie. And they are such lovely ladies, especially Melanie B! I can watch that movie over and over again!"
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "brandyrankin05",
        "review_rating": "",
        "review_title": "Entertaining w/o Being a Good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "lita11475",
        "review_rating": "",
        "review_title": "If it wasn't 'spice', you wouldn't complain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "alfred_zamora",
        "review_rating": "",
        "review_title": "Welcome to life in the Spice bubble",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "newsies",
        "review_rating": "",
        "review_title": "Twice the Girl Power",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "stkngirl79",
        "review_rating": "",
        "review_title": "No matter how many times I watch it, I still laugh!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "OLAF21",
        "review_rating": "",
        "review_title": "Great product",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "crazyrabbits",
        "review_rating": "",
        "review_title": "I don't believe you people...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "thejaynester",
        "review_rating": "",
        "review_title": "Nostalgia at its finest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "shrek2004",
        "review_rating": "",
        "review_title": "Fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "jmcgraw7",
        "review_rating": "",
        "review_title": "eye-candy for little girls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Larkin-2",
        "review_rating": "",
        "review_title": "Boring but cute!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "amyrose2021",
        "review_rating": "",
        "review_title": "you're all wrong!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "RosalieBustingMyBowls",
        "review_rating": "",
        "review_title": "Ug...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "shrek2004",
        "review_rating": "",
        "review_title": "Interesting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "David, Film Freak",
        "review_rating": "",
        "review_title": "Pump up your platforms and hold onto your knickers!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Sterling",
        "review_rating": "",
        "review_title": "hello",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "pha-2",
        "review_rating": "",
        "review_title": "This Spice gives me heartburn!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "lodiciusrocker",
        "review_rating": "",
        "review_title": "a cult film?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "envy_the_king_07",
        "review_rating": "",
        "review_title": "Excellent movie about the spice girls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Jerry Ables",
        "review_rating": "",
        "review_title": "A fun and entertaining musical romp",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "BeetleBon99",
        "review_rating": "",
        "review_title": "You love them, you hate them.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Andreas-12",
        "review_rating": "",
        "review_title": "Pretty Stinky",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Butterworthp",
        "review_rating": "",
        "review_title": "SO GLAD IT'S OVER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "dmedhi",
        "review_rating": "",
        "review_title": "What, Oh.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Pingu-2",
        "review_rating": "",
        "review_title": "Where's The Plot?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Cbak",
        "review_rating": "",
        "review_title": "Not Citizen Kane, but so what.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "mangabird",
        "review_rating": "",
        "review_title": "Damn these mis-guided husseys...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "naria",
        "review_rating": "",
        "review_title": "this movie was soooo weak",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "carface-2",
        "review_rating": "",
        "review_title": "If you wanna be sleeper",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "MrTacchi",
        "review_rating": "",
        "review_title": "It's so deep and touching it made me cry.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "the_urban_milkwoman",
        "review_rating": "",
        "review_title": "Just groovy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "Taiyo",
        "review_rating": "",
        "review_title": "Could have used a tad less spice...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "james-302",
        "review_rating": "",
        "review_title": "It was great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "CSW-1",
        "review_rating": "",
        "review_title": "Cute Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120185",
        "movie_name": "Spice World",
        "movie_rating": "3.7",
        "review_username": "horror3333",
        "review_rating": "",
        "review_title": "The best movie EVER!...when I was seven years old.",
        "review_detailed_main": ""
    }
]