[
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "ethan_frank",
        "review_rating": "7",
        "review_title": "Classic Indian Romance, Well Acted, Well Scripted!",
        "review_detailed_main": "Though it's been 4 years after the movie released, it's a delight write a review on this movie. In real life, various human relationships are weighed, analyzed and misinterpreted to dishonor its values and discolor its beauty for personal interests. This is an intelligent and collective effort to beautifully feel the ideal Indian mannerisms and relationship values as in a beautiful dream; not only the romantic relationship between a boy and a girl but with families, parents, children, siblings, in-laws etc.\n\nIntelligent and effort-full scripting, excellent scene blended music/songs and profound insights in making those so called 'silly' moments of life beautifully. There were some scenes felt like could have been done better, but none of them stayed on top till the end of the movie. Though this movie has an old fashioned narration, repetitive camera movements, and evident studio backgrounds, altogether it wonderfully delivers a triangular chemistry between three environments; the girl, the boy and the audience. Sooraj, your commendable vision and patience to make 'vivah' points out that this won't be the last and your best of all the time! Eagerly waiting for another wonderful and better cinematic experience! :)"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "WoooFy",
        "review_rating": "8",
        "review_title": "Sweet film!",
        "review_detailed_main": "Vivah is by no means a classic. However in the days of hardcore action, path-breaking special effects & complex plots (none of which Bollywood has mastered yet), its quite refreshing to see a simple film like Vivah. The story as we all know is a journey from a couple's first meeting to their eventual wedding after some coy moments and testing times. Nothing more, nothing less. The music isn't quite in the same league as MPK or HAHK but doesn't jar your senses either. Two songs stood out for me - Mujhe Haq Hai & Do Anjaane. While Milan abhi aadha & Hamaari shaadi were hummable. Shahid performs sincerely & shows a lot of potential. Its good to see him play something else but the \"cool dude\" he normally does. Amrita is very sweet and plays the role of a docile small-town girl to perfection. Alok Nath, Anupam Kher & Seema Biswas are terrific supports and the rest of the cast does a reasonable job. Suraj's direction is simple but effective. The movie's prime flaw is the slow pace which might test the patience of a lot of young viewers. But all in all a good, clean, decent family movie."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "jassi1984",
        "review_rating": "8",
        "review_title": "Beautiful (if a bit slow) movie",
        "review_detailed_main": "This movie brings back many memories of the classic cinema of old, where actors didn't have to take their clothes off to make viewers watch their film.\n\nFirstly I think the main plus point of this movie is the amazing chemistry between Shahid and Amrita, it is definitely the making of the film.\n\nI have seen lots of comments regarding the film being sickly sweet and overly slushy. In response to this, I think to a certain degree this is a correct analysis, however considering this is a Barjatya film I think that compared to MPK, HAHK, HSSH and MPKDH, it has been toned down significantly. HSSH was almost unbearable to watch in some places.\n\nIn this film however, when the sentimental moments come along, you find yourself smiling, wishing the budding couple all the best and hoping that nothing bad happens to them.\n\nAnother major plus point is the performances of Shahid and Amrita. Both have acted very well, especially Shahid who looks great in the film. Amrita looks simply stunning and should be taken seriously as a future major star.\n\nAlthough I really enjoyed the film as a whole, I do feel that it was too long. Some of the middle could have been trimmed off and it would maybe made even more of an impact. I also think the music, although it fits into the film when you see the situations is slightly old fashioned and the movie could have benefited if a more up-to-date soundtrack had been available. Although the picturisation of the songs Mujhe Haq Hain and Hamari Shaadi Mein are wonderful.\n\nAll in all, I definitely recommend this film, its romantic, looks stunning and has a dramatic climax (I won't go into details, just in case you haven't seen it.\n\nPS. If you're prone to crying-take a tissue! (I needed several)"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "shamari_70816",
        "review_rating": "",
        "review_title": "So beautiful.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "Vivaah (2006).... a simple film on family values.....",
        "review_detailed_main": "\"Vivaah\" feels more like a 70s/ 80s film from Rajshree Productions filled with family values and culture. Unlike Rajshree's \"Hum Aapke Hai Kaun\", the film is slow and the songs and music are comparatively weak. But the film has a simplicity and is away from the modern treatment. Perhaps the very simplicity of this film made it a big hit of its time. Personally, I liked the film; and Rajshree movies should be commended to keep alive the family values through its movies; and \"Vivaah\" too joins this league. The simplicity and the spontaneity the film carries through its characters and settings get equally complemented with good performances from Shahid Kapoor, Amrita Rao, Anupam Kher, and Aloknath. In the stream of boisterous and noisy movies, this film kind of gives an inspiration for commitments and family values.\n\nRating: 2 stars out of 4"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "isshvkv",
        "review_rating": "10",
        "review_title": "Nice Clean AWESOME family film - it has taught me a lot !!!",
        "review_detailed_main": "My Comments for VIVAH :- Its a charming, idealistic love story starring Shahid Kapoor and Amrita Rao. The film takes us back to small pleasures like the bride and bridegroom's families sleeping on the floor, playing games together, their friendly banter and mutual respect. Vivah is about the sanctity of marriage and the importance of commitment between two individuals. Yes, the central romance is naively visualized. But the sneaked-in romantic moments between the to-be-married couple and their stubborn resistance to modern courtship games makes you crave for the idealism. The film predictably concludes with the marriage and the groom, on the wedding night, tells his new bride who suffers from burn injuries: \"Come let me do your dressing\"\n\nV I V A H - showcases a lot of good things - beauty of arranged marriage, beauty of Indian culture, beauty of Indian woman, last but not least a nice IDEALISM of the about-to-be-couple waiting to get married .... playing by the rules ! Simple yet Beautiful; Such a Simple story .... no plot ... no villain - as is the case with most of Sooraj Barjatya films. Sooraj sir is back to what he does BEST. He has made the movie with FULL CONVICTION. Its a very sweet film - which teaches the current generation a lot of good things bout Arranged Marriage & the Union of 2 Families. I think AMRITA RAO - looks very good & she has acted very well. She has most of the good scenes - although i thought the last half hour was completely to Shahid Kapur - who for a change gives an awesomely restrained performance. I also liked the acting of all others for ex. the Choti i.e. Amrita Prakash, Alok Nath, Anupam Kher, Shahid's bro & sis-in-law. It almost seemed as real and recognizable as it could. Sooraj sir has got another nice family film to his credit after Maine Pyar Kiya, HAHK & Hum Saath Saath Hain. The chemistry between Shahid & Amrita is AWESOME.\n\nStuff like Sanctity in a Marriage/Relationship, Avoiding Courtship, Mutual Respect, Care & Space, Waiting for getting Married \"officially\", Praying/Sacrficing for Ur Beloved - all these and more get SHOWCASED in Vivah. There's still some good audience who r going & enjoying this film. Some of the folks/audience are already excited after seeing, that they r thinking bout Arranged-Marriage :) Thats Success if you ask me. it seems AMRITA RAO - our actress-from-Vivah {Result for a nice performance} has been bestowed the prestigious DADSAHEB PHALKE award for 2006 !! Hats off to her for this achievement Chalo, even though Vivah , Shahid or Amrita didn't get any of the film-fare & other awards; @ least this is news to CHEER about !! Congrats to AMRITA RAO- for showing us a visual of Indian Bride-to-be in the purest form and Of Course to Sooraj Barjatya for portraying her the best way :) Shudn't forget Shahid Kapur and all others who make VIVAH as sweet and legendary as it is today !! Imagine, to share the same pedestal as the legendary Dilip Kumar .......... Its no mean achievement !! Congrats to Amrita Rao - for taking her Career to another level with this award .... I personally feel - she should keep doing movies only with Shahid Kapur !! They make a cute couple and their on-screen chemistry reminds me of {SRK-Kajol} or {Aamir Khan & Juhi Chawla} .................\n\nSome points that I observed,few of the elements :- #1 If u notice carefully, Amrita Rao looks so good because shes always wearing traditional dresses. She gives every bit of the Indian Woman essence - in this film !! Perfect Fit #2 Shahid Kapur is like most of us - not exactly ready for marriage or early-marriage .... but PREM listens carefully to the step-wise talk given by his DAD - having full faith in Anupam Kher. Eventually \"Honesty\" & \"Trust\" are the keywords that he reflects in his first talk with Amrita. Most people would think such a first meeting with a total stranger plus for a limited time is never enough to judge a person. But according to what I saw in this film, I have a feeling - that Two people who are made for each other can connect within a 1st meet also, Its possible !!! #3 In the entire movie - there are basically 4 or 5 sequences where Shahid & Amrita are together - or shown to be together. Its unlike most other romantic/wedding-based movies where Hero & Heroine are always singing/dancing or nowadays - doing cheap stuff. But the beauty of each of these 5 sequences :- Characterized by restraint, innocence & respect for the other ! #4 I really liked the relationship shown between Chacha ALOK NATH & Amrita Rao. These kinda movies should highlight the indifference shown to daughters/girl-kids in some parts of India. #5 Romantic scenes between lead couple are shot very nicely - no cheap scenes,songs are beautifully pictured !! Words like \"Jal\",\"praarthana\" e.t.c. are going to be buzzwords for all girls who liked this film :) Personally, I really am fond of many dialogs in this film. #6 Last but not the least - The entire Hospital Scene where Shahid puts \"sindhoor\" to Amrita when shes struggling for Life - is terrific. Those dialogs between the couple are so touching and U feel the LOVE/I-cant-do-without-U ; Its a Hats-Off feeling !!!\n\n*** In many ways, VIVAH reminded me of Maine Pyar Kiya, DDLJ, Qayamat Se Qayamat Tak, Hum Dil De Chuke Sanam - for the freshness/on-screen-chemistry of the LEAD pair :) :) *** IF U ASK ME :- Along with films like Rang De Basanti, Lage Raho Munnabhai, DOR, CORPORATE and Kabul Express, V I V A H ranks among the best films made in 2006. IN FACT - i think Vivah does deserve better viewing/business than Dhoom2 or Fanaa or Golmaal or all those time-pass/fuzzy/style/crap movies !!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "badaamit",
        "review_rating": "7",
        "review_title": "😁😁🙏🙏",
        "review_detailed_main": "Again Sooraj R. Barjatya has showing outstanding ritual marriage in this movie ......"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "1",
        "review_title": "Director Sooraj Barjatya is unable to translate his vision to the screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "honeyluv98",
        "review_rating": "9",
        "review_title": "Romantic, traditional & an important message",
        "review_detailed_main": "I watched the film because I have grown up with the Sooraj Barjatya films & was keen to see what they would offer after the disastrous Main Prem Ki Deewani Hoon..\n\nThe story of the film is incredibly simple & I feel that the simplest stories make the best love stories, as they revolve around the emotions of the characters. So, this is definitely not a movie for someone who likes to sit at the edge of their seat when watching a film.\n\nThe performances of the movie are good.. Shahid & Amrita do justice to their role.. The support cast is wonderful. The standout performance is Seema Biswas - excellent in her role. Mohnish Behl is great in his bit part. I love the writing in the Shahid-Amrita scenes especially in the second half.\n\nI don't want to debate whether the film is realistic or not.. Its a film, so a certain amount of exaggeration & fiction to heighten the drama is understandable. But, I appreciate the message at the end of the film - importance of love & trust over physical appearance and accepting daughters & not daughter-in-laws into families."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "irisstrings",
        "review_rating": "6",
        "review_title": "Another Arranged Marriage but with a fresh new couple.",
        "review_detailed_main": "Poonam (Amrita Rao) is a pretty, beautiful, sweet, honest, obedient and a \"I-want-a-daughter-like-her\" typical Indian country girl. She is the sunshine of her father's (Alok Nath) eyes. A family friend notices her as a perfect fit for one of his friend's (Anupam Kher) son. Well who is this chosen groom? Well his name is Prem (Shahid Kapoor). He is also obedient, good looking, honest, educated blah blah. I guess you get the point. Of course he is instantly attracted to Poonam when he looks at her picture. A typical Indian private meeting is arranged. The candidates approve each other and then begins the journey from engagement to marriage. This is a new installment by the king of family movies Sooraj Barjatya.\n\nThe director has brought in all the usual flavors of romance to this treat. A pair of fiancée that will be approved by every audience member, their romance that is expressed with first-hesitant-then-cheesy-confident looks, conversations through smiles, choosing the matching dresses, secret rendezvous and almost every single thing that has seen and heard till today. As per the trademark there are also the family parameters into this equation. Father daughter relationship reminiscent of Maine Pyar Kiya (1989), girl loss of her mother at young age seen previously in Hum Aapke Hain Koun (1994), teenage romance from maine pyar kiya, rural lives and nature's beauty and family values perhaps tackled in almost every other movie of Barjatya. In and all this is a perfect rated-PG family movie that is bound to be approved by everybody. And just like every Barjatya movie it starts with goody-goodies and has a little twist near the end that would be a probable reason that might jeopardise the \"build-up-too-much-cheesy-romance\" relationship. But everyone knows that this movie was made for those two people and they would end up being together forever and ever. Of course they do so.\n\nBut I must warn you that this movie has an ending that was rather unnecessary. The first-night scene might have been important by Barjatya but that rather made this tale a total turn down. This is something like going to the smokey mountains, enjoy the scenery, breathe the fresh air and then slip from the highest cliff and fall in the valley. Sooraj had the recipe. But I guess he was hallucinating the success of the movie already and right when he was finishing cooking \"Vivah\" he added salt thinking it is sugar.\n\nOn another plus side the couple looks good on screen. Amrita, if I may say so, has done a better portrayal of a wannabe rural girl than Shahid's urban boy portrayal. Songs are good. Some scenes such as Prem's first gift to Poonam, their meeting on the roof, their chemistry has been picturised well. In the end I can say that if you want to enjoy a weekend with your family then take them to this movie."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "aisha_hd",
        "review_rating": "2",
        "review_title": "What a movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "nmanib",
        "review_rating": "10",
        "review_title": "SWEET (best in its genre)",
        "review_detailed_main": "Really not a big fan of indian family dramas , but VIVAH will be always an exception.\n\nAmrita stole the show , everyone else are so good too.\n\nI just hope , hindi cinema will make a movie like this again , just once.\n\nI definitely recommend it."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "rajdoctor",
        "review_rating": "6",
        "review_title": "Vivah",
        "review_detailed_main": "I have an impression of how Sooraj Barjatya makes his films \u0096 starting from Maine Pyar Kiya, Hum Aapke Hain Koun, Hum Saath Saath Hai and Main Prem Ki Diwani Hoon \u0096 he has always made over the top movies. Showing everything bigger than life \u0096 the family, the relationships, the ceremonies and everything he does.\n\nSo when I had heard of Vivah, I had very low expectations from what to expect from this Rajshri Production cropper \u0096 the same old story of two family, marriages etc. On top of that I read the story of it \u0096 poor town girl, rich city boy \u0096 arranged marriage story. Oh, I am totally out of this crap \u0096 I said to myself.\n\nSix months later \u0096 Vivah was celebrating its silver jubilee in a small town of North West India \u0096 Jaipur and still running strong. That interested me a bit, and I started reading some internet reviews. I found that the movie has flopped miserably in metros and cities, but is doing great business in small towns and villages. Oops\u0085.That factor took my notice and when the occasion came I decided to give this boring Indian saga a go, just to see what is on the cards.\n\nThe story is about a small time merchant (Alok Nath) and his family \u0096 wife (Seema Biswas) and two daughter \u0096 one own (Amrutha Prakash) and another adopted daughter (Amrita Rao). The family gets an invitation of engagement from a Delhi based business man's (Anupam Kher) son (Shahid Kapoor). The family meets, the boy likes girl, the girl likes boy, engagement is held immediately, and after 6 months the marriage date is fixed. The only problem is that Seema Biswas does not like to give importance and spend too much money on Amrita. On the day of marriage there is a fire in the house and Amrita saves the life of Amrutha \u0096 that changes the Seema Biswas' heart. But will the boy \u0096 Shahid Kapoor still marry Amrita who has suffered 40% of burns on her body.\n\nSo the story is simple. The Director Sooraj has kept the traditional Rajshri production style - keeping the basic strong. And what is the basic? Indian family values, tradition, respect, love, sacrifice etc. But this time Sooraj has learned his lessons and kept the story simple. He has not gone over the top on any occasion. The sets are simple, the story format is simple, the sets are simple, the dialogues are also not over the top, but reflective of emotions. And this format marvels and fits Rajshri tradition. It was such a relief to see a true Rajshri movie after such a long time \u0096 more than two decades I think.\n\nThe stealer of performance is given by none other than Seema Biswas in a very complex role of a traditional and jealous mother. She speaks so less with her mouth but tremendous with her eyes. When she opens her mouth and speaks a few words just venom comes out of it. Great acting! She becomes the capital stone of the movie on which the script hinges.\n\nRemaining actors have performed their roles diligently. The music by Ravindra Jain is the biggest let down, except the single song \u0096 Hum Ko Hak Hai, which is melodious.\n\nIn usual Sooraj Barjatya style, the life of small town street where the house is situated is built on the set. But still the detailing is good and only a keen eye that spots the existence of set.\n\nOverall a movie that fairs above expectations.\n\n(Stars 6.5 out of 10)"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "basit_mc2",
        "review_rating": "5",
        "review_title": "best movie",
        "review_detailed_main": "This is one of the best Bollywood movies i have seen up until now. Family and friends feel the same way about it. This movie is really romantic and dramatic at the same time. In my opinion we need more films or movies like this to keep the south Asian culture alive. Shahid Kapoor and Amrita Rao acted extremely well in this, also their couple attracts a lot of people to the movies. This is a must see movie, it's a family and romantic movie. This movie is also from the makers of Hum Saath Saath Hain and Hum Apke Hain Kon. This movie is their best right now... the setting of the movie was beautiful which also is a huge attraction. This movie is must see... recommended to everyone!!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Corny first half, affecting second half, Quite watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "rtivari",
        "review_rating": "7",
        "review_title": "The linear plot mars a beautiful movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "shatabdimondal",
        "review_rating": "9",
        "review_title": "BEAUTIFUL MOVIE",
        "review_detailed_main": "THE SCRIPT IS REALLY GOOD.SAHID AND AMRITA'S ACTING IS REALLY AWSOME."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "virindra",
        "review_rating": "6",
        "review_title": "movie of the 18's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "an-41340",
        "review_rating": "1",
        "review_title": "Went through the trouble of making an IMDB account just to give this a bad review. Its THAT bad of a movie",
        "review_detailed_main": "Currently, I'm in the same room as someone who's watching this movie; I can't change the channel. And, wow. I have thrown up in my mouth at least 10 times in the first 20 minutes. This has all the classic, terrible tropes in a terribly produced movie 1. Orphan protagonist, check 2. Evil stepmother figure, check 3. Nice fatherly figure, checK 4. Light skin as a beauty standard, check 5. Immediate, socially acceptable excitement and shyness at the prospect of a arranged marriage, check My question is, why does every orphan child in a movie/tv show HAVE to be an angel? Ill mannered, dark sinned girls who don't want to be shipped off to marriage deserve love too! Poonam (orphan protagonist) should have been at least a little bitter. The aunt (evil stepmother figure) ignored her for YEARS, anger and resentment is normal at that point. I don't care if girls should be modest and well behaved, at some point, being so passive is just abnormal! God, I want to change the channel so badly!!!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "Kaatil29",
        "review_rating": "10",
        "review_title": "ONE WORD FOR THIS MOVIE IS \"BEAUTY\" IN IT'S TRUE SENSE",
        "review_detailed_main": "If you are not the person who judge someones tradition or if you love watching family dramas then you should definitely watch this movie. This movie is all about the journey from engagement to marriage. SHAHID KAPOOR AS \"PREM\" & AMRITA RAO AS \"POONAM\" will make you fall in love with them.(10/10)"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "bshanley-61461",
        "review_rating": "6",
        "review_title": "You Deserve a Break Today (from reality)",
        "review_detailed_main": "If you like Indian wedding movies, this is for you. Lots of music and colorful visuals. Soap opera, schmaltzy story will pull at your heartstrings. Pretty people. Rich Indians in Mercedes. Everyone is kind-hearted. Even the \"villain\" has a heart of gold. No cops, no dirt, happy poor people. I don't regret watching."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "ibrahimak-94397",
        "review_rating": "4",
        "review_title": "Boring",
        "review_detailed_main": "Save yourself the pain and give this pointless movie a miss"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "analizabataoey",
        "review_rating": "10",
        "review_title": "Nice..depicts good culture and tradition",
        "review_detailed_main": "Nice..depicts good indian culture and tradition. Good music also"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "shivenrajan",
        "review_rating": "6",
        "review_title": "Nice Indian movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "Pyenoh",
        "review_rating": "4",
        "review_title": "Somebody needs to wake up to reality.",
        "review_detailed_main": "A Cinderella story made for adults who live in dreamland. The romance is very unrealistic, fluttery, lovey dovey, perfect etc. The Cinderella plot till the very end and Shahid Kapoor is the only reason for my stars. If you're looking for a dreamy romance with a twist, this is definitely you're movie, but for the rest of us real world people, I'd highly recommend saving your three hour watch time. Wake up people!\n\nFour out of the five people that saw the film with me would not recommend the film. We had a great time bashing majority of the unrealistic scenes. Maybe I'm missing something.. I just can't believe a movie like this can beat a classic like HDDCS!!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Return of the King:: Sooraj Barjatya",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "RomComFanGirl",
        "review_rating": "7",
        "review_title": "Desi feelz. Love it.",
        "review_detailed_main": "This one is such a tear jerker by the end but it's got this old world romance feel to it that only bollywood can serve."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "surajrv-37555",
        "review_rating": "10",
        "review_title": "Best movie on arranged marriage",
        "review_detailed_main": "I always love Rajshree Productions as they are always family bound and take family movies which have become huge blockbusters. Vivah is one of them. I have seen this movie multiple times on TV , YouTube and recently on Netflix during the current pandemic. I also do not mind watching it again and again as it gives me a family feeling inside me.\n\nThe main protagonists ie Shahid Kapoor and Amrita Rao played the perfect couple on screen starting from strangers till they get married. I have become a great fan of them since their Ishq Vishk days. Now, I shall give the review in detail below:\n\n* The Cast: Amrita Rao has proved that she is the real girl that anyone would have wanted as their life partner. Her spotless beauty, traditional looks and superb acting lit the movie to great heights. She just rocks the screen. Shahid Kapoor played his role so perfectly that he has become the nation's favorite. His handsome looks, zest acting has made all the girls weak. Alok Nath did an awesome job as the uncle cum father figure of Amrita Rao. His expressions, smile, acting proved that he is the real sanskari babuji of India. Amrita Prakash who played Amrita's cousin sister did a good job but could not act naturally (That's a flaw). Seema Biswas who played the aunt did a great job. Anupam Kher was just superb as the kindhearted, successful down-to-earth businessman. Other cast like Sameer Soni, Lata Sabharwal, Dinesh Lamba, Manoj Joshi did a great job too.\n\n* The plot: In no way there was any sub-plot in the movie. Kudos to the director for having concentrated on the main plot. This is how in real life ; arranged marriages work out.\n\n* Music: Ravindra Jain's music was so uplifting that it brought tears in my eyes. Do Anjaane Ajnabee is the perfect song for a marriage prospect and its used even today in real life. Another song \"Mujhe Haq Hai\" was so good. The bhajan \"Radhe Krishn Ki Jyoti\" was so divinely sung by Shreya Ghoshal that I play it everyday. These 3 songs are my favorites. The other songs were also good in their own way too.\n\n* Cinematography: The cinematographer did a brilliant job in capturing wonderful locales like Nainital, Delhi, Uttarakhand.\n\nThere are several heart touching scenes in the movie like the father convincing the son to marry at the right age, the boy-girl meeting, the would-be-in-laws taking the prime responsibility of curing their would-be-daughter-in-law for her burn accident with the help of extra burn specialists , Mohnish Behl (special appearance) telling about abandonment of people during burn cases, Sameer Soni-Lata Sabharwal scenes, the Som Sarovar stay with the future family etc. The scenes between Amrita Rao Rao-Alok Nath, Manoj Joshi-Alok Nath was just touching.\n\nI just loved the movie and would recommend people to watch it. I even have the DVD of the movie too. I also thank Netflix for releasing the movie during these tough times.\n\nWatch \"Vivah\" and find your perfect match."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "Its1917hrs",
        "review_rating": "1",
        "review_title": "The soundtrack...did they rip it from a Hello Kitty cartoon?",
        "review_detailed_main": "O dear, now i never have been put off by soundtrack so much as in this movie. I couldn't finish it for that reason. It's so distracting and so cheap you can't focus on anything else anymore. And there is not one single moment without this cheap computer composed diddies in the background.\n\nFor the story. No cliché has been passed by, they're all in there. Including the sugar sweet caricatures. It's a horrendous insult to the public it's made for. This was actually even worse than \"My name is Khan\" which i considered the most horrible creation from India in the last decade. I'm not even gonna waste any time on writing more on it."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "sourovsarder",
        "review_rating": "10",
        "review_title": "Sweet Movie",
        "review_detailed_main": "I never got tired of watching this movies. I watched this 7 time."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "tahsin2-1",
        "review_rating": "10",
        "review_title": "a brilliant Indian film",
        "review_detailed_main": "All the talent Mr. Sooraj Barjatya showed in his first 3 movies, I thought were all an accident because his 4th one Main prem ki diwani hoon was so bad. But I have to say it wasn't an accident. This guy is talented and the way he has done Vivah is just brilliant. Right from the first scene it affects you. the sequences between shahid and amrita are awesome. The chemistry between these two actors gives glimpses of that between srk and kajol. As usual Alok Nath as the good and loving father is fantastic, so is Anupam Kher. But its a Shahid-Amrita film.Amrita looks good in most scenes though shahid does look a little young to get married but he does a good job of a shy but yet morally strong groom. this movie will especially be liked by those who has gone through such beautiful moments in their life. All in all a brilliant film. hats off to Mr. Sooraj Barjatya..."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "nirkheys",
        "review_rating": "10",
        "review_title": "simple sober and sweet",
        "review_detailed_main": "It is nice to see Suraj Barjatya back at what he is best at.A story woven around a marriage.It feels nice to have a movie in which there is no single scene which you would avoid watching with your family. Though the story is simple and does not contain any new elements,you still like the movie,because of the presentation, performances,and actually the over all treatment. Hats Off to Suraj.. The movie is about the fact that engagement leads to love. The depiction of the changes in the way of thinking,behaving once you get engaged is excellent. Director has definitely given it much thought and actors have done it to perfection.Though the movie is slow,you don't mind it,because you kind of get so much involved with the story that you just wanna continue watching the joy of this newly engaged couple. As a typical RajShree stuff it has many sentimental scenes which are highly likely to make viewer burst into tears(specially ladies). But when you come out of the cinema hall you are very much satisfied and feel that the ticket was worth :-)."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "amitjodha99",
        "review_rating": "10",
        "review_title": "I grew up as this film did, it's purely nostalgic and an epitome of excitement for me",
        "review_detailed_main": "I say the movie in 2006, I saw it again numerous time and every time I see it, the simplicity just gets me. I've matured a lot from a eight year old to a twenty two year one, and every time I see it, I grow on realizing how amazing this movie is, the characters are so genuine and lovable, I just feel that Sooraj barjatya is extremely underrated as a director despite giving 4 classic though similar films.\n\nI would go as far as saying that this was the end of the classic romance movie in Bollywood, and it's quite surprising that this was by far the simplest of them all, it's the last piece of that jigsaw puzzle that reminds us of the beauty and storytelling of legendary movies like DDLJ, HAHK, KKHH, KKKG, KHNH, KNPH, and it did succeeded in it's ambition.\n\nIf only for this movie, Amrita Rao should be considered a great actor despite for everything else she has done, and so does Shahid Kapoor. I relate so many analogies with regard to this movie, but the one constant thing that would always remain is the epicness of this film for me, and I would straightaway suggest this movie to any couple on earth, though I'm yet to see this from that perspective."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "tushargupta-27286",
        "review_rating": "10",
        "review_title": "Family picture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "raymiah1",
        "review_rating": "10",
        "review_title": "Best Movie of 2006",
        "review_detailed_main": "VIVAH in my opinion is the best movie of 2006, coming from a director that has proved successful throughout his career. I am not too keen in romantic movies these days, because i see them as \"old wine in a new bottle\" and so predictable. However, i have watched this movie three times now...and believe me it's an awesome movie.\n\nVIVAH goes back to the traditional route, displaying simple characters into a sensible and realistic story of the journey between engagement and marriage. The movie entertains in all manners as it can be reflected to what we do (or would do) when it comes to marriage. In that sense Sooraj R. Barjatya has done his homework well and has depicted a very realistic story into a well-made highly entertaining movie.\n\nSeveral sequences in this movie catch your interest immediately:\n\n* When Shahid Kapoor comes to see the bride (Amrita Rao) - the way he tries to look at her without making it too obvious in front of his and her family. The song 'Do Anjaane Ajnabi' goes well with the mood of this scene.\n\n* The first conversation between Shahid and Amrita, when he comes to see her - i.e. a shy Shahid not knowing exactly what to talk about but pulling of a decent conversation. Also Amrita's naive nature, limited eye-contact, shy characteristics and answering softly to Shahid's questions.\n\n* The emotional breakdown of Amrita and her uncle (Alok Nath) when she feeds him at Shahid's party in the form of another's daughter-in-law rather than her uncle's beloved niece.\n\nClearly the movie belongs to Amrita Rao all the way. The actress portrays the role of Poonam with such conviction that you cannot imagine anybody else replacing her. She looks beautiful throughout the whole movie, and portrays an innocent and shy traditional girl perfectly.\n\nShahid Kapoor performs brilliantly too. He delivers a promising performance and shows that he is no less than Salman Khan when it comes to acting in a Sooraj R. Barjatya film. In fact Shahid and Amrita make a cute on-screen couple, without a shadow of doubt. Other characters - Alok Nath (Excellent), Anupam Kher (Brilliant), Mohan Joshi (Very good).\n\nOn the whole, VIVAH delivers what it promised, a well made and realistic story of two families. The movie has top-notch performances, excellent story and great music to suit the film, as well as being directed by the fabulous Sooraj R. Barjatya. It's a must see!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "gokulkrishna-pai",
        "review_rating": "8",
        "review_title": "Heart-touching film!",
        "review_detailed_main": "This review is in response to several postings here criticizing the movie. Firstly, I would like to create the right expectation here. This is not for Everybody. This movie will be loved by Indians to whom romance appeals. A typical Sooraj Bharjatya film centered on Family- Arranged marriages. And He very well succeeds in pleasing the audience at the same time giving a message of True Love. With several filmmakers targeting the Teenagers, Sooraj has made a bold attempt in making a Genuine Indian film. Music by Ravindra Jain is a Highlight of the Film. The flow of the movie is great & engaging. First-half of the film is very entertaining. In the later-half, the movie takes a serious turn as expected in old-fashioned Indian films. I would regard this as one of Sooraj's best films & hoping to see more from him. While I thoroughly enjoyed this family-drama, I feel this movie will appeal mainly to the older audience. Hope this Review Helps! :)"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "yalghar",
        "review_rating": "8",
        "review_title": "Great attempt",
        "review_detailed_main": "This movie is a great attempt towards the revival of traditional Indian values which are being replaced by western ones.Its a joint family story showing all the ethics every person should follow while communicating with every single relative around.Shahid Kapoor gives a gr88 performance as a desi about to tie knot with Amrita Rao who is also very Desi and she also acts pretty well...The genre of the movie is the same as HAHK and such movies deserve to be made in India for the revival of old traditional values...The movies doesn't get 10 as it isn't very good at music which counts a lot in every movie,besides this it is flawless...."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "patel-namrata3",
        "review_rating": "8",
        "review_title": "Romantic and traditional movie",
        "review_detailed_main": "A true lovestory people need to have heart to understand this movie a must view.Good show of the gradual building of relationship faithfulness and trust that people lack in relationships nowadays.\n\nThe story of the film is incredibly simple & I feel that the simplest stories make the best love stories, as they revolve around the emotions of the characters. http://www.IMDb.com So, this is definitely not a movie for someone who likes to sit at the edge of their seat when watching a film.\n\nThe performances of the movie are good. Isn't it? Shahid & Amrita do justice to their role.. The support cast is wonderful. The standout performance is Seema Biswas - excellent in her role. Mohnish Behl is great in his bit part. I love the writing in the Shahid-Amrita scenes especially in the second half."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "nikhilkishoremails",
        "review_rating": "10",
        "review_title": "Perfect World no reality but beautiful soul!",
        "review_detailed_main": "This is not real at all but sometimes mind just wants to forget the cruel world and go on a smooth ride, this is that smooth ride. Acting wise, Amrita Rao shines as Poonam and Shahid is okay. This teaches good values and has a beautiful music. Full family movie and a treat to watch."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "kvdobariya",
        "review_rating": "10",
        "review_title": "Perfect movie for Family........",
        "review_detailed_main": "Again awesome movie made by Sooraj sir!!!! Why don't other can't make this family movie!!!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "pratikdeshpande-65748",
        "review_rating": "10",
        "review_title": "Every family should watch this film",
        "review_detailed_main": "Classic movie, perfect definition of arrange marriage, I guess it teaches us some values and ups the moral of Indian typical society who does not have any vision about what marriage is and how it should be."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "nishujikalal",
        "review_rating": "9",
        "review_title": "Pure tasteful romance and love",
        "review_detailed_main": "This movie doesn't have any unnecessary or inappropriate scenes. Though the movie is really cringe worthy and veeeery sweet, it worth a watch if you want to feel some old romance."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "harsh-61475",
        "review_rating": "10",
        "review_title": "change arrange marriage mentality....",
        "review_detailed_main": "This is such a great movie that will probably be not seen back in Bollywood .. !!! Which has changed the language of Orange Marriage. Congratulations to all the actors especially Amrita Rao.."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "kaharswastik",
        "review_rating": "10",
        "review_title": "Be like Pream, not like Kabir Singh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "rk-37298",
        "review_rating": "10",
        "review_title": "Must watch it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "roniali",
        "review_rating": "10",
        "review_title": "Just one word",
        "review_detailed_main": "Wonderful wonderful wonderful. A must watch for this generation."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "purohitjitend",
        "review_rating": "10",
        "review_title": "Good Film",
        "review_detailed_main": "Emotional and well scripted film. You don't get bored while watching this film with your family. I think I've watched it more than 10 times."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "shirfanmca",
        "review_rating": "10",
        "review_title": "Unforgettable Movie",
        "review_detailed_main": "It is ultimate and extreme of emotions. Wonderful, fabulous, fantastic, extraordinary and what not. Please watch atleast once."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "sghnmbjb",
        "review_rating": "10",
        "review_title": "VIVAH - A beautiful movie made by a beautiful director",
        "review_detailed_main": "VIVAH is in my book THE BEST MOVIE OF 2006 ! PERIOD !!. In my book it is one of the best 100 movies EVER MADE IN Bollywood. Its sad that this movie doesn't have that many reviews and isn't having that much popularity.\n\nVIVAH is once again a true achievement from a director who DOES it again. After HAHK and Maine Pyar Kiya Sooraj has once again pulled off a brilliant one VIVAH.\n\nThis is the most simple and cute movies that I've seen this year. After seeing Don 2 which was CRAP and later Dhoom 2 which even beat Don in that matter, I finally see a movie which is so close to my heart and my culture.\n\nI don't know why Bollywood is moving away from the beautiful culture which we have and are making Hollywood remake style crap movies like Dhoom 2 and don.\n\nThe story is beautiful and relates much to the Indian system of Arranged marriage which I too would like to be a part of. Our system which teaches us to obey elders, follow them and of course obey their thoughts is so brilliantly shown in this movie!. Of course there isn't any force in choosing your life partner and it should be a brief meeting between the couple and its up to them to decide as it is brilliantly shown in this movie.\n\nComing back to the movie.....VIVAH is a story of Journey between the beautiful period of Engagement and marriage. The phase where the guy meets the girl !....Both understand each other ..Both try to assess if they could love each other for Seven generations (as our system says) and the various which occur during marriages.\n\nAmrita Rao is brilliant in the movie.......Shahid is OK.....and Alok Nath and Anupam Kher are awesome !! The songs are BRILLIANT. ! I especially like the HAMARI SHAADI MAIN HAFTE REH GYE CHAAR and Do Anjaane Ajnabi ......\n\nOverall A MUST SEE for anyone who still believes in the Indian culture and tradition and I certainly do !.\n\nGo see this movie......I just have to say one word.......\n\nBLISS !."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "mr_mvp",
        "review_rating": "8",
        "review_title": "So far very under-rated.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "punzelle",
        "review_rating": "10",
        "review_title": "Possibly the best Hindi romantic movie ever made!",
        "review_detailed_main": "One would have to be very jaded indeed not to be swept up into this gem of a film (and I've seen hundreds of Hindi and Bollywood movies, too). The actors, the beautiful settings, locations, and surroundings, the deep emotions portrayed, the sweet songs (especially the singing voice of Udit Narayan, my favorite) -- everything was just lovely. The human (imperfect) element was also woven in, to create some drama and drive the plot, as well as allowing a heartfelt resolution. Alok Nath is such a terrific actor, so open with the emotions of the characters he portrays, he almost steals the show from the young stars. I highly recommend this film to anyone who loves true romances -- ones that go beyond superficial beauty to real love -- as one of the best films out there, Hindi or otherwise!"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "meena-hansraj",
        "review_rating": "10",
        "review_title": "This movie is the best in order to state today's major problem \"dowry\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "hasanmahmd",
        "review_rating": "10",
        "review_title": "A very well made traditional movie",
        "review_detailed_main": "Once in a while, you come upon a movie that defines your values and shows you the true depth of human emotions leaving you drained. Vivah is just that \u0096 maybe more. After watching DDLJ, Saajan, and Lamhey, I really thought that Bollywood has reached its pinnacle and will never come up with anything like that - EVER. Boy was I wrong! I went to the store to buy some groceries and decided to pick this movie up along with the new \"DON\" (just so I can compare The Great AB with ShahRukh \u0096 although the decision is already made in my mind). After debating whether I should waste almost 3 hours on a meaningless movie I decided to watch it realizing I had nothing else to do. When I saw the rating of U instead of an A, I was happy that at least it is something where I don't have to watch scantily clad women with bad acting skills doing nothing but dancing on every opportunity they get and making out with every guy to show that they have more skills in bed than a Hollywood B actress. For the first 5 minutes or so I thought I would again be subjected to meaningless story with bad acting. After all everyone who has seen Shahid Kapor know that he as never gained his fame as an accomplished actor. Boy \u0096 was I wrong about this movie. This movie grabbed my interest after the first 5 minutes and would never let it go. It was a great movie with a good storyline about the vanishing traditions of our society. I liked not only that the director was brave enough to make a movie where younger generation might not relate to the concept (of arranged marriage), but also that he did it with a conviction (that it is the right thing to do). I have no idea why some people think that the acting was not good. I felt that the acting was great and even though the music score might not be considered the best ever, it was still very very good. The good thing is this music will grow on people with time like it did with me after the I watched that movie a second time. The other good thing is that thee songs are not pushed into the script as we have all seen in so many movies. These songs actually tell a big part of the story and are certainly a welcome addition. Just like Ajay Devgan went from being a joke to a great actor (after Company), and Salman found his groove after \"Hum Aapkey Hain Kaun\"; this movie will help Shahid Kappor jump to being of the better actors and entertainers in Bollywood. This is the first movie of his in which I like him and his role. He acted well and adjusted to being the nice good looking young rich kid. Yes you will not find him playing basketball and scoring every point on a dunk like you saw ShahRukh in DDLJ (even though he is shown to be an Indian in England \u0096 both countries not big on Basketball by the way), he does come across as very believable as a person who holds true to his values. Amrita Rao, for the first time came across as someone to be remembered. In all her other movies she was competing with big faces which was actually hindering her. No one knew how good of an actress she really is until they watch this movie. Some of the scenes in which she has to cry especially towards the end really shows her knowledge and depth of acting. Although she has been in another movies she is most memorable in this one. I think this movie will and should do wonders for her. Move over Rani \u0096 there is finally another girl who if given a decent chance to work with good directors can grab the torch from you. She is beautiful with a great voice and has a face that exudes complete innocence. Oh having almost 0% body fat does not hurt either (yes people I will challenge you find even 0.1% fat on her and unlike so many others like Sonali she can actually act too). I thought I will never be enamored by anyone's beauty after Madhuri and early Kajol, but she completely changed that. Shahid and Amrita worked very well together and their relationship fitted their characters and they both did an excellent job (although I was waiting for Shahid to turn into a girl like Salman did every time he uttered \"Hum aapkey Hain Kaun\"). When I finished watching this movie, it left me so emotionally drained that I decided to watch this movie again (right away). Yes right away. I have never ever done that. Not even with DDLJ, but this movie just had something that had to be understood again and again. I will probably watch this movie a third time over the weekend just so I can watch and relive the traditions we all grew up with. I miss those times where families sat down and had fun. When parents had time for their kids and where kids respected what their parents believed in. I know a lot of people think that movie does not portray real life but deep down don't we all want it to happen. The families, thee tradition, the love and respect. This is what this movie will remind all of us of. I can assure you it is an extremely well made movie which you will enjoy. I am sure some young people will not like this movie but if you are over 28 I doubt that you will be one of them."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "sharminerani",
        "review_rating": "9",
        "review_title": "Film Review of Vivah",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "paribadar",
        "review_rating": "10",
        "review_title": "An other Soraj's great work",
        "review_detailed_main": "What can i say, i have grown up watching Hum Saath Saath Hain, Hum Aapke Hain Koun and Maine Pyar Kiya. Soraj have always been different. Movies are part of our lives in evolutionary times Soraj creates something thats hard to find. Love and joint family that loving and great. Vivah is journey for a couple that are getting arrange marriage that turns on arrange and love marriage. Shahid has done fine work. Anupamji as always brilliant. Amrita Rao quit different even though I felt that someway the other to me she doesn't suit in that role. We've seen her in Ishk Vishk and Ab ke baras, and Main ho on Na. So quit different role that she isn't in to. She is been excellent in Main ho on Na and ishk vishk but may be she could've put little more in the role. Anyways great going work by Barjatya. This movie rejuvenates the values that we forgot. Sweet film of the year. Great music and lyrics. I am not sure if its a remake but anyways brilliant story that is original. Soraj's movies have been brilliant all the way so we always expect something different from him. Great work by all the cast the crew and everybody. Lovely family film to enjoy with your parents, siblings, friends and love ones. I give it 10 out of 10."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "nairarunv",
        "review_rating": "10",
        "review_title": "Absolute, Fantastic and Core Movie",
        "review_detailed_main": "Thanks to Sooraj for making us realize that we are people of traditions. Excellent movie made with perfect videography and directorship. the music is just excellent no comments. A true love story people need to have heart to understand this movie a must view. Good show of the gradual building of relationship faithfulness and trust that people lack in relationships nowadays.\n\nKeep it up Sooraj. I hope that you win the film fare but my first preference would be babul sorry about that.\n\nWaiting for more good movies from you.\n\nRegards"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "mehul_p13",
        "review_rating": "8",
        "review_title": "Mix of hakhk, mpk, hssh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "Bunty-at-IMDB",
        "review_rating": "8",
        "review_title": "Excellent... Good Acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "BiswajitSince2005",
        "review_rating": "10",
        "review_title": "It is about marriage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "munky_hashmi05",
        "review_rating": "9",
        "review_title": "Amazing movie on the journey from engagement to marriage",
        "review_detailed_main": "i thought this movie was really really great because, in India cinemas nowadays, all you see is skin, music, and bad acting...in this movie, you can see some tradition, ethnicity, and at least some decency...although some parts were a little dramatic, guess what? that is what Indian cinema is all about! after watching this movie, at least you don't get a headache from all the loud overrated music, or any violence, its just the truth, it teaches about love, and of course caring for the person you love throughout life...i think it was an amazing movie...Kids can watch it without a doubt, and adults will enjoy the simplicity that used to be India's sure profoundness...until all these rap hits, miniskirts, and skin showing became a part of it."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "neha_15600",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "Common guys you gotta be kidding me and many others like that,,, Vivah is for a specific segment who love emotions, music and romance,, now if you are not one of them does not mean Movie is bad,, this is a free world and you have all the right to say if you don like the movie but no one gives you right to say its worst or so,,, also there are complete action movies which people just don even like seeing(i don wanna name any) but that does not mean those are bad movies,,, Also most people who liked the Vivah movie are Indians who does not spend much of their time on net and specially not on review sites so u guys can fight over it,,, But it does not matter,, this movie reflects an very normal Indian family drama,, :):):)"
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "soubhagya-senapati",
        "review_rating": "10",
        "review_title": "Just Wow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "hibashamsher",
        "review_rating": "10",
        "review_title": "The Best Family Drama/Movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "abinashdipun",
        "review_rating": "10",
        "review_title": "Tresure full of emotions",
        "review_detailed_main": "When this movie was released I am just 1 year old . I watched this movie in 2023 it's been 17 years of this movie but still it's the no.1 clean romantic family movie. As a movie enthusiastic person I didn't understand that how I missed it for so many years. This movie is full of emotions. It shows you how to love your family or a person unconditionally. This movie will make Lough as well as cry . It will teach you the value of family and a correct person in your life. Even not having any intimate or bold scene It's romance is better than all the movies . The actors of this movie are really deeped in characters that know one cannot say that they are acting. Amrita Rao and Saheed Kapoor really did fabulous job . The song are excellent and matching the scene very much .For all these reason bollywood was BOLLYWOOD at that time."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "sahimeincorrect",
        "review_rating": "10",
        "review_title": "Best movie to spread love and bring happiness and understanding among peoples.",
        "review_detailed_main": "A must watch movie first. It teaches a strong message among Indian families. We should trust,love and most important understanding for each other. It message us to there for each other if anything bad happens. Live happily and be supportive in any situation. It spreads a strong message so please watch this movie. Maintain a positive thoughts towards anybody. While watching I felt everyone to be like these lovely characteres.\n\nI love this movie very much. We will grow understanding just believe one another and reach happiness. Be kind,loving,supportive,understanding,positive,good and all other qualities that make the world like heaven because this is what This movie is teaching us. LOVE IS EVERYTHING."
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "kumardevsvarshney",
        "review_rating": "9",
        "review_title": "Superb movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "rnashish",
        "review_rating": "10",
        "review_title": "Emotional",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0494290",
        "movie_name": "Vivah",
        "movie_rating": "6.7",
        "review_username": "thorodinson-50130",
        "review_rating": "",
        "review_title": "Vivah Milan Posting",
        "review_detailed_main": ""
    }
]