[
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sawhney_g",
        "review_rating": "9",
        "review_title": "Tigmanshu Dhulia and Irrfan Khan do it again",
        "review_detailed_main": "The pair has given us the unforgettable \"Haasil\" and they are back again with \"Paan Singh Tomar\".\n\nThe movie has an excellent script, very well supported by the actors and their performances. Irrfan khan does an incredibly good job with the character. Mahie Gill has done equally well and she is really growing as an actor.\n\nThe script and its originality is the strongest point of the movie. The direction of the movie is also flawless... Tigmanshu Dhulia must be praised for picking up this script and turning into an excellent movie.\n\nMust Watch"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "tintinherge",
        "review_rating": "8",
        "review_title": "Excellent watch - Irfan gives a stellar performance",
        "review_detailed_main": "Watched it in the London Film Festival yesterday. Its a star of a movie. Great tight script, super acting, and great direction. All the actors have done a great job but Irfan is just magnificent- he is turning up as the next Nasruddin Shah\n\nEveryone in the cinema seemed to enjoy the movie and the director got a nice applause in the end.\n\nMy worry is that this movie might not get a wide release, specially abroad - I hope UTV does it best to publicise and release it as much as it can.\n\nWell recommended !!!!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "utsavmamoria",
        "review_rating": "9",
        "review_title": "Why you should watch Paan Singh Tomar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "singhbimal-14",
        "review_rating": "10",
        "review_title": "Great Movie, A Must Watch For Everyone....",
        "review_detailed_main": "This is my first time, so please forgive me in case of any mistake...\n\nJust watched this movie with my friends. If SRK & Salman could do 10% of Irrfan's acting,I would not mind calling them superstars. Hats off to Irrfan Khan and the movie.....10/10 !! What a great performance delivered by Irrfan khan. After watching a number of dumb movies released recently, Paan Singh Tomar is like a boon for every Indian movie fan. The director Tigmanshu Dhulia is successfully able to tell the biopic how a former national champion athlete is turned into a Dacoit in a cricket obsessed country. A must watch for everyone.....Highly recommended !!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sain-vivek",
        "review_rating": "10",
        "review_title": "A real gem in an era of mediocrity",
        "review_detailed_main": "In an era where box office success more often means 'No script and mediocrity' in Bollywood, once a while comes a gem like 'Pan Singh Tomar'. Irrfan comes into his own, well immersed into his character...he takes the audience on a trip which brings out a range of emotions from patriotism, guru bhakti, helplessness and finally revenge. Though the language is thick Chamabl dialect but Irrfan bridges that gap with a masterful display forcing you to laugh, cry and feel his pain.\n\nTigmanshu Dhulia is among the rare breed of bollywood directors along with Anurag Kashyap who have the knack of picking up great scripts and turning them out into movies which have the right mix of real acting and appeal to please both the masses and multiplex audience. The movie is a must watch...go out and enjoy the wonderful experience of watching the haunting Irrfan in action...bow your heads to the person who has grown from Salaam Bombay to Haasil to Maqbool."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "Fella_shibby",
        "review_rating": "10",
        "review_title": "A tale of human condition. One of the best biopic from Bollywood. Irrfan was awesome.",
        "review_detailed_main": "I saw this in a theatre. The acting in this film is the shinning point. Especially the main actor Irfaan khan made a great impression on my mind by his excellent acting skill. Irfaan excellently potrayed the emotion of a \"runner\" who is suffering from pain, frustration and exhaustion, but he is not giving up. The rest is the portrayal of a man who has never had it easy in his life but nonetheless keeps his heart. The screenplay is brilliant. Being a biopic of an army guy/athlete who turned into a dacoit won't b a happy/fun movie. It's a very sad movie. But Irfann did manage to evoke some light moments by his sheer one liners n acting. Imagine an athlete who's very good in running has to run away from police. The direction was good n the cinematography was good capturing the harsh, dry, rural difficult terrain."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "jaideepsinghmann",
        "review_rating": "8",
        "review_title": "An unadulterated effort = Contemporary Masterpiece = Paan Singh Tomar",
        "review_detailed_main": "Paan Singh Tomar, national steeplechase champion, nephew of a Dacoit or \"Baaghi\" as Paan prefers to call it, an army soldier wants to be in army sports because they don't have restriction on eating food. The interesting plot builds on it and takes you to a whirlwind journey of his life, which tickles you, inspires you, and ultimately asks you some very uncomfortable questions.\n\nTigmanshu Dhulia paints the canvas with natural but vivid emotions, he has surely pulled it off. All characters have color of their own, but Irrfan, has just delivered a performance which will make him stand in league of extraordinary men. He is convincing as middle aged dacoit, and it is pleasant surprise that he looks as convincing as young army soldier running on track in shorts, which his wife thinks he shouldn't wear as women stare at them.\n\nMahie Gill has restricted territory but like in all her previous films, she has supported the scenes well. All other characters have just beautifully fallen in place. Director has not compromised with authenticity and has retained the language as spoken in the area where movie is set, don't worry English subtitles are there to help you out if you miss some of the dialogs.\n\nThe romance between husband and wife has been handled with gentleness, with sequences such as the couple sends their children to buy \"lemon-choos\" so that they get some time alone. The movie could have been crispier and shorter n second half when plot moves to Chambal as Paan plans to exact his revenge. Director has sensibly not inserted any songs in the movie as they are not required at all, compliments to the team for this common sense. The background score, especially during races compliments the beautiful cinematography.\n\nOverall the movie is a treat to eyes and ears. A must watch ! Compliments to Tigmanshu as he just builds on the skill and craftsmanship he displayed in Haasil and Sahib Biwi aur Gulam. Dhulia leaves you with credits to forgotten heroes of sports who died penniless and without any recognition."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "lakshiyat",
        "review_rating": "9",
        "review_title": "Along comes Irrfan!!",
        "review_detailed_main": "A die-hard patriot and an international level athlete who is forced to become a dacoit or should I say 'Baaghi'. Commendable performances by almost the entire cast right from Irrfan Khan to the nervous journalist (Bijendra Kala). Mahie Gill matches steps with Irrfan in a fiery and yet restrained performance. I hand my hat to Tigmanshu Dhulia for crisp dialogues, subtle humor and bringing out the Chambal live to you. You can actually feel the grime and dust of the infamous land. Needless to say Irrfan Khan has delivered superlative performance. He has defined what is called as an 'Effortless Performance'. I hope that this movie brings him the most deserved laurels as he brought the same to the movie. 'Irrfan Khan is Pan Singh Tomar'. Period."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "A great film by Tigmanshu Dhulia about an issue which needed to be told",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sherlee",
        "review_rating": "10",
        "review_title": "One of the Gems from Bollywood",
        "review_detailed_main": "I watch Indian movies very selectively,after reading its review, I found it an extraordinary movie,no doubt it is one of the gems from Indian Cinema, no songs no dance ,an extraordinary story with superb acting by Irfann Khan, he is a true khan.\n\nThe simplicity shown by director in this movie is worth to be watched,Whosays that the big budgeted with so called super stars movies can be hit, but I think Irfan is a real super star.I must say here that the reviews written by Taran Adarsh must be avoided now that he gave only 3 stars to this movie.I recommend it for everyone who wants to have great time in watching movie,I bet, this movie will not disappoint you,I think it would be nominated for Oscars 2013.I am giving it 10/10."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "pcsarkar",
        "review_rating": "7",
        "review_title": "A piece of history",
        "review_detailed_main": "A stunner.. An Indian Rambo, far far away from the horse-borne dacoits and cheesy dialogs of similar films. Reportedly based on the life and times of an Indian army subedar, the film is a piece of history. That an army man finds civilian life difficult is well known. But this man took up arms because of the failure of the civilian administration to address his problems, as well as the army's failure to intervene, or at least coordinate with the administration, so that an illustrious ex-army man like Paan Singh had to undergo the travails that he did.\n\nThis film is a lesson on how to make films, which are entertaining, and not over-the-top. It is also a history lesson, for those in power, who see this sort of tragedy occurring in the lives of common people, but do nothing, till trouble comes knocking at their own doors.\n\nHats off to the team of PAAN SINGH TOMAR - the film. May their tribe increase."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "dineshd-308-253073",
        "review_rating": "9",
        "review_title": "True, magnificent & humorously touching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "MuviFan73",
        "review_rating": "7",
        "review_title": "Sends a message of respecting national pride.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "avaclub",
        "review_rating": "10",
        "review_title": "Paan Singh Tomar ∞ The Most Important Movie on Indian Sports ∞",
        "review_detailed_main": "Somewhere in the sandy and hilly terrains of the Chambal where a normal human being never wished to visit even in the nightmare there lies a Man - an athlete – a sports person from soul- And a Dacoit now whose winning run for the great nation called India went unnoticed due to crippled ,undemocratic, corrupt political and administration system and forced him to taken his own route for justice- A path which make which more noticed and more popular amongst the country's newspaper, radio and Parliament than winning his gold medals Indian National Games seven times in a row.\n\nThe Movie opens up with a journalist who wants to interview the most terrible dacoit of the region Paan Singh Tomar and as the interview moves the story went into flashback. Paan Singh Tomar (Irrfan Khan) works in Army but his dietary supplement requirements moved him to the sport division of the army because there is no limit on diet in sports. Thou luckily his race talent got noticed by his senior to whom he delivered the ice cream at his home in just four minutes Unmelt. Soon he become National Champion in \"Indian National Games\" and later in \"International Military Games\" in 1967.But gradually his personal life takes over his Professional life, and the incidents after him changed the course of his life which tuned him from an athlete to a dacoit\n\nThe movie touches some serious issues of the Indian sports and Indian sports persons. In a scene where Pan Singh participated in Asian Games at Tokyo , the organizer gave him new spike shoes which become the cause of his defeat because the athlete never practiced with those shoes earlier and sponsors want to show that India can afford spike shoes shows the level of training in the country even applicable today .In a second scene where the coach requested Pan singh to withdrew his name from 5000 mts race else coach's kin would have been lost that race shows again that the super sportsman you know may not be the best because the best was never given the chance. In a third scene where a villager was given bribe in terms of recruiting the villager's son in the Indian army again shows that all in the Indian military may not have joined the army to serve the nation but to serve their selfish motives. Fourth and very important the scene where the Paan Singh Tomar went to police station to file a FIR against his relatives who has grabbed his land unlawfully and beaten up his son helpless and was insulted and rejected shows the system's efficiency to tackle an issue which turns a common man into a rebel – A Dacoit\n\nPaan Singh Tomar also helps to think deepens into the political arena and government arrangements for the promotion of SPORTS not cricket because cricket is so over-hyped and overpaid that sponsors in the previous past has marketed it as a religion and few players as Demi- GODs that the other sports in India per say are lying on the stretcher waiting for the medicines of hope and support from the sponsors and government.\n\nPaan Singh Tomar may not celebrate the spirit of win like 'Chak de India' or \"Jo jeeta wohi sikandar\" But it does celebrates the spirit the True Sportsmanship and it does it perfectly & flawlessly-Kuods"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "uttiyo-sarkar56",
        "review_rating": "8",
        "review_title": "One Of The Better Movies Of Bollywood.",
        "review_detailed_main": "Boosted By An Excellent Performance by Irfan Khan and the rest of the cast, and a meaningful and good story, Pan Singh Tomar is one of the better bollywood movies which has great performances from the cast, a great story which is worth telling, and Irfan Khan just makes it better with his excellent portrayel of his character.\n\nThe Story is about a Daku(Dacoit)(Irfan) who was actually a soldier who fought for his country and could give it all for his country who then became a runner and wins gold medal at the Indian national games, but is forced to become a Dacoit after being neglected and insulted by the Police,and his mission is to rebel and defy the police department.\n\nIrfan Khan is one of the few Hollywood worthy actors in bollywood, and probably the best at what he does, he yet again shows his excellent acting qualities in this movie by giving an excellent performance as Paan Singh Tomar, and he has shown the change of his character from a strict soldier to a notorious dacoit with utmost skill. The Rest of the cast also does a very good job in making this into a very well acted movie.\n\nThe Director does a decent job in making this film into one of the sensible movies made in bollywood, and good job from him for giving Irfan a perfect role in the movie. The Story which is based on a true story about the same man, is great and shows how many extremely talented athletes in India are neglected by the government and how they can become notorious at times.\n\nOverall this movie is great due to mainly an excellent performance by Irfan Khan and a great story, to make this into one of the better movies of 2012 till now.\n\nMy Rating: 7.8/10"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "rishiinpune",
        "review_rating": "10",
        "review_title": "Paan Singh Tomar: An Indian national athlete who became a rebel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "aafreen-karim",
        "review_rating": "8",
        "review_title": "National Athlete turns Chamba Valley Dacoit when all govt machinery fails to protect him",
        "review_detailed_main": "Paan Singh Tomar: Irfan Khan is one the greatest actors that we have in India. N...o Doubt. He takes the script to superlative levels. The dialogues are amusing and situations really funny and not crass. His transformation from a national level athlete to a dacoit in the Chambal Valley makes for a rare story. How many such stories have we heard of. Having gone through what Paan goes through its really easy to understand and empathise with the character Paan especially since he picks up arms when all else fails. He approaches all the govt machinery disposable to him..the army , collector and the no good bribe taking , dishonest, lazy unscrupulous Indian police who instead of protecting the citizens instead loots and harasses them and don't we all know that. One wants to run in the opposite direction when one has to deal with police in India and that's the truth none can deny. Paan knows that the unlawful path will lead to his death but to live under such suppression was just not acceptable to him anymore. In my mind Had it been me, i would have taken that coaching job that being an Olympian offered along with cushy discounts at army canteen and a peaceful retirement life on army pension with family.But in my mind I also want to shoot these stupid police guys who tell me not to take the route to my own home at the Aarey Colony. Thank God then that i have movies to pent out my emotions through Pan Singh Tomar."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "ssvikas",
        "review_rating": "8",
        "review_title": "Irrfan Khan's efforts pay off as he delivers a gripping performance!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bollywoodplusplus",
        "review_rating": "9",
        "review_title": "I have renewed my respect for Irrfan Khan",
        "review_detailed_main": "Irrfan Khan to post-Y2K audience is like Naseeruddin Shah and Om Puri of pre-Y2K cinema rolled into one. Though that might be a exaggeration given the small body of work he has done, but films like Namesake, and Paan Singh Tomar puts him in the list of such elites. He gets into the role. He looks the character he is performing. One hell of a power-packed performance by Irrfan. He carries the entire film on his shoulder. The direction, the characters and characterization, background music, almost everything in this movie is top-notch. To make it even classier, I thought the camera work could have even been classier. Regardless, its a must watch movie for any serious movie lover."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "Bioscopic_Wonders",
        "review_rating": "",
        "review_title": "A gritty tale in the life of another forgotten athlete but famous rebel...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "darshancruz",
        "review_rating": "7",
        "review_title": "PAAN SINGH TOMAR : Soldier -> Athelete -> Dacoit... This one's worth it..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "vishaal811",
        "review_rating": "9",
        "review_title": "A Splendid Movie! Irrfan Khan is Phenomenal!!",
        "review_detailed_main": "A Biopic is not the most interesting genre of film. However, Bollywood has made two memorable biopics in the past few years. Paan Singh Tomar is based on the life of a national steeplechase champion who did not get the recognition that he deserved and eventually became a dacoit in order to have his name printed in newspapers.\n\nBhaag Milkha Bhaag, which was based on the life of Milkha Singh, has borrowed some elements from this magnificent movie which has managed to restore my faith in this genre.\n\nPaan Singh Tomar is played by Irrfan Khan who gives a career-best performance which is quite impressive considering the number of notable movies he has made. He plays the character in a nuanced manner that incorporates the unique dialect from his native place in Madhya Pradesh. The dedication to his role is palpable as he transforms himself, both physically and mentally, to play someone who has a lot of anger inside him due to the apathy of the Army and the Indian Media for not giving him his due recognition.\n\nPaan Singh Tomar epitomizes the struggle of athletes in India to gain recognition despite endless hard work and complete apathy from the government. There are a lot of changes that must be implemented to ensure that these athletes get proper training and diet to give their best performance.\n\nThis movie is one of the finest to have come out from Bollywood. The producers must be given credit to back such a film in which the protagonist was largely unknown to the masses. The film accurately depicts the lifestyle in villages and the authenticity is further escalated by the unique dialect that all the characters use. Watch Irrfan Khan give one of the most memorable performance by an Indian actor."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "Johnrathee",
        "review_rating": "7",
        "review_title": "A biopic of Paan Singh Tomar an Indian Athlete who turned Dacoit.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "prashantgupta2002",
        "review_rating": "9",
        "review_title": "Fantastic Movie",
        "review_detailed_main": "Absolute Fantastic. Movie run around army athletic turned BAGI Paan Singh Tomar. Story is great and direction is much great. Very catching direction and story. There is no slot in movie when you get bored.\n\nIrfan Khan is superb. He has done really great. There is a real social issue also. This is truth of rural India which politician are ignoring. When Paan Singh won national medal no body cares but when he kidnap some leader then everybody talks about him. This is still true in India. Tigmanshu Dhulia has done his best and he must be credited with full marks. Irfan Khan and Mahi Gil support him well. in short it is worth to watch the movie."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "saish746",
        "review_rating": "8",
        "review_title": "best of recent times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "janianmol",
        "review_rating": "10",
        "review_title": "Sports person turns outrageous rebel, kicks ass on box office!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "morrison-dylan-fan",
        "review_rating": "9",
        "review_title": "Ice Cream.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "namashi_1",
        "review_rating": "9",
        "review_title": "A Great Effort!",
        "review_detailed_main": "A biopic of Paan Singh Tomar, an Indian Athlete who turned Dacoit, 'Paan Singh Tomar' is A Great Effort! Talented Filmmaker Tigmanshu Dhulia makes a biopic, that turns out to be a dazzling experience! Its a Well-Made Film in all respects.\n\n'Paan Singh Tomar' works because the journey of the late Athlete/Dacoit keeps you engrossed & captivated. Here's a biopic, that mixes reality with entertainment. Though a heavy subject, 'Paan Singh Tomar' offers humor, action & most of all, a strong moral! Tigmanshu Dhulia & Sanjay Chauhan's Screenplay mixes reality & entertainment, most efficiently. Tigmanshu Dhulia's Direction is flawless. Cinematography & Editing, are excellent.\n\nPerformance-Wise: Irrfan shines as 'Paan Singh Tomar'. The versatile actor proves his mettle once again by delivering a performance, that deserves a National-Award. Without a doubt, this is his finest performance to date. Mahi Gill plays her part well. Vipin Sharma, Rajendra Gupta, Imran Hasnee, Nawazuddin Siddiqui & Zakir Hussain are decent. Brijendra Kala is astonishing in a brief, yet important role.\n\nOn the whole, 'Paan Singh Tomar' is A Big Winner! Strongly Recommended!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "silvan-desouza",
        "review_rating": "8",
        "review_title": "Awesome film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "fraisedesbois",
        "review_rating": "7",
        "review_title": "I won't recommend it to my friends",
        "review_detailed_main": "What I like: The main character loves running, and I love it, it taste like Forrest Gump. From running, the character moves to be a rebel, and it gives an unexpected direction to the movie, from sport to crime/action. The main actor is good.\n\nWhat I don't like: The movie is long, many scenes could have been shorter. The exciting scenes get lost in the mass. After watching this, I didn't feel good or excited or sad. The main character's life seems to be a nonsense, a wastage.\n\nOverall: It's nice they produced a movie about this historical drama in India. It gives an idea about how things were going on back then. But it ends flat and I was expecting more thrills from all this twisted story."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "manendra-lodhi",
        "review_rating": "8",
        "review_title": "Finally something worthy of watching.",
        "review_detailed_main": "It is a great delight to see films like these now and then. The compelling factor that can make anyone watch the film is Irrfan Khan. Other than that the story is also worth watching once. What I felt in the starting was that the events were rushed. For around half an hour in the starting it seemed as if I was watching things with the feel of a documentary. However the film picked up pace and was on right track after the half time. Rarely are films made on subjects like these in India. The acting by the supporting cast was unimpressive. However Irrfan can steal any show. The regional language used in the film all the time makes the film much more compelling. Many a times I suffered with the syndrome of – \"It should have been this way.\" But overall the film is a must watch for Indian audience.\n\n\"A definite one time watch for everyone.\""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sachinatnavodaya",
        "review_rating": "7",
        "review_title": "The film is actually the autobiography of an athlete/soldier who turned to a rebel due to the circumstances.",
        "review_detailed_main": "I loved the film,as it was really meant to give tribute to the unsung heroes of Indian sports history.Moreover Irfan Khan could portray the role of Paan Singh with his acting talent,which brought an overall originality to the character.Along with that the cinematographer is appreciated for snapping the scenes with a real artistic view.\n\nOn one hand the film is truly recommended for the action loving movie fans. On the other hand,the film continued the trend of narration of the past with the help of a co-star(in this case the newspaper reporter),like Irfan Khan's hit movies like Life Of Pie.Also i couldn't get the reason ,why the film was awarded national award in the category of best film.\n\nOverall I suggest it as above average."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "mrsidhu",
        "review_rating": "10",
        "review_title": "Sheer Brilliance - An Epic Film",
        "review_detailed_main": "This is one the rare films in Bollywood today that dare to show the real picture of corrupt political and judicial system in India. The common man has no choice but to take arms just to save his dignity. Period. The director has done full justice to this biopic which brings us to an important question that Are we really safe? The corrupt officials in police and judicial system always abuse the system and the innocent have to pay the price and eventually justice is denied to the victims and they are the one who are made to appear guilty.\n\nMust watch for every Indian. One of the rare cinematic gems to come out in past few year. Irrfan as usual steals the show with his stellar and effortless performance and pleasure to watch on screen. The ease with which he performs his role is what makes it hard to take our eyes away from him. Everyone has done great acting and audience is emotionally attached to the protagonist and other characters as all of them are depicted with epic reality.\n\nThis is my first review. So, i am sorry if there are any mistakes. Must watch for everyone. Dreadful plight of country with such potential. This movie makes us question are thoughts and for just that you should watch it and it won't disappoint you."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "charanmkumar",
        "review_rating": "8",
        "review_title": "Paan Singh Tomar is truly a inspiration movie, though it show how a good man can be made so violent and aggressive by the change and greed society has to offer",
        "review_detailed_main": "A movie based on a true story and dedicated to the athletes who have dedicated their life to the country and does not get the respect they deserve and are ill-treated.\n\nA very well made movie, with some good emotions and heart touching lines. The language (Hindi) is more authentic so makes it difficult to understand but that is the best part of the movie, the intensity Paan Singh Tomar (Ifran Khan) displays in the movie is a class of an act, no one could have done it better than him. He keeps the movie ticking all the way long till the last second in the movie. This movie has no drama and masala like other bollywood movies, just pure and clean story, directed to perfection. Every second in the movie you are eager to know what happens at climax .. but as its a true based movie the climax cant be a good drama flick. Still a nice ending to it is given. A movie that caters to all age and class of people\n\nMy say - A movie which must be watched"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "alok10503",
        "review_rating": "8",
        "review_title": "Must watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "vkspathak",
        "review_rating": "9",
        "review_title": "A Non Confirmist Bollywood movie after a decade",
        "review_detailed_main": "Being a son of chambal I have all reasons to prejudice about this movie to promote it but trust me I will not , What i like about this movie is hidden humor in perfect dialogue delivery by Irfaan khan and simplicity of his character.\n\nA simple man who was pride of nation, a athlete who holds the national record and become a rebel for the pride of the family ,a very powerful script with good direction and fabulous acting,\n\nEven violent scenes are portrayed with utter innocence , the things i missed in movie is connectivity of local flavour like not much scenery of Morena , bhind districts & the language accent."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "amritanshdash",
        "review_rating": "10",
        "review_title": "Glad to watch this one, srk and akshay lovers, please step aside",
        "review_detailed_main": "Well, i haven't seen a single movie review list in which there is not even a single negative review about the movie. But this one, i was compelled to watch because of this factor also. The first one was the duo of Irfan Khan and Tigmanshu. Guys you rock, HAASIL was all about character, but this was truly a man show by irfan.\n\nThe acting of other character were superb awesome, even if they were on the screen for a single scene also, but this IRFAN he stole everything. Watch out if you are not a typical bollywood movie buff, because if you want to see srk crying, akshay shaking his head, Aamir working out an extra mile to show that he has made something different , than guys check the next theater this one is not for you."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "viplav-aug",
        "review_rating": "10",
        "review_title": "wonderful film paan singh tomar !!",
        "review_detailed_main": "paan singh tomar ... a masterpiece !!! a gr8 film which not only provides u which technical aspects of film making but also entertaining heavily.. its such a nice film that would remain in your heart for a long time. released without any promotion , this film will survive through heavily positive word of mouth . believe me its the most inspiring and meaningful movie of recent times. its a flawless work and each and every person should watch it ..irfan khan's acting was flawless. mahie gill was great. other supporting actors perfectly chosen . even the old people in village were shot brilliantly. cinematography is very natural and gives u a very genuine look of the locations. nothing seems fake, imposed or artificial.\n\nIt deserves nothing less than 100 % marks .SHOULD BE INDIA'S ENTRY FOR Oscars . GO FOR IT !!! My review : 10/10"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "rvs-dude",
        "review_rating": "10",
        "review_title": "The movie which must be watched",
        "review_detailed_main": "I have seen thousands of movies but there was nothing like this in any bollywood movie.This movie shows how cinema is changing now a days. An exceptional film with a exceptional story. This movie shows the real reality of backward areas and the respect given to sportsmen of our country.The acting is undoubtedly good as it as irrfan khan.Te movie will surely break some records.Its income has already crossed the investment done.I will recommend this movie to each and every individual who reads this review.\n\nWhy to Watch:- 1.Exceptional Story. 2.Outstanding acting. 3.Good dialogs. 4.the movie shows reality.\n\nWhy not to watch:- Please go and watch it,i don't know a reason to give this movie a miss."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "rai2826",
        "review_rating": "10",
        "review_title": "This is called a movie with \"real actor\" unlike so called stars without shine",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "pulkit-2204",
        "review_rating": "10",
        "review_title": "One of the best movies of Indian Cinema",
        "review_detailed_main": "Paan Singh was a small town lad who went on to win the steeplechase at the Indian National Games for seven consecutive years. He broke the national record, a feat that was unsurpassed for 10 years! A series of life changing events however forced Paan Singh to give up athletics, pick up the gun and become the scourge of the infamous Chambal Valley in Central India. Filled with deep emotions and fateful twists, Paan Singh Tomar is a gritty, no holds barred action-adventure set in the heart of India's gangland, Chambal.\n\nThis is probably one of the best movies of Indian Cinema... tight script, great direction backed up by some fabulous acting by Irfan Khan.. he has to be one of the best actors of realistic cinema... through out the movie there isn't a single frame which looks unnecessary and a single scene which is boring.. it will keep you glued to your seats...\n\ni suggest its a must watch for fans of some good cinema..."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "gur-dhar",
        "review_rating": "9",
        "review_title": "Among the Best !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "debprotim-seal",
        "review_rating": "9",
        "review_title": "Irrfan Khan + Tigmanshu Dhulia = Magic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "braddugg",
        "review_rating": "8",
        "review_title": "Made as a competently good biopic, the acting is well top notch is worth a watch just for Irfan Khan.",
        "review_detailed_main": "Made as a competently good biopic, the acting is well top notch. It is worth a watch just for Irfan Khan.\n\nI have not heard of this man, till I knew of this movie, its good to know of such sportsman and sad to know the tragedy. The fate of the country is such that a national champion is forgotten but a dacoit is made news easily. This is an ironic story and is told really very well. Dialogues are written extremely well. The dialect is just great, It brings out rawness to character and a flavor of its own to the whole script.\n\nThe cinematography is done well, and the director sure has an eye for detail the way he has shown a few things, like a steeplechase race, dacoit's backdrop and the feuds in villages. Mind you this is a biopic and has to be handled in way to tell a real life character, there is no much added drama, at few places, it might have fallen bland too of course life is not so very interesting all times either. But all are pu together effectively to bring out a story that has a heart. We may not be in favor of Paan Singh by the end for what he has done, but fir sure he shall live on in the minds long after the movie is over.\n\nWatch it for Dialect/Dialogues and yes for Irfan Khan who may be sweeping many best actor awards for reprising this role and living it in a way thats so tough to do in terms of controlling emotions and thus exhibiting them at rare times.\n\nLiked it and I recommend such biopics be watched to know India and its diversity in a better way too. My rating is 4/5 for a movie that has been dared to be made and executed really well."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "rajat-vashishta",
        "review_rating": "10",
        "review_title": "Cinematic Brilliance!",
        "review_detailed_main": "Paan Singh Tomar is a feather in the cap for critically acclaimed director and writer Tigmanshu Dhulia. It is one of the best biopics i have ever seen and the character of Paan Singh has been made immortal by the superb performance from Irrfan Khan. The entire script, screenplay is good, while dialogues are made awesome by the superb delivery from all the actors. For the uninitiated: the movie's dialogues are not in Hindi but in a very rustic UP language, which is the true USP of this masterpiece.\n\nIrrfan Khan has risen as an actor and how! I first saw him in Dhulia's debut - Haasil in 2003 and since then Irrfan has only bettered himself with each of his roles. Obviously some credit needs to go to Dhulia for extracting the best from him. Irrfan really gets into this character of Paan Singh and delivers stupendously. Some sequences are an absolute delight to watch, like when the reporter meets Paan Singh for the first time, and almost all the scenes between Paan Singh and his wife. Mahie Gill also delivers beautifully as the shy village girl.\n\nNot much has been written about Paan Singh and what he did for the country. The movie is an eye opener of some sort about unsung heroes of Indian sports. The disappointing part is, such heroes come to light through cinema only when they die or are converted to goons like in the case of Paan Singh Tomar! Nonetheless, an excellent piece of cinema. We want more such movies."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "ketgup83",
        "review_rating": "9",
        "review_title": "Highly recommended !!!",
        "review_detailed_main": "Paan Singh Tomar, based on a true story of an athlete-turned-rebel , was an encouraging , sit-up and make-you-think movie which ends on a sad note. An athlete(Irrfan Khan) joins the army to serve for the country but is encouraged to participate in distance running in international competition because of his great stamina, high energy and good running speed. Soon he brings laurels for his country after winning several gold medals and appreciation. But his success is short lived when he enters into fight with his relatives in his village over a land feud. Though , he wins the fight in village panchayat , he and his family are threatened for life. He goes back to army and even approaches police for help but his efforts goes in vain. Unfortunately , he had no options but to pick guns to protect his family which turns him into a dreaded dacoit. Paan Singh Tomar is directed by Tigmanshu Dhulia (Haasil , Sahib Bibi and Gangster). It takes a great effort to make a film of this stature. The director has not only handled the hard-hitting true story of a rebel but he has also portrayed the forgotten sportsman in an outstanding way. The screenplay is executed superbly along with some fantastic dialogues. Cinematography was eye-catching which captured the rough terrain of Chambal valley. There were couple of scenes which stands out particularly the sequence at the police station where Irrfan blast the cop for not following his duty diligently. On the flip side , I thought the race sequence could have been made more thrilling. But the brilliant performance by supremely talented actor compensates for it. Irrfan Khan plays the role of Paan Singh Tomar to T. He is just perfect fit for this role where he had to emotes the character of a sportsman and brilliantly turning into a rebel. He has done it all. Vipin Sharma was effective , Mahie Gill was good. So ,overall , a brilliant movie in all aspects. Watch out for the superlative performance of Irrfan Khan and splendid direction. But most importantly , the movie gives out a message to us – Have the government done justice to the Indian Sportsmen who have brought laurels and medals for our country ? Watch this flick \u0085 highly recommended : 4/5"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bharat_bhushan02",
        "review_rating": "10",
        "review_title": "Irrfan Khan has delivered superlative performance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "kaur-kaushal",
        "review_rating": "10",
        "review_title": "Deserving movie !",
        "review_detailed_main": "The Story is about a Daku(Dacoit)(Irfan) who was actually a soldier who fought for his country and could give it all for his country who then became a runner and wins gold medal at the Indian national games, but is forced to become a Dacoit after being neglected and insulted by the Police,and his mission is to rebel and defy the police department.\n\nOne hell of a power-packed performance by Irrfan. He carries the entire film on his shoulder.\n\nThe scenes of the army are well handled, there are some funny moments as well.\n\nThe regional language used in the film all the time makes the film much more compelling.\n\nMemmorable dialogues especially \"Kaho Haan\" are just the perfect ingredients for a movie !"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "praveen-nishchal",
        "review_rating": "9",
        "review_title": "Excellent Movie revealing the truth",
        "review_detailed_main": "This movie is awesome. Paan Singh Tomar was one of the best Indian Cinema i have ever seen.He was an Indian athlete and a seven-time national steeplechase champion during the 1950s and 1960s.It is truth that the popularity of cricket has overshadowed other games from flourishing and other games are not receiving attention.Sufferers has been Hockey, Athletics,Football and many others.Many of these players died penniless and some was forced to sell their medals and they got no support from Government.We should raise our voice to the government so that they help such person. I am not criticizing cricket. I am a die hard cricket fan but we should not forget those sports-person who laid their whole life and brought honor to our nation. It is upon viewers to popularize a game. My urge is that players must be paid attention after they discontinue their service to this country."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "ups-36964",
        "review_rating": "8",
        "review_title": "A journey from a soldier to a rebel",
        "review_detailed_main": "Paan Singh Tomar is a disheartening story of a soldier/athlete turned rebel, when he faces the atrocities of his brother as well as get no help from the corrupt police. It doesn't justify his acts, neither it condemns them. But it presents a mirror to our society. A message that that we should honor the sportsmen of this country.\n\nIrrfan is amazing as always. His acting is always of next level. May he rest in peace"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "adityaupadhyay1",
        "review_rating": "9",
        "review_title": "This is what Indian cinema is capable of !!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "aditsecret",
        "review_rating": "8",
        "review_title": "An Irrfantastic watch!!!",
        "review_detailed_main": "Paan Singh Tomar on being termed a dacoit by a nervous journalist 'Beehad main baghi hote hain, dacoit milte hain parliament men\". The moment I heard the above dialog in the trailers, I knew Paan Singh Tomar will definitely strike a chord with the audience, given the clouds of corruption shrouding the Indian landscape. In fact, PST is more than your usual story of a common man standing up against the system. The flick on the whole showcases the travails and twists and turns in the life of the notorious outlaw, Paan Singh Tomar who from ruling the roost in the Indian athletic scene goes onto become a feared Chambal Valley dacoit .The famed Dhulia Irrfan duo, from its \"Haasil\" days is known to deliver some cinematic masterpieces and boy do they take it another level with Paan Singh Tomar.\n\nIrrfan has been Bollywood's torch bearer of sorts in Hollywood in recent times and with his turn as the famed but now forgotten dacoit, Paan Singh Tomar, he has just proved why he is one step ahead of his contemporaries. In PST he effortlessly adorns the gear of a frail athlete who to begin with, gets on the race track just for that extra dose of food. The first half shows PST's rise to an all-conquering athlete who can do no wrong as he represents India in the Asian games in Tokyo as the Steeple chase national champion. We see an inspiring sequence of events as Tomar rises to the pinnacle of success from his humble beginnings in the dusty terrains of Morena. Coupled with rib tickling dialogs and the well-orchestrated track and field scenes, the first half of Paan Singh Tomar makes you sit up and take notice of a talent that once scorched the Indian athletic scene. Smartly edited and mixed with the right amount of emotions and humor, the first half whizzes away just like a whiff of pleasant air.\n\nThen in a dramatic turn of events Tomar has to leave the glory of the track behind and return to his native place as his pestering cousins get him involved in a feud over a small piece of land. Shunned and ridiculed by the local police and at the nadir of his life, Tomar decides to take law in his own hands as his cousins launch a vehement attack on his family owing to the feud mentioned earlier. Dhulia effectively puts forth and underlines the failure of the state to not only maintain law and order but also the plight of sports persons who are treated like specks of dirt in this country . PST's tumultuous transition from a proud army man who once considered a brick of ice cream as his greatest honor into a revenge seeking and conniving outlaw is complete as he utters\" No one gave a damn about me when I won medals for the country. Today when I'm a rebel everyone wants to know about Paan Singh Tomar\" with a sense of irony and sums up the apathy of a person who has been failed by the very system that he trusted and cherished .In subsequent scenes, true to the celebrated and legendary style of robin hood he becomes the bête noire of the rich whilst being celebrated by the poor, by not only escaping the clutches of law every now and then but also by making mockery of the police and ridiculing them into meek surrender. Not only does he gain revenge on his cousins but he also achieves a cult status of a dacoit at the top his trade, meticulously deploying his military training and techniques (an example being the famed \"scout formation\") and in the process instilling discipline in his pack as the world falls to his feet.\n\nWhat prevents the film from reaching insurmountable dizzying heights , is that the flick tends to drag a bit towards the end and is a bit too lengthy as it reaches its climax. There are moments in the second \"revenge\" half where one yearns for the slickness and the pace of the first half.\n\nOtherwise, Irrfan delivers a rock solid and one of the best performances by an actor is recent times. His honest and heartfelt performance as Paan Singh, both the athlete and the renegade, combined with his command over the local dialect and his rustic demeanor is really commendable as he portrays a challenging role with aplomb and is well truly the high point and USP of the film. Mahie Gill, Dhulia's muse these days, has a small role but she excels in it, true to her burgeoning reputation .The rest of the cast blend perfectly into the demands and vision of the director to firmly put a stamp on the veracity and class of this masterpiece of a movie. Paan Singh Tomar to sum up isn't one of your run of the mill biographies flooding the \"biography\" genre these days, but a fitting tribute to a common man who stood firm against all odds to uphold the pride of his country and ultimately his family."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bsthakur81",
        "review_rating": "10",
        "review_title": "Awesome Movie with Great Acting of Irfaan",
        "review_detailed_main": "Really awesome movie. I enjoyed every second in the theater watching this movie. Irfan has done tremendous role in this movie. This movie must go for Oscar Nomination.\n\nIrfaan has left behind a lot all Khan brothers. Direction is also good. Scenes and pictures are perfect.\n\nDialects are really good. Irfaan Khan did totally justice with the role. He used the same language that is used in that Chambal(Bhind and Murena) area of Madhay Pradesh.\n\nThis is one of the best movie of Irfan Khan.\n\nReally must watch movie."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "ambitionranu",
        "review_rating": "10",
        "review_title": "Inspirational, Message oriented Movie! Bollywood at its best",
        "review_detailed_main": "I am always a big fan of Irfaan khan after watching haasil movie....but now i love him madly ..what an actor.\n\nThe film is story about one of the unsung heroes of Indian sport history Paan singh tomar who was a brilliant steeplechase athlete of his time.The way his life change and the reasons which prompted him to be a most wanted dacoit are displayed in a beautiful manner .....awesome story,awesome direction,awesome screenplay and splendid performances ...\n\nI am from chambal region and i heard a lot of stories of dacoits but this story is somewhat special as it touches the deepest corner of my heart , brings some tears and also reminds me of my great grandfather..a great hockey player of 50s and 60s .So guys don't wait ....go and watch this ultimate movie.\n\nI am sure everyone love this movie and Indian government will also do something for such unsung heroes :)"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "saurabh-acharya7",
        "review_rating": "10",
        "review_title": "must watch movie, best-est sport movie",
        "review_detailed_main": "great movie, should get best movie and best actor award,Orran great actor. direction also great great. also received an Oscar Nomi, please make some more kind of this movie. i just loved the movie, have already watched it 6 times. fantastic work, music also good great movie, should get best movie and best actor award,Orran great actor. direction also great great. also received an Oscar Nomi, please make some more kind of this movie. i just loved the movie, have already watched it 6 times. fantastic work, music also good great movie, should get best movie and best actor award,Orran great actor. direction also great great. also received an Oscar Nomi, please make some more kind of this movie. i just loved the movie, have already watched it 6 times. fantastic work, music also good great movie, should get best movie and best actor award,Orran great actor. direction also great great. also received an Oscar Nomi, please make some more kind of this movie. i just loved the movie, have already watched it 6 times. fantastic work, music also good"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bobbysing",
        "review_rating": "10",
        "review_title": "Feeling proud as well as ashamed after watching this honest well crafted film revealing the bitter truth.",
        "review_detailed_main": "Beginning with a confession, I really felt both proud as well as ashamed after watching this honest well crafted film revealing the bitter truth of our Indian Social System through its powerful narrative.\n\nPROUD, because the film perfectly proves to be a true example of CINEMA made in the right manner for the overall benefit of the society. CINEMA, as per my understanding is a powerful medium of expression which basically needs to serve two main purposes. It has to entertain as well as enlighten its viewers about the various important issues prevailing in the system which need to be addressed urgently.\n\nTo be precise, how many of us ever knew about this character called PAAN SINGH TOMAR who actually existed in our society a few decades ago? We all love Cricket so much, remembering all its record makers and breakers on our tips. But how many of us ever knew about this seven-time NATIONAL CHAMPION in steeplechase (obstacle) race, a born athlete who later had to pick up arms and became a hard-core WANTED rebel (not Dacoit) of Beeharh? The film enlightens us all about Paan Singh's sad life-story and thus fulfills its duty of being a \"True Cinematic Effort\" made by Tigmanshu, Irfan and the team.\n\nIt also made me remember another proud product of our Indian Film Industry, BANDIT QUEEN directed by Shekhar Kapoor in 1994, which is till date considered to be a major benchmark in the history of Film-making in India. Interestingly, (as reported) director Tigmashu Dhulia worked with Shekhar in this project only in his early days.\n\nBefore moving on to the acidic part of this write-up, I would like to say that as a movie, it's a gripping experience which works majorly in its first half with a pinch of comic moments too, added brilliantly in its screenplay. The second half expectedly talks about the transformation part which can also be considered as just another 'Vengeance Saga' by many critiques. Well supported by a spectacular cinematography, sharp editing and an award winning performance by Irfan Khan, it's a worth watching gem striking a difficult balance between the life of a sportsman and a rebel. Though as I felt, the background score could have been better but still it serves the purpose well while watching the film. But here instead of giving you a review, I would like to mention a few dialogues of the film, which should be enough to prove the precious value of this rare gem coming out of Bollywood after a long time.\n\nAs the film starts off, Paan Singh informs his officer saying, \"Hamaar Mama Beeharh Ke Baaghi Thhey, Dacait Nahin\u0085..Aur Bahut Izzat Thi Unki Purey Ziley Mein!\"\n\nOn being addressed as a Daku by the reporter in his interview, Paan Singh comes forward and says, \"'Beeharh Mein Baaghi Hotey Hain\u0085..Dacait Milte Hain Parliament Mein'.\n\nIn the last meeting (after becoming a rebel) with his supportive Military Officer, the Officer leaves Paan Singh saying, \"Ab Main Tumse Kabhi Nahin Milunga Aur Yeh Hamari Aakhri Mulaqaat Hogi\"\u0085\u0085..but to this Paan Singh replies, \"Par Khabrein Milti Rahengi!\"\n\nAnd lastly, on hearing the radio, broadcasting the news of Paan Singh Tomar's search by the Police all over, he laughs in anger and says, \"Jab Desh Ke Liye Bhaaga, Tab Kisi Ne Nahin Poocha\u0085\u0085\u0085, Ab Beeharh Mein Bhaag Rahey Hain To Saaley Sab Naam Jap Rahey Hain!\"\n\nSo, if the above few dialogues cannot convince you to watch PAAN SINGH TOMAR as soon as possible then I seriously don't know what else can.\n\nNow coming to the harsh part of this write-up, I felt ashamed after watching this flick due to more than one reason related to both Bollywood as well as the political social system we are living in.\n\nTaking up Bollywood first, it was really a shame that this well-made film was lying in cans, waiting to get released for more than one year for some undisclosed reasons. The word CINEMA is complete only if we keep on making films on diversified subjects related with its various genres. Otherwise it will be just like eating the same dish in dinner every day leading to boredom. So if films like PAAN SINGH TOMAR will continue finding difficulties in getting released then Who will like to make them in the near future?\n\nThe next was the bigger shock which came in the end when they showed a whole list of names on the black screen, who were NATIONAL Champions in OLYMPICS and other games but had died eventually either due to lack of medical treatment or being penniless. Reading the list scrolling on the screen I asked to myself,\n\n\"Are these talented people, the NATIONAL TREASURES of the country only till the day they can perform on the field?\n\nDon't they remain the same NATIONAL TREASURES once they get retired?\n\nAnd Isn't this a NATIONAL RESPONSIBILITY of the Nation's Government to take care of all these gifted personalities after their retirement, till their last breath and give them a honorable farewell in the end?\".\n\nThe same principle applies to every art form including the Film Industry, where we have recently seen veterans like A. K. Hangal in a sorry state asking for monetary help on the national news channels.\n\nSo this is not a review of the film PAAN SINGH TOMAR but a humble tribute from my side along with Tigmanshu and Irfan Khan, for such blessed souls who were sadly not treated well by our own society. Paan Singh may have opted for a wrong or debatable path in order to fight for this own rights. But had the Government been there to take care of him in those difficult days, considering him as A NATIONAL TREASURE, we could have got a great COACH instead of a REBEL running in the Beeharh."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "vimalshukla226",
        "review_rating": "9",
        "review_title": "Best of 2012 !",
        "review_detailed_main": "Great tight script, great acting, and great direction.\n\nAll the actors have done a great job but Irfan is just magnificent- he is turning up as the next Nasruddin Shah.\n\nNeedless to say Irrfan Khan has delivered superlative performance. He has defined what is called as an 'Effortless Performance'. Brilliant, in fact, no words ! The simplicity shown by director in this movie is worth to be watched. This movie deserves to be in Oscar nominations I would say.\n\nThe Director does a decent job in making this film into one of the sensible movies made in bollywood, and good job from him for giving Irfan a perfect role in the movie.\n\nOverall perfect movie !"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "gurdial_652003",
        "review_rating": "9",
        "review_title": "worth watch !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "harpalsingh227",
        "review_rating": "9",
        "review_title": "Great film !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "betterbesafehero",
        "review_rating": "10",
        "review_title": "Stupendous, fantabulous fantastically awe-inspiring movie!!!!",
        "review_detailed_main": "Now......when I hear the name of Irrfan Khan, I think he is gonna win the Oscar someday!! I am not joking, he is really gonna, he just need a fantastic break in Hollywood with a good script.\n\nComing back to the movies.......It was sheer pleasure watching this movie, One cannot expect for more from it.\n\nPlot.....Story was very good.....Even the characterization....language which they speak has been roped in.....The way the movie progresses it become more and more interesting.....Even the locations have been correctly implemented.\n\nEditing was good......I don't know much about movies like cinematography and all.....but all an all A Movie lover will thoroughly enjoy it.\n\nComing to the best parts of movie......Dialog....they are just Awesome!!.....I can't believe the way dialogs have been written.....You will find hard forgetting them......They are just too good to repeat.\n\nIrrfan Khan has given a stellar performance......Great....He justifies Acting!!....Other actors and Mahie Gill was also very good......But Irrfan steals the show!! Kudos to the Director......Tigmanshu Dhulia......and to writer also!! It was a biopic, and a real story of a rebel.....Paan Singh Tomar.....One of the Irrfan Khan finest works till date......I am huge fan of him......When we talk about the actors who has so much potential and art in them, and though they are not that successful, I feel pity.\n\nNo one stand in front of him, No-one from bollywood can compete him......though there are very finest actors like Naseeruddin Shah.....Om puri, But I haven't seen anyone like him, He is one of his kind!!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "avisheksahu99",
        "review_rating": "8",
        "review_title": "GPS for mobile phones for cash on the loose!",
        "review_detailed_main": "Phones are tracked to every movement of proximity sensors and NFC radios to catch mobile thieves of monarchial ownerships bought with cash tracked by no one over numbers and hologram stickers inspite of GPS tracking of packing boxes insinuated thereby. Camera on those phones then becomes records of votes cast to elect ministers employed with the government inspite of being party functionaries as trustees of incredulous banking surviving on dispensing of loud newsbytes to keep critical appraisals of psychological maneuvers a terrorist's call for glory and not occupational demands of a bustling republic laying premium on dacoits that were sportsmen to understand what the laity couldn't as high-flying consumers of American fare under duress of megalomaniacal family businesses."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "kachara73",
        "review_rating": "9",
        "review_title": "This is an Oscar material - Rare yet Great Subject, Amazing screenplay and awesome acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "ashu-to",
        "review_rating": "10",
        "review_title": "Film making at its best(10 out of 10)",
        "review_detailed_main": "There are handful of directors who could narrate the subject such as biography of a man who has been oppressed and has been the champion of sports in the country at the same time.Paan Singh Tomar is one of them.\n\nThis movie will leave a lasting impression on you days after you have seen this movie.It not only conveys the fact about plight of people who consider sports as important ingredient in one's upbringing and well being but also the complexities and egoistic clashes born out of prejudices in this wide country.\n\nOn technical front its fast paced and well edited film.In all this is a movie which will compel you to think on nuances(like family rivalry,land disputes..) in country as diverse such as India"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "jhingalalahmm",
        "review_rating": "10",
        "review_title": "I was speechless!",
        "review_detailed_main": "At first, I wasn't so sure of how this movie will be, but then once I watched it, I was left speechless. This movie is Oscar material. Right from the location, the sets, the costumes, the lingo, the performances is perfect. The performance of the lead actor, Irrfan Khan is award winning. He has (once again) proved that he an actor par excellence. The narration of the movie is done at a speed which is just perfect. Once you see this movie, it leaves you sad for the great Indian athletes who have to struggle in pathetic conditions. They have to face politics and favoritism at every step of the way. And most of all, they receive no appreciation or recognition from the society. Like the character said in the movie, when he won gold medals for the country no one recognized him and now that he is a Chambal Valley dacoit, the whole nation knows him. Very sad indeed. I wont reveal any story details, I leave it to you to go and watch this movie. 10/10."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "mailbox-anshuman",
        "review_rating": "10",
        "review_title": "superb movie",
        "review_detailed_main": "Tigmanshu Dhulia with Irrfan Khan recreated magic in Paan Singh Tomar after Haasil. Big fan of this deadly combo. An awesome movie depicting the life of an ex- army man, his pain, anger. Good job done by all actors, to my surprise Mahi Gill also acted well. But hats off to the ultimate Khan- Irrfan Khan. Be it acting, dialogues , or facial expressions..he masters in every thing. Who wants SRK, Amir, Salman or Saif, we have a new Khan in Bollywood. Once again I congratulate all people associated with movie. Finally an awesome movie after so long time. Must watch for every Bollywood lover. Tigmanshu Dhulia, keep up the good work. Once again you proved that you are one of the best directors in the Indian film industry!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "ragneshjani",
        "review_rating": "9",
        "review_title": "Watch before the film get nominated for Oscars !!!",
        "review_detailed_main": "Tired of watching mediocre movies since beginning of this year?would like to turn your Holi into Diwali ? Here is an answer ! \"Paansing Tomar \" ! Real life to reel life transition.\n\nThe Biopic does not only expose Injustice to the sports people in our country , but also portrays a national champion runner (steeplechase) who becomes more famous as a dacoit ( I m sorry ........ as a rebel :) ........life is not what you plan, design or expect.... But its all about what is planned , designed and expected... By destiny Irfan : What an actor ! , no words for him..... just a big clap ! how magnificently he portrays the character of Paansing Tomar on the screen ..! another (loop of) round of the claps.... He really deserves .... you can't take your eyes off him...\n\nMaahi Gil : Her role doesn't have length but shows her strength .... As an actress.. Bollywood , fill up the vacancy of Smita Patil... She is the appropriate candidate Even supportings have done good !, dialogues, music, everything is adorable How can I forget Tigmanshu Dhulia ! His detailed direction has put this film Into a must watch category ! To conclude : Watch before the film get nominated for Oscars!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "himanish-kar1",
        "review_rating": "10",
        "review_title": "Irrfan Khan's most powerful performance till date...",
        "review_detailed_main": "Irrfan Khan's most powerful performance till date (and i do include MAQBOOL and HAASIL when counting)....PAAN SINGH TOMAR....refreshing unsubtle and alarmingly close to the truth of how the system makes rebels out of the even national stars....and frankly after the spate of super-sub-standard movies (dats sub-standard even by the Bollywood standards!) Tigmanshu Dhulia's no-nonsense biopic appears like a whiff of fresh air....a gives us hope....of better things to come...My only worry is that this item song-less (and surprise-surprise...no dance songs either!), zero special effects, superstar-less movie might end up sharing the fate of other low-budget but powerful films such as HAASIL, SEHAR, GULAAL and BABARR, languishing unknown till some future date when it might have a sudden resurgence and finally come into its own.....Definitely one of those movies worth spending money to watch at the theatre....! Last words....for those of you who enjoy a good movie...PAAN SINGH TOMAR is one of those movies where the only thing to watch for is the acting....so...no prizes for guessing who the top Khan in Bollywood is....SRK...Salman....Saif...oh an Aamir...hope u guys r listening...!!!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "shanty-bruno",
        "review_rating": "10",
        "review_title": "Paan Singh Tomar- Perfect in evry aspect of film making and acting skills...hats off to every department of the movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "siddharthp-308-693458",
        "review_rating": "10",
        "review_title": "Movie with multi dimension",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "alisafd",
        "review_rating": "9",
        "review_title": "A Summary of All That is Wrong in India",
        "review_detailed_main": "First of all, there are two heroes in the movie. One is the inimitable Irrfan who has always left an impression on his fans and critics alike right from his first movie. The second hero of the movie is its script. The story of an army athlete who decides to participate in sports for the sole reason that he could eat full stomach, a man who prefers to run bare feet in an international arena and finally has to take up arms to protect his family and property when the government and administration fail to act. The transformation is so pure and natural that we all ended up feeling I would have done the same in the situation. That's the strength of the story and the character.\n\nThe movie goes on at an amazing pace without a dull moment, the one liners are so witty that even while empathizing with the situation you can put a curve on your lips, and the entire supporting cast just gels around the story as if its their story too. Special mention to Mahie who displays superb acting skills yet again in the limited opportunity she gets. She has an amazing screen presence and you end up wanting for more...and more.\n\nAll in all a superb movie and a must watch for everybody!!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "almassteelpune",
        "review_rating": "10",
        "review_title": "Big bang to Bollywood",
        "review_detailed_main": "I watch Indian movies very selectively,after reading its review, I found it an extraordinary movie,no doubt it is one of the gems from Indian Cinema, no songs no dance ,an extraordinary story with superb acting by Irfan Khan, he is a true khan.\n\nThe simplicity shown by director in this movie is worth to be watched,Who says that the big budgeted with so called super stars movies can be hit, but I think Irfan is a real super star.I must say here that the reviews written by Taran Adarsh must be avoided now that he gave only 3 stars to this movie.I recommend it for everyone who wants to have great time in watching movie,I bet, this movie will not disappoint you,I think it would be nominated for Oscars 2013.I am giving it 10/10."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "kevinlobo-23347",
        "review_rating": "8",
        "review_title": "An experience to live",
        "review_detailed_main": "An amazing story telling Tigmanshu may be a fluke actor though ace at filmmaking and afcourse Irrfan truely living within us through his cinema"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "alok-beel",
        "review_rating": "10",
        "review_title": "Must Watch",
        "review_detailed_main": "Irrfan's performance and the gripping storyline makes the movie a must watch. Despite being a biopic, the story has good pace. The remarkable ease with which Irrfan executes such roles is truly remarkable. He leaves his impression on you for days after you watch the movie. Mahie is good too as one of the lead character. Nawazuddin Siddiqui, Brajendra Kala have also performed well. Hats off to Tigmanshu Dhulia for remaking a good movie after Haasil. The combination of Tigmanshu and Irrfan has created magic again. Such movies usually have a disappointing climax but this movie does well there too. Watch it once and you will watch it again."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "khan554427",
        "review_rating": "10",
        "review_title": "irrfan at his best",
        "review_detailed_main": "just watched the review here on IMDb and i m quite disappointed with the 8.3/10 rating this movie must get the rating of at least 9.5/10. best Indian movie ever made on sports. Irrfan is the best actor right now in bollywood. hats off for your performance irrfan u r a real superstar of bollywood. tigmanshu and irrfan make a fine pair as actor and director. they first made haasil and now paan singh tomar but i must say paan singh tomar is far better than haasil.this is the masterstoke of irrfan's ability as an actor.the emotions and expressions he show in this movie were marvellous his comic timing his one liner everything in the film was perfect. Amazing script, amazing dialogue writing fabulous starcaste and magical performance of irrfan khan as paan singh all make this movie a masterpiece. I am really hurt to see that this movie didn't get the applause and honour that it deserve. must watch both classes and masses this movie is for every Indian"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "lokeshnautiyal",
        "review_rating": "10",
        "review_title": "One of the best of Irfaan Khan",
        "review_detailed_main": "Story is powerful direction of Tigmanshu Dhulia is very tight. For the performance prospect it is one of the this movie is one of the best in bollywood. Again the masterclass performance of Irfaan Khan and all the co-star. It's a Gem for bollywood and for the movie lovers who really appreciate art."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "pratyush-03848",
        "review_rating": "9",
        "review_title": "Truly one of the best films of 2012",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "dhulia-sarkar",
        "review_rating": "10",
        "review_title": "Just wonderful !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "Avi_11",
        "review_rating": "9",
        "review_title": "Amazing experience",
        "review_detailed_main": "1st half of the movie a simple guy who turned into 'Baghi' due to some circumstances .he played both the part so nicely."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "flyingsaucer",
        "review_rating": "9",
        "review_title": "Mark of Maturity",
        "review_detailed_main": "First of all, no beating about the bush, Irrfan Khan is the best actor in the country. Aye, I mean better than great talents like Nawazuddin, Aamir and Ajay Devgan. This man seems to hit it out of the park again and again, consistently blowing the expectations of Indian Audiences to smithereens. This movie is carried on the broad shoulders of Irrfan, who like Ken Watanabe has become face of his country in Hollywood -- and very deserving.\n\nThis movie is made as well as it could have been made. It deserved to go to the Oscars, but the naive Indian Film authority has chosen a far inferior film called Barfi to represent India at Oscars. It is my Opinion that Indian films can never grow if every year only a big star is given Best Actor Award. If you are a big star, and you had a moderately good performance, then boom, you win the best actor for the year. I hated how Ranbir Kapoor chosen as best actor over Irrfan Khan....In Bollywood,stardom and parental influence reigns.\n\nThe movie is about an athlete, who represents India at National and International levels and win many medals and honors for the country. This disinterested sportsman slowly unravels in him a streak of immeasurable success consistently over the period of 15 years. When he retires, he falls into the dark world of Indian corruption and police, when his relative grabs his piece of land and police just wouldn't help him. In times of desperateness, Paan Singh Tomar takes up a gun to fight for his own. And the rest of the story is about what steps he takes to win over his land and take over those who oppose him. It might seem like Art Film, but believe me, this Film is TOTAL FUN. Never a dull moment, never a clichéd scene, and not one useless dialogue. This film is a triumph."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "amit-kumar72043",
        "review_rating": "9",
        "review_title": "Hats off to Irrfan !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bhanuchawla-66193",
        "review_rating": "9",
        "review_title": "Paan Singh Tomar",
        "review_detailed_main": "It was brilliant a movie with a great script. Irfan done extraordinary act in this movie. Tigmanshu direction was great. Dialogues was good and Irfan's dialogue delivery was superb."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bikashhaloi-59833",
        "review_rating": "10",
        "review_title": "RIP Irfaan",
        "review_detailed_main": "This is biopic of Indian athlete Paan Singh Tomar.\n\nEverytime i watch irfaan's movie its hit me. Every character of this movie a good actor. Everyone played their role so naturally. Irfaan's natural acting will hit you every time. You can easily understand the struggle of Paan singh Tomar and his family."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "Paan Singh Tomar (U/A) Hindi --------- my Rating : ★★★★ TRUE STORY",
        "review_detailed_main": "For more reviews and Hot news ... Just LIKE this page ?\n\nhttps://www.facebook.com/YunusIrshadsMovieReview\n\nPaan Singh Tomar (U/A) Hindi --------- my Rating : ★★★★ TRUE STORY\n\nSTRENGTHS : - * Screenplay : scenes will move off sweeping away. will not make u bore.... * Casting and Performances : fantastic by irfan khan and rest of them..... * Background Score : superb exact timing scores were given..... * Direction and Camera : well absorbed and taken well in the First half.... * Story : a real life story of an \"Paan Singh tomar \"\n\nWEAKNESSES : - * Trailer and Promotions : the movie is not well promoted and received in the box office whereas it is an Hit later.....\n\nFINAL VERDICT : - * within the start of 20 minutes ... u will get attached to the script and go away... superb movie... but not more than once.....\n\nPaan Singh Tomar is a Hindi-language film, based on the true story of a runner employed by the Army and has won Gold medal at Indian National Games but forced to become notorious baaghi. It is directed by Tigmanshu Dhulia."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "vishulgurjar",
        "review_rating": "9",
        "review_title": "From the perspective of a Chambal guy",
        "review_detailed_main": "Cast: Irrfan Khan, Mahie Gill and Nawazuddin Siddiqui Director: Tigmanshu Dhulia This past weekend, I saw the movie Paan Singh Tomar. As it is based on a real incident happened in the life of national athlete, it was definitely a film to remember. Being from the Chambal region helped me a lot to understand the director's research work on local culture.\n\nThis story is based on the life of famous and seven time's steeplechase national champion who became one of the most wanted Dacoits in Chambal Valley. The first half of the movie is a conversation between a journalist and Paan Singh Tomar while the other half depicts real frame. This interview of Paan led the government to take him seriously and get him to surrender as soon as possible.\n\nOverall this movie sends a great message that sportsmen aren't getting enough attention on and off the field which they deserve for bringing so many laurels to the nation. Same thing happened with Paan Singh when police denied his identity even when he showed his medals and said that they can't interfere in between until someone dies. Tigmanshu has succeeded in showing every aspect of the story. Making film in same Chambal valley has added a real touch to the film.\n\nIrfan has done justice to the character by showing excellent and professional acting skills. He depicted role of a guy from Chambal. Dialogues were very good. Mahie gill too has done some great work as a co star. Here Nawazuddin hasn't performed up to the mark. Since it is a biopic, the writer didn't have much work to do but he could have made it better by adding some important things to it.\n\nCinematography is something very professional, the way they have used lighting in scene where journalist comes to interview Paan Singh is laudable. Other than that folk music has also added some reality to it, I noticed folk music playing in a loudspeaker at many places which you will commonly encounter these days in those kind of villages(though not in 1970's)."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "prosantabiswasbiju-61948",
        "review_rating": "10",
        "review_title": "Great real life story..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "shivammauryasachin-94510",
        "review_rating": "10",
        "review_title": "Tigmanshu Dhulia is a star",
        "review_detailed_main": "It's very difficult to direct a biopic but Tigmanshu did it ,It should be went to Oscar instead of Barfi"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "bandayimran",
        "review_rating": "8",
        "review_title": "great movie",
        "review_detailed_main": "A great movie to watch. Irfan has done well in this movie but could not understand what about other bandits in chambal. Overall best of one's."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sushantreddy47",
        "review_rating": "10",
        "review_title": "Absolutely stellar performance !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sudhirkumarss",
        "review_rating": "10",
        "review_title": "Must watch movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "rashedazad",
        "review_rating": "10",
        "review_title": "Can't hold my tear",
        "review_detailed_main": "I am not here to praising the cinema making. But I am here to tell about the pathetic story of several sportsman of a country. How a country can do this?"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "abhishek-24441",
        "review_rating": "10",
        "review_title": "Real story",
        "review_detailed_main": "Paan singh tomar is real epic movie of indian cinema . It is the story of Indian army soldier paan singh tomar who later become a rebellious person due to poor circumstance to tell the lesson to corrupt people's. Please watch this movie it will surely tell you a lesson.."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "priyankamahato-33248",
        "review_rating": "8",
        "review_title": "A masterpiece.",
        "review_detailed_main": "In India where sports like cricket is believed to be a religion, many athletes and sportsperson like Paan Singh Tomar, the name and it's fame faded so easily that it needed a remarkable film like this to tell people the condition of athletes in our country. The people who bring pride to our nation, who shall be praised for their contribution, have to even sell their medals to sustain sometimes. Then there is Paan Singh Tomar, played by the legend itself Mr Irrfan Khan, who once used to set records in marathons, had to later run from police when he had to turn into a dacoit due to certain circumstances. Yet again Tigmanshu Dhulia, proved how amazing director he is. The outstanding performance of the other cast is also noticeable. The movie is a must watch."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sinhaabhinav-00498",
        "review_rating": "10",
        "review_title": "Will miss you Irrfan sir",
        "review_detailed_main": "If this one has been made in Hollywood then the Oscar Golden Globe BAFTA and every fu*king award would have won my Splendid actor Irrfan A definitely must must must watch for cinema lovers"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "adityavikram-11298",
        "review_rating": "10",
        "review_title": "Paan Singh Tomar ⭐",
        "review_detailed_main": "I have seen so many Bollywood movies in my life but never seen a movie like Paan Singh Tomar The more I appreciate this movie, the less we all should watch this movie because such a movie is rarely made Irrfan Khan sir has set him on fire with his acting in the movie."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "sid-coolking",
        "review_rating": "9",
        "review_title": "Masterpiece and Irrfan u beauty",
        "review_detailed_main": "One of the best sports biopic ever made in Bollywood and what a stellar performance by Irrfan ( Award Winning Performance)...For me everything worked in this one and the proper research was done about the athlete making it descriptive as well as entertaining alongside...A year after Bhaag Milkha Bhaag released and must say enjoyed that as well though I cried a lot in the latter but what matters to me is an urge to watch again when on TV which is the case with former, ie, Paan Singh Tomar is a much better movie...Farhan Akhtar was no where an inch closer to what Irrfan was...Now let's talk about the main aspects in the movie, ie, dialogues, direction and screenplay...All these things are incredible but the screenplay falls a bit in the second half but it picks up afterwards of Paan Singh Tomar whereas Bhaag Milkha Bhaag was a bit overdramatised which was a plus point for the foremost...Lastly, would say that after watching Paan Singh, everybody will come to know what they were about to miss, if not seen they would regret and Bhaag Milkhas cons...A must visit!!"
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "brajeswarchandra",
        "review_rating": "10",
        "review_title": "Another masterpiece by Irfan Khan",
        "review_detailed_main": "This is a story which every indian should watch. How your negligence and corruption can make a good evil. Watch it you'll never regret."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "kaminnisreeram",
        "review_rating": "10",
        "review_title": "An actor shines.",
        "review_detailed_main": "There're stars, then there're actors. There're cliched Bollywood potboilers, then there're solid stories, scripts. There're \"celebrated\" directors who recycle the same wine, then there're those who push the envelopes. Irrfan, this film and Tighmanshu Dhulia fall in second category. Kudos to team for standing up against all odds n saying a story that would have stayed dead, had it not been for their guts n conviction. Films like Pan Singh & Wasseypur released within a gap of just two years n these films proved game changers for its creators by opening up a whole new viewership. Irrfan is phenomenal in this film. He owns every frame, bites n chews each scene. Well deserved National award n Padmashri for our dear departed actor. So long, Sir ! RIP dear Irrfan."
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "soumyalal2",
        "review_rating": "10",
        "review_title": "An Irrfan Khan classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "hitesh_c",
        "review_rating": "10",
        "review_title": "Must watch for every cinema lover",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1620933",
        "movie_name": "Paan Singh Tomar",
        "movie_rating": "8.2",
        "review_username": "jnagar-iitk",
        "review_rating": "9",
        "review_title": "The movie shows a true story",
        "review_detailed_main": "Movie: Paan Singh Tomar Directed by: Tigmanshu Dhulia Writing Credits: Sanjay \"chauhan\" & Tigmanshu Dhulia Star Casting: Irrfan Khan(as Paan Singh Tomar),Mahi Gill(as Indra),Vipin Sharma(as Major Masand) & Nawazuddin Siddiqui(as Gopi Jadav)\n\nThe story of Paan Singh Tomar, based on a true story of an athlete and seven-time national steeplechase champion becomes one of the most feared \"dacoit\"(\"Baaghi\" as Paan prefers to call it) in Chambal Valley after his army retirement.\n\nPaan joins the army to serve his country but he is encouraged to participate in distance in international competition because of his good stamina, high energy and good running speed. Soon he brings laurels to his country after winning several gold medals. But his success is short lived when he enters into a fight with his relatives in his village over a land feud. Though he wins the fight in village \"panchayat\", he and his family are threatened for life. He goes back to the army and even approaches the police for help but his efforts goes in vain. Unfortunately, he has no options but to pick up guns to protect his family which turns him into a dreaded \"dacoit\".\n\nThe director has done a great job. He has not only handled the hard- hitting true story of a rebel but also portrayed the forgotten sportsman in an outstanding way.\n\nThe movie is not well promoted and received in the box office whereas it became a hit later."
    }
]