[
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "gkleciak",
        "review_rating": "1",
        "review_title": "There Were No Jokes",
        "review_detailed_main": "I saw this movie in theaters on its opening night because I thought the trailer made it look funny. When I sat down right before the previews started I thought about it and I had only seen the trailer for this movie twice. And no other marketing besides that; I now know why. The town I went to see this movie has a large African-American population so I thought it would be a treat and it would be a movie the audience would get behind and enjoy together. There were never more than six people in the theater at a time. Aside from my two friends and I a trio of black girls were there and left about 10 minutes into the movie, only to be replaced by a guy and his two kids, who I assume were his stepchildren that he hated because he had taken them to see this movie. To start off there were no jokes. The \"jokes\" were mostly Big Boi saying something, nothing special, like \"My daddy used to golf.\" Then Faizon love(who I loved as Big Worm in Friday) would just repeat what he said in a higher voice and add the n-word. The editing made no sense and was choppy. Dialouge vital to the \"plot\" would be happening and in between the sentences there would be a cut of Faizon Love just dancing or something. To summarize buy this movie at the 3.99 Walmart bin if a friend you haven't seen in years invites you to his birthday party or something."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Peeni_Sweenis",
        "review_rating": "1",
        "review_title": "It burned my eyes",
        "review_detailed_main": "yet again i wish IMDb had a 0/10 ranking. my little brother made the mistake of renting this title from a red-box using a promo code. i was upset realizing that although the rental was free, the amount of energy i spent walking with him to the store to rent it was about as much that was put into this movie. It was horrendous. This, along with epic movie, murder-cycle, and the ghoul school, are some of the only movies that actually made my eyes hurt. While the stupid humor (or lack there of) managed to keep our golden retrieve entertained, my brother (who enjoyed from Justin to Kelly) and i would have no part of it, turning it off before the ending, which i had no desire in seeing. i regret seeing this movie and feel empty realizing that watching this probably did more damage to my body than my smoking habit."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Juganawt",
        "review_rating": "1",
        "review_title": "A shameful rip-off of Caddyshack.",
        "review_detailed_main": "Cast your mind back to 1980, with a movie called Caddyshack. You might possibly have heard of this movie, as it's one of the best comedies of all time, backed with a stellar lineup (at the time) of top notch comedy actors.\n\nNow, 27 years later, we're seeing the movie again in the guise of Who's Your Caddy, Only this time, there are a few changes. White guys are replaced with black guys, and rap culture is fused into the plot, but aside from that it's a carbon copy. Even some of the jokes are lifted directly from the original.\n\nAbsolute garbage. There is NO effort whatsoever to make Who's Your Caddy unique enough (or funny enough) to step away from Caddyshack's shadow. What was once fresh and unique, has become standard and staid, and as Who's Your Caddy copied a 27 year old movie wholesale, making the jokes so obvious you already know the punchline while the directors are in the setup.\n\nWho's Your Caddy has absolutely nothing recommendable in it's reels, even if you haven't seen the original.\n\nIf you want to watch a funny golf movie, Watch Caddyshack, or if you're desperate, Caddyshack II. If you've seen them both before, then just fondly re-watch them, as your memories will be forever tainted if you what this shameful, shallow, remake."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "chaosweaver144",
        "review_rating": "1",
        "review_title": "I hope it gets buried in the middle of nowhere",
        "review_detailed_main": "This is Norbit, Soul Plane, and The Cookout in a bucket, thrown up on. There is no reason to make such a movie. It will win no awards and it's only purpose is to fill the 7 dollar DVD bin at Wal-Mart. Why not do something productive, like making good movies? I wonder when it will stop. I hope someday that the culture it represents will die out. Bring a bunch of black actors together with some musicians, embarrass them with demeaning dialog, and throw in some white actors to look awkward and poke fun at. It's a routine that needs to go away as soon as possible. There's no creativity, and some people will actually bother to complain that racism is the reason that it isn't award winning. OH NOES, GUESS IT WAS RACISM!"
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "kthoran",
        "review_rating": "1",
        "review_title": "Worse than awful.",
        "review_detailed_main": "This movie is one of a kind and even that is too big of a compliment for this seriously lackluster movie. It tries to be funny and thoughtful and ends up being incredibly and offensively stupid, racist, and trite.\n\nThe comedy consistently misses the mark by a huge margin. This movie was intended to be a comedy although it's shockingly unfunny despite an almost foolproof set of comic circumstances and actors.\n\nWas it supposed to be a black Caddyshack or was it supposed to be a story of achievement? The movie's underlying message ends up being a thinly-veiled message of unfocused racist hate directed at white people which is actually not funny at all.\n\nWatching this film was an hour and a half of my life wasted. If you are considering watching or renting this movie please do yourself a favor and don't. Absolutely no redeeming value, even in it's terribleness. Consider yourself warned."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "themitko",
        "review_rating": "1",
        "review_title": "Whos your caddy in my opinion ....",
        "review_detailed_main": "Guys I saw the movie and I just didn't like it, it didn't have anything to do with the racism or the bad acting I just didn't like it, reason being is that the jokes were old and I already knew them all, nothing new was thrown in there that could make me laugh even once, it felt more awkward and embarrassing instead of funny. Instead of creating an original comedy that will forever be etched in peoples minds the makers of this movie copied other movies and threw their jokes in a big mix. Thats what I thought of it, this review is solely based on the funny factor of the movie which didn't make me laugh once and a comedy that doesn't make me laugh once can't get a good rating from me, thats all it is."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "wafflecopter-1",
        "review_rating": "1",
        "review_title": "A triple bogey",
        "review_detailed_main": "My mother and my brother told me this film was funny. I have considered leaving my home because of their taste in movies. This movie is absolutely terrible. Well, I take that back. I believe there was a moment when I cracked a smile at a joke. But the jokes were almost all targeted towards a braindead audience with no sense of humor, whatsoever. The accusations of racism got old, and it was just a painful ride all-around. If anything more terrible than this film has been created by man, I would love to see it. My grades in school actually plummeted after seeing this film, from the loss of brain cells."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "ioscream-1",
        "review_rating": "3",
        "review_title": "It's just not good.",
        "review_detailed_main": "While it doesn't deserve the top of the bottom 100, it was in fact, a bad movie. I saw this movie for the soul reason of saying I saw it, and it wasn't as bad as people were trying to make it, but it really was lackluster at it's peak. Despite any racist claims, and all the controversy over this movie, it has a weak plot, terrible jokes, and was a waste of money.\n\nAs far as it being racist, well, I wasn't offended, but both whites AND blacks could easily be offended because it plays into huge stereo-types of both races. At times I could hear \"We will overcome\" intertwined within the plot-line, and agreeable with several other comments on this movie, it was just unnecessary. To those who say this movie isn't a \"white/black thing\", watch the movie again: \".. this is not about who's at infractions. No no no. This here is about black and white...\" - Rev. J.J.Jackson played by Garrett Morris.\n\nI'm a fan of stupid humor, actually, I love movies like Borat, Hot Fuzz, Friday, Caddy Shack, et cetera, but this movie is just an insult to comedy. I didn't even mind the racial undertones, but give me a break, this movie was REALLY about a quick buck. That is all, and for that I give it my 9 dollars, and a rating of 3.. still not the worst movie I've seen.. it's just not good."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "e_barker",
        "review_rating": "1",
        "review_title": "Wow, what crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "A childish, annoying film that claims to be a comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "felsy41",
        "review_rating": "1",
        "review_title": "Its so bad its impressive",
        "review_detailed_main": "This movie is for poor people and should come out on VHS i don't think anyone with an IQ above 38 could watch more than 20 minutes of it it is pretty much the geo metro of movies it should be made illegal in this country and deported to the 3rd world where it will still more than likely end up in the garbage None of the actors are even good enough to be in commercials and the writer probably cant even read i could've made a better movie with a camcorder sitting in an empty field drunk by myself please don't watch this it will only encourage them and if they make a sequel i swear to god i will shoot myself in the foot which is more than fine by me as long as i don't have to watch it"
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "mikeleo5",
        "review_rating": "10",
        "review_title": "Greatest movie of all time ;)",
        "review_detailed_main": "I love this movie so much. Black movie with white people and its a comedy? How original is that? I know right black guy who play golf, went to a good republican school, got a degree, and played lacrosse, but is actually an OG from the hood. Dope man, dope. Original that's for sure. As a young black woman I found that this movie actually represents my people while other movies don't. In my local Communist Club I find we usually discuss how mainstream movies portray white people to be supreme yet I found that many of my comrades really enjoyed this film. I feel like Joe Biden would adore this movie, for really really. Deutschland won the world cup, go Hitler. Just kidding its booty."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "intelearts",
        "review_rating": "6",
        "review_title": "Stupid Fun! Not 'alf bad",
        "review_detailed_main": "Aaw, c'mon.. worst movie of all time? No way.\n\nAs a middle-aged white man in Northern Europe (Which I'm guessing is not the demographic for this group...) this is fine, dumb movie-making.\n\nIt's exactly what you'd expect: it looks and feels like a classic 80s comedy bought up to date. If you're in the mood for a movie that requires only laughing at nice set-ups, stupid physical comedy, and a little lesson learnt, romance and such, then this is it... lots of fun and very silly situations, with some good tunes, and nightclubs scenes, hit men, rappers, golfers in terrible outfits, polo players with ridiculous accents - short of imagination it ain't.\n\nIt's not literature, or drama, but it has lots more energy, fun, and silliness than most comedies and actually all works together really well...\n\nInstantly forgettable, but definitely enjoyable performances...\n\nWonderful nonsense and great if you're in the mood for ssomething dumb..."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "A great idea that is never lived up to",
        "review_detailed_main": "I do love comedy, even starting to appreciate the less subtle blend, but Who's Your Caddy? just didn't work. I mean it did have a great idea with a relevant theme that a lot of people I think would identify with, but here's the problem, Who's Your Caddy? never lives up to it.\n\nThe scenery is striking in a sense, but the editing in some scenes could've been tighter. The soundtrack was pleasant enough, but forgettable soon after.\n\nIf there are any redeeming qualities it is the performances of James Avery and Terry Crews who put a lot of effort into their characters. By all means it was lovely to see Jeffrey Jones again but sadly he doesn't have much to work with.\n\nI don't mind in-your-face humour, but the in-your-face humour came so fast and was so outrageous a lot of the time. Also the racism jokes got too much after a while. Not to mention, I detected some sexism too, notably I agree with the film showing a woman's bum being slapped and actually encouraging it.\n\nThe story is very predictable and unoriginal, if anything it often felt like it was ripping off Caddyshack, except Caddyshack's humour was much funnier, while the dialogue was weak and very demeaning. And did I mention that the film is riddled with stereotypes, I don't mind them when they are well incorporated but sadly they weren't here. I didn't care for any of the characters finding them either dull or annoying on the most part.\n\nI suppose though I would have cared for them more had the drama(a little too sappy for my tastes but a bit of a relief after a long time of forced and unfunny in-your-face humour) been introduced much earlier.\n\nAll in all, a mess of a movie that doesn't make anything of its concept. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "IonicBreezeMachine",
        "review_rating": "3",
        "review_title": "Lazy and derivative.",
        "review_detailed_main": "When rapper Christopher \"C-Note\" Hawkins (Big Boi) is denied membership into an exclusive Carolina Pines Country Club by the snobbish Cummings (Jeffrey Jones), C-Note takes measures to make himself a nuisance buying the neighboring property and forcing his way into the club where his lifestyle and image clash with the uptight rigid Carolina Pines establishment with Cummings using every means possible to get rid of C-Note.\n\nIn the series finale of the short lived Clerks: The Animated Series, there's a brief bit where Randall and Dante are pleased to find themselves in Caddyshack only to react in horror when text appears reading \"Caddyshack III: Caddies in da Hood. The shack is back......and BLACK\", now we know why they were scared. Released during the crowded July weekend in 2007 that also featured the debut of The Simpsons Movie, Who's Your Caddy limped out to the minimum number of theaters to qualify a \"wide release\" and opened at number 10 at the box office fading from theaters quickly. The movie received harsh reviews from critics with many pointing out the blatant similarities to Caddyshack. While the movie isn't unwatchable and probably doesn't deserve to be on the same tier as the Seltzerberg comedies where it currently stands, it's still a lazy pandering slog.\n\nThe movie begins right out of the gate with the hackneyed use of classical music only to be interrupted by loud rap as we follow C-Note's entourage to the country club. The movie has the subtlety and restraint of a battering ram with most jokes basically approached in the same manner as that opening with very telegraphed pay offs you've seen before including a reference to the Flight of the Valkyries scene from Apocalypse Now when we see C-Note's helicopter that's treated as a joke in and of itself. Big Boi as C-Note does not have any comedic aptitude as he's played overly stiff and reserved with not much comic energy. Jeffrey Jones is also way past his prime playing a poor man's Ted Knight and with his slow lumbering mannerisms he doesn't bring the needed energy to make his character funny. Faizon Love as Big Large is clearly intended to be this movie's equivalent of Bill Murray's Carl Spackler, but instead is closer in spirit to Dan Akyroyd's Tom Everett from Caddyshack II. Faizon basically has two go tos: 1) Make funny faces and 2) repeat dialogue spoken by other characters in silly voices. Faizon does this repeatedly throughout the movie and also often laughs at his own exchanges making him rather grating during the film's runtime.\n\nWho's Your Caddy? Is what it is: A rehash of Caddyshack filtered by way of The Cookout. It doesn't take the time to create characters or comic friction instead relying and bare basics culture clashes that movie mistakes for jokes as is and it's pretty shameless about just how much it crimps from Caddyshack down to a subplot with C-Note mentoring a caddy like Ty Webb. It's just a waste of time, but it wasn't painful like other comedies I've seen so it has that going for it."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "crazystoner12",
        "review_rating": "1",
        "review_title": "wow...",
        "review_detailed_main": "This movie made me think...Mick Partridge should go to Disney channel, where he would fit in with the 6th grade theater class actors,this movie needs to be removed from any possible place to buy it so it doesn't poison anymore innocent people. This movie was depressing,with the 90's sitcom jokes and the \"great\" acting i just don't know what to say i mean why? why would someone even think to produce such a piece of crap they could spend there money on i mean its not like they spent more than 20 dollars on it but they could of bought some food or maybe clothes..something worth it?or they could of possibly just not even made this movie and they could of saved the 200 people who are actually stupid enough to watch it"
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Like a low quality remake of \"Caddy Shack\"--why did they even make this in the first place?!",
        "review_detailed_main": "This film stars rapper Big Boi and his homies in a comedy that is, roughly, a reworking of the script from \"Caddy Shack\". However, instead of the head of the fancy country club president hating loud-mouthed Rodney Dangerfield, but Big Boi and his friends. As a result, the men decide to take revenge by buying the property adjoining the club and revoking the land leased to the club. So, the snooty club president (Jeffrey Jones) is forced to allow these rappers to join the club. As for the rapper posse, the behave pretty obnoxiously once they join the country club. You almost feel sorry for the club...except that they DID bring it on themselves.\n\nThere is a serious subplot--though it really seems like a real cliché. It seems that Big Boi's father had been a caddy at this same club years before but was fired. And, in a way, Big Boi's joining was because of this. Also, there is a HIGHLY clichéd final segment--right out of caddy shack concerning a foursome golf game...for EVERYTHING (uggh).\n\nWhile this is clearly a low-brow and rather stupid film, it is surprisingly good when you realize it's currently ranking on the IMDb \"Bottom 100\" list. It clearly isn't nearly bad enough to merit inclusion here, though I have noticed that several very watchable African-American films are also on the list (\"I Can DO Bad All By Myself\" and \"Phat Girlz\"). Could there perhaps be some bias against comedies where the stars are Black? I hope not.\n\nAs for the humor, it's mostly pretty low-brow. This is NOT a sophisticated comedy and it makes little pretense about that. I mean, think about it...when Jones cannot keep Big Boi and his friends out, he hires two midget assassins! And, there are lots of scenes where people get hit in the crotch. Need I say more?! Is it just me, or did you too think \"it's just golf...I don't get it!\"."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "a-twetman",
        "review_rating": "3",
        "review_title": "Not altogether bad, but when the audience ends up rooting for the \"bad\" guy, you are dong something wrong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "carl_2266",
        "review_rating": "",
        "review_title": "It's like Caddy Shack! Minus the humour, the likability, and anything resembling a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "WesleySaysHi",
        "review_rating": "4",
        "review_title": "This is not the worst movie !",
        "review_detailed_main": "A movie is bad when the actors are bad, directing is bad, screenplay is bad, etc. If everything is bad, then the movie deserves the worst mark. It's not the case of this movie. I liked the actors and their performance, although I hated the story.\n\nUnlike others who made a comment, I see this movie as a warning. Many people gave it a bad mark, but not for the right reasons. I value it at 4.5 on a scale of 10.\n\nWHO'S YOUR CADDY is a bad movie, but it's not the worst. Some time ago I saw IDIOCRACY and I think that both movies have something in common: both show where we are heading, idiots will prevail. This movie carries out the message even more convincing than IDIOCRACY. While IDIOCRACY is overrated, I think that WHO'S YOUR CADDY is underrated."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "narathip_87",
        "review_rating": "1",
        "review_title": "Black people playing golf? Outrageous!",
        "review_detailed_main": "Who's Your Caddy? is the sort of film Homer Simpson might watch, perhaps on a triple bill with Hail to the Chimp and The School of Hard Knockers."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "StevePulaski",
        "review_rating": "2",
        "review_title": "Why we should be tee'd off at this film",
        "review_detailed_main": "When pitching the idea for Who's Your Caddy?, the filmmakers most likely said \"let's remake Caddyshack, for next to nothing, and do it with an African-American cast.\" That's all this has to offer. The thing that made the 1980's Caddyshack so funny, so clever, and work well was because it was energized by a cast of comedic talent like Chevy Chase and Rodney Dangerfield. I'm surprised nobody ever said \"let's ask Chris Rock, Martin Lawrence, and Tracy Morgan to be in this.\" I'm known to like urban films. I thoroughly enjoyed the film Barbershop, and absolutely loved Boyz N The Hood, a drama film about three males growing up on the wrong side of the street. Even urban comedy films like Death at a Funeral, Don't Be a Menace To South Central While Drinking Your Juice in the Hood, and Friday I can't help but laugh at. They are well written, but they also have a mind to their madness. They aren't always just random shouting from the characters, with pointless jokes. They can be funny and have a big heart.\n\nWho's Your Caddy does nothing but try to \"start something.\" It tries to pull racial issues where none exist, and it tries to make white people the anti-Christ of the world. This was 2007. Now it's 2011. Racism exists, but it's now much more seldom than it once was. Instead of acting like this is the first time blacks and whites ever crossed paths, why don't they try and make it something different. Something, you know? More current and entertaining.\n\nThe story is a rapper nicknamed C-Note (Patton) is forbidden a membership to the prestigious golf-club that is Carolina Pines Country Club. So he purchases land that is part of the course, and winds up bribing his way into a membership earned from the club's strict owner (Jones). The rest of the film is just senseless humor about horses eating marijuana, farting, and racism. You can see this comedy comes from a very mature nature.\n\nOne of my favorite black comedians, Faizon Love, makes an appearance, but he thinks that being funny means shouting all his lines and repeating everything everyone else says just adding \"the n word.\" Andy Milonakis also shows up playing a teenager, but if you know the truth that Milonakis is in his mid-thirties, and he only has the voice and appearance of a teenager because of a condition that stunts his growth, the joke is ruined. Now if I went into this under the impression that Milonakis was around seventeen, done some homework, and learned that he was in fact in his thirties, than the joke is on me. But since I didn't, the joke is on the movie for thinking I'm that out of touch.\n\nThe humor also derives from gangster rap and other things not currently present today. The film passes itself off as \"just another 2007 comedy.\" Not a flashback one. Who's Your Caddy? tries to be current, but at the same time, it is so dated and so out of touch with today's society that if you're laughing at the movie, it's because it doesn't truly know what it is.\n\nThe biggest problem is just the subject matter and immaturity brought to light in this film. It disgusts me that this comedy is making humor out of racism, a very demeaning and vile thing that still exists today. It makes white people out to be the enemy. They try to say \"Golf is a white man's sport and they don't allow black people.\" Stop and think - one of the biggest golfers today is black. And if you go to any golf course, I live right by one, you'll see black people play it too. Sure the sport is dominated by whites, but blacks are just as welcome. There are no racial issues here. So why bring them up as if their were? Who's Your Caddy? says a lot about the world today. It says that white people are the enemy, they are used in this film to be awkward, and that the makers try to expose it in a comedy film with no redeeming qualities. Maybe this could've been a documentary, instead of a comedy if it wanted to focus on racial issues in the sport of golf. If that's the case, pick a genre.\n\nStarring: Antwan \"Big Boi\" Patton, Jeffery Jones, James L. Avery, Tony Cox, Tamala Jones, Jenifer Lewis, Andy Milonakis, Sherri Shepperd, Tony Cox, and Lil Wayne. Directed by: Don Michael Paul."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "themuffin-1",
        "review_rating": "7",
        "review_title": "Not Deserving of the Awful Rating",
        "review_detailed_main": "First of all, the only reason I even bothered watching this movie was because I saw it rated so low and thought to myself, \"It can't be that bad can it?\" After watching this movie, the answer was a resounding no.\n\nLet's get the obvious out of the way. 1.\"This movie is a ripoff of Caddyshack\" You don't need to even watch the movie to understand this. I have trouble believing that anyone who watched this movie didn't expect it to be heavily influenced by Caddyshack 2. \"The acting is horrible.\" I've seen much, much worse acting. Especially because the majority of the actors in this movie were rappers, and they were barely acting at all. 3. \"The script is horrible\" Once again...the movie is called Who's Your Caddy, its cast is made of rappers and Jeff Jones. It's ridiculous to go into this movie expecting a Godfather like script.\n\nThe good: I love great movies. I can't stress enough how much I love those great cult movies like Eraserhead, all those great independent movies like Brick and the such. However, throughout this movie, I couldn't stop laughing. I think I even laughed at this movie more than I laughed at Knocked Up. There are 2 fundamental ways to enjoy this movie. 1: Be stupid enough to thing the jokes were good. or 2. Realize just how bad these jokes are, and laugh at the script not with it. Some of the quotes in this movie are just so misplaced and unnecessary that it's hilarious. Maybe it's all of those racial based jokes that are so horrible that they are amazing.\n\nI hope you all have heard of the movie The Room. I think it takes the same state of mind to watch this movie. If you watch Tommy Wiseau's \"The Room\" with the same state of mind the people who gave this movie a one did, you'd probably vomit. But, you can't. I can't stress enough how necessary it is to watch this movie as if it were an independent movie.\n\nThis movie is horrible, and that's what makes it so great. Every year there are tons of mediocre 5-6 star movies that invoke nothing in people. Once every few years though, we get a gem like this. A movie so bad that we have to watch it in a totally different way in order to enjoy. Viewers, I ask you, embrace this train wreck and brace yourself for the turbulence."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "cmmedland",
        "review_rating": "3",
        "review_title": "Fart jokes? A you serious?",
        "review_detailed_main": "There were actually 2 or 3 times that I laughed but the were ruined by the number of times that the rest of the attempted humor and just plain stupid storyline annoyed me. It has a few actors that I like but the bad writing wouldn't allow them to save this dumpster fire."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "More like Who's Going to save this Awful Movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Newsense",
        "review_rating": "1",
        "review_title": "Who's your Caddyshack",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Buddy-51",
        "review_rating": "4",
        "review_title": "mediocre comedy but great fall foliage",
        "review_detailed_main": "In \"Who's Your Caddy?,\" a bad-ass rap star by the name of C-Note (Big Boi) attempts to gain entree to an East Coast country club so swanky and exclusive that it won't even admit Bill Clinton in as a member.\n\nAs a fish-out-of-water and stick-it-to-the-elitists culture-clash comedy, \"Who's Your Caddy?\" is neither particularly original nor particularly funny, but it's a harmless enough trifle, I suppose, and Jeffrey Jones is a real hoot as the put-upon board president who does everything he can to sabotage C-Note's efforts.\n\nFrankly, though, when all is said and done, it's the gorgeous autumnal scenery that's the real star of the film."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "A decent comedy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "theasterisk",
        "review_rating": "1",
        "review_title": "The most racist movie since Birth of a Nation?",
        "review_detailed_main": "Everyone, but especially the black people, who were involved in this movie should be ashamed. It equates boorish behavior with blackness."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "Crazy Ian",
        "review_rating": "4",
        "review_title": "It's not so bad?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "jsgreene55-211-432422",
        "review_rating": "2",
        "review_title": "Out of bounds",
        "review_detailed_main": "Wow this is one terrible movie. A poor attempt at a remake of Caddyshack with a mostly black cast. All you have to know about this movie is it stars Jeffery \"kiddie porn\" Jones and was produced by the equally disgusting Harvey Weinstein. I can't fault the cast as they try to do their best with an awful script, but sone of the jokes are below grade school level. The number of well know black actors who appear are wasted in this travesty. This is one movie that should be avoided as much as Jones and Weinstein."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "jdobson72",
        "review_rating": "2",
        "review_title": "Soul Shack",
        "review_detailed_main": "I think I've seen this movie before - wasn't it called \"Soul Plane\" and \"Caddyshack\"? It's moderately entertaining, but it is the same old tired garbage Hollywood has been churning out for the last few years. Are they really that afraid of trying a new idea? Do they have any idea how many of us are waiting to drop some cash for an original movie? The other extra crappy thing about this movie is that it is supposedly about a hip-hop mogul trying to break into a country club, and although they make plenty of allusions to the staples of hip-hop (naked women and x-rated lyrics), this movie is cleaner than a Disney special from Walmart. Why?? Save your money and just rent the two movies that this is based on - you'll probably enjoy them more..."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "dbborroughs",
        "review_rating": "8",
        "review_title": "Sue me I liked it",
        "review_detailed_main": "A really good (no seriously its good) story about a rapper who wants to join a country club but its snotty board (headed by Jeffrey Jones (Ferris Beuller's nemesis) refuse to let him in. Buying a property close to the 17th hole he leverages it into membership and well what happens is the movie. Neither cartoony nor really over the top (okay just a bit) this is a movie where everyone (mostly)behaves like real people. Actually one of the key points is that the hero is a better person then the jerks running the country club. Clearly made by film makers who didn't work for \"the man\" who would have the rappers as gangsters or clowns, this is a nice comedy that makes one wonder who was in the board room the day this was green lit since its so atypical Hollywood on almost every level. recommended on cable if not as a rental."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "EclecticFilmHero",
        "review_rating": "6",
        "review_title": "Very Watchable Comedy - much better than expected and lots of fun!",
        "review_detailed_main": "\"Who's Your Caddy?\" is fun, surprisingly friendly in tone, and ENTERTAINING.\n\nLet me make clear: the plot is threadbare, character motivation is sketchy and you get the feeling that the film was put together in a 'Hey, that part's funny - let's put that in!' manner. However, anyone too harshly critical of this movie is not enjoying it on its intended merits.\n\nThe acting from the players is actually pretty good and the pacing clips along so you are never bored watching it. Some films you wish you could fast forward to the end so you could leave the theatre. I find this with many films rated above 6 stars. But \"Caddy\", though never intended to be 'serious' comedy, is a lot of fun and a pleasant diversion. It is much, much better than should be rightfully expected from one of its genre.\n\nThere are vulgarities, but not uncomfortably so. (However, I would not at all take children.)\n\nThe racial theme I took more as an indictment on class differences, and it was not nearly as one-sided as you might expect.\n\nThere are quite a few laugh-out-loud moments - even more than are in the trailer. The cast is surprisingly good, especially Jeffrey Jones at his smarmy best.\n\nIn short, the rating \"Caddy\" is getting from many users I do not personally understand because I consider a movie that keeps me entertained and is pleasant to watch a winner. Do I think it a great movie? - no one would. But is it unpretentious fun? - absolutely. Give \"Caddy\" a chance - you should be pleasantly surprised at its quick pace, its genial tone and its fun laughs."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "omilCCTK",
        "review_rating": "1",
        "review_title": "genius",
        "review_detailed_main": "i can understand the issues people seem to have had (based on the less that complimentary ratings...) with this film, its hardly a work of art, and the basic theme of racial stereotyping is pretty much the basis of every joke made... etc etc... but with the assumption that this film was made tongue in cheek, it is really funny. from someone that found a load of ed-woods films pretty entertaining, i found this hilarious... if you're a fan of pretty badly made films that somehow remain funny, get it and watch it with some other people that have a sense of humour... only giving it a one star rating so we can keep it at the bottom, and thus in the spotlight..."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "farlopasboxke",
        "review_rating": "5",
        "review_title": "You think this is bad? Then you haven't seen a lot of movies!!!!",
        "review_detailed_main": "Man what is everyone's problem with this movie??? Why would every movie have to be \"correct\"... It's just dumb brainless fun! And there is no harm in that! It can be funny... I'm not saying it's a good movie, but I've seen A lot worse and even they get better scores on this site! I really don't understand how you people want to criticize everything because of the racial stereotypes and some other stuff that could be offending... *µù^$ùµ that! I can name tons of movies with (again) A lot more offending material in any kind of way you want! But hey... Looking at the score I guess it's just me lol!\n\nAll I'm saying is this movie doesn't deserve this and all those with there lame comments should really watch some more movies, so they'll see and understand what else is out there before they try to be a \"critic\"... I sure am not, but i know enough to know that this is just wrong!\n\nbtw I'm a white 24y old European... Just so the hillbillies don't think this is a... Well you know if you got some brains! ;)"
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "genewitch",
        "review_rating": "4",
        "review_title": "Not as bad as all that",
        "review_detailed_main": "i don't remember why i got this movie, but i still have it. Watched it with my girlfriend, and we got all the way through without fast forwarding, which is a common occurrence at this household.\n\nThe premise is probably exactly the same as Caddyshack (no one wants you here!), but this movie was funny in the way that a lot of viral videos are funny... you won't be quoting it to friends, but you might want to share it with some while drinking heavily.\n\nIt's not TERRIBLE. it's not good. if you can get away with renting it when you're home with the flu, you might want to grab it. There are recognizable actors/actresses in it, as well. All in all it's not in the crap league of \"date movie\" et al - it's much better than those. But it's no Caddyshack."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "cekadah",
        "review_rating": "3",
        "review_title": "funny start then gets sloppy half way thru",
        "review_detailed_main": "yes there are some good laughs in this silly flick. but again the plot line and reactions of the main characters have 'been done' so many times before you can write it down before it happens and take bets on it - you'll win!\n\nfans of Andy Milonakis and Fazion Love will be happy because those two basically are the the best parts of the movie. actually the only parts of the movie with good dumb laughs!\n\nbut do those two make the movie worth watching - yes! only if you've got the time and mindset to take in a completely stoopid story and somebody else rents the DVD."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "n4915",
        "review_rating": "1",
        "review_title": "Hummmm, just like Gone with the Wind",
        "review_detailed_main": "My favorite movies always use senseless fart humor! If they can make \"More Dum and Dummer\", I can't wait for \"Caddy 2, Revenge of the Golf Fairway Gophers!\". It will be a cult classic.\n\nPS: Sorry, I was a paid movie extra so I had to be nice. I can't be bought, but I can be rented if the price is right.\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX By submitting this comment you are agreeing to the terms laid out in our Copyright Statement. Your submission must be your own original work. Your comments will normally be posted on the site within 2-3 business days. Comments that do not meet the guidelines will not be posted. Please write in English only. HTML or boards mark-up is not supported though paragraph breaks will be inserted if you leave a blank line between paragraph."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "tjdenver-84935",
        "review_rating": "4",
        "review_title": "Mediocrely funny",
        "review_detailed_main": "It's kind of funny. Which isn't really saying much when it comes to a movie. I watched this with a Brooklyn-born friend of mine, however, and he actually found it pretty funny. He liked the humor and could relate to it. I would say it's funny enough to make it to the ending, but not really funny enough to own or watch repeatedly. If you find yourself watching it for some reason though, it won't be the worst hour and a half of your life."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "tjaj_73",
        "review_rating": "9",
        "review_title": "Get ready to hurt yourself laughing",
        "review_detailed_main": "I laughed all the way through this movie! Great plot, hilarious characters. The comedic timing was there. Reminded me a lot of a Wayans Bros production. You could tell these actors had a great time making this movie. I would have loved to have spent a day on this set. Terry Crews is one of my favorite comedic actors...my only complaint about the movie would be there wasn't enough of him in it. I'm very interested in seeing what other movies Our Stories Films comes out with. Nice to see an Urban comedy produced by people of color. Not full of all the stereotyped roles you see in a lot of urban comedies. This is a well written, produced, directed and acted piece of work. Great soundtrack, too."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "jv6381-658-511193",
        "review_rating": "7",
        "review_title": "Dorky but Fun",
        "review_detailed_main": "I am a fan of low-brow movies. Was it an award-winning movie? No. Would it raise social awareness on any social issues? No. Was it funny? Yes. Was the humor low-brow? Absolutely Yeah, the jokes were old but still fun. Tamala Jones was smoking hot and I enjoy her role on Castle now. Anton \"Big Boi\" showed his public image as a rap producer but was in reality a nice guy looking for love. The banter between him and Tamala Jones was sweet and funny. Faizon Love and the rest of his crew was a riot. Sherry Shephard was a hoot. There were some parts not good. The kid being inside the strip club was definitely part of the movie in poor taste. But otherwise I liked it. Is it something for everyone? No but I have talked to a lot of people who liked it. Many of the critics on this website said that it didn't raise social issues like racism and was mean-spirited. I say, who cares? If I want social issues, I'll see \"The Blind Side\". This is what I like when I want mindless fun."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "SmellyMob",
        "review_rating": "10",
        "review_title": "A well put together sports-comedy, packed with great cameos",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "neomatrixjc",
        "review_rating": "7",
        "review_title": "Great Movie",
        "review_detailed_main": "This movie was a very good movie. This movie is what a comedy is supposed to be about. Sure you had stereotypical suggestions in this movie. But it is a movie (meant to entertain ones time). The movie manages to involve an issue on racism, but erases it on the whole. The movie is definably a adult rated comedy, but kids could enjoy it too. This is a great comedy to watch when everybody is having a good time and wishes to enjoy a good comedy. I thoroughly enjoyed the movie and had my laughs out of it. Its nice to see that good comedies still exist. The cast did a good job in acting, you felt like you could understand each characters role in the film. And on top they managed to make a comedy about golf and made it work.\n\nI give this movie a seven out of 10, a seven for the acting, story line, and character development. The only parts that kept me giving a 10 is that some scenes in the movie could of been taking out of the movie. Should not put more comedy than is needed for a comedy movie."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "nsmalli",
        "review_rating": "8",
        "review_title": "This film needs a redo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "jadamsmith-83919",
        "review_rating": "7",
        "review_title": "I liked the movie!",
        "review_detailed_main": "I'm not an white old fart like most of these reviewers. It's worth watching. Hopefully in the future it can teach people how things used to be."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "nathaniel-james",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "phantomwarlord452",
        "review_rating": "7",
        "review_title": "It's not THAT bad.",
        "review_detailed_main": "I'll be the first to say this isn't a good movie, but it is a great time if you enjoy black stereotype comedy. There are plenty of parts that are hard to sit through, I won't try and convince anyone that it's not. I just don't think it deserves such a low rating."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "ronaldshand",
        "review_rating": "8",
        "review_title": "Better than \"next Friday\"",
        "review_detailed_main": "This film was hilarious. It's supposed to be a stupid American comedy with racial stereotypes, but it's not as bad as an ice-cube film. hilarious commentary by a guy who looks like a taller version of little john and fat man who's always asking \"did he just say *another word for an African person\" whenever someone is being discretely racist. it also has uncle Phil from the fresh prince of Bel-air in, although he is hardly recognisable.\n\n\"tdagpalusky\" - you need to shut the hell up and use your highly superior taste to comment on the emotional complexities which you have observed watching the relationship unfolding in broke-back mountain, before crying yourself to sleep because heath ledger is gone.\n\nthe film is funny and isn't filled with the typical, idiotic black comedies with people falling down or being late for work or what-ever it is they think is funny. thats you ice-cube if your reading this."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "marymckell",
        "review_rating": "10",
        "review_title": "great movie lots of fun",
        "review_detailed_main": "this movie is what movies should be, funny entertaining, and good for the soul. It made me laugh, some people need to get a life, how can they think that this was not entertainment, have they forgotten why we go to the movies, it's to be entertained, not to be political, or racial. I think they need to take a look at themselves and wonder why they didn't like this movie. This was a well cast movie, the location was perfect, and the music was great, I loved the way the story came together it all tied in so well. I expect this movie to be a sleeper and come into it's own in a few weeks. The more people see this movie the more it will be understood and liked. I have seen it twice and loved it more the second time."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "tonethetyger",
        "review_rating": "10",
        "review_title": "Great Movie! Funny!",
        "review_detailed_main": "I thought the movie was great. Those of you who made all of those negative comments; it seems that you are upset that, for once, the black people were smarter & wittier than the white people in the movie. I know that there are those few remaining elements out there that can't grasp that idea!\n\nI think it's great for my young black adults to see that you don't have to start at the bottom all of the time. That they can walk into any establishment with there head held high and be a prospect rather than a suspect.\n\nThrough out the entire movie, the young black man did not have to drop his head & \"bow down\" to the establishment. Instead, he used intelligence, the resources around him, and persistence to reach his goal.\n\nCan't we have just one \"feel good\" movie? Must we always struggle & be tormented throughout the movie in order to have a winning outcome?\n\nLet list a few movies with similar humor: Caddy Shack, Blazing Saddles, Airplane!, Ghostbusters, Groundhog Day, Nat. Lampoon's Animal House, Big, Shampoo, Abbott & Costello Meet Frankenstein, Mrs. Doubtfire, City Slickers, Beetlejuice, The Jerk, Bull Durham, Good Morning,Vietnam,\n\nI could go on & on! Bet you thought those were funny! Why,then, would you single out this movie? Is it because you can't relate to the characters because the ethnicity is not like your own? Think about that!"
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "bigraytizzle",
        "review_rating": "10",
        "review_title": "Whos your caddy",
        "review_detailed_main": "OK people you may look at this movie and think it is udder crap. well your wrong this movie is freaking hilarious i was laughing through most of the movie. It is just hilarious. I recommend seeing it. Big Boi and the crew just make this movie hilarious and just wow. People if your dissing this movie before it came out. just stop because you are just wasting your time. it is probably one of the funniest movies of the summer if not the funniest. the simpsons and rush hour are the only 2 i see as being possibly funnier than this. and yes i know rush hour 3 has yet to come out. i have yet to see simpsons. see this movie you will die laughing."
    },
    {
        "movie_id": "tt0785077",
        "movie_name": "Who's Your Caddy?",
        "movie_rating": "2.3",
        "review_username": "charles_kyte",
        "review_rating": "10",
        "review_title": "Win one for the \"Gas House Gang\"",
        "review_detailed_main": "In this satirical and riotous comedy, Christopher 'C-Note' Watkins's gas house gang meets a highbrowed set at the Carolina Pines Country Club for a showdown to determine 'who holds sway over the points.' Reminiscent of the depiction of grizzly figures from baseball's yore that fought against clubhouse exclusion from the major leagues, ill-conceived stereotypes, public ostracism, and misrepresentation by the press, this movie packs a wallop. It is a satirical take on The Greatest Game Ever Played (2005), Gangs of New York (2002), Hoodlum (1997), Caddyshack (1980), The Legend of Bagger Vance (2000), Bringing Down the House (2003), and Baseball Bugs (Bunny Bunny,1946) all rolled into one. C-Note (Big Boi) and his hilarious, yet unsavory, crew pit wit and charisma against an exclusive and snobbish Carolina Pines board in an attempt to gain entrance into the highly selective golf and polo club. The team's colorful appearance and rough-and-tumble tactics are quite the eye-catcher. America's favorite pastime was never this entertaining!"
    }
]