[
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "DanB-4",
        "review_rating": "5",
        "review_title": "Not Enough Redeeming Qualities",
        "review_detailed_main": "Let's make a list of the major flaws in this movie.\n\n1. Jennifer Lopez is one of, if not, the most famous Latina entertainers in the world. Why make her Italian?\n\n2. Justin Chambers is horrible as the love forlorn Italian immigrant. His accent is so bad is ruins his otherwise likable character.\n\n3. Lopez and Matthew McConaughey generate no chemistry. I just did not care what happened to them. I hoped that Lopez would go for the other guy.\n\n4. This movie is an excuse to promote Lopez songs.\n\nMovies in which a bright and intelligent woman falls for a spineless letch are starting to wear on me. I just could not believe that a character as strong a Lopez's would fall for such a weiner.\n\nThat said, Brigette Wilson and Alex Rocco are great, and there are some fun moments in this film. But please - did the makers of this film watch the scene where Lopez takes a bottle of \"solvent\" out of her purse to remove a stone penis that his glued to McConaugehy's hand? Good thing she had that solvent! ** out of ****."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "triple8",
        "review_rating": "6",
        "review_title": "It's cute BUT....",
        "review_detailed_main": "This is a JLO romantic comedy. Make no mistake this movie defines the term \"by the numbers\". It is predictable to a tee, has the typical \"formula\" plot and sticks to it rigorously. BUT then again-if your looking for a piece of predictable fluff.... you could do worse.\n\nThis maybe predictable but it IS at times mildly entertaining. At lease this is watchable and kind of cute-Although you never believe for a moment that Jennifer Lopez character is anyone other then JLO at least the movie doesn't drag as with a lot of movies of this \"formula genre\" as I like to call them. It's an entertaining(mildly) way to pass an hour or two-I'd give this 6 out of 10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mospel",
        "review_rating": "4",
        "review_title": "This movie is bad, but it is not THAT bad. Quite mediocre.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "funkadel",
        "review_rating": "",
        "review_title": "Does Jennifer Lopez ever do wrong?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "GMeanie",
        "review_rating": "1",
        "review_title": "Brutal and excruciating",
        "review_detailed_main": "The only thing more baffling than how movies this bad could ever be made is how movies this bad could go to #1 in the box office. I despair for humanity at times. The Wedding Planner features a rehashed and unoriginal plot, poor acting, no funny moments, and a ridiculous scene where Jennifer Lopez is prepared to risk getting flattened by a runaway dumpster in order to pull her shoe out of a hole in the street. riiiiiight!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "gastonm",
        "review_rating": "7",
        "review_title": "Easy on the eyes",
        "review_detailed_main": "Jennifer Lopez (who knew she could act?) plays the consummate professional wedding planner -- she's the best in the business and arranges all the most elegant affairs, but she herself hasn't had a date in six years. She gets into a situation and her life is saved by Matthew McConaughey (he played Jodie Foster's fling, in \"Contact\"), and they end up on the verge of falling in love, when they both discover she's the wedding planner for his upcoming wedding to somebody else. Light-hearted and well-done, it's a familiar story with a few twists of its own, and keeps you interested throughout. Basically a nice, fun story that's done well."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "reinx",
        "review_rating": "1",
        "review_title": "Cant give it negative",
        "review_detailed_main": "Seriously, this movie gets about a negative 20. Jennifer Lopez has always been a mystery to me, why does she do acting? She's obviously awful at it. The characters are pretty flat, the story is painfully predictable and upsettingly trite."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mattymatt4ever",
        "review_rating": "7",
        "review_title": "A flawed, mildly formulaic but likable and charming romantic comedy that will probably keep you smiling",
        "review_detailed_main": "True, \"The Wedding Planner\" does have its share of cinematic conceits. Just watching the previews, you pretty much have a good idea what's going to happen in the end. But unlike many romantic comedies, this is not predictable by the minute. The characters are likable and charming, and you get quite engrossed in them. The actors are charming as well. Jennifer Lopez and Matthew McCoughnahey are equally good and have a fine chemistry. The scenes, in general, are handled in a sweet-natured fashion without becoming nauseatingly sentimental. The opening scene is very original and made me laugh. In the first scene, we get an idea of how Mary (Lopez) plans her weddings, staging them like a secret service operation, strapping wires to the bride and groom, feeding them suggestions as they walk down the aisle and making sure all the guests are in order pronto. There are certain moments of \"sitcom stupidity.\" There's a scene where Steve (McCoughnahey) gets his hand stuck to a statue's privates. The comedy was badly timed and the scene appeared quite lame. A similar joke was used in Rodney Dangerfield's \"Meet Wally Sparks,\" but was done in a much more structured manner and spawned hilarious results. About the member of the cast who I felt was a little hammy was Alex Rocco as Mary's Sicilian father. His accent comes and goes, and in some scenes he struggles so much with it that he starts talking like someone with down syndrome. Fred Willard has a short but funny, scene-stealing role (when hasn't Willard stolen the show?) as a ballroom dance teacher. There are some moments in the plot that are forced and created simply to move the film along, so we can quickly arrive at the \"juicy climax.\" One of the subplots involves Mary's father trying to fix his daughter up with this silly, thick-accented Sicilian cassanova. He wants her to get married to him, but she refuses. Throughout the film, they don't seem to have any more than a friendly bond. Yet later in the film, he makes a sweet proposal and Mary actually agrees to marry him. The ending is far-fetched and over-the-top, and though I can't discuss it you've probably seen this ending before. One thing I have to credit the writers for is refusing to make Fran (Bridgette Wilson-Sampras--Man, is she sooooo beautiful!!!) a total b**ch, like they would in most films of a similiar plot. The way the formula goes is the guy's engaged this girl, while another girl captures his heart. But the girl he's engaged to is usually so unlikable that you wonder why he wanted to marry her in the first place. I'm glad they didn't take that cheap route. Even Fran has a certain charm to her character. The charming characters and the charming actors are really what makes this movie worth seeing. Yes, it's pretty much (though less than usual) a formula romantic comedy, but a likable one because of the way we're captured by the people on screen. This is not a great film, it has its dull moments, it has its silly moments, but it's often a fun and pleasant movie experience. You'll fall in love with \"The Wedding Planner.\"\n\nMy score: 7 (out of 10)"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "Good starts but then Massimo",
        "review_detailed_main": "Mary Fiore (Jennifer Lopez) is an ace wedding planner but horrible at love. Penny (Judy Greer) is her funny assistant-best friend combo. Steve Edison (Matthew McConaughey) is the knight in shining armor literally saving her life time after time. Fran Donolly (Bridgette Wilson-Sampras) is his fiancée. All the parts are set up for an enjoyable functional rom-com. They only need to find a better match for Fran and the movie basically writes itself.\n\nOnly problem we're introduced to Massimo (Justin Chambers). I'm willing to let go of the horrible acting from the miscast Chambers. It's an annoying Italian stereotype that the super white bread Chambers can't pull off. But why she wouldn't tell the truth right away is beyond me. What's the plan? More importantly why the plan? If she's trying to make Edison jealous, Massimo would be the last man to do it. It makes no sense. It's such a simple movie, and they screw it up so badly."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "chrisbrown6453",
        "review_rating": "7",
        "review_title": "Only of your girlfriend really wants to see it.",
        "review_detailed_main": "The Wedding Planner tells an identifiable story about falling in love and failing to recognize it.\n\nThe Wedding Planner stars Jennifer Lopez as Mary Fiore, a hardworking, beautiful, single woman of Italian descent, who has made a reputable career as a wedding planner. Fully dedicated to her work, Mary successfully coordinates all the details of her wealthy clients' weddings. She even acts as a kind of therapist, transmitting to the brides and grooms-to-be the optimism that relieves them of their \"second-thoughts\", and that allows them to fulfill their true dreams of marrying. Yet one day, a literal \"faux pas\" turns Mary's orderly life upside-down: she walks across a street and gets her shoe stuck in a manhole. Just then, a dumpster menacingly rolls down the steep San Francisco street, towards her. Noticing that the dumpster is rapidly gaining speed, a young man rushes to help Mary out of her dilemma. The two are instantly enveloped by the rush of the moment, falling victims to love at first sight. Soon, however, fate shows its cruel side, proving that the handsome Steve Edison (Mathew McConaughey) is tied to Fran Donelly (Bridgette Wilson-Sampras), one of Mary's most promising clients. In the meantime Salvatore (Alex Rocco), Mary's concerned father, tries to inspire her to consider her childhood inamorato Massimo (Justin Chambers), who just arrived from Italy. Torn between acting sensibly and fulfilling her long suppressed dreams of marrying, Mary must first determine which love is the one destined for her.\n\nThe Wedding Planner exploits the physical beauty of its star (Lopez) and emphasizes her character's style and professionalism at work, while defining her personality as that of a free-spirited, down-to-earth person who enjoys dancing and playing Bingo with her father and his elderly friends. Similarly, her costar (McConaughey) is depicted as a good-looking, sensitive man who enjoys his work as a pediatrician. However, the film's secondary characters, especially Mary's family, friends and coworkers, are sketchy and mostly inconsequential. Thus, The Wedding Planner creates a story that solely revolves around the coupling of its two main characters; a choice which makes The Wedding Planner's plot extremely predictable, although at times amusing. While the plot complications are limited to the unavailability of either of the two main characters (where Steve is unable to abandon his prior commitments and Mary is ready to take up new ones), The Wedding Planner is most enjoyable when it creates romantic settings for its lovesick characters."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "TylerDurden_FC",
        "review_rating": "8",
        "review_title": "What is everyone complaining about?",
        "review_detailed_main": "I've owned this movie for a while, and only needed to see it once before deciding to run to the store to buy it. As a matter of fact, I'm watching it right now, but I got on here and looked it up because I wanted to see what other movies the writer had written (unfortunately---it's the only one.) After looking at the ratings and comments I had to voice my own opinion.\n\n\"The Wedding Planner\" has everything you could ask from a romantic comedy. Predictability is always a factor, but come on! Do we really watch these types of movies expecting to be surprised at the ending? This film is quirky; all the actors and actresses don't miss a beat and they keep it real. No matter how many times I watch it, I still find something to laugh or smile at.\n\nI haven't yet met a MAN that likes this movie, but if you're a girl that wants something sweet, funny, entertaining, and the \"romantic dream\"..... in other words: a flick you watch with a pint of ice cream ( =P ) then this is the one for you.\n\nThe directing is great, the dialog is entertaining, the acting is enjoyable, the movie over-all is fantastic. It's just sweet...even my mom likes it! O_O\n\nHonestly, stop judging the movie like you're some kind of almighty critic, and watch it for what it is. If you don't like the genre, then pick something else to watch ^_^ Me? I'll stick with \"The Wedding Planner\"."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "napierslogs",
        "review_rating": "7",
        "review_title": "\"The Wedding Planner\" is lacking in comedy but has tangible romance",
        "review_detailed_main": "\"The Wedding Planner\" is just another romantic comedy, and just another one starring Jennifer Lopez, and just another one starring Matthew McConaughey. As I have said before, Jennifer Lopez has such a beautiful feminine figure that I would prefer to see her as the romantic lead as opposed to most other Hollywood actresses working today. McConaughey is of course sexy with a laid-back charm, but that's just who he is.\n\nThis particular romantic comedy isn't all that funny, but the writers did seem to know which elements were necessary and included them. We find out McConaughey's secret the same time Lopez does, which is good because it helps us identify with our main heroine and we don't have to sit uncomfortably before the characters do. They also gave us another man - he's supposed to provide comic relief, and I did at least enjoy him. We also need to dislike the fiancée. Cast Bridgette Wilson and make her a stuck-up snob, so that is easily accomplished.\n\nOne thing that I found that \"The Wedding Planner\" has over lesser romantic comedies, is genuine chemistry between the leads. Although it's certainly lacking in the comedy, I found the romance tangible."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jiraf",
        "review_rating": "1",
        "review_title": "goes beyond my worst expectation.",
        "review_detailed_main": "The whole plot seems forced, and things that are not funny are just crammed into this movie by the truckload. Jennifer lopez was rushing her lipstick application when she heard Matthew McConaughey's voice coming. How is that supposed to be funny ? Yet the director seems to think it's funny.\n\nThere are many things that seems irrelevant, and stupid.\n\nI definitely recommend to AVOID this movie at all cost."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "javaman-7",
        "review_rating": "",
        "review_title": "See two of today's good looking stars looking good, or see \"It Happened One Night.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "wesperkins",
        "review_rating": "2",
        "review_title": "Breaking up a marriage is ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Kieran_Oneill",
        "review_rating": "7",
        "review_title": "underrated",
        "review_detailed_main": "I thought the acting was well done the entire movie except for Massimo which I thought was a little racy but other than that good, I like the ending a lot, other than it being a little Hollywood, not much to say it's a good uplifting movie"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Aussie Stud",
        "review_rating": "1",
        "review_title": "So what will it be Jennifer? Singing or acting?",
        "review_detailed_main": "Jennifer Lopez has gotten herself into quite a quandry of sorts here. Only as of recently has her musical career exploded internationally, her focus on acting seems to be diverted elsewhere as her last few movies have been quite awful (ie. \"ANGEL EYES\", \"U-TURN\"). Before her musical career took off, her movie roles were quite commendable (ie. \"OUT OF SIGHT\", \"SELENA\"). For Jennifer, it is unfortunate that I feel she should have to choose between one career or the other because I don't think she can handle both. She is a great singer and she can be a great actress but it is apparent that she can't manage both at the same time. This mess of a movie is supposed to showcase her 'comedic' talents yet displays the worst side of her one-dimensional acting abilities.\n\nThe trailers for this movie depicted \"THE WEDDING PLANNER\" to be a few hours of enjoyable romantic light fluff that anyone could enjoy on a lazy Saturday afternoon. Unfortunately, I turned this movie off half way through after my nerves finally gave in.\n\nYes, Jennifer Lopez portrays a successful wedding planner who is successful in her career but apparently unlucky in love. That is of course until she has a 'run-in' with her knight in shining armor (dryly portrayed by Matthew McConaughey in a 'phone-in' role). The only problem here is that Matthew is getting married to one of her new clients and she may very well be doomed to a loveless life married to some loser from high school who used to pick on her. It's a no-brainer in figuring out how this movie will end.\n\nYes, movies like \"SLEEPLESS IN SEATTLE\", \"WHILE YOU WERE SLEEPING\" and \"FRENCH KISS\" were enjoyable romantic comedies. We all knew how they were going to end yet we enjoyed the two hour journey that we had to take in order to see the grand finale. Unfortunately for \"THE WEDDING PLANNER\", the two hours are a rocky mess that tries to pair two unlikely characters with no chemistry whatsoever backed by a sound-track filled with Jennifer's own songs. The only thing I really enjoyed watching was the San Francisco scenery (how can one not love that city?)\n\nUsually when the grand finale in these romantic films happen, you generally leave the theater feeling warm and fuzzy inside or at least basically satisfied for the plot outcome of the characters. When \"THE WEDDING PLANNER\" finished, I could only think \"Good, I'm glad this garbage is over.\"\n\nFor a generic romantic comedy, \"THE WEDDING PLANNER\" fails to deliver. It could have worked had the characters shared at least a little bit of chemistry, but I didn't even pick up that vibe from what I saw. The credits close with Jennifer's hit song, \"My Love Don't Cost A Thing\" and that generally tops off the point I raised at the beginning of my review - Jennifer needs to choose between singing or acting because her film career is beginning to suffer as a result.\n\nMy Rating - 2 out of 10"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "edwagreen",
        "review_rating": "7",
        "review_title": "Wedding Planner-Plan for Whirlwind Romance Here ***",
        "review_detailed_main": "Entertaining comedy where Jennifer Lopez plans the weddings of others while she can't get a solid foothold on her own life.\n\nIn a near serious accident, she meets Matthew McConnaughey, a doctor, who it turns out is the fiancée of the woman who has just hired her to make her wedding.\n\nThe film is devoted to them falling in love as well as relationships with others.\n\nWe are nearly fooled by how this film will end but in the end-justice prevails.\n\nMatthew and Jennifer have an awesome screen chemistry between them. They are joined by Alex Rocco, who comically portrays Lopez's widowed father. He wants the best for her and is encouraging her to marry a fellow she met as a youngster during a summer visit to Italy.\n\nA whimsical tale at best. It's worthwhile catching."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "clubmike00",
        "review_rating": "2",
        "review_title": "Ugh!",
        "review_detailed_main": "No chemistry, no laughs, no reason to care!\n\nDo you think people set out to make a lousy film? Or do they realize they're making one while in production??\n\nAn utter waste of time."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "gisele22",
        "review_rating": "7",
        "review_title": "Charming Romantic Comedy!",
        "review_detailed_main": "I was pleasantly surprised with \"The Wedding Planner\", which I rented recently. I was reminded of the classic and oh, so fashionable romantic comedies which starred Ginger Rogers, Doris Day, Audrey Hepburn, etc. Matthew McConaughey and Jennifer Lopez had great chemistry. They did a wonderful job of portraying love at first sight and not knowing what to do about it. Sure, there were some predictable moments, but isn't that always the case in these types of movies? I may be a little biased, since the romantic comedy is my favorite movie genre. I just can't get enough of those wisecracks used to hide true feelings, those charming dance sequences, those lingering stares under the stars... *sigh*. Well, if you agree with me, then you'll love this simply charming movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "rebekahscheys",
        "review_rating": "4",
        "review_title": "A wedding planner with no relationship of her own is doubtful about love's existence, until she meets Steve.",
        "review_detailed_main": "Jennifer Lopez is right at home playing the strong, intelligent professional, Mary, and despite her inability to properly tell a joke (\"What, you think Kissinger wrote his own stuff?) or properly communicate strong emotion (like despair), she does well in the cutesy moments. Matthew McConaughey is charming as the conflicted Steve, and expertly plays both his character's dry, cynical side and his boyish joyfulness. The two play against one another well, unlike the boring Fran, whose idea of the perfect wedding song is Olivia Newton-John's \"I Honestly Love You,\" and who can't seem to find one legitimate reason why she wants to marry Steve in the first place.\n\nAs there are no other true funny characters, Massimo is perhaps intended to provide the film's comic relief, but his \"humor\" flows less from witty screen writing and masterful delivery and more from the director's mistaken assumption that every line a character delivers in broken English must be funny. Overall, \"The Wedding Planner\" does a good job of fulfilling audience expectations and creating characters that, while likable, are simply rom-com archetypes. The true romantic, unsatisfied with paltry declarations of love and empty representations of it, hopes for a bit more.\n\nRead my full review here: thecorrelationfilmblog.wordpress.com/2013/01/29/my-best-friends- weddingthe-wedding-planner/"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sjmiller-170-168608",
        "review_rating": "10",
        "review_title": "TylerDurden's \"What Is Everyone Complaining About?\"",
        "review_detailed_main": "June 1, 2015. I was looking up Movie info on the Actor Justin Chambers that played Massimo in \"The Wedding Planner\" on IDMb.com and ran across TylerDurden's \"What Is Everyone Complaining About?\" comments 21 July 2005. SEE BELOW: -----------------------------------\n\n\"I've owned this movie for a while, and only needed to see it once before deciding to run to the store to buy it. As a matter of fact, I'm watching it right now, but I got on here and looked it up because I wanted to see what other movies the writer had written (unfortunately---it's the only one.) After looking at the ratings and comments I had to voice my own opinion.\n\n\"The Wedding Planner\" has everything you could ask from a romantic comedy. Predictability is always a factor, but come on! Do we really watch these types of movies expecting to be surprised at the ending? This film is quirky; all the actors and actresses don't miss a beat and they keep it real. No matter how many times I watch it, I still find something to laugh or smile at.\n\nI haven't yet met a MAN that likes this movie, but if you're a girl that wants something sweet, funny, entertaining, and the \"romantic dream\"..... in other words: a flick you watch with a pint of ice cream ( =P ) then this is the one for you.\n\nThe directing is great, the dialog is entertaining, the acting is enjoyable, the movie over-all is fantastic. It's just sweet...even my mom likes it! O_O\n\nHonestly, stop judging the movie like you're some kind of almighty critic, and watch it for what it is. If you don't like the genre, then pick something else to watch ^_^ Me? I'll stick with \"The Wedding Planner\".\" -------------------------------------------------------\n\nTyler was right on, and I and my Husband LOVE this Movie. Yes, a MAN can like this movie and my Husband LOVES it. This movie is SO Under Rated and as a Romantic Comedy it has all the Story Line (quirkiness) that makes a Classic Movie you can watch over and over again. That's why we give it a 10/10 Star.\n\nSo-o-o, all you critics out there, put the movie in and sit back with some buttered Popcorn and a drink, and watch a FUN movie without criticizing and ENJOY. Thank You Tyler Durden for voicing you opinion. SJMillers :-)"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "lisafordeay",
        "review_rating": "7",
        "review_title": "A cute predictable romantic comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "david020",
        "review_rating": "1",
        "review_title": "The trailer is all you need to see (if you really have to).",
        "review_detailed_main": "Adam Shankman's second try to direct a movie has resulted in a total disaster. It is an uninspired creation, featuring an uninspired cast. Watching this movie is like watching a stampede of wildebeasts coming your way. You know what is going to happen, and the only solution is to run. The story is one big cliché, with not even one attempt to make it fresh. Lopez and McConaughey seem to have been cast for their looks only (Which doesn't surprise me at all for Lopez, as I have never been convinced of her acting qualities). They have no chemistry and do not even seem to be interested in the characters they are playing, making the whole a very boring affair to look at. This is not a movie but a commercial product, a blatant attempt to squeeze some more money out of the public. And, with an opening week of $13,5 million, apparently some people will just watch anything that moves and has a pretty face.\n\nDavid."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "wiss22",
        "review_rating": "",
        "review_title": "i loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "lkarhu",
        "review_rating": "1",
        "review_title": "So Stupid!",
        "review_detailed_main": "I really do love romantic comedies, but this one was so stupid, so simple, so naive, that it made me feel sick. The chemistry between the main couple - or any of the couples - was so superficial! An other same kind of movie, My Best Friend's Wedding (Julia Roberts film), is not my favourite either, but it has at least some sense and moral. Comparing to this -- piece of junk."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "stefanhoeffllin",
        "review_rating": "7",
        "review_title": "Her best friends wedding...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "Fails as both a comedy and a romance, and doesn't even have the advantage of having a good cast",
        "review_detailed_main": "It is not as if there is any bias against romantic-comedies, as there are a number of good ones out there. As with all film genres, there are also some bad ones, and sadly 'The Wedding Planner' is one of those, or at least to me.\n\n'The Wedding Planner' does have some beautiful scenery, a stunning wardrobe for Jennifer Lopez (who wears it every bit as much) and is also very nicely shot. While the cast seemed okay on paper providing the material was good, only Judy Greer provides any enjoyment or warmth. Fred Willard is also quite good, and his scene is one few scenes that can be considered scene-stealing, but his appearance is too brief really.\n\nJennifer Lopez does look stunning in her wardrobe and handles the cutesy moments quite well, however her comic timing is leaden and the emotional moments are a mess of overwrought and under-cooked, a very bland performance while never quite reaching the \"horror\" depths that her performance in 'Gigli' did. Matthew McConaughey looks lost and like his heart wasn't in it. Their lack of chemistry is a large part of the film's failure, their scenes together are awkward and pained, McConaughey's chemistry with Brigitte Wilson-Sampras (who tries her best with an underwritten and particularly clichéd character, but sometimes tries too hard) fares better having a warmer and more natural vibe.\n\nOn top of that, there are also Justin Chambers and Alex Rocco, whose performances are badly marred especially by two of the worst accents in the history of film. Although Chambers' Massimo is little more than an annoying Italian stereotype and is as convincing an Italian as Keanu Reeves for example is as an Englishman (in 'Dracula'), this is particularly true with Rocco, it is ironic that the most seasoned of all the actors sounds like he had just come from a particularly boozy night on the town.\n\nFor romantic comedies to work, the comedy should sparkle and the romantic elements should touch. To me, 'The Wedding Planner' failed at both. The comedy is chock full of clunky and witless dialogue, in a film crying out for somewhat of a screwball approach, and the situations are wildly improbable and would be more at place in a short-lived and amateurish sit-com. Very few romantic comedies have screenplays this irredeemably and intelligence insultingly dumb either.\n\nLack of chemistry between Lopez and McConaughey is not the only thing hindering the romantic elements. 'The Wedding Planner' could have been sweet, but lays it on so heavy with the sugar that it becomes nauseating. The story is predictable, even for romantic comedy, with an ending that is so obvious five minutes in, and heavy in contrivance and sappiness and very low on wit, proper emotional impact and sass. This may have been slightly acceptable if so many scenes weren't so insultingly ridiculous and impossible to take at face value.\n\nDirection is bland, the characters are genre archetypes that are a mix of obnoxious and dull and no other extreme and the soundtrack is over-bearingly ham-fisted and heavy-handed.\n\nOverall, fails as a comedy and as a romance and even a good cast can't save it. Not recommended. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "iprudd",
        "review_rating": "7",
        "review_title": "\"Those who can't plan",
        "review_detailed_main": "Maria has planned weddings ever since she was seven. She is now the most successful wedding planner at her agency and has her heart set on a partnership, which she is going to get when she secures the Donolly account. This she does. She is then rescued by handsome Dr 'Eddie'. She falls for his charms straight away. Then the nightmare begins, he is Farn Donolly's husband to be and her father is trying to marry her off to Massimo, a geek from Italy, where she was born. The film charts the story of the wedding and Mary and Eddie's growing feelings for each other. The film may end happily, but that is why you go to this type of film. The leads show why they are major players in Hollywood. McConaughey and Lopez generate on screen romance, Wilson plays Fran as as the stereotypical career go getter but this is not too over the top. This is one for the romantics out there."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mashby",
        "review_rating": "3",
        "review_title": "Unfortunately, this movie just fell below my already low expectations.",
        "review_detailed_main": "This is one of those movies that you rent/watch for your significant other. I rented it for my wife since most of my movies as of recent have been mostly for me. However, I tried to keep an open mind and give it a fair shake. Unfortunately, this movie just fell below my already low expectations. First time director and first time screenwriters, what can you expect?\n\nThe script was just not believable. I know that romantic comedies have the liberty of taking some license here and there, but I just didn't buy so much of this movie that the whole thing just seemed fake. For starters, we're supposed to believe that Jennifer Lopez is an Italian immigrant? Come on! Her father (Alex Rocco) doesn't sound Italian, he sounds retarded. I don't even know why she had to be an immigrant. There was nothing in the plot that required her being from another country, except for the fact that her father trys to arrange a marriage, which was just another unnecessary plot device. There's just so much that was wrong with this script, I'm just amazed that the leading actors signed on to this project.\n\nThe talent in this movie was fairly decent. Jennifer Lopez and Matthew McConaughey had some chemistry and they looked good together. Kathy Najimy is a wonderful comedic actress and her scene with Jennifer was very good and believable. Fred Willard, and Kevin Pollak are the other actors that do comedic roles extremely well, but their talents were simply not tapped. They did what they could, but they simply had nothing to work with. IMHO I think Jennifer Lopez signed on because she was friends with Adam Shankman (he's a choreographer) and once she signed on, everyone else jumped on board for their resume."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Mardhiah12",
        "review_rating": "7",
        "review_title": "Simple story",
        "review_detailed_main": "Basically,this movie tells about Jennifer Lopez,who works as a wedding planner and begins to fall for the groom(Matthew McConaughey)in one of the wedding she is planning. This movie might not offer much, but it is light hearted and suitable for the whole family. This movie might appeals to women as a whole because it pays attention to details occur in a wedding preparation."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "heatherhilgers",
        "review_rating": "4",
        "review_title": "Promotes M&M Waste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "gabby-pretlow",
        "review_rating": "10",
        "review_title": "if you don't like this movie...",
        "review_detailed_main": "You're just a hopeless cynic. The world has enough hate and tragedy going on for you to enjoy..so why not enjoy a little fantasy/fairytale? Ever since I was little girl this movie has always been one of my favorites. It's cute and light hearted, but also done well. Matt and Jlo had great chemistry and the supporting cast fit right in. I will always enjoy this movie, and i'm glad there are people out here that feel the same. If you don't like this genre, save your comments and go watch something more dramatic."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Keedee",
        "review_rating": "7",
        "review_title": "Simply Delightful..",
        "review_detailed_main": "Ovations for this simply sweet and humorous romantic comedy. It takes me back to the days where Audrey Hepburn and Gregory Peck sizzled on the big screen in Roman Holiday. The chemistry between Lopez and McConaughey was hot, hot, hot and somehow, not so hot that it was sleazy. Ms. Lopez is completely believable in her role as wedding planner: the dedicated, driven career woman and handsome McConaughey is delicious as the charming, down-to-Earth husband-to-be of Lopez's client. This sweet romantic comedy even made me wonder about dissolving my vow to never get romantically involved again. These two make magic! It's totally entertaining and highly recommended!!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "moonspinner55",
        "review_rating": "1",
        "review_title": "The 'chick flick' comes a cropper",
        "review_detailed_main": "Kissless wedding coordinator (into Scrabble matches and vintage movies) meets the guy of her dreams--a doctor, no less!--only to find out he's the intended groom of her latest client. Toothless romp written by Pamela Falk and Michael Ellis, neither of whom has an original thought or clever idea. The film is designed to make ladies swoon, but if they do they are easy targets. Almost completely worthless, the picture comes off looking like a Julia Roberts or Sandra Bullock reject. In the leading role, Jennifer Lopez tries but can't carry the load; she sparkles, she twinkles, but it's a fairly transparent put-on. This just about scrapes bottom. * from ****"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "CmHowell99",
        "review_rating": "",
        "review_title": "Everything a romance movie should be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jhclues",
        "review_rating": "1",
        "review_title": "Jennifer Lopez, Please Report To The Set",
        "review_detailed_main": "The first question you have to ask about this movie is, what is the target audience supposed to be? In what may be a most telling scene, when the main character has an accident and wakes up in the hospital, she just happens to be in the pediatric ward; perhaps giving those to whom this insipid drivel would appeal something with which to relate? But I'm getting ahead of myself. In regards to `The Wedding Planner,' directed (more or less) by Adam Shankman, that last comment should've been reserved for later, but by then I may have had to make it `cliche-ridden' insipid drivel. Actually, early on this film seemed to have some promise; but then the opening credits ended and it was all downhill from there. It may ring of paranoia, but the makers of this movie-- though unable to deny responsibility since they did, in fact, make it-- may have been able to make a case that they had been the victims of a conspiracy of sorts, beginning with the cast they assembled to bring it all to life. I can think of no other movie that boasts such a grossly unappealing, miscast bunch of actors, beginning with Alex Rocco as Salvatore, the father of Mary Fiore, the character played by Jennifer Lopez. Mull that over for just a moment, if you will; Rocco as Lopez's father.... For the life of me, I cannot understand Jennifer Lopez; she's beautiful and talented, and seemingly bent on making as many mistakes, career-wise, as she possibly can. Perhaps I should make that `artistic' mistakes, since with her singing career and being given the opportunity to make movies (even ones like this) she is probably going to be very materially well-off, even if she continues to do nothing of artistic merit for the rest of her life. Maybe when the teenyboppers have grown tired of her (which shouldn't be too long) and she realizes that she will only be able to invade Brittany Spears territory so far, she will go back to what she is really good at, making movies like `Selena,' and `Out Of Sight,' in which she demonstrated what kind of acting chops she has. How ironic that in this film she plays a wedding planner, when what she needs in real life is a `career planner' for herself. It just seems like such a shame that `J. Lo' has taken the fast-track to fame and fortune instead of employing her myriad gifts to better purpose. That she looks attractive in this film cannot be denied, but neither can it be denied that as far as her acting, it was nothing more than a walk-through for her. Matthew McConaughey, meanwhile, winds up in even murkier waters than Lopez here, with his portrayal of Dr. Steve `Eddie' Edison, the character whom circumstances bring into contact with Mary Fiore at a pivotal point in his life. He is engaged to Fran (Bridgette Wilson), but begins to have second thoughts about it after his encounter with Mary. The plot line gets pretty complicated after that, and for anyone who has trouble keeping up with it, I can only suggest that they confer with some of those currently residing in that pediatric ward. Any charm, charisma or screen presence McConaughey has must have been checked at the gate when he signed on for this one, because a more flat, uninspired performance you are unlikely to find without looking real hard. Hold that thought; can anyone say Chris O'Donnell in `The Bachelor?' And the lack of chemistry between McConaughey and Lopez is stupefying; interestingly enough, he has even less with Wilson. The producers would've had to bring in truckloads of rocks and flint to ignite any sparks on this set. The supporting cast includes Justin Chambers (Massimo), Judy Greer (Penny), Joanna Gleason (Mrs. Donolly), Charles Kimbrough (Mr. Donolly), Fred Willard (Basil St. Mosely), Kathy Najimy (Geri) and Kevin Pollak as Dr. Dojny (but don't blink or you'll miss him). Unfortunately, the best thing that can be said about `The Wedding Planner' is that it makes even the mediocre movies look good. It's always a huge disappointment to see talent, the likes of which are involved here, go to waste in such an unmitigated debacle as this. It would be so satisfying to see Jennifer Lopez, especially, in a project worthy of what she has to offer, and of which she is capable; as an audience, we can only hope that she gets some good advice about the direction of her career, and that she will have the guts to listen to and act upon it. I rate this one 1/10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mrbigstuffboy",
        "review_rating": "7",
        "review_title": "Adorable!!!",
        "review_detailed_main": "Being a huge fan of Jenny Lopez these days, I had to see this movie! My friend who sat beside me was getting tired of hearing me say isn't she cute everytime the latina star appeared on camera. I thought this movie was pulled together by the chemistry between Matthew and Jenny. I also thought that the talent of Kathy NaJimy was wasted. Very enjoyable date movie!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Jonas_Eriksson",
        "review_rating": "1",
        "review_title": "A movie we can do without...",
        "review_detailed_main": "Three astonishingly pretty actresses in Jennifer Lopez, Bridgette Wilson and Judy Greer can't help this sugar sweet and sentimental chick-flick. The plot is to say the least thin - it is totally predictable and the story has been done a hundred times before. This movie never takes off and is dull from beginning till end. No laughs. The characters are uninteresting and you never really care about any one of them.\n\nIf you're looking for a romantic comedy, I'd say pick another - there are so many better ones out there. My advice is to stay away from this Hollywood waste-of-time garbage."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "solojones",
        "review_rating": "6",
        "review_title": "If anyone objects to this movie, speak now or forever hold your peace...",
        "review_detailed_main": "I had been awaiting the release of this movie with great anticipation since I first saw the trailer. It looked very interesting. And finally I got to see it, and it was hillarious! It wasn't exactly a chick-flick either. There was more comedy than romance, I thought.\n\nAnd it was also unique in that it wasn't just like, \"Please, Eddy and Mary have to hook up!\" It was more like. \"Eddy and Mary... no, wait.. I think Eddy should stay with Fran.... and Mary should be with Massimos(that guy is so loveable!)...No, with Eddy...\" I couldn't make up my mind.\n\nAll in all, this movie is really fun and enjoyable. I would deffinately recommend it to anyone who is going to the movie soon!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Spleen",
        "review_rating": "4",
        "review_title": "J-Lo ... Jay-ay-ay Lo ... credits come and me wan' go home",
        "review_detailed_main": "I'm in awe. Every shot is in focus, properly lit and properly framed; the cast deliver their lines without mishap; there are no lighting rigs or boom mikes visible; continuity is seamless and there's nothing wrong with the editing, either. Clearly this is a film made by professionals who knew what they were doing. Why, then, is it so bad? I'm not trying to be funny: there really is a mystery here.\n\nEveryone in the story is a complete idiot, determined never to say or do the obvious, sensible thing, and the film tries to persuade us that this is cute. (Partly by means of an ingratiating musical score, which winks and smirks and makes \"wry\" musical comments at us until we can take it no more.) An almost complete stranger walks up to Mary and announces to the four people she's with that the two of them are engaged. It's not in Mary's interest to have anyone think this and it's not hard for her to deny it. Does she deny it? Of course not! What do you take her for?\n\nAll we have to sustain us through this tortured, stupid plot-trundling is Jennifer Lopez's charm. It's lucky she has so much - only one of the eight supporting players has any at all, and I have my doubts even about him."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "ahmed_razzak-15605",
        "review_rating": "7",
        "review_title": "Those who plan it get planned themselves 😂",
        "review_detailed_main": "Just watching Bridgette Wilson movies these days cause I actually had a massive crush on her after the original Mortal Kombat movie , she's been like my youth star who played Sonya .. so one of the movies of hers cause she had a very short run in Hollywood cause after getting married to the world famous now retired Tennis Star Pete Sampras .. is this .. has a side role of a bride to be . We also see the famous singer Jlo better known as Jennifer Lopez . I had seen her before in Anaconda so now I saw her in The Wedding Planner with Mathew McConaughey."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "zaidhunt",
        "review_rating": "1",
        "review_title": "Why spend millions to make terrible films!? WHY!",
        "review_detailed_main": "Just another movie for J-Lo to parade around showing off her big butt.\n\nWhy do people go and watch this. If you people stop watching J-Lo movies and listening to her self absorbed conceited music she'll disappear from our lives forever.\n\nAnd then she could live out the rest of her days away from us\u0085 in one of her big mansions swimming in the billions of dollars she robbed from us.\n\nI was unfortunate enough to see this film on my plane ride. It's the only time I ever wished for the plane to crash.\n\nPOOOO'EEEE !"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "melissa.ricks",
        "review_rating": "8",
        "review_title": "Great chemistry between McConaughey and Lopez.",
        "review_detailed_main": "A guilty pleasure. Yes, it is a chick-flick but it is a real pleasure. McConaughey is as sexy as I've ever seen him and Lopez is really funny, handling the bumbling pratfall humor very well.\n\nThis is a cute story. But what really makes a good romantic comedy in my eyes is the chemistry between the lead actors and these two have it in spades! I'd like to see them together again. Better chemistry than Roberts and Gere or Roberts and Pitt."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Movie-12",
        "review_rating": "6",
        "review_title": "Almost works with the charm of the leading actors, but doesn't because of a week script. **1/2 (out of four).",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "tim-shaw-gp",
        "review_rating": "2",
        "review_title": "Dreadful slush",
        "review_detailed_main": "Don't let your girlfriend drag you to this one: dire script, corny jokes, and saccharine make this a don't see. The actors struggle hard with this one, and production values seem OK.\n\n2 out of 10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "a4021668",
        "review_rating": "",
        "review_title": "I like this Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "skyrider-2",
        "review_rating": "1",
        "review_title": "The chick flick from hell",
        "review_detailed_main": "Take every Meg Ryan/Sandra Bullock/Julia Roberts movie, add a dash of Father Of The Bride parts 1 and 2 and you get the idea. WARNING: This movie is for chicks only!! If you must be dragged there by your girlfriend and forced to endure this meaningless, formula fluff, than she should have to go to at least 5 football games with you! Maybe in the fantasyland this movie takes place in, someone who looks like Jennifer Lopez would be lonely...in the real world she needs 10 huge bodyguards just to keep all the would be suiters away from her. Who cares really anyway? This is a movie made by a huge faceless studio and directed by a dance instructor, where every element is tested by computers for the mass appeal rating. Every frame reeks of cute and demographic target audience. If you are a girl you will probably like this movie, if you are a guy than you should fake a horrible illness to avoid going."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Bob-45",
        "review_rating": "7",
        "review_title": "Like its Star, Surprisingly Well Constructed",
        "review_detailed_main": "Admittedly, I approached \"The Wedding Planner\" with some trepidation. The title sounds like a weak ripoff of the enjoyable \"The Wedding Singer.\" To my great surprise, \"The Wedding Planner\" is a vastly superior movie. Opening with,perhaps, the longest single take since \"Touch of Evil,\" director Adam Shankman and Jennifer Lopez create a fresh look at a yet another \"control freak\" discovering she only BELIEVES she is in control. Like its star, Jennifer Lopez, \"The Wedding Planner\" is tightly constructed and quite engaging. Lopez is excellent, even if her gestures are more Hispanic than Italian. More convincing as an Italian is Justin Chambers as Massimo, Lopez's lovesick childhood suitor. One of the great strengths of \"Planner\" is that both Chambers and Brigette Wilson are so likeable, one roots for them as much as he does the leads.\n\nThis movie is almost equally romantic-comedy-drama. Anyone who views the outtakes will see that much of the drama was left on the cutting room floor (including Lopez's best scene).\n\n\"The Wedding Planner\" is not necessarily a movie I would want to see again, but it was certainly time well spent. I give a 7 out of 10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "qunod",
        "review_rating": "1",
        "review_title": "Is this the Room Part 2?",
        "review_detailed_main": "Someone put this on in a crowded bar, and everyone gathered around to watch it. Naturally, I did too. I made this account to say that I had the utmost displeasure of experiencing this movie and have to say that the cinematography is like that of a low budget film you would see during the daytime and the acting almost rivals that of the room. The fact that this was involved in the Razzies and only won an award in the Kids' Awards speaks great volumes. Terrible acting, script, plot, everything. Don't watch this; if you're mad enough to watch it bring a double barrelled shotgun: that way, if you miss the first time, you can shoot for a second time and hopefully kill yourself instead of having your eyes exposed to Satan's creation to torture paedophiles."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jimorris",
        "review_rating": "7",
        "review_title": "Predictable, pleasant romantic comedy",
        "review_detailed_main": "If you are interested in a well-made but predictable, pleasant romantic comedy, then this is your movie. You will also enjoy the background scenes of San Francisco. Jennifer Lopez gives a winning performance as the girl who plans others weddings and has given up on finding someone to marry."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Thanos_Alfie",
        "review_rating": "4",
        "review_title": "Medium movie...",
        "review_detailed_main": "\"The Wedding Planner\" is a comedy and romance movie which has to do with a woman who is a wedding planner and she fell in love with a man who finally will be the groom of the most important wedding in her entire carrier. We watch her being in a dilemma and this has to do with what is she going to do, is she going to help the groom with his wedding or is she going to be his bride.\n\nIn this movie we have a simple romance story between a simple woman with an important and rich man, a simple plot and direction by Adam Shankman. Also in this movie we have some good interpretation by Matthew McConaughey who plays as Steve Edison and I am sure that he want to forget this movie as fast as he can and Jennifer Lopez who plays as Mary Fiore.\n\nIf you are a fan of romance movies then \"The Wedding Planner\" is a movie which I am sure that you will love it. If you are not fan then just do not watch this movie and do not lose your time on it."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "perfectbond",
        "review_rating": "6",
        "review_title": "Average",
        "review_detailed_main": "A big problem in this movie is that Ms. Lopez is supposed to be Italian but her Spanish accent is so noticeable. I'm not railing against Ms. Lopez. I liked her performances in Out of Sight and Angel Eyes but not here. Another problem is that the filmmakers tried to be too cute and whimsical in spots and this became irritating. However to be fair there were some moving scenes but they were far and few between. I won't even point out the irony between Ms. Lopez' role in this film and her real life matrimonial difficulties. My rating: 5/10. If you are a 10-17 year old female you'll probably like this film a lot more than I did."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "dojcwj",
        "review_rating": "1",
        "review_title": "Cute is not enough.",
        "review_detailed_main": "A most contrived and poorly scripted comedy one could imagine. Lopez is most attractive and speaks her lines with as much conviction as possible given the nonsense she is required to utter. The leading man is a doctor without a practice and as shallow as any character could be. A total waste of time. Not romantic nor comical."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "QueenTootsie101",
        "review_rating": "9",
        "review_title": "First of all, what is everyone complaining about?",
        "review_detailed_main": "i found this movie very delightful and funny. Something was always going on in the movie, and i found it creative. Nothing was exactly slow in the movie. It kept going. This movie is good to watch to get a good laugh, and it teaches you a lot about finding your love. It wasn't the best movie in the world per say, because it was like a lot of romantic comedies. But seriously, all romantic comedies are exactly the same and i love them. This movie has a lot of different movie genres to it. Drama, romance, comedy, and even action. Whats there not to like? Ever since i was a little girl i loved watching this movie,and i memorized the dialog from watching it so much. I have nothing bad to say about this movie except that its common. Otherwise, it seems like a perfect stay-at-home movie to watch when trying to buy some time.\n\ni give it a 9."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "kostin12",
        "review_rating": "7",
        "review_title": "pretty good one",
        "review_detailed_main": "for the first time when i saw this movie i thought was awful.but i saw it again with my girlfriend because she is a jennifer lopez fan and i must say that is a pretty damn good movie.the best thing about wedding planner is that exist a chemistry between jlo and matthew but i didn't like the fact that she can't act when she supposed to be drunk or to smoke.jennifer lopez is, i think, a good actress because of films like lost in the wild,money train,anaconda,selena,out of sight,maid in manhattan and an unfinished life which were very good movies but now she can't act well in the movies she plays because the men who work it are not professionals(directors,writers,co-stars) so you can't blame her . it' not her fault.so i recommend you to see this movie aftermoon with your girlfriend/boyfriend.it deserved ***1/2 out of *****"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "audiophile84",
        "review_rating": "1",
        "review_title": "One Crappy Flick",
        "review_detailed_main": "being a fan of jennifer lopez (as she was known as at that time), i decided to watch her movie debut. how i wish i had picked some other show. none of the shows being screened at that time could have been draggier, or more predictable than this one. it was so obvious from the start that the wedding planner would end up with the groom-to-be. still, i have to admit the show was ruined not by her acting, which i found to be rather good in fact, but by the poor plot.\n\nafter this horrifying experience, i have vowed not to see any of her shows ever again. seems that i made the right choice. friends of mine who saw ENOUGH gave it two thumbs down."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "wneskora2006",
        "review_rating": "",
        "review_title": "REALLY, REALLY GOOD!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "3",
        "review_title": "Bad chemistry",
        "review_detailed_main": "I don't know why, but I was so curious to see the Wedding Planner, my friend was telling me that it was a cute movie and to give it a chance. I figured, what would I have to loose? I lost a hour and 40 minutes. The Wedding Planner wasn't necessarily a bad story, but it was bad casting and incredibly clichéd as usual for a romantic comedy. Jennifer Lopez, it was so funny because the \"review\" for the film on the back of the cover was \"Jennifer Lopez is smart and sexy, she has it\", considering that's not a review of the film, I should've known better.\n\nMary is a wedding planner who is having a hard time finding that guy of her dreams, but one day while planning a wedding for her biggest client ever, she is walking and her Gucci shoe gets caught in the sewer vent, instead of being smart when a garbage truck is about to head towards her and kill her, she goes back for the stupid shoe, but I guess it all turned out for the best since Eddie, a supposedly cute doctor, saves her life. But as it turns out he is the fiancée she was planning the wedding for. She has to deal with a guy her dad is trying to set her up with while she is in love with Eddie and he also must confront some tough feelings before the wedding.\n\nThe Wedding Planner is just a typical romantic comedy that has nothing special. Jennifer and Matt had zero chemistry, I don't know what the casting director was thinking other than big bucks in the box office, because Matt and Jen had no chemistry what so ever. The story is alright, needs a lot of polish, but unfortunately it just has you begging for the stupid story to end since it's so predictable in the first place.\n\n3/10"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "lilybridalvn",
        "review_rating": "6",
        "review_title": "Good Choices For My Wedding!",
        "review_detailed_main": "Watching this movie helps me understand the role of a Wedding Planner and the process of preparing for a wedding day. It's not just about ordinary preparations; it's about conveying the profound meaning of love between the couple. This is truly sacred for a wedding day.\n\n\"The Wedding Planner\" is a romantic comedy film that was released in 2001, starring Jennifer Lopez as Mary Fiore, a successful wedding planner. The film not only provides entertainment but also offers insights into the world of wedding planning and the emotional significance behind it.\n\nIn the movie, Mary Fiore is a dedicated wedding planner who takes her job very seriously. She is responsible for coordinating and organizing all aspects of a couple's wedding day. Here's how the movie portrays the role of a Wedding Planner and the preparations for a wedding:\n\nMeeting with the Couple: Wedding planners meet with the engaged couple to discuss their vision for the wedding day. They help the couple make important decisions about the venue, theme, color scheme, and other details.\n\nVendor Selection: Mary works with various vendors such as florists, caterers, and musicians to ensure that everything goes smoothly on the wedding day. She has to have a wide network of contacts to provide the best options to the couple.\n\nSolving Problems: Like any event, weddings can encounter unexpected issues. Wedding planners like Mary are experts at problem-solving and can handle any last-minute crises that may arise, ensuring a stress-free day for the couple.\n\nCreating a Timeline: Mary meticulously plans the timeline for the wedding day, making sure that everything runs on schedule. This involves coordinating the arrival of the bridal party, the ceremony, the reception, and all other activities.\n\nEmotional Support: Beyond the logistics, Mary also provides emotional support to the bride and groom. She understands the significance of the day and helps them navigate the emotional ups and downs that can come with wedding planning.\n\nSymbolism of Love: As you mentioned, a wedding is not just an event; it's a representation of the couple's love for each other. Wedding planners like Mary aim to capture the essence of that love in every detail, from the decorations to the vows.\n\n\"The Wedding Planner\" showcases the dedication and passion that wedding planners bring to their work. It emphasizes that a wedding is a deeply meaningful and sacred moment in a couple's life, and the role of a wedding planner is to ensure that this special day is everything the couple dreams of.\n\nIn conclusion, \"The Wedding Planner\" provides a charming glimpse into the world of wedding planning, highlighting the importance of attention to detail, problem-solving skills, and emotional support in creating a beautiful and memorable wedding day. It reminds us that behind every successful wedding, there is a dedicated planner who understands the true essence of love and commitment."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Harpo 2046",
        "review_rating": "1",
        "review_title": "One of the worst film of the year",
        "review_detailed_main": "This film is really bad because the director uses too many cliches, and maybe it was what he wanted to make. He probably wanted to create something like \"My best friend's wedding\", but J.Lopez is not as good as J.Roberts, and the plot is much worse. So, if you have some time to waste, I suggest you should see this movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "cricketbat",
        "review_rating": "6",
        "review_title": "A pleasant & predictable ride with Jennifer Lopez and Matthew McConaughey",
        "review_detailed_main": "As far as romantic comedies go, The Wedding Planner is pretty standard. You know exactly where the road is heading, but you don't mind the predictability because the ride is pleasant. Plus, you get to look at Jennifer Lopez and Matthew McConaughey the whole time. Even though this isn't one of my favorite rom-coms, I don't mind watching it every now and then."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "hayes424",
        "review_rating": "1",
        "review_title": "worst movie ever!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "dmills9",
        "review_rating": "6",
        "review_title": "Just Okay",
        "review_detailed_main": "This movie didn't do much for me. Not bad, but not very good either.\n\nThe music tried valiantly to evoke emotions that the acting and script just weren't doing on their own. But here's the problem. I'm not the type of person to take special note of the music (usually) and this just goes to show that I really wasn't into the story.\n\nThese leading actors are really enjoyable most of the time, but this time, especially on the part of Jennifer Lopez, I was wondering what happened to the usual talent they display.\n\nDespite their flat acting, a good word for the father of the wedding planner, Alex Rocco, has to be put in. This guy did such a great job with his character that I was almost instantly in love with the sweetness and genuine feeling that came across in his overly-involved father role. His part was relatively small, but important and superbly done.\n\nWatch it if you want, but don't expect to be blown away or swept off your feet."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "The Wedding Planner",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "po5mrk",
        "review_rating": "9",
        "review_title": "Perfectly Precious!",
        "review_detailed_main": "The Wedding Planner is the must see date movie of the year. It's a romantic comedy with all the right elements. But it goes above and beyond the standard chick-flick with so many lovable characters that you can't decide which one you want to win at the game of love!\n\nMatthew McConaughey is Prince Charming as Pediatrician Steve Edison, a successful yet sweet man about to marry the \"ideal girl\". Jennifer Lopez is fantastic as a wedding planner who can seem to find herself a good man so she obsesses over everything else instead.\n\nI give this movie 5 stars and two big thumbs up! To sum it all up: it's charming, funny, sweet, sentimental and just down right pleasant."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "tbabe29",
        "review_rating": "6",
        "review_title": "Jennifer Anniston would have been perfect in this...",
        "review_detailed_main": "Miscast. Don't ya hate it when that happens?\n\nDon't get me wrong...I like Jennifer Lopez, but she was much more believable in OUT OF SIGHT with George Clooney. Now THERE was some perfect casting and chemistry. In THE WEDDING PLANNER, it felt like she was just sort of \"filling in\" for someone else at the last minute.\n\nThe irony of that is that MATTHEW MCCONAUGHEY replaced BRENDEN FRASER (who opted out to do BEDAZZLED)at the last minute and was more believable and natural.\n\nGood thing Matthew McConaughey stepped in because I have a feeling that Brenden Fraser would have been too clean cut against the sexy Lopez, where as McConaughey can keep up with her.\n\nThroughout the movie, I just kept thinking of other actresses who would have been more believable. Sandra Bullock...Calista Flockhart...JENNIFER ANNISTON. My sister enthusiastically agreed.\n\nI didn't care for the guy who played Lopez's supposed fiance. Italian? I dunno about THAT....His accent was so over the top and distracting...\n\nIt is a great idea for a movie and has a lot of nice moments. But it moves a bit too fast. They could have taken a little more time in the first 40 minutes of the film to develop a little more chemistry between Lopez and McConaughey. If they had done that, I might have been more willing to believe the contrived ending. Towards the last 30 minutes I rolled my eyes so much they started to hurt. And the theatre didn't hand out barf bags, so I stayed nauseated.\n\nToo bad. Such a cute idea. Fizzles towards the end.\n\n6/10"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Rhythmbandit",
        "review_rating": "1",
        "review_title": "Compleatly Terrible Unwatchable Mush",
        "review_detailed_main": "Jennifer Lopez stars as a lonley woman who meets the man of her dreams when she is almost run over by a dumpster. What she doesnt know is that the man is the groom of the wedding she is planning. Acting from Jennifer Lopez is totally awful. This is a romantic comedy but its neither funny or romantic. Its totally unwatchable and the acting (by everyone except for a Matthew McConaughey) was atrocious. If you havent seen it yet I recommend you dont see it except for massive fans of Lopez or McConaughey, or those who either have a sad lonely life or want to be bored easily."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "aliminx",
        "review_rating": "",
        "review_title": "Wasn't that bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "elemaire",
        "review_rating": "1",
        "review_title": "Stronger than valium !",
        "review_detailed_main": "A story already seen a hundred times, not a single little tiny surprise, actors at their worst level begging for something smart to say.JLO looks as sexy as a nun (It could have the only reason to take look). Well if you love Cinema, and if you love JLO be pitiful to her, forget this movie(if we can call this a movie) I just cannot remember something worst, even the TV version of Conan the Barbarian looks like a Shakespeare play compared to it.I guess it deserves a good place in the Guinness Book."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "moviewiz-4",
        "review_rating": "7",
        "review_title": "Good one",
        "review_detailed_main": "Is it romantic movie? Or Tragedy? or something else?\n\nI like this movie a lot because of Ms Lopez's appearance is so different from other movie. Her performance is very good indeed.\n\nWhen i entered the cinema, i am one of the first to go in. When i see the number of female watching this movie, i talk to myself, WOW. I can count the number of Male with my fingers. Is it really a must see movie for female audiences?\n\nSome of the story are quite similar with other movies that i have seen before. So i can't rate this story very high. It is quite an original idea though."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "contact-292-497890",
        "review_rating": "5",
        "review_title": "Funny movie if you are into wedding mode or if you are a wedding photographer/planner",
        "review_detailed_main": "The wedding planner is not a great movie, it's kind of slow and the story falls apart and is very predictable, said that it's watchable on a rainy day if you don't have anything else to do and you are looking for a decent romantic comedy, but you will enjoy it so much more if you are a wedding planner or wedding photographer or work in a similar industry, you will definitely get some good laughs and maybe shear some tears.\n\nThe acting is not the strongest in the wedding planner, but Jennifer Lopez is a decent and pretty actress for this kind of romantic comedy.\n\nThe bottom line is, don't expect to much, a predictable plot with some sub-par acting but with some funny sequences if you are in the right wedding mood."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Whycanstthoubeagooddaughter",
        "review_rating": "7",
        "review_title": "Adorable, Guilty Pleasure",
        "review_detailed_main": "Hey, we all know why we're here: for JLo and Matthew M.'s fantastic butts. Have you seen the tango scene? Fantastic. Is Matthew's character a total jerk and do I feel JLo settled in the end? Yes. But are they just really pretty and shiny to look at as a couple? Yes. I also love Massimo. Totally underrated character. We need more guys like him (you know besides the incessant stalking and trying to get a woman he barely knows as a grownup to marry him). There are more than a couple wholesome, teary scenes that timelessly resonate with many people, especially those who \"don't feel anything about love.\""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "filmcrit-2",
        "review_rating": "4",
        "review_title": "Maybe I missed something.... (small spoiler)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Sarah423",
        "review_rating": "7",
        "review_title": "Funny, Sometimes Unintentionally So",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "ill_behavior",
        "review_rating": "1",
        "review_title": "Turgid",
        "review_detailed_main": "Technically sound as this film is, it has no soul. There's just nothing there, it's like a vacuum, nothing to be learned, the writers, director, nobody has anything to say.\n\nIf you like annoying characters who make unbelievably moronic decisions, and utterly ludicrous situations which unfold without even a small attempt to make them feasible, if you enjoy watching famous people mug you, you have found your favourite new film.\n\nBad, stay away, better romantic comedies out there than this one, I'd say for schoolgirls only, but I wouldn't want to be responsible for poisoning someones mind with this cinematic cancer. Vote with your feet and stay away from pathetic garbage like this."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "moiraine2002",
        "review_rating": "9",
        "review_title": "fun,fun,fun",
        "review_detailed_main": "this movie was charming and funny, like i was expecting. jennifer lopez shines in everything she does. i could have waited to see this movie on video, but still it was worth the six seventy-five to see it anyway. this is a must see, even if you are not that into chick flicks!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "oliviachape",
        "review_rating": "6",
        "review_title": "Starts off really well!",
        "review_detailed_main": "It's like there was time & money spent on working on the first half of the movie, then suddenly it had to be wrapped up fast because an actor had another job? Hmmm... Shame.\n\nIt could've been more romantic, in the sense of the wedding planner's vision. I must be getting this confused with another film, where the guy walks into her room, and she has cut out pieces strewn all over the place. She's working on designing a dress, or something. What's that movie called??"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Dia Klain",
        "review_rating": "1",
        "review_title": "The first movie I have given a 1 to!",
        "review_detailed_main": "On any normal day I would never have even seen it. I would never rent it, or got to the theater to see it.. especially not that. What happened was that It was on public TV in Europe where I was holidaying and I just happened to half watch it. Ugg. A horrible, mindless romantic comedy with one exception. Unlike all those stupid Julia Roberts romantic comedies, in this one the main character can't even act! What is with all these supposed singers trying to get into acting. They can't sing, and they most certainly can not act. Jennifer Lopez is an absolute joke as an actress. In The Cell she seemed to think that putting on a `dark princess' pout would be all that is needed, perhaps she was right, it worked alright. But in this horrible movie you at least need some charming acting, not some wannabe."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sq8188",
        "review_rating": "",
        "review_title": "Charming,nicely filmed,works for me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Quinoa1984",
        "review_rating": "3",
        "review_title": "Not reccomendable",
        "review_detailed_main": "I would say this is the only thing going for The Wedding Planner- if you have never (and I mean never) seen a movie and Wedding Planner is your first, you might like it. Otherwise, this film is just as it would seem from the previews (ie a waste of time). The film is chaulked up with cliches and dumb characters. Which is a shame considering that Jennifer Lopez has been in some pretty good films recently (The Cell, Out of Sight, U-Turn) as has Matthew McConaghey (EdTV, A Time To Kill). They are put in a film that not only do you know the outcome the minute you see the stars' names come up, you know the outcome when you see the trailers (just peachey aren't those all spoiling trailers). Some charm, but underminded by the obvious (maybe too obvious) mistakes. D+"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "taintedvie",
        "review_rating": "7",
        "review_title": "Charming!",
        "review_detailed_main": "The Wedding Planner isn't the best movie ever made. It has some flaws, the acting isn't always perfect, and we all have a pretty good idea where the story is going to end.\n\nHowever, it is a charming feel-good type of film that is easy to \"aww\" over. The story is cute, and there are some truly romantic scenes that make us all wishing we had more of that in our lives. Jennifer Lopez plays her role well (all though some might argue that it's highly unlikely for a girl like her to have not had a date in two years!), and Matthew McConaughey does a great job as Dr. Steve Edison. I was very impressed with him in this movie. The supporting cast seems to hold their own all right. Massimo (Justin Chambers) gets slightly irritating after a while, but that's my only truly large complaint.\n\nOverall, not the best ever made, but great for those days you watch a movie just for the purpose of bringing a smile to your face. :)"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Garys1266",
        "review_rating": "2",
        "review_title": "This movie has a great message",
        "review_detailed_main": "Cheat on your fiance and you'll live happily ever after folks!!!! What a great message!!!\n\nA few thoughts on this \"movie\":\n\nQuestion, what do you do with your life if you can't find a real job because your IQ is below 80? Become a wedding planner and steal your client's fiance!!!\n\nCameron, come on you're a wedding planner, not an engineer getting ready to launch the space shuttle at mission control, lose the headset babe, planning weddings IS NOT rocket science.\n\nWhy did Steve mis-lead Mary with a night of movies and soul talk when he was already engaged to an obviously smarter person who is better suited to his social circle? Are we not to believe that Mary would not think the same thing could happen to her if she also commited to marrying this louse(Steve)?\n\nMatthew MacConauhey a doctor? PUULLEEASE!!! I only eat brown M&Ms? What medical school did he attend? Jim Bob's Correspondance School of Medicine?\n\nWhy would a doctor marry a wedding planner in the first place? I can see it now, Cameron and Matthew at the country club. \"Doctor, what a lovely wife you have, and where did your wife go to college\"? \"Oh, she went to Daisy Duke's Junior College and majored in wedding planning with a minor in basket weaving\". \"She's now planning on staying at home and becoming a baby factory so we can pollute the world's gene pool with more wedding planners\". That'll go over real well in his social circle.\n\nOh let's see I'm writing this movie script who should I have Cameron Diaz fall in love with? A computer programmer?, no, a plumber?, no, an accountant?, no. I know, I'll write the script to make her fall in love with a rich doctor!!!\n\nThis movie is an insult to anyone who has and IQ above 90. Steer clear of it unless your below the age of 16."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "rainlm",
        "review_rating": "6",
        "review_title": "Blah romantic comedy.",
        "review_detailed_main": "I was really disappointed with this movie. This romantic comedy just didn't leave me with those warm, fuzzy feelings at the end.\n\nSteve Edison (Matthew McConaughey) is completely un-charming, and during the entire movie I was really trying hard to figure out what Mary Fiore (Jennifer Lopez) sees in him. Mary Fiore is a wedding planner, who finds out after almost kissing Steve that he is actually the groom-to-be of a big wedding she is planning.\n\nIn addition to the fact that he doesn't bother to mention he is engaged when he flirts with her, he very rarely says anything nice to her throughout the entire movie. He has an irritating drawl, and his mediocre looks can't make up for any of these things or explain what Mary's fascination is. Still, it is apparent that she is in love with him, and although in her trade she is the best-of-the-best, she is having a hard time trying to plan a wedding in which he will marry another woman.\n\nThe rest of the movie is just a drawn-out plot that keeps you in suspense while you wonder if she is going to end up with Steve at the end (the predictable ending), or another man who is in love with Mary, but whom Mary does not love back.\n\nThere were many various annoyances in this movie, especially at the ending; I won't go into details as I don't want to spoil the ending, but let me tell you it was just plain dull.\n\nI have to admit Jennifer did a fine job of acting in this movie. Too bad she alone could not save this movie.\n\nMy score: 6 out of 10"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "=G=",
        "review_rating": "4",
        "review_title": "PPPPPPPPPPPPPPPPUUUUUUUUUUUUUUUUU!!",
        "review_detailed_main": "\"The Wedding Planner\" is an amateurish and perfectly awful series of contrived situations in which Lopez looks awkward and is upstaged by the more beautiful, poorly cast Nicholson while McConaughey is just his usual one dimensional, zero-depth self. Nothing works in the flick from the stupid statue scene to the ridiculous tango scene to the terrible horse scene to the horrible Italian accents, etc....one clumsy or rigged or sappy or obvious or sophomoric scene after another with lousy continuity and flow resulting in a more revolting than engaging watch. If you have to see this dog, wait for tv. It's bound to die a slow and agonizing death on the cable for years to come."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "ArizWldcat",
        "review_rating": "6",
        "review_title": "Cute, and mostly clean..not too bad",
        "review_detailed_main": "I rented this DVD not expecting much, and I was pleasantly surprised. It was a cute little fluffy romantic comedy and not as awful and I expected. They could have left out the lame statue scene and come out with a PG movie that my younger kids could watch. IT's a shame they felt they had to include the silly \"body parts fall off\" scene in order to attract viewers to this film. Creative minds surely could come out with a funnier scene that was PG rated, don't you think? I'm on a soapbox again with my \"why did we need PG13\" thing. I mean, really...if you have elementary aged kids, you can't take them to anything but mostly lame made for kiddie movies (with a few rare, and I mean RARE exceptions)...in the old days screen writers had to be delicate but it could be done. As a child, my favorite movies were not kiddie movies, but things like \"the Sting\" and \"Butch Cassidy\"..Okay...back to the movie..it's a cute chick flick that doesn't deserve these horrible reviews, in my opinion."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "bsmith5552",
        "review_rating": "5",
        "review_title": "Jennifer Lopez as Sandra Bullock - Doesn't Work",
        "review_detailed_main": "\"The Wedding Planner\" seems to be Jennifer Lopez' attempt to break away from her sex symbol image. In this film she plays an unlucky at love, searching for Mr. Right, still living at home girl. To her credit this role is as about as far away as you can get from the real J-Lo. She attempts to hide her ample charms beneath a business suit and a pulled back \"professional\" hair style. Doesn't work.\n\nLopez, in a role more suited for Sandra Bullock, plays a wedding planner for the rich and affluent and who has no prospects of her own. Along comes Doctor Matthew McConnaghy with his dimples and perfect teeth who just happens by and saves our Jennifer and her shoe from a rampaging dumpster. Naturally they fall madly in love, or so it seems. Turns out old Dr. Matt is engaged to a high society miss (Bridgitte Wilson) who just happens to be Lopez' latest client. Well you know the rest. That's how predicable the story is.\n\nLopez simply is not believable as a plain Jane loser at love. McConnaghy's role would have come off better had his character been the cad that Lopez originally thought him to be. Instead we get a one-dimensional Hollywood pretty boy stereo type of performance.\n\nAmong the supporting characters, Judy Grier as Lopez' assistant is good but is not given enough to do. Alex Rocco stands out as Lopez' father who tries to \"fix\" his daughter up with a husband (Justin Chambers). Fred Willard is wasted in an all too brief appearance as Basil St. Mosely the dance instructor.\n\nYou know what the ending will be as soon as the main characters meet. It is a little unbelievable how easy Wilson accepts being left at the altar by McConnaghy and you have to feel sorry for the Chambers character when he too is unceremoniously dumped by Lopez.\n\nA forgettable movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "A Good Light-Hearted Chick Flick Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "shaz125",
        "review_rating": "7",
        "review_title": "The best, the bad and the low rated parts of this film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "JamesHitchcock",
        "review_rating": "3",
        "review_title": "The Iron Laws of Romantic Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Steve R",
        "review_rating": "",
        "review_title": "I was shocked that I liked this film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "gbheron",
        "review_rating": "3",
        "review_title": "No Spark",
        "review_detailed_main": "I'm not a big fan of romantic comedies. The premise seems so simple, but the execution seems daunting. Not too many work, except for the generation of box office receipts. (Which I guess IS everything). For whatever reasons lots of people go see this tripe. Case in point, \"The Wedding Planner\". It's a mess, the critics hated it, but it pulled in the loot. Why? Plot is not an issue, the're all simplistic, and \"The Wedding Planner\" is no exception. And there has to be chemistry between the main characters. But here, there's none at all. Jennifer Lopez seems willing, but Matthew McConaughey is sleepwalking through his role, and uninterested in his leading lady. With no spark the movie fails to ignite, and just sits there wasting your time. Avoid."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "canuckteach",
        "review_rating": "7",
        "review_title": "Passable Romantic Comedy",
        "review_detailed_main": "Hollywood really struggles producing these romantic comedies - they seem to overflow with predictability, and, too often, mean-spiritedness. Bollywood does these things better, since they have invented several harmless ways to get the guy and girl finally together. Having said that, J-Lo and McConaughey have a little bit of chemistry together, and the supporting characters have some charm. My only complaint was the pacing - it was draggy in places - I don't mind being drowned in syrup - I just mind being drowned s-l-o-w-l-y in syrup. You can't beat the carefully-structured quick-paced Astaire-Rogers comedies of the 30's. Still 7/10 for a decent entry in the rom-com genre."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "xawn",
        "review_rating": "4",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "vanillatwister",
        "review_rating": "7",
        "review_title": "great at beginning but slows down",
        "review_detailed_main": "THis movie is a great movie at the beginning, with great wit and fun but it slows down in the middle of the movie for awhile until the end where it gets great again.... Matthew McConaughey is great in his part, he is a great actor and a thrill to watch (plus he's a babe), Jennifer Lopez isn't bad but can get on your nerves in some parts as she tends to overdramitize. Well worth your money."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "michaelRokeefe",
        "review_rating": "5",
        "review_title": "Wedding bells play a different tune.",
        "review_detailed_main": "Forget the hype. Nothing exceptional outside the two leading stars. This romantic comedy finds a doctor(Matthew McConaughey)falling in love with the woman(Jennifer Lopez)who is coordinating his nuptials as he prepares to wed his overly busy girlfriend(Bridgette Wilson). Cute and sweet love story. Lopez and McConaughey are charming and work very well together. Also in the cast are:Judy Greer, Kevin Pollak and Joanna Gleason."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "davispittman",
        "review_rating": "6",
        "review_title": "Kinda sweet",
        "review_detailed_main": "OK, let me start out by saying that this Jennifer Lopez 2001 romantic comedy is as predictable as predictable gets. That being said, it still is not a bad or poorly made film, it's just predictable. Jennifer Lopez does a good job in her role, and I thought she filled the shoes of the character well. As for Matthew Mconahey, I think I spelled that right lol, he is alright, not the best choice for the role of you ask me, but I didn't really hate him as the romantic interest for Lopez. Matthew is just slightly bland in the movie, I didn't really feel his energy or heart in it. Judy Greer is wonderful in her supporting best friend/coworker role. I thought she was enjoyable and funny. The chemistry was there, it just wasn't like electric or awesome, again, maybe if someone else would've played Matthew's role, then maybe the chemistry would have been better. The dialogue and writing is alright, I mean it's nothing too special, it doesn't bring anything new to the genre, which I guess it doesn't really have to, but a little more creativity would have been nice. When it's all said and done, I do enjoy this film, but I just don't think it's great, in other words, I've seen better when it comes to the romantic comedy genre. 6/10 for The Wedding Planner."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "eliran-2",
        "review_rating": "4",
        "review_title": "JLO stop trying at my expense",
        "review_detailed_main": "Jennifer Love Hewitt, who was considered for the role, IS an actress and could've made this movie much more entertaining as she has a sense of humor. JLO cannot act, she stinks at the same level as all the other I-can-do-it-all stars (namely Hale Barry, Paris Hilton and the likes). Comedy features are delicate and if ill performed can seem ridiculously uncomfortable (like all of Adam Sandler's movies), JLO seems to master that approach just the same in this movie.\n\nI won't spoil it for anyone, but let's just say that Matthew McConaughey and Alex Rocco save the day by being great actors and pulling their weight in the comic scenes. JLO does not... she's trying, I'll give her that, but it's just not good.\n\n4/10"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "gloriacostacruz-98512",
        "review_rating": "9",
        "review_title": "THIS IS THE BEST ROMANCE COMEDY EVER",
        "review_detailed_main": "A classic of the gender. Great history, actors, declarations... You just get close to Mary and her personality. Love it!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "iranu-74195",
        "review_rating": "6",
        "review_title": "established Lopez as a competent screen Actor",
        "review_detailed_main": "Not a big fan of Lopez, her music etc .. it's well produced and moves along. But, the odd thing about her, is that she holds the attention of the camera. Not sure how that is, but maybe she's a \"natural\". She doesn't over emote and has learnt to keep gestures small. This movie launched her imho - and even though I'm no fan I have caught some of her other schmaltzy movies ...and they simply work well. Her managemnet are also smart - in that they make sure the rest of the cast are quality actors rather than furniture. This film is adequate and well shot .McConaughey does his usual cocky-cool guy act (which is his only act)"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "MrGKB",
        "review_rating": "5",
        "review_title": "Attractive leads fail to redeem dubious script...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "rmobsessed",
        "review_rating": "",
        "review_title": "A great movie with an excellent cast ...and great comedy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mattdyson",
        "review_rating": "1",
        "review_title": "Dreadful",
        "review_detailed_main": "I was relaxed about this being a really bad film, having read the reviews. Unfortunately it was worse than I could've imagined. Normally there is one character in a romcom that you warm to but here that was not the case for me, despite the fact that I normally write the actors very highly."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "JoBloTheMovieCritic",
        "review_rating": "7",
        "review_title": "The Wedding Planner",
        "review_detailed_main": "8/10 - a romantic-comedy that doesn't take itself too seriously and gets the job done"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Asteri-Atypical",
        "review_rating": "2",
        "review_title": "It seems \"those who can't\" not only plan but also make movies...",
        "review_detailed_main": "This seems like a typical TV sitcom episode stretched out to fill a feature length film.\n\nEven for a simplistic, \"just fun\" movie, this one fails. While there are some stupid facets, it fails mostly by not having anything substantive to offer. It was aimed at the non-thinking. It was not funny enough to be a funny movie. It was too predictable to be mindlessly entertaining. There weren't enough interesting images or wonderful music to be appealing to the senses. The leads (Lopez, McConaughey) were too miscast and their characters too poor to be enjoyed as actors.\n\nWhile I know brain-dead movies are \"in\", it surprises me a movie like this would be released when it has so little else to offer (along with being especially \"brain-dead\"). I can't recommend this to anyone except preteens who still dress Barbie and Ken up in wedding outfits and have fantasy weddings for the plastic pair (which actually, come to think of it, sounds just about as entertaining as this movie). 2/10"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "lrn79",
        "review_rating": "3",
        "review_title": "silly",
        "review_detailed_main": "J-Lo; shes no Sandy Bullock or Julia Roberts. Leave Rom-Com to the experts. And whats with putting \"love Don't Cost A Thing\" over the end credits? How does that fit with the film? I think someone wants to sell a few more soundtrack albums!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Mimble",
        "review_rating": "3",
        "review_title": "TERRIBLE!!!",
        "review_detailed_main": "Some people may enjoy this film, but I thought it was incredibly boring. Generally I enjoy the movies I pay to see, but this was a bad one. It wasn't only because there was the most used plot (when that surfaced which was a very rare occurance). Nothing interesting happened, and for the first time in my memory, I was mislead by an ad.\n\nSome people may enjoy this, but be warned, it isn't brilliant and you may want a very large cup of coffee to help you stay awake, but I know that I walked out at the end wondering (a) how I managed to stay until the end without walking out, and (b) what ever urged me to go??"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "valentina555",
        "review_rating": "8",
        "review_title": "I liked it",
        "review_detailed_main": "There's a lot of hate on this movie, I mean yes it is a \"chick flick\" type of movie. My heart is not cold though and I found this to be quite wholesome. The storyline was not that original yes we get it but it was overall entertaining and it made my heart warm. Also, Jennifer Lopez was great in this movie, her character and her acting were on point and it fit well in the movie. I liked her \"virgo\" like organized, control freak character and I loved her outfits. I also liked how she radiated femininity and it was very heart warming, as I don't see much characters like this anymore."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "DriftedSnowWhite",
        "review_rating": "5",
        "review_title": "Alex Rocco (D), makes my skin crawl in any movie he is in.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "atomichappyguy",
        "review_rating": "",
        "review_title": "\"Plan\" to see this one!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "forionio",
        "review_rating": "3",
        "review_title": "Italians are written really badly.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "maxbrod",
        "review_rating": "3",
        "review_title": "YUCH!!",
        "review_detailed_main": "I can't believe there are people who liked this terrible movie. Sure, Jennifer Lopez is extremely appealing, but Matthew, whatever his name is, was terrible. Jennifer's father was pathetic. He has an accent, he doesn't have an accent. MAKE UP YOUR MIND. I know there are people out there who enjoy these \"mindless\" films. I guess that's why they make them. I like movies that challenge me, not insult me!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "bmajlesara",
        "review_rating": "1",
        "review_title": "Not even a good chick flick",
        "review_detailed_main": "I urge the audience to watch the trailer, that gives you a good picture and plot of the movie adequately that you don't need to waste 100 minutes of your time."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "zh84",
        "review_rating": "3",
        "review_title": "Contrived and silly, even by Hollywood standards",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "inkblot11",
        "review_rating": "8",
        "review_title": "Plan on being thoroughly entertained and touched by this film, Lopez will never look lovelier",
        "review_detailed_main": "Mary (Jennifer Lopez) is a rising star in the wedding planner arena. She has been garnering some pretty high profile weddings, in the San Francisco area, and turning them into beautiful and hitch-less affairs. So, when her boss (Kathy Najimy) hesitates at giving Mary a raise, the two strike a deal. If Mary can land the wedding of a wealthy socialite named Fran (Bridgette Wilson Sampras), Mary will become a partner in the business. Mary succeeds in winning over Fran and the wedding arrangements begin. Away from the job, however, Mary is gun-shy with men, preferring to spend evenings at Scrabble tournaments or watching the Antiques Road Show in her immaculate and super-organized apartment. One day, Mary's heel gets stuck in a grate as she is crossing a busy street. As she struggles to release the shoe, she does not notice that a truck is bearing down on her. But, Dr. Steve (Matthew McConaghay) does. He grabs the beautiful young woman and pulls her to safety. Later, when Mary invites him to go an outdoor movie in a lovely San Fran park, he accepts. They have a lovely evening together, one that almost ends in a kiss. Yet, each of them hesitate and the moment is gone. Soon after, Mary learns why Steve pulled back from her....he is the fiancé of go-getter Fran! Should Mary continue to plan the wedding, even though she feels drawn to handsome Steve? And, isn't he a rat anyway for flirting with another woman while counting down the days to his own wedding? This is a very nice movie, with a lovely setting and a sweet story. Lopez will never look more beautiful than she does here, for she is utterly gorgeous, from her enchanting costumes to her long, lovely hair. For those who feel the need to show off their forms in skimpy costumes, think again. One look at Lopez in a high-necked black dress and rose-colored sweater and you will realize that true beauty is elegant, and not a mere flash of flesh. J-Lo also gives a sweet performance as the lady looking for an earth-moving love. McConaghay is fine as the mixed-up groom and Wilson has her tole as a spoiled heiress down to a T. The rest of the cast is also nice. The whole production looks very attractive and eye-catching, to say the least, from the scenes in the park to a winery setting and on to Lopez' lovely apartment. If you love romantic comedies, this one should be one your top twenty list, absolutely. But, even if you think romcoms are for chicks only, take a chance with this one. You might be surprised at how much fun these movies can be, in between the required lovelorn gazes, of course."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "nablaquadro",
        "review_rating": "3",
        "review_title": "Same old story ! [3/10]",
        "review_detailed_main": "Every time you give credit to these kind of comedies 9 times over 10 you'll remain disappointed. You say yourself that probably they couldn't serve you the same soup as did several times ago. Another good reason can be J.Lo, which is a quite good actress, it's true.\n\nTo stay at home with your girl or your family it's probably a good choice (well, not for you, but for her), but there's a limit this film has overcome. Not a more predictable, nonsense story could have been invented. People in love at first sight, weddings crashing on the altar and runaways of brides. The script is stuffed with some comic gags (a bit vulgar, like the scene of the statue), and the eccentricities of Massimo and his family. At least they spared us the typical gay friend ! Too little to save the weak plot, clear pretext to give J.Lo a role and make a rich box-office.\n\nThe direction is decent (the budget was quite considerable!), as for the soundtrack and the two good starring actors. Surely, a classic in the genre, a must see for women on the point of wedding. Otherwise, it's a romantic, ordinary comedy for lovers only."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "steph_hhh83",
        "review_rating": "",
        "review_title": "wow!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "reaperkit",
        "review_rating": "3",
        "review_title": "Seen the trailer? Seen the film...",
        "review_detailed_main": "After seeing a trailer for this film, I thought that it seemed an interesting subject - especially the \"those who can wed, those who can't - plan\" line.\n\nHowever I was reasonably disappointed about it as a whole. What plot there is seems so thin its transparent. A combination of \"movie\" law and common sense reveals the entire run of the film from about ten minutes in.\n\nA bit of a disappointment."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Wizzz",
        "review_rating": "2",
        "review_title": "You'd better stay at home",
        "review_detailed_main": "I've rarely come out of a movie this angry about having wasted my time. The beginning was okay, but soon the whole plot became predictable as the characters stayed shallow.\n\nWell, all in all I can only recommend to stay at home or do anything but watching this movie. Unfortunately, even Jennifer Lopez could not even save part of the it."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "michaelflatley",
        "review_rating": "2",
        "review_title": "To Watch or Not to Watch",
        "review_detailed_main": "Horrible, horrible, horrible.\n\nHorrible acting (esp by Jaylo). Horrible directing. Horrible screenplay.\n\nWorst movie I ever saw."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "history_girl",
        "review_rating": "2",
        "review_title": "Could have been better",
        "review_detailed_main": "What could have been a good movie (although terribly predictable) was completely ruined by Jennifer Lopez. Her acting isn't the best - but the worst thing was that she is meant to be Italian in this film and even I can hear the accent. And also - why did her song have to be played through the end credits?\n\nThat one casting area completely made this movie worse - a different leading lady may have gotten the film to 5 or 6.\n\nThis storyline has been used perhaps one too many times. There was some over-acting by support cast, which I feel was meant to be funny but the punch line just doesn't make it across. The leading man, Matthew was OK and at least convincing for the most part in his role.\n\nFran's parents were annoying and I think the singing thing was a bit unnecessary. As for Mary's parents, I just didn't believe them - I think this is again due to the casting issue.\n\nDon't watch it, try While You Were Sleeping instead."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "bellino-angelo2014",
        "review_rating": "8",
        "review_title": "Very good rom com that it's not that bad as its rating of 5,3 might suggest",
        "review_detailed_main": "Sometimes rom coms have very different groups of opinions. While there are some classics of the genre such as HARRY MET SALLY or SLEEPLESS IN SEATTLE, there are others like THE WEDDING PLANNER and few others that are quickly forgotten and with low scores. I really liked this movie for what it was.\n\nMary Fiore (Jennifer Lopez) is a successful wedding planner that despite her occupation is not interested in new relationships. After she flees from Massimo, a childhood friend that loves to putting her in embarassment, she risks death on the street when a wheeled dumpster goes down at maximum speed on the road. But she is saved by Steve Edison (Matthew McConaughey), a young medic, and soon a love relationship begins. Unfortunately, after a while Mary discovers that Steve is engaged to Fran Donnelly (Bridgette Wilson) and the wedding is organized by Mary's agency! Despite Mary eventually begins to date Massimo and finally accepts him, she feels that Steve is her true love. After Steve eventually leaves Fran, he races against time for helping Mary in stopping her relationship with a man she doesn't love. After Massimo understands this, he leaves her and finally Mary and Steve can stay together.\n\nI personally liked the movie because it relies on the message that true love will never end for a person despite sometimes other people would stop it. Jennifer Lopez gives one of her best performances and she really is the soul of the film. And she really didn't deserved the Razzie nomination that year. Matthew McConaughey is very likeable despite being also a bit goofy, but he was right in character. Most of the supporting actors fare from scene stealers to annoying. The soundtrack is very good despite not having Lopez's songs in it.\n\nDon't trust the overall rating and most of the reviews too much, because I think that if you are in the right mindset (just like me when I saw it) you may like this movie for what it is."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "1",
        "review_title": "A Man and a Woman fall in Love.",
        "review_detailed_main": "Man, that idea has never been done in a film before huh? I can't think of any other movie in which that happens. Hmmm, perhaps THE WEDDING SINGER, WHAT WOMEN WANT, MY BEST FRIENDS WEDDING ETC ETC ETC.\n\nCome on Hollywood! Why do you insist on constantly churning out this foul junk? Give us something new for a change. I mean EVEN THE POSTER WAS TRASH. A white background with just the 2 main characters and nothing else. Um...hasn't that unimaginative poster design been done to death too? Jeez!\n\nI won't torture you with details of the film except that Jennifer Lopez shouldn't act anymore, should stop impersonating Sandra Bullock's voice (you gotta admit that one) and should stop looking completely different every time we see her.\n\nHollywood! No one wants trash like this anymore! So stop making it! Plain and simple."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "XRANDY",
        "review_rating": "",
        "review_title": "If kept in perspective, not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "m_madhu",
        "review_rating": "2",
        "review_title": "third rate sap",
        "review_detailed_main": "the wedding planner was much worse than what i expected. i was prepared for an ordinary movie after the various reviews i had heard about it, but the movie shocked me with its total lack of wit. not one funny scene in the entire movie. the plot is hideous, the characters plasticky & stupid.\n\ni recommend this movie if\n\n1. you are 14, sentimental & have dovey eyes\n\n2. you have an IQ of under 10 & a seriously demented sense of romance.\n\notherwise, i recommend you go stare at a wall and be better entertained.\n\na miserable 2! (and the high rating is thanks to J. Lo, she looks awesome)"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mhhanson",
        "review_rating": "4",
        "review_title": "Erratic",
        "review_detailed_main": "This is one of the films that in the planning stages could have been great but decisions and weakness's prevented that from happening. Still at points strengths shine through followed by a scene that makes you feel boy did they blow that. Erratic. A couple places as good as the actors have done elsewhere other the worst they have done. Erratic.\n\nActing - in the park and dance not bad, some scenes OK, others are you reading a prompter this is bad. Erratic. Accents - are those from the appropriate ethnic groups laughing about them like I did over those in Fargo. They seem that bad.\n\nChemistry - a key to a romance. Same as the acting Erratic.\n\nContinuity - Erratic some scenes why here others why deleted.\n\nScript - With the like ability of the competing characters and Rocco's buildup this has the potential for uniqueness and greatness, but after the teasing goes to the by the numbers lines Erratic.\n\nAnd so I could go on. This is why this appears to be a very good or bad movie with little in between. Erratic it teases you and then does not come up to where it could be to do the by the numbers scene. If it had broken away it might have inspired more out of all involved. In all a slightly below average rating. The point where you did not waste time but not inspired."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "xawn",
        "review_rating": "4",
        "review_title": "Adam Shankman - AN EMERGING STAR",
        "review_detailed_main": "If you haven't watched this film you will ask yourself - Shall i watch it or not?\n\nIf you watched Mission to Mars, ITS THE SAME DIRECTOR - The luckiest director on the planet - Adam Shankman - who is granted a second chance in life to direct another film (with great actors also). They figured out, 'he's not good on action films, lets let him do romantic comedies'.\n\nAND HE COMES OUT WITH ONE OF THE WORST ROMANTIC COMEDIES OF ALL TIMES.\n\nThe latest news has it he is in to horror movies now. Probably he will pleasure us with some DRACULA movie in the near future. His ability for originality and twist in his films are something to admire. And what could be better than a VAMPIRE movie for his next!!!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "EmDee-427-469344",
        "review_rating": "1",
        "review_title": "Rubbish on all levels but the actors are the icing on the stink pile",
        "review_detailed_main": "I would write a huge review but I don't want to wast much more time on this stink pile, so I will do the bare minimum unlike the two lead actors in this movie who didn't even do that.\n\nMatthew McConaughey as a doctor was less convincing than 'ditzy eye candy' Cameron Diaz as one in Something About Mary.\n\nHe doesn't even act, he turns up every time, in every movie looking doe eyed at a woman and thinking he's smooth.\n\nJLo only turned up for the pay check too, since she plays the same character every time too. One dimensional 'in love' woman with a sad background story of at least one dead parent.\n\nHer music playing in the background as usual (and out of context most of the time). One example at the end where a song about her love not costing a thing plays- except her love did cost a lot of things including a few broken hearts.\n\nAh yes at the end it was neatly wrapped in a bow with both of their former loves happy and everyone happy, so those two could go off together into the sun set.\n\nThe end... barf."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "novagirl11",
        "review_rating": "8",
        "review_title": "quotable cute rom com",
        "review_detailed_main": "Might be predictable but still a quotable cute romantic comedy. This is my favorite film of Jennifer Lopez's acting and it's classic Matthew McConaughey. It's also funny to see Justin Chambers, who looks so different and plays such a different character from his role on Grey's Anatomy! But, I can't support the brown M&Ms supremacy...it's a waste of perfectly good chocolate!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "writey_mcscreenplay",
        "review_rating": "3",
        "review_title": "Why oh why would she be attracted to him?",
        "review_detailed_main": "One (actually two) scenes in particular best reflect what I think is this movie's problem. Steve (McConaughy) is throwing away peanut M&Ms, leaving only the brown ones. Mary (Lopez) asks him why he's doing this, and he replies that, since brown is the colour of chocolate, brown M&Ms don't have artificial colouring. Now, whether or not this is a major health concern for the average M&M eater is debatable, but Doctor (Doctor!) Steve overlooks one very important fact: M&M shells are made out of sugar and wax and are therefore naturally white in color. Brown M&Ms are just as artificially colored as any other. Not only does Mary fall for this inane bit of 'logic,' she starts throwing away non-brown M&Ms as well. She is presented in the movie as a level-headed, quick thinking, intelligent woman. Why then, I ask, why would she ever fall for a man who not only cheats on his fiancee but forms ridiculous theories, acts on them and advises others to follow his lead without ever finding out if he's actually right. And if she has no reason to be with him, the movie can't work as a romantic comedy."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Kind67",
        "review_rating": "",
        "review_title": "Jennifer Lopez is marvellous in this sweet romantic comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "movie_dude719",
        "review_rating": "4",
        "review_title": "The Wedding was Planned Neatly, The movie wasn't",
        "review_detailed_main": "The Wedding Planner: **\n\nThe first twenty minutes of \"The Wedding Planner\" are very enjoyable. It starts out very funny. Then the romance kicks in and it's sappy and predictable. Matthew McConaughey and Jennifer Lopez don't have the much chemistry. And you can't make a good romance without chemistry.\n\n\"The Wedding Planner\" is about Jennifer Lopez's character who is a wedding planner. One day, she is saved by McConaughey and they hit it off. Meanwhile, she has a big wedding to plan. And GUESS WHAT! The groom is McConaughey! Big surprise. Lopez gets angry and the two banter back and forth until he saves her again. And so on and whatnot.\n\nThe acting is alright, but there is no script. The actors try, but nothing happens. One thing I must say, though, Judy Greer (Jawbreaker) is hilarious as Lopez's fellow wedding planner. \"The Wedding Planner\" tries, but never gets there\n\n*Note: Look for Kathy NiJimy in her most... uh... glamorious role ever."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "rollernerd",
        "review_rating": "5",
        "review_title": "Defs a film to watch with the missus",
        "review_detailed_main": "Welcome to another edition of Adam's Reviews!!\n\n**queue intro music**\n\nToday's movie review is the romantic comedy The Wedding Planner (2001) is a romantic comedy, starring 2000s hotpocket Jennifer Lopez and super chilled bloke Matthew McConaughey where a successful wedding planner falls in love with the groom-to-be of her latest client. In the bustling streets of San Francisco, McConaughey's character, Steve, comes to the rescue of Lopez's character, Mary, in a chance encounter driven by a pair of high-end shoes. Their unexpected meeting sparks an instant connection, but complications arise as Steve is already engaged. As Mary juggles her professional responsibilities as a dedicated and meticulously organized wedding planner, she finds herself increasingly drawn to Steve. Working under the supervision of Kathy Najimy's character, a veteran wedding planner, Mary is portrayed as a utility belt-wearing professional, always prepared with essentials like fob spray, Evian, and sedatives. Despite her pragmatic approach to her work, Mary harbors dreams of her own fairy-tale wedding, a sentiment echoed in her iconic line, \"I'm the Wedding Planner,\" reminiscent of a superhero's declaration.\n\nAs their relationship blossoms, Steve, a man with idiosyncrasies like preferring brown M&M's, becomes enamoured with Mary. However, despite their growing affection, the chemistry between the actors falls flat, affecting their comedic timing and overall energy. This lack of spark makes it challenging for viewers to invest in their romantic journey. Amidst these shortcomings, the film showcases glimpses of San Francisco's charm, including a notable scene featuring a screening of the classic film \"An Affair to Remember.\" This cinematic reference serves as a poignant backdrop to Mary and Steve's evolving romance, touching on themes of love, fate, and the enduring power of human connection.\n\nOverall 5/10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "robinhio84_",
        "review_rating": "3",
        "review_title": "Sort your M&Ms is the highlight: Yes it's that boring,",
        "review_detailed_main": "Jennifer is cool, but this movie has nothing going for itself. Other then a M&Ms meme.\n\nIt's the most stereotypical chick flick from the early 00s.\n\nGuys to yourself a favour and run away when this is turned on."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "snelling",
        "review_rating": "5",
        "review_title": "What a waste of talent...",
        "review_detailed_main": "It's not often that I walk out of movies so I'll just review the first forty-five minutes of this so-called 'chick-flick.' Two up-and-coming stars like Jennifer Lopez and Matthew McConaughey have no business being in this thing. Neither one has the talent to be thrown into starring in any romantic comedy, much less this one. The script is childish and even professional comedians couldn't make this mess work. Each of the characters is given a set of quirky traits that they carry like baggage throughout the story. They never step out of the molds made for them by the writers. They behave one way, each and every time that they're on screen. Utterly predictable. This was not a wise move for Lopez and McConaughey, making this film. They have dashed their credibility in this genre. I would even go so far to call it a career-killer if we, the public, didn't have such short memories. I've spent more than enough time writing about such an infantile movie. The director, Adam Shankman, should stick to what he knows best; choreography. Don't waste even an hour finding out that I may be right. If you must see this, please wait for it to be shown on cable.\n\nOn second thought, don't."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mucus",
        "review_rating": "8",
        "review_title": "Surprisingly good",
        "review_detailed_main": "I expected this movie to be predictable and disappointing. In fact, I am not a huge fan of Jennifer Lopez at all. But I was pleasantly surprised that not only is her character actually likeable, but she can pull off a comedy. There is a misconception about this movie that its about how she steals some other woman's man. This isn't really the case, and its alot more about how a woman whose life is surrounded with romance and actually has a much more pragmatic approach to love as a result of being burned before. And there is one part, I don't want to spoil it, where anyone who has ever had their heart broken by the one they thought would marry will relate to. I have to admit that scene made me cry, it was like they had taken that exact situation from my own life. For anyone who has been a romantic, but in doubt of whether they will ever find romance in their life, this is a movie you should check out. Sure, its predictable, but if it touches you, who cares?"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "famousgir1",
        "review_rating": "5",
        "review_title": "Nice Romantic Comedy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "lexus869",
        "review_rating": "",
        "review_title": "Reminder of First times in Love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "anthonydapiii",
        "review_rating": "5",
        "review_title": "Cast; Cliche",
        "review_detailed_main": "Cast was stellar.\n\nThe movie went super fast and had the well-known ending.\n\nAlways a good late night watch though."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "questl-18592",
        "review_rating": "4",
        "review_title": "The Wedding Fail",
        "review_detailed_main": "Underwhelming J.Lo + Underwhelming McConaughey + Super Generic Story = Lackluster movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Plan Without Lopez.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "deborahleslie",
        "review_rating": "3",
        "review_title": "it doesn't cut the mustard",
        "review_detailed_main": "I've never been even mildly impressed by Jennifer Lopez, but I thought I'd give this movie a chance. After all, I do like a good chick-flick. Unfortunately, there's nothing much that's good about this romantic comedy. I laughed a couple of times, and it was almost romantic, but the whole thing was just too unbelievable to be successful. True, Lopez looks lovely, but I'm afraid her acting left me laughing in all the wrong places. There was almost no chemistry between the two leads, and many of the characters were underdeveloped, which left them looking like they belonged in a cartoon strip. Sorry, Jennifer, but I would suggest that you leave romantic comedies alone for the time being."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sheila-hall60",
        "review_rating": "8",
        "review_title": "The Wedding Planner",
        "review_detailed_main": "I have just recently seen the DVD The Wedding Planner and I quite enjoyed the film. This is the type of film that I would class as a woman's film, I think there was things mentioned a woman could relate to but a man would rubbish it. This is the first time that I have seen Jennifer Lopez and her costar Matthew McConaughey in a film and I just thought that the acting was great. It was a very entertaining film with a story, no violence, no swearing. Until I watched this DVD I did not realise that there was such a thing as a wedding planner, I could have done with one of those when I got married, took the hassle out of everything. It was a pleasant film to watch and it was a pleasure to sit down and watch it, and I would recommend it to anyone."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "ToddGack69",
        "review_rating": "4",
        "review_title": "Biggest Chick Flick Ever",
        "review_detailed_main": "The two protaganists never gave me the sense of having much chemistry. I felt bored throughout the movie and not really caring about any of the characters. My only comment comes in the form of advice to Matthew McConaughey: Trim that Mullet!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Keynes Mutiny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "dkaszor",
        "review_rating": "4",
        "review_title": "Warning, use only in dire date related circumstances!",
        "review_detailed_main": "I've never really understood Jennifer Lopez's sex appeal, and The Wedding Planner just adds to my confusion. A friend of mine once called her the sexiest woman alive, but to me she seems like a mini with a trailer hitch made for a semi truck. She's not bad looking by any means, but really, are her looks worth the one billion dollars she has insured it for? Anyway I digress. As you probably know from the deluge of trailers flooding your television, The Wedding Planner is the new romantic comedy staring Jennifer Lopez and Matthew McConaughey. Lopez plays Mary, a Wedding Planner so good that she makes as much business for her firm as all the other wedding planners put together times five. She's also a total neat freak and organizer, a person who folds her shirts and blouses around a piece of sheet plastic to keep them flat. She might plan weddings but her own heart was broken when her fiance screwed her over. She meets Dr. Steve Edison (McConaughey) when he saves her life. They then proceed to go out on a sort of date and he fails to mention that he is getting married in three months. Of course it turns out that his wedding is being planned by Mary (what a shock) and it is also the most important job of her career. Most of this is straight from the trailer, no surprises. And for the most part that is the way that the rest of the movie goes, no surprises. I find it interesting that Lopez would choose a project like this however, because while not all of her movies are all that great, most of them are interesting and challenge norms (think The Cell, Out of Sight or U-Turn not Anaconda). The unfortunate thing about The Wedding Planner is that there are a lot of good character interactions here, but they are diverted and pushed aside because the female lead has to get together with the male lead in the end. The relationship between Dr. Steve and his fiance Fran (played by Bridgette Wilson-Sampras whom you may remember as Sonya in Mortal Kombat) is portrayed quite well. Although the problems in Fran and Steve's relationship are subtle and not given enough screen time, some of their scenes near the end of the movie work quite well. Along those same lines Massimo (played by Justin Chambers) does a good job endearing himself on the audience as the other man in Mary's life. By the end of the film you are quite ready to root for him over Dr. Steve. The romance between Steve and Mary however is quite a bit different. I never really saw the spark between the two of them. All I came away from the romantic scenes between the leads was that Steve wasn't ready to get married to Fran. The only real surprise is that, contrary to its assembly line style formula, there are quite a few funny scenes in The Wedding Planner. In fact, except for some of the labored romance scenes between Lopez and McConaughey almost every scene has some funny moments in it. Especially good in their roles as comic relief are Fran's parents played by Joanna Gleason and Charles Kimbrough. Also Mary's friends in her Scrabble club lend a few funny moments. While I certainly wasn't busting my gut laughing, the comedy made me forget about the tepid romance through most of the movie. So should you see this movie? Well, if you're hard up for a date movie, and don't mind some gratuitously placed Lopez music, go for it. The slightly above average comedy makes the so-so romance bearable. But only go to this one as a last resort, there are plenty of good movies in the theaters right now and nine to twelve bucks is a lot to spend on slightly above average comedy."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "maevapinot",
        "review_rating": "2",
        "review_title": "Nope.",
        "review_detailed_main": "Wow. I didn't expect to dislike a movie that much. I'm rather difficult in this type of movies but I forget any of my standards and try not to think of lots of things. But even trying to forget my 'standards', the scenes sometimes seemed too long (for example when someone is just waiting for the camera to stop, or looking in the horizon, without, of course, any music), the acting was OVERALL good BUT I really cringed at times, too many times for me to be happy about it. I didn't like the music, but this is just my taste in music that doesn't match. The plot-line was senseless. Sure, you don't look for extremely believable movies in that genre, but I still think this one is something else in that field. I'm not one to badly want a movie to end (Which actually only happened in the third installment of Hunger Games) but I was looking forward to the end of this one. All in all, I hope I'll forget that movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "ShortCuteBlonde",
        "review_rating": "4",
        "review_title": "not the best",
        "review_detailed_main": "this was not even close to being Jennifer Lopez's best movie ever, it wasnt even in the low 5 movies she has done, it was a cute and funny plot but really predictable and the acting wasnt that great or grand either so i gave it a 4/10 but take someone else's word for it or just take your's and go rent it, it was a funny movie but way too predictable."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "enddust",
        "review_rating": "4",
        "review_title": "Lost all respect for Matthew McConaughey",
        "review_detailed_main": "What more can you say about this insipid little film that hasn't already been said? Sure, there may be more stupid, girlish films than this, but thankfully I haven't had to see them. This movie has it all--convenient plot devices, unreal characters, syrupy sweet storybook plot, complete disregard for reality, etc. . . What in the world was Mr. McConaughey thinking when he took this part? (What was I thinking when I agreed to watch this movie?) How can I ever take someone seriously who acts in a film like this? On purpose? I'm not going to waste time bashing Jennifer Lopez--that's already been done by many a reviewer below and besides, it's like shooting fish in a barrel, plus her days in the spotlight are (hopefully) numbered anyway. She was great in Selena but this movie is nothing compared to that honest effort. Every once in a while a little bit of storybook fantasy is okay, but please make it a little more believable and a bit less syrupy . .."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "nicolynnpatti",
        "review_rating": "10",
        "review_title": "Song ends in divorce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "cooper-29",
        "review_rating": "2",
        "review_title": "Why, Oh why?",
        "review_detailed_main": "After I didnt think movies could get worse then Most Jerry Bruchimer movies, then comes along this little Gem that makes The Bachelor with chris O'Donnel seem like Shakespear. My one question after kissing my good hard damn money that earned, is why did I get cohearsed to go see this. I thought, maybe the romantic in me might get a sweet little smile on my face and like it like I like Xanadu. The smile turned to a cynical frown, if there is such thing. Whos the guy who wrote this movie and I want to go visit him and give him a piece of my mind, and a bill for the 8.50, I mentioned earlier. Bad dailogue, Characters that make no sense and scream eractically for no reason other than to get a chuckle out of the audience. God these charcters just made me really mad! This reinforces my theory that hollywood is asleep at the wheel. God I hope they dont make a sequel!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "elshikh4",
        "review_rating": "",
        "review_title": "Bad Drama !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "drewnes",
        "review_rating": "3",
        "review_title": "\"You smell like sweet red plums and grilled cheese sandwiches.\"",
        "review_detailed_main": "Oh Matthew McConaughey, I can see why you vowed to not do romantic comedies after a few years of doing them. This was not great. They even messed up his trademark hair!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "brooke-98054",
        "review_rating": "3",
        "review_title": "Nothing Special",
        "review_detailed_main": "Every time I see Jennifer Lopez in something it never fits. Maybe it's the roles she picks but it doesn't work for her. I kept hoping the movie would be great and that it would pick up but it didn't. Matthew McConaughey's character was terrible. I hated what he did even though it all worked out in the end. In reality it wouldn't have ended the way it did. I did love how strong Jennifer Lopez's character was though. The romance was not there between the two at all. So, overall it just wasn't worth it."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Spanner-2",
        "review_rating": "4",
        "review_title": "Bad ending ruins movie",
        "review_detailed_main": "This film, which stars Jennifer Lopez as a wedding planner who falls for groom Matthew McConaughey, is mostly formula stuff. It is mildly entertaining for most of the film and Lopez does a decent enough job. The film falls apart completely however in a completely misguided and unbelievable ending that basically ruins whatever goodwill the film might have generated to that point. GRADE: D"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Nocgirl72",
        "review_rating": "5",
        "review_title": "Very predictable and a little boring.",
        "review_detailed_main": "I really didn't want to see this movie but the one that me and my friend wanted to see was sold out so we saw this as a backup. Jennifer Lopez does nothing for me but I like Matthew McC. so I agreed to see it.\n\nThe movie was well casted as Jennifer Lopez, being as exquisite, trendy, and fashionable as she is would make a good wedding planner. And you cannot help but swoon over Matthews gorgeous dimples and smile but all in all, I was able to predict how the movie was going to end. It had a very basic, bland script and I actually had trouble staying awake during this movie and soon could not wait for it to end. The actors did okay with what material they had, but the plot and the ending is very predictable.\n\nFor those people who truly are obsessed with Jennifer Lopez or Matthew McC they will enjoy it. For serious movie goers who really like well written, entertaining movies, this one is a dud. I give it a 5/10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Aurora-38",
        "review_rating": "8",
        "review_title": "Highly enjoyable",
        "review_detailed_main": "I have to admit, going into the theater, I didn't think that this movie would be very good. But I was pleasantly surprised. Matthew and Jennifer make a cute couple, and they make the film incredibly enjoyable. Though the beginning starts out a little slow after a while I couldn't help but smiling and laughing. Obviously, the believability of the movie is limited, however, in the end, I cared about the two characters, which is enough for me! And as always, Matthew looks great!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "4",
        "review_title": "Lighthearted and typical",
        "review_detailed_main": "This film was apparently somewhat of a box office success and was number 1 at the box office for two weeks during its release. As a film the premise is relatively obvious and predictable. It is very lighthearted and not much cones by a surprise.\n\nThe end of the film is about how we knew it would end, to a certain extent (as in both leads ending up together). There are some decent moments but overall nothing that quite stands out or makes a big impact."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "a4021668",
        "review_rating": "",
        "review_title": "I like this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "MBlenks91",
        "review_rating": "4",
        "review_title": "Jennifer Lopez Stars Opposite an Old Matthew McConaughey",
        "review_detailed_main": "Jennifer Lopez stars in this film opposite Matthew McConaughey who, by the looks of it, used a time machine to transport his 72 year old self to 2001 to star in this movie.\n\nFor a film about a wedding planner, the script was very poorly planned. It's quite boring but Jennifer Lopez."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "TrockWilly",
        "review_rating": "2",
        "review_title": "If you're a guy and you're with a girl--act like you like it.",
        "review_detailed_main": "What a waste of time(2 hours) and tons of money (mine and theirs) I wanted to \"walk out\" of this movie but I couldn't--I was in my own house with my girlfriend. Guys-stay away from this movie. 2 out of 10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "tonyhic",
        "review_rating": "2",
        "review_title": "Foul",
        "review_detailed_main": "There really should be laws against the publication of such smarmy material as this. Painfully predictable, sickeningly sentimental and excruciatingly conservative, this movie is actually a danger to society because many of its viewers will take it seriously."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "BuffDonky",
        "review_rating": "2",
        "review_title": "Where is my gong when I need it!!!",
        "review_detailed_main": "Somehow at the video store my wife and I ended up with 2 romantic comedies. No, pardon me, 1 excellent romantic comedy (Bridget Jones Diary) and 1 trite, horribly acted, atrociously scripted, astoundingly unwatchable, unromantic snoozefest (The Wedding Planner). Matthew McConaughey and Jennifer Lopez have zero chemistry in this movie. The comedy...hmm..other than a couple of inferences to McConaughey's rumored homosexuality there was none to be had. The Wedding Planner had zero twists to the plot that were not telegraphed in the first 5 minutes. What can I say....this movie gets a 3/10 at best.\n\nIf the choice must be a romantic comedy guys, get Bridget Jones Diary or even Americas Sweethearts. Avoid the Wedding Planner and The Princess Diaries (More crap although not half as bad as this one if you can believe that!)."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jenoveal",
        "review_rating": "10",
        "review_title": "A classic rom-com",
        "review_detailed_main": "I adore this film because for the first time ever there was a Latina as the lead actress in a Rom-Com and Jennifer Lopez really delivered and her acting is absolutely incredible. I love the chemistry between her and Matthew, it will always be one of my favorite romantic comedies. Jennifer Lopez really is the queen of rom-coms and she knows how to play the part so well. Matthew does so well in romantic comedies he's such and underrated actor both him and Jennifer have shown that they can take any movie role and deliver an amazing performance. This was Jennifer's first romantic comedy and she really did that!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Lily-32",
        "review_rating": "4",
        "review_title": "If not but for the main plot point of the premise.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jENNA007",
        "review_rating": "",
        "review_title": "this movie is a Wedding Singer-wannabe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "CADILLACcat",
        "review_rating": "2",
        "review_title": "Mediocrity would have been an improvement",
        "review_detailed_main": "If Matthew McConaughey wasn't in this movie I WOULD have rated it a 1. Jennifer Lopez's fifteen minutes are OVER for God's sake. I will admit - reluctantly - that her performance in 'Selena' was noteworthy but trying to squeeze her derriere into a Julia Roberts-type of role was far too risky and proved to be a disaster. Do NOT, ever, under any circumstances, watch this movie. Not for lack of something better on cable, not on a long airplane trip, not in a doctor's waiting room. Trust me, sleeping is much more entertaining."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Kamurai25",
        "review_rating": "4",
        "review_title": "\"Dumb Dame Dreams\"",
        "review_detailed_main": "Underwhelming watch, probably won't watch again, and can't honestly recommend.\n\nI think my biggest problems with this are that I can't honestly appreciate Matthew McConaughey or Bridgette Wilson-Sampras despite the quality of their acting: it's like a really well made pie in a flavor you don't like. As much as I like Jennifer Lopez as an actor, we start on the end of a movie I'd rather see with Bree Turner, and I feel like I would have rather seen Judy Greer in the lead, she seems about as Italian as Jennifer Lopez.\n\nI understand when the meet-cute is a life-threatening situation where adrenaline causes chemical confusion, but this is sort of a head injury causes an almost \"love at first sight\" cliche, but mixed with an \"unavailable romance\" cliche.\n\nOnce we establish that she loves weddings and it's important to her for some reason, it's a lot of him (not) pursuing her because he's getting married, and her trying to be respectful, but honest.\n\nThe movie highlights more societal problems for people that can afford big weddings, or, in short, there is more dumb than funny in this.\n\nI'm not even going to say this is a bad movie, but it's not impressive, and just not for me."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "abelishka",
        "review_rating": "5",
        "review_title": "Cute, if a bit trite",
        "review_detailed_main": "J-Lo does well, though it's hard to believe that someone as beautiful as her character is a complete shut-in with no romantic entanglements in the past, present, or foreseeable future...however, she's cute and fun to watch. This is a pleasant experience when you want to let your brain take a vacation."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Jalow547",
        "review_rating": "4",
        "review_title": "A terrible, stupid, nonsense movie",
        "review_detailed_main": "I don't think even the biggest romantic comedy fans out there enjoyed this one. The writing is just so very sloppy and lazy that the film should never have been made. They thought they could get away with just putting together ever single stereotyped cliche from every other romantic comedy and people would flock to see it. Well I'm sure it worked. With these actors, I bet a lot of people went and saw it, and I'm sure it made money, but it sure was terrible.\n\nIt's full of terrible jokes and scenes that don't make any sense, bad characters and side plots, and poorly written dialogue. I gave it a whopping four stars out of ten instead of something less than that only because...wait, why DID I give it four whole stars? I don't know. I really don't. I guess I must be in a good mood or something, but I don't know why. After all, I just watched a truly terrible movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sksolomonb",
        "review_rating": "10",
        "review_title": "One of my favorite romantic comedies",
        "review_detailed_main": "I am a bit surprised to learn several reviewers did not like \"The Wedding Planner.\" However, they just did not \"get\" the way the plot is constructed, blending the plot of \"Cinderella\" in reverse and adding bits of \"A Midsummer Night's Dream\" by William Shakespeare. Very early in the film, Mary loses her shoe in a manhole grate and is rescued by Dr. Steve, just as Cinderella loses her shoe toward the end of the fairy tale and then has it replaced by the Prince. In both plots, there is the element of \"love at first sight,\" something that charms every fan of romantic stories.\n\nSoon Mary learns her \"Prince\" already is engaged to Fran, her most important client. Of course, this brings an element of disappointment as we want the neglected, down-trodden girl to get the \"Prince\" in the end, but how will this happen? Some reviewers accused Steve of cheating on his fiancee', but actually the engagement is proving to be lackluster and a mistake from the beginning because Steve and Fran want totally different things from life. Steve is a \"people person\" with altruistic values who unselfishly cares for and about his patients. Fran and her rich parents are \"users\" who invested in some sort of medical corporation, and they expect Steve to give up his medical practice to become their spokesman. Steve is totally unaware of this hidden agenda, and this adds to the tension as the viewer realizes Steve is about to be victimized.\n\nAnother element of the \"Cinderella\" plot is the ball, which takes the form of the ballroom dance lesson, led by Fred Willard, in which Mary and Steve dance together. Fran's indifference to her own wedding is shown when she devotes the dance lesson time to making a business call. This scene shows that Fran and her parents are all about money and using people to make more of it, whereas Steve and Mary are sincere, people-oriented individuals who know love is the greatest gift.\n\nThe elements of \"A Midsummer Night's Dream\" are the movie-in-the-park scenes which resemble the forest in Shakespeare's play. Furthermore, he elderly friends of Mary's father are like the sprites who encourage and confuse the two pairs of lovers in the play. At first, the two blonds (Fran and Steve) are a couple and the two brunets (Mary and Massiimo) are a couple, and then the switch takes place when Mary and Steve spend more time together. The reverse-switch takes place when Mary and Massimo briefly consider marriage, and then Mary realizes Steve is her true love after all.\n\nThe \"Cinderella\" plot in reverse comes to fulfillment in the later scenes of Mary at home with her father and his friends and when someone explains how Mary has been affected by her mother's death. In \"Cinderella,\" this is told at the beginning and shortly after the \"Once upon a time\" opening line of the story.\n\nI really cannot say enough about the beauty of this film in regard to the settings, wardrobes, romantic music, chemistry between the romantic leads, and the way it combines the two classic plots of \"Cinderella\" and \"A Midsummer Night's Dream.\" I believe it truly is a gem of a film and always will be my favorite."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "zootercar89",
        "review_rating": "10",
        "review_title": "The Best Movie!!! A Must See",
        "review_detailed_main": "The Wedding Planner was the best movie i have ever seen. This movie made me realize what i really wanted to do with my life. In three days i had already watched the movie 10 times, maybe you wont be as obsessed but the movie had a different meaning to me. All my life i would watch movies over and over again wishing that i was that person living their perfect little life, and now i'm realizing that i want to be an actress, and live their perfect life instead of wishing i did."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "redheads-1",
        "review_rating": "10",
        "review_title": "A really good romantic comedy",
        "review_detailed_main": "This movie is really good. It contains lots of little details that make it NOT just another fluffy Romantic Comedy. The characters are incredibly well developed, its funny, warm hearted and real. The plot is refreshingly unpredictable. This is J-Lo at her best as Mary Fiore, the lonely, control freak wedding planner whose been in the business so long she can predict the odds that a marriage will or will not turn out by the colour of the brides maids' dresses and the choice of wedding song. Matthew McConaughey is the Doctor whose wedding she is planning and, along with his beautiful fiancé, played by Bridget Wilson, who are making all the wrong choices, at least in Mary's mind. Meanwhile Mary's father tries to set her up with a nice Italian boy (Justin Chambers)--her childhood playmate who made her a doll house back in Italy. The Wedding Planner is one of my all time favorite movies--the kind you can watch again and again and still enjoy it!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "theregistry",
        "review_rating": "10",
        "review_title": "A better Valentine than VALENTINE",
        "review_detailed_main": "Don't, I repeat, DO NOT take your Valentine to see VALENTINE. Take them to see THE WEDDING PLANNER. It is a sweet, romantic comedy that avoids syrup and jumps up the comedy. I was expecting your standard fare as far as romantic comedies go, but I was pleasantly surprised when I laughed out loud throughout the film. Even my action-flick-devotee boyfriend enjoyed the comedy of THE WEDDING PLANNER. Jennifer Lopez and Matthew McConaughey seemed to be having a good time together, and I'm definitely happy that Brendan Fraser was not the love interest here. It would NOT have worked. McConaughey's charm, paired with Lopez's sweetness really make an excellent combination. I definitely recommend that you see this film, and ignore the jaded critics who aren't ALLOWED to like a film like this."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "maria_jiovannis",
        "review_rating": "10",
        "review_title": "Lovely - Excellent romantic comedy!",
        "review_detailed_main": "I liked this movie very much. It was lovely, funny (I was laughing all the time in the cinema), very romantic and all the characters were excellent, so Jennifer Lopez, Matthew McConaughey and ALL the other characters, even and the unimportant. I woke up the next day and I said that it was worth to see this movie. I suggest you to see \"The Wedding Planner\". Jennifer Lopez plays her role very well and she makes you to love all the movie. I love it!!!!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "eanymelissa",
        "review_rating": "10",
        "review_title": "A classic romantic comedy anyone can enjoy.",
        "review_detailed_main": "The Wedding Planner has a romantic storyline without being syrupy or sappy. There is a lot of wit and humour in this script, which provides a nice balance with the romantic theme. Jennifer Lopez and Matthew McConaughey really have great chemistry throughout the film. The dance scenes between Lopez and McConaughey worked extremely well -- they practiced and it shows. Jennifer Lopez's comedic timing was surprisingly good, and Matthew McConaughey was charismatic as usual. Be sure you keep your eyes open for the scooter-riding scene. I would definitely recommend this film to fans of the romantic comedy genre, Jennifer Lopez fans & Matthew McConaughey fans. A refreshing change of pace from the usual sappy chick flick."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "hellojenni",
        "review_rating": "10",
        "review_title": "Jennifer and Matthew shine in The Wedding Planner.",
        "review_detailed_main": "I just saw The Wedding Planner and have to say I absolutely loved it. I left the theater smiling from ear to ear with tears in my eyes. That's just what the movie does to you. Jennifer Lopez was delightful. She was so funny. She plays Mary, a very organized wedding planner. When you see the movie you'll see what I mean. I think it was a very refreshing change for Jennifer. It just goes to show that she's very versatile. Matthew McConaughey comes back from a small vacation in full force. He literally cracked me up. He plays Steve, a life-saving pediatrician. Put the two together and you have a great, fun loving movie. I definetely recommend this film for everyone. I took my daughter to see it with me. She usually gets bored after thirty minutes but actually sat through the entire movie. We both left the theater loving The Wedding Planner and you will too. It's a laugh out loud romantic comedy. So, go on out and see it, you won't regret it."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "cauz",
        "review_rating": "9",
        "review_title": "A Film Worth Seeing",
        "review_detailed_main": "I read through the other comments from the \"Wedding Planner\" and I was surprised to find that there are so many who are disappointed. I feel quite different. It´s a movie in my taste, could be predictable, but I prefer not to hang up on that, instead watch the film as it is.\n\nLopez and McConaughey are really good actors and they do their own parts as it was real life. The \"Love-theme\" in the film is the keyword and I don´t see anything bad in that. Love is something you trip and fall over day after day, at least the feelings inside.\n\nIt is a cute film, worth seeing a lot of times. The romantic comedy is there, and I laughed: a lot! And I also cried at times when things did go wrong. Life ain´t easy all the times and you could sort of \"play\" in the movie yourself, be a part of it. It´s a great film!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Catherine_Grace_Zeh",
        "review_rating": "10",
        "review_title": "Very heart-warming romantic comedy",
        "review_detailed_main": "The day I first saw this movie, I was with my father, my stepmother, and my stepsister. We had originally planned to go bowling, but it was too crowded, so we went to the movie theater instead. Anyway, in my opinion, THE WEDDING PLANNER is a very heart-warming romantic comedy. I thought that Mary (Jennifer Lopez) and Fran (Bridgette Wilson-Sampras) looked very beautiful in all their dressy clothing, especially their wedding dresses. However, if you ask me, Massimo (Justin Chambers) was a crazy man. Before I wrap this up, I'd like to say that this film really touched my heart and made me feel good. Now, in conclusion, I highly recommend this smash hit to all you Jennifer Lopez or Matthew McConaughey fans who have not seen it. When you see it, prepare to have a good time and be touched."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "lovelyteancakes",
        "review_rating": "9",
        "review_title": "Amazing movie, deserves more love...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "nikfs1881",
        "review_rating": "10",
        "review_title": "Bravo J. Lo and Matt",
        "review_detailed_main": "This is one of the best romantic comedy i've ever seen...well, for those who has yet to watch this movie....this really is the must see movie especially J.Lo and Matt fans...Just ignore the obnoxious people who badly reviewed this masterpiece...well, for the record, J.Lo did hell of a job in acting and singing. As for Matthew, i am a big fan of his movies. So, one statement should be able to portray vividly Matthew's performance as an actor...Kudos!\n\nJ e n n i f e r\n\nL o p e z\n\nr o c k s"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "GodsLove4Ever",
        "review_rating": "8",
        "review_title": "Beautiful and Pure!",
        "review_detailed_main": "I really liked this movie! Though I wasn't planning on because it was just going to be another sappy story, I really liked it. The characterization of both Mary and Steve, and even Fran, was done very well. I also loved that this movie was wholesome. Anyone can see it because, for once, they didn't have sex. I also was very glad to see that Lopez had clothes on!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "navygirhl13",
        "review_rating": "10",
        "review_title": "A Wonderful Movie!",
        "review_detailed_main": "The Wedding Planner is Jennifer Lopez best movie. It has beautiful acting and casting was great. If anyone has anything to say bad about this movie they have no love for movies. The best part is all about the M&M's. It is a Wonderful movie!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "CiCi33",
        "review_rating": "8",
        "review_title": "OMG!",
        "review_detailed_main": "This movie was good! really good!~ i didnt think i would of enjoyed it but i did!it was just a good plot n VERY exciting ..:) i think that this is very romantic film and i could watch it over and over again ! and i think that Jenifer did a great job acting as well she really got into the part n she let u know what she was feeling ! it was just great!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "didibabez",
        "review_rating": "10",
        "review_title": "WHAT I THOUGHT OF STEVE AND MARY!!",
        "review_detailed_main": "I saw \"The wedding planner\" today..I have to say it was a great..awesome...beautiful movie...I enjoyed it a lot. It made me laugh, cry, and it made me think about my own relationship too. I could see this over and over and over again. Steve and Mary made a great couple. This is a must see movie...I loved it...."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "charleswott-40657",
        "review_rating": "10",
        "review_title": "We have clichés because they work. This movie works.",
        "review_detailed_main": "Yeah, this is a pretty by-the-numbers romantic comedy. But I love it because it handles those common tropes really well. I'm a guy (last time I checked) and I realize I'm not the target for this, but to me, this movie is good enough to watch over and over. All of the acting seems good to me, the chemistry between the leads is definitely there, and the jokes are funny. Maybe it's exactly like fifty other films, but I haven't watched those other fifty films. I keep coming back to this one, and I enjoy it every time."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "dockerykelli",
        "review_rating": "10",
        "review_title": "Such a wonderful film to enjoy!!!",
        "review_detailed_main": "The Wedding Planner is such a light and warm movie!!! Beautifully shot!! The overall cast made the movie even better in my opinion! The storyline was great as well. It has love, laughter, silly antics, light intense moments!!!! I WOULD HIGHLY RECOMMEND THIS MOVIE TO ANYONE ABOVE THE AGE 13+!!!! A+++ Film."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "movies2u",
        "review_rating": "",
        "review_title": "A Fun Laugh Aloud Romance!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "oxkeithurbanxo",
        "review_rating": "10",
        "review_title": "oh. my. gosh.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Sargebri",
        "review_rating": "",
        "review_title": "THE ULTIMATE CHICK FLICK",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Catherooxx",
        "review_rating": "10",
        "review_title": "Definitely a date-worthy movie!",
        "review_detailed_main": "I was hesitant about seeing The Wedding Planner because the previews made the movie seem so corny or cheesy, but I was 100% wrong. It had the right amount of comedy in it and I either was laughing or really caught up in the drama. My $8 was well spent and I honestly would go see this movie again (and I do plan on it!)"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "MFalcon1275",
        "review_rating": "",
        "review_title": "Charming movie with nice blend of romance and comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "kimmelaf13",
        "review_rating": "10",
        "review_title": "Sparks Fly",
        "review_detailed_main": "The movie 'The Wedding Planner' was funny as pigs barking (thats very funny in my terms)! Sparks flew between Matthew and Jennifer and they looked and worked so great with each other. The humour in this movie was great and made me laugh out loud. And who wouldn't want to see that $100,000 butt of Jennifers?? ;) !! So stop reading this comment and get out there! See the Wedding Planner today and I guarantee it will be well worth the $8 for your ticket!!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mattkratz",
        "review_rating": "",
        "review_title": "decent film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "amber-154",
        "review_rating": "10",
        "review_title": "The Funnies movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mfalkenberg",
        "review_rating": "",
        "review_title": "will become a romantic comedy classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "maddsmad_13",
        "review_rating": "10",
        "review_title": "Wedding Planner",
        "review_detailed_main": "I loved the Wedding Planner, it was so romantic, but also sad. I smiled and cried through the whole movie. I thought it was excellent and am going to recommend it to all of my friends! Matthew and Jennifer, I thought, had great chemistry. The plot was fantastic and the music was great. I love romantic and sappy movies, so this movie was perfect for me! It also had so comedy in it, which just as it was getting sad something would lift the mood of the scene. The Wedding Planner is one of the best movies I've seen in a long time, with tears, laughter, happiness and sadness! If you liked the movie I suggest Monster-In-Law or Maid in Manhatten, which both include Jennifer Lopez as well."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "shjung5",
        "review_rating": "",
        "review_title": "Wow! Matthew McConaughey",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "gracydumez",
        "review_rating": "10",
        "review_title": "The right time to get your ex back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Caitlin McMillen",
        "review_rating": "",
        "review_title": "Family Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "bekka213",
        "review_rating": "10",
        "review_title": "Sweet, Romantic and Funny.",
        "review_detailed_main": "I thought this movie was really cute. Although I did not find much chemistry between McConaughey and Lopez , it gave me hope that there is someone out there for everyone. Jennifer Lopez was very funny--I was surprised she had such comedic timing. And it was good to see Matthew McConaughey in another lighthearted role. Love that Accent!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "I like romantic comedies, but this made me want to puke...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "MickyG333",
        "review_rating": "8",
        "review_title": "Entertaining and fun",
        "review_detailed_main": "7.8 stars.\n\n'The Wedding Planner' is a fun and entertaining film. What more is needed to rate it above 5 stars? I mean, let's be realistic, sure it's cheesy, somewhat of a copycat of a dozen other films about weddings, no doubt, but it's a well made movie and the acting is good and it's not a disappointment. So why the low rating? Oh well, who cares I suppose, but I wish people would be more forgiving, just because they may have such high expectations, totally inflated ones perhaps...sure JLO was no Julia Roberts, and Matthew Mc. Is no Brad Pitt, but they both hold their own quite well. There is decent chemistry, the supporting cast are skilled and charismatic...I rate films based on rewatchability and entertainment. This fits the profile of something I'd watch every 5 years or so. I've seen it thrice, maybe four times. The scenes in the park are classic, with the dancing and the old films. A sound romance this is."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Comedy fluff, but McConaughey and Lopez are delightful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "pattiwilson",
        "review_rating": "10",
        "review_title": "Matthew and Jennifer were great together.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Philby-3",
        "review_rating": "",
        "review_title": "Glossy garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sierrawhatley",
        "review_rating": "8",
        "review_title": "Unpopular Opinion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "grundle-4",
        "review_rating": "",
        "review_title": "If you like this film, you will never find true love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "roshanpr-40457",
        "review_rating": "9",
        "review_title": "Good One",
        "review_detailed_main": "Nest Matrimony Marriage is a crucial turning point in everyone's life, either for the better or for, the worse. A thoughtless approach in a marriage decision can ruin two people's future and their families. Remember, your life companion is going to be with you at every moment of your life - be it the ups and downs, good and bad, success and failures, or pleasure and pains. Nest understands how important the decision of marriage in one's life is. That is why Nest came forward with a user-friendly matrimonial site enriched with an authentic database. Muslim matrimony, a leading matrimonial site exclusively for Muslim brides and grooms, has helped thousands of find their soul mate."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mdm-11",
        "review_rating": "",
        "review_title": "Unbelievably far-fetched \"romantic comedy\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "synthprincess",
        "review_rating": "9",
        "review_title": "A feel-good rom-com!",
        "review_detailed_main": "Look, I'll keep it short and sweet, I'm honestly not even a fan of rom-coms but The Wedding Planner is such a good movie! I've seen it a dozen times and each time I enjoy it. Jennifer is great in it and so is Matthew. It's not a cheesy, insufferably predictable girly movie like you'd expect. It has a lot of funny moments, a lot of surprises and a lot of sweet moments that feel REAL. These two actors have chemistry! Seriously, give it a watch, you'll enjoy it!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "darkcarrington",
        "review_rating": "",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "cindy_angela",
        "review_rating": "8",
        "review_title": "Well.. I don't hate it!",
        "review_detailed_main": "Well... I think this is not exactly a best selling movie that everybody watch.. but I think this is romantic and simple.. so it got me hooked.. The movie is great for spending time.. especially when you want to relax and watch a not-so-serious movie.. so.. I'm not gonna say it's a super excellent movie.. but I don't hate it!\n\nJLo, she really looked like a super organized person.. she appear perfectly as a role of a wedding planner.. The twist is not so confusing (or should I say predictable) I watch this movie on holiday.. valentine's day.. when I have free time..\n\nI'm not saying this movie is the Best. But absolutely being in my all time favorite.. ^_^"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "superjaneyjane",
        "review_rating": "",
        "review_title": "Appallingly bad romcom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "chanellejholder",
        "review_rating": "9",
        "review_title": "It's A Classic Feel Good Stress Reliever",
        "review_detailed_main": "This is one of those movies that just makes you feel happy. It's sweet. It's not exhausting or over the top. The lead character is totally relatable. I love her character arch.\n\nOk, so the character Steve is a little too good to be true. We all need that story with the dream guy that just makes us feel hopeful. Makes us feel like we can be in a perfect world with a perfect guy.\n\nI think this isn't one to stress out on the plot line needing to be more layered or realistic. It exists to make a girl feel like she can be loved and wanted no matter her mess.\n\nAnd Jenifer Lopez is just amazing in this role. Such beauty and grace even in the quirky scenes. Watch it not to criticize but just to relax and enjoy."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "TolucaGuy",
        "review_rating": "",
        "review_title": "A chick flick for dumb chicks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "francoischristana",
        "review_rating": "10",
        "review_title": "Honesty is the best policy!",
        "review_detailed_main": "A marriage requires a significant commitment. Make sure you don't have any reservations about your spouse before completing that action. You could be saving yourself from making the worst decision of your life by always going with your instinct. While it was a kind deed to save Mary from a racing dumpster and ensuring she didn't suffer a concussion, Steve's acceptance of Mary's invitation to a movie screening was the first indication that he wasn't ready to tie the knot. Even after discovering that Mary was his wedding planner, Steve was captivated by her right away and kept pursuing her. Instead of immediately telling Fran about his doubts, he was determined to proceed forward with the wedding until she made the decision to have a transparent chat with him about their genuine sentiments. Mary isn't winning, in my opinion, if she dates Steve since you lose people the same way you gain them."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "FrozenDreamer",
        "review_rating": "",
        "review_title": "A little bit of predictable lovefluff...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "oxmarybxo",
        "review_rating": "9",
        "review_title": "great",
        "review_detailed_main": "this was a great movie. cute story line and a must see. both stars play a perfect part. this has a simple story where the wedding planner falls in love with one of the grooms she is hired to plan the wedding for. funny and charming. make sure you see this one. it's a must see!!"
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Fairly bland and contrived without any real charm of it's own",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "cajungenes",
        "review_rating": "8",
        "review_title": "a charming comedy",
        "review_detailed_main": "This was not the best movie Jennifer Lopez or Matthew McConaughey have ever made. It was however an enjoyable romantic comedy, with a very predictable storyline and ending. I liked the movie for what it was, a light charming romantic comedy. It won't win any Academy Awards, but it is good for a rainy Friday night. I hate to have to say this, but it probably is a chick flick. :) I gave it a 7/10."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "becknjim",
        "review_rating": "8",
        "review_title": "Matthew McConaughey shines",
        "review_detailed_main": "I recently watched this movie and found Matthew McConaughey performance outstanding. He made a very convincing Doctor and soothing voice made me believe he took his role seriously. I believe he should tailor more of his movie choices towards the romantic type. Jennifer Lopez is good, as usual."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "nikanavi",
        "review_rating": "8",
        "review_title": "That evening in the park was the best of my life.",
        "review_detailed_main": "A warm and heartfelt romantic comedy left me with truly kind and sincere impressions. This charming film rightfully holds its place among the best in its genre. While its plot may not be groundbreaking, do love stories always have to be intricate? Love is simple; it blossoms in the most ordinary, seemingly mundane situations-if only one knows how to see it. This movie subtly emphasizes the importance of courage, determination, and faith in relationships-messages delicately woven \"between the lines.\"\n\nIt's impossible not to praise the brilliance of Jennifer Lopez, whose charisma shines through every scene. Her expressive facial expressions add life to each moment-from the scenes in Steve's hospital to the playful episodes in the word game club or the ride to the park. Roles like this, filled with lightness and romance, perfectly align with her acting talent. In this sense, she reminds me of Jennifer Aniston, who, though a versatile actress, is especially captivating in romantic comedies.\n\nMatthew McConaughey's performance, however, evokes mixed feelings. In some scenes, he appeared overly reserved, almost devoid of emotion, giving the impression of a \"frozen fish.\" Yet, surprisingly, his calm demeanor created a contrast to the whirlwind of emotions from the other characters-Mary's passionate father, her emotional assistant, the eccentric Massimo, and the chaotic family of the bride. This balance brought harmony to the film. Moreover, there were moments where McConaughey truly shone: the farewell scene at Mary's door after her emotional outburst, the touching moments at the children's hospital, and the sincere conversation with Fran in the finale.\n\nAmong the supporting characters, Alex Rocco stands out, bringing authentic Italian passion and soul to his role. Justin Chambers, portraying the naive yet genuine Massimo, also impressed with his sincerity and subtle comedic charm.\n\nThis film is the epitome of romantic comedy-a story about love and kindness, so vital in our times. It reminds us that, occasionally, we all need to immerse ourselves in the atmosphere of a magical, slightly idealized tale to keep believing in the power of emotions and the beauty of human connections."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "kashmir2317",
        "review_rating": "8",
        "review_title": "Don't listen to the critics!",
        "review_detailed_main": "OK, I admit The Wedding Planner is a chick flick. But it's a good one. The dollhouse scene brought me close to tears. And to think I almost didn't see this movie. Jennifer Lopez is not only a talented dancer and singer, but she is also an animated actress who seem fit for this role. Go to this film if you are looking for a sweet, romantic comedy with a happy ending."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "kikib37",
        "review_rating": "10",
        "review_title": "I loved this movie!",
        "review_detailed_main": "It was funny, sweet, charming, etc, etc. It was nice and entertaining movie. I really enjoyed it. If you are looking for a date movie or a ckick night this movie is perfect. I disagree with the critics. It's not a movie for cynics, but for those who still dream about romance and love."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "weymo",
        "review_rating": "8",
        "review_title": "Awwwww....",
        "review_detailed_main": "Okay. I finally agreed to watch this movie with my wife since there was absolutely nothing else on. I typically like J.Lo and Matthew, but the previews made me think of a cotton candy cringefest combination of \"My Best Friend's Wedding\" and \"The Wedding Singer.\" However. Other than the weird color on Matthew's hair and the full-on unbelievability that J.Lo is an Italian, the movie's actually pretty good. This is NOT a guy movie...but it has all the trappings of a date movie."
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "True_Love",
        "review_rating": "",
        "review_title": "Extremely predictable...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "movieratings03",
        "review_rating": "",
        "review_title": "The Script Could Have Been Better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jennyloluv",
        "review_rating": "",
        "review_title": "Asking yourself why you should go see The Wedding Planner?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "LILTHUGBMW",
        "review_rating": "",
        "review_title": "Great movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "ophelia_1969",
        "review_rating": "",
        "review_title": "A flick so sweet it could kill a diabetic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "hiphoper33",
        "review_rating": "",
        "review_title": "Below Average Romantic Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Robinson_Almanzar",
        "review_rating": "",
        "review_title": "Another Romantic Cliché......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "csimmons",
        "review_rating": "",
        "review_title": "Nice pic...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "bwood17315",
        "review_rating": "",
        "review_title": "Wanted More",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sirskippy",
        "review_rating": "",
        "review_title": "Typical January/February Release",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Vivien-4",
        "review_rating": "",
        "review_title": "romantic comedy...shouldn't both elements be present, then?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "prophet71",
        "review_rating": "",
        "review_title": "A pretty good romantic comedy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "chorimaely",
        "review_rating": "",
        "review_title": "cute, I like it, but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "angel_0076",
        "review_rating": "",
        "review_title": "A rather mediocre movie. Just a very slow ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Doriano",
        "review_rating": "",
        "review_title": "I want an annulment!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mellisacarter",
        "review_rating": "",
        "review_title": "Re-watch When Harry met Sally and skip this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "MoonsofJupiter",
        "review_rating": "",
        "review_title": "Not as weak as I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Formulaic but entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "pettyfog",
        "review_rating": "",
        "review_title": "Misses all the way around...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "oarch",
        "review_rating": "",
        "review_title": "Utter garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "plan to skip this one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Tyson1",
        "review_rating": "",
        "review_title": "'The Wedding Planner' one of the top worst films of the year.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "moue0001",
        "review_rating": "",
        "review_title": "worst \"romantic\" movie I've ever seen!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "marko_cal",
        "review_rating": "",
        "review_title": "Nice work by JLO's agent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Sylviastel",
        "review_rating": "",
        "review_title": "You Smell Like Grilled Cheese Sandwiches!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "jmbwithcats",
        "review_rating": "",
        "review_title": "Simple and sweet",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "turtlewax182",
        "review_rating": "",
        "review_title": "Way too cliche for me...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "mynumber18atlbrave",
        "review_rating": "",
        "review_title": "A Classic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "tye_dye_rulz",
        "review_rating": "",
        "review_title": "too predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "UACW",
        "review_rating": "",
        "review_title": "Those who can't write, write",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "Most of it was good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "KerryW",
        "review_rating": "",
        "review_title": "Jen tries her best, but she's no Julia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Rachel-20",
        "review_rating": "",
        "review_title": "A very good film of its type",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "Sandra943",
        "review_rating": "",
        "review_title": "Perfectly Dumb!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0209475",
        "movie_name": "The Wedding Planner",
        "movie_rating": "5.3",
        "review_username": "sngbrd39",
        "review_rating": "",
        "review_title": "Really, REALLY cute",
        "review_detailed_main": ""
    }
]