[
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "1",
        "review_title": "Lord have mercy!",
        "review_detailed_main": "There are people out there who will greenlight anything! That is the only explanation I can offer as to why the House of the Dead movie exists. And that's only scary part to the whole movie. It's so bad you'll go off movies forever. I seriously wanted to switch this off and turn the TV over to the Paint Drying channel but I was bound by my word to suffer the whole thing. I don't know why I do these bad things to myself.\n\nAs if it matters, here's the basic jist of the 'story'. A group of twenty-somethings are so desperate to go out to some island in the Pacific Northwest (Canada actually, because it's cheap) for the 'Rave of the Century' (which consists of about 8 people and un-raving music) that they pay some craggy old fisherman $1000 to take them there after they miss the main ferry. That's gotta be some rave to be worth all that dough! The fisherman warns them that the island is also known as the Island of the Dead (hang on-I thought this was HOUSE of the Dead?) and that they are all doomed yadda yadda yadda.\n\nFirst faults here. Why would a tiny little rave (of the Century my foot!) be held on some remote island? Why would anyone willingly pay loads of money to get it? Why pay even more to the craggy old fisherman to take them back when they could just come back with the others?\n\nOnce they arrive they discover that the rave (which consists of about 2 tents, a small stage and a port-a-john) has been smashed, there's blood everywhere and no one is around. What would any rationally thinking person do? Run for their lives of course. But no, these clueless, obviously blind people decide to go look for them. Soon enough they discover an old ramshackle house that's 50 times as big on the inside as it is on the outside. Another half hour of stumbling around in the forest follows, as an excuse to kill of some of the lesser characters, and after much tedium they arrive back at the house again. The characters, like the movie, go nowhere.\n\nJammed into this ghastly disaster is a superabundance of gibberish dialogue, heinous acting, mumbo-jumbo exposition and zillions of clips from the once-popular arcade game of the same name. Why this was universally accepted as a good idea with the filmmakers I'll never know. The clips have no reference to any of the scenes and only degrade this trash even further, if that is at all possible.\n\nIt has nothing to do with the game save for some cheap, throwaway line at the end. It makes Resident Evil look like cinematic glory. Hell, even the Double Dragon movie seems multi-Oscar worthy in comparison to this junk. The only one who comes out of this with his dignity still intact is Jurgen Prochnow. He could have just taken his money and ran but he tries his best with the awful script and brings a tiny bit of pathos to his character. The rest of the cast suck I'm afraid. The characters are idiots and deserve to die.\n\nPlus, if you cut out the swearing and pointless nudity, I see no reason why this film cannot be shown on Saturday morning TV. It's not frightening in the slightest. Pirates of the Caribbean is more scary than the skeletal bad guys in this film. And where did all those bad guys come from anyway? There were only a few people on the island to begin with. I guess this justifies the reason they chose to reuse footage over and over. I kid you not, you'll see the same zombie die a dozen times.\n\nWho's ultimately to blame for that scandalous waste of celluloid? None other than director Uwe Boll. His control over the movie is non-existent. You can clearly the see actors have no idea what they should be doing and that the zombies aren't really taking it all seriously. The actors seem like they're reading off cue cards as they constantly pause in the middle of long sentences and carry on talking as soon as they see the next card. It all feels very unnatural.\n\nPlus the film is shot like a two-part mini-series. I have indeed seen better TV productions. And don't get me started on the editing. The film is an incoherent babble with thousands upon thousands of pointless shots and dozens of meaningless camera pans. No real skill or talent was put into making this at all. It truly baffles and boggles the mind how movies this unfathomably bad can get made and George A. Romero can't even get anyone to take his calls. House of the Dead makes some idiotic reference to Romero in a lazy attempt to be 'post-modern' but it only irritates that they think THIS is in the same league as a REAL zombie movie.\n\nFor what it's worth, the 1.85:1 anamorphic picture looks great and the Dolby 5.1 soundtrack is clean but very unimpressive and only serves to pronounce the heavily over-used ADR even more. The DVD comes with extras but why torture yourself. Isn't this review warning enough? Stay away! You are all doomed I tell you! Doomed! Doomed!!!"
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "baba44713",
        "review_rating": "1",
        "review_title": "Gives crap a bad name...",
        "review_detailed_main": "There are some movies you just know they are going to be bad from frame one. Even if you were totally oblivious of Ed Wood's work, one look at that commentator from \"Plan 9 from outer space\" and you just KNOW you are not gonna see the next cinematic masterpiece. Just like that, when I saw the first shot of Uwe Bolls masterpiece \"House of Dead\", with that guy sitting at the front of the house starting his introduction while trying desperately to sound like he just arrived from Sin City, I knew I'm in for a helluva ride.\n\nSo, the movie starts like this - first the lead character says that everybody else is going to die. You know, to keep you wandering. Then he starts introducing the rest of the characters with lines like \"Karma..thinks she's Foxy Brown\" or \"Alicia..my ex.. we broke up recently.. I had to study and she had to fence\". No, I'm not kidding.\n\nAnyway, this bunch of 20-somethings who couldn't act their way out of a wet paper-bag are going to the \"Rave of the century\", rave in question being a few tents, a port-a-potty and a shoddy stage located on small island in the middle of the Pacific. Our gang missed the ferry, but thankfully will find a way to get there, the way being a fisher-boat ran by Kirk (Cpt Kirk? Get it? Man, whoever wrote this script is a genius) and his sidekick who is a bastard child of Simpsons' Cpt McAllister and that hook killer who knows what you did last summer.\n\nTo make the long story short, the gang gets to the island, finds nobody there except some bloody T-shirts and then decide to run the hell away from there. No wait, they do not, they actually get all happy and like cos there's free booze.\n\nWith that scene the movie hits rock bottom and then against all odds proceeds to go further downhill. Some guys in rubber suits start running around, there is some screaming and shooting, our gang goes to some house to meet some other gang, they go out of the house, meet Cpt Kirk and some police woman (who between them have about 500 pounds of weapons) and then decide to go back to the house. Somewhere along the line they transform into a S.W.A.T. team, enter the Matrix, the rubber-suit guys start multiplying like bacteria and I start to cry because I actually paid to see this. To add insult to the injury, every few minutes there are shots from the video game this crap is based on and there is a cute game-over cut-scene for a few characters when they die.\n\nI seriously hate this movie. It doesn't even fit in that famed \"So bad it's good\" category. It's just plain bad. The script is bad, the zombies are awful, there is no tension, lines are bad, actors are bad.. the list just goes on.\n\nYou will probably want to see this movie just because of its reputation of being awful. Don't. There are bad movies that deserve to be watched. This is not one of them."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "crashfire-31416",
        "review_rating": "1",
        "review_title": "My first experience leaving a theater before credits",
        "review_detailed_main": "Saw this cinematic train wreck when I was 18. The \"rave of the century\" looked like a WalMart parking lot on a Saturday night. Zombies were smarter than the rave kids. I about lost it when the Asian girl broke out in Karate but I hung in there till the head honcho delivered his line about eternal life. Manager at AMC refused a refund."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "one4now4",
        "review_rating": "",
        "review_title": "Beware the \"House of the Dead\", because...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "colby_park",
        "review_rating": "1",
        "review_title": "Wow...and not in a good way.",
        "review_detailed_main": "Ok, first of all, I am a huge zombie movie fan. I loved all of Romero's flicks and thoroughly enjoyed the re-make of Dawn of the Dead. So when I had heard every single critic railing this movie I was still optimistic. I mean, critics hated Resident Evil, and while it may not be a particularly great film, I enjoyed it if not for the fact that it was just a fun zombie shoot-em up with a half decent plot. This however, is pure crap. Terrible dialogue, half-assed plot, and video game scenes inserted into the film. Who in their right mind thought that was a good idea. The only thing about this movie (I use the term loosely) that I enjoyed was Jurgen Prochnow as Captain Kirk (Ugh). While his name throws originality out the window, you can see in his performance that he knows he's in a god awful film and he might as well make the best of it. Everyone else acts as if they're doing Shakespeare. And very badly I might add. Basically the only reason anyone should see this monstrosity is if you a.) Are a huge zombie buff and must see every zombie flick made or b.) Like to play MST3K, the home game. See it with friends and be prepared for tons of unintentional laughs."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "MLDinTN",
        "review_rating": "1",
        "review_title": "quite possibly the worst movie ever made",
        "review_detailed_main": "This is one of the worst films I've seen. The only positive thing I can say is it was so bad that is seemed comical. First off, there's no plot. The actors appear to be reading off cue cards and do the dumbest things. Such as being chased by dead people but yet wanting to go out and look for their friends. Also the zombies were terrible, no where near as fun as any of Romero's work, who gets s plug in the movie. And the dumbest part of all was they kept showing flashes of the video game in the action sequences. Like we don't get the video game is about shooting zombies. Also, all the 20 somethings some how know how to use automatic weapons and hit a target without even aiming the gun. And the way the people die is so stupid. It's like they run out of ammo so stand around waiting to be jumped on. And when cornered in front of the house they run out of ammo instead of shooting the door open, So dumb.\n\nFINAL VERDICT: If any of these actors appear in another film, then they've been blessed with a second chance. Definitely the worst film I've seen in years. A B-movie on cinemax is better."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "dunmore_ego",
        "review_rating": "1",
        "review_title": "Gilligan's Island meets Shaun Of The Dead",
        "review_detailed_main": "Laid up and drugged out, as a kidney stone wended its merry way through my scarred urinary tract, with absolutely nothing better to do than let the painkillers swoon me into semi-oblivion, I happened to catch this movie on cable. I wouldn't want anyone to think that I paid to view it in a cinema, or rented it, or \u0096 heaven forfend! \u0096 that I watched it STRAIGHT.\n\nHaving played this sensationally gruesome video game and avidly trod the doomed rooms and dread passageways of The House, battling Chariot (Type 27), The Hanged Man (Type 041), and other impossible sentinels, my curiosity was piqued as to how the game would transfer to the movie screen.\n\nIt doesn't.\n\nThe banal plot revolves around a group of \"crazy kids\" \u0096 a la Scooby Doo \u0096 attending a remote island for a world-shaking \"rave\" \u0096 whatever that is. (You kids today with your hula-hoops and your mini-skirts and your Pat Boone\u0085) After bribing a boat captain thousands in cash to ferry them there (a stupidity which begs its own network of rhetoric), they find the \"rave\" deserted.\n\nPassing mention is made of a \"house\" \u0096 presumably the titular House Of The Dead \u0096 but most of the action takes place on fake outdoor sets and other locales divorced from any semblance of haunted residence.\n\nA fallen video camera acts as flashback filler, showing the island in the throes of a \u0096 party?! Is that it? Oh, so this \"rave\" thingy is just a \"party\"? In the grand tradition of re-euphemizing \"used cars\" as \"pre-owned\", or \"shell shock\" as \"post-traumatic stress disorder\", the word \"party\" is now too square for you drug-addled, silicone-implanted, metrosexual jagoffs?\n\nIt is learned that the party was broken up by rampaging zombies. Intelligent thought stops here\u0085\n\nI don't think the pinheads who call themselves screenwriters and directors understand the mythos behind zombie re-animation. Zombies can't die \u0096 they're already UN-DEAD. They do not bleed, they know no pain. Unless their bodies are completely annihilated, they will continue being animated. At least, that's what my Jamaican witch priestess tells me.\n\nWhich means that a .45 shot into their \"hearts\" is not going to stop them, nor will a machete to the torso. And a shotgun blast to the chest will certainly NOT bring forth gouts of blood. At least in the video game's logic, the shooter pumps so many rounds into each monster that it is completely decimated, leaving a fetid mush that cannot re-animate itself.\n\nYet each actor-slash-model gets their Matrix-circular-camera moment, slaying zombies on all fronts with single bullets and karate chops to the sternum. Seriously, these zombies are more ineffective than the Stormtroopers from \"Return Of The Jedi\", who get knocked out when Ewoks trip them.\n\nI suppose the film's writer, Mark Altman, having penned the not-too-shabby \"Free Enterprise\", felt compelled to insert a Captain Kirk reference, in the character of Jurgen Prochnow, who must have needed milk money desperately to have succumbed to appearing in this aromatic dung-swill. There is also a reference to Prochnow's primo role in the magnificent \"Das Boot\", when one of the untrained B-actors mentions that he \"looks like a U-Boat Captain\". \". I wonder how many of this movie's target audience of square-eyed swine picked up on ANY of the snide references to other films, as when Prochnow declares, \"Say hello to my little friend\", presaging his machine gun moment.\n\nAimed at a demographic who have not the wherewithal to comprehend the Sisyphean futility of the video-game concept (i.e. the game ends when you die \u0096 you cannot win), this is merely a slasher film for the mindless and mindless at heart. Accordingly, everyone dies in due course, except for a heterosexual pair of Attractive White People.\n\nA better use for this film's scant yet misused budget might have been to send the cast through Acting School, although Ona Grauer's left breast did a good job, as did her right breast \u0096 and those slomo running scenes: priceless! I especially liked the final scene with Ona trying to act like she's been stabbed, but looking like she's just eaten ice cream too fast.\n\nAttempting to do something more constructive with my time, I pulled out my Digitally-Restored, 35th Anniversary, Special Edition, Widescreen Anamorphic DVD of \"Manos: The Hands Of Fate.\" Ah, yes! \u0096 the drugs were suitably brain-numbing - now HERE was some quality film-making\u0085\n\n(Movie Maniacs, visit: www.poffysmoviemania.com)"
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "Shatteredwolf",
        "review_rating": "1",
        "review_title": "The House of Crap",
        "review_detailed_main": "This is by far THE WORST movie i have ever watched. I've seen some pretty awful movies in my time but this ones takes the cake, no, wait, i mean the the whole damn bakery. It is so bad that i believe a word to describe the way you will feel after watching this atrocity has yet to be created. Please just do yourself a favor, if you ever get the urge to watch this and watch thirty minutes of that annoying purple dinosaur Barney, then multiply that thirty times fold and you would still only get a small fraction of the horror you would be in store for. In summation, i guess you really can call it a horror movie, but only if you're willing to be scared senseless by the worst acting in the business and utterly pointless story.\n\nReal Rating, -10 Disgusting"
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "Anonymous_Maxine",
        "review_rating": "3",
        "review_title": "Wow.",
        "review_detailed_main": "Okay, so I'm not a big video game buff, but was the game House of the Dead really famous enough to make a movie from? Sure, they went as far as to actually put in quick video game clips throughout the movie, as though justifying any particular scene of violence, but there are dozens and dozens of games that look exactly the same, with the hand in the bottom on the screen, supposedly your own, holding whatever weapon and goo-ing all kinds of aliens or walking dead or snipers or whatever the case may be.\n\nIt's an interesting premise in House of the Dead, with a lot of college kids (LOADED college kids, as it were, kids who are able to pay some fisherman something like $1,500 just for a ride after they miss their boat) trying to get out to this island for what is supposed to be the rave of the year. The first thing that comes to mind about House of the Dead after watching it is that it has become increasingly clear that modern horror movies have become nothing more than an exercise in coming up with creative ways to get a lot of scantily clad teenagers into exactly the same situations. At least in this case, the fact that they were on their way to a rave excuses the way the girls are dressed. They look badly out of place running around the woods in cute little halter-tops, but at least they THOUGHT they were dressed for the occasion.\n\nClint Howard, tellingly the most interesting character in the film by far, delivers an absolutely awful performance, the greatness of which overshadows every other actor in the movie. I can't stand it when well-known actors change their accents in movies, it is so rarely effective, and Howard here shows that it is equally flat to have an well-known actor pretend that he's this hardened fisherman with a raspy voice from years of breathing salty air. He didn't even rasp well. It sounded like he was eating a cinnamon roll before shooting and accidentally inhaled some powdered sugar or something. Real tough there, Clint! I expected more from him, but then again, he did agree to a part in this mess.\n\nOnce we get to the island, the movie temporarily turns into any one of the Friday the 13th movies that took place at Camp Crystal Lake. Lots of teenagers played by actors who were way too old for their parts getting naked and then killed. The nudity was impressive, I guess, but let's consider something for a minute. These kids pay almost two grand to get out to this island to go to the Rave Of The Year, find NO ONE, and say, well, who wants a beer! Even the guy who pulled that stack of hundreds out of his wallet to get them all over there didn't think anything of it that they found a full bar and not a single solitary person in sight. Here you have the input from director Uwe Boll - There's alcohol! They won't notice that the party they came for consists of no one but themselves!\n\nSo not only do they start drinking, not minding the fact that the whole party seems to have vacated the island, but when one of the girls goes off into the dark woods to find out where everyone is (dragging one other girl and one of the guys reluctantly along), the guy and the girl who stay behind to get smashed decide that it would be a great idea to strip down for a quickie now that they're alone. It's like they expected to find the island empty, and now that they rest of the people that they came over with were gone for a little while, they would have some privacy since there's no one else around. Brilliant!\n\nNow for the things that everyone hated, judging by the reviews that I've read about the movie. Yes, intersplicing shots from the video game into the movie, mostly in order to show that, yes, the movie was being faithful to/directly copying the video game. Sure, it was a stupid idea. I can't imagine who thought up that little nugget, but worse than that is the Matrix-style bullet time scenes that were thrown in over and over and over and over. After the first time (at which point I found it pretentious and cheesy for a movie like this to have a shot like that as though it was something original) it is noticeable more for the technique of the shot itself rather than any dramatic meaning or creation of any kind of tension for the film.\n\nOne of the things that makes a zombie film scary and gets you on the edge of your seat is to have them slowly but relentlessly coming after the living humans, who are much faster but getting tired, running out of places to run, and with a terrifying shortage of things with which to fight the zombies off with. The first two are done right in the movie, the kids are terrified and don't have a lot of places to run since they're on an island, but since they caught a ride over with a smuggler, they find themselves heavily armed. And I mean that very strongly. I mean, these people have everything from machine guns to hand grenades, which removes most of the tension of the impending walking dead.\n\nThen you have what I call the techno-slasher scene. Since the rave never happened, and I guess since Uwe Boll thought people were going to be disappointed at not hearing any techno music in the movie, there's one scene right in the middle where all the humans are fighting off the living dead, and amazingly enough it turns into something of a music video. There's techno music blasting as the shots are edited together faster and faster until it's nothing but a blur of gory shot, mostly only about 5 frames long (which is about 1/6 of a second) flashing across the screen in time with the speed techno music. Clever, I guess, but it has no place in a horror movie because it completely removes any sense of scariness or tension of even the gross-out effect because you can't see any one thing for long enough to react to it. You're just watching these shots fly across the screen and wondering what the hell the director was thinking when he decided that it would be a good idea to put something like this in the movie.\n\nI've seen a lot of people compare this movie to Resident Evil, mostly claiming that it copies the premise of it, and they're exactly right. I appreciate that at least here, as was not the case in Resident Evil, it wasn't some man-made virus that turned people into walking dead that were able to infect other people, changing them the way vampires turn others into vampires. 28 Days Later was also clearly an inspiration for this movie, it's just too bad that House of the Dead didn't do a single original thing, except for the somewhat moronic idea of putting in quick shots of the video game on which it is based, just in case you forget. I really think that this should have been a much better movie. While obviously I can't say that I know much about the game it's based on, just the title and the movie poster deserve a much better movie, but unfortunately I think that's more often the case than not with horror movies. It's really kind of sad when a movie comes out that is so obviously advertised as a no-holds-barred horror film, and the scariest thing in the entire movie is the closing shot, which suggests the possibility of a sequel."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "Mr Parker",
        "review_rating": "1",
        "review_title": "Bad. Terrible. Horrible. Preposterous. Horrendous. Sucks. Ridiculous. Stinks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "QueenoftheGoons",
        "review_rating": "4",
        "review_title": "Send them all back to the house of the dead",
        "review_detailed_main": "Not terrible I have seen far worse. I watched it for Palffy & Jergen. They did good parts. But as always my goons meet their doom."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "javoegele",
        "review_rating": "10",
        "review_title": "Better than given credit for.",
        "review_detailed_main": "I want to tell you why this is a pretty kick ass movie. First off lets consider what the bare minimum we should expect out of a an entertaining horror movie: 1. Blood, 2. Boobs, 3. Beasts and this movie has all three in spades. The action scenes are hyper stylized yet original and interesting. The zombie effects are reminiscent of Lucio Fulci's \"Zombie\", plus they are practical effects, a super bonus considering many films, even those made in 2002 were relying far too heavily on cheap CGI effects. I will offer that some of the acting is pretty ridiculous at best but some performances including Clint Howard's are truly genre classic. Avoiding all story spoilers, as I think this film should be experienced in the purest way possible, I would like to point out overall the story moves at a brisk pace and never tests the audience in their patience. This film offers a lot for horror fans and whatever your previous opinion of this film is or if you haven't seen it yet I implore you to watch it again/first time with an open mind and a youthful enthusiasm for the strange and fantastic."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "zebediahrain",
        "review_rating": "6",
        "review_title": "\"Trendy\" to hate",
        "review_detailed_main": "Story: 6/10\n\nYoung people stuck on an island with the undead, somewhat trite but it's passable stuff\n\nVisuals: 6/10\n\nThe camerwork is solid, the practical effects are great but the stupid frozen rotating camera thing and bits of the video games stuck in randomly really do damage the film.\n\nCast: 6/10\n\nNo problems here, no worse than any other movie of its ilk\n\nAudio: 5/10\n\nThe music is suitable, the sound work is competent.\n\nX-Factor: 8/10\n\nAll manner of creatures, zombies and nasties make this memorable enough stuff.\n\nThe Verdict: 6/10\n\nThe sad thing with House of the Dead is it's been tarred and feathered and has become \"Trendy\" to hate it. Thing is it's not bad, it's certainly not at worst movie ever level and people need to get off these childish band wagons."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "BroadswordCallinDannyBoy",
        "review_rating": "3",
        "review_title": "Action-filled crap-fest",
        "review_detailed_main": "I found this movie in the 'horror' section of my video store. That seems to make sense as most zombie movies have their place there. From Romero's 'Dead' trilogy to '28 days later.' However upon watching it, you can quickly see what this movie really is.\n\nIt is actually a music video that goes progressively faster and gets more and more and more gory. There is no horror here folks. Just some half-way decently staged action scenes which soon grow tiresome because they last... and last... and last... and soon you get the feeling maybe you're DVD player accidentally skipped back 3 minutes, but no, this is how they actually made the movie. It's a pity. I think anyone could find a better use for $7 million dollars in the movie industry than make this lump o' crud. Though some of the 360 effects were cool, but once again, they were over used and grew tedious since it was the same stunt over and over again each time, just with a different character.\n\nAlso what is ROYALLY annoying is the splicing on of footage from the arcade game. I've played the game. It sucks. So why did they put it in here? Oh that's right, this isn't a movie but a music video, and it's a poor one at that. 3/10\n\nRated R: a lot of violence/gore, and profanity"
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "BamVoyage",
        "review_rating": "1",
        "review_title": "Think of the worst film you've ever seen... Then times it by 5 and you'll get this.",
        "review_detailed_main": "F*ck Me! I've seen some incredibly horrific movies in my time but this takes the p*ss!\n\nHonestly I can't express in words how bad this film actually is. Besides the plot that isn't really there, the comically crap acting, the hilariously dreadful excuses for zombies; You know what, I could go on all day. Every little thing in this film is either stupid, pointless, crap or embarrassing. I express to anyone who wants to watch this movie... don't!\n\nI'm ashamed to say, I have this on my rack. It's hidden away right at the god damn bottom of the huge pile. I couldn't even give this horse-sh*t excuse for a film away. That's how bad it is."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "dumb film making at its best...",
        "review_detailed_main": "I'm not sure about this film. Are the film makers idiots or are they just making a film and marketing it to idiots? All I know for sure is that this is a dumb film....no, it's an offensive and dumb film. Everyone in the film seems vacuous and worthless--with dialog and actions that constantly reaffirm this. Their greatest interests in life are partying, cursing and taking off their clothes...period. So, when they all start to get killed off like in a Friday the 13th film, you really could care less.\n\nThis incredibly obnoxious and unsubtle film was, not surprisingly, made by Uwe Boll--the man responsible for many films based on video games. So, we have perhaps the worst living film director AND a film based on a video game...does it get any worse than this?! Viewers are treated to lots of blood and gore, many explicit scenes of vomiting and girls who take their clothes off for absolutely no reason. The latter is really weird, as the film was filmed in the Pacific Northwest--and people all were wearing jackets and long sleeve shirts--yet, in this bizarro world, girls just gotta rip off their clothes in some of the most gratuitous scenes you could imagine. Perhaps ut even then it might make sense if this were a porn video...a bad porn video. Instead, this crap was marketed mostly to teens and stupid people.\n\nThe plot, for what it is, is very simple. A group of vacuous and horny young adults(?) take a boat to a party on an island known as \"the Isle of Death\" for some sex and alcohol. Instead, people start turning into zombies and ripping each other to pieces. Yet, inexplicably, many of the prey know cool martial arts skills OR turn out to have high-tech weapons with inexhaustible supplies of bullets!!! The dumbest is the captain of a crappy fishing boat--who suddenly sports a high-powered rifle with a scope and laser!!!! What the heck?!? Overall, it's a movie with all action that's set to a loud Euro-pop beat. There is nothing in the way of plot, acting or caricatures---just zombies, cursing, nudity and death. If you LIKE the idea of a virtually plot less film with no acting or writing--just zombies, death and annoying music, then this movie is for you. Otherwise, it's a waste of time and clearly deserving its place on IMDb's Bottom 100 list."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "heidihutton",
        "review_rating": "1",
        "review_title": "Do you like \"bad\" horror movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "terminator-3",
        "review_rating": "1",
        "review_title": "Avoid this like the plague",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "shalimar-4",
        "review_rating": "1",
        "review_title": "OMFG will someone PLEASE STOP GIVING UWE BOLL MONEY!!!",
        "review_detailed_main": "OMFG will someone PLEASE STOP GIVING UWE BOLL MONEY!!!\n\nI got up today to find this playing on TV... didn't catch the very start but that obviously does not matter at all.. and within a cpl min I was questioning if they were seriously this idiotic or if they were trying to make this movie this bad intentionally..\n\nWell.. stupid me.. wasted time actually watching more of this craptacular pile of steaming ... no wait.. that's too polite a description.. and a pile like that at least would be useful as fertilizer..\n\nSuffice to say watching this continued while feeding my youngest son his lunch (Thankfully he's too young to understand any of this) and it just kept getting worse.. and worse.. and WORSE.. and WWWWWOOOORRRRSSEEEEE!!!!!!\n\nAMC.. the channel that has helped with some spectacularly good Zombie action (Walking Dead anyone?) and a few other excellent shows.. but has it's head firmly up up it's collective ass with idiotic butchering of movies was happy to put this on and then it's sequel (which can't help but be better since UWE is not involved).. and edited it for language.. but did not have the decency to cut out the entire film and substitute a simple still shot saying:\n\nThis is a test of the EMERGENCY BROADCAST SYSTEM\n\nThis film is directed by UWE BOLL.\n\nTurn the channel NOW to save your sanity and lock the doors since the world is obviously ending when we have run out of garbage to put on TV and are reduced broadcasting this crap..\n\nBut don't worry.. we edited out the language so your sensitive ears won't ever hear profanity!!!!.. (We can't control the profanity undoubtedly being uttered by all of those watching this crap)\n\nNow laugh all you want.. this review is idiotic and absurd.. and its intentionally so.. but at least this has saved you from wasting time of your life you will never get back from watching this load of total steaming sh*t (Seriously IMDb? Have to edit this word?? /facepalm @ that being as stupid and idiotic as AMC's butchering of films. Both pathetic and extremely childish esp since kids know that word very well by the time they hit school!) from UB...\n\nNow as the title says:\n\nOMFG will someone PLEASE STOP GIVING UWE BOLL MONEY!!!\n\nSeriously!!! The man destroys everything he ever touches and some idiots keep giving him $ to make more movies..\n\nHell even his disaster version of AD&D.. which basically writes it'self it's so fantastically easy to get right.. and he managed to butcher it to death in a horrific fashion..\n\nThey gave him Bloodrayne, AD&D and at least a dozen others with potential... again craptacular garbage from hell every single time.... his touch is like King Midas only its CRAP instead of gold!\n\nThere seriously needs to be a public safety warning with everything that man ever touches!! Hell even his breathing or uttering the words related to any movie does untold damage to us all!\n\nSo for the sake of the children, puppies, kittens and whatever else you can add into that.. STOP GIVING HIM MONEY to make movies!!!\n\nFFS\n\nPay him to NOT make movies and we will all be better off!!\n\nSeriously!!!!\n\nThis pathetic excuse for a movie is just abysmal.. and while I've worked in the industry and am prod of some of the good stuff we have done here in Canada.. this is NOT one of them and the fact he was even allowed into the country to film this is worthy of investigation since it's an abomination to our film industry and whomever issued him the permits needed needs to be fired!!!\n\nSo review boiled down for those that want to skip to the end:\n\nTo quote the great Monty Python:\n\nRUN AWAY!!!! RUN AWAY!!!!!!!"
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "The-Hellish-Gnome",
        "review_rating": "1",
        "review_title": "Dire beyond all belief",
        "review_detailed_main": "You know that feeling of hilarity you get when you watch a film that's trying so hard to be a serious, thought provoking piece of cinema and fails miserably? When you can't help but bust out laughing at the sheer terrible nature of the trash littering your screen? \"House of the Dead\" struggles to achieve even this low graded level of cinema.\n\nFrom start to end \"House of the Dead\" manages to recreate the feeling like you've just woken up to find out that the cat has laid it's curled business neatly on your forehead while you slept. It is clear from the start that the female actors have been cast for their cleavage size (which they exploit shamelessly) whereas the males for their hardcore \"kick-ass\" attitude. I honestly did not care any of the characters for any moment of the film and found myself actually wishing their demise so as to spare me a good hour of this torture. Uwe Boll should have considered screening two hours of footage from the actual game as a movie. At least then we'll get better acting\u0085 However not all blame can be placed on the actors as it is certainly a challenge to produce a convincing film when faced with the script of this film. It is arguably the worst section of the film and actually contains such lines as: \"These are zombies, pure and simple\" and \"No cap'n, we must not go there! It's evil!\".\n\nWe all know that Zombie movies are never going to be particularly thought provoking or full of meaning; at best they are a harmless two hours of action, blood and closet terror. Trash, yes, but entertaining trash. Not the kind of trash which bursts out of your bin bag as you haul it across the room and smothers your shoes in sour milk cartons and decaying banana skins. According to IMDb, \"House of the Dead\" received such bad reviews that no Danish cinemas bought the movie. If only we could have had the same privilege.\n\nFinal Score: 1/10."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "Hal_Opinot-Pepper",
        "review_rating": "2",
        "review_title": "The most gloriously bad movie I've seen in years",
        "review_detailed_main": "I am not a fan of \"so bad it's good\" movies, I generally just like movies that are actually good. But every once in a rare while, I see a movie so hilariously, over-the-top godawful that it's actually entertaining. It's hard to believe this wasn't specifically made for MST3K or the golden days of USA Up All Night. From the overuse of \"bullet time\" in an action sequence so long that it actually outlasts the rap metal song that accompanies it, to the model-looking raver girl who can apparently do kung-fu in heels, to the inexplicable random cuts to video game screencaps in the middle of action scenes for no reason that's ever given, to the completely non-uniform zombie makeup (as if they'd just told all the extras \"show up in zombie costume\"), to the fact that there isn't even a \"House\" in this movie despite the name (it's set almost entirely outdoors in the woods on a remote island), virtually everything about this movie is a cinematic mistake, from start to finish. And that level of failure is just not something you see very often. It's really kind of spectacular.\n\nHere's all you need to know: if you've ever been scrolling through some streaming service, looking for a braindead, lousy, fun movie, and came across a horror movie with Clint Howard top billed, and you realized that could be exactly what you were in the mood for - this is movie is the exact glorious, steaming pile of total garbage you were hoping that movie would be."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "purecrime",
        "review_rating": "10",
        "review_title": "I got a BIG BIG LESSON from this film.",
        "review_detailed_main": "One thing is clear. Until i met a great educational flick called 'House Of The Dead' by Dr. Uwe Boll, there had been not a single film that i decided stop watching in the middle of viewing. Yes i mean it. I never quit a movie in the middle of watching it no matter how it sucks or bores because i'm a type of guy who is over-patient and likes the phrase \"it ain't over til it's over\". Once i play a movie, then i finish it by all means, only unless inevitable things happen and force me to quit it in the middle. That was basic cinema-watching attitude of mine for 30 years.\n\nAnd then suddenly, one day about a year ago, i happened to meet this great educational flick and it broke my history just like a revolution. I played it, and Jesus can you believe, i quit and ran exactly at 40 minutes without any special situations or reasons.\n\nYogi, i'm afraid you're wrong. Something must be over before it's over...\n\nThat's not only thing that i learned from this great educational flick. I admit that i generally tend to ignore (or intentionally skip) others' reviews or comments on some films which i've not seen yet, and especially for majority of opinions i don't care for them at all. Yes it's just like \"I don't listen to anybody before viewing it myself and valuating is just mine\"..... But with this great educational flick, i learned that sometimes i need to be more open to others' WARNINGS at least.\n\nAfter all, this film had such huge educational effects on me and i can't help giving it 10/10 for it."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "harace",
        "review_rating": "6",
        "review_title": "Flawed but Surprisingly Entertaining",
        "review_detailed_main": "I tend to enjoy the movies I watch. This means that my opinion usually goes against poorly received pieces. It happened to me with In the Name of the King, which I rather enjoyed. And there's The Bride of the Monster, which does have some stupid moments and pacing issues, but I still don't view it as catastrophic. Manos: The Hands of Fate is bad, but I respect Harold Warren for creating a movie without any kind of education in film.\n\nSo, let's turn to House of the Dead. The first 20-25 minutes were quite good. The movie begins with a short and not-too-informative introduction to the four teens that wish to get to some island, and have fun with friends there. Some, who are pickier about movies than I am, say that characters are best introduced through action than any narration, but not much is revealed about them, so it's no big deal. The dialog sequence aboard the ship was clever, funny, and served its purpose of establishing the characters, especially the captain.\n\nMany complained about the characters' decision to stay at the deserted camp instead of running away, but please note that all but Alicia was drunk, so don't expect them to make rational decisions. Was Alicia's decision to go investigate rational? No, it wasn't, but the movie had to move forward, didn't it?\n\nThe movie went on, and I haven't gotten the impression that it was as bad as the reviews suggested it was. It looked like a typical horror movie, and it continued and ended that way. There are dark places, zombies sneaking in the forest, characters getting introduced (and killed), a hooded figure in the distance observing the humans, etc. The usual horror move stuff.\n\nPossibly weakest part of the movie is the big shoot-out scene in front of the house. It's spectacular, but way too long. They kill zombies by the dozens, and not much else happens. One may argue that the battle scenes in The Lord of the Rings trilogy are even longer, but there are twists in them that serve a narrative purpose.\n\nAlso everyone aims perfectly, and they don't run out of ammo until the plot requires them to. Neither is an unheard-of plot device, but since the fight is very long, it becomes noticeable.\n\nI also don't understand the narrative purpose of the in-game clips. It would have been better if Boll left them out entirely.\n\nSurely, HotD isn't a *good* movie, but I fail to see why it received so much flak. I basically mentioned everything I disliked about HotD, and that's all I could find in a 90-minute-long movie. There are things I liked as well. Pacing is generally good, the dialogs are decent, acting is surprisingly good for a movie with this average rating. The flaws don't outweigh the pros, so I give it a 6."
    },
    {
        "movie_id": "tt0317676",
        "movie_name": "House of the Dead",
        "movie_rating": "2.1",
        "review_username": "ajwertman1",
        "review_rating": "1",
        "review_title": "Ugh.",
        "review_detailed_main": "=====This review may contain spoilers=====\n\nOK, here's the \"plot\": A group of college students are on their way to the \"rave of the century,\" only to find that they missed the boat. They hire a fishing boat captain to take them there. Once they arrive, they find the place completely trashed and everyone is missing (only one of them thinks that this is weird). When searching for the other ravers, our heroes instead find themselves face to face with a pack of vicious, blood-thirsty zombies. Will they survive the night? Frankly, you won't care because you'll be too busy thinking of increasingly brutal things to do to the director of this train wreck, Uwe Boll.\n\nWhat can be said that hasn't already been said about this movie? It is one of the worst movies of all-time and it's not difficult to see why. It's terrible not only because it has nothing in common with the video game it is based on, but because it is so incompetent on every level imaginable.\n\nThe cinematography is amateurish and laughable. The movie seems to have been edited by a chimpanzee. Huge chunks of plot and scenes are left on the cutting floor. The action sequences are edited in ways that would make Michael Bay look like James Cameron. It's not entirely clear what the heck is going on, whether it is a sword-fight, a shootout, or a simple chase. Oh, and did I mention that Boll inserts clips from the game into the action? I'm NOT making this up! He actually does this! Why? I have no clue. Probably because he thought it looked cool, but it just makes the whole thing confusing, pointless, and stupid. Equally questionable is Bowl's abusive use of bullet-time. Every time someone shoots at a zombie, a camera does a 360 degree angle swoop around him/her. Again, I have no idea why except that Bowel thought it looked cool. But AGAIN, it just looks cheap and ridiculous, and it gave me a headache. And I just HAVE to say this, but whenever the characters go into bullet-time mode, they are holding a different weapon then they were in the previous shot!\n\nOkay, so the editing and action sucks, but it's not the biggest problem. The acting was absolutely atrocious, and the dialogue was even worse. The actors playing the 20-somethings look too old to still be in college. I cringed every time they (or anyone else for that matter) opened their mouths and said something. Here are some lines that should go down as classics:\n\n-\"I found this book. It looks pretty old. Maybe it will help us.\"\n\n-\"It looks like it's been there for a millennia.\"\n\n-\"You did this to become immortal. Why?\"\n\n-\"Look at that house. Should we go inside?\"\n\n-\"We tried to get to the boat, but it wasn't there.\"\n\n-\"They're obviously zombies, plain and simple. The sooner we accept that, the sooner we can move on with our lives.\"\n\nThose are but a few lines of dialogue these we have to sit through. What's more, the actors can't act if their lives depended on it. They show zero emotion and give their characters no personality whatsoever. They often talk as if they are reading from note cards. And whenever one of them dies, they show curiously little sadness. Even the major stars, Jurgen Prochnow and Clint Howard (who plays Prochnow's first mate) appear embarrassed to be on screen. We don't really know who these people are, so we could care less about what happens to them. Oh, and can someone PLEASE tell me how a group of college students who have never even touched a gun before magically become an expert shot AND a Kung fu master all in less than a minute? Jesus! Talk about plot holes (out of millions, trust me)! There is also a weird attempt to explain how the zombies were created. What it is I will not say, except that it doesn't make any sense and actually raises more questions than it answers.\n\nThe movie is extremely cheap-looking, too. The zombies look like extras with some gray powder thrown in their face. Sometimes they don't have any make-up on at all! Speaking of which, these \"zombies\" act most un-zombie-like. They can swim, leap incredible heights (thanks to some obviously placed trampolines), run, and even use weapons. WTF?!?!?! Oh, and zombies can't be killed, OK? In this movie, if you slash at them, shoot them anywhere on their bodies (hip, shoulder, chest, head, etc.), they die. NO! AND ZOMBIES DON'T BLEED, OK?! Man, this movie gives me a headache just trying to figure it out. Anyway, the sets look terrible as well. In particular, the titular house and the graveyard surrounding it both look like they were stolen from the Haunted Mansion ride in Disneyland. And apparently the house is magic, because it looks tiny on the outside, but is absolutely enormous inside.\n\nI could go on and on how horrific this monstrosity is. It's worse than getting three root canals, in one day! It's worse than anything Paul W.S. Anderson can throw at us (now that's scary!). It makes you realize that suicide may not be such a bad idea after. Well actually, I don't recommend that, but you know what I mean. I could go on, but that would result in a twenty-page essay. I will conclude this review by saying that Uwe Boll is without a dount the worst filmmaker alive. This movie alone cements his status as the modern-day equivalent of Ed Wood. Hands down one of the ten worst movies I've ever seen. Stay away if you know what's good for you.\n\nRating: 1/10 Grade: F If I could go lower, I would.\n\nP.S. Sorry this was a long review. I just had to get the anger I felt after watching this steaming pile of cow-crap off my chest."
    }
]