[
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kon-grigoriou",
        "review_rating": "2",
        "review_title": "Error 404: story not found",
        "review_detailed_main": "The whole consept of the film is interesting and I haven't seen something similar but there was no story at all. Not even the classic horror story that someone dies and becomes a ghost or how someone becomes a killer."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Aaron1375",
        "review_rating": "4",
        "review_title": "How many of you went \"BOOOOOOOO!!!\" at that finish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Platypuschow",
        "review_rating": "2",
        "review_title": "The Open House: Just when I think Netflix is redeeming itself it releases something like this.....",
        "review_detailed_main": "The Open House is a Netflix original movie and presently sits at no.55 on the IMDB bottom 100. So the IMDB community deems this to be the 55th worst movie ever made. I have to disagree, but there is no denying just how atrocious it is.\n\nIt tells the story of a mother and son who move into an open house after a tragedy befalls their family. As per the usual trope weird things begin to happen in the property.\n\nThe trouble is, well.................there are a lot of troubles but first of all the movie is..........wait, honestly I don't even know where to start here.\n\nAwfully paced, dreadful characters you simply can't care about, a billion unanswered questions, the film ultimately goes nowhere at all! Basically the only redeeming features the film has are marginally decent cinematograpgy and a beautiful setting.\n\nThe Open House is fully deserving of all the poor ratings, it's the absolute pits.\n\nThe Good:\n\nBeautiful location\n\nThe Bad:\n\nCliched to incredible levels\n\nUnlikeable characters\n\nServes no purpose\n\nThings I Learnt From This Movie:\n\nNothing, in fact I'm pretty sure it caused brain leakage so I've probably forgot some stuff"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "roddersladuk",
        "review_rating": "1",
        "review_title": "What.the.fudge",
        "review_detailed_main": "Most of the 1 star reviews articulate the problem really well but if you're still unclear allow me to communicate it in another way.\n\nImagine you walked into your living room and saw Frank Sinatra playing world of warcraft. Then your neighbour came round several times and said some weird stuff to you. Then your cat takes a dump in your bed and moos at you. Then you start singing the lyrics to YMCA while Eiffel 65 is playing 'I'm blue' in the background\n\nSo you must be asking yourself, What was the relevance of sinatra and why world of warcraft? Why did my neighbour come around and what did they say? Why did your cat moo and why sing YMCA to a different tune?\n\nThe truth is...no reason at all. None of it related to anything. Pointless. No connection. Nothing"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "adunmire-71213",
        "review_rating": "1",
        "review_title": "The Worst Movie I Have Watched In A Long Time!",
        "review_detailed_main": "What??? There was no ending?? It was pointless to even watch! A waste of time for the viewer."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pleasantcow",
        "review_rating": "1",
        "review_title": "Spoiler Alerts Don't Matter Because There Is Nothing To Spoil",
        "review_detailed_main": "Good job Netflix! You bought total crap! After watching this I can't help but feel like the \"writers\" of this trainwreck are sitting in their beanbag chairs and taking turns patting each other on the back. Instead of congratulating themselves they should be taking script writing classes. This was the laziest piece of crap that I have seen in a VERY long time. \"Oh! We have a great idea for a movie!...I mean...we don't have any structure and we don't have a clue how to finish it...but maybe people will think we're geniuses for just phoning in the entire ending of the movie!\"\n\nListen...there are no spoiler alerts here. This movie is a complete waste of time. If these two morons ever hope to make another movie...maybe they should learn something about structure...plot...climax. I feel like this movie was written on a napkin at a Denny's and then left on the table and the busboy decided to make it.\n\nIt's just awful. Stay away. And pray they never make another film in their lives. There are too many talented writers and directors out there to waste any time on these two.\n\nThere...I said it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ali-bubble-hot-hot",
        "review_rating": "1",
        "review_title": "Never been so angry or disappointed in a film...EVER",
        "review_detailed_main": "I completely jinxed this movie by saying how good it was halfway through.\n\nI've seen some pretty horrendous horror films in my lifetime, but you expect them to be horrendous because they are what they say on the tin. Cheap and easy.\n\nThis film is the opposite, it's deceptive and not in a \"ahhh wasn't expecting that\" sort of way. More a feeling of being completely ripped off and dissatisfied kinda way. We honestly really enjoyed a good majority of this film, so many things that look like they're building up to a really good twist at the end. Mysterious characters, red herrings, things that could be linked together in a really cool way.\n\nHow naive and utterly wrong we were.\n\nThere is no point to this film. Literally, why was this film made? It's like they employed a really good writer for the first half of the film who put together a brilliant structure and then some idiot decided to take over and realised he/she was in over their head. By the last shot I was honestly screaming \"DO NOT ROLL CREDITS\" and my sister had to restrain me when the goddam screen went black.\n\nThis review may seem extra, but I have never been so angry, frustrated and disappointed by a potentially great film.\n\nI urge you not to waste your time.\n\nI have to go cool off and try and forget the fact I ever watched this piece of rubbish."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "redbirdfan2008",
        "review_rating": "1",
        "review_title": "Waste of Time",
        "review_detailed_main": "I really don't know what happened here. It started off well, but then it just kind of fizzled. The acting wasn't bad, but the writing was. Certainly nothing original about the plot. I was really expecting more from this movie. Overall its just 90 minutes of my life that I can never get back.It almost seems like they just ran out of money and decided to just go ahead and end it.It will leave you unsatisfied and with a bunch of questions that will likely never get answered. Netflix must have acquired this movie for a bargain basement price not caring about their subscribers. Please no more recommendations Netflix"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "adrian-14619",
        "review_rating": "1",
        "review_title": "Sheer Unadulterated Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cewebb-35364",
        "review_rating": "",
        "review_title": "Shut the front door!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "spooky_64",
        "review_rating": "1",
        "review_title": "A total BS of a movie",
        "review_detailed_main": "I thought the movie started really good, building up to something interesting...but boy was I wrong.\n\nStill wanna say that the lead characters were very good and acted reliably.\n\nAfter like 85% of the movie I was looking forward to see how the writers was gonna tie at least some of the knots together...but boy was I wrong again.\n\nWe, the audience are left in total darkness without an answer to a single thing what so ever.\n\nHmm, getting tired of writing this review now so I'll stop here and go on to watch another hopefully much much more satisfying movie.\n\nTo all you moviebuffs out there...don't bother with this one. /J"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Judit_H_1989",
        "review_rating": "8",
        "review_title": "Come on, people!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Sleepin_Dragon",
        "review_rating": "6",
        "review_title": "I quite enjoyed it.",
        "review_detailed_main": "I am not surprised by the low reviews, and the low score, I have to say I enjoyed it. I get that it doesn't have a black and white conclusion, that ambiguity in the end of a film can irritate some, but I'd like to highlight The Strangers, a similar outcome, but a masterclass in movie making, and while The Open House doesn't even come close it raises a few questions. The ending was probably done in that way to allow for a second, and I wouldn't be shocked to see an Open House Part 2 made.\n\nSolid performances, Dylan Minnette, who's always pretty good put in a solid performance, I thought the scenes where he lashed out in anger to his mother about his father's death were very well played out, films so often go way over the top, this had a sense of realism.\n\nWhen you think that the budget for this film was $100,000 I think it should be applauded, many films with budgets many times that size fail in so many ways, this was a good hour and a half of escapism.\n\nIt's not to be taken too seriously, and we didn't get many answers, but that's life.I quite enjoyed it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "eliasj12",
        "review_rating": "1",
        "review_title": "Worst movie... Ever. Like ever ever.",
        "review_detailed_main": "All I can figure is the writer died of a stroke about 1/4 of the way through and Netflix said f it, let's run it like it is. This was an abomination."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cpbuzzard",
        "review_rating": "1",
        "review_title": "Keep this house closed",
        "review_detailed_main": "Everything leading up to the end seemed intentionally misleading into absolutely nothing. Cheap scares that led nowhere. Random killer whose face they never show. Half the fun of these mystery/thriller films is trying to guess the killer. In Scream, the killers were throughout the whole movie! This one just followed a boy and his mom grieving and getting scared shitless for whatever reason. It's like a short story that got stretched into a movie that never should've happened. It may be good for a campfire story but even then not so much. It's an incomplete garbage of a movie. Awful awful awful...\n\n...awful."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cenguiene",
        "review_rating": "1",
        "review_title": "if I could give it no stars I would",
        "review_detailed_main": "It's like the makings of a good movie wrapped in a bow...then someone opened the box and woosh it all flew out willy nilly with no purpose or reason...wasted my friday night...I want that time back"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "william_elliss-99770",
        "review_rating": "1",
        "review_title": "I opened an IMDB account to give this one star",
        "review_detailed_main": "Over arching story was absent, 'scary' aspects weren't scary at all, and I found myself checking my phone most of the movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "geniedevera",
        "review_rating": "1",
        "review_title": "Save yourself some time..",
        "review_detailed_main": "What the heck did i just watch? I need answers.. if you are reading this & planning to watch this film, don't! It's going to give you more questions in your life & waste absolutely your time.. XD I love thriller films but this has gone too far that it's way too vague."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "veelio",
        "review_rating": "1",
        "review_title": "Utter garbage",
        "review_detailed_main": "Movie starts off pretty good, was enjoyed the first half.\n\nThen it kinda felt like the writers got bored and couldn't be bothered putting in any effort for the second half.\n\nThe trailer made it look good..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ajshields-16643",
        "review_rating": "1",
        "review_title": "Terrible Film",
        "review_detailed_main": "I was really looking forward to this film. When the film started I was totally engaged thinking this was going to be a great film.\n\nUnfortunately that quickly fizzled when I realised there was only 18 minutes left and there hasn't been any action yet.\n\nThings only start to actually happen in the last 12 mins and even then it isn't really that interesting. What a waste of my time. Shame though because dylan minnette is brilliant like he was in 13 reasons why just a shame this is his first movie since that. :(\n\nPoor Show Netflix - Poor Show :("
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "topcomp",
        "review_rating": "1",
        "review_title": "dont bother",
        "review_detailed_main": "So not a clue who, why and the end gave no clues sorry but it was a waste of my time,"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "LordCommandar",
        "review_rating": "",
        "review_title": "My first 2018 Review Of Pure Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "natnyc911",
        "review_rating": "8",
        "review_title": "A fantastic film - Negative reviews are unfair",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "trinaa15",
        "review_rating": "7",
        "review_title": "Don't Judge by the Negative Reviews...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "katyamokolo",
        "review_rating": "1",
        "review_title": "Don't",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mahabouraoud-09421",
        "review_rating": "5",
        "review_title": "Felt let down at the end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "The_Pete_Jackson",
        "review_rating": "1",
        "review_title": "No logic whatsoever",
        "review_detailed_main": "Save yourself some time. Watch the trailer as this is what you get. A few good scares but no logic in situations throughout the movie.\n\nI know the genre means that victims play dumb, but in this movie the lead characters have no sense.\n\nTo make the film enjoyable the writers missed some tricks and should have spent some time explaining 'why?' rather than letting the audience come to their own conclusions, which in fact you couldn't because so much of the core situations were closed books before they ended, and the film move then onto the next part of the story."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "saul-695-887385",
        "review_rating": "1",
        "review_title": "If I could get a refund I would!",
        "review_detailed_main": "I didn't expect much and that is exactly what I got. This is one of those movies that should never have been made. I can only assume the producers were looking to launder some dollars because there is absolutely NO reason at all to let this excuse for a movie anywhere near the paying public.\n\nNo where in the movie do any of the main characters do anything any sensible person would do. They don't question things that are obviously questionable and they do things you simply would never do under the circumstances.\n\nThere are characters that appear for no reason at all and we have a killer with no apparent motive and who's face for some reason or another the camera can't bring into focus.\n\nI can't say more without spoilers...actually there is not much to spoil but think of the worst movie you ever saw then imagine one worse and you have a very good idea of what 'The Open House' is going to be like.\n\nNetflix should be thoroughly ashamed of screening this garbage."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "neener3707",
        "review_rating": "4",
        "review_title": "Average Film Thats Been Done A Million Times, With No Resolution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "empathlady",
        "review_rating": "",
        "review_title": "Just don't...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "nickchurney",
        "review_rating": "1",
        "review_title": "If I could rate this a ZERO I would!",
        "review_detailed_main": "First let me start by saying I love horror movies, and I try and watch pretty much anything that comes out that isn't complete garbage. Dylan Minnette definitely has a nice future ahead as long as he never does a film like this again. It's never a good thing when you want the main characters to die 30 minutes into the movie. Horribly written characters who were just mean and the story itself, if you want to even call it a story as it was completely plotless. At one point somehow the bad guy, or depending one how one looks at it the good guy, decides to take a persons contacts out, to conceal his identity. I guess he was to lazy to just wear a mask, instead he manually takes the guys contacts out. I have no clue how this movie ever got made, it is that bad. My twelve year old could come up with a better movie then this. I could pull out my IPhone, and randomly grab a couple of hobos from the rail yard and make a better movie than this drivel. This movie was so bad, and such a waste of time I'm considering canceling my Netflix subscription of 5 years, and filing a lawsuit for the time I will never get back watching this garbage. I've been watching horror movies for 33 years, and I can honestly say this is the worst horror movie I've ever watched, it is also the worst movie I've ever watched period. I've been an imdb member since it originated, and this is the first review I've ever posted. I don't want any other person to have to suffer through this garbage like I did. Let me save you two hours you will never get back. Mr. Angel, and Ms.Coote please do everyone a favor...Please do not ever make another film again!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "shakerahathaway",
        "review_rating": "2",
        "review_title": "Terrible, Sad use of such good actors",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "griffithsrm",
        "review_rating": "1",
        "review_title": "The movie version of click bait",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kenwilks20",
        "review_rating": "8",
        "review_title": "Not as bad as the score suggests",
        "review_detailed_main": "OK I agree there is no 'traditional' ending in this movie, but not everything in real life has a 'traditional' end.\n\nI must admit I do like the occassional film that leaves the viewer scratching their head at the end and this one certainly does.\n\nOverall this film is dark, creepy and has a few effective jump scares. The acting is pretty good too.\n\nIf you like endings where all the threads come together, avoid this one, but if, like me, you enjoy unresolved mystery,give it a go."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Voronto",
        "review_rating": "7",
        "review_title": "Why so many 1 ratings? This was a decent movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mkm-hermanjnr",
        "review_rating": "1",
        "review_title": "The poster child for how NOT to write a horror movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Wizard-8",
        "review_rating": "3",
        "review_title": "Ends up being a frustrating watch",
        "review_detailed_main": "There are some good Netflix exclusive movies out there, but there are also a number of poor efforts, and \"The Open House\" is one of those stumbles. While it is definitely a bad movie, I didn't find it quite as bad as most IMDb users here have found it. The production values were good for what had to be a non blockbuster budget. Also, the first half of the movie does have a little mood and eeriness. But otherwise, the movie pretty much screws things up. I could live with the setup being somewhat familiar, but the execution of the setup is quite badly done. Most of the movie (especially in the first half) unfolds at a REALLY slow pace, with no real strong thrills or plot turns to keep the viewer actively engaged. The lead characters also seem very dim-witted, not seeing that something is seriously wrong before things turn very serious. Also, while the movie seems to be setting up for some surprise plot twists and turns, NOTHING about this setup pays off in the end. There is no real explanation as to what is happening and why, and what we have seen before the ending seems just to have been padding before the very unsatisfying conclusion. While I will admit that the movie could have been a lot worse, I really can't see it entertaining any particular viewer."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gdavis1457",
        "review_rating": "",
        "review_title": "Waste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "eclipticwings",
        "review_rating": "1",
        "review_title": "Do not watch this movie.",
        "review_detailed_main": "I hope the people that made this movie never make another movie again."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lilydavis-46130",
        "review_rating": "1",
        "review_title": "Netflix, why? Don't waste your time",
        "review_detailed_main": "I've watched some really bad movies on Netflix like No Mercy but The Open House is the worst movie I've watched. At least No Mercy had a beginning middle and end but The Open House has a beginning and middle but no end. It just leads you to nothing and you are left feeling \"What the F?!\"\n\nThe movie starts like out any C movie on Netflix, some tragedy and then the main characters have to make a decision they don't really want to but being financially strapped have to. Then creepy things start to happen and there is violence but then it just abruptly stops there. It makes no sense and is very frustrating. The viewer becomes invested in the characters. The actors actually do the best the can and the acting is not bad. But the characters are one dimensional. We don't ever really get to the know the wife and son.\n\nThe movie feels like it was edited with a guillotine. There are scenes put together that don't make sense. For instance the son complains they moved away from his friends and he didn't want to go but there are no scenes prior to that of him feeling this way. We straight up have a conversation between the wife and her sister about moving to the mountain home and then voila they are driving to the mountain home.\n\nDoes Netflix think because it is spending loads of money on several movies like Bright that it can just have really bad movies to fill the line up of movies? Don't waste your time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "trishayanez",
        "review_rating": "1",
        "review_title": "Let me save you some time....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "edwie-594-19044",
        "review_rating": "3",
        "review_title": "Em.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ukulele33",
        "review_rating": "1",
        "review_title": "Run away!",
        "review_detailed_main": "Nothing in this movie made sense. Not scary, NO plot, and the writing was horrific! Do NOT waste your time with this. You're better off watching paint dry"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tim100574",
        "review_rating": "1",
        "review_title": "Wait, what just happened?",
        "review_detailed_main": "I think they forgot to put an ending in this movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Shoe1982",
        "review_rating": "8",
        "review_title": "Decent Scary Movie, despite what the other reviews say.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "justcrystalle",
        "review_rating": "7",
        "review_title": "Sometimes the killer gets away",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "One house not worth opening",
        "review_detailed_main": "Saw 'The Open House' on Netflix a while ago, being fond of horror/thriller regardless of budget (even if not my favourite genre) and being intrigued somewhat by the idea. Being behind on my film watching and reviewing, with a long to watch and review list that keeps getting longer, it took me a while to get round to reviewing it.\n\nUnfortunately, despite not reading any reviews purposefully before watching, am going to have to agree with all the reviewers who hated 'The Open House'. A film that started off pretty good, but ran out of steam very quickly and rapidly got worse by a second half that makes one not want to keep watching. Never judge a film without seeing the whole thing and wanted to give 'The Open House', so gave it a fair chance.\n\nAs said, 'The Open House' started off pretty promising.\n\nDylan Minnette and Piercey Dalton give surprisingly good performances considering the material, especially Minnette. The soundtrack has some nice moments (i.e. \"Silent Night\"), when it isn't being intrusive and annoying.\n\nHowever, so much brings 'The Open House' down. The rest of the cast struggle to do much with so little to do and the direction is so phoned in and pedestrian, one gets the sense that the director showed no interest in the film at all. Too much of the soundtrack is intrusive and annoying, made worse by the excessive and obvious sound effects that just cheapens the mood. The film looks drab generally and like it was made in haste.\n\nWhere 'The Open House' most underwhelms is the writing and story. The writing is incredibly lazy, it's awkward in dialogue, very confused as a result of not tying things up or going into full detail and doesn't feel complete. The story suffers from a very limp pace, apparent early on and gets slower and slower until an interminably dragged out second half. It further suffers from feeling too much like a short film stretched out with a lot of useless padding. A few of the characters are reasonably likeable but the inconsistent and illogical motivations bring them down.\n\nFor a film billed as a horror, though it's more a thriller with horror elements, there is very little interesting and nothing remotely scary. They are too few and are far too predictable, anaemic and weakly timed to make impact, with the dull pacing and obvious sound effects cheapening them significantly. In terms of the thriller elements, 'The Open House' doesn't engage let alone thrill, the start intrigued by feels wasted by how quickly everything runs out of steam. Worst of all is the ending, which is so abrupt, unresolved and incomplete that one struggles to even consider it an ending, the film just ends and leaves one scratching their heads in confusion and feeling cheated.\n\nOverall, the potential was there but the execution far from was. Really bad, unless you're curious about seeing it it's best to keep this house closed. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "shellyfoster",
        "review_rating": "",
        "review_title": "Why, more p*sd at Netflix for sending me email to watch this cr*p",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "natashabrandenburg",
        "review_rating": "1",
        "review_title": "The Reviews were better than the movie!",
        "review_detailed_main": "Too bad you can't give it a ZERO :-/ My friend and I watched the 1st half during our lunch hour, and thought to ourselves's this is awful, but we have to finish just to see how terribly it would end. It was even worse than we could have imagined. This had to have been the cheapest movie ever made. We honestly had more fun reading the reviews than watching the entire 90 minutes of this film. WALK AWAY!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hvnlydevil",
        "review_rating": "1",
        "review_title": "Biggest surprise was the service they got in the mountains",
        "review_detailed_main": "This movie was the equivalent of asking a third grader what you need in a scary movie, then randomly checking off those boxes without anything to tie them together. The movie oddly builds up musically in places to nothing, has a number of throw away characters, focuses on things that go nowhere and finishes in a totally non climatic, unfullfilling way. Really not worth your time. Keep scrolling and watch something else....anything else"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "eleftheriaallagianni",
        "review_rating": "1",
        "review_title": "This movie shouldn't exist",
        "review_detailed_main": "This is by far the worst movie I've ever seen. It shouldn't even be named a movie there is no ending. Waste of time , not recommended."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "andreatrombitas",
        "review_rating": "1",
        "review_title": "Probably gonna be the worst movie in 2018",
        "review_detailed_main": "It is only January but I am sure this is going to be the worst movie this year."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "young-erika65",
        "review_rating": "1",
        "review_title": "Do NOT WATCH!!! Seriously!!!",
        "review_detailed_main": "This is not even a movie. Who in their right mind wrote, produced or even decided to even select this movie for viewers. We should all Sue the Writers and Producers for fraud! This has to be the worst movie in History! I truly would bet anyone this is. Had no meaning at all. Watch at your own risk!! I could have just made a movie of myself walking outside and going back inside the house. This is just how bad this movie is. I am telling the truth!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Vicious.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lock2002",
        "review_rating": "1",
        "review_title": "Worse than cancer",
        "review_detailed_main": "I've watched a ton of movies this year but not one was remotely as bad as this piece of crap. My god. Do not watch this \"movie\"."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "maryj-anderson",
        "review_rating": "9",
        "review_title": "Ok, so the ending sucked...but!",
        "review_detailed_main": "I gotta admit I was as annoyed with the ending as most of the low star reviewers at first. Then I slept on it and woke up still thinking about this movie. I realized that the ending just fit the overall atmosphere of the story. There is SO much that is left unsaid and it dawned on me that it is by design. That was the whole point. We simply don't know for sure and probably never will, unless there is a sequel. I've decided I'm okay with this and it's made me apreciate the movie in a whole new way.\n\nI have my own theory as to what happened. If you pay attention, there are quite a few clues throughout the movie that point to a very likely conclusion.\n\nI hate that I will never be certain, but there are a million other movies I can watch if I crave that kind of closure. This is clearly not one of those movies. It made me think outside the cookie cutter thriller/horror box. It made me question my expectations. It made me realize that the reason we get upset by these frustrating, anti-climatic endings is because of our innate need to control and correct imbalance and injustice. Sometimes life is just unfair, bad things happen and we'll never know why.\n\nGive it a chance. The movie is decent. Not a masterpiece by any stretch, but well worth a watch."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "craig-j-thompson",
        "review_rating": "7",
        "review_title": "A Good Suspense Film That Encourages Some Imagination",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hilaryjrp",
        "review_rating": "1",
        "review_title": "\"Maliciously Pointless\"",
        "review_detailed_main": "Those aren't my words, they're the critic Andrew Wyatt's on \"The Lens.\"\n\nTo waste anyone's precious time for any reason used to be called passive-aggression. Or you can use plain sadism. Even more than a scene of unanticipated, graphic violence against a female character, the entire hour+ of this waste of time was sadistic."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "maddiejaneturner",
        "review_rating": "1",
        "review_title": "dylan could do so much better",
        "review_detailed_main": "This film triggered me so much i was complaining about it for a whole week, please do not watch this unless it's with someone you really hate, it wasn't scary, and there was no freaking ending, it says in the description watch to find out, but you don't find out, it's so stupid, i would rather eat a spider than watch it again and that's the tea"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "josephjhaney",
        "review_rating": "1",
        "review_title": "Acting was decent, plot holes everywhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "donolds61",
        "review_rating": "",
        "review_title": "Horrible movie! No plot whatsoever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "april-white-89-237685",
        "review_rating": "2",
        "review_title": "A Who Done it - we don't know",
        "review_detailed_main": "I kept expecting this to make sense in the end, but it DID NOT. We never learn who the killer is! Maybe the writers/directors just had an ax to grind on realtors and Open Houses. I can understand that, but wouldn't make a whole movie out of it. Poor writing, no plot - acting was good considering there was no story. Directors seem like amateurs. You should give this a pass."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "swannie0-1",
        "review_rating": "1",
        "review_title": "Nah",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Otte1",
        "review_rating": "2",
        "review_title": "The Negative Reviews Are Correct",
        "review_detailed_main": "Where do I start? Movie does a slow buildup which gives the idea of a big payoff, then it ends....period....no payoff. Think Sopranos finale type of ending. You have no idea what, who, why or anything. Only reason I did not give it a one star was how well the movie starts in building tension. It was almost as if the studio ran out of money and just either cut it or slapped on a ending just to finish it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lmschneck",
        "review_rating": "1",
        "review_title": "ACTUAL TRASH",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lindajohnson-36205",
        "review_rating": "8",
        "review_title": "Dont watch if you like your movies wrapped in a neat bow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "prateek_dhawan",
        "review_rating": "7",
        "review_title": "Not bad at all! Definitely kept me engaged.",
        "review_detailed_main": "Seeing all the negative reviews I thought this was going to be a mindless movie which has no shortage of poor acting, horrible story and amateur direction, BUT, it was none of that. I feel it held my interest and the directors knew how to keep the audience captivated. It is definitely not a 3/10."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Reecepaul12",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "I watched this film just over a week ago, and I've never in my life written an IMDB review, or even rated a film below 5 stars, but how this film even has a rating of 3.3 baffles me. There's no plot, no substance and no coherence.\n\nIf you're stuck and looking for a film to watch avoid this completely. I've seen other reviews compliment the main two actors at least, but even I struggle to see that.\n\nI would rather watched Big Mommas House than sit through The Open House again.\n\nThe plot leads you to believe there's supernatural \"forces\" in the movie, however, there is nothing supernatural about it, there is nothing about it whatsoever."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "recklesscowboy",
        "review_rating": "3",
        "review_title": "Pretty good movie with a dreadful ending.",
        "review_detailed_main": "Open House started off surprisingly good. I hadn't read any reviews, but I had low expectations because of all the garbage on these streaming platforms these days.\n\nThe acting was good. Characters were interesting. Mood was unsettling. Camera work, lighting, and sound were all great. I thought I finally stumbled across a real movie.\n\nThey did a good job introducing the characters and plot. As things started to get creepy, they set up a bunch of red herrings, and kept me guessing. I was actually interested to see how things turned out for the main characters.\n\nThen, in the last 15 minutes, the movie takes a hard nose dive and 'resolves' the plot in one of the most pointless, unsatisfying ways I've ever seen.\n\nTurns out, all the character growth, drama, red herrings - none of that mattered at all. They gave us a feel-bad horror ending that serves no purpose and makes me feel like an idiot for paying attention."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tkbncm",
        "review_rating": "1",
        "review_title": "goodbye.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kranzd-84147",
        "review_rating": "1",
        "review_title": "Talent wasted on horrible writing...",
        "review_detailed_main": "As one of the last reviews...I opened an account just to share how terrible this is. I would hope that from the feedback from the people who have watched this that the writers put their pens down and never write again. Save all of us the time that you have already stilen from us on this atrocity of a film.\n\nThis movie was free and I still feel I am owed a refund.\n\nPros: It finally eneded.\n\nCons: everything. This was probably some of the most lazy writing I have ever seen.\n\nGreat concept...terrible execution, terrible plot, terrible ending. There was nothing insightful or a \"hey at least this was good\" moment. It was literally a waste of time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "komic09",
        "review_rating": "1",
        "review_title": "The Open-ended Sh#t-house",
        "review_detailed_main": "Well I've stopped hurling insults at the credit sequence long enough to tell you to avoid this utter waste of everyone's time.\n\nI've never seen a film throw out so many possible scenarios, which then doesn't use any of them in favour of an anti-ending.\n\nGood god it was pointless!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "FeastMode",
        "review_rating": "1",
        "review_title": "Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "catfanatic888",
        "review_rating": "2",
        "review_title": "I WANT MY 90 mini back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mosquitobite",
        "review_rating": "2",
        "review_title": "Can somebody PLEASE TELL DIRECTORS",
        "review_detailed_main": "Of B grade horror flicks (Matt & Suzanne Im lookin at yew) that people like plumbers and other extraneous benign characters **DO NOT** !!! creep up behind their customers and **GRAB THEM ON THE SHOULDER** when they re standing at the sink. Jesus, how many times do we have to see this pathetic attempt at a phoney scare??Cinema is now over a century old it's, 2020 STOP ! DOING ! IT ! This movie is a pointless spiteful little number with no saving graces. Just watched He s Out There which was way better."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hannahbillesdon",
        "review_rating": "",
        "review_title": "What a waste of 1 hour 34 minutes!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "noonamooo",
        "review_rating": "8",
        "review_title": "Certain people enjoy it, others hate it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Becka92",
        "review_rating": "6",
        "review_title": "This movie is NOT as terrible as you're all making it haha",
        "review_detailed_main": "I saw the trailer and I figured \"ok let's give it a go\" and I looked it up here first and saw it had a 3.2 rating and I almost didn't watch it but did anyway. This movie is no where near as bad as these reviews are making it out to be. Some horror cliches (as per usual) and not the most original story but it's your typical suspense thriller and I actually liked the ending because it was different than what I was expecting. Best movie ever? No. Worst movie ever? Not even close."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jrusso1202",
        "review_rating": "1",
        "review_title": "Serious Waste of Time!",
        "review_detailed_main": "Great acting! Great directing! Seriously the actors in this film did a great job, but that's where the good in this film ends. The writing, up until the end kept my interest, however being utterly disappointed with a nothing ending destroyed any chance that I could give the writers any credit.\n\nDon't waste your time... Watch something else."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Shah-236-46725",
        "review_rating": "1",
        "review_title": "What was this ???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "JaneU2143",
        "review_rating": "1",
        "review_title": "I WANT MY 1 HOUR 34 MIN BACK OF MY LIFE!",
        "review_detailed_main": "I would give this movie a Negative 10 if it was possible. WARNING WARNING WARNING - - PLEASE Do NOT and I repeat with the other REVIEWERS, DO NOT WASTE YOUR PRECIOUS TIME. This was THE WORST MOVIE EVER MADE. There is no end. I get what they were trying to convey but this movie was worse than BAD. It was Negative Bad. It COULD have gone somewhere but it took a wrong turn on the 80th trip to the Basement. (That had No lights in a Gigantic Million Dollar House?) I cannot believe that I didn't look at the reviews first ! #SMH"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "T_ana",
        "review_rating": "1",
        "review_title": "Oh my goodness! Blah!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tinybabybull",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "danielmanson",
        "review_rating": "1",
        "review_title": "Waste of time!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Prophetik",
        "review_rating": "2",
        "review_title": "Nothing but plot holes ??????",
        "review_detailed_main": "This movie was nothing but plot holes & made no sense, what was the point of all these characters on the show if they had nothing to do with the house ? Just stupid"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "phenomynouss",
        "review_rating": "1",
        "review_title": "so bad it made me genuinely angry (Maybe spoilers? Who knows)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "maximumviolence",
        "review_rating": "",
        "review_title": "a movie that went nowhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "theladyunkindness",
        "review_rating": "8",
        "review_title": "This movie is not a waste of time if you actually paid attention.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jrobertson-96705",
        "review_rating": "6",
        "review_title": "Almost, but manages to miss an open goal after so much promise",
        "review_detailed_main": "This movie had much going for it. The acting was good and generally most things about the movie worked. BUT there was seemingly no thought given by the writers as to where this movie was going in the second half. I cared about the characters and the relationship between the mother and son was well developed. If the writers had just given us some denouement in the second half then this would have been a 7 or 8/10 movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Tweetienator",
        "review_rating": "2",
        "review_title": "Why, Oh My",
        "review_detailed_main": "Oh why, why is it that I didn't listen! I was warned...\n\nProduction and acting okayish (tv-scale), story mediocre with an open end, means no resolution at all, leaving us, the poor audience behind, not knowing what happened and why we watched this flick at all. Maybe the writer and the director think this end is \"artsy\" - it is not.\n\nOh why, why is it that I didn't listen! I was warned..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Hellmant",
        "review_rating": "5",
        "review_title": "A waste of time to watch.",
        "review_detailed_main": "'THE OPEN HOUSE': Two and a Half Stars (Out of Five)\n\nA horror flick about a teenager and his mother who move into a house that appears to be haunted by mysterious forces. The movie stars Dylan Minnette, Piercey Dalton, Sharif Atkins, Patricia Bethune and Aaron Abrams. It was written, directed and co-produced by rookie filmmakers Matt Angel and Suzanne Coote (who also play small parts in the film), and it was released by Netflix through it's streaming site. The movie is well shot, and acted in my opinion, but it's also completely pointless, and a waste of time to watch.\n\nLogan Wallace (Minnette) is a teenager with dreams of being a champion runner. Then his father is struck and killed by a car, while Logan is watching. He and his mother, Naomi (Dalton), move into her sister's house, while it's in the process of being sold. They soon realize that there might be powerful supernatural forces there, that are unhappy with their presence. The movie is a pretty routine horror/thriller flick, but (like I said) the production values are decent, and Minnette gives a good enough performance in the lead. The story, and character development, isn't horrible, until the end of the movie. That's when I felt like the whole film was kind of a complete waste of time. Up until then though, I didn't feel that negatively about the movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Close it up",
        "review_detailed_main": "Do you like confusing movies? That are not giving you any real resolution but let you in the dark and leave your questions unanswered? Well you are in luck. This movie was made for you. Try not to get distracted by the lack of emotional attachment to the characters or a relatively weak script overall (that's dialog and characters).\n\nMost of it will probably will leave you cold (no pun intended) and the trippy ending is not really satisfying. On the other hand, you could say points for not daring to be different in the end. Until then though, many cliches and jump scares ... if that floats your boat. Cinematography and generally technically sound (I've seen worse)"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "seahorse-32727",
        "review_rating": "1",
        "review_title": "what happened?",
        "review_detailed_main": "The movie just,,,,ends,,,we don't know who did it, why they did it, anything???? total waste of time"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tanyarhodes-84146",
        "review_rating": "1",
        "review_title": "No ending",
        "review_detailed_main": "This was diabolical. It started okay, then about half way through I could tell it wasn't going to get much better but I waited for the plot twist or answers... There was none. It's one of those films that just ends. No rhyme or reason to the movie at all."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dannyyk",
        "review_rating": "1",
        "review_title": "Absolutely terrible",
        "review_detailed_main": "This how bad the film was. I made an imdb account just to write this. The film actually made me annoyed. It was just so bad. I recognised one of the characters from 13 reasons why series and liked him in that so thought it was worth a shot. Literally no story line, no answers to main events throughout and the ending felt like they just ran out of money."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mistywater-39795",
        "review_rating": "1",
        "review_title": "DO NOT WATCH THIS MOVIE",
        "review_detailed_main": "The acting was solid but the movie is just bad.,,,really really bad. Netflix I deserve a free month of service for watching this horrible movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jessielynn-16197",
        "review_rating": "1",
        "review_title": "Don't do it.",
        "review_detailed_main": "Mom of two and I never get a moment to myself to watch a movie. I was so excited to finally get to. Laid down to watch this. Started out good. God weird fast. Boring fast. And the ending. Well it wasn't even an ending. Left you hanging completely. You have no clue what or why. So stupid."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rickwr",
        "review_rating": "9",
        "review_title": "haters always hate. most realistic horror as there can be.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jax713",
        "review_rating": "",
        "review_title": "I rate this negative 5 stars",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "CaptonBaconWasHere",
        "review_rating": "6",
        "review_title": "Reminiscent of The Strangers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "soumakmajumdar",
        "review_rating": "1",
        "review_title": "I don't know why what I watched!!!",
        "review_detailed_main": "I really didn't understand what's the main motive of the film. Just successfully wasted 90 mins of my life. I think the director didn't get enough producers and got frustrated and told all the crew i.e., the actors, the camera man, etc. to do whatever they want and they successfully created this 90 min Bogus film...\n\nA big zero to this film..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "trafalgardeathsurgeonoflaw",
        "review_rating": "1",
        "review_title": "Biggest waste of time",
        "review_detailed_main": "It was interesting in the beginning but then the rest was just awful.\n\nWhat is with the lackluster movies now? The endings either aren't endings like Cop Car (where you don't know what happens), endings that don't make sense to the rest of the movie like What Lies Below (where it's like X happens but Y ends) or endings that resolve nothing like this one.\n\nThey all have endings where you don't get it.\n\nWhy did they do what they did? Why? No answer? Awful movie. Period."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "honeybloggs-69648",
        "review_rating": "1",
        "review_title": "Great if you like Boilers !",
        "review_detailed_main": ". The music was very dramatic and was used to slowly build up tension in the movie ........ leading up to a moment of NOTHING!\n\nThe lead woman was in the shower and suddenly the water went cold . So then the 'horror type ' of dramatic music started . She went down to the basement and LIT THE BOILER . And that was it! This happened a few times in the movie . One time the son went to light the boiler too. There was also a lady who had Alzheimer's . And a friendly Black guy , who of course got the chop. This movie was more like a boring , slow, drama than a horror . . The ending had nothing to do with the entire movie ! I think this movie was secretly written by a 5 year old and the ending was added by an 11 year old"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "stormymbennett",
        "review_rating": "1",
        "review_title": "A waste of time",
        "review_detailed_main": "Don't waste your time. The story line is horrible. The ending was horrible. No clue what all the action was about. Just pure crap."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cathemoysopoulou",
        "review_rating": "1",
        "review_title": "A WASTE OF TIME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "billieayoung",
        "review_rating": "1",
        "review_title": "Wow... just wow",
        "review_detailed_main": "There are no words to describe how bad this movie is. Not even bad and cheesy in a good way that you just have to see it. Bad as in I would have rather spent 90 minutes eating glass than have watched this trainwreck of a movie. I swear I'm gonna sue."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "shreyas2415",
        "review_rating": "1",
        "review_title": "Waste of Bandwidth",
        "review_detailed_main": "I know Netflix subscription isn't much but that doesn't mean that the thriller movies are total dud!\n\nOk, the movie starts with a thrill about creepy people in the town but doesn't end with an answer. There is absolutely nothing in the movie which can tell what is freaking wrong with the town.\n\nIts like someone started the movie but the director got killed in an open house and they had to end it the same way!\n\nAll in all, WASTE OF TIME and WASTE OF Bandwidth movie!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jtindahouse",
        "review_rating": "5",
        "review_title": "It's pretty bad, but it's not 3.4/10 bad",
        "review_detailed_main": "It's pretty clear that 'The Open House' is failing to connect with people in a positive way based on its 3.4/10 score on IMDb. Seeing that I went into it expecting something pretty terrible. Now, while I can understand that this film has faults a plenty, I can't quite grasp it having a score that low. Let's get into some analysis.\n\nThe problems the movie possesses are as follows. Firstly, it's a bore. There are long periods of the film where it feels like nothing of significance is happening. Now that might not be entirely true when you find out what is actually going on at the end of the film, however the audience not being let in on this information is still going to be bored and uninterested. And therein lies probably the biggest flaw the movie has. There is a genuine threat to these people in the movie, but the audience has no idea about it. How can that ever be considered a good idea to have in your movie? Finally the amount of red herrings this film has that ultimately lead to absolutely nothing is absurd. There was a chance to be clever along the way, but the film makers just completely by-passed that option.\n\nSo why didn't I hate this film as much as everyone else? A lot of people are going to hate this movie for its ending and the path it chose to take. I actually respect it for it. At least, I respect the idea. The execution left a lot to be desired. The idea though was actually quite bold and attempting to be unique. I also liked that it didn't fall into the lazy category of slipping into the supernatural side of things, although there is at least one dream sequence is the laziest of all types of film making. So no this isn't a good film, but I also don't agree with its score being as low as it is."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "goatussmoothius",
        "review_rating": "9",
        "review_title": "Excellent, if you are smart enough to get the story.",
        "review_detailed_main": "I don't want to just right out tell you the whole plot like many do their reviews. I am surprised with such negative reviews. I liked it, and it made sense, you can figure out what happened pretty early if you take in all the clues. It really builds and maintains. If you like a slow creeping horror, that makes you analyze exactly what is going on in the then this movie is for you. I would say that Patricia Bethune performance was quite lordly, if you catch my drift, and that the main characters (mother and child) are quite good souls, that makes this film a crash hit!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mariemarie-55090",
        "review_rating": "7",
        "review_title": "ENJOYED THE ENDING!!!",
        "review_detailed_main": "-3 points for the nonsense the mom had in this movie. I gave it a 7/10 for the rest of the movie written. I found it to be story that left room for interpretation - somewhat like life - you don't know what you're getting but you know there's something you're to get from it. Yes, the mom was insensitive at times to her son who had more commonsense than she and yes, the story had no ending but that's where the interpretation comes in at. It left room for a broad discussion i.e. who done it, why and who was involved. Should every story have an ending or should we just allow ourselves as screenplay viewers to be open to personal or group discussion. It's not a question, it's rhetorical. It certainly leaves room for a sequel. :)"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mightypuff",
        "review_rating": "5",
        "review_title": "Really enjoyed most of it... (possible minor spoiler)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sunsetatdawn",
        "review_rating": "3",
        "review_title": "Acting is decent, plot is terrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "c-willson",
        "review_rating": "2",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Who did it? No idea Why did they do it? no idea Why did I bother watching this? No idea Had so much potential but left too many questions unanswered and seemed to be no point in it at all"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mafhoney",
        "review_rating": "1",
        "review_title": "Netflix owes me a month off my bill!",
        "review_detailed_main": "I was all in for the ride. Mystery death. Mystery big house. Mysterious things going bump in the night. Tunnels in the basement that lead to to nowhere (maybe that was a casual hint, darn it), unsettling new town and creepy next door neighbors.\n\nSo many clues, like unnerving photographs, missing cell phones, contact lenses, a broken staircase, Olympic Running times... THAT MEANT ABSOLUTELY NOTHING.\n\nThis movie is like riding a huge rollercoaster all the way to the very top then told to get out, take the stairs all the way down and expecting you to have enjoyed the ride!\n\nEpic, and I don't use this word lightly, FAILURE! (And not even in a fun way)"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "trunz-97164",
        "review_rating": "1",
        "review_title": "Reminds me...",
        "review_detailed_main": "It reminds me of a horror story i had write in school in 3rd grade. I wrote it one day before delivery to my teacher, I had absolute no interest in writing it, and the the story was absolutely pointless.. but I'm sure it's better than the story in this movie...\n\nI'm sorry y'all wasted your time watching this movie, and I'm sorry that you are wasting your time reading this review.. Hmm, why am I even wasting my time writing this review? Ahh yeah, because I'm sitting on the toilet, i have nothing else to do and I'm taking a huge dump, and that's actually a better story than this movie.."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "swhite_1119",
        "review_rating": "1",
        "review_title": "Wow that was bad",
        "review_detailed_main": "I think Netflix had $20.00 left for its yearly budget and made this movie if they spent more than that they wasted their money"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "luke-wilson",
        "review_rating": "1",
        "review_title": "I've noted the writers and will avoid anything else they do",
        "review_detailed_main": "Words can't actually describe how bad the ending was. Which makes the rest of the film even worse than it was. Not even 'so bad it's good' its just bad."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "meghoffmanx",
        "review_rating": "4",
        "review_title": "Not the worst movie I've seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ferreirahannes",
        "review_rating": "8",
        "review_title": "What a tense and atmospheric ride into terror..",
        "review_detailed_main": "After reading some of the user posted reviews I had to post a little note. Don't buy into all the 1/10 scores. People today can't stand creative work that doesn't fit into a neat little box.\n\nIf you are in to the mood for a tense and atmospheric movie, look no further. Just don't expect everything in this movie to conform to your typical suspense movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "SU011722",
        "review_rating": "",
        "review_title": "Confusing IMDB rating makes no sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "noxjuk",
        "review_rating": "6",
        "review_title": "Screams out for a sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gianmarcoronconi",
        "review_rating": "2",
        "review_title": "Non sense",
        "review_detailed_main": "Film without a real sense full of forcing to carry on a plot that is very poor and ugly. The ending doesn't make the slightest sense, just like the rest of the film."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "KeyserSoze79",
        "review_rating": "1",
        "review_title": "The 1 time I don't read a score first and I got this garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "zhivago97",
        "review_rating": "4",
        "review_title": "Not great, not bad",
        "review_detailed_main": "Positives: overall plot is interesting. Mom and son have good chemistry that makes them believable. The ending is a total surprise-I would not have guessed.\n\nNegatives: a lot of loose ends in the plot and many details that don't make any sense. Some of the characters are unnecessary. The main characters (mom and son) don't see what is obvious to the viewer (as is usually the case with suspenseful movies). The characters have unbelievably terrible judgement and keep doing the wrong things over and over.\n\nOverall it's an entertaining movie if you have some free time. Definitely has suspense which is it's saving grace, along with a surprise ending."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fefeeley412",
        "review_rating": "2",
        "review_title": "What. The. Crap?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "amitpaz-63684",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I created my account just to rate this movie 1 star. OMG"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dionrenee",
        "review_rating": "3",
        "review_title": "WTF - It started off so good!",
        "review_detailed_main": "Netflix Originals are my favorite. A great track record with me. Halfway into this I was texting my friends to check it out. Now I will have to take it back. Why? That ending was not the kind of ending where your left to come to your own conclusions and you can live with what you think happened. This was pure BS! Also there were some pretty stupid decisions made by the characters but in these types of movies, its par for the course. I was already thinking about my review and how I would let those slide. Anyway, it had soooo much potential and it was ruined. I am not usually a harsh critic at all but this made me so mad!! I can only hope they come up with a part 2 to give me some freaking closure!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lukenutt5",
        "review_rating": "1",
        "review_title": "If you've decided to watch this, change your mind immediately.",
        "review_detailed_main": "Please understand the importance of what I am about to write: This is the worst movie I have ever seen. Please. Do yourself a favor and forget you ever even saw the title of this movie. Whether you saw the title show up on Netflix or heard about it from a friend, just forget it now and save yourself the trouble. Because I just can't express to you how bad this movie is. I actually sat through the entire movie and now, after I write this review, I am going to build a time machine and use it on myself. Not even going to test it first. If it kills me, it kills me. Then I will go back in time and tell myself to not watch this movie. But this review will still exist somehow so that I can also warn everyone else. It's awful... Just awful... I mean this is actually a movie that was made... Like people sat down together and talked about... Making this? And then when they finished making it they thought that this was okay to release to the public? Like, they all agreed on THIS? Oh, wow... I'm still in shock... I don't know what else to say... I don't even want to talk about the film itself because that would consist of me thinking about it and I just can't. If you heed my warning, you're safe. If you don't... I'm sorry..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "allan-20159",
        "review_rating": "1",
        "review_title": "Just don't",
        "review_detailed_main": "What a waste of time. I have a rule. i don't se movies directed by the person who wrote the movie. They leave to much out because they know what's going on and don't realise that the audience don't. This movie proved that point"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mjackson-40495",
        "review_rating": "10",
        "review_title": "Scared shitless!!",
        "review_detailed_main": "SO SCARY!!! After reading the reviews I went in with low expectations but I was proven wrong! I thought it was shot really well and the acting was great. I liked that the ending wasn't what we expected...who likes a predictable movie?? I'd say Netflix scored getting this thriller!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "suecvint",
        "review_rating": "6",
        "review_title": "Quite enjoyed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Pearson182",
        "review_rating": "2",
        "review_title": "DO NOT WATCH",
        "review_detailed_main": "All I can say to anyone intending on watzghbf this is I wish I'd checked the reviews - first time for a while I haven't checked the review scores on here before watching as me and my partner decided to take a chance on this! Was potentially the worst movie choice we've ever made since watching slender man at the cinema.. Avoiding any spoilers but the film has no ending.. it builds some form of plot but never actually explains anything? Sticks in a series of torture scenes that entirely remove from the rest of the films feel and then the movie ends without ever explaining any of the actual story... Wasted 90 minutes."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Horcelain",
        "review_rating": "1",
        "review_title": "I created a profile just to tell you not to watch this movie",
        "review_detailed_main": "I am livid. I'd rather down a lukewarm oyster smoothie than have to sit through this again. The build is excruciatingly slow, then it throws away what little it built and leaves you wondering what you did to deserve to have your time wasted by the movie equivalent of waiting at the laundromat only to have your machine catch fire with four minutes left to go. I take that back. At least that might earn you a bit of adrenaline, making it way more exciting than this itchy sweater vest of a movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Horror_Flick_Fanatic",
        "review_rating": "1",
        "review_title": "Complete garbage",
        "review_detailed_main": "This has to be the most disappointing Netflix horror original I have ever seen. The film begins with the death of a boy's father. Then movies on to the boy's mother and her son moving to a large secluded house belonging to her sister so they can sell the property. Many jump scares in the home with no connection to the deceased husband or the sister. The boy has nightmares of the father in the home but with no understanding of why his ghost appears in this home. Then an intruder kidnaps the mother and son and tortures them with no apparent motive. Sketchy small town characters that we have no idea what their connection to the home is. And finally the ending leaves us completely in the dark. No resolution. We end up knowing nothing more than how the film started. Seriously Netflix? I know not every original can be a winner, but this film feels like a lousy cut and paste of an edit of a much larger film. Did Netflix servers run out of storage space that they had to butcher the film to make it fit onto Netflix's hard drives?\n\nAweful aweful aweful. I expect much better from Netflix."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tinkmeg",
        "review_rating": "1",
        "review_title": "Hahahahahhaha what??!?",
        "review_detailed_main": "I should have stopped watching when the dad bought eggs without checking to see if any were broken. Worst movie I've ever seen, and I watched the emoji movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dnsntnfr",
        "review_rating": "1",
        "review_title": "literally what",
        "review_detailed_main": "Okay i know this is informal but this was actually not good at all..the only thing i liked was the score."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "angelmc198",
        "review_rating": "3",
        "review_title": "Senseless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ehababdelhamid",
        "review_rating": "1",
        "review_title": "Stay Away!",
        "review_detailed_main": "Do not waste your time. This is a movie with no ending and doesn't make any sense. Investing those 1.5 hours in feeding ants is more useful and satisfying!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "maggymay1969",
        "review_rating": "3",
        "review_title": "Don't waste your time",
        "review_detailed_main": "First half was pretty good then the characters did some really stupid things and the story went nowhere. It's like they ran out of money and needed to wrap up the movie quick and didn't bother really explaining anything."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tammielee-58659",
        "review_rating": "9",
        "review_title": "I don't get the negative reviews at all!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lilith-14474",
        "review_rating": "",
        "review_title": "Waste of time...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "TravLehn",
        "review_rating": "6",
        "review_title": "90% of the movie is actually great, but one of the worst movie endings ive ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "DJCarterJames",
        "review_rating": "2",
        "review_title": "Save your time. Thank me later",
        "review_detailed_main": "94 minutes you'll wish you had done anything else in the world with. Starts off good enough,even some slight character development. Shot and produced fairly well. Acting was nothing to complain about either. But talk about one of the worst scripts written in a long time with no conclusion in the end whatsoever. This movie could have actually been something had the dimbwhitted writer bothered to do the most important thing, finish the script to conclusion. What was the whole point of this, why, who, anything except to leave you with nothing whatsoever in the end except questions. The writer needs to get their convenience store job back and stay there!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "karthiworld-94137",
        "review_rating": "1",
        "review_title": "The worst",
        "review_detailed_main": "Calling this movie very bad would be an understatement."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "deltacrud",
        "review_rating": "2",
        "review_title": "Disappointing!",
        "review_detailed_main": "Worst ending ever! How aggravating! I had to back up a couple of minutes to see what small element l may have missed to tie this piece of crap together. This movie started off with a decent premise. I love a slow burn horror flick, but wow did this drag on and continue to disappoint. I held out hope, but ultimately starting doing other things (checking my phone for emails, news feeds, absolutely anything to tinker the time away). I really hoped the ending would at least toss us a bone, but spoiler... IT DOES NOT! I recommend you avoid this one and watch ANY other movie or just go to bed early!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Ironpipes1-202-903609",
        "review_rating": "2",
        "review_title": "It's 40% movie, then 60% trash.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "janwolf-24850",
        "review_rating": "1",
        "review_title": "Well, there's an hour and a half of my life that I won't get back!",
        "review_detailed_main": "Really wish that I'd read the reviews BEFORE I watched it! Particularly the one by \"pleasantcow\" on 20/1/18 who summed up everything that I thought about the film. Nothing further to add except seriously, please don't waste your time watching this."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jcarteruk",
        "review_rating": "1",
        "review_title": "complete waste of time watching",
        "review_detailed_main": "It looked like it was going to be good but then your just left wondering who wanted to kill them and why.\n\nThis could of been a great film apart from they missed out most of the story and leaving you feeling who why what's it all about.\n\nComplete waste of time watching and I not one to just give bad reviews. But I felt I should worn folk so they don't waste time watching what turns out to take you no where.\n\nI get some thrillers leave you wondering but this film just has no reason to explain who was wanting to kill or who they was.\n\nOnly thing I can think is maybe they're planning doing sequel.\n\nI put no about does it contain spoilers as even if you watched you don't know anymore lol."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tiffanywetzel",
        "review_rating": "1",
        "review_title": "Seriously",
        "review_detailed_main": "I can't believe I sat through this movie with my husband. It became a joke. Leave the room, come back, \"did anything happen yet?\" \"Yeah a door opened!\" That was the best part!\n\nJust really really bad!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "irineufdaniel",
        "review_rating": "1",
        "review_title": "One Of the Worst Movies I Have Ever Seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "seavewa",
        "review_rating": "10",
        "review_title": "I loved it",
        "review_detailed_main": "I loved it for the exact same reason most rated it 1 star. At the end, you know nothing ! I think it is way more scary that way. If you know that is was payback for something, then you're safe but when there is 0 motive.... ;)"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "chakaigirl",
        "review_rating": "",
        "review_title": "Wow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "johannes2000-1",
        "review_rating": "6",
        "review_title": "A good start and very well acted, but in the end unsatisfying.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "radekhimmer",
        "review_rating": "1",
        "review_title": "DON'T waste time like we did.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "reasons78",
        "review_rating": "1",
        "review_title": "Netflix owes me 90 minutes of my life back",
        "review_detailed_main": "Whoever cut the trailer for this movie is much more talented than the writer. The trailer looks creepy and suspenseful and definitely hooked me in. The movie was hot garbage. I imagine the director and writer saying to each other \"what if this movie had no real ending at all! We'll just throw a bunch of characters in the plot that have no purpose and let the audience figure out what it all means!\" Then they high fived each other. I'm sure they were trying to be artistic and outside the box, but they just made a terrible movie with one of the worst endings in movie history. The biggest mystery is how did this junk get financing?"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "orbcardinal",
        "review_rating": "2",
        "review_title": "Writers just gave up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gurumaggie",
        "review_rating": "1",
        "review_title": "Because if I don't give it a star I can't warn you.",
        "review_detailed_main": "This is one of the worst films I have ever seen, it's bad when I can't find a single redeeming feature not music not location not script, the cast act with all skill of a person hit in the face with a fish by krusty the clown. Don't watch this watch anything even green lantern is better than this."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "waraichnarinder",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Wasted my precious weekend time on this so called horror movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Dusius",
        "review_rating": "1",
        "review_title": "Not bad until the end",
        "review_detailed_main": "It was a good story but I felt something between angry and idiot when it suddenly ended, asking myself \"what happened?\". So, 1..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rolbyh2002",
        "review_rating": "3",
        "review_title": "Doesn't Work",
        "review_detailed_main": "I should have taken it as a bad sign in the opening of the movie when the son is training as a runner (with hopes of being an Olympian) and he and his parents are raving about his 5:07 time. What length of distance is this amazing 5:07???? They never said how far he was running, and I thought, \"well, it can't be a mile time, because everyone knows that it was a big deal many decades ago when the 4 minute mile was broken.\" But guess what? Later, it comes up again - as his running goals are significant to him - and YES, it IS a mile time! How is it that the writing-directing team, the lead actor, anyone on the entire filmmaking team didn't catch this major gaffe?\n\nBasically, this movie consists of a bunch of long shots pushing in ominously trying to make us scared, but it fails to deliver much of a story."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "natedebar",
        "review_rating": "2",
        "review_title": "A film that chased genre and left the story behind in Act 1",
        "review_detailed_main": "Performances were solid, production offered value. Strong story to start the film, but instead of following the heart of the story and telling these characters truths, this became a forced suspense/mystery that leaves you feeling pretty down about the entire experience. Definite pass, unless you're an aspiring film maker or screenwriter as this is a good lesson on how to lose your story by choosing the wrong direction after the inciting incident."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "thales-63045",
        "review_rating": "8",
        "review_title": "I liked this",
        "review_detailed_main": "I saw the low ratings and thought, hmmmm maybe I won't bother but then I thought I've watched films with low reviews scores before and actually enjoyed them do I thought I'd give this a view. I'm glad I did. It's excellent. It's not your usual American/Canadian film with a normal ending whether good or bad. It just stops with no explanation to what the hell was going on and that's what I like about it. It leaves the viewer to make their own conclusions."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "decovanconner",
        "review_rating": "",
        "review_title": "Who ever made this never again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Sleepin_Dragon",
        "review_rating": "6",
        "review_title": "I quite enjoyed it.",
        "review_detailed_main": "I am not surprised by the low reviews, and the low score, I have to say I enjoyed it. I get that it doesn't have a black and white conclusion, that ambiguity in the end of a film can irritate some, but I'd like to highlight The Strangers, a similar outcome, but a masterclass in movie making, and while The Open House doesn't even come close it raises a few questions. The ending was probably done in that way to allow for a second, and I wouldn't be shocked to see an Open House Part 2 made.\n\nSolid performances, Dylan Minnette, who's always pretty good put in a solid performance, I thought the scenes where he lashed out in anger to his mother about his father's death were very well played out, films so often go way over the top, this had a sense of realism.\n\nWhen you think that the budget for this film was $100,000 I think it should be applauded, many films with budgets many times that size fail in so many ways, this was a good hour and a half of escapism.\n\nIt's not to be taken too seriously, and we didn't get many answers, but that's life."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "drwgsmom",
        "review_rating": "1",
        "review_title": "no wonder why all the bad reviews",
        "review_detailed_main": "When i saw the trailer i was like that looks good but after watching this movie this was the worst movie ever it was boring but it had some jump scares that were scary but the rest was absolute pieces of crap I'm going to spoiler some of the movie so you don't watch it so the mom dies the main character dies and the killer runs away free to a other open house then the movie ends i was like wow that movie sucked but the acting was good and the Camra work was great but after that you dont get to know who is the killer so overall dumb movie that did not need to be made so 1 out of 10 stars bad movie and bad ending do not watch this movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jester-40564",
        "review_rating": "3",
        "review_title": "Terrible 3rd Act. Lets the whole film down.",
        "review_detailed_main": "I thought the first hour of this film was ok. Nice slow burn. And random characters added throughout as the possible 'intruder'. Sure the main characters do some stupid stuff to keep the plot moving forward, but for the most part I let it slide, because I was still entertained.\n\nThe last 20 minutes however was just awful. I expected the movie to ramp up and get exciting with the mother & son making the intruder wish he'd picked another house ... but no, there was no fighting back. They both die and he leaves. And he was no one. They didn't even show his face, which was kind of stupid. Make it the crazy Neighbors husband or something. Anything but the nothing you chose.\n\nAlso, hire some stunt people/stunt doubles. I know the film was made on the cheap, but that 3rd act needed some actual action and there was nothing. They couldn't even smash a table or have someone falling down the stairs - the basics. It was so dodgy.\n\nI'd recommend not watching. You'll just be disappointed."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "josephmoland",
        "review_rating": "1",
        "review_title": "I'm honestly dumbfounded that people got paid to make this movie.",
        "review_detailed_main": "This is my first time reviewing a movie. I felt compelled to write this review for the common good of the Netflix community. This movie made no sense whatsoever. No questions were answered, the plot had so many holes in it, and the script seemed ridiculous. I was not convinced with any of the dialogue; it all seemed canned and unbelievable. The music was good at times. But what in the name of all things holy was up with those scenes with the suspenseful music, where nothing even happened? For example, at one point, suspenseful music crescendoed while Logan walked in the basement. The camera focuses on a bunch of wood, and then the scene ends. What the hell? Was that wood supposed to be a foreshadowing of something? At another time, intense music builds up and ends with the camera just focusing on the woods outside. There were multiple instances of this. It's like the directors went to film school, learned about suspenseful build-ups, but completely fell asleep while the instructor covered how to use them. There has to be, like, a reason! I'm thoroughly astounded that Netflix picked this up. You mean to tell me that a Netflix executive watched this, liked it, and made the conscious decision to pay for this movie? I honestly can't believe that. My honest (but maybe a bit crazy) suspicion is that this movie was made by artificial intelligence. A crude, experimental AI algorithm designed to configure a set of factors such as sets of characters, plot points, sets of dialogue and such, into a set amount of time. And the Netflix community is unwittingly the user testing group. There's no other serious explanation. The dialogue was so forced and unrealistic. The characters weren't believable. The plot, especially, was incoherent. AI is breaking into everything, and it has to start somewhere. If this really was AI, at least in some capacity, calling the shots as a director, I'd say it was a good first effort. But if this was an actual human production, may God have mercy on these producers' and directors' souls and careers."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "glibota",
        "review_rating": "1",
        "review_title": "Possibly worst movie ever made",
        "review_detailed_main": "No plot , no character development..just makes no sense whatsoever. I would rate this below zero if I could"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "andrewhindjazz",
        "review_rating": "1",
        "review_title": "I wish I saw the rating before watching",
        "review_detailed_main": "Absolute trash. AVOID. AVOID. AVOID. This movie is precisely the reason I want to see the IMDb rating in the movie description on Netflix. Match percentage is the most useless thing I've seen in ux. This movie makes me reconsider whether I should have a subscription on Netflix.\n\nIn open house there were so many ways you could make this movie great. The setting was ominous, the grading was skewed toward cooler balance, there are characters around that you start suspecting of being the villain or aiding the villain in the story. As the result, at the end of the movie, the only people you suspect are the writers. And I suspect they are serial killers of Netflix audience's brain cells.\n\nThis is probably the worst movie I've seen in my life. And it is precisely because it does not show you that it's bad from the beginning.\n\nI've just registered on IMDb to leave this rating and vent the frustration of wasting the 1.5h of my life on this. Please avoid a mistake of giving this movie a chance."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jerichokane20",
        "review_rating": "1",
        "review_title": "1 Star as I can't give it 0.",
        "review_detailed_main": "I am basically reiterating what other reviews have said. Netflix has the laziest stable of writers in the world. How their movies are written: Something happens, you don't need to know why just accept it, you won't get a good ending and the middle is usually an hour of filler where nothing is explained. Lazy! Lazy! Lazy!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lauradcosta-14078",
        "review_rating": "1",
        "review_title": "They forgot the ending!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hafedhbaazouzi",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "I'm really disappointed, it's nonsense. An invisible one who kills people without knowing who and what is the cause. I only lost almost two hours of my life.\n\nI do not advise anyone to see it. I don't know what the creators of the film were thinking when they made this film. There is no connection between the people and the scenes in the film. I don't know what to say i'm not advising anyone to waste almost two hours of their life watching this movie.\n\nI'm really disappointed, it's nonsense. An invisible one who kills people without knowing who and what is the cause. I only lost almost two hours of my life.\n\nI do not advise anyone to see it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jaclynlangenwalter",
        "review_rating": "10",
        "review_title": "Worst case of false reviews I've ever seen!!",
        "review_detailed_main": "Why are people so annoying? If a movie doesn't end with sunshine and rainbows, it gets a horrible review. The writing was excellent and acting was okay. The movie was unique enough, too. This is quite possibly the worst case of SMASHED reviews I've ever seen."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Blackcatangus",
        "review_rating": "",
        "review_title": "If I could rate it a 0 I would",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "digitaltwitch-1",
        "review_rating": "6",
        "review_title": "A Solid Horror Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "megatronacsbb",
        "review_rating": "3",
        "review_title": "Good acting by the main 2 actors gone to waste",
        "review_detailed_main": "I don't usually write reviews because in every movie I watch, regardless how lame it is, I try to see from the point of view of what the director might have tried to achieve.\n\nHow ever, this is one of those least effort movies where the main 2 actors do a banger job, having great authentic feeling reactions to situations, and unfortunately, the directors and writers fail miserably. I feel like I was betrayed for getting hooked on the good acting and having anticipated a climax. I feel left hanging and my time was wasted.\n\nDo not recommend, chose a different horror to be entertained. There's so many other good ones."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pauliev411",
        "review_rating": "1",
        "review_title": "What about the tunnel?",
        "review_detailed_main": "What was the deal with the tunnel? They should not have made it a thing if they were not going to address it properly."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Kai_A_Baker",
        "review_rating": "1",
        "review_title": "Not Even Good Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hiside-64664",
        "review_rating": "2",
        "review_title": "Really!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bob_armeg",
        "review_rating": "1",
        "review_title": "How 6.5?",
        "review_detailed_main": "After reading reviews, am having trouble understanding the do gooders who feel this film was scary or in anyway artistic. Given the available budgets within the film industry, i think it is peoples rights to rate as 0 or 1 star. To those who feel they should criticise the majority of reviewers, why do you think it is so great! Is it the low budget? Mediocre acting? Tedious drama? Or just that you think its thought provoking for you? Everybody has the right to rate. It makes me laugh when reviewers rate ten and then excuse their high marking by saying its not great. Film makers need public opinion so they dont waste money on efforts such as Open house."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bob_armeg",
        "review_rating": "1",
        "review_title": "Better things to do!!",
        "review_detailed_main": "Please dont waste your time! Really bad film with no outcome or real point."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "msjenashcroft",
        "review_rating": "1",
        "review_title": "What's the point.",
        "review_detailed_main": "Never ever felt like I've had my time wasted this much. Wow just worst movie ever award goes to 👆👎"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "xroastedink",
        "review_rating": "1",
        "review_title": "Just... Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "imuckenschnabl",
        "review_rating": "8",
        "review_title": "Good classic thriller",
        "review_detailed_main": "I don't understand the bad reviews here. It's not a gory horror supernaturally themed picture. It's a thriller and a pretty good one. Very well made, good acting, creeps and scary bits at the right place. Found this little gem on Netflix and enjoyed the goose bumps. I give it 8/ 10."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "robinsilverstein",
        "review_rating": "",
        "review_title": "WTF????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "reeves-00366",
        "review_rating": "7",
        "review_title": "Your kidding me,some people are thick...no most",
        "review_detailed_main": "Well I've got to say it...some..no..lots are as thick as pig shit.1 star for this,really ..honestly.I give up on humanity,the clues were there if you looked.Is this a masterpiece,no of course not...it it a 1 star film,good Lord not even close...I give up.Imbeciles."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Rydernikole",
        "review_rating": "1",
        "review_title": "I've had farts that were scarier.",
        "review_detailed_main": "If you like lazily written \"horror\" movies with all the stereotypical thriller elements (teenage angst, family tragedy, depressed mother, weird random strangers, new mysterious house etc.) and you LIKE wasting your time this ones for you. I'm fairly certain this movie was written by Collin Robinson (from What we do in the shadows) as a \"mega drain.\"\n\nThis movie had no point, no conclusion, no explanations. It was a frustratingly slow, predictable, sh!tshow. I couldn't give a spoiler if I wanted to because I had no clue what the point of the movie was, I just know I'll never get the time I wasted on it back. Absolute trash."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mckabbers",
        "review_rating": "1",
        "review_title": "I wish I could rate this even lower than 1.",
        "review_detailed_main": "DONT EVEN BOTHER WATCHING. It SUCKED. What a waste of time!!! I like all kinds of thrillers and horrors and I'm no snob but there was absolutely no real plot. You don't even find out the killers intent nor does the ending really feel like an ending. So sad too because it was very gripping during the intense scenes and the acting was really good!! That's what held me on till the end. Was such a waste of time to watch & absolutely pointless of a film."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sabanovice-69331",
        "review_rating": "1",
        "review_title": "Don't watch this film",
        "review_detailed_main": "Wasted time, the watcher gets 1000 useless facts and none of them get explained, this is just a mild idea, not enough for a good film. It would be a good film if they focused on only one fact and explained it to the deep end, this way they just confused the watcher. The acting is pretty bad aswell, this film was just a waste of production money and our time. Disgrace."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "camarossdriver",
        "review_rating": "1",
        "review_title": "A movie about NOTHING!!!!!",
        "review_detailed_main": "Seriously folks...this movie goes absolutely NOWHERE! If you want to see a good review of this movie,look up \"Elvis the Alien\" on YouTube and he will shoot you the straight poop about this train wreck of a movie. At least when you watch his review,you will get WAYYYYYYY more enjoyment of watching that instead of wasting your time on the actual movie. Even if you can watch it for FREE...I recommend against it. I've never seen a movie that leaves you SO FLAT at the end that almost can't believe it. So go check out Elvis' review,and have a good laugh at this film's expense. Toodles."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Brian2359",
        "review_rating": "2",
        "review_title": "A Ride Straight to Disappointment",
        "review_detailed_main": "This movie was entertaining but it lacks any form of depth or detail. This movie is reminiscent to Strangers. If you liked that you might like this, but if you're not a fan of ambiguous movies with underdeveloped plots I don't recommend it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "plviox",
        "review_rating": "1",
        "review_title": "Do not waste your time.",
        "review_detailed_main": "This could have been a good movie. So disappointed with the ending."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jkender",
        "review_rating": "1",
        "review_title": "An Illustrative Reason why Netflix nixxed Reviews",
        "review_detailed_main": "You may have read a review and witnessed a rating that warned you away from wasting your time on absolute garbage."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sawinar",
        "review_rating": "1",
        "review_title": "What the F did I just watch",
        "review_detailed_main": "I just wasted an hour and a half of my life. I do not recommend unless you'll spend the whole movie on instagram going trough memes or something."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "glamannnoel",
        "review_rating": "9",
        "review_title": "Actually a genius ending...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "wordpower99",
        "review_rating": "",
        "review_title": "What a waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "snoody-65151",
        "review_rating": "7",
        "review_title": "Decent basic horror flick",
        "review_detailed_main": "I am not sure what all the hate on this movie is really about- especially considering the genre of horror movies that lives on Netflix is dismal at best. I am a huge horror fan, and I have seen some really bad horror movies. This is NOT one of them.\n\nNow on to my review about this movie. I will really focus on what worked, I won't even really comment on what didn't work since everyone is spewing it too much any way.\n\nI really enjoyed the initial sense of confusion the film brought, is it a ghost? Or is it a killer? Were they set up by the sister? What is with the neighbor? Will they live?\n\nThese are all great senses of confusion the filmmakers brought to the table in a horror flick, you shouldn't know where the film is going and it creates a great deal of confession as a viewer- which I really enjoy. These types of atmosphere for horror are rare, but when done right- can keep you watching it till the end since you don't have a feeling you figured it out at any time.\n\nMy favorite aspect is the unexplained backstory- Halloween (78) is a great example of why someone (or something) can be so scary- because we don't understand it. We shouldn't need backstories explained out for why someone kills people in scary movies. Again this is a horror movie, if you want that level of detail- check out MindHunter. This is about creating a villain that is so uncomfortable- you don't understand them at all. (Side note on this: this movie is riddled with homages to the original Halloween). And no- you as a viewer should NOT be connecting with a horror villain like this in order to enjoy the movie, you would feel confused and weirded out. That is how the filmmakers want you to feel.\n\nLastly- this movie did a great job making everything look and sound great. I think the score was fantastic and the locations were beautiful. Even down to the small shots of the basement tunnels.\n\nMy main and only complaint is this film does require a larger sense of need to suspend reality. Although- I can't think of how many times I lose my cellphone and \"swear\" I just left it plugged in. I think this movie tries to show you a sense of confusion within the characters that makes you feel bad for them. They are not in their \"right state of mind\" to begin with, however- most people don't call the police or move when you have misplaced something. How many times have you left a light on and swore you turned it off? It creates this sense of how do you even keep track of those things when large issues are on your mind? IE money and family death. I see it too often in people who don't usually watch horror movies: \"I would never go back upstairs\".\n\nOverall, this was decent. It didn't have any hype that I knew of, I just turned it on and watched it. It's fun and has a lot of moments that keep you guessing- until the end. I also didn't find the end confusing at all. I this the final shot made it pretty clear what happened and what will happen again."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "luketictomislav",
        "review_rating": "1",
        "review_title": "Terrible movie, pointless",
        "review_detailed_main": "This one definitely goes in to the category of movies that weren't supposed to be made. The begining is not so bad, one thinks it could be something but than it starts... So many pointless things you can't keep track. Wierd wtf remarks from the neighbour lady, than Chris who is just appearing as from nowhere, etc. I mean, terrible and pointless to watch. Ending??? I don't even wanna go there 😂 Only brigt side to this movie were the main actors."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dj_tourela-you",
        "review_rating": "1",
        "review_title": "Rubbish , It wasn't as i expected to be . .",
        "review_detailed_main": "No Ending don't waste your time !\n\nIs just not worth to watch."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "swaqar-46503",
        "review_rating": "2",
        "review_title": "Waste of my time",
        "review_detailed_main": "The movie ends w/o any explanation or any links to characters in movie. It leaves you highly unsatisfied after watching a movie that seems unfinished"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ryan_hood",
        "review_rating": "1",
        "review_title": "Don't waste your time watching!",
        "review_detailed_main": "This movie was a complete and total waste of time. Netflix has been putting out some entertaining content, but this was a total miss. I'd say spoiler alert, but they didn't write anything to spoil. The movie just ended. There was no purpose, no moral, no lesson, nobody to relate to, no gory murdering or action, and goofs galore throughout. Is it night? Is it day? It apparently doesn't matter. When is the open house? 10 pm? Sure, that's a thing that happens in real estate...\n\nI normally can enjoy a bad movie that has redeemable elements (even if it is just campy fun), but this actually had me wanting my money back from Netflix. It was like the guy that knew the story died during film making, and nobody had the script, but they were too far along to just pull the plug or hire another writer.\n\nHorrible. Not even good enough to make fun of."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "toddj-80108",
        "review_rating": "1",
        "review_title": "Please read reviews before seeing film",
        "review_detailed_main": "Complete waste of time! Full of clichés. No ending. The 1 star is for the scenery. A load of s#1/!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "perrysantosjr",
        "review_rating": "1",
        "review_title": "oh my.. time wasted.. big time!!!",
        "review_detailed_main": "Not fond of giving reviews.. but this is an exception, just to say how bad it is... time wasted.. BIG TIME!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pdhemming",
        "review_rating": "1",
        "review_title": "Redefines awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "alexkcampbell",
        "review_rating": "1",
        "review_title": "$100 budget",
        "review_detailed_main": "This must've had a very small budget. The sound effects were that of the 1980s."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "squid_morgan",
        "review_rating": "9",
        "review_title": "Shame on all these bad reviews!",
        "review_detailed_main": "I actually enjoyed the movie, a lot.... It's seems to capture a realness to it. In reality not everyone lives. A most certainly not everyone gets caught.\n\nI also thought the music was was well done. Yes it was a little obvious at times, but I definitely did not hate it as much as everyone else on here seems too.\n\nThe acting was great, and honestly it makes me want to see a second movie as to who the killer is and what he does next!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "papachristosvassilis",
        "review_rating": "",
        "review_title": "This is so Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "poppiesndaisies",
        "review_rating": "6",
        "review_title": "Not a bad movie, actually.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "nkeemer",
        "review_rating": "1",
        "review_title": "Terrible movie! Waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sziszaktibi",
        "review_rating": "1",
        "review_title": "Absolutely crap",
        "review_detailed_main": "Is not a movie it's like a daily news. Do not watch it if you don't want waste your time. Never seen a bad movie like this before."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jjacendlg",
        "review_rating": "1",
        "review_title": "Lazy writing is inexcusable.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "punchynella",
        "review_rating": "1",
        "review_title": "Worst Movie In History!!!",
        "review_detailed_main": "This was the most horrible movie I have ever had the misfortune of watching. Sucks! Do not waste your time. The only reason it got a one is that's the only way to write a review. They need to give the option of zero stars"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "knordberg",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Slow movie, no resolution, dumb. Don't waste your time. Not even a fun, campy movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "chris_schutt",
        "review_rating": "1",
        "review_title": "Watch \"The Rental\" instead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kanescott-313-110263",
        "review_rating": "2",
        "review_title": "From Good to Bad to Tragic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rbourlan-59180",
        "review_rating": "1",
        "review_title": "Decent enough start, stupid ending",
        "review_detailed_main": "All the actors were good. It's just that this story sucks. I mean, it's starts well enough, it builds up suspense, and then at the end it just poops the bed. This movie doesn't deserve one star."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dennestejada",
        "review_rating": "9",
        "review_title": "Excellent Horror/Thriller",
        "review_detailed_main": "Do not listen to all the dumbed down reviewers here who always need a Hollywood style story and ending. This was a fantastic film thats keeps u confused and creeped out throughout whole movie. And the ending makes this movie significantly better. A real world ending. Not a Hollywood hero saves the day garbage!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "wendywalker-43791",
        "review_rating": "",
        "review_title": "There is no negative score on the rating scale, so I refuse to even give it one star.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kowalski-penguin99",
        "review_rating": "6",
        "review_title": "Actually a really decent movie, until the VERY end",
        "review_detailed_main": "I honestly don't know what all these crappy reviews are about. Was it my favorite horror/thriller movie? No. But it was certainly suspenseful, tense, and certainly thrilling. It starts off a little slow, but it does an incredible job of building everything up until the end half hour. My only gripe with this movie is that the ending leaves a lot to be desired. It's very intense and adrenaline-pumping, but it doesn't quite answer *why*. I'm left wondering what exactly happened to them, and the reasoning behind it, especially given the back story generated. Still, the movie was very good, and it doesn't deserve the terrible ratings it is getting!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dylanjake-47332",
        "review_rating": "1",
        "review_title": "Not worth it",
        "review_detailed_main": "Spoilers, there are none. Nothing is ever revealed or solved."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pnssfa",
        "review_rating": "1",
        "review_title": "don't watch this movie it sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rivanerakaren",
        "review_rating": "1",
        "review_title": "Don't bother",
        "review_detailed_main": "Had great potential as a story but turned out to be really bad I can't believe the actors agreed to do this movie, its a shocker."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "krystlepies-filmsR4ever",
        "review_rating": "1",
        "review_title": "Noooooooooo",
        "review_detailed_main": "It was a terrible movie!! No hidden underlined message I promise!! Not one of those, maybe I missed something. It's not you, it's this movie! It was like the directors first story he wrote when he was a kid or something and always dreamed to see it turn into a movie. Do anything but watch this. It's random not scary with no plot... everything left unexplained for no reason...the dad was the worst dad casted ever... the suspense scenes were so drawn out for nothing. Just dumb!!!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "feebyyfm",
        "review_rating": "2",
        "review_title": "Don't watch this movie, you will regret it",
        "review_detailed_main": "This is probably one of the worst movies ever made. And that has nothing to do with budget, or even talent, but everything to do with the writing. Structurally, the story is stupid. It's like it has two acts instead of three, at least that is how it felt as this movie went in a very straight, overly predictable line the whole way through. And it is strange, because at times, on a few occasions, there were seemingly set ups for a more complex plot, suggestions of things going on... Then no playoffs. None. Just confusion. And... What? Stupidity. You know what else is stupid? That somebody funded this movie. That it was even made. It's not even got the 'it's so bad it's good' thing going for it, it's just bad. And boring. And a waste of time. Don't watch this."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "terencesherwoodofficial",
        "review_rating": "1",
        "review_title": "Senseless and pure Waste of Time!",
        "review_detailed_main": "What can I say. The whole story is very rich in horror clichés. Well, the whole production is rather cold, bad and boring. If the film tries to be creepy, it ends up in a disaster of predictable jumpscares. Even if the newcomer main actor does everything, it doesn't save the film. I bet he is annoyed to have played there. When the end comes, you hope all the time for a smart and well thought out end. However, you will be extremely disappointed if you find out that it has nothing to do with each other. One of the worst films I've ever seen. Even attributing this rating was exhausting. Nevertheless I wanted to share my opinion."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "clintcooper-59285",
        "review_rating": "1",
        "review_title": "No Plot",
        "review_detailed_main": "Don't waste your time watching this no plot and and no storyline this has got to be the worst film I have ever seen. And please if the light is not working in the basement that would be the first thing I would fix !"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "thelovelyone-29539",
        "review_rating": "1",
        "review_title": "Worst 1.34 hours of my damn time.",
        "review_detailed_main": "The person that wrote and directed this piece of crap need to find another job ."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "celinasachs",
        "review_rating": "8",
        "review_title": "It's all about a different perspective.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "nicholaswopperer",
        "review_rating": "",
        "review_title": "READ BEFORE WATCHING",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "batemankrew",
        "review_rating": "6",
        "review_title": "Not Necessarily a waste of time....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "prsnnaik",
        "review_rating": "1",
        "review_title": "Created IMDB acct just to ask others NOT to watch this",
        "review_detailed_main": "Let me spend 10 extra minutes in creating IMDb account and writing a review so they you all can save 90 minutes each!\n\nI have heavily depended on IMDb rating before watching any movie. However I didn't do my due diligence for once and assumed a Netflix content will be good.\n\nActing was actually very good. There were cheap creep sound scare tactics here and there. The biggest put off other than the ending was logic. No logical person would keep doing the things which the actors did.\n\nLike most reviews here I didn't like the ending either. Many questions were left answered. Save yourselves some time, watch something else."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gcooper-03107",
        "review_rating": "1",
        "review_title": "Worst. Horror. Movie. Ever",
        "review_detailed_main": "I wont get into a full on review i'll leave that for the critics, but this movie was absolutely BAD. I remember thinking \"ugh, another scary movie\" and decided to watch it anyway because my nephew was interested. I assumed it would just eventually show who the killer is and they would kill the killer and hooray happy ending. I guess they deserve props for not doing what was expected but the ending they delivered was worse than expected. It leaves the watcher completely clueless at the end and completely unsatisfied. Unless there is a sequel coming, which im not sure anyone would be interested in after the first one, no one will receive any kind of closure. Basically what it boils down to is 'if there is a way to not do a cliche horror movie ending, this isn't it'"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lyv29",
        "review_rating": "1",
        "review_title": "Complete garbage",
        "review_detailed_main": "What the actual eff? Don't waste you time like I did."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "timothy_pate",
        "review_rating": "1",
        "review_title": "Literally signed up to write this.",
        "review_detailed_main": "I literally just signed up to write this review. Do not waste your time watching this garbage! Seriously, this movie stinks... It's probably the worst movie I've ever watched and I'm honestly one of those people that see a few bad reviews on a movie and I'm like ehhhh I'll give it a chance. Dont!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "caliheartskash",
        "review_rating": "1",
        "review_title": "This. Was. Terrible.",
        "review_detailed_main": "There is legitimately no plot lol. Can't think of a way to explain it in any further depth but to say this movie is completely & utterly pointless."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "montanawomen",
        "review_rating": "1",
        "review_title": "???",
        "review_detailed_main": "I watch this movie and I dont understand it and it dont make no sence"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "horgitom",
        "review_rating": "2",
        "review_title": "Waste of time , avoid",
        "review_detailed_main": "By any chance avoid this movie, scenes are absolutely illogical and absurd and there is basically no plot twist, still trying to comprehend what actually happened, trust me not worth it. The ending is dissapointing, there is barely any action and it is pointless jumpscares with basically no story behind it. The actors weren't bad , but with the script they was given, they couldn't really do much.\n\nAvoid this movie at any costs , and save your time watching something else."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "v_f_s",
        "review_rating": "9",
        "review_title": "This is a genre bending film",
        "review_detailed_main": "I don't understand why people gave this film 1 star. It's incredibly paced and well written. The film lives up to its horror genre because you get the shrieks and screams you expect from a scary movie. Then suddenly, unlike your typical horror movie; it jolts you into a different genre, like Psycho. This is such a fun movie. A definite hit and a refreshing movie in a genre that is often stale, unoriginal poorly executed and poorly written. This is an excellent film."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "chamidullinr",
        "review_rating": "",
        "review_title": "Disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fampeters",
        "review_rating": "7",
        "review_title": "Not too bad as what others rated",
        "review_detailed_main": "I thought the movie had some good scares and suspenseful moments. The suspense was constant really. The acting was pretty good, especially by main character Dylan Minnette (Logan). It's just the writing that I have a problem with. A lot more could have been done with this movie. Disappointing ending though, but it's an open ending so maybe there will be a sequel?"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "thaotf-04686",
        "review_rating": "1",
        "review_title": "Just wow",
        "review_detailed_main": "Why do Hollywood think we want to watch movies with no conclusion."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "smroberson-33041",
        "review_rating": "1",
        "review_title": "I created an IMDb account just to warn you about how horrible this is!!",
        "review_detailed_main": "This is the worst movie I have ever seen in my entire life!! Do not waste your time..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ovintai",
        "review_rating": "1",
        "review_title": "Some good acting without any good writing",
        "review_detailed_main": "Very little was explained in this movie at any time.\n\nThe setup was clean enough, and the early actors gave us hints as to family dynamics and the challenges the main characters were facing.\n\nSoon something changes the course of their lives, and we proceed from there. When the family moves to a house that one of their sisters owns, they have to clear out on Sundays because the realtor is holding open houses then. Hence comes the title; fine.\n\nThe problems with this suspenseful ride were twofold. First, a few foolish things happen that seem implausible, but you can forgive that since the characters are struggling with some heavy issues (no spoilers here).\n\nBut far worse, the ending to this movie made NO sense at all, and when you see what the writers must have considered a reveal, it reveals nothing at all, either.\n\nThe acting was fair, even if the producers didn't develop the characters as much as they did the scenery. But the reasons behind it all were never given, and how can you care about characters or a story if it all means nothing in the end?"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Hayden-86055",
        "review_rating": "2",
        "review_title": "Tedious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "joee-53752",
        "review_rating": "1",
        "review_title": "Holy S*;_!'.....",
        "review_detailed_main": "That was bad.\n\nReal bad.\n\nSo bad that created my first IMBD account explicitly to come here to let you know not to bother watching it, because, it was that bad. So many reasons not to watch it, I can't list them all. But let's start with: 1. Weak plot.\n\n2. No fear or horror or terror involved.\n\n3. Obscene amount of \"but that doesn't make sense\" moments. The kind that make you pick up your phone and start scrolling because you check out of the movie.\n\n4. Mom looks like she literally dying the entire time (probably not a reason NOT to watch, but like.. why?) 5. Back story was pointless. Utterly pointless. It did not lend to any emotional nuance or plot twist or anything. Just wasted film time.\n\nWatch something else. Catch up on One Piece... You know you have like, 397 episodes left."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fishostu",
        "review_rating": "1",
        "review_title": "Dont bother",
        "review_detailed_main": "C grade movie trying to reach b grade. Pathetic production/direction of a crap story with no substance. Dont waste your time with this."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "georgewenger",
        "review_rating": "1",
        "review_title": "Waste of Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ginatorbett-190-279173",
        "review_rating": "1",
        "review_title": "Waste of My Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pencive-31711",
        "review_rating": "8",
        "review_title": "The best worst horror film in years",
        "review_detailed_main": "Ok, I rated this movie an 8/10. And I realize this might be insane. But, here's the thing-\n\nWhen a horror movie changes the formula you're used to, it can make it linger. That's basically what this movie does. The ending is a twist by any means of horror. Sure, there's a body count. And you see the \"killer\" during the movie. But this movie stuck with me for a long time. 2 years now.\n\nI've seen a lot of horror, a LOT. And there's some gems out there. This one must be one of the most well put together films of Netflix horror. It's clean, slick, got good acting, good cinematography, good directing. Buuuut, the writing leaves you wanting more. And it here that I think this might be a hidden gem. Can you imagine a horror film that actually messes with you? That's part of the genre. And people aren't going to say, aww, what a poorly made movie. I'm slobbering for more. It's so creepy. Almost too real."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "stan-onyejekwe",
        "review_rating": "",
        "review_title": "Worst horror movie ever!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "adriianna-40299",
        "review_rating": "7",
        "review_title": "Not as bad as everyone's saying",
        "review_detailed_main": "This movie isn't a bad movie, until the end. It's suspenseful and keeps you guessing until the end, then still keeps you guessing after it's finished. Besides from not answering any of its watchers questions, it's a pretty good movie. If you get frustrated at not having any answers, however, this isn't the movie for you."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "wrltsc1je",
        "review_rating": "1",
        "review_title": "If you enjoy watching movies where the ending leaves you angrily saying WTF then this is the one for you.",
        "review_detailed_main": "Be prepared to have a surge of anger at the end, while swearing off all Netflix shows forever."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fgf-23451",
        "review_rating": "1",
        "review_title": "Plot holes and no story line",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dhandysetiabudi",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Dont usually write reviews. Just have to do one to make the score even lower. Cant help feeling tricked or pranked at the end of the movie. You would totally feel you had wasted your time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Chrotesque",
        "review_rating": "2",
        "review_title": "Sort of okay until the missing end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ayushimuchhal",
        "review_rating": "1",
        "review_title": "worst movie",
        "review_detailed_main": "It was the most horrible movie i have ever watched i m entire life..!! Never watch it!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bkdktbyq",
        "review_rating": "1",
        "review_title": "Sheet",
        "review_detailed_main": "Hard sheathing movie. Burning director and sheeting on him."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dcraddock-34163",
        "review_rating": "2",
        "review_title": "If, maybe..",
        "review_detailed_main": "It was better written to be a sequel thriller I could see it's potential. But it falls flat. Pretty good acting is about all that strings you along."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hartofglass",
        "review_rating": "1",
        "review_title": "Thanks Netflix...",
        "review_detailed_main": "My roommate just kicked my @$$ for making him watch this. Over an hour of life lost AND a black eye...two thumbs down and a circle 👎👎"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jjfromnyc",
        "review_rating": "8",
        "review_title": "Finally a decent horror film",
        "review_detailed_main": "Eye candy for males and females - Check Lots of scares - Check Good Acting - Check Doesn't have to explain everything to the audience which is awesome because that means they don't think we're a bunch of monkeys - Check Leaves you with the feeling that you might be running into this killer someday - Check"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "whitleybly",
        "review_rating": "",
        "review_title": "Horrible movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "apollox-62268",
        "review_rating": "6",
        "review_title": "Wtf is with the low ratings? Solid home invasion horror.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "klspyx-121-406570",
        "review_rating": "1",
        "review_title": "What the hell?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jch579",
        "review_rating": "1",
        "review_title": "Absolute garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hharoonq",
        "review_rating": "1",
        "review_title": "Puke party with no ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rdahliwal",
        "review_rating": "1",
        "review_title": "The other 1-star reviewers aren't philistines. This is a mess.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "makissig",
        "review_rating": "1",
        "review_title": "A complete waste of time",
        "review_detailed_main": "This was a complete waste of time. Don't even bother to watch it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fender-67800",
        "review_rating": "1",
        "review_title": "Poo poo",
        "review_detailed_main": "If I was filthy rich I would sue she producers for the pain and suffering this film created."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bassemierjeff",
        "review_rating": "1",
        "review_title": "Beyond a waste of time.",
        "review_detailed_main": "It's not just bad it's unfinished. Created this account just to leave a bad review. If your considering changing the station do it. You'll save precious minutes of your life."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sultarnibanani",
        "review_rating": "1",
        "review_title": "What the heck",
        "review_detailed_main": "The only good thing about this move is the acting , I wish I could get the 2 hours of my life back .\n\nAbsolutely horrible! What is the actual point of the movie ?"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "robertemerald",
        "review_rating": "8",
        "review_title": "True imagining of a real horror",
        "review_detailed_main": "The beauty of this movie is the reality it depicts. The noble premise, which I thought brilliant, is to take two utterly ordinary and defenceless people, driven by tragedy and circumstances to a huge rambling mansion, which, again by circumstance, they are forced to leave vulnerable and open to the public for long periods. This defencelessness is heightened by the lead's terrible eyesight, being effectively blind without contacts or glasses. This is very sophisticated drama, and the actors and director manage this with consummate skill. However, such realism, which by its very nature can be time-consuming to portray, may well not be everyone's cup of tea. And the length of the buildup does tend to immunise the viewer from a lot of the scares that repeat. It did for me, but not for my brother, whom jumped twice as often as I did. The tragedy mentioned is revealed only in the behaviour of the leads, a delicate thing, and why I give this piece a high score, with only one flashback late in the movie to make the circumstance specific. That was a plus for me. There is very little gore or splatter and certainly no special effects. It is an effective journey into an ultimate and very real horror, but it is also a very sad reflection on tragedy and vulnerability. I loved the message of this movie. This is an intelligent picture."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "suzieq-75771",
        "review_rating": "",
        "review_title": "I need an ending!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "redplanet-26155",
        "review_rating": "7",
        "review_title": "Pretty good Thriller",
        "review_detailed_main": "I absolutely don't understand why that movie has such an awful rating... It's a pretty good Thriller and far from \"a waste of time\"!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "iimorbiid",
        "review_rating": "1",
        "review_title": "I literally made an account only to say how bad this movie is",
        "review_detailed_main": "This is one of the worst movies I have ever seen. So much happens in the movie that literally contributes to nothing.\n\nOne hour in I paused for a bathroom break only to realize I've seen 2/3 of the movie and yet nothing has happened other than a door moving a little bit.\n\nSeriously, avoid this movie. If I had the budget these directors had I'm 99% sure I could make a better movie than them."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "elephant-21081",
        "review_rating": "1",
        "review_title": "Huge waste of movie making",
        "review_detailed_main": "Beyond a waste of movie. You have been warned. If you watch it your on your own. There was no point to this movie and the ending was beyond the worst ever."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "smishyb",
        "review_rating": "2",
        "review_title": "Pointless and LAME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kaneaaron",
        "review_rating": "1",
        "review_title": "Teachers were wrong!",
        "review_detailed_main": "All my English teachers were wrong. Apparently your final draft can be your first draft as it seems that's what the writers did."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "andreaspahis",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Are you looking for a nice mystery movie to spend your night? Then stay away from this. The ending is totally stupid, makes you wonder if there is bottom on today's filmmaking industry."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Iusedtobeacat",
        "review_rating": "1",
        "review_title": "Stupid and Lame",
        "review_detailed_main": "This movie is a complete waste of time.\n\nNow, most movies have three acts. Act I. II and III but this movie only has II Acts.\n\nIn the first one, everything seems fine then goes bad in the second one everything gets worse and then it ends. There is no explanation for any of this, no background no nothing. It seems like half of the movie was cut off for some reason and only the unexplained bits are kept.\n\nUgh, worst movie ever."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jenamer-83324",
        "review_rating": "1",
        "review_title": "Do not watch",
        "review_detailed_main": "Omg this is the worst movie ever! There is no ending! A total waste of time. I wish I would have looked it up before I watched it. I created an account just to review this movie. It sucked don't watch! I'm giving one star because I can't give 0."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "richardhands",
        "review_rating": "1",
        "review_title": "What?!",
        "review_detailed_main": "Full of suspense and full of crap. The end was ridiculous. All a complete waste of time and money."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "vmcd-34831",
        "review_rating": "8",
        "review_title": "What's all the hate for?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jmarkuli",
        "review_rating": "",
        "review_title": "Easily the most infuriating movie I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ramseyjake",
        "review_rating": "7",
        "review_title": "Absolutely worth the watch",
        "review_detailed_main": "This movie is packed with suspense and is an excellent thriller. Lots of one star reviews do not do this movie justice. For a free Netflix movie, it is worth watching!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "MysteryFilm",
        "review_rating": "1",
        "review_title": "Awful. Filmmaking at its worst",
        "review_detailed_main": "This is a terrible film.\n\nIt's en entire waste of getting involved in it, as the ending will leave you so angry and disappointed and frustrated...because there is no ending.\n\nYou invest in these two 2 dimensional characters only for there to be no resolve. Lazy. Wasteful.\n\nNetflix are confused. This film is confused.\n\nIt's utterly pointless with no arc, no development, utterly unbelievable story - call your sister you dumb woman! Call the police! Why would the sister not say that you can stay in an open house?\n\nAwful. Messy."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "demonsquipster",
        "review_rating": "1",
        "review_title": "yet another extremely boring and forgettable netflix creation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lucyroman-91523",
        "review_rating": "1",
        "review_title": "Worst movie!!",
        "review_detailed_main": "Please don't waste your time watching this garbage. Worst movie I've seen. The movie is so unsatisfying and doesn't make any sense because nothing is explained"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "djsethpty",
        "review_rating": "1",
        "review_title": "Excellent, until it turned to absolute garbage",
        "review_detailed_main": "I don't even know how to rate this, because it was so awful. The movie was set up to be great, and there were good suspenseful attributes. There is literally no story line or ending though. It's like the writers were all fired 3/4 of thethrough."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "singleflowernomore",
        "review_rating": "1",
        "review_title": "The worst movie you can ever watch",
        "review_detailed_main": "When i say this is the worst movie you can ever watch i mean it because there is nothing to watch The movie is about a mother and a teenager moving to a mountain house and then nothing The director trues to convince us that there is something terrifying is happening by this stupid music but actually nothing is happening and then at the very end of the movie some mysterious man kills the mother and her son and we don't know who he cause we don't see his face and we don't know why he killed them It's pure stupidity i guess Very very bad movie"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lilmama611",
        "review_rating": "1",
        "review_title": "Great potential horrible ending",
        "review_detailed_main": "This movie had such great potential but the random guy killing for NO reason in this house was DUMB. THE SUSPENCE was great but NO EXPLANATION on who or why......and everyone acting weird locally.....soooo disappointed EVERYONE DIES for no reason at all......waste of my time watch in ng this.......COULD HAVE BEEN GREAT.....This Movie SUCKED!!!!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dragunzlair-321-145609",
        "review_rating": "1",
        "review_title": "Actual zero rating",
        "review_detailed_main": "I could write a better screen play than this! I am embarrassed for the writers, and of course any and all crew that worked on this POS. This was the worst movie I have seen, well...in ever!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rondawininger",
        "review_rating": "1",
        "review_title": "Wish I could give negative number rating",
        "review_detailed_main": "This film was a complete waste of my time from beginning to end. There is no reason given for ANY of the things that happen. They do not even bother trying to establish a plot. Netflix should lose subscribers for putting this in their rotation."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "athenarosa",
        "review_rating": "10",
        "review_title": "Decide for yourself. Don't judge from these ratings.",
        "review_detailed_main": "I was disappointed to see so many bad reviews on this movie and am really glad I didn't see them before watching it. This film was written, directed, and acted in such a way that I was hanging on every minute. The ending was brilliant. I don't want to give spoilers, but I don't think the ending was confusing at all. It was the single most disturbing moment of the whole film, and this is a film full of disturbing moments! I hope if you're reading this, you will give this film a chance. Go in with no expectations and enjoy the ride!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "chs-53836",
        "review_rating": "7",
        "review_title": "It's a good horrormovie!",
        "review_detailed_main": "Don't really understand the bad reviews? It's good acting and the plot holds. Like it!!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "chalmersdave",
        "review_rating": "1",
        "review_title": "A waste of 90 mins",
        "review_detailed_main": "Terrible story, terrible cinematography, terrible acting. Rubbish \"climax\" and awful ending. Don't waste your time watching this"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tariqzafar-12020",
        "review_rating": "1",
        "review_title": "Dont waste your time.",
        "review_detailed_main": "One of the worst movies I have ever watched literally. In every scene they try to create a tension but just swoons away in a moment and everything goes normal. That way you keep waiting for some shock which you never get. In the earlier parts they try to build some supernatural tension and in the end it suddenly becomes a serial killer. U don't even get to know who it is, why he is doing this, any of this. In one of the scenes a neighbourhood guy goes into the basement to have a look at the house and there is no closure to that scene. That is the harbinger of what is to come ie the movie also doesn't get any closure likewise and ends. All in all don't waste your time on this."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "carlosleyequienabarca",
        "review_rating": "1",
        "review_title": "One of the rare ocasions where the score it gets reflect reality",
        "review_detailed_main": "It was a promising movie at the beginning, but man did it let down, oh my gosh did it let down\n\nThe acting goes from mediocre to middling\n\nThe absolute worst about this movies is its cheap writing, Netflix did not miss its chance to disappoint again, which has been more frequent lately, from the nonsensical beginning that can be forgiven because it is the start of the movie, to the cheesy and out of place conversations there are in the movie, everything goes from bad to worse quality wise\n\nIt is full of cheap moments with \"Please\" moments sprinkled here and there\n\nThere is nothing, excepting the initial trauma, that makes you connect to any of the characters, and the deaths are as cheap as the writing itself unfortunately\n\nAll in all, this movie was a waste of time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "karavaughn-18179",
        "review_rating": "1",
        "review_title": "Boring!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "joshkulp-25633",
        "review_rating": "1",
        "review_title": "There is NO ending!!!!",
        "review_detailed_main": "This movie started off great! Could've done with less depressing scenes but it was good. Then the last 10 mins came and oh my god is it terrible. Its like they had a great budget and then ran out of money in the last 10 mins of the movie. Like come on the movie basically just cuts off. With ZERO explanation of what happened.... DO NOT WATCH!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bijan-26642",
        "review_rating": "1",
        "review_title": "Another worst movie in Netflix...",
        "review_detailed_main": "I just registered in IMDB to rate this movie... Really disappointed by Netflix..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "uzay-38004",
        "review_rating": "1",
        "review_title": "DO NOT WATCH",
        "review_detailed_main": "Waste of time. Very disappointing. Like an alien movie that you will never see clearly."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "svenbras",
        "review_rating": "1",
        "review_title": "BIOHAZARD !!",
        "review_detailed_main": "The lesson I learned from this ...thing is when one chooses randomly a Netflix movie, one should first check IMDB, in order to be able to avoid watching something like this. I turned 41 recently, and this is the worst thing I ever saw in my life. IMDB should allow ratings below zero for this. Litterally everything is awful about 'Open House'. The house itself is disturbingly ugly, the people pretending acting, oh Lord, how I pity them, and the story...words litteraly fail me. Some things happen, some don't,for no reason, the last images were just the last images. A year later, there was Covid. Coincidence? The Wrath of God?"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cecigje",
        "review_rating": "10",
        "review_title": "Best. Movie. Ever.",
        "review_detailed_main": "This was a VERY scary movie. If you're easily frightened you shouldn't watch this. I will never have an open house after watching this movie!\n\n\n\n\n\nJk. Easily the worst and most boring movie I've ever watched."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bamgomes",
        "review_rating": "7",
        "review_title": "Not that bad.",
        "review_detailed_main": "In my opinion this is not as bad as many people have been saying. The open ending leading to a possible sequel didn't bother me at all and left me hoping for a sequel that reveals more about this serial killer.\n\nIt did scare me a couple times and the curiosity about what was happening really got me to keep watching it.\n\nIt may not answer to all the questions (maybe because there will be a sequel) but it does answer the central question of the movie that is: \"Will Logan and his mother be killed?\"\n\nI didn't love it but I liked it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "celticsaga",
        "review_rating": "1",
        "review_title": "spoiler",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Blueskies4020",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I really like Dylan Minnette, but this movie straight up sucks. Watched the whole movie and I still don't understand the point of it. No explanation is given for anything..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sarah_babe",
        "review_rating": "1",
        "review_title": "Dont waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "reidyyy-39418",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "If you fancy a quiet night in with your partner and you don't know what film to watch then just a heads up, don't make it this one. Easily in the top 3 worst films ever made. Literally nothing happens, like absolutely nothing. There's no plot, no back story, the characters have zero personality and the ending leaves you staring at the film thinking why on earth did I just sit through that. Netflix really let the ball slip with this one, would rather paint dry then this utter s***e. Would give it a 0/10 but I dunno if you can. This film belongs in the bin, sort it out Netflix!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "JeanDeMichaque",
        "review_rating": "1",
        "review_title": "So bad that we had to laugh when it ended",
        "review_detailed_main": "This is by far the worst movie I have seen recently. Dont waste your time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rcrump-44788",
        "review_rating": "1",
        "review_title": "Yawn",
        "review_detailed_main": "I love all horror movies. Not this one though, It was horrendous"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "purpleturtle-92853",
        "review_rating": "1",
        "review_title": "wasted my time!!",
        "review_detailed_main": "Found this on Netflix and throughout movie it seems the story will build up and explain all the mysterious and weird occurrences but na it did not crescendo just stayed flat story line and ohhhh so lacking that I fast forwarded the last third of the movie and as expected the end was absolute rubbish... 👎😴"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "saurabkhadkachhetri",
        "review_rating": "1",
        "review_title": "Don't waste time by watching this garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "amandamcole",
        "review_rating": "8",
        "review_title": "Old skool",
        "review_detailed_main": "Ok so here's horror classic in a nutshell, suspense and edge of your seat...with , get this, imagination! If you actually watch and listen you will get it! The killer is revealed but you have to pay attention! I actually enjoyed this as did my 16 year old son who loves horror and suspense. Definitely not a story book tale of the victim always wins. Crazy movie, good job!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "whysosirius-42151",
        "review_rating": "7",
        "review_title": "I actually liked this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "stewaa",
        "review_rating": "1",
        "review_title": "Just lazy",
        "review_detailed_main": "Just lazy writing, my least favorite movie in recent memory. I actually feel angry that I watched this. The movie was just a bunch of loose ends, some people get tortured and murdered at the end and you don't know why anything happened."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "grthai",
        "review_rating": "1",
        "review_title": "Worse than bad",
        "review_detailed_main": "Words can't describe how bad is this movie. It's an example of how a network have thrown so much money just to get a piece of nothing."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jaykatl",
        "review_rating": "1",
        "review_title": "Worst written movie! Negative 10 stars",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mollymunson",
        "review_rating": "1",
        "review_title": "WORST MOVIE EVER",
        "review_detailed_main": "Worst movie I have ever seen. I am so mad at the director for wasting my time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "footloose-867-105017",
        "review_rating": "1",
        "review_title": "The first horrible movie of 2018!",
        "review_detailed_main": "After watching 13 Reasons Why from Netflix i was really looking forward to se Dylan Minnette in a thriller/horror film. But this movie just leads to nowhere... I really enjoyed the beginning of the film. Good acting, good build up and good music. But then you just get a lot of really bad and stupid horror film things thrown at you... Classic cheap jump scares, stupid dreams that they make you belive is real and a lot of really stupid decisions... The ending was one of the worst endings i have ever seen and it doesn't excplain anything at all... Do not waste your time watching this horrible movie! Netflix has proven to me that they can make one of the best TV Shows in the world but this movie was just the worst!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "collinsburns57",
        "review_rating": "1",
        "review_title": "Endis crapititis.",
        "review_detailed_main": "Nice flick for the most part, but at its conclusion it leads to a rather bland and mundane feeling of nothingness or irrelevance, that this movie will be completely gone and forgotten from our heads immediately thereafter."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "CinemaDude1",
        "review_rating": "2",
        "review_title": "Oh my...how embarrassing!",
        "review_detailed_main": "Everyone tried so HARD..acting (despite the paltry material) is quite good. Cinematography is A+. Beautiful set interiors of a gorgeous house-practically-mansion makes you want to go out house-buying. Problem is, what you have here is a cliche machine, churning out cliche nonsense after cliche nonsense same as you've seen so often in every suspense/horror movie you've every seen, that it makes you moan out-loud knowing what's coming 10 minutes before it happens. If you enjoy those long, interminablely slow tracking shots following a character walking and walking and walking and looking and looking (almost always with a flashlight) accompanied by the cliche scary music only to have an overly loud musical \"bang,\" character jumps and yells -- you've got that here over and over again until you feel like you're stuck in a time-loop twilight zone episode...all of a sudden you realize it is YOU who are in a nightmare from which you can't wake up.\n\nYou have seen all of this before, but what's worse, because the characters ARE likable and because you want at lease a reasonable resolution for them -- not to mention a reasonable, intelligent explanation of all the hokum for yourself -- you keep watching; alas, resolutions or explanations for the characters or for you as a reward for sticking with this lump of regurgitated trash is DENIED. What you are subjected to ikn the last reel, completely out of nowhere are violence and torture...and then an end credit roll that will make your blood boil. I won't reveal the ending, but all I will say is, it's not satisfying on ANY level; it resolves nothing and left me, anyway, wanting to find this director and break everyone of HIS damn fingers.\n\nBottom line, it's an unfortunate waste of the talents of everyone involved...but then, they all got paid; you didn't...and trust me, your time and talents are worth more than this scam of a movie. S K I P I T !"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kshirad",
        "review_rating": "2",
        "review_title": "I've never hated a movie so much in my entire life.. until this!",
        "review_detailed_main": "Oh, Netflix, how've you made a huge mistake. The first time I saw this trailer, I thought it had a neat concept. It had the potential of a great mystery. But, oh boy, was I dead wrong!\n\nThe movie starts with Dylan Minette (I won't bother you with the character's name) whose father has a tragic accident as he witnessed it happened. The family has financial problems which prompts them to move. His mother's sister offers them an open house she has yet to sale in the meantime until they get back on their feet. As soon as they start staying there, weird things start to happen.\n\nThe first few minutes starts well, but then descends into a black pit of turd. Why do I find it so horrible? I mean, the actors are fine, the camerawork's great, the cinematography's beautiful. It's just the execution and the storytelling.are so unfathomably stupid, clichéd, and have been done to death. False jump scares; weird, possible red herrings; characters who are oblivious to what's happening around them, who does stupid things. By the end, I was just laughing because of how ridiculous the conclusion is.\n\nThe only saving graces are Dylan Minette and Piercey Dalton. They really tried to convince us with their conflict that stems from their grief. Their dramatic moments were the only highlight of this movie, which are so few and far in between.\n\nIt's infuriating to see such hackneyed work that looks gorgeous and has some great acting. If this were to be released in theaters, it would flop so bad. Don't bother wasting your time on this."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hansmeyer-97641",
        "review_rating": "8",
        "review_title": "A very interesting try and exceptional good result",
        "review_detailed_main": "Despite the most ratings here, I think that this film provided a new approach to the common horror/thriller movies: Precicely because of the minimalistic way to suggest and not to \"cheap\" exposing of everything and the open interpretations to several occurences, the viewer stays always on and after the end keeps thinking.\n\nAnd no, the typical \"american\" film with \"heroes\" who win and thrive at the end is not here to find. At last something new, different and above all, more realistic. It is not a fairy tale, it could happen to you.\n\nThe overal sound of the film is fantastic assumed you have a descent home theater unit, the photography even good and the overal result very satisfying."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "emwee609",
        "review_rating": "6",
        "review_title": "Scary movie with interesting plot twists",
        "review_detailed_main": "I'm glad I didn't read these reviews before watching the movie. The reviews truly don't do justice to this film. It deserves a much higher rating.\n\nThe acting is quite impressive, and the plot is incredibly unpredictable. Some of the movie characters were clearly designed to deceive the audience, and it definitely worked, at least for me.\n\nWhat's most remarkable is how genuinely terrifying this movie is! To be honest, I believed until the very last minute that the film would conclude differently, and it was quite a shock to see just how mistaken I was.\n\nWhile I'm not typically a fan of these types of movie endings, I find it refreshing to have one that deviates from the mainstream. It undoubtedly leaves you with a sense of unease, which I consider a sign of a great movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "boggie4758",
        "review_rating": "2",
        "review_title": "Oh my..what a mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rachelward88",
        "review_rating": "1",
        "review_title": "What....????",
        "review_detailed_main": "This is my first review on IMDB... I have watched some awful films in my time but this one... I fell asleep through it the first time and thought I'd give it another chance. Well, what a complete waste of my time!!! This film had really good potential even though its all been done before! There was a bit of suspense and one part really made me cringe! However there is literally 0 point in the film! I wish I had checked the IMDB rating before wasting my life on it! Who was the killer? Why couldnt we see him? Was it to do with the dads death? Who the bloody hell was that woman? So many unanswered questions! One of the worst endings imaginable! Honestly do not bother wasting your time! This is the only Netflix Original that has disappointed me. Netflix... what were you thinking???"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ditteschmidt",
        "review_rating": "5",
        "review_title": "It had potential, it really did. but the ending kinda ruined it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "emma-35996",
        "review_rating": "1",
        "review_title": "Save your time, watch whatever else.",
        "review_detailed_main": "Worst movie ever. You get no explanation of anything at all in the movie. Just questions about everything."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dennis_jarnstal",
        "review_rating": "1",
        "review_title": "Do not watch",
        "review_detailed_main": "Movie started good and had an interesting plot, but none of the seemingly meaningful events and happenings wound up playing any part in the movie at all, it just stopped with the credits rolling and without any answers to what happened or what you had just watched.\n\nFirst review I have ever written because I felt the need to tell people to not waste their time on this movie like we did. Usually I like everything but this was wasted time for sure.\n\nWatch something else, literally anything else, watch Shrek again, you know you want to!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dfm-73813",
        "review_rating": "1",
        "review_title": "This...movie...was...terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "yviezoo",
        "review_rating": "5",
        "review_title": "Whyyyyyyyyyy!",
        "review_detailed_main": "Come on!!! The ending! Really! What tha! unbelievable! Leave people hanging! Geez! Uh!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "centrodeidiomas_ac",
        "review_rating": "1",
        "review_title": "Beautiful house, terrible movie",
        "review_detailed_main": "Slow to pick up, not really scary, coulda been a better sentimental movie, we hated it"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cagrigur-40376",
        "review_rating": "8",
        "review_title": "not THAT bad",
        "review_detailed_main": "First of all, if you really need to know every detail in a movie, dont watch this one because you wont like it as the other users. yes there was some weird scenes that you might not fully understand but on the whole it was not a 3,2 point movie. it makes you feel their terror and you feel the tension. but although the ending doesnt give you that person, it has some little clues that you may guess what happend.."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "timothyrobertcooke",
        "review_rating": "",
        "review_title": "No Beginning. No middle, and no end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "melorenzofrigo",
        "review_rating": "7",
        "review_title": "13 reasons why the movie isn't THAT bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "manuelasaez",
        "review_rating": "1",
        "review_title": "One of the worst films I have seen in my life",
        "review_detailed_main": "This movie was so bad, I will not even spend any time writing a traditional review. it just isn't worth it. Plus, it seems like this movie is getting hammered by terrible reviews from everyone who is unfortunate enough to see it. So, instead of a review, I have a few questions;\n\n1. To the writers responsible for this abomination; have you ever seen a movie before? Do you understand basic story structure, and how every successful story has to have a clear beginning, middle and end? Where was your road map as to how this movie was supposed to unfold? I am just struggling to understand what the thought processes were here.\n\n2. The movie had everything going for it; Decent premise, a great trailer, an extremely talented cast, a nice soundtrack. How did it derail so profoundly, to the point of it almost appearing intentional? No one releases garbage like this and is proud to have their name prominently displayed in the credits, so what gives?\n\n3. If this is a suspense/thriller, why all of the jump scares? It's too tame to be a horror film and not smart enough to be a real thriller, so whom may I ask was the intended audience? There is salty language, nudity and some disturbing scenes, but everything rolls out like a Teen Nick special. Who were you targeting, and were you aware that you were going to fail everyone with this project?\n\n4. Lastly, what in the name of all that is sweet and pure in the world was the conclusion of the movie about? I would not even call it a real conclusion, as nothing is truly resolved, but were the film makers attempting to evoke a vastly superior film (Funny Games), failed miserably, and said, \"You know what? The movie is done. Just release it as is. Someone is bound to like it\"? I cannot for the life of me think of a single person I would recommend this film to. I just wouldn't do that to anyone.\n\nThis is one of those rare movies that doesn't accomplish anything, which makes it that much more embarrassing as it had all the cards stacked in its favor. The writers should be ashamed that they unleashed this dirty diaper onto Netflix, and Netflix itself should be publicly shamed for allowing it to soil their service. One of the worst movies I have EVER seen, don't even bother watching it out of curiosity. Please, do not waste your precious time like I have."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "daniel_klit",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Don't even try to. No plot whatsoever. Only some scares without any context. NO PLOT. NONE. ZERO. THIS BS OF A MOVIE SHOULD BE ILLEGAL. THERE'S PORN OUT THERE BETTER DONE THAN THIS ATROCITY. Spoilers? Spoilers to what? What plot should I spoil? There is no plot, just 2 hours of nothing at all. Pathetic, literally. Just don't, please."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "cutsie_chick21",
        "review_rating": "5",
        "review_title": "Movie is promising at first but the last 10 mins was horrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "clintstevens",
        "review_rating": "1",
        "review_title": "\"Unexplained Forces Conspire\"...You Got THAT Right",
        "review_detailed_main": "I was all ready to give this fright flick 9 stars. It held me on the edge of my seat...right up until the last 2 minutes. The description read \"Following a tragedy, a mother and her teenage son move to a relative's vacant vacation home where eerie and unexplained forces conspire against them.\" This is what's meant by 'truth in advertising'. Not only are the forces unexplained to the characters, but also to us, the audience. What were the producers and writers thinking? Did they not have any clue how to put closure to the story? What an insult to every viewer who stuck through this movie to the bitter end...and I am one bitter viewer. In actuality, the movie is a solid 8 or 9 stars, but 8 or 9 stars are taken away due to the pathetic ending. Inexcusable, inconsiderate and an embarrassment."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "daisybramble-304-712336",
        "review_rating": "4",
        "review_title": "Not as bad as the reviews",
        "review_detailed_main": "Well we sat with trepidation to watch this new netfix offering, unlike most of the reviews others have left, I found it not so bad, yes the editing left a lot to be desired and no I probably wouldn't watch it again but it wasn't the worse film I've ever watched, it reminded me of a tales of the unexpected episode, everything left unanswered."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "wellbirdie",
        "review_rating": "3",
        "review_title": "Wasted emotional effort",
        "review_detailed_main": "I wouldn't say this is.... I think I can safely say we've all..... The ending really..... The acting was g..... The directing...mmmm....wellll....\n\nAre we seeing a pattern here? Yes. That's how the movie ended.\n\n............."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "takenistaken",
        "review_rating": "4",
        "review_title": "It just led to nowhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "edg0123",
        "review_rating": "4",
        "review_title": "One of the worst endings I have ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "flitz35-633-627650",
        "review_rating": "10",
        "review_title": "A real review....",
        "review_detailed_main": "I usually don't watch movies that got horrible reviews but when I saw bad reviews I thought there were to reasons that this movie was reviewed so bad. The first reason is they got the wrong movie (because the movie was actually pretty good) then the other reason which makes more sense is that the bad reviews were a product of a hired hand because of something personal behind the scenes. With that being said The open house was suspenseful, creepy and well written\n\nI obviously don't think I'd give this movie a 10 but for sure a solid 6.5. I've seen bad movies get good reviews and good movies get bad reviews but this is one of the worse cases of blatant movie smashing I've ever seen"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kenzieriver-50976",
        "review_rating": "",
        "review_title": "Worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "registered_acc",
        "review_rating": "6",
        "review_title": "Quite enjoyable, ignore the bad reviews",
        "review_detailed_main": "I don't often write reviews but I felt compelled to do for this movie as the bad reviews don't do it justice. It is not a bad stiry at all and I found myself on the edge of my seat most of the time. It is a new idea, the actors are good, the setting is stunning and the tension builds slowly. It's one of those movies where you can't quite believe what's happening and it pumps up the pressure nicely, especially at the end.\n\nI am picky with my horror and I like this one. Give it a chance."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "paulmcuomo",
        "review_rating": "5",
        "review_title": "A comparatively decent horror film, although quite overly bleak for me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tiagocampos-02918",
        "review_rating": "4",
        "review_title": "Pointless",
        "review_detailed_main": "Just because you want to make something different doesn't necessarily make it good. There is no plot, no story, no explanation of absolutely anything and everything that happens is pointless. Build ups that go nowhere, mysteries that are created for no reason and are abandoned and unecessary drama in a movie that is not the worst I've ever seen but sure as hell is the emptiest. Just close the house!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jessicaeldridge-64762",
        "review_rating": "1",
        "review_title": "Would give it 0 if I could",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jamiepaton-33876",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "This is the single most boring movie I've seen ever. I've seen a lot of bad movies but this one is just god awful. Nothing happens. Nothing"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "taylagracebrown-40013",
        "review_rating": "2",
        "review_title": "DO NOT BOTHER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "an_w",
        "review_rating": "1",
        "review_title": "Possibly the WORST movie I have ever watched",
        "review_detailed_main": "Good start, certainly grabs your attention. The middle starts to lose focus and consists of random events taking place and then all of a sudden.. the film ends. With NO ending. NO explanation.\n\nAll in all, this film had NO storyline. I feel like I have been cheated and duped into watching this. Slightly embarrassed even.\n\nThis should be called The Open H..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kierstenmay",
        "review_rating": "1",
        "review_title": "Piece of complete shit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Moody_jude71",
        "review_rating": "2",
        "review_title": "Horrible ending....WHAT??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kwingfield-03234",
        "review_rating": "9",
        "review_title": "Cinematic Genius",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "susanlento",
        "review_rating": "",
        "review_title": "Open House? More like Open Ended...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "richarddillomes",
        "review_rating": "7",
        "review_title": "Have an open mind to watch the Open House.",
        "review_detailed_main": "I was minding my own business, trying to fill a quota of things to watch when Netflix suggested this movie. I figured, \"ooh, a scary movie on a Saturday night, starring Dylan Minette (13 Reasons Why), 'Don't Breathe' was good, let's go!\"\n\nThe trailer says, \"You can't lock out what's already inside.\" Maybe we'll get lucky and this will be sort of like the iconic 'Scream' franchise. We follow Logan and his mother as they are forced to move to his aunt's big house in a very secluded location. The only catch is they have to leave for the most part of every Sunday because there's an open house where potential buyers come in and out inspecting the place. Big house, out every Sunday, seems harmless enough, right?\n\nWhen they get back, strange things start to happen like doors closing, things getting moved, and noises from places where there shouldn't be. At this point, everyone becomes a suspect, the kooky neighbor, the over-friendly store attendant, the plumber, the cops, and even Logan himself. Halfway through the movie I confidently said I've got the invader figured out and was just riding it out until the movie ends. Boy was I wrong.\n\nI won't spoil it for you but you have to wait until the end credits to figure out who the invader is. Like literally, you have to read the cast credits. Then it's up to you as to how you will react. A Forbes review got pissed off, it has a 3.2/10 rating in IMDB, while I just laughed and figured to just charge it to Netflix's aggressive expansion for content in 2017-18 (see The Ritual, 1922, Gerald's Game and Hush.) As long as you don't have a lot of expectations and you have 90 minutes to waste, you might actually enjoy it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "yeahitskellz",
        "review_rating": "1",
        "review_title": "Absolute Garbage!!!",
        "review_detailed_main": "No spoilers because there is nothing to spoil! Don't waste your time. Every single persons review couldn't be more accurate. The movie doesn't have a plot. It's just a bunch of random things happening for no reason ultimately to lead to the main characters deaths. Who was he killer? What was the motive?? Noting was explained. I honestly feel so let down. All of the \"significant\" parts had NOTHING to do with the entire movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "backilla",
        "review_rating": "1",
        "review_title": "dont waste your time",
        "review_detailed_main": "I wish i could get back my hour and a half wasted watching this garbage, one of the worst movies i have seen in my entire life"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "harshhariyani",
        "review_rating": "1",
        "review_title": "Better watch the trailer NOT the movie",
        "review_detailed_main": "There is no story at all. Its a garbage garbage garbage garbage"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "lee_eisenberg",
        "review_rating": "2",
        "review_title": "Are there going to be any home invasion movies with an original plot?",
        "review_detailed_main": "As far as I can tell, if you've seen one home invasion movie, you've seen 'em all. \"The Open House\" is no exception. I couldn't tell what the point of it was. Totally empty."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jburtonprod-802-759029",
        "review_rating": "1",
        "review_title": "Horribly Written, Terrible Movie with an Idiotic Ending",
        "review_detailed_main": "I'm really getting sick of The Netflix Fodder School of Fimmaking. You don't have to understand basic storytelling they teach in Creative Writing 101. All you have to do is have a camera, some people to film and a place to shoot it. No need for story, whatsoever.\n\nThis movie spends almost all it's time pretending it's a supernatural thriller, changes genres right at the end and then leaves you hanging. This is not because the writer was clever and wanted to create a genre bending movie, it's because they didn't have f#ck of an idea what they were doing.\n\nThe other title I give these horrible attempts at movie making is 'participation trophy cinema'. This is the result of giving children trophies for accomplishing nothing. They grew up thinking they were 'special' and all they had to do is show up and world was there to kiss their underachieving ass. Well, they should've f#cking applied themselves because we don't deserve to be subjected to their lack of discipline and initiative.\n\nDo NOT watch this. It is a waste of your time and the creators didn't have any idea what they were doing and should never have been encouraged to make movies."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sherida-66306",
        "review_rating": "5",
        "review_title": "So many questions unanswered",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kjproulx",
        "review_rating": "1",
        "review_title": "The Definition Of Terrible",
        "review_detailed_main": "We're in the risky month of January once again and when it comes to watching new releases in entertainment, it's usually a coin toss as to whether or not a movie will actually be good. Ever since Netflix began to release original films, I've found myself holding out hope that fantastic independent films will slowly begin to make their way onto streaming services, instead of failing at the box office. Well, if one of Netflix's most recent films in The Open House is any indication, then we're still a very long way from something like that ever happening. Not only is this one of the most non-scary horror films that I've seen in recent memory, but it's also one of the worst films in general that I've seen in recent memory. People talk about how bad a movie is, but sometimes it just has to be seen to be believed. Now streaming, here's why I think you should check this movie out just to see how bad it truly is.\n\nStarring Dylan Minnette and Piercey Dalton star in The Open House, a film that (after a tragic event) follows them as they work on selling their home. Shacking up in a family member's house up in the mountains while they set up open houses, creepy things begin to happen to them. What's disturbing them? Well, without giving anything away, literally nothing is ever explained to you throughout the movie. It's almost a joke that this film was even made because not a single portion of this movie is terrifying and not a single plot point is interesting enough to hold your attention for two seconds.\n\nLook, I've said this before, but it's really not necessary to make a horror movie to scare the hell out of someone because it's all about atmosphere and visuals. When the It hit theatres last year, it wasn't the kind of film that needed to throw scares in your face, because it focussed more on its characters and made you just care about watching these kids hang out and hope they all make it out of the film alive. So, when a movie like The Open House manages to simultaneously provide incredibly weak characters, laughably cheap set pieces, jump scares that you can see coming over ten minutes before they happen (and that's not even an exaggeration), and a conclusion that's pretty much a slap in the face to every viewer for even watching the movie, then I have nothing good to say about it.\n\nFrom the small films that Dylan Minnette has appeared in, to his larger role in last year's new series 13 Reasons Why, I've always enjoyed watching his performances, but even he was incredibly one-note here. Every time something would happen in their house that was supposed to trigger chills from the audience, it felt forced and quite honestly, every single set piece was a re-creation of another horror film. Yes, it's practically impossible to not draw inspiration from other movies these days, but The Open House just felt uninspired from start to finish.\n\nIn the end, I found myself chuckling if a character died, laughing hysterically at each jump scare, rolling my eyes when a new plot point arises that you already know the outcome to, or just plain being bored at the bland imagery. The funny thing is that this movie has an ending that I didn't exactly see coming, but the way it ends actually makes the movie worse than it already is. It's still very early in the year, but I'll be shocked if this doesn't stay my most hated movie of this year. The Open House is truly an awful film and unless you get a kick out of terrible horror films, then I would advise that you steer clear of this one."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kaysi19",
        "review_rating": "1",
        "review_title": "Is there a ZERO star?",
        "review_detailed_main": "If I can rate a zero star I would for this movie! Such a waste of time. I felt I wasted 90 minutes of my life! Worst movie I have watched for awhile! I hope this sent out a warning to others! I rarely leave a rating unless I love it or I super duper hate it... Obviously, this falls to the second category! Great job on wasting my time!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fxnels2",
        "review_rating": "8",
        "review_title": "Good, Creepy flick",
        "review_detailed_main": "This has got to be one of the most unfairly rated movies I've seen on IMDb, I truly don't understand the ridiculous 1 star ratings. The acting is well above avg compared to most horror movies, and the plot, while it does have a few holes, is overall pretty solid. I thought it was well paced, creepy and suspenseful and really enjoyed it, I would definitely recommend."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "juliemgiberson",
        "review_rating": "",
        "review_title": "Worse movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dejavuicutooo",
        "review_rating": "7",
        "review_title": "Original, decent acting and plausible.....a good movie. Why the bad reviews?",
        "review_detailed_main": "I kinda want to rate it a 10 to lift the score bc I don't understand why it's so low. It wasn't a movie that will win an Oscar, but it was pretty good. I wanted to see what happened next and it kept my interest the whole movie, so that right there is a 4star in itself, then add on that the acting wasn't bad that's another 3 stars, and the plot was interesting, not overdone in hundreds of other movies, while it has and can happen I real life, another 2 stars.... If you like crazy overdone, predictable horrors, please don't watch it but if you like something new and fresh, ignore the low ratings idk what their issues are. It was a good movie, maybe bc there wasn't the everyday of the mill actors in it, Idk, but it was a good movie, try it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "manaaal",
        "review_rating": "2",
        "review_title": "..",
        "review_detailed_main": "It is really the saddest hour and a half i spent watching this movie. So bad i cant even describe it"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "eventlaunch",
        "review_rating": "1",
        "review_title": "WTF",
        "review_detailed_main": "Possibly the worst horror flick ever made literally everything about this movie is bad from acting to story to editing and a terrible ending"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "monkeygirl-92261",
        "review_rating": "1",
        "review_title": "Awful and no ending!",
        "review_detailed_main": "Probably among the worst movies that I've ever sat and watched. The movie is boring, failed attempts to build suspense with absolutely so resolution at the end. Please don't waste your time, I wish I read the reviews and wish Netflix allowed reviews so I would of known ahead time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "CountJonnie",
        "review_rating": "3",
        "review_title": "It's not even bad. It's.....nothing",
        "review_detailed_main": "The movie lacks.....everything. Except for moments that seem interesting, everything else is just....not there. Decent acting, but no story, no development, no logic and the ending is not bad nor is it open. There's just no ending. The movie stops. The movie is just as weird as all the reviews that rate this crap over 4 stars."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kimbpaul",
        "review_rating": "1",
        "review_title": "Don't Even Start Watching",
        "review_detailed_main": "I should have paid attention to the reviews. Dreck. I agree with another reviewer, though; the house is pretty."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "motaz-14054",
        "review_rating": "1",
        "review_title": "!!",
        "review_detailed_main": "Can i know please what is the point of watching this movie !! No end really !!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jokafoxy",
        "review_rating": "1",
        "review_title": "Absolutely awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "shquintajackson",
        "review_rating": "1",
        "review_title": "Dont Waste Your Time",
        "review_detailed_main": "This whole movie was just horrible. There was many of ways I thought this movie would go and could have gone but it didn't. It literally was just a waste of time. I'm so disappointed in Netflix for putting this movie out."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "franspsp",
        "review_rating": "8",
        "review_title": "Finish the story yourself...and colour the pictures......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gullerful22",
        "review_rating": "",
        "review_title": "Alternate Title: Everybody makes the worst decisions possible for 90 minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sinsemilla420071",
        "review_rating": "6",
        "review_title": "Not as bad as others say...",
        "review_detailed_main": "This wasn't great, but it held my attention well and is not nearly as bad as the low star reviews would have you believe. The ending isn't a neatly wrapped up ending, but if you pay attention to the movie, it's pretty obvious what was going on. I thought the ending was creepier than the normal cookie cutter Hollywood ending.\n\nAnyway, it's not that long. Watch it and decide for yourself. I'm just chuckling at the people who are literally enraged over a movie they thought was bad. Don't let them put you off."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mguidry-37508",
        "review_rating": "1",
        "review_title": "This movie is why Netflix got rid of ratings",
        "review_detailed_main": "Terrible. It doesn't make any sense, and the ending is a total letdown. Depressing waste of time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "leyland-53905",
        "review_rating": "1",
        "review_title": "Don't waste your life!!",
        "review_detailed_main": "I lost 93 minutes of my life to this film, don't make the same mistake I did!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "juliamcintyree",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "This movie had no point. There was no explanation for anything that happened. There was no climax to this movie, it was just really boring and pointless."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kathleenthewriter",
        "review_rating": "4",
        "review_title": "before you write this one off completely....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "james_in_france",
        "review_rating": "1",
        "review_title": "90mins of my life I will never get back.",
        "review_detailed_main": "If I found a genie in a lamp and he granted me 3 wishes, they would all be to erase this films existance from the universe.\n\nAs an avid fan of cinema, I quite enjoy being taken on a journey by film makers. Whether that is being lightly entertained for a couple of hours, being taken to a different world, or perhaps even simply being moved emotionally, I really don't mind.\n\nOnce in a very rare while however that journey culminates in me wondering if my time would have been better spent hammering bent, rusty old nails into my face rather that subjecting myself to 94 minutes of this horrible horrible farce of a movie.\n\nIf I had to put into one word the emotion that I feel upon viewing this film, it would be 'Regret'.\n\nthe creators knowingly made it JUST good enough for JUST long enough to get you invested enough watch what turns out to be the worst 3rd act in cinema history and the laziest ending in living memory.\n\n'Oh I know let's make a film that is so bad it will ruin a person's day...'\n\nI didn't even pay for this movie and I want my money back, I literally want the creators of the movie to come to my house, give me $14 and a written apology."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "nathanmanson",
        "review_rating": "1",
        "review_title": "The worst thing I've ever seen",
        "review_detailed_main": "That was so bad, I was literally more invested in finding out what a weird random light was outside my window. I can't put into the words how bad that film is. I couldn't think of a worst way to spend my time."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "symonf202",
        "review_rating": "5",
        "review_title": "Harsh reviews",
        "review_detailed_main": "Is this film amazing? No. Good maybe? No. The worst thing I have ever seen? Not even close. Its ok. The acting is fine, there are a few jump scares but the storyline is a tad weak."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hobba-02497",
        "review_rating": "3",
        "review_title": "Poor Boy...",
        "review_detailed_main": "The movie plot, is taken from later movie \"The Boy\". Only this one is dumper...like alooot!!!! Has no twists, no sense in \"WTF is going on\", and not giving you a satisfaction in the end. Please, don't do part two."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jjensmo",
        "review_rating": "8",
        "review_title": "Much better than reviews give credit for if you think deeper...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tasaint",
        "review_rating": "",
        "review_title": "Run...away...fast.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "katethekat88",
        "review_rating": "6",
        "review_title": "Had Potential",
        "review_detailed_main": "Being completely honest, I definitely thought the idea was cool and had potential but the way that it was portrayed was not as good as it could have been.\n\nI do love Dylan Minnette however and I will support him in whatever movie or tv show he is in.\n\nThe movie overall was fun though- the ending was a little intense for me but I liked having some action before it was completely over.\n\nOverall, the idea was good and I love the main actor but the movie sort of fell flat."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "faolanredwolf",
        "review_rating": "4",
        "review_title": "Nasty little Netflix thriller...",
        "review_detailed_main": "Nasty little thriller, with some nice scares and a lot of unsettling atmosphere. The acting is quite good and there are quite a few twists and turns through out. It's a bit slow at times and doesn't completely make sense, but it's still a fun ride. I honestly don't understand, why people hate this movie so much."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "adilsonb",
        "review_rating": "2",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Poor Show Netflix! The best part of the movie is the trailer.\n\nSave your time, watch whatever else."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pranayjalvi",
        "review_rating": "3",
        "review_title": "There was just no Logic in this..",
        "review_detailed_main": "The movie started off similarly like any other movie with a little surprise element 'The father's death'. But the plot quickly became boring and illogical. Dylan Minette (famous for 13 Reasons Why) did a decent part in this otherwise flattered and nonsense suspense & psychological thriller..\n\nMy Rating : 1.5/5"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "shopkinsnotthetoy",
        "review_rating": "1",
        "review_title": "Life is too short to watch movies this bad",
        "review_detailed_main": "I started writing a review, with some spoilers, including my theories on where I *thought* this movie was going before it took a hard left into a pile of garbage.\n\nAs I was trying to map out my review and realized how lengthy it would be, it dawned on me that this movie had already wasted 94 minutes of my life by watching it and it's not getting much more. Save yourself the time, brain cells and annoyance. If you still want to be confused but still entertained at the same time, I'd recommend The Room."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "matahari20-1",
        "review_rating": "5",
        "review_title": "Geez Louise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mortonse-80140",
        "review_rating": "2",
        "review_title": "What happened to the ending ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sheldondesousa",
        "review_rating": "1",
        "review_title": "I want my 90mins back.",
        "review_detailed_main": "After wasting 90mins of my life, i devoted 180mins towards finding a better word than \"Crap\". Sadly, my efforts met with a dead end which also runs parallel to this sorry excuse of a movie.\n\nI feel only actors hard up for work would consider this. If I were given the role, I'd beat the director and producer senseless which again seems synonymous with the movie plot.\n\nStarted out with all the makings of a good movie. But apparently 30mins in, the reins were handed over to school kids looking to get their feet wet in the movie business.\n\nCheap thrills and cheaper ending. It's a movie where dumbasses who don't know how to use a light switch or take a hint, waste our precious time with no concerted end in mind.\n\nHighlight of the movie is the Woman's butt. I humbly thank the director for leaving that in, it got you 1 star. Probably the most memorable part of the movie too. I'm sure if more was shown I would have gone up a few stars. Thats the only thing to save sh** like this which makes it's way on tv.\n\nAnother takeaway: There are idiots working at Netflix"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "andreinunez",
        "review_rating": "1",
        "review_title": "1/10 is even a high score for this \"movie\"",
        "review_detailed_main": "There is no plot, a non sense story with bad characters, this is the worst movie I´ve ever seen, just dont watch it."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jaylikesdaaa",
        "review_rating": "8",
        "review_title": "DONT LISTEN TO THE BAD REVIEWS!!",
        "review_detailed_main": "I am a horror fan and thought this movie was great. When you turn on a Netflix movie with your family you expect to get a little creeped out then laugh at the killer being exposed 20 minutes in the movie being the neighbor. This movie was not that! VERY similar to Stranger things. I was hanging in the edge of my seat the entire movie. This movie brings good acting, a aminous plot, and some close to home terror right into your home."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mark-43095",
        "review_rating": "",
        "review_title": "OMG",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "budstac",
        "review_rating": "6",
        "review_title": "Something to settle for...",
        "review_detailed_main": "This move isn't something I would go out of my way to watch, but something to settle for. It is not complex whatsoever. Dylan Minnette captured my heart in the Netflix original series \"13 Reasons Why\". When I saw he was in this movie, I watched it immediately. From the beginning of the movie to the end, I felt confused. Many, many things didn't make sense or didn't add up. Every time it seemed they were going somewhere, they wound up at a dead end with a dead plot. By the end of the movie, I was thinking I had missed something, but I had not. I rated this title 6 out of 10 stars because although the storyline was a bit confusing, the acting was still tolerable; the concept was intriguing, and it was overall a decent movie to settle for."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "WhenAmyMetSalad",
        "review_rating": "3",
        "review_title": "thoroughly disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "schultze-32480",
        "review_rating": "1",
        "review_title": "Wish I had read review first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kaykay-41346",
        "review_rating": "5",
        "review_title": "It was okay",
        "review_detailed_main": "The beginning was great. I enjoyed the suspense and the little jump scares here and there, however the ending I thought wasn't that great. There wasn't much of a climax going on when it came to the stranger and Logan. I was hoping for more of a happy type of ending considering most of the movie was about the death of a family member and a creepy man inside the home."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "chadcue-32519",
        "review_rating": "2",
        "review_title": "Only main actor was decent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "djmpaterson1",
        "review_rating": "2",
        "review_title": "Story?",
        "review_detailed_main": "Bad, real bad. One of these movies where the trailer looks better than the film. Avoid."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "annalshinsky",
        "review_rating": "1",
        "review_title": "Disappointing...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "water_bug2",
        "review_rating": "1",
        "review_title": "I wish I'd read the reviews before I watched it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mailrghessel",
        "review_rating": "4",
        "review_title": "Quite engaging until the end",
        "review_detailed_main": "This was actually a pretty good scary movie up until they lost the last 3 pages of the script and just decided to stop filming."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sendmystuffhere",
        "review_rating": "8",
        "review_title": "Creepy thriller",
        "review_detailed_main": "A good throw back to when horror movies were more about the scares and less about the gore and violence. Open House follows in the footsteps of movies like Halloween and When a Stranger Calls. You never see much of the killer and that works beautifully. It's a dark and terrifying thriller that will keep you glued to your seat.\n\nWatch it at night with the lights off."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "klburns-83936",
        "review_rating": "",
        "review_title": "Great until the end. No explanation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rozlyn-46219",
        "review_rating": "7",
        "review_title": "Way better then 3.3 !!!!!!!!",
        "review_detailed_main": "This movie gets bad ratings but it actually is a great thriller ! It is way better then the rating 3.3 it's scary and engaging. The ending does leave you feeling unsatisfaied BUT overall this is a suspenseful movie I enjoyed !"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "itstheheart",
        "review_rating": "1",
        "review_title": "Waste of talent . Waste of time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mesja-52168",
        "review_rating": "1",
        "review_title": "Possibly worst movie ever",
        "review_detailed_main": "This was really one of THE most horrible movies I've seen. I feel dumber after watching it. Bad plot, flat ending...save your brain cells and skip this one."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "thebigd56",
        "review_rating": "2",
        "review_title": "Tedious and pointless, just like others said!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "eelg23",
        "review_rating": "5",
        "review_title": "Sometimes the Killer doesn't need an explanation as to why...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "SilverScreenCyrus",
        "review_rating": "1",
        "review_title": "Complete Literal Garbage Called a \"Movie\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "fazlahaleem",
        "review_rating": "1",
        "review_title": "What a waste of time!",
        "review_detailed_main": "Do not watch this pointless piece of crap! What a pointless movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "falling-sideways",
        "review_rating": "3",
        "review_title": "a series of unanswered questions",
        "review_detailed_main": "The movie revolves around a tragedy that we are never fully appraised of. The limited information and flashbacks the viewer is shown imply something 1) very unlikely based on the setting or 2) more sinister than anyone acknowledges. The unexplained plot development doesn't stop there, indeed it actually escalates as the story progresses. The acting is fine, however, the actors are not given much material to work with. It seems to be relying on the unknown being frightening. The plot pushes beyond the general scope of the \"suspension of disbelief\" and doesn't offer enough of thrill to pull the viewer into the movie as films such as The Strangers manage to do."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "breauj-29215",
        "review_rating": "1",
        "review_title": "....",
        "review_detailed_main": "I've watched a lot of bad movies. I go out of my way to watch bad movies. This is the worst movie I've ever seen. This might be the only movie that I truly hate. Do not watch this movie."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gdenke3",
        "review_rating": "8",
        "review_title": "Doesn't deserve the hate it gets",
        "review_detailed_main": "This movie was very interesting and suspenseful, very similar to the Strangers. It keeps you on the edge of your seat the entire time. A lot of people said the ending was terrible and didn't make sense, I think that is completely wrong. I watch a lot of horror movies and this is easily one of the most suspenful and gripping horror/thrillers I have seen in a long time. I'm not one to write reviews, but after seeing how horribly people rated this I had to write a positive one. Netflix did a bang up job keeping you on entertained and scared."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "no_vampires_here",
        "review_rating": "",
        "review_title": "Waste of time, waste of plot, waste of everything",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "omer-dagyeli",
        "review_rating": "7",
        "review_title": "A mysterious different scary movie",
        "review_detailed_main": "This was not The best scary movie but it was definetely different. There were not answers for many things in the movie, maybe they were just for the audiences' imaginations. So this movie should be thought as different movie for sure. It can be thought as an innovation from one aspect and a director should be very brave for such an end. I am sure that everybody watched it till the end of the movie since it was making people wonder. It means it should not be so bad, like many audiences rated it as \"1\". So for me, it was a movie with a full of mysterious even in the end and it was different and fine for me."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "basilmartina",
        "review_rating": "1",
        "review_title": "No plot, no story",
        "review_detailed_main": "This movie has no plot. Whatsoever. A lot of nonsense, not adding into a coherent story makes the first part of this movie, the torture porn is the second part. And that's it. It's like... It's like someone was too lazy to even write a full script for that movie, just wrote the beginning, plopped in a bunch of weird characters, added some jumpscares and violence, stirred, shook and voila, we have a real stinker. Do not recommend.\n\nDear Netflix, start to employ decent writers instead of chugging out a senseless crap."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "maytekinaliyeva",
        "review_rating": "1",
        "review_title": "THE WORST MOVIE EVER!!!",
        "review_detailed_main": "I don't even know how to express my anger about this absurdity. This movie should be burned and forgotten forever. I wouldn't act in this movie and humiliate myself for any amount of money. WOW these actors are really brave."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "balogh-orlando93",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Horrible and waste of time! No logic!\n\nNo sense!\n\nnote 3.3 is too high"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "RAMWolff",
        "review_rating": "4",
        "review_title": "Acting was good but that's about it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rog-47379",
        "review_rating": "3",
        "review_title": "Terrible Ending",
        "review_detailed_main": "The acting is really good and there are some good scares in the first half of the movie. Howeve, it completely falls apart the last 20 minutes and has the most unsatisfying ending I've ever seen. It had a lot of promise but amounts to nothing."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "PDeniz",
        "review_rating": "1",
        "review_title": "Maybe this is a new genre. Still, I hated it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "raidercuse",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Do not under any circumstances unless you are being tortured and forced to watch this film watch this film! I would get into the plot, character development and other features if there were any. If I could give it 0 stars I would. I still have to come up with 338 characters, please stop reading at this point and Do Not Waste Your Time With This Crap. The only reason I made it to the end of this totally awful film is that I had to clean up my email account. You know how sometimes when your multitasking and miss something in the film and you have to stop an rewind it? Don't worry, you won't have that issue with this film, so if you need to clean up your email this is the film for you!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "writermist",
        "review_rating": "3",
        "review_title": "Are you kidding me?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jennysimler",
        "review_rating": "10",
        "review_title": "Loved this movie!!!",
        "review_detailed_main": "Great acting, and the location was beautiful! I was on the edge of my seat and guessing throughout the whole movie. The directors did a good job at making you believe one thing, then switching it up on you. I thought this was a very smart film, not quite like other thrillers I've seen."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "swanee_25",
        "review_rating": "",
        "review_title": "Great scary movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ebranske",
        "review_rating": "6",
        "review_title": "What?",
        "review_detailed_main": "A story has to have a beginning , a middle , and an ..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "tcswtwq",
        "review_rating": "1",
        "review_title": "I've never been so disappointed and frustrated with a movie!",
        "review_detailed_main": "Absolutely awful! I highly recommend not wasting your time on this movie. Watch something else. You'll literally like any movie you watch better then Open House. It's to bad because the first half of the movie was good. It led you to think there would be some good plot twists and something really bizarre going on with the people going in and out of the house but in the end the only plot twist is there is no plot."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kewatson-79124",
        "review_rating": "1",
        "review_title": "What just happened to 90 minutes of my life?!",
        "review_detailed_main": "I created an account on IMDB just so I could give this movie a one-star rating. Ridiculous. Nothing of any substance happens in this movie. The ending is terrible. It's so forgettable, but unfortunately I haven't forgotten that I watched it yet. (I guess it takes more than 5 minutes.) Netflix is just green-lighting anything now, I guess."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "haroot_azarian",
        "review_rating": "2",
        "review_title": "Basically what everone else said!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "justinsimonelli",
        "review_rating": "4",
        "review_title": "So much potential",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bd3399",
        "review_rating": "1",
        "review_title": "Total crap fest",
        "review_detailed_main": "This was time wasted that I can never get back. 100% the biggest piece of garbage ever."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "georgiesmum-82678",
        "review_rating": "3",
        "review_title": "Pointless.",
        "review_detailed_main": "Utterly pointless movie. A story, even a bad one, should have a beginning, middle and an ending. This has a beginning, a partial middle but no end and certainly no clue or explanation as to why events unfolded the way that they did. What was the point?"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "emifisk",
        "review_rating": "1",
        "review_title": "Utterly pointless watch. So so bad. Steer clear. Regret not checking reviews before clicking play.",
        "review_detailed_main": "Utterly pointless watch. So so bad. Steer clear. Regret not checking reviews before clicking play."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kt-520-820762",
        "review_rating": "5",
        "review_title": "Not good but not as bad as other reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hadoopbrahmanaidu",
        "review_rating": "10",
        "review_title": "It's okay",
        "review_detailed_main": "Partway through The Open House, our lead character, Logan (played by 13 Reasons Why's Dylan Minnette) turns to his mother and asks contemplatively: \"Mom, have you ever thought of how weird open houses are?\"\n\nMost people probably have not. But The Open House writer and director Matt Angel most certainly has. My family moved around quite a bit when I was as kid. From ages four to 11 we bounced around among five different cities in New Jersey, New York, and Ohio. When you move a lot in a relatively short amount of time, you get used to some of the cultural trappings that come along with relocations."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rspirk-98882",
        "review_rating": "",
        "review_title": "Why are people hating so hard on this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "kelly-rhodes1",
        "review_rating": "7",
        "review_title": "Definitely NOT the worst movie ever",
        "review_detailed_main": "Ok peeps.. if you've read other reviews you may see some unhappy amateur critics.\n\nHowever, if you've been around long enough and seen enough horror movies you'll realise this is a LONG way from the worst horror movie.\n\nUnfortunately we live in an age where every twist and turn is explained, spoon fed to the drooling masses.\n\nThat's not gonna happen here, life isn't always tied up in a nice neat little bow for you to unwrap with a blow by blow narration of every scene.\n\nIf you want a movie that's well crafted, builds uneasy tension, great acting and well directed, stow your cynicism and you don't expect your life to be changed, this will do fine."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "pzhjtvv",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "TerribleKatherine",
        "review_rating": "4",
        "review_title": "I ave no idea.. about anything.. ever. Wet sandwich!",
        "review_detailed_main": "Well, this was certainly.. something. I really don't know what to think of this. I didn't particularly hate this, but.. the mind-numbing lack of plot progress, lazy character development and characters that are incapable of protecting themselves or each other in ANY way really took it's toll on me. When I realized there's only 5 mins left, I got restless 'cos I thought nothing has really happened yet and the movie is ending. And then it ended and I was left with the feeling the movie-makers really had no idea what the movie was about. Yeah, throw in some personal tragedy, some weird neighbors, a struggling mother-son-relationship, FINE. Don't invest in any thought completely and you'll get a.. wet sandwich. Yeah, that's what describes this movie the best; WET SANDWICH. Now, I shall watch something better."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sandlot1992",
        "review_rating": "1",
        "review_title": "the most Dreadful Movie I've ever seen!",
        "review_detailed_main": "\"the Open House\" is one of the worst movies i've ever seen on netflix and pointless as well, the story is bland and so are the characters who are just stereotypical and dreadful."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "theospyrou",
        "review_rating": "1",
        "review_title": "Do not watch.",
        "review_detailed_main": "First time ever that I felt the need to create imbd account to warn people to not watch this. Good day everyone!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "brightonxxx",
        "review_rating": "5",
        "review_title": "Well, I can't give 1 star just because of the ending but...",
        "review_detailed_main": "As with pretty much every other reviewer said, the film has no ending. I was actually enjoying the first 70 mins of the film, I was like yeah, this is cool, I wonder what the hell is going on with this family, but then events start to happen in the film and as soon as the moment we are supposed to figure it all out, then suddenly..."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "miriam-pollock-writes",
        "review_rating": "1",
        "review_title": "Lazy Writing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "bkflorey",
        "review_rating": "3",
        "review_title": "Worst ending EVER",
        "review_detailed_main": "I've never rated a movie in my life, but I had to figure it out how. The movie itself was good and suspenseful. The ending however was AWFUL! It leaves you completely irritated and confused. I've never finished a movie not knowing what the movie was about. Do not watch, it's very irritating."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "rebillot",
        "review_rating": "5",
        "review_title": "Disappointing Ending",
        "review_detailed_main": "In general, we liked the movie. Well acted and it had a fairly good \"suspense\" factor. That said, disappointed by the ending."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "sarahsafaie",
        "review_rating": "10",
        "review_title": "total thriller",
        "review_detailed_main": "Had me on the edge of my seat the entire time. Great acting too. Can't wait to see what else these directors put out.."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "gerradwilson",
        "review_rating": "",
        "review_title": "Highly recommend",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Mrssmiff",
        "review_rating": "6",
        "review_title": "Not As Bad As These Low Ratings Suggest",
        "review_detailed_main": "Just my opinion, but I have no idea why this film has received such low ratings and I can only surmise that most viewers did not get what they were expecting.\n\nNo other reviewer seems to dispute the quality of the acting, writing, etc but most seem disappointed, however, with the whole direction the film went in and the (non-existent) ending.\n\nI however, without giving anything away, was completely shocked with the ending and its simplicity, as it was not what I expected, and rather disturbed by it.\n\nI did flag slightly in the middle, like everyone else, wondering where it was all going, but glad I stuck with it until the end."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "DrMedve",
        "review_rating": "1",
        "review_title": "Waste of everything",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "trevrex",
        "review_rating": "2",
        "review_title": "One of the single worst *films* I've ever seen...",
        "review_detailed_main": "This is horrific. Absolutely nothing of significance happens, is explained, or has any meaning whatsoever.\n\nAnd it's slower than hell. Believe me, I love slow-paced films...when they're properly put together, or are interesting, or have interesting visuals.\n\nOr, I dunno, have something even remotely... there... on-screen.\n\nI apologize for to the films I've criticized before where I've said nothing happened.\n\nThey don't even compare to to this nothingness of a film."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "guido629",
        "review_rating": "5",
        "review_title": "Harsh Reviews...Not as Bad as reviewed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ilgindoguzengin-80445",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Quite possibly the worst film i have ever seen in my life. If you value your time and wellbeing, please shy away from watching this disaster. Extremely, utterly, outstandingly, unbearably disgustingly terrible."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "luke-mb",
        "review_rating": "2",
        "review_title": "Dont waste your time",
        "review_detailed_main": "I kept waiting and waiting for this film to go somewhere, before this happened the credits appeared! Pointless ending"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "stamatis-97265",
        "review_rating": "3",
        "review_title": "IT IS TRASH!!!",
        "review_detailed_main": "It could be a nice movie but there is no ending!!!totally waste of time....I have a lot questions about some characters and I wouldn't recommend it at all😭💩💩💩🍅🍅🍅"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mahtabzohooriann",
        "review_rating": "4",
        "review_title": "Wth",
        "review_detailed_main": "Wth! What about the ending??? Enjoyed it But i was really waiting for a proper ending !!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "dancurtis-info",
        "review_rating": "1",
        "review_title": "Who writes this horrible?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "hamud-57234",
        "review_rating": "9",
        "review_title": "A real thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "trevlo-24315",
        "review_rating": "7",
        "review_title": "Give it a chance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "ghadeerherbawi",
        "review_rating": "1",
        "review_title": "Wouldn't recommend it",
        "review_detailed_main": "It seemed interesting to watch, but wallah I don't recommend it to anyone .. such a waste of time and probably money too to make this nonsense movie!!! Frustrated to see an ending like this !!!!! (If you call it an end) !!!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jlrjlr-40103",
        "review_rating": "1",
        "review_title": "So confused",
        "review_detailed_main": "Do not waste your time. Awful movie. It's like they put chunks of other movies together and called it new. The problem is they aren't the GOOD parts of other movies. They didn't finish a thought, so you never understood what one thing had to do with anything else, because it literally had nothing to do with the story. Completely random things that they try to make you think are important. They also added really dramatic and suspenseful music when nothing happened. Plain old curiosity is the only reason I watched that horrendous movie to the end. If I see anything else by that Director or writer, I think I will avoid it like the plague."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "courtneyt-22034",
        "review_rating": "1",
        "review_title": "Worst movie ever!",
        "review_detailed_main": "I couldnt agree with all the reviews below more! Worst movie ever! I made an account just to rate this because of how horrible this movie was!"
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "Rasalgheti_2000",
        "review_rating": "2",
        "review_title": "WTF?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "curtissjulie",
        "review_rating": "1",
        "review_title": "No plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "mfaithgilley",
        "review_rating": "2",
        "review_title": "Horrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "jolgeir",
        "review_rating": "3",
        "review_title": "Missing the goal",
        "review_detailed_main": "This movie is more like a TV production than a real movie. Many things go wrong here. Acting is not up to par. The director also fails to create other than low levels of suspense at the best. Several scenes look unrealistic and as a whole the movie is not convincing. Actors show minimal facial expression. The storyline has been done to death many years ago. The best part of this movie is the song by Shannon and the clams."
    },
    {
        "movie_id": "tt7608028",
        "movie_name": "The Open House",
        "movie_rating": "3.3",
        "review_username": "brittanydiane",
        "review_rating": "3",
        "review_title": "Could've been better",
        "review_detailed_main": "So if you watched the trailer that's basically the movie. You'd think that watching it would bring more detail to the story, but no. After watching it all I'm still left with questions and the story doesn't make much sense. I don't really fully understand the next door neighbor and what that all entails because it seems like they were trying to explain her character, but gave up. This movie could've been so much better if they stuck to a story line and put more sense into why these things are happening to the main characters."
    }
]