[
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "I blame the writers.",
        "review_detailed_main": "Currently, \"Bucky Larson: Born to Be a Star\" is number 59 on IMDB's infamous Bottom 100 List---the 100 lowest ranked major releases of all time. While I wouldn't consider this one of the worst in my opinion, I can see exactly why the film was hated by so many. The writing simply is awful....with not even a single laugh in the movie even though it's supposed to be a comedy. Instead of humor, the film resorts to crudeness. Crude CAN be funny....such as the cute film \"Stepbrothers\". But crude with no humor whatsoever is simply annoying and boorish....and this film has that in spades.\n\nBucky (Nick Swardson) is a guy from Iowa who is intensely stupid as well as possessing teeth like Bugs Bunny.....a joke that wears thin very quickly. After discovering that his parents used to be porn stars, instead of being repulsed or embarrassed, he thinks it's cool. So, his folks encourage him to trek to California to be a part of the porn industry. Hillarity SHOULD ensue...but it doesn't.\n\nUnfunny, very crude and ample evidence that Adam Sandler (yes, THAT Adam Sandler) should not write films. Overall, an unfunny and disgusting film that held no interest at all to me as I tried to watch. I could mention all the various offensive things featured in the film...but I am pretty sure IMDB would not allow me to mention them."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "sethmlanders",
        "review_rating": "2",
        "review_title": "Bucky Larson: Born to Suck!",
        "review_detailed_main": "I'm a huge fan of Adam Sandler's films and for the most part, I like Nick Swardson. However, this was very bad. I don't have anything against movies with sexual content or gross out stuff, it just has to be funny. After watching this, I know that Nick Swardson was NOT born to be a lead.\n\nHe gives us a semi creepy performance and all the jokes fall apart fast. For example, he says \"Miles is getting an eight ball, I don't wanna play pool\" or something like that. Just stuff that makes you cringe. The whole movie lacks an actual story, it's just a bunch of bad penis jokes and \"point and laugh at the freak\" jokes as well. A lot of great actors wasted (Christina Ricci, Mike O'Connell, Don Johnson) and the humor doesn't work here. It tries too hard to mix sentimental and mean-spirited stuff, which both fail. When Bucky gets a roommate, the dude (Kevin Nealon) is such a jerk that you wish he hung himself and left the poor guy alone.\n\nThe entire film is predictable and Stephen Dorff looks like Bret Michaels, which isn't a good thing. I smiled several times but didn't laugh at all. I don't understand why they couldn't put more effort into it. Making Bucky into a wimp who can't even perform correctly in these adult movies just shows you the thought that went into making it. Skip this one, you'll be glad you did!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "FatPhil",
        "review_rating": "4",
        "review_title": "So bad it's almost good in parts",
        "review_detailed_main": "Everyone who gave this 1/10 is factually correct about what they witnessed, I do not intend to persuade them they made a mistake. It truly is one of the dumbest ideas ever turned into a movie, and perhaps the world would have been a better place had this not been made.\n\nHowever, I think Ricci playing this as if it's a straight role, not a comedy one augments the humour - there's a delightful mismatch between the idioticly cartoonish nature of Bucky, and the deadpan responses from her Kathy, no matter what grossout teenage-male-brain-originated concept is thrown at her. Had she played it for laughs, it would have been vastly less funny.\n\nThe very few jokes it contained were repeated far too many times, alas, but they were do dumb I don't believe they were actually intended to be funny except to an extremely narrow demographic.\n\nNot so bad that it's good, but I guess so bad that it's almost good - in parts."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "keiichi73",
        "review_rating": "",
        "review_title": "A movie with absolutely no life whatsoever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "stratusk1",
        "review_rating": "1",
        "review_title": "How did this piece of mammoth excrement ever get made?",
        "review_detailed_main": "See that $20 bill in your wallet? Wipe your ass with it instead of paying to see this movie. You will receive more amusement watching a feces-stained Jackson swirl around the bowl than watching this gross-out piece of water buffalo diarrhea.\n\nNot even an immature 13 year old will find this film amusing. It uses the same three jokes the entire movie: Bucky has buck teeth, he shoots semen at the mere sight of a naked girl, and he has a tiny penis covered with a bush of hair. Boom, that's it. That's the movie.\n\nGame over man, game over.\n\nIf I could give this film zero stars, I would. Not even Stephen Dorff can save this penguin excrement."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "twilliams76",
        "review_rating": "1",
        "review_title": "This should have NEVER been born.",
        "review_detailed_main": "There is very little to say about Bucky Larson: Born to Be a Star other than \"I hated it ... I hated ALL of it!\" The film is not funny and it is repellent.\n\nI cannot criticize it for being about porn because Boogie Nights was exclusively about the world of porn and I think it was one of the BEST film of the 1990's. Boogie Nights treated its characters as flawed human beings searching for acceptance and a feeling of belonging -- Bucky Larson's characters are all supposed to be laughed at and there are just too many times throughout the movie which had me wanting to rush to the bathroom to vomit as 89% of the film is stomach-churning.\n\nThis should pretty-much END the career of anybody involved and I am actually surprised that Adam Sandler's name is attached as both a writer and a producer of this trash (Sandler also gave us Jack and Jill and Just Go With It this year -- the latter film is only saved b/c of the over-the-top performance of the unlikely physical comedienne Nicole Kidman -- so I question whether or not his days are numbered?).\n\nAn unfunny-to-me Nick Swardson (Just Go With It, 30 Minutes or Less, Blades of Glory) -- who's career is mostly stand-up comedy -- stars as the grotesquely buck-toothed Bucky Larson (who must've been born with buck-teeth?) who believes he is destined for a glorious career in porn after discovering his parents were au natural (meaning: unshaven, un-waxed, un-spray-tanned, un-fit etc) porn stars of the 1970's. Bucky leaves behind an insulting-to-mid-westerners existence in Iowa (only found in the movies -- he didn't attend high school because his town didn't have one ... whatever), the RIDICULOUSLY-accented Bucky (that is NOT an Iowa accent ... but let's throw-out another stupid laugh at the expense of the heartland) heads to LA where his dreams can come true.\n\nBucky luckily meets a nice, big-hearted waitress (Christina Ricci - Sleepy Hollow, Penelope, Monster ... and after this is it any wonder she seeked out employment on television as Pan-Am is Oscar-caliber compared to this!) at a random diner who befriends him, finds him a place to live (with crazy-jerk roommate Kevin Nealon - \"SNL\", \"Weeds\", Just Go With It) and sets him in the right direction of finding work. Don Johnson (Tin Cup, Machete ... who's short-lived career rebirth must be over) is porn director Miles Deep who sees something \"special\" in Bucky and decides to exploit the freak (it's explained in the film ... but I don't recommend watching this to figure out the \"freak-tag\" that has NOTHING to do with his teeth!) and Stephen Dorff (who's stellar \"comeback\" with the excellent film Somewhere must have been a fluke!!) plays a jealous porn-star rival.\n\nAs vulgar and repulsive as this film is, there is surprisingly little flesh on display. It would be difficult to pick-out the worst part of this film as that would pretty-much be the whole thing. Just as impossible would be finding \"the best\" part. This film isn't bad because it is offensive -- we've had Bridesmaids and two Hangover films -- it is just terrible bad. What works with those 3 films is that they are \"equal-opportunity offenders\" ... this one -- NOT so much. It is rank and rancid and beyond mere words for criticism. I NEVER want to see something like this again."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Watching this movie literally made my jaw drop to the floor....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "J_M_Kiff",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "Awful. Dreadful. Total waste of time and film. Do not see this movie. I work in a movie theater so I get to (have to) watch EVERY movie that comes out, and this is without a doubt the absolute worst movie I have seen in a long long long time. I could not find even one redeeming quality in this movie. This film should be the death-knell of not only Nick Swardson's entire career, but Adam Sandler's \"Happy Madison\" production company should be banned from making any more movies until Sandler publicly apologizes for this horrible horrible waste of film. The dialogue sounds like it was written by three horny middle-school boys, the acting was strained and half-hearted, the plot was spoon-fed predictable. Some movies are \"so bad they're good.\" This isn't one of those movies. This movie is just bad. Worse. Worst."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "emmanuelking19",
        "review_rating": "1",
        "review_title": "THIS Movie made me cry",
        "review_detailed_main": "This movie was digusting and unfunny for most of the part. This movie is about a red neck,bucked tooth,goofy kid name Bucky who dreamed of being a pornstar in California after realizing his parents were famous pornstar during the 1970's.He soon became famous for his really small microscopic penis.\n\nThe worst part was that this movie had a lack of storyline.It had no climax.It wasn't exciting. It was goofy and it made my grandma cry also.She had only 2 hours left to live and she watch this movie leaving her only 25 minutes left of enjoying her life.\n\nlease save your money for a better movie than this."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "yarden835",
        "review_rating": "1",
        "review_title": "One of the worst films I've ever seen.",
        "review_detailed_main": "When I first went to see this movie I had rather low expectations, I thought this would be something fun to pass the time with, nothing fancy.\n\nI have seen some bad movies in my life but I can safely say that this is one of the worst movies (if not the single worst one) I've ever seen. The jokes were really stale, and they somehow managed to move things really fast but in a long and boring way.\n\nThis was one and a half hour of pure torture and I do not recommend it, not one bit. I rarely make a review for a movie and even more rarely do I give only one star, but this film deserved it. Just don't waste your time on it."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "MLDinTN",
        "review_rating": "5",
        "review_title": "goofy people are funny...",
        "review_detailed_main": "that is what I got out of this film. Bucky Larson is about the goofiest character one could come up with. I also think some of these reviews are too negative. Sure, it wasn't great, but it also wasn't the worst film of the year. There's just something funny about watching messed up people in movies.\n\nBucky Larson has 2 bucked teeth, making him look like a rabbit. He also has a 70s hairstyle and bad accent. He gets the idea to be a porn star after finding out his parents made porno movies. So, he movies to LA, meets a cute waitress, and makes his dreams come true. The faces he makes while making his dreams come true are funny. It's so silly, you have to laugh.\n\nFINAL VERDICT: A decent adult, crude comedy."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "karolinakid",
        "review_rating": "10",
        "review_title": "Amazing!",
        "review_detailed_main": "This movie is amazing! There is nothing else to say."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Stu1027",
        "review_rating": "7",
        "review_title": "Not As Bad As People Are Saying",
        "review_detailed_main": "I really can't understand why there is so much animosity towards this movie and in particular, towards Adam Sandler. This film isn't art. It isn't subtle. It wraps it's humour around a brick and smashes you in the head with it repeatedly. But that's what I expected. I watched this film because I wanted a laugh. And I got that. There are some genuine laugh out loud moments in this movie IF it's your sense of humour. If it isn't, then why are you watching it? Sandler isn't exactly world renowned for his subtlety or his sensitive handling of subject matter. He has a team of friends around him who obviously get together over a few drinks and spin out some ideas that make them laugh. I like that about him. And I always get the impression that everybody making one of his movies has a real laugh doing it. And that's what I'm after when I'm watching one. Honestly, some people on here need to have a good look at themselves and wonder exactly why it is they are watching movies they know they aren't going to like. I for one hope he keeps churning them out because when I have a bit of time to kill, I can think of worse ways to do that than watching one of Adam Sandler's movies."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Ynotmod",
        "review_rating": "1",
        "review_title": "tisk tisk Mr. Sandler",
        "review_detailed_main": "Simply put not a good movie. Nick really put me back on this film, with bad writing and really bad acting this flick could not hold my attention. I believe this was a twenty minute short film that was drawn out. In some scenes it seemed as if they added pointless situations to pass time. Bucky's roommate wasn't funny and was a huge buzzkill. This movie had a lot of promotion which put my hopes higher than the result, a lot higher. If you cant tell already i didn't enjoy myself. Adam Sandler has made an excellent array of comedies in his career but lately it appears he has lost his touch. Maybe we'll truly know when his new film Jack & Jill premiers. Till then."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "ManBehindTheMask63",
        "review_rating": "",
        "review_title": "One of the worst comedies ever released!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "smirnofred",
        "review_rating": "5",
        "review_title": "Not to be taken as seriously, as others have done.",
        "review_detailed_main": "Reading all the bad reviews didn't really sway me from watching Bucky Larson... and in all honesty I'm glad I did watch it.\n\nIt may not have been the funniest film I've seen, but its certainly not the worst comedy I've seen either. To the people who thought it was 'so bad to rate a zero' (but still found the time to come and leave a review about it!), I'd say they must have lost their sense of humor momentarily... or maybe they just have an inner fear of laughing at something that's meant to be silly; and if so they really shouldn't be watching comedies in that case.\n\n....anyway; In my opinion Bucky Larson does sit low on the Happy Madison scale, around the same mark as 'I now pronounce you Chuck and Larry', 'Paul Blart Mall Cop' and 'Dickie Roberts'... so expect some good laughs but nothing more.\n\nSo I give Bucky Larson a solid 5/10 (which is good these days on the IMDb!)."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "bahamutwing",
        "review_rating": "5",
        "review_title": "Bucky Larson was a bad movie that was funny",
        "review_detailed_main": "This movie follows a simple formula with the premise of a love him or hate him actor cast as an unlikable hero. Perhaps you've noticed this formula in Borat, The Waterboy, or Joe Dirt. At it's heart the movie does a decent job portraying unbelievable characters in unbelievable situations. So much so that the movie has an absurd aura that ends up begging the audience to not take it seriously. With that aside I myself focused on the jokes and little things I did enjoy. I laughed several times (especially at Kevin Nealon) and found a few other things to be entertained by. At first glance the movie is garbage, however like the aforementioned titles, this movie is funny beyond that and will probably age well. Remember what people were saying when Joe Dirt first came out?"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Painfully unfunny an uncomfortable to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "cconnors19",
        "review_rating": "1",
        "review_title": "Worst Movie Ever Created",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "rcwatt",
        "review_rating": "1",
        "review_title": "Don't even watch this movie to see how bad it is.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Netjer-y-khet",
        "review_rating": "1",
        "review_title": "Move along! Nothing funny to be seen here! Move along!",
        "review_detailed_main": "Someone wrote, \"This is not one to miss.\"\n\nOh, yes it is. The bestial opening scene says it all. Give this drivel a wide berth. It's not even worth stealing from a warez site, let alone spending a penny on.\n\nSomeone else wrote, \"if you don't know how to be goofy and fun then stay away.\" This movie is neither goofy nor funny. There is goofy and funny, and there's stupid and funny, but this load of bunkum is just stupid, period. Humour is scarcer than rocking-horse droppings. Watching the south end of a north-bound cow in motion is funnier.\n\nWhoever chose to label this godforsaken trash as a comedy needs far more than a sense of humour transplant. I mean, really, what kind of self-respecting person would consider putting their name to this total wreck?\n\nDon't answer that. Just know that P.T. Barnum was right; \"There's a sucker born every minute.\" One or more suckers sank ten million bucks into this dogs' breakfast.\n\nOn the plus side, watching the movie is better than getting a slap in the face with a wet fish.\n\n1/10 - Double fail. Not funny. Not goofy. Just downright pathetic."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Crazy_Gibberish",
        "review_rating": "1",
        "review_title": "The Wayward Fart.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "jose-cruz53",
        "review_rating": "8",
        "review_title": "They don't get it, recommended only for specialists",
        "review_detailed_main": "This is extremely heavy stuff, made for specialists in comedy. Most people will not get Tarkovsky's The Mirror and in the same way most people will not get Bucky Larson. There are few that get The Mirror and a few that get Bucky Larson and these two groups of people do not intersect easily. I rated The Mirror, 10/10, and Bucky Larson, I rate it 9/10, the same ratings I gave for Citizen Kane, The Godfather, Rear Window, Fanny and Alexander and Vertigo.\n\nI personally think that Bucky Larson is vastly superior to most comedies. Take another random comedy, House Bunny, that was a plain bad movie but this is much more than that, if you are able to get it, of course. One needs to be able to fully master the art of watching crappy comedies before trying this kind of stuff which was made for the specialists. I have already watched hundreds of bad comedies and about 20 Adam Sandler movies and this operates on another league of greatness.\n\nI would say that I got a lot of fun from watching this impressive work of art that defies convention and goes where no other movie has gone before. It was a \"bad movie\" done entirely on purpose by the director and writers. Just like the porn movies Bucky made in the movie, this is innovation and film critics, people who were brainwashed in film school to like 1940's stuff, cannot simply understand the genius of this film, as did the people on the porn business which were shown Bucky film's.\n\nMy ratings would be:\n\n9/10 - Specialists 0/10 - Most people\n\nI wouldn't recommend this movie for regular people. They will not understand it."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "My_Opinion-245-920801",
        "review_rating": "7",
        "review_title": "Bucky Larson: Born to Be a Star was funny and stupid all in one.",
        "review_detailed_main": "I thought Bucky Larson: Born to Be a Star was funny and stupid all in one. To clarify when I say stupid, I mean stupid funny. It is a rare feat when this combination in a comedy is pulled of but it worked well here. Yes, some of the humor was off or one could even say stupid without the funny, however for the most part this was a better then average comedy.This movie made you laugh because of the above mentioned absurdity of the subject matter. The acting was solid for a comedy and I really thought the jokes the writers inserted were spot on. Kudos to the director for keeping this a light subject it worked well in my opinion."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "StevePulaski",
        "review_rating": "1",
        "review_title": "Born to be a thought",
        "review_detailed_main": "I admire Swardson's defense for this film because I imagine it was an unbelievable challenge to market. Here we have a character, unseen anywhere else, played by a second rate actor who hasn't quite made a household name yet. To market an unknown character with antics like the ones present in this movie isn't as much hard as it is devotion. To go through with a project of this magnitude means you must have a lot of faith in the material.\n\nIn Bucky Larson: Born to Be a Star, there is no faith, hope, wit, soul, or even a sign that this was taken to a remote extent of seriousness. All the actors seem to be laughing at their own joke shamelessly - nearly all of them equally unfunny and sad. Adam Sandler hit a landmark year in 2011. Not only did he work on four movies this whole year, he starred in two of them. Out of the four released, Just Go With It, Zookeeper, Bucky Larson, and Jack and Jill, three of them you can simply look at the film's poster and decide if you want to pay to see it. They're films that almost don't even care that they're bad.\n\nI've seen four films where Nick Swardson plays one of the lead actors or a supporting actor. Three of them easily dismissible, and one that wouldn't be considered mediocre if he was carefully extracted from the film entirely. He simply is not funny. I think it's honestly the material that makes him unfunny. I've seen scattered clips of his standup and he is slightly funny. Maybe he works better when he writes his own lines. Yet, that can't be. This was co-written by Swardson himself, who I assume wrote most, if not, all of the dialog for his character. Maybe he works best with himself and himself only locked in a sound-proof room where he can be alone with his thoughts.\n\nAdam Sandler and his Happy Madison Productions company have now just given me one of the least ambitious comedies I have ever seen. This movie doesn't even feel like it's trying to be funny. It seems to be a series of cheap shots taken at a character that was made for that one purpose. Why not make a character who has some likability? Nope. Go straight to the drawing board and come up with a desperately unfunny character with no shining qualities, give him a desperately unforgiving plot to work with where he can get himself into lame, uninspired situations, and to top him all off, make him the most gullible, pathetic title character in the last few decades of film.\n\nThe fact I'm using the phrase \"least ambitious\" for a comedy film reminds me of a group of films in the last years that have also stopped trying. Parody films. They have been drab, tiresome works of dreck, glazed with immaturity and held together by such a simple, lackluster plot it almost doesn't matter. It becomes a competition for how many pop culture references can we throw into one film.\n\nThe same thing sort of occurs in Bucky Larson. It's a competition to see how many unconvincing gags we can put this pathetically embarrassing protagonist in. The story centers around a misfit with an annoying overbite named Bucky Larson (Swardson). Upon discovering his parents are ex-porn star legends, he travels to Hollywood, hoping that since he is the son (hopefully) of two icons he can make a living as one as well.\n\nLet me say there is nothing funny about a man-child who pulls down his pants in front of a camera, grunting, moaning, and screaming before ejaculating. Absolutely, positively nothing funny about that scenario. Yet the film does it three, if not four times within its ninety minute runtime. If it's not funny the first time, it definitely won't be the second, the third, or even the forth time around.\n\nBucky Larson: Born to Be a Star didn't upset me as much as some would think. It actually was rather typical of Happy Madison. We've seen this goofy, oddball style before. But that is no excuse for a terrible movie. The jokes are terribly flat, the lead character we are expected to sympathize with is wretched in his presentation, the setups are typical, the writing is labored, and we are offered nothing new in the terms of layout or formula. It's a movie experience of deplorable, unforgivable quality.\n\nStarring: Nick Swardson, Christina Ricci, Don Johnson, and Stephen Dorff. Directed by: Tom Brady."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Pycs",
        "review_rating": "",
        "review_title": "A Stunning Cinematic Achievement",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Buck This Porn Star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "bivens_joe",
        "review_rating": "1",
        "review_title": "Vey iz meer.",
        "review_detailed_main": "Lookit, I like Nicky Swardson as much as anyone, but, this movie f**king blew. That that I have to type out 10 lines in order to submit this review is understandable, but at the same time, it pisses me off because I intended on forgetting about this bad film as soon as I finished my review of it.\n\nWhat can I tell you? While I have to animus toward Adam Sandler, I feel that if he doesn't apologize to me personally for creating this horror show, I may have to snub him, should we ever meet. My email is available through IMDb. Let's go. Make this right.\n\nOK, so I guess that wasn't enough lines, still. Grrr. Is this enough?"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "p-stepien",
        "review_rating": "1",
        "review_title": "Believe the hype",
        "review_detailed_main": "Intrigued by the dastardly rep, \"Bucky Larson\" ventured into my repertoire in order to privately observe how low the director Tom Brady managed to stoop. And I wasn't disappointed. This simplistic comedy centres around the buck teeth-challenged Bucky Larson (Nick Swardson) and his dream to become a famous porn star, irregardless of his minuscule manhood. Inspired by his parents, who were once famous genre actors of the 70s, Bucky decides to challenge his destiny moving from small town Iowa to the Hollywood boulevards. Despite his physical deficiencies Bucky soon manages to enter into the business, mainly thanks to a chance meeting with rundown porn director Miles Deep (Don Johnson) and the backing of waitress Kathy McGee (Christina Ricci). Insert random below the belt jokes and off we go...\n\nThe gags arrive in bundles, yet surprisingly all of them are poorly construed and remarkably flat. Honestly, not a single joke even manages to register a positive chuckle or giggle, making it a whole other level of lame comedy, surpassing the feats of the Wayan brothers, who despite all their crass lewdness register a few successful hits in each movie. Chaotic timing does not help the overall poor level of constructed gags, while actor Nicky Swardson has famously put off any future interest in him as a lead, lacking charisma and delivering a dissuasive anti-performance offering Bucky Larson no sympathetic appeal whatsoever. Somewhere in this mix decent actors show up and offer half-hearted performances, that fail to liven up proceedings. Don Johnson possibly needed the money, but the presence of Christina Ricci and Stephen Dorff in this bona fide turd is a true mystery.\n\nLumbering along with tirades of trite jokes, this monstrosity of a movie does not even invoke laughter as to how bad it is, instead imbuing an overbearing notion of boredom. Required watching for those who want to know how not to make a comedy."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "Even worse than \"Freddy Got Fingered.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "villard",
        "review_rating": "1",
        "review_title": "Nothing Funny About This Piece of Idiocy",
        "review_detailed_main": "Scientists say that nature abhors a vacuum. But a comedic vacuum has managed to survive inside the mind of Adam Sandler and his co-creators.\n\nThis film doesn't stop at the bottom of the barrel for its sheer stupidity, but lands about three floors below the barrel. It is miscatagorized as a comedy because there's absolutely nothing funny about it.\n\nThe oddball lead character – who looks like the love child between Prince Valliant and a beaver -- is as annoying as nails on a chalkboard. The CIA should use outtakes of him for torturing confessions out of terrorists.\n\nThe film's ongoing orgasm/ejaculation shtick is utterly tasteless and just makes you queasy. This is the most pathetic waste of celluloid I've seen in a very long time.\n\nThis box office flop must have come straight out of one a Sandler's pubescent wet dreams."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "pmakauloski2312",
        "review_rating": "5",
        "review_title": "OK it was bad but not a total waste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "shortc-85671",
        "review_rating": "1",
        "review_title": "I don't think I can finish this movie it's that bad.",
        "review_detailed_main": "This is possible the worst movie I have ever seen.\n\nThat's it. That's my review."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "molokoplus-27792",
        "review_rating": "10",
        "review_title": "Just Lower Your Expectations and Enjoy",
        "review_detailed_main": "I just don't understand the hate towards Bucky Larson. The buzz kills giving it a single star must either have no sense of humor or never gave it a chance. No doubt you will see a lot of reviews by people who will look down at this movie and think they are too good for Bucky Larson.\n\nIs it an intellectual masterpiece? Of course not. But if you enjoy dumb comedies such as Scary Movie, Grandma's Boy or the Interview then you can't go wrong with Bucky Larson.\n\nAfter accidentally witnessing a vintage adult film staring his country parents and learning they were huge adult stars in the 70's, Bucky hears his calling. He is going to Los Angeles to follow in their footsteps and become and adult star himself because its his destiny. The main character is great but its the friends and foes alike that he meets along his heros journey are what bring the movie to the next level.\n\nNick Swardson is absolutely hilarious as the lovable beaver toothed underdog Bucky. Don Johnson is great as a drug addicted adult film director and Stephen Dorff is the perfect foil as the cocky (haha, get it?) well endowed current megastar industry star looking to protect his spot at the top. And Kevin Neelan is delightfully weird as Bucky's Psycotic roommate. Christina Ricci is fine I guess as the object of Bucky's affection.\n\nI was randomly watching Bucky over a year ago, was still in the movies beginning and my girlfriend (who isn't really a huge comedy fan) was just kind of watching for a minute as she was grabbing something in the living room and started laughing so hard that she ended up sitting down and watching the entire movie with me. And she surprisingly loved it.\n\nIf you're expecting something Oscar worthy then you're going to be disappointed. If you aren't a fan of dumb comedies, d*ck and fart jokes then don't bother. But if you want to just sit back and mindlessly laugh at a dumb comedy this is a great pick. It is written and acted better than it has any right to be. But I laughed throughout the entire movie from beginning to end. Sometimes until my sides hurt. And isn't that all that really matters?"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "damianphelps",
        "review_rating": "6",
        "review_title": "I Keep Apologising to Myself for Liking it!",
        "review_detailed_main": "I may have to re-watch this in the future to reassess but I watched it a little while ago and found myself cracking up. Granted there is plenty of the movie that is not that funny but there were a couple of scenes that were so over the top I couldn't help but lose it.\n\nMaybe I was severely medicated and don't remember!!!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "FeastMode",
        "review_rating": "1",
        "review_title": "my notes",
        "review_detailed_main": "Abysmal. i am embarrassed to have had this as a 3.5 before, no idea what i was thinking. i was reluctant to re-watch it, but thought ppl were too harsh on it. i... don't.... understand. this is cringe-worthingly bad. frequently. so much of the comedy was forced and shockingly random like the bad family guy flashbacks. bucky was annoying. the love story was laughably out of place. this movie fails on every level. i think i laughed 3 times (2 viewings)"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "la_coka_nostra",
        "review_rating": "",
        "review_title": "Worst junk I have ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "KadeemG61",
        "review_rating": "1",
        "review_title": "I dare you not to watch this bad excuse of a comedy movie",
        "review_detailed_main": "So, Bucky Larson wants to be a porn star, eh! What makes you think you are a porn star? Enjoying the limelight of horny girls everywhere or just a pitiful Happy Madison production? Tom Brady (not the football star, just the man who made bad Rob Schneider movies) I don't know about this guy, but for some reason a terrible movie is a terrible movie. It made me think of a rerun of Zach and Miri Make A Porno on Cinemax After Dark or Hugh Hefner's runaway bride disaster. For those of you Adam Sandler fans, make sure you don't buy any movie with the words \"Happy Madison\" on it. The script, cast, even a Pauly Shore comeback can't save him from being a failure of box office bombs and the list goes on and on. Try looking at a list of great pornstars like Sasha Grey and Jenna Jamison. That'll get your head pumping. \"Bucky Larson\" is so bad, even \"Grandma's Boy\" made Grandma a nice big piece of sugar cookies.\n\nBottom Line: This is one of the worst obese films of 2011 and as I could recall to Bucky Larson, I should re-name my title \"Bucky Larson: Born to Suck Every Adam Sandler movie and let my critics throw Subway sandwiches at me.\" Nick Swordswan, you deserved a Razzie for that and Worst Picture."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "nickwilliamharding",
        "review_rating": "1",
        "review_title": "Save yourself 1.5 hours. Unless you watch everything.",
        "review_detailed_main": "I read another review and it painted my idea of this movie pretty clearly. But I will put it into my own words.\n\nWhile I will admit there are like 4 lines in the movie that made me laugh hysterically (mostly Kevin Nealon parts), the movie itself is disaster. There is no way to explain the outright awfulness of it, but I will try.\n\nIt's hard to believe that such an amazing cast would even SHOW UP for this movie. Bottom line. And yeah, Nick Swardson is usually hilarious.. but come on. The character Bucky Larson is the most unlikeable character I've ever seen in a movie, and I've seen thousands by now. And that alone makes the plot unbelievable.\n\nI suppose there is a whole, \"even guys with small dick's deserve love and can get a hot girl\" message there somewhere, but its clouded by stupidity, and its never very moving, because there is just NO CHANCE Christina Ricci would ever touch \"Bucky Larson\" - Stephen Dorf has a line in the movie \"Am I in the Twilight Zone?\" That is the only place where the story of this movie would ever be even remotely believable.\n\nAnd to make matters worse, there is ONE conflict and it happens in the last 10 minutes of the movie. The rest is literally climbing action. There's no climax. It is seriously the worst movie I have seen in years.\n\nDon't bother. The Hangover 2 (so horrible as well) was better than this movie, and I think I laughed more here... That's saying something about the script/plot of this movie. It's just a disaster.\n\n1/10."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "eddie_2204",
        "review_rating": "1",
        "review_title": "Quite possibly the worst movie I've ever seen! -10/10",
        "review_detailed_main": "This movie was not funny, it was offensive, occasionally nauseating and demeaning! I'm not sure why this movie was made I hated every minute of it!\n\nI have to warn you all, avoid it!!!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "cosmo_tiger",
        "review_rating": "3",
        "review_title": "WOW...not much to say really. Kevin Nealon was great...and some nudity...um...yeah...just WOW. Not good at all. I say D+",
        "review_detailed_main": "\"I'm the son of two movie stars...that's like a super-duper movie star.\" Bucky Larson (Swardson) is working as a bagger at a grocery store when he gets into a fight with his manager. Depressed, he goes to his friends house to watch a \"nude\" movie. When he sees his parents on the screen he finds his destiny. Going in I saw the reviews for this (2.2 out of 10 on IMDb, 33 out of 100 on Rotten Tomatoes) and I am usually skeptical of bad reviews. Like most good ones they tend to exaggerate how good or bad a movie is. This is did not. This is awful. A few funny parts mixed in with the same joke over and over and over. The best part of this movie hands down is Kevin Nealon but he is not in it enough. I will say that I have seen worse, but this is a movie that people will watch out of curiosity and may regret it. Overall, not the worst comedy I have seen, but without Nealon it may have been. I give it a D+."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Floated2",
        "review_rating": "2",
        "review_title": "Lack of laughs",
        "review_detailed_main": "The premise of this film is somewhat bizarre but for a comedy and with original ideas it seemed to be something that sounded great on paper.\n\nThe main problem with the film is that it isn't funny and the jokes are repetitive and overused. Too much crude humor and many instances crude humor can be funny but here it isn't, the writing is to blame.\n\nThe character of Bucky Larson was quite annoying at first but we get used to it, but overall too much of an idiot and very over the top. Christina Ricci was a bright spot. The supporting cast of Don Johnson and Stephen Dorff were tolerable and not to blame.\n\nThere are some enjoyable moments but overall this is a lack free comedy and it's no surprise that it was a box office flop."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "2",
        "review_title": "A few likable performances elevate this to a 2-out-of-10, but \"Bucky Larson: Born to be a Star\" is a weak, unfunny mess...",
        "review_detailed_main": "The Adam Sandler-produced Nick Swardson vehicle \"Bucky Larson: Born to be a Star\" is arguably one of the most dead-on-arrival comedies of the past decade. The film is an attempt to make a fun, quirky, raunchy comedy based on the idea of a clueless, semi-ugly nice-guy who gets pulled into the world of the adult film industry, but the material is all too basic, and it doesn't take advantage at all of the situation. Jokes are all phoned-in and are the sort 13-year-old boys snicker at to each other, and the writing is downright offensively bad.\n\nNick Swardson plays Bucky Larson, a simpleton with an outlandish set of buck-teeth. Upon discovering that his parents were famous porn-stars in the 70's, he sets off to travel to Hollywood and break into the family business, intent on becoming a star. Along the way, he meets a failing director (Don Johnson), an adorable waitress (Christina Ricci) and an antagonistic male porn star. (Stephen Dorff)\n\nThe film is a definite mess. The writing is very basic. (With the most basic sexual jokes about \"size\", \"stamina\", etc imaginable) And the few attempts at raunchy, gross-out humor are poorly conveyed and equally basic and unfunny. And characters are alternating gratingly boring, or breath-takingly over-the-top. Although some of the performances give a few characters a likable edge. Particularly Ricci as Kathy, an absolutely gorgeous waitress Bucky falls for. Swardson is also not bad for the role, and despite the absolute mess, Bucky is well-played. In addition, his constantly-aggressive roommate is an absolute blast, yelling at Bucky for absolutely everything.\n\nEverything in this film is sub-par. as I said, the writing is far too basic and uninspired. The director is also bland and boring, supporting roles are underdeveloped. There are almost no laughs in the film, and the conflicts of the characters are completely and utterly unrelatable, and therefore not funny or sensical by any stretch.\n\nThis is just an example of a film where everything is fundamentally underwhelming and basic to the point where it's tedious to watch. You may notice this review is pretty anemic, and that's because I simply have not been able to finish the film. I've only watched about 45 minutes of it, in pieces, fast-forwarding through the rest because it's such a flawed piece of work that I couldn't bring myself to watch the whole thing.\n\nI'm giving this an extremely generous 2 out of 10, mainly for Ricci' adorable-ness and a few funny side-characters. But seriously, take it from me- I tried to give it a chance, and I'm kicking myself for watching it. Avoid this mess."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "peoplecalmestewy",
        "review_rating": "5",
        "review_title": "Very Funny Comedy",
        "review_detailed_main": "Yes, this is what I call a stupid funny movie. The whole sense of the movie was stupid, so stupid it was funny. Very similar to step brothers. It was not poorly made, the story was definitely different. I laughed my butt off. You can not compare this movie to something like \"Good Will Hunting\" or something else. In the comedy cateogory this is definitely up there. Too rate this a 2.3, those people were on crack or something it was seriously not that bad. As a filmmaker myself I really couldn't find anything wrong with the storyline or the way the movie was put together. Compared to \"Grown Ups\" which had some pretty shaky editing in parts."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "mirkovladovicnl",
        "review_rating": "10",
        "review_title": "Greatest comedy ever!",
        "review_detailed_main": "This movie is hilarious.I mean,It is so bad its actually good. A masterpiece,the only movie that made cry out of laughing.Brilliant, doesn't deserve these bad grades! I don't usually like commedies at all, but this is one of my favourite movies all time. I showed it to all my friend and they all laughed so hard. This became our movie we watch a few times in a year. Believe me, this movie will change your life!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "DreamLighter",
        "review_rating": "7",
        "review_title": "Whatever the score, I laughed almost the entire time!",
        "review_detailed_main": "Here's the thing, there are funny movies and TV-shows based on real situation comedy, and there are just funny movies and shows. This is just a funny movie. That's all. I can't describe it better without spoiling the movie, but the low grade for this movie is completely unfair. I was laughing almost the entire time during this movie and I haven't done that in a long time! It's stupid, awkward, funny and adorable, all at the same time.\n\nDon't be so negative as to ignore this movie, it deserves a fair chance. I know I'm glad to have seen this movie and I walk away with a smile on my face and a happy feeling inside. I'm satisfied. Most movies don't do that anymore. I'm giving it a grade of 7 out of 10, because it is a great laugh whenever I'm down.\n\nAlso, Christina Ricci is just adorable. Perfect for her role."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Jkrb_McMASTER",
        "review_rating": "1",
        "review_title": "'Great Family Film' Critics loved it and so will you! xox",
        "review_detailed_main": "Yes, Quite possibly one of the greatest family movies of all time. This movie is very multi-cultural and lives up to the great critic response. This movie has impacted society so much following the come of the infamous young notorious 'Bucky Larson'!. Bucky appears to be your every day sweet heart but deep down he's a chigga chigga bad boy, unlike P'diddy Bucky Larson is not gang related, he is affiliated with the top people in the industry of L.A and uses his ol' folks skills to succeed in life. This movie will inspire young people all around the world to follow their dreams and not give up when the chicks are down. This movie smashed in records at the box office snatching a whooping '$2.5 million' the budget happened to be '$10 million' but its times like this when the chicks are down that like 'Bucky Larson' that you buckle up and follow your dreams.\n\nWatch other movies like 'Shawshank Redemption' 'Batman: Darknight' or the basic and generic 'Babby Driver' none of these movies compare to the sophisticated 'Bucky Larson: Born to Be a Star'. The amount of diversity and satisfaction you obtain is quite unique and fresh to the audience. In conclusion this film is far better and timid compared to the 'Doogie Howser TV SHOW'. The kids will love it as well whats better then that? That's a rhetorical question by the way of course there going to love it. Bucky Larson the character is the definition of raw perfection and 'Nick Swardson' the actor is very talented. Thankyou for reading my review remember at the end of the day everyone is en- tilted to their own opinion xox - Regards the LU WIZZAR foundation"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Yeah, it's pretty bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "charlytully",
        "review_rating": "5",
        "review_title": "Why all the animosity? Bucky just takes after a U.S. president.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "Only a 'small release'.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "debtman",
        "review_rating": "2",
        "review_title": "This movie really makes you wonder...",
        "review_detailed_main": "What happened to Christina Ricci? She must be hungry. Somehow, appearing in this hot pile of garbage, she manages to deliver an actual decent performance and come off as likeable and adorable, despite the horrible materials he has to work with.\n\nThe first 30 seconds of this movie give you a real feel for what you are in for. Pain. However I'll give it an extra star because there are a few gags that actually land and you'll probably have one or two hearty chuckles. And Christina Ricci delivers a solid performance. Actually the supporting cast in general is pretty solid. It just makes it all the more confusing, like how are these people supporting Nick Swardson. In what universe does that even make sense?\n\nIs this movie worth a watch? Not really. But it's kind of amazing to watch just for the sheer fact that it exists..."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "jfralic529",
        "review_rating": "3",
        "review_title": "Not one of Sandler's Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "falco12351",
        "review_rating": "2",
        "review_title": "The 5th Worst Comedy I've Seen",
        "review_detailed_main": "yet another quick buck for Happy Madison,this movie is almost as bad as Jack and Jill. this movie was a blatant and unfunny rip off of Boogie Nights and A Star Is Born, and on top of that some scenes make you want to hurl instead of laugh. If you pirated this movie don't feel ashamed because nobody should buy the DVD or even rent it which I did regrettably, so if you want a movie that's more entertaining than this get Boogie Nights or A Star Is Born instead. Adult Humor is only funny if its written with context, in this movie however it is extremely childish, crude and just disgusting. now I've seen Happy Madison make good movies in the past, but this one just deserves to be forgotten"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "ierenz",
        "review_rating": "2",
        "review_title": "I would describe it as giving new meaning to the word \"slapdash\" except for my suspicion that no one involved has any idea of the old meaning of the word.",
        "review_detailed_main": "I don't really have anything more to say about \"Bucky Lawson: Born to Be a Star,\" but in all fairness, I should mention two stuff that made me slightly amused, although they have nothing to do with the movie itself. The first is Don Johnson's concept of playing Miles Deep as a porn industry vet.This is not particularly funny, but I kept thinking it might have been more funny if his character had also been named Don Johnson, as well as a completely acceptable porn name de plume.(Look, I didn't say it was that funny, just funnier than anything in the movie.) The other thing is that Edward Herrmann, in the same week this movie is published, will also see the launch of a project more adapted to his talents, the voice of Roger Ebert's autobiography's audio version, \"Life Itself.\"In other words, Roger Ebert is only one degree of separation from the people responsible for \"Bucky Larson.\" As he is currently at the Toronto International Film Festival, I couldn't ask what he thought about this connection, but I think that if I had, his response would have been a mildly abashed nod and a request for a Purell bottle of \"Contagion\" size.Believe me, the feeling I understand."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Laakbaar",
        "review_rating": "5",
        "review_title": "If you're reading this review, you're probably too old and serious to enjoy this movie",
        "review_detailed_main": "Truth be told, I thought this movie was sort of amusing. If you like this kind of movie, you might enjoy it. My inner pre-adolescent teenager enjoyed the film for what it was.\n\nIt falls into the genres of \"lowbrow\", \"dumb\", \"crude\", \"toilet humour\" and maybe \"slapstick\". You can't say it was an \"awful\" movie in the sense that it was poorly acted, written and directed. It wasn't. I think \"stupid\" is actually what Swardson, Brady, Sandler, etc. were going for. It's on the same level as making fun of handicapped kids or laughing at farts.\n\nThere is an audience for movies like this, and who are we to judge this audience and the people willing to make movies to cater to them?\n\nAccording to IMDb, \"males under 18\" rate it just as low as everyone else. I suspect that the 11-14 year old boys who would find this movie the most amusing are not the sort to visit IMDb."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "davespetproject",
        "review_rating": "10",
        "review_title": "Save the shade for Dick Shadow",
        "review_detailed_main": "Bucky Larson is as splendid as Redondo's mac n cheese! Don't miss a bite! Come for the foreplay and stay for the comedy that only pre-cancel culture viewers will enjoy."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "craigedwardking",
        "review_rating": "6",
        "review_title": "Light hearted enjoyment",
        "review_detailed_main": "Me and my GF watched this on cable last night and we both enjoyed the experience. Light hearted and positive we found it a restated belief in humankind. The shattering of stereotypes and the inclusive nature of the storyline was refreshing. The fact that men masturbate was not dodged or hinted it was an obvious fact and even in a group scene was not reflected as homo-erotic just as being a natural.\n\nI particularly liked the way the parent/son relationship was portrayed. Mom and Pop, even though they had starred in porno back in the day, came across as loving proud parents and Bucky had obviously embraced good social values.\n\nThe normalization of the porn industry was well handled and yet the essential goodness of faithfulness was also brought to the fore.\n\nAll in all an amusing evening and the enjoyment of seeing some sensitive issues handled with a deft touch. Hats off to everybody involved."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "lysoc",
        "review_rating": "1",
        "review_title": "It's as bad as they say",
        "review_detailed_main": "I loved Grandmas Boy, Little Nicky and Swardson on Reno and the other Sandler movies. This is not even close to any of those. What can I say? The lighting was decent. Three thumbs down. Watch and you will figure it out by ten to twenty minutes. This movie is so bad I created and IMBD account just to join the league of truthers declaring this movie a STINKER! PeeYew. I often wonder who reads the scripts and thinks to themselves, yeah man, this is hilarious. I haven't seen Jack and Jill but I'm willing to bet Bucky Larson makes it seem more like Gone With the WInd. PS I'm not watching Jack and Jill."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "anaconda-40658",
        "review_rating": "4",
        "review_title": "Nick Swardson: Born to Be Bucky Larson.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "danaeriley",
        "review_rating": "1",
        "review_title": "Holy bad movie",
        "review_detailed_main": "Turned it off. Other than Jack & Jill, this is quite possibly the worst movie ever made. I dont even think an 11 yr old boy would think its funny. Oof."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "phd_travel",
        "review_rating": "3",
        "review_title": "Crude and often painful but with a couple of funny moments",
        "review_detailed_main": "An unattractive not well endowed Iowa guy travels to LA to become a porn star in the steps of his parents. One of the writers is Adam Sandler so that should let you know what to expect. It is way below the Farelly Brothers in terms of humor and slightly worse than a Rob Schneider movie in terms of crudeness. Quite a lot of it is painful to watch but it's not a total write off. There is something uplifting in the story.\n\nNick Swarsdon I thought was kind of annoying in 'Just Go With It' and in this movie he is annoying too but that is part of the character. He isn't a terrific comedian but he tries hard. The supporting cast is actually better than expected - quite good for what they are cast as. Christina Ricci is prettier than before and is quite sweet and touching as the girlfriend. Don Johnson is quite good as a slightly sleazy but kind porn director. Stephen Dorff is an arrogant porn star.\n\nOverall if you are in the mood for a crude comedy then it's quite cute in parts."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "dalemanderson",
        "review_rating": "1",
        "review_title": "My son made me watch it! 😳",
        "review_detailed_main": "This is the worst, most vulgar movie I've ever seen. Wishing I could get the two hours of my life back that I wasted viewing it. There's no redeeming quality in an of the foul language and sickening ideas this sick film brings. There aren't enough thumbs down available in the world for this atrocity ... SICK!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Arenas4812",
        "review_rating": "4",
        "review_title": "You get what you expect",
        "review_detailed_main": "I can see why some people gave this a bad review, but honestly if it's free then why not. It actually has a few laughs in it but it really falls flat in the last 30 minutes. It really brings the movie downhill. The character of Bucky is pretty funny. Overgrown Iowa boy living in his parents basement while discovering they were porn stars lol. That was pretty good. The romantic comedy elements in it were pretty lame. It's your standard Happy Gilmore comedy, not too good but not the worst movie ever made. The comedy in it isn't that bad if you really think about. The issue is, it's almost too raunchy even for today's time. The raunch in it made it almost unwatchable at certain parts. It's almost like a junior boys movie to be honest. They'd find this as the best movie ever."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "mcmickymick",
        "review_rating": "1",
        "review_title": "Oh my dear Gawd",
        "review_detailed_main": "Awful, horrible, atrocious, horrendous, vile....and that's just the first couple of minutes. It gets way worse from there. If Sandler set out to make the worst movie ever he just might have nailed it. When you think it couldn't get any dumber or any more unfunny Adam says \"here, hold my beer\". If I had a choice between contracting a flesh eating bacteria and watching this abortion again I'd somehow deal with not having skin anymore. I'm sure most other viewers would happily agree with me. As funny as late stage stomach cancer. As entertaining as an autopsy. Even less fun than a root canal. Without Novacaine I'm sure there are a few tough guys out there who are thinking right now \"Heck. I'll watch it. I've sat through THREE Queen Latifa movies and lived to tell about, dammit!\". Well, you poor misguided fools. You have no idea what you're in for. All I can say is God have mercy on your souls. Zero stars. None. Zilch. Ever."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "miketaylor2007",
        "review_rating": "8",
        "review_title": "This was not as bad as everyone is saying it is",
        "review_detailed_main": "I understand the movie is ridiculously stupid, but Nick Swardson is hilarious in this. I think it has to be his funniest performance hands down. I couldn't stop laughing when I first saw his face and the bucked teeth with bowl cut. Coming in to this movie you knew it wasn't meant to be taken seriously. If you can't handle comedies that are stupid and funny you should avoid them. I think the people giving Buck Larson a 1/10 were the same ones giving Warrior 10 and comparing it to Rocky, but let's stick to the review anyways. With Happy Madison movies it's either always a hit or miss. I think Sandler gave us another great dark comedy that will be loved by a small group of people, and hated by most. The dark humour in Bucky Larson is very dirty, so be prepared for that. I think it appeals to mostly men who are 18-35. If you saw Grandmas Boy that would be the best way I could describe the very dark humour of this movie. I was disappointed Allen Covert didn't have a bigger role in Bucky Larson but im sure Sandler has other plans for him. At the end of the day this was Swardson at his absolute best. Christina Ricci also did a great job with the role she was given. Stephen Dorff was good as always, but Kevin Nealon (bull dance guy from Happy Gilmore) had me in tears. I have never heard him swear before so when he goes off it's priceless and unexpected. I think Bucky Larson Born To Be A Star deserves an 8/10 and it's unfortunate that people these days can't handle a great comedy just because it's dirty. No dirty isn't the word for it, this movie is filthy. I am laughing again just thinking about the concept. At least Sandler gave us something really filthy for a change, finally back to his roots."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "edwardiancinema",
        "review_rating": "10",
        "review_title": "What do you expect? Absolute Nasty Hillarity",
        "review_detailed_main": "Its a shame this movie has such a low rating, it is completely hilarious. Bucky gives new meaning to moron in a likable way. Lots of nasty gags, but they are funny, and at no time is the comedy forced, as it is in many of todays so called comedies. It was well worth the dollar spent in the big Lots cut out bin. A keeper A+ Nick should continue making films."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "antiblurproductions",
        "review_rating": "",
        "review_title": "Bucky Larson goes off to connect with his dream of being a pornographic actor, in a tale whose poignancy is reminiscent of Shakespeare.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "dar0417",
        "review_rating": "6",
        "review_title": "It will get some laughs.",
        "review_detailed_main": "Not as bad as I imagined but don't expect to much. It will get some laughs."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "zetok-74613",
        "review_rating": "10",
        "review_title": "Truly a hidden gem",
        "review_detailed_main": "Critics are absolutely insane. This movie starts off funny and the laughs never stop. It's literally in the same category as Billy Madison. I don't understand where the hate comes from. You're not going to get some highbrow script, but they deliver nonstop entertainment for the sake of being a silly movie. Acting is on point.\n\nJust like Your Highness, ai have no idea what people are disliking other than to hop on the hate train. Literally one of the few films I put high up on the list of Must Watch and I've seen a TON of movies. I've seen more films than the casual viewer. I'm what you would call a cinema buff. You just have to appreciate the movie for what it is and you either get it or out don't. This movie is awesome, people. Don't listen to the haters."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "danthebandmusic",
        "review_rating": "",
        "review_title": "If you like Swardson's brand of humor, you'll love it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "marczisme",
        "review_rating": "7",
        "review_title": "Ehhh, Glad I rented it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "princessdscott",
        "review_rating": "10",
        "review_title": "I thought it was hilarious.",
        "review_detailed_main": "It's a stupid, fun movie and had really cute moments aside from the sex humor. Nice distraction from the seriousness and drudgery of life."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Does not quite work as a comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "jmarcan",
        "review_rating": "6",
        "review_title": "JUST SMOKE",
        "review_detailed_main": "Just light one up and you get the giggles lol. So bad it's funny type of movie that just makes you feel so much better about how good you luck. Love Christina Ricci that's why she recovered from it career wise. Defitneily learned a whole lot of new words for wanking. Accents were spot on with over exaggeration, made it much funnier. Adam Sandler took a risk and it failed him from what others have said. I tend to like the ones the critics don't. I think whoever wrote this was just as stoned as I am right now. Did have some dumb parts but they were tolerable. Give it a go, you could always turn it off."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "dimasodbowie",
        "review_rating": "10",
        "review_title": "Funny and Oscar Worthy",
        "review_detailed_main": "Witty and delightful amazing . Touching family drama about porno."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "p-ayt84",
        "review_rating": "10",
        "review_title": "Silly on purpose",
        "review_detailed_main": "Happy Madison makes very lighthearted feel good movies and this is why I have always liked them. Obviously this movie isn't for everyone, so if your into Sopranos or don't know how to be goofy and fun then stay away! To be indirect, it might offend the \"smaller\" crowd, and at the same time giving hope.\n\nThis movie touches on all the bases of what a movie needs, and then disregards them quickly. We come to expect movies to have way to much drama, and long scenes of terrible progression but Bucky didn't annoy me like that. What we find is a comedy to chat during and throw some popcorn. Being such a serious and critical society I found this film to be very refreshing."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "s-mason9",
        "review_rating": "10",
        "review_title": "Worth a watch.",
        "review_detailed_main": "People say it's the worst movie they've ever seen, but I'd bet those people haven't seen many movies because they already have a stick where the sun doesn't shine. They also say you'd have to like Happy Madison to enjoy it, but I've seen a lot of Happy Madison movies and they don't compare to this. There are cheesy moments, but they are done in a manner that barely trips you up or takes you out of the moment. I think there are plenty of laugh out loud moments, and honestly, If you like Nick Swardson you'll find plenty of entertainment in this movie. Based on other reviews I was expecting bad cinematography, lighting, jokes, plot, and dialog. I was pleasantly surprised to find that it's on par with other comedies. People seem to think that every movie made needs to be on par with the greatest movies of all time but I'd recommend it for anyone who finds humor in silly films that are obviously ridiculous from the premise."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "clivelineham",
        "review_rating": "8",
        "review_title": "Nick Swadson's acting as Bucky Larson was hilarious!",
        "review_detailed_main": "I thought Nick Swadson's acting as Bucky Larson was hilarious! It may be offensive to some people. I think this is because it has some awkward scenes of a sexual nature. I don't usually hassle my friends to watch movies or watch a movie myself with a low review rating, but for 'Bucky Larson' I've no regrets & friends who love this movie have confirmed it's humor quality. This is not a badly acted movie. Nick Swardson commits to his character outrageously as 'Bucky'! He's a lovable and gentle hearted outsider but unknowingly has no inhibitions, & it is his genuinely played innocence that makes this such a laugh out load movie, & Christina Ricci, Don Johnson are great supporting actors."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "levilafrance",
        "review_rating": "8",
        "review_title": "Underrated Film That Cracks Me Up",
        "review_detailed_main": "Bucky Larson is an absolute joke... A joke that lands over and over and over again. I can't help but bust up laughing several times throughout the film. I think the film is very underrated, and people just rip it apart as if it wasn't a comedy, but guess what. It is a comedy... and I am not an easy laugh, yet I cannot help myself here.\n\nPeople claim they didn't laugh a single time throughout the film, and if that is actually true for you, then I think you are the problem. Yes, you read that correctly. I can't even list all the moments that earn a laugh just from being so ridiculous, and it really sounds like a \"you\" issue.\n\nThere are issues. A few characters are indeed abrasive and annoying. The Dick Shadows guy. The roommate. The diner owner.... but the whole film is produced so well, and I laugh so hard at some things that I don't care at all.\n\nBucky Larson is a silly movie with hilarious moments, and if you can't enjoy that, then you are a low quality person."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "radmanart",
        "review_rating": "10",
        "review_title": "What is wrong with you all? This is a 10!",
        "review_detailed_main": "Sometimes I wonder if all you; sadist, internet Nazis, give Adam Sandler bad ratings because he is Jewish.\n\nThis movie made me laugh so hard I was crying. I have not laughed that hard in many years. That alone warrants me to write this review. Nick Swardson is so very funny to me; always. His performance in Blades of Glory was stellar. His Comedy Central stand up appearance; was pretty good. With some work he could be really great at stand up.. Christina Ricci was really great too. Her expressions were so convincing. She really made me think she was a all American wholesome girl; through the whole movie. Don Johnson was also so entertaining; his performance alone would have made this movie great. Kevin Nealon as Gary; was just icing on the cake."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "kzucc-37279",
        "review_rating": "8",
        "review_title": "Relax",
        "review_detailed_main": "This wasnt meant to be a national treasure. I rated 8 stars because it has Peter Dante. Dante is gold."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "jameswilson4466",
        "review_rating": "10",
        "review_title": "Good enough",
        "review_detailed_main": "I'm assuming all the haters have personal issues with their own junk. The movie was actually better than most of the comedies available. Easily a 7.0\n\nI would say that I got a lot of fun from watching this impressive work of art that defies convention and goes where no other movie has gone before. It was a \"bad movie\" done entirely on purpose by the director and writers. Just like the porn movies Bucky made in the movie, this is innovation and film critics, people who were brainwashed in film school to like 1940's stuff, cannot simply understand the genius of this film, as did the people on the porn business which were shown Bucky film's."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "chrisgibbe",
        "review_rating": "10",
        "review_title": "Citizen Kane, Vertigo, Blade Runner and Now Bucky Larson",
        "review_detailed_main": "Certain Films, a select few, can change the way you see the world. These are expressions of a collected effort that take hundreds of professional artists, technicians and engineers working towards that final goal: to produce a piece of Cinema that truly touches the viewer. They make the audience open their mind eye's and see the world around them for what it really is or what it could be. Other Directors and Writers see this film and are inspired to raise their own standard even higher. Having never known one could produce a work of this quality they know they must surpass it. If it is the last thing they ever do they must make something better than Bucky Larson."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "tre1",
        "review_rating": "8",
        "review_title": "I enjoyed it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "cdog534",
        "review_rating": "9",
        "review_title": "Super Funny!",
        "review_detailed_main": "I don't know why there are all of the bad reviews!!!\n\nThis movie is a classic dude's movie, right up there with 'Grandma's Boy'. Some parts are super funny. Like crazy super funny. And there is a lot of subtle humor sprinkled throughout.\n\nSwardson, Ricci, Johnson are all great. The movie realizes it is goofy and plays to that premise. Something like Grandma's Boy...\n\nThe character of Bucky is very inspirational. He finds and lives his dreams, despite some issues that would stop most people, and despite people telling him it wouldn't be possible. And he's from a humble Midwest background, which is cute.\n\nUltimately it all works. Show this movie to your friends and they will think it's great too!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "erolsabadosh",
        "review_rating": "8",
        "review_title": "Very funny stupid film.",
        "review_detailed_main": "If you like films such as Half Baked, Hamlet 2 & Napoleon Dynamite you will love this, it's stupid but I found it hilarious. I don't understand why it's gotten so much hate, Nick Swardson's character is so funny you'll laugh just by looking at him, the script is insane and entertaining and the jokes are raunchy but there's a sweetness to the whole film that stops it from being pure gross-out. It's the character quirks and the silliness of the situations that make the comedy so hysterical and I honestly laughed throughout so I don't know what the haters' problem is. If you like random humour like that of Family Guy then you should give this a try!"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "danieljameshenrywilkes",
        "review_rating": "8",
        "review_title": "\"Aww Whats Up Doc?\"",
        "review_detailed_main": "Hello it has been 2 years since my last Confession/Review.\n\nI remember reading about this film being made a couple of years ago and thought if this really gets made i will clear my Friday nights for the next 3 years on the chance it turns up at my local Multiplex.\n\nI am sure this may come as a surprise to a few of you that it narrowly missed the big screen and ended up next door at the local supermarket(albeit with an exclusive sticker on it).\n\nI have to say loud and proud that this is a funny film, it may not be your ideal Friday night \"Date movie\", mine unfortunately was Captivity with Elisha Cuthbert.\n\nIt may not sweep the Oscars or be the topic of any Stephen Fry after-dinner speech, however this is a film thats gonna lift your spirits and make you realise however serious you think life is there are always going to be a handful of people willing to make \"Art\" in the name of stupidity!!\n\nI for one will offer them my vote!!\n\nI could try and extend my words to explain the little details but i think bullet points may please certain readers up at this late hour.\n\n*Nick Swarsdon *Don Johnson *Christina Ricci *It's an 18 Certificate (When was the last time we saw one of those eh?\n\nPlus: Drum Roll please it has a cameo from Dante (Grandma's Boy)\n\nSo now you know where i look for my comedy fix pretty broad i guess,don't get me wrong i thought \"We need to talk about Kevin\" was the best British comedy since Four Weddings.....\n\nDjHw\n\n\"I know you touched my Drum-stick and i just wanna hear that dirty little mouth admit it\" (c)Dale Doback"
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "coon1",
        "review_rating": "8",
        "review_title": "Way better than it's rated here.",
        "review_detailed_main": "I am so glad I watched this.I almost didn't because of all of the bad reviews here. This movie had me amused from start to finish, and had a lot of laugh out loud moments. A lot of the humor was crude, but it wasn't disgusting like others have said. If you liked Grandma's Boy, you'll probably like this. It had most of the familiar stars from the Happy Madison movies plus Christina Ricci, and she was adorable in this movie.\n\nThis isn't Happy Gilmore level, but fun to watch. All of the negative reviewers should stick with the cookie cutter romantic comedies so they won't get offended so easily."
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "jorwmu",
        "review_rating": "",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411664",
        "movie_name": "Bucky Larson: Born to Be a Star",
        "movie_rating": "3.3",
        "review_username": "Elpatron",
        "review_rating": "",
        "review_title": "What a bunch of crybaby's! This is a great comedy!",
        "review_detailed_main": ""
    }
]