[
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "comedevil",
        "review_rating": "9",
        "review_title": "An emotional and powerful journey.",
        "review_detailed_main": "Even though the Indian film Industry releases countless big budget films every year, only once in a while there comes a movie like \"Rockstar\" which moves away from the usual story and casts an impression on the viewers.\n\nImtiaz Ali has created such a masterpiece this time. His story is a fresh take on romance and pain and he has shown he is one of the best directors around.\n\nThe story revolves around 2 characters Janardhan Jakhar a.k.a Jordan(Ranbir Kapoor) and Heer(Nargis Fakri) and their feelings towards each other. The special thing about this movie is that despite being a love story, the lead characters never act as the clichéd lovers..they never said \"I love you\" throughout the movie and still their love was so intense and powerful..The self inflicted pain of 'Jordan' is the soul of this movie and moves the audience.\n\nRanbir has done a remarkable act and has again proved he is an exceptional actor in the film industry. His transition from the innocent and confused 'JJ' to the ruthless, shattered 'Jordan' is flawless. The audience were in awe of him throughout the movie and rightly so.\n\nThe music blends with this movie perfectly and most of the time lifts the movie to higher levels. The voice of Mohit Chauhan along with the expertise of AR Rahman is just superb and this duo will be in demand for a long time. The joy, enlightenment, pain and suffering of 'Jordan' is portrayed very well through the songs. And this is one of those movies in which you feel that the songs weren't just forced in the story.\n\nDespite everything being so good there was one shortcoming, Nargis. The model turned actress had weird expressions in few scenes in her debut film. This created some funny moments in the first half but she did a convincing act post interval.\n\nOne thing which the director couldn't balance was the pace..The first half was expanded into few years showing the pair's love and relationship but post interval they didn't do that, and stuck to a straight and small period with longer scenes. This gave most of the general audience an idea that it was slow. If the story in between intervals was balanced in terms of the time span, more people would have appreciated the whole movie.\n\nThis an emotional, and an intense journey of a simple man who goes on a path of self destruction. A Must Watch, this movie needs deep understanding and appreciation."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "hrithikmonish",
        "review_rating": "9",
        "review_title": "Rockstar - An amazing love story---Saddaaaaaaa Haqqqqqqq",
        "review_detailed_main": "JJ aka JORDAN / Ranbir Kapoor Rocks.....Saddaaaaaaaa Haqqqq......Loved Rockstar movie a lotttttttttt......From Screenplay to story or Direction to Music N above all acting from the all the character is like mind-blowing ...........Will be watching it again tomorrow...This is not a feel good movie and I know a lot of people will not like it but yes it will make you think even after the lights are on.....This movie is the best film of 2011....RK is amazing and ARR score rocks....Deserves all major awards....OVERALL AN OUTSTANDING FILM which is connected to most of us...Rating 9/10....oh ya ya ya y...o yaaaaaaa....."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ssvikas",
        "review_rating": "8",
        "review_title": "Ranbir's stellar performance nearly makes up for the movie's flaws",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Theonlydev",
        "review_rating": "10",
        "review_title": "Excellent piece of work",
        "review_detailed_main": "Jordan is sitting among prostitutes and strumming his guitar as they sing together -- when his manager pulls him out onto the street. Soon, a crowd engulfs them and starts chanting Jordan's name, their voices drowning the sound of the manager pleading with the musician to get his act together. \"This is what I have always wanted,\" Jordan says, looking at his screaming fans. \"But I am not happy inside.\"\n\nImtiaz Ali's Rockstar is a bittersweet journey of a man, an artist, from being an everyman to a superstar. But while Ali uncovers layers off Jordan the iconic musician -- each layer as fascinating as it is intriguing -- he keeps the core of the character, Janardhan Jakkad, alive. He hurts like anybody else, falls in love like anybody else, and also has to deal with moments of sheer frustration.\n\nAnd all of it finds release in music. Music is Jordan's identity; it's what makes him rich and famous. But to Jordan, that's incidental. In the end, his artistry is what connects him with himself. For a Hindi film viewer, that is a fascinating story to watch unfold.\n\nThen there's the opening shot, a tribute to India's original Rockstar, Shammi Kapoor. From there on, it's a tumultuous ride – one with its highs and lows, one that has anguish as also love, one that has pain, but also a sense of fulfillment. And a brilliant finale -- not a conventional one, but effective nonetheless -- which leaves you feeling like the characters themselves: incomplete but content, like an effective crescendo that leaves you wanting more.\n\nThe music itself is a delight. Each AR Rahman number is lilting, and woven beautifully in the story, the high frequency of songs not hindering the storytelling but enhancing the experience. Lyricist Irshad Kamil does an outstanding job, penning words that reflect the lead character's state of mind and complement situations aptly.\n\nImtiaz Ali, in trademark fashion though, isn't content with Focussing on the complexities of a troubled musician; he gives us a dose of romance too, and a generous one at that. Estrangement from family, lack of fulfillment in life, and self-discovery apart, what really drives Jordan's music is his relationship with Heer (Fakhri, beautiful but awkward). Volatile as the affair is, it's also what keeps Jordan sane, and Heer alive.\n\nFor about 15 minutes in Rockstar, the narrative tends to resort to 'Bollywoodism'; true love having the power to cure a terminal illness (almost), for example, doesn't exactly fit with what the rest of the film has to say. The story tends to meander a bit post-interval, but Imtiaz makes it work eventually, interweaving the fantastical romantic part of the film with the more gritty, dark bits deftly. In the end, how much you enjoy Rockstar will largely depend on whether the balance between the tale of a broken, discontented musician and the more conventional love story works for you.\n\nIt did for me -- though I would have preferred the former -- but you can't deny Imtiaz credit for his mastery over the romance genre. No contemporary filmmaker has dealt with man-woman relationships with as much dexterity. His films often tread a similar path (the lovers are usually confused, meet at different points in life, and there's always the 'other man'), but his fresh approach to each story is what makes them immensely watchable.\n\nWith Rockstar, Imtiaz goes beyond his own tried-and-tested format, his ambition to narrating a more complex story coming through. This is probably his most personal film, and his honesty as filmmaker is hard not to be affected by. Hopefully, he goes the whole hog next, ditching the genre he's adept at to trying his hand at something entirely out of his comfort zone. Rockstar is also Imtiaz's most technically polished film, and he benefits from the association with cinematographer Anil Mehta and editor Aarti Bajaj.\n\nRanbir Kapoor has been Hindi cinema's Next Big Thing for a while now. With Rockstar, he lives up to the hopes pinned on him to deliver big. Ranbir revels in Jordan's complexities; another actor may have found it to be an obstacle. The character arc undergoes constant transformation and he adapts suitably. It wouldn't be an understatement to say that Ranbir's portrayal of Jordan may go down as one of Hindi cinema's most accomplished performances by a lead actor. Just to see him work his magic on screen, Rockstar is worth a watch.\n\nBut while good acting is always an incentive, it's a director's vision that makes a film truly watchable, and Imtiaz makes Rockstar stand out from what the mainstream churns out every week. And brings back the one aspect sorely missing from Hindi films lately -- music."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "nipurngupta",
        "review_rating": "10",
        "review_title": "No words for describing it...",
        "review_detailed_main": "Rockstar is a film made once in a lifetime. Hats off to Imtiaz Ali for story, Ranbir Kapoor & Nargis Farkhri for scintillating performances, A.R. Rahman & Mohit Chauhan for great soundtrack & background Music.\n\nRockstar is a must watch film. It'll leave you feel-good hangover of itself. This Movie shows how Love Stories should be made. This movie has something, which is hard to see in other Hindi/Bollywood Films. Something which would make you think about the whole movie even after so many hours of watching it. Watch it deeply and you'll enjoy it.\n\nI loved the movie and enjoyed it thoroughly after so watching so many movies this year, I'd say Watch it Again, if you've seen it once...\n\nVerdict: Don't Miss it!!!\n\nActing & Performance: 9/10\n\nStory: 8.5/10\n\nMusic: 10/10\n\nOverall: 9/10"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vaibhav_bhandeo",
        "review_rating": "10",
        "review_title": "A New Star Is Born - RockStar",
        "review_detailed_main": "First of all, Rockstar is not a mere love story, for those people I saw drawing conclusion that this is just an extramarital affair which is justified by Imtiaz Ali, it's much more than that.\n\nWhen the character of protagonist was getting built, it was told to him that it would be pain that would get the star out of him; movie is journey of making of a Rock star who goes through pain of separation, depravity from society which makes him someone he was never meant to be but finally a Rockstar. A true blue eyed boy who was always away from any sense of pain in his life until he falls in love and tore apart life of his and love of his life Heer.\n\nI am although not a big Rock music fan but got food for thought for those posthumous rock stars that lost their lives to depression and drugs. This film gives gray shades of their tainted life which is always open to so much of public scrutiny which perhaps helped me to recon with their hysterical behavior.\n\nIt starts with a young lad trying to make big in music but who doesn't have soul to sell himself as a serious artist. He has shown a way through love and betrayal and he fancies his chances with the most admired girl of the town, little does he know that this would embark an endless journey of pain for both which would see it's penultimate end being both leads battling for their survival literally.\n\nI don't wish to discuss movie dynamics in length as this is not about how the script has been written with/without conviction. The real sense of conviction in this movie comes through Ranbir Kapoor, he lives the character of Jordan and gives performance of his life time. Not in for a second you would think for the entire movie that he is a movie star, you would watch him struggle through his pathos. Kudos to him for pulling this off with such great ease, I couldn't imagine anyone doing this role and leave the same impression. Nargis who is the leading lady in this movie, looks no less than an angel in movie and gives a performance for which any new comer can feel proud about especially against such a strong character played by Ranbir Kapoor.\n\nOf all the loudest praise should go to two people, A.R. Rehman for his genius music and to Mohit Chauhan, this movie is as much a milestone for him as it is for Ranbir Kapoor. Both Mohit and Ranbir jells so well that it's hard to believe that actually Ranbir's voice is backed by a singer, it's a compliment for both of them. Every song stands out and they all are superb.\n\nI thoroughly enjoyed this journey of making of a Rock star. This movie is not about making a right statement to society and not to follow the footsteps of protagonist; it's about how much pain it goes in making a real Rock star that makes everyone feel on the cloud when he couldn't ground his foot correctly. Movie is dark in nature and this is about an anti hero Jordan who don't have sense of righteousness and he vents out his anger in form of music, a picture perfect depiction of a rebel Rock star to the core.\n\nWatch it, if you are in for dark movies. Don't expect any Bollywood masala but an intense tide of emotions throughout."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "monty_elvis",
        "review_rating": "10",
        "review_title": "Honest",
        "review_detailed_main": "Not every movie needs to have tadka, it's a movie which is pure from heart and honest. It doesn't speak about anything other than attraction which can't be explained.\n\nSure it has it's flaws but if you can look over them and watch it with a warm heart, it stays with you well after you have left the theater.\n\nHats off to Imtiaz Ali for daring to break the shell. Jab we met was fun to watch and a good movie, but Rockstar shows how much depth can be reached in a romantic movie without even saying the L word even once.\n\nEverything said, watch it if you appreciate good cinema and not because you are looking for a stereotypical complete Bollywood package."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "An awesome piece of Art by Imtiaz Ali",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rancidgrillz",
        "review_rating": "7",
        "review_title": "A Movie that makes you think about it even when the lights are back on!!",
        "review_detailed_main": "FILM: When you think about a film by Imtiaz Ali, you only see an entertainment tag to a film, and also very good script writing. But seeing the promos of Rockstar made me think what Imtiaz is up to now. After giving a great film like \"Jab We Met\" and a mediocre film like \"Love Aaj Kal\", I was expecting a cheesy Love Story with a good entertaining factor. I won't say this movie doesn't have any cheesiness, but yes it's in a very low dosage. People going for just entertainment will actually love half of the movie. People going to see a Romantic flick will love the whole film. There are some very good comic punches in the film, and some very humiliating parts too. I won't use any spoilers, but yes the first half is full of comic scenes.\n\nACTING: Ranbir kapoor is at his best here. After giving a great performance in Rajneeti, this guy has shown his serious part again, in more of sadder way. Nargis Fakhri is very good to look at, most part of the film you will just look at her and won't even hear what anybody is saying, but when you see her talking, the jaw just falls down, she does not have those acting skills at all, it's like the start of \"Katrina Kaif\" again. But she has a great future ahead of her for sure. Kumud Mishra and Piyush Mishra never disappointed in their acting, both did a great job, especially Piyush Mishra.\n\nDIRECTION & CINEMATOGRAPHY: Now the direction was really top notch in this movie, it was particularly flawless in every aspect. Imtiaz has a tendency to deepen the character development, and he has done this with great enthusiasm. The character Development of the \"Rockstar\" is very good and keeps you on your seat. The Cinematography was also great, from the walking sides of Delhi University to the scenarios of Kashmir and Prague was immensely intriguing.\n\nSTORY: The Story of the movie had some parts that all Hindi romantic have usually, for a time you would wonder of a \"Yash Raj\" film being shown. But the turn of events and the whole movement of the story were good. The only problem being that the whole movie was a \"drag/stretch\". This movie if made shorter, would have gained more audience.\n\nMUSIC: I would say the music (by A.R. Rahman) is damn good. From \"Jo Bhi Main\" to \"Tum Ho\", the scores are really beautiful, and stays in your head for a very long time. Sadda Haq already being the favorite among the youth has a good adrenaline rush factor in it. The movie being pretty much mediocre, the music actually makes the movie very good.\n\nVERDICT: I would go for\n\nFILM: 7/10\n\nACTING: 7/10\n\nDIRECTION & CINEMATOGRAPHY: 6/10\n\nSTORY: 6/10\n\nMUSIC: 9/10\n\nOVERALL: 7.5/10\n\nThe movie has been given a great artistic touch to it, which is hard to see in a Bollywood film. Such that it makes you think about the whole movie even after 24 hours of watching it. Give it time to indulge in your mind, it will actually get to your soft spot, and you would say, \"The movie was really sad\"!!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vikas_rawat",
        "review_rating": "10",
        "review_title": "'Rockstar' leaves you with a feel-good hangover of itself, that is hard to digest at first watch.",
        "review_detailed_main": "Love stories have always been Bollywood's thing. A trifle here and there might have changed over the years, but the formulaic love story, the one that we've all grown up on and savored, always takes you by the hand, guides you through the film's ups and downs and leaves you at an ending. But when you have a story as new, as fresh and as free-falling as the one in Imtiaz Ali's 'Rockstar', then these are times that herald a new change in today's Bollywood.\n\nThe story goes something like this. Janardhan Jakkad(JJ a.k.a Jordan), a Delhi simpleton, has always wanted to be a rockstar. His friend/mentor and college canteen manager, Khatana, gives him a 'get-your-heart-broken-and-you-will-be-a-rockstar' solution. JJ automatically aims for the prettiest chick on campus, Heer, sure to have his heart broken. But what follows is a story that goes from a simple one of fame-mongering to a love story most unusual. The chapter of Jordan and Heer never seems to end and their complexities take them on a path that would ultimately destroy their lives.\n\nIt is very difficult to characterize the movie with a single emotion. It is so beautifully layered that it will take repeated viewings to form a consensus within yourself as to WHY you love the film. Just like its soundtrack, 'Rockstar' is a movie you will have to allow to grow on you. The film can best be described as a heady cocktail of love and fame and how each has an effect on the other. It's the free-falling nature of the story that gives it a feeling never before experienced in Indian cinema. The movie borders on self-indulgence every once in a while but wonderfully balances it out with realism.\n\nThe music, composed by A.R. Rahman, is in many ways a character in the film. Every phase of Jordan's life is characterized by a song which magically sets the tone for the next few minutes, till the next song or sequence comes along and changes the mood. The music, in many ways, drives the film. Its very obvious now why Imtiaz Ali replaced usual collaborator Pritam with Rahman. Without the type and scale of the music Rahman has given for this film, 'Rockstar' would have been very handicapped. The music truly forms the soul of the film. Also, from the snow covered mountains of Kashmir and Himachal and the dingy discotheques to the old-architecture of Prague and the various concert venues, the film looks beautiful in almost every shot, thanks to ace cinematographer Anil Mehta. The right variations in angle, color and focus gives the film a biographical feel where the scenes portray an emotion as much as the actors in them do.\n\nWhich brings me to the performances. The film has few characters and each of them are well-defined. Aditi Rao plays the journalist Sheena, who tracks Jordan's life and though she has precious little to do, she plays her part. Piyush Mishra as the shrewd record company owner Dhingra, is the quintessential greedy man in the film and does well too. Kumud Mishra as Khatana, Jordan's old friend and manager is perfect and brings in a certain sincerity and authenticity to his part. Shammi Kapoor as the shehnai maestro Ustad Jameel Khan is absolutely charming every time he appears on screen. It is hard to miss the glint in his eye and these being his last shots, will always be what 'Rockstar' will be remembered for. Now for the two lead actors. Nargis Fakri is unfortunately, the weakest link in the film. She obviously has a lot to learn in the acting department. She blatantly disappoints in scenes where she is required to do more than just look pretty, and ends up as the cold dish in 'Rockstar'. Nonetheless, she does look good in every frame and with better acting, could go places. With her current form, she will find it tough to make a mark.\n\nHowever, 'Rockstar' completely belongs to Ranbir Kapoor, who has clearly gives this film his all. He plays his part with utmost perfection and with a depth that is so rare in Bollywood these days. Through the film, it is Jordan, and not Ranbir Kapoor, that we see on screen. He earnestly brings out the character transition from JJ to Jordan with such ease, that this could very well be his career-defining performance. He's clearly left his contemporaries WAY behind. Ranbir Kapoor, as of now, owns Bollywood.\n\nHaving dared to make such an experimental film, director Imtiaz Ali is truly the new-age doyen of Indian Cinema. His refreshing take on love stories, from 'Jab We Met' to 'Love Aaj Kal', continues with 'Rockstar' which will be remembered for a long time as the first movie of its kind. Truly original and truly inspired from all the right sources, Imtiaz Ali is the new age phenomenon of modern love in cinema.\n\nTruly magical and spell-binding, 'Rockstar' leaves you with a feel-good hangover of itself, that is hard to digest at first watch. I'd give it a 4/5.\n\nDon't miss."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "mukundsworld",
        "review_rating": "7",
        "review_title": "Ranbir Kapoor roars with the music of Rehman \"SADDA HAQ..ETHE RAKH\"",
        "review_detailed_main": "So,Rockstar is finally out and its with flaws but still its fabulous. Lets talk about flaws first. Imtiaz Ali have written his most innovative script so far but it got few holes like he could have made the storytelling little bit smoother in the first half but its OK we can manage with that. The other thing i complain that why Imtiaz choose Nargis Fakhri to play the lead actress. She is breathtakingly beautiful, no doubt about that but she just don't know how to speak Hindi and how to behave desi. To make it simple, she is the only main drawback of the film.\n\nNow lets talk about what makes Rockstar a memorable movie.I know movie is a result of teamwork but the three man who makes Rockstar a fabulous film is Ranbir kapoor, A.R Rehman and last but not the least Mohit Chauhan for giving his beautiful but rocksolid voice to Jordan the Rockstar. Its all and all Ranbir show throughout the entire movie and Rehman's soulful music to make Ranbir's character express his angst. This movie cannot be done without A.R.Rehman. Its Ranbir's best work so far. Those who have not seen the Rockstar yet, just go and watch it for Ranbir kapoor aka Jordan aka Janardhan Jakkad and believe me you will come out of the theater with Jordan in your mind and heart. \"Girlfreind ban ja meri..dono rock kar denge\"..hahahaha"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vms175",
        "review_rating": "9",
        "review_title": "Not at all made for unintellectual viewers.Intensified.Exemplary.",
        "review_detailed_main": "Pros:\n\nAbrupt start and unfinished end,always catchy!\n\nLove,attraction,passion,pain,loss,destruction-everything in a pack.\n\nMovie includes flashbacks and frames so nicely arranged,that story always remains on track and with ease.\n\nSupporting casts are so in script,no any distraction or out of track leads.\n\nRaw footage beautifies the movie,editing is nicely done and skipped.\n\nRanbir-Nargis chemistry is uncommonly beautiful.\n\nSongs are sung outstandingly by Mohit Chauhan and performed equally well by Ranbir.Made for each other duo.\n\nLyrics are inseparable from situation,really well written.\n\nCons:\n\nNargis is overwhelmingly beautiful but utterly noob while acting.\n\n---------\n\nNot many directors could have justified the script like Imtiaz Ali.\n\nMusic couldn't have been better than by the Academy award winner A.R.Rehman,it takes you to out of world.\n\nand Ranbir Kapoor,real rockstar from the movie has shown that,he is ready to make the bollywood biggies insecure.\n\nOutstanding movie!!!above the average of bollywood."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rahulbit-shrivastava",
        "review_rating": "7",
        "review_title": "A Good Watch",
        "review_detailed_main": "Ten-on-ten to Ranveer & Mohit. Imtiaz kept things upto expectations and Rehman brilliance can't be doubted. The movie takes off quite well with well organized sequences and keeps its grip as it progresses. Nargis was a sophisticated and high-class version of Jab We Met's Kareena. She kicks off full throttle with Janardan, to create the most entertaining moments in the movie which go quite natural with there character. The second-half of story turns a bit complicated and music again keeps the hold. But, things keep going on weaker and ultimately it somewhat bends on the lines of typical bollywood drama, not deviating from the theme. Heer's details sometimes are unnecessary, and Jordan's character is irritating sometimes.\n\nHad it been made a little shorter, it would have been a perfect work. A good watch. Go for the music which is best in the recent past and Ranveer's performance."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jeethjohnp",
        "review_rating": "5",
        "review_title": "Rock on Ranbir...Imtiaz please put up a more apt title for your next movie...",
        "review_detailed_main": "Imtiaz Ali tries a Jim Morrison with an Indian back-up story to add it all up. But when the back-up story takes a free-float equation with horrible acting from the female lead even rock-n-roll, sex, or drugs won't help the story to take a flight. The starting sequence takes a tremendous leap and sets everything on fire. From there the movie leaps to a flashback. The flashback is a sine wave to be precise where crest is when Ranbir fills the screen and trough is when Nargis takes over. Post-interval the director gets a grip on things but still falters here and there but in the end gives up for regular rom-com commercialization. Even the sequences where Ranbir goes all crazy and shouting I just can't understand how he must have reached that point when the relationship that he had with Nargis showcased in a shallow manner. The only factors that makes this movie watchable is Ranbir Kapoor and music By ARR. Ranbir shows great maturity in some of the sequences. But I feel he has more potential."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "saba2115",
        "review_rating": "8",
        "review_title": "Imperfect Love of Perfect Lovers",
        "review_detailed_main": "I have to say that watching this movie ALONE in an empty movie theatre added several dimensions to the whole experience of watching ROCKSTAR.\n\nMy first comment is to Imtiaz Ali-- What were you thinking, bro? To actually have the gumption to create a love story around the idea of ethereal and eternal love as envisioned by the great Sufi Master Rumi in the land of DABANGG and BODYGUARD? Did you really think that audiences (read THE COMMON MAN) would throng cinemas and multiplexes to get a taste of sublime love?\n\nFor sublime love is the thread that binds this beautiful bitter sweet tale together. It is a love story written in the idiom of NorthIndian/Kashmiri/Sufi culture, of dargahs, of spirituality, of Delhi University Campus insider jokes, of the topography of North India, especially Kashmir and I fear the film could be condemned with the \"E\" word--elitism.\n\nThe starting point of the story is a young ordinary low middle class callow youth who is a wannabe singer, strumming his guitar to ordinary lyrics hoping to make it big. He is accused of being shallow by his mentor and advised to seek out \"PAIN\" in order to light the creative spark, that divine glow that accompanies great art. Unbeknownst to him, his casual and frivolous flirtation with this search for angst leads him into the deep end where he has to come face to face first with true love and then with the inevitable pain that comes with it.\n\nThe dialogues are fabulous. So is the cinematography. The snow clad mountains of Kashmir and the misty mornings of New Delhi, the green fields full of flowers in Prague place the story in the here and now when in truth the story could belong to any era, any century, any epoch. The universality of love, the self realisation that comes with it, the realisation that this life is but a dream is what the movie is really about. The essence of the story is not in the physicality of love but love beyond the here and now, beyond right and wrong and love for the Creator who was there when there was nothing else.\n\nSee what I mean when I ask Imtiaz--what were you thinking, bro?\n\nAnd now for the piece de resistance-the music, the lyrics, the singer.\n\nIf there were any doubts being expressed by the hoi polloi about A R Rehman's diminishing creativity well then, here is his rebuttal.\n\nThe music is earthy, rooted in our traditions and culture, and designed to rock. It's astonishing how Rehman is able to dive into the musical traditions of the Punjab to create the \"Saada Haq\" and \"Katiyaan Karoon\". Irshad Kamil's lyrics, if you take the time to listen to the songs and understand the words, are beyond compare. Mohit Chauhan's voice is eminently suitable for all the songs. My favorite is \"Naadaan parinde, ghar aajaa\" Listen to the lyrics and cry.\n\nWe have been enjoying a lot of junk food lately. Now it's time for some haute cuisine."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "nisarg16",
        "review_rating": "",
        "review_title": "A touching story with a bold treatment, imtiaz's treads uncharted waters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kumarakshay175",
        "review_rating": "9",
        "review_title": "Rocking !!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kadhalyaanai",
        "review_rating": "10",
        "review_title": "Rockstar: To that ordinary person inside every STAR",
        "review_detailed_main": "First up i want to say as a gleeful child i sat in the theater and wanted to give as much chance as possible to like ROCKSTAR because i was mesmerized by the sheer musical brilliance of ARR. That being said even if i went in with a hate mood its difficult not to like this IMPERFECT MASTERPIECE, imperfect not in the way it was handled but its an Imperfect story about an Imperfect man inside every STAR. First Half: There are three main things for a life to sustain. A creator, a soul and a body to host the soul. And thats where ROCKSTAR is blessed in having a brilliant director in Imtiaz as its creator, a soul in ARR and the surprisingly perfect body to host in Ranbir! People who didn't like Ranbir for the rich spoiled kid he is must realize if he has this much acting talent he can be as much spoiled he can be! :) The story is simple! \"Its the life and lies of Janardhan Jakhar\" a.k.a JORDAN. Its how a innocent guitarist who wants to make big goes throe PAIN and when he becomes popular that same pain engulfs him so much that he doesn't know how to handle it! Credit has to be given to the director for creating two wonderfully unique halves that are so diff from each other! The first is about the wonderfully tender relationship between Janardhan and Heer. Its so innocent and realistic that the first half flows as faultless as a river! About the heroine Narghis Fakhri i agree she has been the real letdown in this film but her acting was not bad as such she was shown up by the Beast of an Actor opposite to her who was living the \"Role of his Life\" in Ranbir! Second Half: Now coming to the second half the half which many did not like. It speaks up about the ordinary guy in \"Jordan the Star\" wanting for thing to be as simple as it was when he wasn't a star! Its complex i agree and it glorifies a lot about Infidelity which is still \"The Unspeakable\" when it comes to Indian Cinemas! But its brave its new and it definitely touched me! I have seen countless movies brilliant till climax and faltering in it and when dealing with a movie as complex as this i could see Imtiaz coming up with 100s of ending for this but in the end he played to safe made it a musical tribute to that Janardhan Jakhar inside JORDAN. Advantages of having an open ended climax is that it lets us decide what we want and in the end keeps everyone happy but being brought up with Bollywood the Indian inside us wants the director to end it one way or other another reason why open ended climaxes rarely work in Bollywood! Coming to acting of other cast its difficult to single out anyone in particular because every frame was so dominated by Ranbir but Kumud Mishra ( Katana Bhai) pips over Nargis just because of the chemistry he shares with Ranbir! (Odd to say a third person has more of a chemistry with the hero than heroine but thats the sort of unique film this is!) Now i conspicuously avoided mention about the music till now because the sheer f**king brilliance of ARR deserves a separate paragraph. Now titling a movie ROCKSTAR everything could go wrong with the music but ARR showed us how everything can be made right with it! How every gap can be filled how every untold story can be told and how an untold climax can be ended! Now i surprisingly had the privilege of watching this movie is ESCAPE with English subtitles and that for me made all the difference from making this a nice film to a Masterpiece! Starting from the summary of the hero in \"Jo Bi Mein\" to the mild subtle variations of \"Katiya Karun\" as the lead pair's relationship to the beautiful parallelism in \"Hawa Hawa\" to the wonderful connection between coming of age song \"Sadda Haq\" and the climax song \"Naadan Parindey\" to the haunting back ground musics of \"Tum ho\" and \"Aur ho\" ARR has lived and breathed life in every frame of the movie! I have seen countless Indian movies never have i seen a theater full of audience sing along with every song! Only the brilliance of ARR turned the usually etiquette filled Sathyam audience into a maniacal Rockstar audience! I read in an interview with ARR that he and Imtiaz spent 3 years in conversation about this movie and its music and this kind of movie deserves that depth! As the end credits roll on we see the lead couple romance in all the places they have been since the start of the movie and to have that vision of how to end the movie when beginning to shoot shows Imtiaz's vision! This is that kind of movie which i can type endlessly about the story plot but i cannot do justice to that movie experience you get sitting inside the theater! VERDICT: Another Indian Movie that is too futuristic for its generation, too complex to understand and too Imperfect to be Loved! Another Movie i hate to see get flopped but destined for it anyway! A movie to be watched in a theater worthy of handling its musical nuances and with an open mind. (and with English subtitles for no obs like me!)"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "raxx111",
        "review_rating": "10",
        "review_title": "Typical Imtiaz Ali style movie",
        "review_detailed_main": "For me it was the most awaited movie for this year, especially after listening to the awesome songs. First of all the music, Rehman and Irshad Kamil did fabulously well. The music and songs were totally different from the regular bollywood style.\n\nRanbir was terrific and this was truly his best performance till date. He looked so natural that sometimes you feel that you are watching a live shot documentary or something.\n\nImtiaz Ali's direction as always was very good. He has a different style of making movies and this movie is a great example of that. Though my personal favorite from his lot is Love Aaj Kal.\n\nThe only loose part in the movie was Nargis. She was not up to the mark and some very good scenes and situations got spoiled because of her poor acting skills. And especially when pitted against the flawless Ranbir she looks pathetic to say the least. So, without disclosing anything from the story I'd say its a great movie and you surely can't afford to miss it."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dkgupta493",
        "review_rating": "7",
        "review_title": "Not so good",
        "review_detailed_main": "Direction excellent but the story in second half is very slow."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dilipjatolia-29-628878",
        "review_rating": "10",
        "review_title": "Nice Musical Movie Imtiaz Ali and A.R. Rehmaan is best.",
        "review_detailed_main": "After seeing Trailer Movie looking like as old movies of Ranbir but this movie is surprise package for me. Great acting and great music with nice lyrics...\n\nStory as like old movies of Imtiaz Ali nice and different.....people are telling confusing might they don't have enough understanding.:)\n\nMusic is awesome..A.R. Rehman is best...Lyrics is also good.\n\nBest acting of Ranbir with awesome look of ROCKSTAR Nargis is looking good but acting is OK... Shammi have very short role, we can remember as a last movie of him\n\nAlready watched 1 time bur wanna going for more times... Must watch Movie go and see..."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kunalkhandwala",
        "review_rating": "7",
        "review_title": "Beauty is in its details",
        "review_detailed_main": "In his quest to become the icon of a generation, the bold and awkward college student, Janardhan Jakhar embarks on a journey facing resistance, friendship, dejection and love. Such a metamorphosis takes him from the samosa 'hangout' joint on Delhi's streets to the international stage upon which he passionately performs songs of love, independence, defiance and public outcry for his rights as Jordan. As a young, reckless rockstar, he makes foolhardy decisions, behaves erratic and immature. Yet, when he holds the guitar, his music resonates deeper into his heart and this journey through realizing pain is the premise of the movie. Rockstar's length, mostly unnecessary in its numerous songs and scenic escapades is Imtiaz Ali's indulgence in story-telling where he is relentless. Adroitly crafted to capture every aesthetic element, Rockstar has its beautiful face in Nargis Fakhri, soul in Rahman's music and heart in Ranbir Kapoor's mature acting.\n\nJanardhan's early days with a guitar in hand did not start off too well. He needed inspiration and he was advised to find that in love's parting gift of pain. Foolishly, he tried to convince the college sensation Heer (Nargis Fakhri) who wasn't too happy with his approach. However, the two end up being friends as they find a common ground in culture-defying thrills and youthful mischief. After her marriage to a 3rd party in Prague, newly Christened Jordan is left with his goals of becoming a Rockstar. Facing resistance and abandonment from his family, Jordan lives in the confines of the Hazrat Nizammudin Dargah and joins the sufi singers as well as Hindu bhajans till one day, being fed up, he arrives at Khatana bhai's (Kumud Mishra) home. Almost as an agent, Khatana brings Jordan a break-through with Dhingra-owned Platinum Records to sing in an album which launches him to stardom. With a lot of cajoling, Dhingra lets Jordan join the company's tour of Europe in Prague where he meets Heer and they resume their fun-filled adventures based on her hit-list of things-to- do. An intimate moment between the two spurs the tension in Heer and yet, they continue to meet through Jordan's continuing tour till an awkward moment arises when he breaches her home's security to say his good-bye. For his insolence, Heer rants at him and then he is incarcerated upon his arrival in India. Dhingra takes advantage of all the negative publicity that arose upon Jordan's return with a new album and series of concerts. Thus, in the wake of restraint, a rebel is born in the form of a Rockstar.\n\nEven though the film's music failed to generate a buzz, it finds listeners when it blends into the story-line to beautifully crafted moments that express the emotions. This impact is best experienced in Jordan's dejected, angry and commanding Saadda Haq. In what turns out to be the most powerful song that translates a character's emotions into music, Saadda Haq is a rebel's theme. AR Rahman, Mohit Chauhan and lyricist Irshad Kamil produce this foot- tapping, fist clenching rock anthem that would resonate with many of the youth. Naadan Parindey by Rahman has the longing for freedom and sanctuary whereas Aur ho reverberates the pain and helplessness in the end. Jo bhi main brings out Jordan's amateurish sentiments on his path to creativity. While the other songs provide some meaning to each scenario, they add up lengthy minutes to the film's duration, thus subsiding the overall impact. On top of that, Rockstar is a melancholic movie. After his return to India, Jordan finds out about Heer's terminal illness and while he spends quality time with her, improving her condition, the inevitability is always looming. Add to that, Jordan's reckless endeavors that doesn't find favor with anyone. His carelessness and lack of focus dampen his ambitions. It's when he gets on stage that the magic occurs but that's doesn't happen too often.\n\nIn the acting department, Ranbir Kapoor has driven the movie. Portraying Jordan's immaturity, naivety and rebellious nature, Kapoor brings sincerity to his performance that was required by Imtiaz Ali's comprehensive characterization. He also pulls off the Rockstar persona very well and his defining moment would be Saadda Haq (Rakh saala!). Nargis Fakhri reminds us of Katrina's early days. Dialogue delivery is amiss but her sheer beauty is appalling in both delicate and intense scenes. Her angelic smile overcomes every sadness and warms every heart. Piyush Mishra as Dhingra is so seriously funny! He is a gifted theater actor of whom we need to see more of. Kumud Mishra plays a strong supporting role, correcting Jordan's foolhardiness and re-aligning him to his career which proves quite challenging but he portrays that with realism. Always a delight to watch the Late Shammi Kapoor even if it is for a total of 2 minutes. His calmness and charm have always been unique in his latter years and he commands the screen when he is present.\n\nImtiaz Ali has been among the leading directors of contemporary Indian Cinema and with Rockstar, he showcases his talent in detailed writing, characterization and visualization. The finesse in his work is in the details and he takes you through a lot to notice all of it. The length of the film owing to these details is its major folly.\n\nRockstar may not live up to expectations if there were big ones. Unlike 'Rock On', it won't guide you to living life to the fullest nor will it show you any dark side to the business. All it does is portray the creation of music through the experience of pain. That very journey is what Jordan undertook and rose to unprecedented levels.\n\nPerhaps, even as a film, Rockstar will remain in the field that is beyond the ideas of right and wrong."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rishaustin1",
        "review_rating": "10",
        "review_title": "one of India's successful attempts at making a movie even Hollywood should learn from!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Well-Made Film! Ranbir is Oustanding!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "achraj",
        "review_rating": "5",
        "review_title": "No offence, except music, movie is a garbage!!",
        "review_detailed_main": "The movie kicks off with a scene from the life of Jordan the rockstar who manages to escape a brawl and gets on a bus to finally reach the stage show. As he begins to sing the movie plummets through moments of his past and we come to face the simpleton Janardhan Jakhar (Ranbir Kapoor) who wishes to emulate Jim Morrison. But he isn't the ideal material as he has no heartbreaks and thus Janardan begins the search for pain. His unusual journey brings him to Heer (Nargis Fakhri).\n\nAll hell befalls on the boy and overnight he is thrown out of his house only to emerge years later as the novel singing sensation. What follows next is the story of love and loss for the protagonists as a Jordan tries to find solace in the hectic and somewhat unforgiving life of a celebrity and a torn man.\n\nThe story – 4/10 For most parts Imtiaz tries to tell a story of a love-struck boy who morphs into a singing sensation almost subtly by virtue of his pain. Yet he overlooks a very crucial element while creating the angry rockstar. It is true that pain strengthens the mettle of ordinary men and has the capacity of metamorphosing him into a tough nut but an artist's vessel isn't only composed of pain, it must also have space for the love for his work. Through most parts of the movie we see Jordan in pain and we see him complaining that how much he doesn't want to remain in the hollow tinsel town of fame and yet not once does he praise the power of music that provides him with the opportunity of self-expression. Jordan is thus an incomplete rockstar just like the story itself.\n\nI went to the theatre with the hope of seeing the role of music in the life of an ordinary man. I went with the thought of witnessing a legend in making but all I was offered was a remade dish of Devdas. The movie perhaps would have been more aptly title as a Rockstar's Love Story because it talks more of JJ's love life rather than the experience of rising to a position that bestows a man the power to enthral millions with his voice.\n\nThe story is also a tad overdrawn and though there are moments that move you in the end it's not really enough to carry forward the legacy of cinematic expression of rock musicians that Rock On gave us.\n\nThe direction and technique – 3/10 Once again the cinematography works wonders for the eye. There are scenes that incite you with nothing but visual brilliance and while some actually mesmerise you to the spot. One scene of a fully clothed Ranvir in the bath tub with a flaming guitar and a water line obstructing that in his line of view will stay with you for many days to come.\n\nImtiaz's treatment with sequencing is a tad experimental for Bollywood and it often jumps beautifully between spots on the timeline while synchronising the events lucidly. Sometimes however this can become a little confusing to follow and it has created a problem in the overall flow.\n\nOn the whole however barring the need for a vehement editing to shorten the excessive length the director has put up a strong front when it comes to visual story telling.\n\nThe acting – 6/10 There is one big reason to go watch Rockstar and that reason is living. He is none other than Ranvir Kapoor. It seems that this Kapoor has a bottomless pool of talent from which he keeps on pulling out more and more. For Rockstar, Ranvir is said to have worked very hard but you can't see that on screen. On screen he is not an actor but a man who lives in the celluloid reality. If he shines astutely as the naïve Janardan then he fights, frets and chafes with a genuine misanthropic fury as Jordan. He holds the guitar not as an accessory but with the reverence it deserves and displays the various moods of the character with an effortless grace. Kudos to the actor he has evolved into and I hope he delivers such mindblowing charisma in years to come as well.\n\nNargis as Heer is pretty and lovely but at times unconvincing on her own. Yet whenever she is coupled with Ranvir she gels with him perfectly (wait till you see them kiss! It's kind of too real to fake).\n\nNo complains about the rest of the cast but you will probably not be able to recollect anything about them after the movie as the entire space is taken up by the 'Negative Rockstar' and his muse.\n\nThe music – 9/10 You can't put A.R. Rehman with a musical movie and not expect something special. Yes if Ranvir is the crown then Rehman is the gem of Rockstar. He entwines hard melody with sufi undertones to create such convoluted feelings of reverent pathos and powerful joy that you cannot help but be deaf to all else in the world around you.\n\nYa if Rockstar is worth watching then it is because we have ears to go with the eyes. The tracks have already aroused a lot of buzz and the music that comes with it is an apt garnishing for the entire mellifluous offering.\n\nThumbs up Mr. Rehman, you rock! So can this Rockstar rock your world? The duo of Ranvir and Rehman sure can and they do so with a lot of attitude (and a certain middle finger showing by Ranvir!).\n\nDirections - 3/10 Acting - 6/10 music - 9/10 story - 4/10 movie = 4.5/10"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dudester-proz",
        "review_rating": "8",
        "review_title": "Imtiaz Ali Best!!!! The real way how love story should be made.",
        "review_detailed_main": "This is seriously Imtiaz's Best film yet!!!! When the movie end, i kept asking myself how is it possible to narrate a story like this... Story wise, absolutely amazing!!! What you guys will see in the trailer is just 1% of the movie!!!! Ranbir Kapoor was amazing too, balancing the right emotions at the right time. Some Amards should be waiting for him now... definitely AR Rahman stole the whole movie with 14 Top charting music!!!! Every Music suits the story every single time. Well he isn't called genius without a reason.\n\nFor me, its the Best Album of the year and potentially the best movie if the year!!!! All Credits goes to Imtiaz Ali for such great story/content."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "gurkirat1989",
        "review_rating": "10",
        "review_title": "It is about a young successful musician how he become successful along with ups n down in love.",
        "review_detailed_main": "Ranbir is committed in his disturbed Desi rocker avatar and his abstention from any intoxicants makes him an idol who wouldn't corrupt his worshipers. Nargis blends divine beauty with lips that jive like she's in the movie, 'Finding Nemo'.Watching 'Rockstar' once is like watching it many times over, thanks to the repeated montages that sporadically recap the film. If you thought being stabbed once was bad, here's what a knife set can do.\n\nThe film drives home an unscientific hypothesis that people who've endured sufferings/ heart break/ loose motions etc will reach their creative best. By this logic, each person in the audience will be blessed with superhuman creativity as they step out after watching 'Rockstar'. Oh, yeah! Yeah! Yeah! go n watch out u cant miss :D :D"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Rehan7",
        "review_rating": "10",
        "review_title": "Un-Indianised, simply brilliant",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "engrumair21",
        "review_rating": "9",
        "review_title": "Rockstar Totally ROCKS!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "neilvincentck",
        "review_rating": "",
        "review_title": "Soulful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "akhaurysaurav",
        "review_rating": "7",
        "review_title": "movie stretched for too long..but worth a watch..",
        "review_detailed_main": "Rockstar starts with an energetic song with an outstanding cinematography.. you instantly fall in love with the movie and your expectations rises.. the only problem in the movie was that somewhere it felt that the movie is being stretched with no actual results.. For people who are fed up of those same old bollywood style of romance timing would find that stretchy part a bit predictable... and quite boring as they would want to see more of that powerful and fully crazy rockstar than a love story which seemed a bit similar to JAB WE MET at places..\n\nNow the best part of the movie is A.R.Rehman's phenomenal music and Ranbir kapoor as the rockstar \"Jordon\"... Ranbir truly lives his character.. He gave meaning to the songs by embedding emotions in them..I am not a fan of ranbir..and i wont be exaggerating if i tell i hated him.. but after seeing this i apologize.. an outstanding performance and not even for a moment you'l feel that he hasn't justified his character..Jordon was full of attitude and yes i liked that a lot.. the music of the movie binds you to your seat overshadowing the lengthy love drama.. People who are madly in love will definitely love this movie.. and those who are fed up of all those romantic melodrama will still love the rockstar part of the movie if not entirely.. My suggestion: Have a go.. and watch the movie.. definitely not the best movie..but still you wont be disappointed.. not at least after the mindless and baseless movies like Ra.One and Bodyguard.."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sjain782",
        "review_rating": "10",
        "review_title": "Best movie of 2011",
        "review_detailed_main": "Watch it for AR Rahman's heart touching songs.\n\nExtraordinary performance of Ranbeer Kapoor.\n\nNargis Fakhri is cute and innocent.\n\nMohit chauhan at it's best especially tum ho song is great.\n\nBeautiful locations of Central Europe are explored intensely.\n\nSufi songs are highly spiritual.\n\nBetter than Jab we met and love aaj kal.\n\nThe best love story in recent time. You will surely fall in love !!! In a nut shell great acting,story and direction.\n\nBest Movie of 2011- ROCKSTAR !!!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "newton2304",
        "review_rating": "7",
        "review_title": "For me .......movie of the year",
        "review_detailed_main": "A first of its kind movie made in Bollywood. really intense acting by ranbir kapoor, who definitely proves himself and got bigger than the KAPOOR legacy. looked fantastic in every getup and costume, everyone was more bizarre than previous one, but still suit him very well\n\nno comments on music as A.R.Rehman is far from reviews. Every Song is weaved in the storyline so beautifully.\n\nSomewhat disappointed with nargis's acting but hats off to ranbir\n\nfor his marvelous performance. locations are also beautiful. and above all a stunning entry of a rock star which is the starting scene of the movie.\n\nOverall a movie with a different perspective and POV of obsession and love."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ajit2106",
        "review_rating": "8",
        "review_title": "Rockstar- Poignant and one of a kind with soulful music and Ranbir's noble performance",
        "review_detailed_main": "Rockstar is an enchantment to watch that how Indian Cinema is up-and-coming with some different subject matter.\n\nJanardan Jakhad(JJ) a regular lad with vehemence for rock music and die-hard fan of Jim Morrison goes to an indistinct length. He was recommended by his mentor that to become an eminent artist there must have occurred a catastrophe and pain deep in heart. The efforts to break his heart are very funny with some witty dialogs and great body language by Ranbir.\n\nEventually Nargis Fakhri's screen presence is a cool breeze, she is striking but lacks in the acting skills. She missed the expressions and unable to deliver nevertheless having a counterpart role.\n\nThe supporting cast has done very well, special mention for Kumud Mishra (Katara) & Piyush Mishra (Dhingra).\n\nThe first half of the movie shows the character development of JJ with some fine moments of mirth and splendid cinematography. However, the second half drags a bit with some no obvious reason deeds.\n\nRanbir adds a new feather is his cap with outstanding performance. He shows a great potential in every movie with a different shade. He is going to take the Kapoor's legacy to a whole new level.\n\nUltimately, the Music, given by our own Oscar winner A R Rahman, is exceptional and soul of the movie. Every score is blazing with the correct situation. Rahman is a genius and kudos for compiling such stupendous music which will remain in our hearts until the world ends.\n\nImtiaz Ali has given us some fantastic movies including his best (My Opinion) SOCHA NA THA and with Rockstar he chooses a very fine and daring subject. Waiting to see more from him!\n\nMusic-9.5/10 Acting (Ranbir)-8/10 Story-6/10 DIRECTION & CINEMATOGRAPHY-7/10\n\nFilm - 7.5/10"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Saayer",
        "review_rating": "7",
        "review_title": "Where Ranbir Excels, Nargis Repels",
        "review_detailed_main": "Welcome to the Imtiaz Ali brand of Hindi cinema; recall Jab We Met and Love Aajkal\u0085 Entertainment, high on aesthetics and drama full of emotions and love. Enter Ranbir Kapoor, the most gifted young star with solo hits and excellent track record; recall Raajneeti, Wake up Sid and Rocket Singh. Add to it Nargis Fakhri, an attractive and fresh foreign face and recall the success of Katrina Kaif and Giselle Montiero. Add to this the last appearance of Shammi Kapoor and fantastic music of A.R.Rehman\u0085 you book the tickets in advance, buy pop corn and enter the theater with very high expectations.\n\nRockstar is the story of Jordan or JJ, a small time singer wanting to make it big on rock music scene and his love story with Heer, the classy girl from his college. It's a tenderly told anecdote of complexities of human nature and its frailties when it comes to choosing between wrong and right or love and celebrity. Interestingly, at no point, unlike other love stories, Imtiaz wants the audience to portray high moral values of the lead pair. In fact, they have imperfect personalities resulting into a flawed relationship with no possible explanation and that's what makes the whole deal realistic. It is packed with some power house performances by the lead characters and some beautifully crafted scenes like the one where Jordan leaves his contracts and is found sitting among prostitutes in a red light area singing to them and says that's what he always wanted. One of the strongest points of the film is the fact that music has been artistically entrenched in the story and last but not the least, humor is genuine and amusing.\n\nBut the question still remains; does it deliver as per expectations? the answer is no. Mainly, because it's fiction and fiction demands more logic than reality, biographies or documentaries. The treatment, despite being poetic and beautiful, keeps the focus on one person's personality, making it look like a true story of a real life character which its not. At several points Imtiaz Ali deviates from logic taking creative license granting which varies from genre to genre. Ra.One loving audience would give more margins than Love Aaj Kal loving audience. Imtiaz develops the character of JJ with utmost detail and sincerity but falters a couple of times in framing his career path and his rise. While first 45 minutes of the film are fast and eventful, it starts becoming slower as it progresses and second half hardly moves the story. Also, the pair's reunion scenes leave much to be desired.\n\nImtiaz Ali's experiment with Nargis Fakhri also falls flat. Nargis has serious dialogue delivery issues and goes over the top on quite a few occasions which are not Imtiaz Ali film traits. Her age also shows when she is playing a college student etc. Female lead of the film being bad can be perilous, however, the rise of the inexplicably charming Aditi Rao Hyadri in supporting cast saves the female side of the show. She is natural, beautiful and has excellent screen presence. All the more reason to look for her pairing with Ali Zafar in London, Paris, New York as her next. Piyush Mishra does an incredible job as you would expect from a man of his talent. Other supporting cast is also very good, especially Kumud Mishra as JJ's agent. Shammi Kapoor is in a brief role but is unforgettable. Graceful, respectable and heart warming. Very convincing indeed.\n\nThe film totally belongs to Ranbir. What an absolutely wonderful performance. Just a couple of years in the industry and he is already in a league of his own, much ahead of Imran or others. I hate to admit that he is even better than my personal favorite Shahid Kapoor and his results are also showing the same. It was a complex role but the ease with which Ranbir has carried it can give Aamir Khan run for his money. The image and persona of a rock star fit Ranbir perfectly and he pulled off the attitude and music in style. Champion, I'd say. Impressive.\n\nOne more impressive unit member is Anil Mehta behind the lens. Fantastic camera work from the veteran. He has bettered his previous best Lagaan and HDDS by a huge margin. Light treatments in on-stage performance scenes is remarkable. Close-ups are detail oriented.\n\nImtiaz Ali the writer has written beautiful character sketches but hasn't left much in the story. Several ends remain open when the movie finishes. It appears as if he had a much more vivid picture of the script in his mind than he was able to tell the audience. As a director, he has handled the film with sensitivity and understanding but leaves the screenplay loose. He does get out best performances from his team but probably deliberately, gives a bit of a documentary touch to the film in the middle hour. Duration could also be shortened by 15 minutes or so. Alternatively, that time could have been used to give a view of Nargis's background or history which was virtually absent in the first half. There are weaknesses in how he handles the medical issues lead characters face.\n\nDespite the points mentioned above, it still is a beautiful film and worth a watch. In most likelihood, it's the kind of film that will grow on the audience in multiple watches and has in it to become a long run cult classic. On a stand alone basis, its much better than several films produced this year, however, if you ask the questions like is it as good as Love AajKal or Jab We Met, definitely not as those were very universal movies and this will suit select audience. From Imtiaz's perspective, its more like his directorial debut film Socha Na Tha which despite being a beautiful film, lacked the excitement. Imtiaz's next should be a step further not backward."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Herag",
        "review_rating": "3",
        "review_title": "Badmash Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vineeet-singh",
        "review_rating": "10",
        "review_title": "Entertaining, surprising somewhere, superb acting, one of the best cinematography, crazy music !!!",
        "review_detailed_main": "The concept of presenting the strength of music has been totally upgraded and has been lifted to a great level \u0085 A R Rehman has proved and ensured that not always audience can take a break during any song sequence in Indian/bollywood movie. I would love to see a live 'Sadda Haq' of Mohit \u0085 Duet of Rehman and Mohit in 'Kun Faya Kun' & 'Nadan Parinde' deserve top marks.\n\nI didn't went for this movie with any great expectation but the direction in first 10-15 mins of the movie gave my money back \u0085 rest was just free of cost world class entertainment.\n\nVery first thing I did after I was back from the movie was I checked the profile of Imtiaz Ali. What a direction and script Mr. Director \u0085 :)\n\nIt might not appeal to masses but is surely a feast for music lovers and phenomenal acting (as in how well a character can be presented). It was like Rocky on adrenaline \u0085 not a single moment in the movie was getting drown down \u0085 one perfectly executed script.\n\nI was fed up with all those Hollywood remakes \u0085 but this presentation was really impressive. All stars to Rockstar...!!!!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "anasuget",
        "review_rating": "10",
        "review_title": "Deserves 11 out of 10.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ramesh-roey",
        "review_rating": "8",
        "review_title": "Celebration of 'look within' process",
        "review_detailed_main": "When the Rockstar's trailer was released. I was blown away by the frames that speak louder than everything else. Kudos to those who edited and reedited the trailer with such a sharp mind that one wants to watch it over and over again. I have gone through many interpretations of the trailer to satisfy my curiosity; I expected (as usual) something vibrant from the film.\n\nThe film starts with rock concert where people are celebrating the 'Rockstar Jordan'. This Rockstar, who kicks some cops and gates, comes on the stage, and then first cord of his guitar takes you to the flash back. Janardan Jakhad (Ranbir Kapoor) is the ordinary youngster who fascinates about big Musicians. He wants to make it big with his guitar but as they say, college and confusion comes together, he is not sure how and what to bring out. Rockstar is all about the 'look within' process, an ordinary guy conveys his 'look within' process through the music. Love of his life triggered that process.\n\nIt's about the chaos that surrounds you, you always try to make meaning out of it and unfortunately we end with our own interpretation which is backed by the conscious ego. Jordan is not the different, He is very true with his 'own' that people starts relating with it. We always comfort the idea of 'be yourself' by being in fascinating moment. You will be astonished by the thought that Imitiaz Ali wants to say which slowly grasp your mind and makes you part of it. The heart of the film is Ruby's poem about a place where 'unconditional love' exists.\n\nThe film offers a lot of metaphors that makes you part of it. Janardan can't sing and play his music in jammed environment of studio, but effortlessly he composes his music with Shehnai maestro (Shammi Kapoor) who recognised him as a free spirit. How anyone can controlled your 'within' when you have at urge to bring it out.\n\n'Jok bhi mein keh na chaho barbad kare alfaz mere', this is nothing but desperate attempt to connect with yourself.\n\nThis film tries to organise the definition of the Love. This film conveys that love comes with no restriction, responsibilities which are difficult for someone's appetite. Imtiaz Ali brings his signature madness of 'Jab we met' and 'Love Aaj Kal' in this film. But he has forgotten to fill those plot holes, where this Rockstar randomly meets his love of life on the street of Prague. (This sequence reminds me recent disaster 'Mausam' where randomness was constant) and the TV reporter who out of the blue wants to find about this Rockstar. Imtiaz Ali used non-linear story telling format to organise the story but unfortunately that weakens what he exactly wants to say. People will watch it again and again because of AR's music that calms you and makes you thoughtless for a moment. Ranbir had a chance he has proved it. Ranbir conveys character's emotions and metaphors. He switches his roles perfectly as a troubled Rockstar who yelled at reporters every other time and as a lover who doesn't give damn about anything else but his love. As we all know Imtiaz's love for firangi gal, Nargis Fakiri fails to synchronise herself with her co-star. Imtiaz Ali surprisingly avoids melodrama and come with the ending that will allow you to fetch your own interpretations. This kind of ending that doesn't give full stop to storytelling and story viewing experience.\n\nThe movie that itself talks about beyond the wrong and right, I don't want to judge this movie on the grounds of film-making rules.\n\nThis is my love for this kind of cinema."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "magadalwarmayur",
        "review_rating": "10",
        "review_title": "A cult classic in modern era",
        "review_detailed_main": "This movie didn't got it's due credit. Everything in this movie was too notch I haven't seen movie like this too now 2019"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "Rockstar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Queen_of_pentacles",
        "review_rating": "6",
        "review_title": "She loves me, she loves me not..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sumit-bag24",
        "review_rating": "8",
        "review_title": "ROCKSTAR\"-Saddaaa Haq \"",
        "review_detailed_main": "ROCKSTAR\"-Saddaaa Haq finally after a long time Bollywood Present just gr8 movie. Just An Awsm Movie This Is calling Must watch movie if u don't watch u miss really Gr8 make by Imtiaz Ali boss rock & Music hmmmmm just tremendous work by A.R. Rehmaaaan ,& mohit Chauhan Rock And Also Ranbeeeer kapoor doing such a fabulous acting i think this is a limit. imtiaz ali set a scale for all the director's Spectacular story & way of screenplay direction , timing of songs,location, costumes,looks,mekup every thing in just an awsm way. MUST WATCH IF U Don't LIKE MOVIE I PAY FOR IT , Promise Don't miss . rockstar is a film made once in a lifetime I thoroughly enjoyed this journey of making of a Rock star. This movie is not about making a right statement to society and not to follow the footsteps of protagonist; it's about how much pain it goes in making a real Rock star that makes everyone feel on the cloud when he couldn't ground his foot correctly. Movie is dark in nature and this is about an anti hero Jordan who don't have sense of righteousness and he vents out his anger in form of music, a picture perfect depiction of a rebel Rock star to the core.\n\nWatch it, if you are in for dark movies. Don't expect any Bollywood masala but an intense tide of emotions throughout."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vibhordhawan",
        "review_rating": "7",
        "review_title": "Musical Bonanza",
        "review_detailed_main": "People may call it a CHITRAHAR but I really liked the way songs become the essence of the movie. And it is expected out of a movie which is on a rock star. Though songs vary from classical to Indian Rock but the songs are awesome all of them. A R Rehman is at his best with the variety and the freshness of the songs which become an instant part of the play list. Apart from that acting of Ranbir Kapoor is mind blowing. Never in the his career have I liked his acting as much as I do in this one.\n\nNargis though very beautiful is a sort of blemish in this movie with a pathetic acting display. The plot is okay but the best part is the feeling of Indian Rockstar which is like a fictitious figure and very well portrayed. I will give 5 star to the songs and additional 2 stars for the acting of Ranbir."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sai-vineet",
        "review_rating": "10",
        "review_title": "ROCKSTAR - Powerhouse Performance by Ranbir Kapoor",
        "review_detailed_main": "What A Powerhouse Performance by Ranbir Kapoor. Yes the genes/legacy do matter. Son of Rishi and Neetu, Grandson of Raj Kapoor, Great Grandson of Late Prithviraj Kapoor. I take A Bow. It is not easy to carry the Burden of Kapoor Khandaan's Legacy on one's shoulders. Kudos to Imtiaz Ali for direction and writing a Role of Rockstar which fitted into Ranbir Kapoor to A 'T'. A. R. Rehman - Sir I need not say anything about your Music. Brilliant Camera-work by Veteran - Anil Mehta. Nargis Fakhri is refreshing and mint - fresh, but need to work more on her Acting and Expressions. Aditi Rao Hydari and Shammi Kapoor too are good in their Roles. Dhingra's Role assayed by Piyush Mishra is Top Notch and has Negative/Scheming Shades. Negative Chalta Hai -- \"Jordan Negative\". Editing by Aarti Bajaj is Crisp. The Movie and its climax lingers on Audience mind even after leaving the Theater. Songs - \"Sadda Haq\" and Nadaan Parindey are Exceptional and Outstanding and take Rockstar to \"Rockstar\" Level."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "suttamshlok",
        "review_rating": "7",
        "review_title": "Rockstar - A Poignant Journey of Love and Artistry (7/10)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "lethalweapon",
        "review_rating": "4",
        "review_title": "Not worth the hype. An average movie with a jagged plot line",
        "review_detailed_main": "Disappointed. Not that it is a bad movie, but it definitely doesn't justify the hype and praises it had gathered. It's the story of Jordan, a socially awkward wanna-be musician who cribs about not getting the right opportunity or the harrowing/ painful circumstances of life that would bring out the true artist in him. On the way, he meets high class socialite, Heer, who is engaged to be married and taken away to Prague.\n\nThe story then focuses on the atypical love story that takes the characters out of the typical Bollywood comfort zone.\n\nThe movie is poorly constructed. The severely jagged plot line tries to go back and forth in time without rhyme or reason, and further fails to develop the characters properly. Jordan's ascent into rockstardom is skimmed through... No, it's ignored almost completely. It would have been disappointing if this ascent just happened off-screen, but it's actually worse - The character change within Jordan - (from a meek dreamer to apparently selfish and indifferent) - seems to predate his stardom, and with that attitude, success in the music business is NOT something to skim over. The rise needs an explanation.\n\nEspecially when you consider that his passion for music is not really highlighted in the movie, you can't just gloss over his growth as 'And then suddenly, he becomes a star'. It doesn't flow well.\n\nThe music score of the movie has also been applauded far and wide. Personally, other than maybe a couple of songs, I didn't feel there was anything special about that either. I am tempted to say don't watch the film, but apparently, a whole lot of people liked the movie, so you may too... Maybe it's just not a movie for me."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "connoisseur_movie",
        "review_rating": "8",
        "review_title": "Rockstar's Love Story",
        "review_detailed_main": "Rockstar was one of the highly anticipated movies of 2011 and its popularity had risen more so because of the extensive publicity carried out by stars of the movie.It lives to the expectation leaving audience in awe with a outstanding performance by ranbir kapoor,a.r rahman splendid music,nargis fakri's charm and imtiaz ali's vision ably supported by other actors. It is one of most aesthetically shot movies which just mesmerizes and depicts an emotional tale of a rockstar's life in between all the hysteria and sensationalism,hencepresenting one of the finest love story which should inspire and mark the beginning of creating honest and original piece of work for other filmmakers which should be encouraged by audience as well.\n\nMust watch for music lovers which will leave you craving for more and applauding it eternally.Also for ranbir kapoor fans who will observe tremendous growth in him as an actor and cherish it."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "krnmarwah",
        "review_rating": "8",
        "review_title": "Out of the box! and Amazing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sendfeedbacktosanhita",
        "review_rating": "10",
        "review_title": "A Movie to Be Remembered for Years",
        "review_detailed_main": "Rockstar is about destiny. A human dreams to achieve a goal. Then s/he pursues the goal through various queer alleys of life. Touching the goal realization comes that the goal has been changed and/or lost in course of pursuit. Either s/he becomes aimless or sets in another pursuit for something missed in the obsession of previous goal. Then pursuits go on. The human keeps wondering from a goal to another goal. Thus her/his destiny is defined. Rockstar is not about becoming a rock star; it is about shaping destiny of a common man with trendy passion of becoming a rock star. He used every means he knew, and suggested to him by his critics - sympathizers, friends, mentors, snobs, judges and arrangers of competitions and shows - time and again. When he was summoned music barons he abstained from taking opportunity towards accomplishment of goal. Because he, following dictates his consciences, preferred to attend a friend's wedding as previously he tried to use her as means of achieving his goal. Though ambitious to be a rock star, the common man was simple, honest, peace-loving person. He was not really in love with the beauty of college campus, who was referred, by boys, as \"heartbreak machine\". Actually wanna be rock star wished to experience heartbreak in order to become a rock star, thus using the beauty to achieve his goal. Beautiful girls are habituated in facing loads of lovers since adolescence and by the time they are in college they acquire maturity and style to crack a whip on emotions of the lovers. So wanna be rock stars endeavors ended as soon as it began in pursuit of a heart break. Only the descent entity within the wanna be rock star became conscious in the girl's presence. The sobriety of the girl recognizes the sobriety of the boy. They became friends. So he prefers to be at friend's wedding instead of attending music companies. The association with wanna be rock star make the girl discover a boy free from taboo, machismo, chivalry and social dictates with whom she enjoys freedom. Obviously, the girl fall in love with the boy. The boys realization came much later. After, he had first been forced to join family business and learned to keep himself engulfed in chores and consequently, he had been humiliated and uprooted from his home by his brothers, he was blessed with idol hours to sing aimlessly and endlessly listening songs at a shrine, his grief from shocks of uprooting was healed; he found a way to earn by singing at religious and social ceremonies; again got spotted by the music producers and earned favor of and recommendation from an renowned classical musician who spotted him singing at shrine at his first album was released with some reservation from the producer. He became eminent, alone and in moments of enjoyments he started remembering the days with girl, started longing for her and seeking consolation by association of girls from surrounding crowd and lamenting in secret for bereaved love. Then the first chance to be close with his love again made him compromise with the material world. Then he achieved his love though taboo already tore the girl's life. Their life became an turmoil. The girl dipped to fatality of death in grief, repentance and struggle of suppressing love to honor social dicta. The boy scattered his love in substitute. He became popular for his art and an eyesore for all in business with him - his only relations in the world. He lived an arrogant life crying for freedom from all rules, overwhelmed in grief of unaccomplished love, death of unborn child in an unsympathetic fraudulent world bound by rules, negotiations, compromises and betrayal. Rock star is a commentary of humiliations on a journey to artistic freedom. In portrayal of the characters by Mr. Ranbir Kapoor, Ms. Narghis Faqri, Piyush Mishra and Kumud Misra are remarkable. The music is beyond any appraisal. If the trailers came up with the scene of guitar burning, viewership would have been enhanced. But a wrong promo cannot make a film failure. Human can fail, but humanity never fails. The film may fail but the message it carried is an eternal success."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dradilmehmood",
        "review_rating": "9",
        "review_title": "Nargis Fakhri ruined what could have been an Epic !",
        "review_detailed_main": "I just finished watching the movie the 4th time in a month. Just because i am an intense person and i like intensity in life. i loved the movie because of Ranbir's portrayal of intensity. Ranbir is brilliant. no words for his praise. Music is outclass. Direction and editing is wonderful\n\nBUT .....\n\nImtiaz, the director, chose the absolute worst option for the lead female. The intensity in the female role was nearly as important as the male one. there was a lot of room for emotion and acting. but Nargis Fakhri ruined it. she can not act. she is horrific. In scenes where everything is intense, Ranbir is on his peak of emotions, music is outclass, this young lady will make you laugh. She has ruined every scene she has been in the movie. She should never be allowed to act in front of the camera after this. She is better of a model.\n\nHad it been any good actress, (and there are plenty) who should have complemented Ranbir, the movie would have been even better and much more popular than it is now..\n\n8/10..\n\n*continues to shake his head*"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "anustup_eb",
        "review_rating": "",
        "review_title": "'Rocking' passion play",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "karthikananth87",
        "review_rating": "7",
        "review_title": "ROCKSTAR - Ranbir's entry to the elite league",
        "review_detailed_main": "A lot of us were really looking forward to watching this movie mainly because of A.R.Rahman's music. The Mozart from Madras had the world taken by storm by providing an album that encompassed music from various genres and feel.\n\nThe Question: Did the movie live up to the expectations? My Answer: Kind of....\n\nPOSITIVES!\n\nA.R.Rahman's music was already a mass hit...but the background score was stupendous.... Mohit Chauhan's voice was the perfect choice for Jordan (Ranbir Kapoor).... The 'Sher-o-wali Ma' track reminded me of the freshness displayed in the \"Iyappa\" track from the movie Boys (Tamil). Also, all the songs in the album have been given to perfectly match the on screen situation.Whether it is the freshness in Phir se Ud Chala, Joy in Katiya Karun, Darkness in Aur ho, Desperate Hope in Nadaan Parindey or Anger in Sadda Haq...... A.R.R proves that he is a class above the rest.\n\nRanbir Kapoor definitely!! The Kapoor kid has issued a stamp of authority with his mature portrayal of Jordan....a character that previously goes through many transitions due to the high's and low's of his life..... from a simpleton musician Janardhan Jhakad (JJ). We see 2 very different Ranbir Kapoors in the movie. Also, he carries simple scenes with natural acting rather than supreme overacting displayed by many of his current competitors. He could have screamed a little less at times...but still...on the whole...a performance worthy of a filmfare award.\n\nCamera-work and Cinematography was great.....Superb locales and unique shots have become a common criteria for films to focus on, in order to cut competition... but the camera-work for songs like Sadda Haq, Nadaan Parindey and Phir se Ud Chala showed that the entire unit was soaking in the nectar of music composed by Rahman. That translated on to the visuals and the viewers were in for a treat. Most importantly, when Jordan performed on stage, the cinema audience felt that they were a part of his concert. To achieve that amount of realistic connection is commendable.\n\nImtiaz Ali has to be given credit for writing this story and attempting to make a movie like Rockstar. Lets face it...it ain't the run of the mill Bolly masala.....neither does it have a widespread target audience. So if Rockstar manages to recover it's cost and make decent profits, everyone will be pleasantly surprised..... But Imtiaz Ali made this movie for it's true meaning and essence.... kudos for that.\n\nNEGATIVES! (Well i did answer \"Kind of...\")\n\nNargis Fakhri did have a new look ..... but honestly the audience gets an overdose of her....her character 'Heer' seems to stall the flow of the movie....Though Heer (in the movie) is responsible for the creation of Jordan the Rockstar, character Heer is mainly responsible for compromising the script and screenplay (mainly in the second half). SECOND HALF RULE! It is an universal but unsaid law....\"IF A BAD MOVIE HAS A GOOD SECOND HALF, THINGS MIGHT WORK, BUT IF A POTENTIALLY GREAT MOVIE HAS A POOR SECOND HALF (Even in relative comparison), THAT AFFECTS THE AUDIENCE ADVERSELY! \" The First half of Rockstar is mind blowing....and the 2nd half just does not sustain the same amount of steam.....things move back and forth.....the audience lose the flow..... the main attraction in the second half is the video of Nadaan Parindey....Also, the movie ends in a weird manner that can be left to the audience's perception...\n\nDirection, Editing and Screenplay missing a few tricks ...... Ali and gang have attempted a different narrating style and the movie tends to move in both directions. Also, songs are edited in portions....tracks used in different places....this formula works well in the first half , but loses itself in the second....can leave many people in the audience confused and irritated.\n\nOVERALL VERDICT! Rockstar is definitely worth a watch but don't go with too many expectations. It could have been great if the second half had more focus and structure. I am giving Rockstar 4 on 5 (Actually 3....but 1 point for A.R.Rahman's genius contribution) Ranbir Kapoor is here to stay!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "nmjoshi123-147-770845",
        "review_rating": "8",
        "review_title": "Ranbir does it again",
        "review_detailed_main": "First things first.. Movie is for intelligent moviegoers those who can appreciate the dark side of life and have tasted struggle. Movie is not for those who are used to spoon feeding and useless unfunny comedies. A very well made neat and clean (though few scenes shows the colors of Jangli Jawani that we all have within) movie and pro-fuses inspiration with its acting, direction, music and expressions. Story till \"Arsh\" from \"Farsh\" is so smoothly picturized like Teachers or JD flowing through food pipe and just giving its kick slowly. It will take you deep in its own world of music and inspiration that you would stop longing for break. Intelligent screenplay in first half makes its mark, causes delight to mind and treat for heart. A true depiction of artist(not star) or kalakaar comes into second half which shows the rigidity of director in the form of \"Jordan\" Negative. Expressions of Jordan show that true director like Imtiaz knows the struggle and pain of human life. Yaa second half is somewhat abrupt for the audience and is not so easily digestible and few can find it neat shots. Last half an hour is like nonstop rock show and music takes the all spirit and screen, tries to overtake duologue's and screenplay. Ranbir along with \"A. R. Rahman\" takes movie to different heights and world where nothing is right and nothing wrong, just only soothing and eternal sound which touches the right chords of soul. Rockstar Rocks"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "faisal_khatib",
        "review_rating": "7",
        "review_title": "Rockstar as a musical journey excels with some fantastic acting and mesmerizing music.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "deebejac",
        "review_rating": "9",
        "review_title": "A MUST WATCH MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Abhastiwari",
        "review_rating": "7",
        "review_title": "Rockstar : A different and good watch",
        "review_detailed_main": "Story of struggle and passion of of a wannabe rockstar, from college to the big stage. First half of the movie is fun-filled and entertaining. The second half of movie is a bit monotonous according to the demand of story. Story narration is quite impressive at most of the time, apart from the switching between present-past, this switching was much good in 'Love Aaj Kal'. Ranbir Kapoor has done fantastic job, a true rockstar starting from the innocence in the opening reels to the arrogance in the end. Actress, Nargis Fakhri has also done true justice to her role.Just go for this movie for entertainment with no expectations as hyped.\n\nWhy to Watch: Ranbir's acting , Nargis Fakhri's acting and beauty , A different angle to love story\n\nWhy not to Watch: Not upto the much hyped expectations."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "So...the best way to become a huge star is to first become a total jerk??!!",
        "review_detailed_main": "I can see from the high IMDB rating and all the positive reviews that a lot of folks absolutely love \"Rockstar\". Yet, despite everything, I didn't enjoy the movie much at all. To me, it seemed very cliched and I had a hard time caring about the leading man and his 'plight'.\n\nJordan (Ranbir Kapoor) is a nice guy who wants to make it big with his music. Unfortunately, he seems to be getting no where...until a friend advises him that to be a great artist you need to suffer and experience life..and he's always had it too easy. At this point, Jordan acts very creepy. He sees a lovely dancer, Heer (Nargis Fakhri) and begins stalking her unmercifully. So what does she do? Yep, she decides that he'll be a fun guy to hang around with...at least until her upcoming wedding. So the pair go slumming and have a few laughs. Weird...huh?\n\nSome time passes. Heer has married and Jordan has suffered enough that he's gotten noticed and is finally an up and coming rock star. But, as you'd expect, Jordan is smitten with Heer and cannot enjoy his new-found fame. So, he makes sure to go to Prague on tour....because SHE is there. The pair once again pick up where they left off, but Heer seems very ambivalent. At times, she seems to want Jordan and other times she pushes him away. Ultimately, he seeks her out at her home and is arrested for trespassing.\n\nThe trespassing charge is all over the media...and Jordan's popularity multiplies as he's now seen as a 'bad boy'. His off stage antics all contribute to this image and he's pretty much a prima donna...difficult and unpredictable. Again, this improves his image and he is now amazingly rich and famous. But he still doesn't have Heer....and he's miserable.\n\nTime passes. Heer apparently is dying and Jordan drops everything to be with her. At first, she rebounds and appears to be getting better. But can his love alone cure her illness or bring him what he really wants? Take a wild guess.\n\nMy biggest problems with the film were that it all seemed so very phony and contrived...he tries to become angst-ridden and eventually does. Additionally, Jordan became so obnoxious during this journey that I also found myself no longer caring about him, his music nor his lady. The film seemed to be angst just for the sake of angst....and I just think that there are many better Indian films out there. Sure, cliches are the norm in Indian romantic movies...but likability...that's what this film lacks....at least for me."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Krunal-Desai",
        "review_rating": "9",
        "review_title": "must-watch for music lovers!",
        "review_detailed_main": "I always thought that Quentin Tarantino is the only filmmaker who deserves to be worshiped. Enter Imtiaz Ali ~ he has literally rocked the art of direction with Rockstar. The no-holds-barred, convention-breaking display of raw emotion took my breath away. Great job rejecting formula!\n\nRanbir is flawless: a fitting heir to Raj and even Rishi Kapoor. (remember bobby?) Imtiaz Ali and Ranbir should split the credit for Rockstar, 60-40%\n\nA R Rahman: I guess this is what won me. The music is extremely original, peppy yet passionate, and memorable!\n\nOn the flipside, the babes (especially Nargis, who's arms and ostrich neck flail wildly out of sync 'with' her dialogues) are passable and even irritating (though I would definitely date whoever the hell the sidekick chick was)\n\nAll in all, a must-watch. I have walked this planet for 31 years and no other movie has given me such extensive goosebumps."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sampadasehgal",
        "review_rating": "10",
        "review_title": "Visual Hangover...",
        "review_detailed_main": "If there is one thing to be said about Imtiaz Ali, it is that he understands love. In \"Jab We Met\" he showed how love works like a medicine; healing, encouraging, giving meaning to your life. \"Rockstar\" explores love as a drug; the pain and pleasure of an intense love, the darks, the depths. Even with the parallel editing that makes this film even more beautiful, you never loose connect with the main character Janardan whose only aspiration in life is to become a \"Rockstar\"; but at what cost?\n\nThe film leaves you in a visual hangover so strong, that it was hard for me to get up even after the credits ended. The film earns credits for Ranbir's brilliant acting, awesomely written script, music, cinematography and styling. And for the cynics who have to pay attention to each and every flaw, please, you have to give an artist his space. After all, as the movie's final message states, its not about what is right or wrong; its about love."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shakeelahmedmazumder",
        "review_rating": "10",
        "review_title": "It lasts forever in your heart if you know what love and loss are.",
        "review_detailed_main": "Rockstar is one such movie that gives you a feeling that you are not really sure how to describe. It's beautiful. It's heart-wrenching. It's poetic. It's for those who have once loved someone and have given their 100% only to be left desolated in a situation from where they can't move on forward. Rockstar is not for everyone. It's for those who have loved and lost."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "abhishek-roy0283",
        "review_rating": "10",
        "review_title": "Love, pain, struggle creates true artist – movie revolves round this thought",
        "review_detailed_main": "Love, pain, struggle creates true artist – movie revolves round this thought. Story starts with an ordinary guy who just want to make big in music, guitar was his childhood passion... as story starts we see a stupid boy namely JJ; camera revolves around some characters for introduction – one of the primary one is canteen guy \" Khatara Bhai \" his role is kind of booster to JJ but in a very typical Haryanvi style - on his advice which is also the base theme of movie that - real music comes from a broken heart JJ goes to woo the hottest chick in college ... Heer ... (full credit goes to Imitiaz Ali and his casting team to get this \"life is beautiful\" kind of gal in movie; Yes she is beautiful, charming and with sexy lips but the best what makes her special in movie is her freshness...she did justice to what she was suppose to do best – \"act\". Once introduction is over story begins – story in a movie is something which is hard to find nowadays some successful examples are – Dabaang, Ready, Bodyguard, Singham etc\u0085 list is lengthy Lets go on \u0085 Now with all the voodoo!!! thing happened between JJ and Heer eventually they become good friends\u0085 strange !!! more over they began to like each other fell in love but were numb ... now this part of movie when Heer and JJ were doing all the crazy things together - is captured in camera nicely , just before Heer's wedding she asked JJ to hug her - the chemistry between these two were visible from that seen onwards... I must say cinematographer did a superb task here...hats of Anil Mehta sahib. Nargis was more special after interval where she was asked to do something more with her acting... shots were intense, no songs no fancy clothes just pure act... to know more about movie go and watch it out for yourself\u0085 The movie was so beautiful that I wished to see more; some scenes are breathtaking and could connect directly with you, there were goose bumps often while watching especially during the song - \"Nadaan Parindey to Ghar Aaja\", songs are weaved nicely to make your experience a complete one; AR Rehman is successful to create magic yet again, some incredible numbers are Khun Faya Khun, Nadaan Parindey, Sada Haq and almost all. Rehman songs are like old wine \"the later the better\". After a long time I watched something which I can really remember for almost a week now, and that's what counts the last movie so special was \"Rang De Basanti\". Some more were there after that like – Guzarish comes on top of mind. There is also a positive aspect from the movie – the nurturing bands in India especially on Eastern Side will get boost up and can make their own history like Jordan. India should get its own Pink Floyd, Jim Morrison and Led zeppelin; Indian versions would be more soulful than western ones. I crossed my fingers. Great movie by Imtiaz Ali and one of the best of Ranbir Kapoor - 20 years down the line he will be proud of doing \"Rockstar\" Regards, Rockstar Fan - Abhishek Roy."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "DICK STEEL",
        "review_rating": "",
        "review_title": "A Nutshell Review: Rockstar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "zabikhan09",
        "review_rating": "6",
        "review_title": "New way of story telling but its all about Ranbir !",
        "review_detailed_main": "The film leaps dispense with starting with a concert in Rome and then flashing back and forth to fill in the back story of Jordan -- named thus by his ladylove. It is a simple, unspectacular tale, sometimes even predictable. Sometimes the patchiness shows. It's a stretch.\n\nImtiaz Ali to take a love story and present it in a manner that's completely different from the cliché Bollywood. Romance, under his creative vision, becomes a multi-layered and presented in unique way.\n\nThe film's crisp and beautiful cinematography makes the screen light up to dreamy sights and the enumerable chopper shots allow a great vantage point to take in the stunning landscapes of Kashmir and Prague.\n\nRanbir Kapoor has evolved as an actor and gets into the character perfectly. It is he who holds the movie while Nargis Fakhri is good as fresh face but her acting was disappointing.\n\nThe movie especially the second half is Boring and is stretched... kept at bay by AR Rahman's grand music, lovely soundtracks.Soundtracks were melodious rather than ROCK which a rock star should actually be singing.\n\nWatching 'Rockstar' once is like watching it many times over, thanks to the repeated scenes and flash back that recap the film. If you thought being stabbed once was bad, here's what a knife set can do.\n\nWatch it if you are a Ranbir kapoor fan and want to experience a new way of story telling."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sreyassudarsan",
        "review_rating": "10",
        "review_title": "Masterpiece!!",
        "review_detailed_main": "Bestest movie and my all time favorite movie of Ranbir"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shivv0702",
        "review_rating": "6",
        "review_title": "confusing storyline but awesome performance of ranbir kapoor",
        "review_detailed_main": "I was looking forward to watch this since the trailer was released and yes, I found the film very entertaining but only up to a certain extent. The weak storyline, confusing screenplay,confusing narrating style. unanswered questions, bad climax are the minus points of Rockstar.\n\nThe film shows more focus on physical attraction and s*x rather than love.\n\nThe storyline is weak and its difficult to find the logic of what's going on screen.\n\nImtiaz Ali's direction is decent in the movie. Rockstar is nowhere near his past two films Love Aaj Kal and Jab We Met.\n\nThe only plus points of the movie is Ranbir Kapoor's palang tod acting and A.R. Rehman's rocking music.\n\nI noticed many people going out of the theater before the movie finishes, which is very sad! The movie didn't connect to many audiences and the emotional scenes can't bring tears!\n\nso its just an average movie and you will find it beautiful to watch. i have given all the 5 ratings to ranbir kapoor. really he did a great job! nargis has to learn a lot. other characters are just normal."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "pathakanish-99007",
        "review_rating": "10",
        "review_title": "I WATCH IT USUALLY AFTER EVERY BREAKUP.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "harjotsandhu",
        "review_rating": "7",
        "review_title": "A great movie...NOT....",
        "review_detailed_main": "I was very excited and wanted to watch the movie ever since I saw the theatrical trailers while watching \"Bodyguard\". Looking at the trailers it seemed that it would be a story of an anguish ridden Youngster who is wronged by the system and is up against it. So, there were a few surprises when I finally got to watch it.\n\nWhat seemed like anguish turned out to be confusion. You would expect some rebellion from a movie where the lead character is supposed to be a Rockstar. Unfortunately there was no Che Guavera moment. Storyline is icy thin and highly predictable. Narrative fails to grip the audience & movie leans on some cheesy dialogue for grabbing attention. Its all the more difficult to categorize the movie as there is no defined development of characters or plot. Its neither a full fledged musical journey nor a love story. Romantic angle is treated with overdose of physical intimacy and is on the verge of Satyriasis. The movie, for some, ends abruptly without any clear indications of whatever happened to everyone. Its a bit crude even you expect that 'Happily ever after' wasn't to be.\n\nRanbir Kapoor(RK) has done some good job and has come of age in the movie as far as characterization goes. Its the failure of the director that the it didn't gel with the narrative. Nargis Fakhri(NF) looks overwhelmingly like Tara Sharma( From Khosla ka Ghosla). Other than how she looks, NF has done great job and looks pretty comfortable on screen. The on screen chemistry between RK & NF looks a bit cold even in intimate scenes but maybe that is what director intended to, to highlight the eccentric nature of the characters.\n\nOnly saving grace for the movie is without a doubt is its Music. A.R. Rahman has done a commendable job and you are left with a number tunes stuck in your head. Mohit chauhan has done a great great job as voice of RK. The voice matches so good that my brother asked me if it was RK singing or some playback. The Songs however fail to carry the story because the screenplay and narrative overlap the past, present and future.\n\nVerdict: Watch the movie if you want to; but you won't miss anything if you decided against it."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rajatsethi",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": "The director was unable to keep the user captured for the entire period of the film. I guess it just wasn't meant to be. The actress Nargis Fakhri was a joke in the film. I wasn't able to relate to her acting at all. Even the good scenes were cut short because of her incompetence.\n\nRanbir on the other hand was quite good, better than his most roles I guess. His acting was good but his co-star was just wasn't able to match him. Some of the scene which were meant to be serious looked fake and comical.\n\nOver all the film was a disappointment, it could have been so much better. Especially as the plot was worthy unlike so many Hindi movies."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "bhanujha-84277",
        "review_rating": "10",
        "review_title": "Truly masterpiece",
        "review_detailed_main": "A movie ahed of its time, ranveer mohit and AR rahman wow"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shizaaa-52350",
        "review_rating": "10",
        "review_title": "The Epitome of Cinematic Art",
        "review_detailed_main": "The movie is absolute perfection, from director Imtiaz Ali's beautiful scriptwriting, and Ranbir Kapoor's portrayal of the character, AR Rahman's unforgettable music and the well planned scenes of H auz Khas and Durga Nizamuddin. The one slight imperfection is the casting of character Heer, Nargis's acting was mediocre and her voice was not fitting perfectly, though her appearance is perfect for the role, her acting wasn't up to par. But overall, can easily vouch with the people that say this is one of the best Bollywood movies. All thanks to the supremely talented Imtiaz Ali. (and the lyrics of all the songs in the album, can't exaggerate this enough! Kun Faya Kun, Nadaan Parinde, Sadda Haq, Tum ho, Sheher mein, Katiya Karun, Jo bhi mein, Phir se Ud Chala and cinematic perfection of the way Hawa Hawa was shot, too damn perfect)"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "csingh-2",
        "review_rating": "8",
        "review_title": "Rockstar - Something different",
        "review_detailed_main": "This is an interesting film to start off with. The opinions are as contrast as they are extreme. Here's my two cents' worth ( if I had a nickel for every time I offered my two cents' worth...well, I should ideally have seven hypothetical cents).\n\nThe movie is clearly an experiment. And as we all know, experiments can go either way. I would give Imtiaz Ali (the director) full marks for his courageous attempt to narrate a complex story in the chosen fashion. I'll admit it was a rather refreshing change to see a romantic/musical tale be told so differently.\n\nI won't go into the details of the story since the movie has been out for more than a week.\n\nThe film, as the name suggests, is almost like a musical. There's no doubt about it. A.R Rahman (and Mohit Chauhan) plays a vital role in making the film what it is. It is surprising how unsurprising it has become that he outdoes himself every time. Yes, I am a huge A.R Rahman fan... but then again, who isn't? 'Sada Haq', 'Jo bhi main' and 'Tum ho' in my opinion are the 'creme de la creme' of the soundtracks of the film.\n\nThis brings me to the next best thing about the movie - Ranbir Kapoor. After already having established his acting prowess in films like 'Rajneeti', 'Wake up Sid' and 'Ajab Prem ki Gazab Kahani' he steps it up to the next level. He is almost as good as Nargis Fakhri is bad. I want to say more good things about his acting but you get the point...\n\nSurprisingly for an Imtiaz Ali movie, the quality of the film does drop in the second half. The narration becomes a little sloppy and the films tends to stretch just a tad. The ending is a little obscure but overall, I don't believe is a deal breaker. Despite its drawbacks and unconventional style, Rockstar works. Definitely a one time watch.\n\nRating - 7.5/10"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dhruvasthana",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Smexy I'm not sure if he is family and I don't have to do that for me 😮 I have given kissi ne kaha ki main se connected to get gold de na mc Donald duck and goose creek SC to love and support na ho to get premium ka matalab yah hai ki bilkul sahi hai bc nath ji ko patr in a good day please see the y la piel I have a great weekend too long and short Like It Op Ekdum"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jasmandp",
        "review_rating": "",
        "review_title": "never before seen great movie ever!!! its a revolution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kartik-sbo",
        "review_rating": "6",
        "review_title": "A Promise,went off-track mid-way.",
        "review_detailed_main": "An interesting & a very brave effort,but u end up feeling that the latter half of the movie just wasn't good enough,given it's such-a- promising first half!\n\nThe way Imtiaz went on with the story was very unique,but there's a fine line between unique & bizarre,& the latter is what has happened in the 2nd half!\n\nRockstar was certainly my most awaited movie of 2011,& i ended up being disappointed,just because Imtiaz has confused the audience of what he is actually showing-a love story,or a life of a rock star.\n\nPerformances: Ranbir,hats off!seriously! One of the most dedicated acting performances I've seen in recent times. & while many(read all) are criticizing Nargis for her acting,I disagree with them. Yes,I agree that there wasn't that much feel in her character of 'Heer',but that was solely because of the dubbing,as Nargis can't speak Hindi clearly.& the dubbing wasn't good enough.Shammi Kapoor's presence lights up the stage!\n\nMusic: Class apart! Soulful! Awesome!! \\m/ Allah Rakha Rahman \\m/\n\nPicturisation & Cinematography: Tremendous!!\n\nDirection: Imtiaz,we all know that you are awesome,but i think u messed up the second half of the movie. The 1st half had it's say. I hope you'll be back with a bang next time! Rockstar was a superb concept."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "MehdiRizvi-7867",
        "review_rating": "10",
        "review_title": "Masterpiece Movie",
        "review_detailed_main": "Each song has a story to tell which Imtiaz doesn't want to portray with the dialogues. When Jordan hears about the opportunity to go to Prague after Heer gets married, the tune of Phir Se Ud Chala starts playing indicating that the injured bird is ready to fly again. In Kun Faya Kun, Jordan finds the solace. Haawa Haawa acts as a prelude to Aur Ho - \"Rani Phir Nau Do Gyaraah, Raatein Toh Iske Aadi, Ik Din Mein Joote Baarah\" & (Rani) Heer flees away from her house during Aur Ho meeting (mating) with Jordan.\n\nIf we go deep, there's a line in Kun Faya Kun which directly relates with Haawa Haawa. \"O Mujhpe Karam Sarkar Tera, Arz Tujhe, Karde Mujhe, Mujhse Hi Riha\" (Lord, help me relieving myself from me) from Kun Faya Kun relates to \"Aazadi De De Mujhe, Mere Khuda... Le Le Tu Daulat, Aur Kar De Riha,\" (Lord, relieve me, take all my wealth and let me go). In Sadda Haq, when Jordan talks about the chopped jungle and asks, \"Main un parindo ko dhoond raha hoon, kisi ne dekha hai unhe?\" (I am looking for that flock of birds, have you seen them?) - he is talking about Janardhan & Heer. THINK!\n\nImtiaz Ali & Ranbir Kapoor's Tamasha has Rockstar's easter egg and I am today years old when I realised this. When Jordan meets Heer in Prague and before they share the kiss, Heer says, \"Point aa gaya hai, rukne wala\" (Our exit-point is here, where we'll have to stop). In Tamasha, Deepika Padukone in the 'line cross' scene says, \"Line bahut nazdeek aa rahi hai\" (The line, where we've to stop, is coming closer).\n\nThe climax proved Ustad Jameel Khan's (Shammi Kapoor) saying, \"Yeh bada janwar hai ye aapke chote pinjre me nahi samayega, ye apni duniya banayega,\" (He isn't your usual caged bird, he will fly away and carve his way). Jordan, while hitting the policemen in the end, shows how he can't be captured, has messed everything up for himself & doesn't even care about it because he has nothing left.\n\nIn a scene where Ranbir Kapoor's Jordan reunites with Nargis Fakhri's Heer after all the drama at her Prague's house, he says \"Guitar jaisi hai tu,\" (You're like a Guitar) and by the end in Nadaan Parinde song, he sees a Guitar burning indicating the end of Heer. She was suffering from Bone Marrow Aplasia and died because she got pregnant with Jordan. This indicates how Heer got better because of Jordan and passed away also (partially) because of him. She was his music, but he was her disease - and both lived forever."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "cyrus89",
        "review_rating": "7",
        "review_title": "Ranbeer Kapoor and AR Rahman make it last forever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shivkantsg",
        "review_rating": "9",
        "review_title": "2011",
        "review_detailed_main": "The world is ready for this movie in 2011,this beyond limit specially songs 1 song equal to whole movie, clearly a masterpiece but the screen play and story is victim of some flaws otherwise everything is amazing. Must watch."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Anuda_",
        "review_rating": "6",
        "review_title": "Good music but the story line is lame",
        "review_detailed_main": "Does he have to ruin his whole life for a girl? Is that the massage?"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Ottawan",
        "review_rating": "2",
        "review_title": "Seems like 2 different people made the first and second half of the movie",
        "review_detailed_main": "This is probably my first Hindi movie review. I don't claim to be an expert in Hindi movies as I only watch 4 or 5 a year. I prefer watching a movie after reading it's reviews. I am not a fan of masala movies. I like Hindi movies that are different. I enjoyed movies like 3 idiots, Mere Brother Ki Dulhan, Zindagi Na Milegi Dobara, etc, because they're not the usual Hindi movie story. Rockstar is not the typical movie story, and hence I was excited to watch it. But about the half way mark it fell apart. Started off as a comedy/drama/friendship story, with a hint of love story, but then it spiraled into something totally different. It's like 2 halves of the movie were made by 2 different people. The last 30 minutes of the movie seemed a little pointless. I won't add any spoilers here but the roller coaster ride of the second half of this movie made me want to just turn it off. But I thought there would be some point to it in the end - there was none. So I'm not critical because this is not the usual Hindi movie because I knew full well it would not be - but perhaps I expected more from the acting, story, a better pace, etc. On the positive side the camera work and music is excellent. The rest was very disappointing."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "raychinmay-89516",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "Disappointed from the female lead because of her acting and on the other hand you will become fan of Ranbir kapoor because of his phenomenal performance in Rockstar His expression, his eyes says alot in the movie Story is good and pretty different Screenplay could be better Imtiaz ali best direction as usual Ar rehman and mohit chouhan duo can directly touch your soul each song has its own taste Overall it's a must watch movie 🍿🎥🎸 And if you are a masala action movie lover and dont like slow and real cinema to bhai fir mat he dekhna🙏"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "emilyhill-48756",
        "review_rating": "10",
        "review_title": "A journey of Desire, Passion, Fame, Pain, Destruction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "indianature",
        "review_rating": "10",
        "review_title": "Beautiful movie - I loved it!",
        "review_detailed_main": "I have just finished watching Rockstar on TV. Without any expectations I might add, not having heard of it before today.\n\nI enjoyed this movie and was engrossed till the end. Ranbir Kapoor put on a superb performance as though the music really was coming from his lovelorn heart and soul. The qawwali scenes in particular, were quite moving. Nargis Fakhri played her role well\n\nThe story line was enhanced by the performance of the actors. Rahman's music was good, even the rock was melodious and listenable though I am not a fan of rock.\n\nThe ending was apt, leaving the sad climax unsaid. I do not want to go into the story here as that would spoil the show for anyone who has not seen this yet.\n\nThis is not a comedy - for those who only watch comedies. It is a human story, sad and dark with several shades of grey.\n\nNot suitable for children. Definitely worth a watch for adults."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ahamedmn",
        "review_rating": "10",
        "review_title": "Best One.",
        "review_detailed_main": "This is the best Musical Romance movie till date. Songs and background score was tremendous. Ranbir's acting was next level. Story and screenplay was out of the world. Imtiaz Ali and A. R. Rahman's one hell of a best movie."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "deepanker-srigyan",
        "review_rating": "",
        "review_title": "Tough to sit for 2 hours and 40 mins in theater",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "anshumanpathak",
        "review_rating": "6",
        "review_title": "My review on Rockstar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "bobbysing",
        "review_rating": "8",
        "review_title": "It rises above the level of entertainment and is like a smashing mirror on our face making us realize our own filthy self.",
        "review_detailed_main": "ROCKSTAR is a winner all the way in the first half and the viewers are sure going to enjoy all the proceedings in its first hour with an intelligent direction, entertaining performances, perfect cinematography, realistic dialogues, believable characters and soothingly supporting soundtrack. Narrated mostly in flashback mode, the film is about the journey of a Rockstar who is basically suffering the consequences of his own indecisive character.\n\nTaking an inspiration from the real-life story of the famous & charismatic Rock-music Icon Jim Morrison, the script takes you inside the complex character of a popular STAR who majorly gets famous for the wrong reasons. The Ranbir-Nargis pairing looks ravishing on the screen with the traces of \"Geet\" from JAB WE MET in the characterization of Nargis. The writers beautifully explain the need of \"Some kind of Pain or Heartbreak\" in order to become an artist in a lighter mode, which later on takes a realistic shape in Janardan's life. The transformation sequences of Janardan becoming the famous Jordon are a treat to watch, especially the qawaali at Nizammudin Dargah and all in-studio scenes of Ranbir along with Piyush Mishra and the great Shammi Kapoor. So till the interval point, ROCKSTAR is totally an entertaining venture with something thrown in for all kind of audiences both in the major and the smaller centers (like the adult movie sequence).\n\nBut all the commercial problems start post intermission where the film takes a drastic turn towards becoming a more enlightening experience than an entertaining one. And that's where most of the viewers are going to find it difficult to grasp as that is nothing compared to anything ordinary or easily understandable. In its second half, ROCKSTAR mostly talks about the inner conflicts of a big star and her beloved who are not ONE at the moment due to their own lack of will of taking the right decisions at the right time.\n\nMoreover, the last 30 minutes of the film and its purely enlightening climax, might be equal to the phrase of\"Upar Se Nikal Gayi\" for many viewers particularly in the smaller centers. Because this very part of the movie takes it to another spiritual level where one gets to see the bitterness in the words \"SEX\" and \"GUILT\" clearly before his eyes, quite shamelessly. And in all probabilities of the world, where people don't like to get serious or listen to something about their own real life in a film, this abrupt and open ending of ROCKSTAR will not be taken sportingly by majority of the audience as well as critiques.\n\nMusically, the track \"Saada Haq, Aithey Rakh\" explains the inner clash & tension of a true artist perfectly. It is well supported by a brilliant camera-work equivalent to the International Standards, a superlative musical arrangement by the maestro (including the singing part by Mohit Chauhan) and some truly great lyrics by Irshad Kamil, which pump up the blood flowing in your body and you feel like standing and saying\"Saaaaaada Haq, Aitheeeeey Rakh\".\n\nHowever, as a true die-hard fan of A.R. Rahman I would humbly like to say that I was really expecting a lot more from this soundtrack of ROCKSTAR. No doubt, it has got the few gems in the kitty but when it's the musical score by Rahman, of a film called ROCKSTAR, made by Imtiaz Ali, then its unarguably logical to expect something extra-ordinary in its each track. The songs other than \"Saada Haq\" and \"Kun Faaya\" need repeated listening to become likable and one can only relate with most of them after watching the film.\n\nIn the performance department, this has a flawless, award winning act from Ranbir Kapoor going far beyond whatever glimpses you may have seen in the promos. Therefore this has to be the movie which Ranbir should feel proud of and only one man would be the happiest person to see this from his heavenly abode\u0085\u0085..his grandfather, the Legendary Showman Sh. Raj Kapoor. And I am sure that if he was alive today, then without thinking about the box office result of the film, he would have announced a big party calling every single person of the Industry to share this fabulous achievement of Ranbir.\n\nNargis Fakhri as Heer gave me much more than my expectations. Therefore even though many friends may have some different things to say about her but I hugely cherished her performance undoubtedly and also must say that Imtiaz does have a special eye for beauties having a foreign link. So I am all game for seeing more of Nargis Fakhri very soon. Further, I simply loved watching one of my dearest legends Shammi Kapoor coming alive once again on the screen in a truly adorable cameo with his enigmatic presence. Piyush Mishra as the Music Company owner is as usual, fantastic along with another great supporting performance by the actor playing Ranbir's friend-manager. Aditi Rao Hydari becomes the victim of a wrong kind of suggestive characterization but Shernaz Patel does well in her short role. Technically ROCKSTAR excels in its Cinematography by Anil Mehta with perfect capturing of all On & Off stage sequences. The same can also be said about its styling and the dialogues, especially in the first half of the film, which straight away remind you of your own college days.\n\nSo with ROCKSTAR, Imtiaz takes you onto the journey into the mind of a Creative Musician depicting his inner pain, love and hate in a splendid way. And in the process he insightfully reveals the truth that Yes, its a blessing to be a Creative as blessed by the Almighty. But at the same time, its also very painful to be there where you are given a different eye to look through everyone like a mirror and can feel the pain like nobody else."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vikaswere",
        "review_rating": "6",
        "review_title": "Not so Rocking.",
        "review_detailed_main": "Friends i should say i was one of those people who were anxiously waiting for the release of this film. But after watching this film i came out to be disappointed. 1st half movie rocks as much as 2nd half of movie sucks. All the director is wanted to show in this movie is a Journey of a Rockstar and a love story. But, quite clearly he failed at both. But i should say this movie is still good in its bits and pieces and also a \"great camera work has been done\". Talking about performance... Ranbir Kapoor has proved it again, seriously a flawless outstanding performance by him. On the other hand, Nargis Fakhri is bad ...but she is very beautiful throughout the film. Music of A.R. Rehman is breathtaking (still, not better then Rock on ). So, at the end i should say that there are moments in the film where you will feel yourself connected to the movie but then again several continuity flaws and a not so good ending of the movie doesn't works out. It is a one time watchable movie and also the movie made in a non-chronological order(Not quite effectively) but you can still watch it because of superb acting done by Ranbir Kapoor."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: one of the most poignant piece of bollywood cinema",
        "review_detailed_main": "Imtiaz Ali understands the love stories to the core but this time he makes two mistakes; first he casts Nargis who need acting lessons and second he allows his indulgence to allow movie to go for extra half an hour. Don't start thinking, that you should avoid this movie. Imtiaz gives his golden touch to first half of the movie and plays the master stroke by casting Ranbir Kapoor as the central protagonist. Rahman's rocking music and Mohit's golden voice are the integral parts of the story and help the movie whenever direction and editing falters. But above all, this movie belongs to Ranbir Kapoor who gives more than a riveting performance. As J.J he is lovable and as Jordan he is irresistible. He makes you feel the pain of being in love in every scene he is in. The movie is packed with witty dialogues and soulful moments. Far from perfect piece of cinema, this is one of the most poignant piece of bollywood cinema. Go and experience the Rockstar from the hands of Imtiaz Ali who keeps on exploring the different dimensions of love."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ashishgautam87",
        "review_rating": "6",
        "review_title": "\"Soul Stirring\" ????",
        "review_detailed_main": "OK i know i m going to get lots of not useful votes but still somehow the movie didn't appeal to me as \"soul stirring\" as to various critics. To start with the first half of the movie is fantastic with tight script and humorous dialogues.Ranbir Kapoor shines in the first half where he tries to woo the lead actress. The first half is somewhat a trade mark of Imtiaz Ali where he narrates a love story with the warmth and soul that seems to be missing from the contemporary Indian movies . Don't get me wrong the first half does \"rocks\" and raises the expectation from the second half and that is where the film falters.The second half is soulless journey of Ranbir Kapoor to regain his lost love . The second half does become lame because of overacting by Nargis who just proves to be an eye candy in the film. Any Indian actress would have been better off than her , at least some soul could be instilled in the character.Ranbir tries hard and can be said to have evolved as an actor.No reason could be sighted for casting international actors when they are portrayed as Indian and could not even deliver dialogues in Hindi. There is enough talent in India that could have done the character with some zeal and justice.All in all I would say its not a very bad film but still its not the best from him.I would still go for \"JAB WE MET \" as his best as found it more refreshing and \"soul stirring\" than this one.I am going for 6/10 just for the entertaining and engaging first half and A R Rahman's music."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "saugatadutta85",
        "review_rating": "4",
        "review_title": "Sends out an extremely negative message",
        "review_detailed_main": "Rockstar is a movie about a confused youth who achieves fame a rock singer. And what all he loses in the process to achieve fame. Somewhere in the beginning of the film, the character Janardhan Jakhar is told that one can be a true artist only if he suffers pain. And he goes about looking for an opportunity to create pain for himself (as well as others around him!). In this process, he tries to woo a girl already betrothed to someone else, knowing well that the drama is going to cause him a lot of pain, and give him the motivation to become a singer! The problem with this film is that it represents the wrong track on which the society thinks. And it gives a very wrong message. After watching this flick, quite a few creative individuals may think about dropping their pursuits. This is the 'Sadda Haq' generation, to quote a song from the film. These are the people who feel entitled to everything on Earth, and make a lot of noise during the TV debates. Unfortunately, the film ends up glorifying such behavior. The Rockstar's behavior and motivations are completely out of place. Nothing justifies that show of rage, or anti-social behavior which he exhibits. Apart from the wrong message, the film suffers from a poor and incoherent screenplay as well. One scene jumps to another, without much co-relation between them. Performance wise, Ranbir Kapoor is good as the rebel-without-a-cause Rockstar, but so would be anyone playing the role. It is the debut of the lead actress, Nargis Fakhri, and it is not fair to have sky-high expectations from her! The music is certainly not A.R. Rehman's best, but the excellent lyrics more than make up for it. The director Imtiaz Ali had shown this tendency of randomness in his previous flicks (Love Aaj Kal), but had managed to keep them intact. Here, he completely loses the plot. The high ratings are symbolic of a similarly confused society that has gone 'out-of-focus' itself. I will go with a four out of ten for Rockstar. Ra.One and Bodyguard are much more entertaining!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "achyutaghosh",
        "review_rating": "8",
        "review_title": "Everything rocked in Rockstar!",
        "review_detailed_main": "It is difficult not to like Rockstar. The movie itself transcends many genres- biography, romance, and musical, and yet retains Imtiaz's trademark connect with modern day youth. It begins when a simpleton is told to find pain to succeed in music, who takes it as a joke at first, and in it search, finds his muse. The intensity of the relationship between the main protagonists and their portrayal by Ranbir and Nargis knocks the stuffing out of other purported Bollywood romances. Their chemistry is sizzling, and both do a stupendous job in making their changing relationship- platonic at first and then intimate, believable.\n\nThe good in the movie is essentially the people behind it. In Nargis, we have an actress who in her very first outing has displayed that god gifted ability to mix sincerity with spice, and us ooglers have an equally ravishing alternative to Katrina. And what a Rockstar we have- Ranbir in probably his toughest assignment yet, plays the titular role with élan- people up North will vouch for the originality of his Jat accent, and he actually gets better as his role becomes multidimensional in the second half- that of a person unconditionally in love with someone unattainable, and a musician trying to find his place in the sun. And then there is this delightful cameo by the first rockstar of Bollywood. AR Rahman's score is worth a million hearings itself- and it would not have been so unless Mohit Chauhan was not singing, oh what talent, what talent (remember Silk Route, anyone?)\n\nAnd then there is Imtiaz who has this rare talent of making ordinary things look extraordinary. The movie itself is a labor of love- like Sanjay Leela Bhansali's Khamoshi, Imtiaz Ali has poured his heart out to make a love story that satiates himself i believe, if not necessarily the audience. I don't know why i like Imtiaz- is it the Jamshedpur connect, or is it because he makes simply beautiful films, which makes you want to be a part of them? In Rockstar we have gorgeous locations- from Hauz Khaas, to Prague, to Kashmir, the scenes stay will stay in your mind for ever.\n\nAnd yet, it is not without flaws. Unlike Jab We Met, I would not look forward to a second viewing, partly because of the movie's inconsistent pace, a 10-15 min shorter version would have made it a lot tighter, and I definitely wanted more of the tub thumping soundtrack because all the songs do not feature in the movie. However, as a musical, and as a love story, Rockstar remains a stellar effort."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "mayurpanchamia94",
        "review_rating": "8",
        "review_title": "Definely should be watched.",
        "review_detailed_main": "11.11.11 was when Rockstar was released and it's been 9 years since but the music album of this movie stays in everyone's playlist and favorite songs.\n\n\"Jab kahin pe kuch nahi bhi nahi tha Wahi tha Wahi tha Wahi tha Wahi tha Woh jo mujh me samaya woh jo tujh me samaya Maula wahi wahi maaya\" The movie no doubt was just a little less than a masterpiece. By Imtiaz Ali, it captures the journey of JJ from a old Delhi boy to a international Rockstar Jordan and his relationship with Heer. A musical twist to classic Heer and Ranja. It has songs, lyrics which mesmerizes and echos in heart. Music is by A R Rahman, nothing more to say. Voice of Rockstar - Mohit Chauhan. Lyrics Irshad Kamil, kya kamal kiya hai. Neha Kakkar should be punished to watch this movie 100 times to understand the importance of Quality over nonsense. Cast - Ranbir Kapoor {real good performance}, Kumud Mishra {started his film journey from here and does will a lot of hearts}, Nargis Fakhri {tried well}, Aditi Rao Haideri, Shammi Kapoor {his last film}.\n\n// Kaaga re kaaga re mori itni araj tose [kaaga=crow] Chun chun khaaiyo maans Kaaga re kaaga re mori itni araj tose Chun chun khaaiyo maans\n\nArajiya re khaaiyo na tu naina more [Araj= Request] Khaaiyon na tu naina mohe Piya ke milan ki aas Khaaiyon na tu naina more Khaaiyon na tu naina mohe Piya ke milan ki aas \"Chitthi daali thi aaugi mai tere ghar , mail bhi kiya tha maine teri ID par? Train ka bhi , lodge ka bhi aake zara bill toh tu dete jaana\"\n\n\n\n\n\nGo watch and immerse yourself in a nice, out of sanity romantic musical which stays and performs."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shabnamkhan-72836",
        "review_rating": "10",
        "review_title": "Must watch!! Brilliant movie.",
        "review_detailed_main": "Brilliant movie, one of the best cinema and the music is just awesome!! Everyone should watch this masterpiece!! I really loved this movie. Ranbir did very good acting and the story is just wow.\n\nI was thinking about it that I wish I could watch this again in theatre and I am so lucky that it again released in theatre. It's a really good movie and I think it's great to watch this masterpiece in cinema.\n\nThe kun faya kun song is peace therapy to ears and soul. Tum ho song is melody and other songs are also great. This is a perfect love story, perfect direction of Imtiyaz and a perfect movie. Happy to watch it again in cinema."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "apexm-23425",
        "review_rating": "10",
        "review_title": "Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kandykool",
        "review_rating": "",
        "review_title": "Not the Bollywood Masala But an EVOLVED BOLLYWOOD",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Good but could be much more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "iamkamransafik",
        "review_rating": "10",
        "review_title": "I have seen more than 1,000 movies, but this one remains the best ever.",
        "review_detailed_main": "I can't express my love for this movie enough. I was only 9 when the movie was released; back in 2011, I didn't know much. But as I grew up, I felt an incredible connection to this film. It taught me that love is beyond everything and is inexplicable. Because of that movie, I traveled to Prague in November 2022. Walking on the same roads where Jordan and Heer walked, I could almost feel their presence. One piece of advice from me: if you really want to experience a love like that, make sure you aren't too exposed to other potential romantic interests. Otherwise, you might not feel it as deeply."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jonnydepth42",
        "review_rating": "7",
        "review_title": "Ranbir Kapoor is the next Rockstar",
        "review_detailed_main": "Here is my review of the movie without giving too much away:\n\nJordan (Ranbir Kapoor)is a wannabe singer who just does not have what it takes to be a rock-star (his colorful shirt/vest combo is also not helping matters). His main source of advice is a small shop/canteen? owner. His words of wisdom are that every good artist has some type of pain inside; a broken heart. So from there Jordan sets out to get his heart broken. The series of events start out comically but in reality the unraveling of his life is set into motion.\n\nThe main moral of the story is to be careful what you wish for.\n\nPerformance wise Ranbir Kapoor is awesome. He has no problem playing a dorky guy in the beginning and then a rebel in the second half. He is fast becoming the next big superstar of Bollywood. Nargis Fakhri is the latest non-Indian actress Bollywood has to offer. She looks good in the movie but acting wise is OK. She seems slightly better than the other import (Katrina Kaif) because she is at least able to display more than two emotions. I am pretty sure Imtiaz Ali would have preferred Kareena in this role but was unable to do so since her and Ranbir are cousins.\n\nA movie called Rockstar has to have good music, and AR Rahman delivers with the best soundtrack of the year.\n\nOverall the movie has a decent story and excellent acting from Ranbir Kapoor but is a bit too long and at times starts to drag."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "apoorvmania",
        "review_rating": "8",
        "review_title": "A musical extravaganza & definitely a fantastic work of art !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Cute love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vjnambu",
        "review_rating": "5",
        "review_title": "Good story and good heroine would have made this epic",
        "review_detailed_main": "Plus: 1. Ranbir Kapoor performance 2. Songs\n\nMinus: 1. Story 2. Message 3. Worst heroine 4. Slow 5. Too long 6. No universal appeal\n\nVerdict: Rockstar would have been a heart touching love story if it had a good heroine and story. Also its message that a true artist comes with pain and suffering is wrong. A true artist comes with passion, hardwork and dedication"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "subhendu-r-mishra",
        "review_rating": "10",
        "review_title": "Awesome music.. Excellent Acting by Ranbir and good story.",
        "review_detailed_main": "This is one of the best Hindi movie that I have seen.\n\nA.R. Rahman's music rocks. Especially Sadda Haq, Nadan Parindey and Jo Bhi Main. Also watch out for the special jugalbandi of Sehnai and Guitar that is filmed on Late Shammi Kapoor and Ranbir.\n\nRanbir is brilliant in this movie. He makes you feel the agony of the character. Nargis has also done a decent job. Also all the supporting characters fit well to the movie.\n\nThe filmography is also excellent. The scenic beauty of snow covered northern India well captured.\n\nAs a director Imtiaz Ali has done a brilliant job. This two step forward from his previous movie \"Jab we met\". I am now a big fan of him.\n\nOverall its a must watch if you are a bollywood fan."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "mayeshaahmed",
        "review_rating": "10",
        "review_title": "A true Masterpiece",
        "review_detailed_main": "Words fall short to describe my feelings towards this movie. Not only the movie technically is supreme, in terms of screenplay and cinematography and sublime direction, but the music and the writing transcends from the screen to your soul. The story is so beautifully told and in the end, you are left absolutely destroyed in emotions and a sense of purpose in life. A purpose to love unabashedly, love without limits and without a care in the word. It makes you realize how love can be so consuming yet sets you free. I have watched a lot of Bollywood movies in life, art films to commercial ones, Ranbir's talent is unmatched. It was so effortlessly beautiful, he could make you feel a thousand things with his silence, with his eyes and with his skills. He is truly the best actor Bollywood has seen, in my opinion. The music is evergreen, THE best music album ever created in any movie industry. The lyrics' depth, the other worldly music, the evergreen voice of Mohit, makes this movie live forever in our hearts.\n\nThank you Imtiaz, Ranbir, AR, Irshad for giving me the best visual experience and a depiction of love that I will carry forever in my heart."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "AMOGHREVIEWS",
        "review_rating": "10",
        "review_title": "H-E-A-R-T-B-R-E-A-K-I-N-G",
        "review_detailed_main": "Rockstar (2011) - 100%\n\nOne Of The Greatest Piece Of Arts To Come Out Of Indian Cinema... \"Rockstar\" Has Many Factors Going For It, But The Biggest One Is That It's Heart Is In The Right Place & For That I Would Like To Thank The Trio Of Imtiaz Ali, A. R. Rahman & Ranbir Kapoor... These Three Geniuses Came Together To Create Something Which I Don't Think Can Ever Be Made By Someone Else In The Future... Masterpiece Is The Most Loosely Used Word These Days, But If There's One Film That Truly Deserves That Tag, It's This One... Irshad Kamil Who Has Written Lyrics For The Film Needs Special Mention As Without His Contribution I Don't Think This Movie Would Have Become A Cult Classic... Its Songs, Such As \"Jo Bhi Main\", \"Kun Faya Kun\", \"Sadda Haq\" & \"Nadaan Parindey\" Are Magical & Take You To A Different World."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "cjha-77936",
        "review_rating": "9",
        "review_title": "Amazing Movie",
        "review_detailed_main": "I find myself in the characters of this story, great movie. I am left speechless after watching this movie. This movie is a story in itself. The unconditional love shown between a boy and a girl is commendable. Every person should love with such passion so that they can never fall in love with anyone again after that and they can never even think of loving like that. And what is that love which falls in love with someone else after you love them, and what is that love which searches for that love in someone else even after loving them. Love them in such a way that you make that person crazy with you, move heaven and earth to make them yours."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "",
        "review_title": "Heartache makes a star ! Really ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "DexAery",
        "review_rating": "7",
        "review_title": "One of the Bollywood's Best....",
        "review_detailed_main": "Bollywood never usually make best movies, the usually follow others idea's or the easy way, copy from foreign cinema, but this film is something different from the typical Bollywood movie. Good foreign locations, fantastic cast and crew, marvelous acting, real struggle of life, fabulous music and the most important thing, the message that not every love story had happy ending. The one thing i love about this movie is the main lead character Ranbir Kapoor I've seen his other movies before this one, and i couldn't believe that he could act like this too. If you gonna love anything about this movie it's gonna be the Music and the acting.... So a must watch movie, if you have a good taste in foreign cinema...."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "zzzoeb",
        "review_rating": "9",
        "review_title": "Beautiful, Spirited and Moving!",
        "review_detailed_main": "The legendary Bob Dylan would have been proud.\n\nThe ace singer and guitarist loved to lament the state of things with his acoustic ballads. However, he was also a moody personality, with little reverence to the managers who fell to their knees, or to the star-struck fans, who rushed at him from all corners. Only difference is that Janardhan Jakhar, aka Jordan, does not lament the state of things. He cries his heart out and with his guitar, sets the stage on fire with his profound agony.\n\nImtiaz Ali's Rockstar is the beautiful , moving story of this boyish, impulsive and romantic performer. It is the story of how a simpleton, who struggles to pose up with his beloved companion- the guitar itself- in front of a jeering audience, transforms as the wild-eyed, angry musician, who has everything for him, but there is something amiss in his life and he complains out aloud.\n\nAnd we listen as well. 'Rockstar' benefits largely from its lead actor, a boy growing up into a man, while retaining that youthful essence and vulnerability firmly in place. Ranbir Kapoor had fascinated us with his idyllic idealist roles in 'Rocket Singh' and 'Wake Up Sid'. But here, his role is not that of the simple, happy-go-lucky youngster. Here is a musician who finds an exquisite melody in his pain. It is a person, who seems to be a man willing to forge his own path, determined for his free will. Yet, beneath the surface, there is an impulsive boy brooding over loss of first love.\n\nAnd Ranbir does it all with such convincing ease, that it is hard to believe how smoothly it goes. From the Simple Simon,sweater clad avatar, who says the wrong things at the wrong time, to an infuriated and melancholic lover boy, Ranbir acts with a dazzling blend of emotions, expressions and confidence that makes his arc so believable that we eventually side up him.\n\nA problem is the female lead in the film. As Janardhan/Jordan's love interest, Nargis Fakhri's Heer is a character that holds potential. Like Geet in Jab We Met, Ali has written a girl who is both free-spirited and vulnerable. However, while I did not expect Kareena Kapoor's credibility and chutzpah, I also did not expect it to be so flat as well. Nargis Fakhri is undeniably pretty, if one can overlook the upper lip pout. However, when it comes to stun us with some sharp histrionics, we get all pomp, no show. Sure, she smiles gaily, as she watches the B-Grade film sleaze in a seedy theater, or gulps down the bottles of 'Desi Daru' with Jordan. But her dialogue scenes seem contrived and strained. And of course, her simpers and sobs further ruin the impact.\n\nBut Ali makes up amply in his supporting cast. Piyush Mishra is alternately funny and vicious as the music industry tycoon, who exploits Jordan's talent and anguish to the fullest. Kumud Mishra has a nice turn as Jordan's understanding mentor Khatana. And yesteryear's rock and roll legend Shammi Kapoor has an unforgettable duo as a venerated musician, who finds that Jordan has It. Ali even lets the two Kapoors dominate the frames in a number of sequences, most notably in a mesmeric duet, the legend with the Shehnai and the younger star with his faithful guitar.\n\nAli has been a master in experimenting with tried and tested formula in his own credible and warm approach. 'Rockstar' is no different. While it is a predictable story, Ali has the ability to make us feel for its characters. Ali keeps most of the characters extremely life-like and believable. He also pens layer cakes of dialogues that are spiced up by ribald humor, naiveté and earthy simplicity as well. There are times, where he grapples with the more mushy and melodramatic moments. However, he amply makes up with his sharp eye and deft hand for detail and nuance. The film surprises and delights us with its nice, neat observations of its characters- from Janardhan playfully doing rounds with black glasses to Khatana's clavicle smeared with talcum powder, as he answers a questioning reporter and from Piyush Mishra's big wig to the pseudo-helpful recording artist, who punctuates, as a music director corrects Janardhan's renditions, with sounds of Oomph, Taahh! As a result, we end up believing in the film despite its more contrived moments.\n\nThe writer-director has showed a penchant for beautiful and show-stopping song sequences as much as for images that capture the ups and downs of young love. Here, he is aided by veteran cinematographer Anil Mehta, whose work spans from the landscapes to the anguish and longing in Jordan's face, and from the excited crowds to the softer and impassioned moments of intimacy. And, miraculously, composer AR Rahman is back on scintillating and superb form. The ace composer has made a worthy comeback with rhythms and melodies that celebrate young love, echoes pain and disillusionment and also voices inspiration and salvation. It is a beautiful work of music and Ali uses it fully to stir and captivate us. You can feel the thump of angst for free will in 'Sadda Haq', feel the mood for mischief with 'Katiya Karoon', feel invigorated and enlightened by the Sufi ballad 'Kun Faya Kun', set beautifully in the Nizamuddin Auliya Dargah and moved to tears by the epic finale of 'Nadaan Parinde'\n\nRockstar may not be a perfect film. Its world is a mix of fantasy and the real world we live in. While Ali cooks up the blend expertly, he does struggle at times. At the same time, it is also a film that, all of a sudden, tugs you in into its pain and passion. And while it may be a bit idyllic like most of the love stories , it is worth watching for Ali's heartfelt, nuanced filmmaking, music that wins our hearts and an actor who conquers our souls."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "chandrabhanusolanki",
        "review_rating": "7",
        "review_title": "Mature Musical",
        "review_detailed_main": "The innocence of pure love, the desire of success, the pain of broken heart and the life happens. Ranbir did amazing job with role of JJ, music of A R Rahman is always amazing and voice of Mohit Chauhan is cherry on the top. Must watch."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rajatawasthi-42057",
        "review_rating": "10",
        "review_title": "Pain, Melody, Love, Passion ROCKSTAR",
        "review_detailed_main": "Outstanding acting! Best music by Rahman sir and Singing by Mohit sir. The film shows direct emotional attachment with the audience & the Music and songs are like Heaven."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vishweshkb",
        "review_rating": "7",
        "review_title": "nice movie with bad acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "meghasud21",
        "review_rating": "1",
        "review_title": "What an awful movie",
        "review_detailed_main": "Confused movie. No story really. You don't care for the protagonists pain by the end of it. I was actually laughing at the stupidity of ranbirs anguish. And the sadda haq part was quite shallow, he was just singing some lines Supposed to have\"some very deep meaning\" but is actually complicated garbage..\n\nIm quite surprised and angry at how many people have loved this movie, because they raise your expectations for such trash. Prefer srk at least hes not pretentious or pseudo intellectual.\n\nStarts alright but it was very tough to sit through the whole movie.The heroine doesn't know the a of acting and I've heard better music from ar rahman. Got a headache by the end of it. It should have ended at the interval point.\n\nDon't watch it ..waste of time."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "nikree",
        "review_rating": "10",
        "review_title": "Actually an Emotion",
        "review_detailed_main": "Rockstar is beautiful and beautifully woven.\n\nThe music is other-worldy and transitional. It stays with you for years and years. And that's the first thing that hits you in the movie.\n\nThe acting is equally commendable.\n\nBut kudos to Imtiaz, for superb direction and making it even more than a cult."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "spranit",
        "review_rating": "10",
        "review_title": "Ranbir and AR Rahman Just nailed it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "abhitaliyan",
        "review_rating": "8",
        "review_title": "Rockstar - FlickyFriday Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rafayrasheed030",
        "review_rating": "10",
        "review_title": "I can't get over from this movie",
        "review_detailed_main": "\"Rockstar (2011) is a captivating journey through love, passion, and music. Ranbir Kapoor's stellar performance as Janardhan/Jordan is mesmerizing, capturing the essence of an aspiring musician's transformation. The film's narrative is rich, delving into themes of fame, heartbreak, and artistic integrity. A highlight is the iconic burning guitar scene, a visually stunning moment that encapsulates the raw emotion of Jordan's musical journey. Director Imtiaz Ali's masterful storytelling and A. R. Rahman's soul-stirring music elevate this film into a must-watch for any cinema lover and for the lover whose love is incomplete. .\""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ghoshi-kol",
        "review_rating": "7",
        "review_title": "Rockstar is hardly rocking. It's just a love story under the disguise of the title Rockstar.",
        "review_detailed_main": "Rockstar is an A.R Rahman and Anil Mehta(cinematographer)film. Ya, Ranbir the entitled rock star, Jordan is hardly seen as a rock star in the film as for most parts he is seen hankering after his girl friend,Heer(Nargis Fakhri)while the latter either reciprocates or rejects his love.So first of all the film's title doesn't seem apt in this case. As far as the rock star effect is concerned Imtiaz should have taken some inspiration from Rock On! but ALAS! Imtiaz's originality becomes the biggest flaw of the film that had a promising premise. Rockstar begins on a feel good note but after all the friendly moments between JJ and Heer gets over the film derails leaving the audience to bear the high dosage of a boring and disjointed script. Secondly, the running time (160 mins or so)is not new in Bollywood but Rockstar sadly seemed to be deliberately stretched that can leave you sleeping.\n\nBut the saving grace of the film is Rahman's soulful compositions about which there is no complaint. But recalling the lyrics of the songs become difficult. Sadda Haq is rocking and well choreographed and so is Hawaa Hawaa while Kun Faya Kun is soulful and Katiyaa Karoon is fun. Anil Mehta manages to hold the audiences intact with breath taking views of Kashmir and Prague.\n\nHowever music and cinematography cannot conceal the loop holes in the plot as the treatment of the script was too amateurish something unexpected from Ali who gave us brilliant Films like JAB WE MET and LOVE AAJ KAL.Sadly, Imtiaz annoys this time.\n\nRanbir Kapoor's performance shows a lot of earnestness but emotions hardly connect with the audience.While he is brilliant in most parts but at times his performance drops heavily.\n\nNargis Fakhri was a disaster.She looks stunning but where is the acting. Dialogues seemed to have been forced through her. Shammi Kapoor was stunning.The rest of the cast was just okay.\n\nCharacterization seemed to be a big problem in Rockstar. While developing Ranbir's JJ as a modern Devdas Ali ignored Heer completely and both JJ's and Heer's character lacked the effect that Aditya,Geet,Jai,Meera or even Harleen Kaur had created.\n\nOverall the film is a decent or average watch. It hardly connects. A story trying to be Devdas fails in it's attempt.\n\nACTING: 6/10\n\nDIRECTION: 4/10\n\nSTORY: 4/10\n\nMUSIC: 7.5/10\n\nCINEMATOGRAPHY: 7.5/10 Overall I rate the film 5.5 out of 10."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "advaitsmom",
        "review_rating": "10",
        "review_title": "Brilliant and true to the bone",
        "review_detailed_main": "Somehow missed watching this movie for a long time and I am glad I did at least now. Rockstar is easily Ranbir's best. Witnessed some hair raising brilliance in his acting. Did he even act or he lived his role? Pure, raw and as real as it gets, Rockstar will make your heart heavy and haunt you for days. AR Rahman's music needs no mention. Simply out of the world, the strings adding to the intensity of each frame and moment. Nargis fakhri, really can't put a finger on what's lacking. Awkward, maybe. But still, that too passes, considering her character. And no error is glaring in front of Ranbir's mind blowing performance. The movie starts with Rumi's poem - \" There's a place between right and wrong doing. That ground - I will meet you there\". What wonderful lines to set the mood of the movie!!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sohamvhadgir",
        "review_rating": "6",
        "review_title": "It's one time perfect watch movies",
        "review_detailed_main": "Absolutely Intense acting from Ranbir Kapoor. One of his best movie I have watched. Many people recommended me to watch it but finally was able to watch and what an exception masterpiece it is. Though when the geniuses of Ranbir Kapoor Imtiaz Ali along with the voice of Mohit Chauhan and music by AR Rahman collides...masterpieces and history are bound to happen. The one who played Khatara bhai also played the role of a supporting actor very well but man the whole movie was carried by Ranbir Kapoor's brilliance what I felt. The cinematography was also top notch. Throughput the movie a lot of time i felt Nargis Fakhri was not at all upto the mark but the wedding scene where he urged Ranbir to hug her that scene I personally felt very emotional and their chemistry on the roads of Delhi while watching movies or the drunk scenes that were really very good and emotionally connecting. I will not praise Ranbir anymore as I feel whatever I say for him will not be enough. His expressions, his passion, the intensity which he displayed truly deserves a bow from, all of the viewers who watched it. Definitely would have given it a 5 star if was not disappointed by Nargis's acting and some other flaws in the acts of some of the supporting actors. I will definitely recommend to experience this masterpiece at least once in their life."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "snehadesai-67232",
        "review_rating": "10",
        "review_title": "Rockstar",
        "review_detailed_main": "Jordan is sitting among prostitutes and strumming his guitar as they sing together -- when his manager pulls him out onto the street. Soon, a crowd engulfs them and starts chanting Jordan's name, their voices drowning the sound of the manager pleading with the musician to get his act together. \"This is what I have always wanted,\" Jordan says, looking at his screaming fans. \"But I am not happy inside.\"\n\nImtiaz Ali's Rockstar is a bittersweet journey of a man, an artist, from being an everyman to a superstar. But while Ali uncovers layers off Jordan the iconic musician -- each layer as fascinating as it is intriguing -- he keeps the core of the character, Janardhan Jakkad, alive. He hurts like anybody else, falls in love like anybody else, and also has to deal with moments of sheer frustration.\n\nAnd all of it finds release in music. Music is Jordan's identity; it's what makes him rich and famous. But to Jordan, that's incidental. In the end, his artistry is what connects him with himself. For a Hindi film viewer, that is a fascinating story to watch unfold.\n\nThen there's the opening shot, a tribute to India's original Rockstar, Shammi Kapoor. From there on, it's a tumultuous ride - one with its highs and lows, one that has anguish as also love, one that has pain, but also a sense of fulfillment. And a brilliant finale -- not a conventional one, but effective nonetheless -- which leaves you feeling like the characters themselves: incomplete but content, like an effective crescendo that leaves you wanting more.\n\nThe music itself is a delight. Each AR Rahman number is lilting, and woven beautifully in the story, the high frequency of songs not hindering the storytelling but enhancing the experience. Lyricist Irshad Kamil does an outstanding job, penning words that reflect the lead character's state of mind and complement situations aptly.\n\nImtiaz Ali, in trademark fashion though, isn't content with Focussing on the complexities of a troubled musician; he gives us a dose of romance too, and a generous one at that. Estrangement from family, lack of fulfillment in life, and self-discovery apart, what really drives Jordan's music is his relationship with Heer (Fakhri, beautiful but awkward). Volatile as the affair is, it's also what keeps Jordan sane, and Heer alive.\n\nFor about 15 minutes in Rockstar, the narrative tends to resort to 'Bollywoodism'; true love having the power to cure a terminal illness (almost), for example, doesn't exactly fit with what the rest of the film has to say. The story tends to meander a bit post-interval, but Imtiaz makes it work eventually, interweaving the fantastical romantic part of the film with the more gritty, dark bits deftly. In the end, how much you enjoy Rockstar will largely depend on whether the balance between the tale of a broken, discontented musician and the more conventional love story works for you.\n\nIt did for me -- though I would have preferred the former -- but you can't deny Imtiaz credit for his mastery over the romance genre. No contemporary filmmaker has dealt with man-woman relationships with as much dexterity. His films often tread a similar path (the lovers are usually confused, meet at different points in life, and there's always the 'other man'), but his fresh approach to each story is what makes them immensely watchable.\n\nWith Rockstar, Imtiaz goes beyond his own tried-and-tested format, his ambition to narrating a more complex story coming through. This is probably his most personal film, and his honesty as filmmaker is hard not to be affected by. Hopefully, he goes the whole hog next, ditching the genre he's adept at to trying his hand at something entirely out of his comfort zone. Rockstar is also Imtiaz's most technically polished film, and he benefits from the association with cinematographer Anil Mehta and editor Aarti Bajaj.\n\nRanbir Kapoor has been Hindi cinema's Next Big Thing for a while now. With Rockstar, he lives up to the hopes pinned on him to deliver big. Ranbir revels in Jordan's complexities; another actor may have found it to be an obstacle. The character arc undergoes constant transformation and he adapts suitably. It wouldn't be an understatement to say that Ranbir's portrayal of Jordan may go down as one of Hindi cinema's most accomplished performances by a lead actor. Just to see him work his magic on screen, Rockstar is worth a watch.\n\nBut while good acting is always an incentive, it's a director's vision that makes a film truly watchable, and Imtiaz makes Rockstar stand out from what the mainstream churns out every week. And brings back the one aspect sorely missing from Hindi films lately -- music.\n\n32 out of 33 found this helpful."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vickykolari-222-154170",
        "review_rating": "7",
        "review_title": "A different world of music..!!",
        "review_detailed_main": "Sadda Haq, Itthe raq..!! Crowd cheer in excitement, a Rockstar stops singing and starts talking.. He says he is searching for Parindey (Birds) which flew away when the forests cut-down into the urban buildings around. He asks the crowd \"Do you know where are those Parindey..??\" And not only the crowd on screen, but also the crowd in Cinema Hall responses \"NOOOOOOOO\". And he continues with Sadda Haq..!!\n\nYet Another successful attempt from Imtiaz Ali and its wonderful. In spite of having some boring and dull moments, movie doesn't disappoint you for sure. Movie is having 3 leads, Ranbir Kapoor, Mohith Chouhan and.R. Rahman..!!\n\nJanardhan Jakhar (Ranbir Kapoor), a talented musician. Having taken Khatara bhai's sermons on art and pain a bit too seriously; lost, confused, mildly stupid, vaguely asexual Janardhan (JJ, in short, Jordan later) goes around looking to get frustrated! Tries to get failed in love, a gorgeous girl Heer Kaur (Nargis Fakhri) dancing at her college auditorium, dil todne ki machine of college, he fails in even that. Then he get to know that girl, Oddly, they do make for great friends. As Heer desires to fulfill all kinds of crazy needs to be fulfilled before her marriage, Janardhan and Heer start finishing the list of desires, like a Light porno 'Janglee Jawani' in Delhi Chandni Chowk's street theater, Desi Daaru and all. Then Heer gets married, moves on. Janardhan gets thrown out of his house by his brothers for using family business money to enjoy time with Heer. The boy finds enough frustration in his life to produce his expressive music is spotted by a shehnai ustad (Shammi Kapoor, as Bismillah Khan).anardhan is by now the incredibly famous as Jordan who is negative personality for public. Will he forget his love?will he move on with his celebrity life?\n\nMovie is totally soulful, it expresses you the pain of an artist as well as a lover, the touchy moments succeeds to bring emotions. Love failure follows a tribute to the Devdas. Movie is more like a tribute to old bollywood love failure movies than story on another Jim Morrison.\n\nMovie is filled with excellent performances, Ranbir Kapoor in one of his best roles, he is a perfect Rockstar, perfect lover, perfect Idiotic 'Gawaar', Perfect love failure, perfect arrogant negative personality. and we are seeing him as one upcoming legend of Bollywood for sure. Shammi Kapoor in his last role which is a decent cameo. Nargis Fakhri was giving over-dramatic expressions but succeeds to bring a good chemistry between Ranibir and Herself. Kumud Mishra as Jordan's adviser turned manager is impressive. Everyone else in the movie gives a very good performances, maybe the credit goes to Imtiaz ali.\n\nThere are lot of Hilarious Dialogues and also some easily predictable conversations which are obviously dull. Some moments of the movie falls dull and some parts in second half you find boring. The twists and turns in second half gets confused in some parts and loses its plot, but still it manages its pace. Some of scenes are shot multiple times in different character's view, which confuses sometimes.\n\nBut overall the movie goes in fast pace and without a doubt, first half is more promising than second. Anil Mehta's cinematography is brilliant as he captures the beauty of Kashmir, Italy and Delhi. The beautiful locals makes you wait to blink. A.R.Rahman's music makes this musical more strong and enhances the experience. Perfectly suited voice of Mohith Chouhan makes you the real feel of Rockstar performed by Ranbir. Die hard romantic fans will love this one like there is no other movie. Its a treat for Ranbir fans as well as non-fans..!! Watch this one for him and A.R.Rahman, these two are real Rock-stars..!!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ssagarroy",
        "review_rating": "2",
        "review_title": "Nothing was Rocking ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rajput-05899",
        "review_rating": "10",
        "review_title": "Can't describe this masterpiece in words",
        "review_detailed_main": "I am writing a review of this movie in 2022 because i watch this movie again today and i didn't even skip a little part of the movie. Ranbir kapoor as jordan i can feel his pain through his acting . Such a masterpiece.\n\nThe world was not ready for that type of masterpiece in 2011. If this movie release in after 2020 this might be the biggest superhit of Indian cinema."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "arjunflamingfeather",
        "review_rating": "10",
        "review_title": "ROCKSTAR",
        "review_detailed_main": "ROCKSTAR Filmed in theatres because we heard the slogans on this biopic of fictional stardom but now a \"A STAR IS BORN.\" The movie of the year in academy nominations is \"A STAR IS BORN\" with nominees for BRADLEY COOPER and LADY GAGA because of their stardom existent with the lady winning a golden globe for a sitcom."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "JohnSmith09",
        "review_rating": "10",
        "review_title": "Don't believe his blind fans, you'll waste precious time and money",
        "review_detailed_main": "Nargis was terrible and ranbir's dialogue delivery was as bad as hers at many points, thus making the film torture by the second half. Good music, dumb film with bad acting and crazy plot points like ranbir's presence keeping cancer from killing his fling. WHAT?!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "apoorvsaxe",
        "review_rating": "8",
        "review_title": "A misunderstood movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vinaygupta-03300",
        "review_rating": "7",
        "review_title": "Shows that even a love story could be well made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Rudiwadi",
        "review_rating": "9",
        "review_title": "Jab tak takleef na ho na life mein,tab tak koi bada nahin banta",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dsa_ca",
        "review_rating": "6",
        "review_title": "Searching for India's first so called Rockstar",
        "review_detailed_main": "India does have an underground rock culture, but it has not been able to generate a mass appeal that rock music enjoys in the west and rightly so. India is the land having its own traditional music culture and if there is any place for another music culture in the commercial music industry, it has been hijacked by the pretend to be anything industry Bollywood. It churns out music that appeals to vast majority of people but does not create music stars as they are not photogenic for an image obsessed industry. Hence even a musician's music and voice has been legitimately hijacked by publicity whores of Bollywood.\n\nSpeaking of image, rock music artists somehow have etched an image of him standing with an electric guitar on stage with rest of the world swooning or jumping over whatever tunes the musician spews out or in case of Bollywood's latest offering 'Rockstar'; India's latest teen heartthrob standing with a guitar in his hands pretending to play it and spew out some catchy music sung by none other than A R Rehman. Nothing wrong with it and largely effective even without providing concession to Bollywood over details of the art form they are pretending to show exists in India.\n\nRockstar is directed by India's commercial film-maker Imtiaz Ali, who won the license to make whatever he wants jackpot when his rom-com movie 'Jab we met' became a blockbuster and middle class India's favorite go- to movie. Thankfully, he has not miss-used his freedom like Sanjay Leela Bhansali and has been able to keep a semblance of depth in his work. The movie about a rockstar (stage name Jordan) rising from the abyss of India's lower middle class is a delight to watch mainly because the characters have been rooted in reality. His inspiration to be a rock star and his rise as a musician has moments of truth and go a long way in diminishing the gap between reality and fiction.\n\nBut one very important of the movie fails to lift itself above fiction. Nargis Fakhri's Heer as Jordan's love and reason for many angst ridden songs efficiently fulfills her goal to turn her character from fiction to farce. As the movie focuses its complete attention on the romance between Jordan and Heer, it desperately tries to cling on its hope on Ranbir Kapoor's performance and Rehman's yet another perfect score. But Nargis never really is able to act her way through a very important character in the film and evaporates all hopes of making this a memorable film of 2011.\n\nMore blame has to be taken by Imtiaz Ali for his casting fetish for fare skinned foreign born models who are never ambitious to become an able actor. They use this golden opportunity to further their goals to maximize profits for being fair skinned in an increasingly insecure middle class India. But if Imtiaz had any short term goals for the film, I guess they have been achieved with the satisfying box office run. As far as India's Rockstar is concerned he also is lost after a little while into the second half of this movie. Rehman though composed some impressive array of tunes does not really gets a grip of the rock culture in India as it won't have a mass appeal. But rock music becomes just an excuse to confirm the super star status of Ranbir Kapoor.\n\nWhereas the movie is concerned, it is not at all the farce that was achieved in 2008 with 'Rock on!!' and is far more polished than that misguided middle class dream wagon. 'Rockstar' has its moments in the first half and has its disappointments in the sad final reel.\n\nFor more reviews visit http://cinemadose.blogspot.com/"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "puneet1011",
        "review_rating": "9",
        "review_title": "You will definitely like it, might even love it, but will not \"enjoy\" it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "tamanjit-bindra",
        "review_rating": "6",
        "review_title": "Patchy storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "pm557",
        "review_rating": "1",
        "review_title": "Highly disappointing film",
        "review_detailed_main": "I watched this film after I saw it getting rave reviews from most Indian critics and expected this to be a good, non-Bollywood-ish film, but I was highly disappointed. The plot is meaningless, overly dramatic and the film drags on forever.\n\nThe actors give equally poor performances, especially the female lead who stunned me by reaching new levels of ridiculous acting. The music of the film also disappoints; you get random snazzy guitar solos, which serve as distractions.\n\nThis film basically highlights what is wrong with the Indian film industry... low quality, meaningless entertainment films are so rampant that a dramatic, drab film will be called a masterpiece by everyone.\n\nOverall, I give this film a 1/10."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "hsinghal1",
        "review_rating": "10",
        "review_title": "Musical Masterpiece",
        "review_detailed_main": "This is a musical masterpiece. Though the movie itself deserves 8/10 but music is out of the world. Hence a perfect 10/10. Tracks Nadan Parindey and Sadda Haq was superb. In my opinion one of the finest compositions of A.R. Rahman.\n\nThe movie contains deadly combination of A.R. Rahman, Ranbir Kapoor, Mohit Chauhan and Imtiaz Ali. The movie shows the frustration, and aspirations of an obsessive composer/singer perfectly. The chemistry between Ranbir and Nargis/Ranbir and Shammi kapoor was excellent.\n\nMust watch with free mind. The movie does not give any speech or lecture but enjoyable experience"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "premanuragi",
        "review_rating": "10",
        "review_title": "Real Star of Bollywood",
        "review_detailed_main": "Yes Ranbir is the essence of Kapoor Family and super star, thanks Imtiaz sir for directing such a nice movie. We need you both come back with this type of story again & again.. waiting for you both."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "AneyshTraks",
        "review_rating": "9",
        "review_title": "Exemplary cinema by any standards...",
        "review_detailed_main": "The fact that this romance unfolds on screen in the form of an explosive musical, capturing JJ's transmutation into Jordan, the edgy artist, makes the film an absolutely engaging affair."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "namraansari-45335",
        "review_rating": "10",
        "review_title": "Amazing film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "raghavbalasubramanyam",
        "review_rating": "6",
        "review_title": "Love story with a difference",
        "review_detailed_main": "I wanted to watch this movie for a long time especially after watching the song 'kun faya kun'. When the trailers were released i was thinking the movie would be of a rockstar drunk with fame who comes to a downfall due to his frequent uncontrolled fits of anger and finally has a change of heart (owing to song mentioned above) and manages to retain some, if not all his fame but it was nothing like that. Then again bollywood is changing\n\nI had no idea this was a love story at all. The movie turned to be totally different that what i thought it was. Ranbir kapoor did an excellent job with his acting. Overall the film had a poetic feel to it."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "moshi-iit",
        "review_rating": "10",
        "review_title": "Becoming a fan of Ranbir Kapoor and Muhit Chouhan",
        "review_detailed_main": "As I am great fan of A R Rahman, I watched this movie. After watching, I have been astonished the way Muhit Chouhan sings and Ranbir Kapoor acts. A R Rahman always compose his music by his heart but the implementation of Chauhan is awesome as well as the acting, the real Rockstar acting of Ranbir, is marvelous.\n\nI always follow A R Rahman from his composition of 'Roja'. I like very much the little musician from south India. Bollywood produces bunch number of movies every year, low quality music, copy from other musician intentionally or without intentionally, very third class lyrics and singers also. But exceptions are found when A R Rahman comes.\n\nNext comes to Imtiaz Ali. I think he did research properly in musical movies to come to action of this movie. As he is not typical like any other director of Bollywood, Rockstar proves that also. He is very talented indeed and with another musical talent A R Rahman, he blasts.\n\nAnd I became a fan of Ranbir Kapoor who is from a cinema background family, his father is Rishi Kapoor. His Jordan look in this movie is just awesome. He delivered successfully the thinking of A R Rahman and Imtiaz Ali as well as great singing of Muhit Chauhan.\n\nI didn't listen Muhit Chauhan so much but in this movie, I totally enjoyed. I searched for other music of him and found that he sings very well.\n\nI would like to rate as 1. Music 10/10 2. Film 7/10 3. Acting 8/10 4. Story 7/10"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "terminator_on_sabbath",
        "review_rating": "7",
        "review_title": "Ahead of its time.",
        "review_detailed_main": "Only reason I am limiting myself to 7 stars is poor acting performance of Nargis. Overall story, plot, dialouges are exceptional. Way ahead of its time.\n\nEvolution of a DU student to renowned star and a peek in his life. Was late to the watch party, but yeah a great piece."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "SoumikBanerjee1996",
        "review_rating": "8",
        "review_title": "A Ranbir Show through and through!",
        "review_detailed_main": "Esteemed celebrities, individuals who have transcended the ordinary in the fields of music and any other creative territories, frequently face criticism for their self-centered remarks and contentious behaviors.\n\nWhile there are indeed instances where such criticism is warranted, it is often the case that these grievances are highly exaggerated and are blown out of proportions.\n\nOne may question the reason for this strange phenomenon. The answer lies in our tendency to conflate our familiarity with their artistic output with an understanding of the artists themselves, which is fundamentally nothing but a misjudgement.\n\nWe celebrate their works, derive pleasure from their creations, and may either find inspiration in or feel envy towards their opulent lifestyles.\n\nHowever, we rarely delve into the complexities of their personal journeys to comprehend the sacrifices, all heartbreaks, and failures, they endured to get wherever they are right now.\n\nImtiaz Ali I feel, empathetically portrays these struggles faced by these artists with a sense of compassion and insight. Similarly, Ranbir's performance powerfully conveys the anguish and turmoil that is almost always an inherent aspect in any artist's life. Not to mention, the soundtrack by A. R. Rahman elevated these notions to greater heights.\n\nAlas, it's not perfect, although I wished it was.\n\nI do have two critiques to offer: first, regarding Nargis, who, despite her earnest efforts, did not fully embody her character, resulting in a bland performance that failed to leave the kind of impact her part needed to have.\n\nSecondly, I found the exploration of Jordan's familial relationships rather limited, lacking in critical substance; I would have preferred a more in-depth elaboration on that particular front."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "paul-jose05",
        "review_rating": "4",
        "review_title": "Does not meet expectations",
        "review_detailed_main": "You have your expectations set before watching an Imtiaz Ali movie. You tend to start comparing his work with some of the earlier movies. But i was fairly disappointed with Rockstar.\n\nDirection: I didn't see much of Imtiaz's talents when it came to direction. Some of the scenes were so dramatic it reminded me of the acting of the 80's. I think bollywood has come a long way from then. The audience doesn't get immersed in the character. When you come out of a movie like Rock star, you feel a little unbalanced. Not knowing what to derive of the movie. Where are come scenes where the crowd is looking directly into the camera and the audience loses the connect.\n\nActing: Ranbir stood out throughout the movie. His acting skills are surely commendable. His co-star on the other hand Nargis, tends to ruin the whole movie. She does not have the intonation required to express certain feelings that is very much required in a bollywood movie. She seems very artificial in almost all scenes and i ended laughing at some of her dialogs. She has a very long way to go before she can act in main line. She should stick on to modeling until then.\n\nCinematography: Anil Mehta, does very good work with the camera. The scenic beauty of Himachal, Delhi & Prague are beautifully captured.\n\nEditing: The editing was very very average. Some scenes end very abruptly. There are a few scenes where the crowd in the background is starting right at the camera.These are some basics that needs to be taken care while directing but it was also left unnoticed while editing as well.\n\nMusic: The main highlight of the movie. The orchestration is very powerful. The high and the lows are placed beautifully. Rehman has provided excellent music apt to the movie. The movie can easily fall in the category of a musical with little effort.\n\nRating: Overall - 4/10\n\nActing - 6/10; Direction - 6/10; Cinematography - 9/10; Editing - 5/10; Music - 10/10"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "coolniitesh",
        "review_rating": "8",
        "review_title": "Pain behind the journey of a \"REAL HERO\"",
        "review_detailed_main": "Well i m really very fond of watching movies mostly Hollywood movies.But i also like bollywood movies. Now a days bollywood movie track goes in something different way . Rockstar is one of them and i would say its is really superb movies . the movie touches U deeply inside and presents real journey of a Hero(or Rockstar)..everybody wish to be a Hero but no one knows the path of his journey . rockstar shows the way of a Hero. Some critics will say it is a love story but in my opinion Rockstar is beyond a love story . what Imtiaz ali presents with rockstar is very appreciable. A.R.Rehman is always great with his music , Ranveer shows with his acting that he is future Rockstar , Nargis fakhri acts well .. I will suggeest everyone to see the pain behind the journey to become a real hero. I will give 7.5 out of 10 for Rockstar..."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "siddharthfake",
        "review_rating": "10",
        "review_title": "This movie remains with me until I die",
        "review_detailed_main": "The depth of this movie is incredible, you can see layers and layers of emotions."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "pandeyvimleshkumar",
        "review_rating": "9",
        "review_title": "Braaaavo Imtiaz...",
        "review_detailed_main": "This shows that storytelling does not have to be in a format or pattern and yet you can be sssooo effective. Imtiaz brought us an immensely fresh style of storytelling. And his creative vision was well supported by the rest of the team members. Ranbir- He well operated the character and fit himself into it perfectly. He is so troubled as Jordan and so innocence as Janardan. He displays the transition to his character so well. He's defined an emotionally troubled Rockstar. A R Rahman- I think he was there with Imtiaz when he was writing the film or working on the plot to be more precise. Because songs and background scores don't give a feeling that they are an added feature in the story, instead they breath in it and make it ssoo Powerful. Anil Mehta- Cinematography is just so in sync with the scenes that it does magic for the viewers. Editing, singing, acting by the rest of the cast were all Marvelous. It was a delight to watch Late Shammi Kapoor as a Shehnaayi player. His dialogue delivery still had a charisma. And how can we forget that 'Tareef karoon kya uski' track performed by Ranbir...So beautiful. The climax was icing on the cake. A grand salute to the Captain Imtiaz."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shivamtharwani",
        "review_rating": "10",
        "review_title": "\"THE MODERN HEER RANJHA STORY\"",
        "review_detailed_main": "What a cinematic masterpiece! Imtiaz Ali has once again woven magic on the silver screen with his directorial brilliance, and \"Rockstar\" stands tall as a testament to his storytelling prowess. Paired with the mesmerizing musical genius of AR Rahman, this film transcends the boundaries of conventional romance, immersing the audience in a world where love is pure, passionate, and resonates with every beat of the heart.\n\nImtiaz Ali's unique take on the modern Heer Ranjha romance is nothing short of a revelation. He skillfully navigates the complexities of love in a world that often seems disloyal, unfaithful, and laden with fake emotions. The narrative unfolds with an exquisite blend of emotion, intensity, and authenticity, making \"Rockstar\" a cinematic journey that resonates deeply with the soul.\n\nThe film's soul-stirring soundtrack, composed by the maestro AR Rahman, deserves its own accolades. The songs are not merely a background score; they are the heartbeat of the movie, elevating every scene to a symphony of emotions. From the soulful \"Tum Ho\" to the electrifying \"Sadda Haq,\" Rahman's musical brilliance adds another layer of depth to the already rich narrative, leaving an indelible mark on the audience's heart.\n\n\"Rockstar\" is a must-watch for those seeking genuine love and affection amidst the chaos of a world seemingly consumed by deceit and artificiality. Ranbir Kapoor's stellar performance as the protagonist adds another layer of authenticity, making the character of Janardhan/Jordan relatable and endearing.\n\nIn a time when the world is bombarded with superficial notions of love, \"Rockstar\" is a refreshing reminder of the profound beauty that genuine love and affection can bring. Imtiaz Ali and AR Rahman's collaboration is nothing short of cinematic alchemy, creating a masterpiece that deserves not just 5 stars, but a perfect 10-star rating. \"Rockstar\" is more than a film; it's an experience, a journey into the depths of the human heart, where true love and passion reign supreme."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jomy-augustine",
        "review_rating": "10",
        "review_title": "Magnificent masterpiece",
        "review_detailed_main": "Haven't watched a better directed Bollywood movie.. this has outstanding casting, acting, story, songs and whatever needed to create a pack of emotional rollercoaster."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "amirnabi",
        "review_rating": "10",
        "review_title": "An Imtiyaz Ali Masterpiece...",
        "review_detailed_main": "This movie is a work of art, not your typical bollywood masala movie... So for those art lovers, watch and cherish this movie... and for the rest, if you don't enjoy the movie, one can understand...\n\nRahman's music is the soul of the movie... mesmerising as always... Nargis has done well overall as far as the acting is concerned, but could have been better...\n\nRanbir is amazing in this movie... he has fully justified the role of a rockstar... thumbs up to him... This movie is a breath of fresh air in the current trend of bollywood...\n\nsome movies are not just to watch but to feel and this is one of them...."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "qslinger",
        "review_rating": "1",
        "review_title": "Time waste",
        "review_detailed_main": "Was good at first and then went south really quickly. Felt that it would be a nice musical and a romantic comedy but what I saw shocked me. I was hoping that Ranbir would make an impact on Indian cinema but after watching this, I am sure he is in just for the money. What a shame, the legend Shami Kapoor ended his career with a horrible movie. I give it 3 because Hindi Movie rating on IMDb seem to be jacked up and hence to level it off I gave it a 1, else would have given it a 3! For those who like 6+ rating movies on here...please do not watch it. Its unintelligent and will leave u with a slightly elevated blood pressure. Nargis Fakhri's acting will leave you wanting to shoot yourself!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rikuroy",
        "review_rating": "9",
        "review_title": "Imtiaz + Ranbir + A.R Rahaman = Excellence at it's best",
        "review_detailed_main": "It's one of those Imtiaz Ali's unpredictable love stories, which can give you a huge hangover for sure. Plus you can enjoy one of the best performance of Ranbir Kapoor as Jordan in this movie. And also the music of A.R Rahman adds another level of thinking to it. What do you need more? Go watch it right away."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kalashvasaniya1",
        "review_rating": "10",
        "review_title": "Forever",
        "review_detailed_main": "The term \"Rockstar movie\" is typically associated with the 2011 Bollywood film \"Rockstar\" directed by Imtiaz Ali, starring Ranbir Kapoor and Nargis Fakhri in the lead roles. Here are some positive aspects and highlights of the movie \"Rockstar\":\n\nRanbir Kapoor's Performance: Ranbir Kapoor's portrayal of the troubled musician Jordan is often considered one of the standout performances of his career. He effectively captures the complexities and emotions of his character's journey from an aspiring musician to a troubled rockstar.\n\nMusic: \"Rockstar\" is known for its exceptional music composed by A. R. Rahman. The soundtrack of the film received widespread acclaim and includes memorable songs like \"Tum Ho,\" \"Sadda Haq,\" and \"Nadaan Parindey.\" Direction and Storytelling: Imtiaz Ali's direction and storytelling are praised for their unique approach to the rock music genre. The film explores themes of love, passion, and self-discovery while delving into the world of music and fame.\n\nCinematography: The cinematography by Anil Mehta adds to the film's visual appeal. The movie showcases stunning locations, especially in the scenes set in Prague.\n\nSupporting Cast: Apart from Ranbir Kapoor and Nargis Fakhri, the film features strong performances from supporting actors like Piyush Mishra and Kumud Mishra.\n\nEmotional Depth: \"Rockstar\" delves into the emotional struggles and conflicts faced by its characters, making it more than just a musical romance. It explores the price of fame and the sacrifices one must make to achieve success.\n\nCultural Impact: The movie gained a cult following and had a significant cultural impact, especially among young audiences who resonated with its themes of rebellion and self-expression.\n\nWhile \"Rockstar\" received praise for many aspects, it's important to note that opinions on movies can vary widely. Some viewers may connect with the film's themes and artistic choices, while others may have different preferences. Ultimately, \"Rockstar\" is considered a noteworthy Bollywood film for its music, performances, and unique storytelling."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vishal-17422",
        "review_rating": "10",
        "review_title": "Imtiaz Ali's Masterpiece : at least 10 year ahead if its Time",
        "review_detailed_main": "Had rockstar released in the year 2021, this movie woyld have been shuttered all box office record. Imtiaz ali's vision, Ranbir's method acting, Rahman's score, Irshad kamil's lyrics and mohit' Voice.. You will not get this type of magic again..."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "navinchandrajjp",
        "review_rating": "9",
        "review_title": "ART OF DISPLAYING INFINITY",
        "review_detailed_main": "Damn, i watched this movie in a quiet place where no one was there and guess what? I'm 17 years old..and i hadn't cried from past 5 years, but this love story... music and Imtiaz direction really left me with tears in my eyes. I wish I could Have a moment to look at HEER and JJ again . I love them :), I don't usually write reviews for any sort of Filmatic stuffs but this is something masterpiece?? The real art I'd say. Exceptionally Magnificent...and the captures of different places makes this movie much more relatable and nostalgic...I was 10 when I first watched this and see 7 years later..i cried. Please Watch for sure."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "yudiraj",
        "review_rating": "10",
        "review_title": "Rockstar a dark love story",
        "review_detailed_main": "If you have loved once in ur life.\n\nOnce u feel it you will watch it again and again."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "user-107-982434",
        "review_rating": "4",
        "review_title": "Its an average lovestory without any proper story!!",
        "review_detailed_main": "I will not prefer you to see Rockstar in theater. It's one time watchable movie, but not in theater. Rockstar is a slaw movie without proper story. There are few punches in movie that will make you laugh, but its not enough for a complete movie. Music of Rockstar is outstanding. Hats off to A.R. Rahman & Mohit Chauhan for tremendous music. See detailed movie review from Daily Bhaskar.\n\nRanbir Kapoor proves himself to be the apt choice for the role. He carries the entire film on his shoulders. He induces life in his character and matures from an dumb college boy to a hard-hitting rockstar. Nargis Fakhiri shows spark in her performance, although there is scope for improvement. Shammi Kapoor leaves an indelible mark in his small but pivotal role. Kumud Mishra as Jordan's well-wisher and PR, plays his part well. Piyush Mishra is hilarious as usual. Shernaz Patel as Heer's mother looks convincing."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jatinbaranwal",
        "review_rating": "10",
        "review_title": "This is my personal Fav !!",
        "review_detailed_main": "No one words can define what this film means to me, how he always chase music but leaves when we he gets close to Heer, Jordan really keeps the people engaged. Handsdown ! This movie works for everyone, If you love Romance drama, this movie is for you.\n\nRating is 10 out of 10 for dialogues, acting, songs almost everything is perfect. You may starts to cry while watching this movie. Not some typical movie this is unique. You will certainly love this film. How he travel to Prague just to meet his love. How his obsessions leads him to chase the girl and ends up breaking her marraige but it was all his desires which lead him to do so."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rahul-is-also",
        "review_rating": "10",
        "review_title": "Original story execution, believable character portrayal and rocking music - makes it one of my all-time favorites",
        "review_detailed_main": "Rockstar is perhaps the most misunderstood movie I know of, in Bollywood. Ranbir Kapoor's acting is among the finest ever seen. The movie is artistically edited to be chronologically not in-order. Flashbacks are inserted where it is meaningful. It does get a little confusing in the second half, but this is where you are supposed to sink in a decade long love story. The movie gets very dark in its story, but has been executed very carefully. Perhaps, this section can be improved, but the movie must be taken for what it is. It is engaging throughout and can be watched multiple times.\n\nThe storytelling centers around Janardan's tragic journey to become Jordan. Ranbir is believable and honest in his role as a young, small-town and foolhardy college student from Delhi University as well as the agonized rockstar a decade later. He adopted the persona and dialect of his character with great flair. His slow transition from Janardan to Jordan and his absolute love for Heer, is an act that deserves many accolades.\n\nThe music of the film is genius work. I would label the album as \"originally Indian rock compositions\" that fit very well into the situations and the story. The lyrics are amazing and each of the songs have a purpose.\n\nI don't care if the movie can be improved or not. I enjoyed it while I watched it, and I enjoyed it even more afterward. The movie stays with you and grows on you; there is more than one interpretation possible. I have watched such movies in Hollywood which inspire discussions - like Inception, Butterfly Effect, Memento, The Matrix, Fight Club, Pulp Fiction, Minority Report and others - but none of these are predominantly a love story. Besides, very few in Indian cinema have created the same effect in its audience."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shrinivasgkulkarni",
        "review_rating": "8",
        "review_title": "\"Rockstar\" is a tribute to the transformative power of love and pain in the creation of art, and it remains a standout film in Bollywood's musical drama genre.",
        "review_detailed_main": "\"Rockstar,\" directed by Imtiaz Ali, is a compelling tale of love, loss, and the tumultuous journey of self-discovery. Anchored by Ranbir Kapoor's career-defining performance and A. R. Rahman's soulful music, the film delves into the emotional and artistic struggles of a musician. \"Rockstar,\" directed by Imtiaz Ali, is a compelling tale of love, loss, and the tumultuous journey of self-discovery. Anchored by Ranbir Kapoor's career-defining performance and A. R. Rahman's soulful music, the film delves into the emotional and artistic struggles of a musician. Ranbir Kapoor delivers a phenomenal performance, embodying Janardhan/Jordan's innocence, passion, and eventual torment with incredible nuance. His portrayal captures the essence of a tortured artist, making his journey both believable and heartbreaking. Nargis Fakhri, in her debut role, brings a natural charm and vulnerability to Heer, although her performance occasionally feels overshadowed by Kapoor's intensity."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ramizbubere",
        "review_rating": "8",
        "review_title": "Surpring and not a usual Imtiaz Ali movie",
        "review_detailed_main": "The previous two movies by Imtiaz ali was jab we met and love aaj kal good romantic movies which included lots of laughs and cheesy stuff.Imtiaz ali is known to present twisted and confused relationships and he does it again in this one.Technically the movie is great.Brilliant editing,Screenplay,directing,soundtrack(by Oscar winner ar rahman)and acting(except nargis fakhri).\n\nIts the story of a confused musician whose music is inspired by the events happening in his life.and as the journey begins u feel that your part of it.A movie that shows helplessness of human emotions.You will not get what you expect out of the movie but what u get is surprising,emotional,inspiring and beautiful.\n\nREASONS TO WATCH IT : Ranbirs best performance till date.Ar rahmans music.Imtiaz ali's direction.And the magic of love thats never ever shown this way in Hindi cinema."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "saish746",
        "review_rating": "8",
        "review_title": "Rockstar Ali",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "thakkarv",
        "review_rating": "10",
        "review_title": "This movie is an emotion",
        "review_detailed_main": "This movie is not a movie.. It's an obsession for me. Can watch any day anytime. Whenever I watch any single scene of this movie, I can't stop myself from watching the whole movie again. The only bad thing about the movie is Nargis's acting."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "abhimanyubishnoi",
        "review_rating": "5",
        "review_title": "Rockstar is one of those movies that start with vibrant air around it but slowly and sadly fizzles into a self-indulgent drag.",
        "review_detailed_main": "Rockstar is one of those movies that start with vibrant air around it but slowly and sadly fizzles into a self-indulgent drag. I got a feeling that the makers, primarily Imtiaz, tried to make a movie which they wanted to be remembered as an urban cult in years to come but it falls hopelessly short of that. Irrespective of the box-office returns, Rockstar will always remain an attempt that just pretended to be cult but never came close. Three prime reasons for it falling way short: One, for a love story (especially a tragic one) to work, you need a solid lead pair with great acting credentials. Rockstar, sadly, has just one good actor in Ranbir Kapoor (this could well be his best performance till date). Nargis, apart from trending on twitter and being made a butt of all jokes at the time of writing, would make Katrina Kaif look like Meryl Streep. OK fine, she wasn't that bad too, but bad enough to ruin the movie. In the hindsight, an Anushka Sharma would have done wonders to this film. Two, the 2nd half is way too incoherent, too aloof, too Kashyapesque. You don't seem to connect with the movie and u don't care after a while. Simply put, I just couldn't feel the pain and anguish of the protagonist. There are moments in the film that touch you but not enough for you to have goosebumps on seeing him tear his lungs out in 'Saada Haq'. Third, like a scourge plaguing the Hindi film industry, the script is nondescript. Well, there is none to be honest. It's a collection of sexual/asexual innuendos. A movie doesn't have a script when you cant summarize the story. High points - great visuals, out of this world music and vocals and, of course, Ranbir Kapoor. My rating 5/10."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rim_0717",
        "review_rating": "9",
        "review_title": "A marvel of Music A.R Rahman & outstanding acting of Ranbir",
        "review_detailed_main": "Excellent movie and especially the brilliant composition by the Greatest Music Director AR Rehman's songs and BGM. Mind blowing... Also hatsoff to Ranbir kapoor's performance...He lived in the movie."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "aman-dzire",
        "review_rating": "9",
        "review_title": "It's a life that describes the pain one lives with...",
        "review_detailed_main": "Beyond a story and the features of the film, it has a life that want to cherish his dream, enjoy with his loved one, be with her, wanna love and feel her, but everything gets converted to a painful life when the boy loves the girl from the bottom of his heart and he is burning himself from within because the girl has got married to other guy. Although the realization of this love comes late to the boy but it doesn't stop him from loving her.\n\nThe music and theme of the movie has been incredible. Many people might not like the movie because it does not have a normal love story, but a story where there is extreme love but the helpless one, which hurts and brings you at a stage where you are living your life but with no reasons because your body is with you but your soul is in memories of your love...\n\nA love, that is strong, possessive, uncommon; yet helpless and distressing...\n\nI always enjoy this movie whenever I watch it.\n\nI might not be good at writing reviews but shared what I felt from the movie. :)"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "careyrajan",
        "review_rating": "8",
        "review_title": "Ranbir Kapoor and A.R Rahman Steal the show",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "parthbittupatel",
        "review_rating": "10",
        "review_title": "yes.",
        "review_detailed_main": "Sometimes you feel that you are watching a live shot documentary or something."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Garhwal-vikas",
        "review_rating": "9",
        "review_title": "Jordan-Away from all wrong-doings and right-doings!!!",
        "review_detailed_main": "A must watch musical heart break love story. Imtiaz Ali always puts on screen something so relative and close to real life. Ranbir is so commendable as Jordan, Nargis as a debutant have done well but it's the noticeable flaws in the dialogues that will dishearten you. AR Rehman and Mohit Chauhan music rocked!!!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "yusrazahir",
        "review_rating": "10",
        "review_title": "JUST AMAZING.",
        "review_detailed_main": "The movie was very good. And the songs, even better. The thing I did not like about the movie was Nargis Fakhri's acting. Umm.....it was not good. But i loved the acting of Ranbir Kapoor and Aditi. It has everything what a good movie needs. It's my personal favourite. A MUST WATCH!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "grohit87",
        "review_rating": "1",
        "review_title": "many flaws in the story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "aan-53424",
        "review_rating": "8",
        "review_title": "Surely not a fairy tale love story.",
        "review_detailed_main": "Imtiaz Ali has again succeeded in giving a love story different from traditional Bollywood fairy tale love stories. This movie aligns with the concept of his previous movies like 'Jab We Met' and 'Love Aaj Kal'. But love story is not the only thing that this movie offers but it is hell of a ride of a jouney of life of a 'Rock star'.\n\nThe lead character (Ranbir Kapoor) is confused and puzzled in the beginning like the previous movies and a failed singer/ guitarist looking for fame and success but doesn't know how to get it, until he receives an advice from his friend that every great artist has a story, a story of pain behind his success. That exactly is the concept of the movie and the rest of the movie gives the details of how he fell in love and felt his shares of pain to become a 'Rockstar'.\n\nHow the story unfolds sometimes makes the viewer confused and many of the people don't get the concept of the movie and don't relate to it. The first half of the movie unfolds his college life, his desire to become a rockstar and also his new friendship with Heer (Nargis Fakhri) in humorous manner which later gets pretty serious and complicated as Heer is about to marry. The second half unfolds more about his music life after Heer leaves his life and he is thrown out of home. Music becomes his way of expressing himself and love story gets more and more complicated when meets Heer in Prague during his music tours.\n\nThe director has surely woven the love story like no other but script is not very strict, so much things keep happening leaving the audience baffled and thinking \"what this movie is really about?\" Imtiaz Ali has tried to give so much in one movie that it gets a little hard to digest In other words the the movie doesn't unfold very smoothly.\n\nRanbir Kapoor surely looks like a rockstar and has done the job the perfectly well, it showed all the hard work he had done learning with A R Rahman in his studio. The scene where Ranbir (JJ) yells while while getting beaten really looked genuine and really sends shiver down your spine. All other actors also did well, the loose end being the debuting lead actress Nargis Fakhri.\n\nThe music given is excellent as expected from A. R. Rahman and is on par how much is needed in music based movie like this and vocals of Mohit Chauhan really brings out the pain of the rockstar.\n\nThe movie loses its direction a little bit after the interval but overall the movie is worth watching not just as an entertainer but also as a one to be inspired from. Imtiaz Ali has prepared a dose of pain to be felt."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "anamikalove-45117",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "NO WORDS TO DESCRIBE THE BEAUTY OF THIS FILM.THE MUSIC THE PERFORMANCE THE ACTING ALL ARE TOO GOOD."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "kumarch-34066",
        "review_rating": "10",
        "review_title": "BEST MOVIE OF BOLLYWOOD EVER",
        "review_detailed_main": "Hands down! This is the best movie ever made in the history of Bollywood. And on top of that, hypnotizing music by A R Rehman."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "raghavendra-ramadass2",
        "review_rating": "10",
        "review_title": "Love it for Ranbir and Rahman!",
        "review_detailed_main": "When you actually see this movie, you just don't see it, you actually become the character, because of the acting delivered by Ranbir and an excellent BGM's by Rahman ! Man, I've got to tell this, I've watched this movie more than a single time especially for Ranbir. Rahman is at his best in this movie, from the beginning to the end of the scripts, be it the songs r the bgm, all r just out of this earth. Secondly, this is my first Ranbir film, have to say this, I've become a crazy fan after this movie ! really, i'm loving it ! he is just amazing, just look at the movie and you will understand what I mean !\n\ngo with a blank mind and you will be heart-filled by this movie, though it has a silly and small plot, the transformation of ranbir's character is just amazing ! just watch this movie for him and the music !!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "preetjee313",
        "review_rating": "9",
        "review_title": "...then there are some movies, you wish they never end.",
        "review_detailed_main": "Beyond the right and wrong of this world, there is a field. I'll meet you there. The movie ends with these words and with it ends an amazing journey. Once Imtiaz has you firmly seated in the back seat of his motorcycle, he takes you through this exquisite journey just like the one JJ and Heer take. The songs are as much a part of the film as any of the characters and are swiftly blended.\n\n4 - 17/6/20"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "engrnafiul",
        "review_rating": "10",
        "review_title": "Emotional odyssey that explores love, pain, and self-discovery.",
        "review_detailed_main": "A deeply emotional film that leaves a profound impact. Directed by Imtiaz Ali, the movie tells the story of Janardhan Jakhar, who becomes the iconic rock star Jordan. Ranbir Kapoor's portrayal of Jordan is exceptional, capturing the intense journey of a young man caught between his rise to fame and the pain of unfulfilled love. His performance is powerful, reflecting the character's vulnerability and anguish in a way that is both authentic and deeply moving.\n\nThe chemistry between Heer and Jordan is electric, making their love story both beautiful and heartbreaking. Fakhri's depiction of Heer's transformation from a carefree individual to someone trapped by longing is subtle yet impactful, adding depth to the narrative. Their shared moments are filled with a poignant tenderness that enhances the emotional intensity of the film.\n\nA. R. Rahman's soundtrack is the soul of \"RockStar,\" perfectly complementing the film's emotional landscape. Songs like \"Nadaan Parindey,\" \"Sadda Haq,\" and \"Tum Ho\" are more than just music; they are emotional experiences that resonate deeply with the audience. Imtiaz Ali's masterful direction and the film's stunning cinematography further amplify its impact, creating an immersive experience that explores the themes of love, pain, and the relentless pursuit of dreams. By the end, \"RockStar\" leaves a lasting impression, showcasing the transformative power of music and the depths of human emotion."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rsromi",
        "review_rating": "1",
        "review_title": "Rockstar is one of the example of editorial disaster !",
        "review_detailed_main": "Plot, cast, storyline, music, songs everything great. but directors/editors are just under what dilemma made this movie, nobody can understand? Why our BOLLY people looks so obsessed with foreign location and European mentality? There is no sense as where to put what song? no connection between storyline and songs.\n\nThere was lot lot opportunity to make this movie as one of the long remembered blockbuster.\n\nThe questions one would ask him/her self and director would be? 1. What pain did Ranbir really had that lead him to sing painful/rebellious songs? 2. What the bloody hell was he missting in his life? He had Heer whenever wherever and whatever way he wanted? 3. A sheer absence of great platonic love.\n\n4. Background score at certain level is just nonsense. no connection of words with situation.\n\n5. What society did wrong with him that lead him to sing SADDA HAQ? Which HAQ was he asking for? 6. He seemed to became rockstar because of press reporters only.\n\n7. What kind of message/lesson did he receive at Hajrat Nijamuddin.\n\nFirst 45 minutes great. Ranbir falling in love with Heer(Nargis Fakri). Heer refuses his love because of family or pre-commitment and social reason (sanskriti etc). Ranbir performs at some unusual locations with refusal pain where stopped by society/system. Ranbir shares his modern ideology being NASTIK (not believing in GOD but in working for good cause). Taking up some issues also concerns current affairs corruption, women rights, youth rights, freedom etc. in his way of protesting? Turning youth by his songs in crowd then movement. Ranbir also experiencing some injustice in society by police, bureaucrat and then decide his way of performing and awareness of (arroganceGIRI). Heer dying of some disease and their family being reluctant to take fruitful action. Ranbir coming to rescue but stopped by Heer(unwillingly) and society. Ranbir falling down of pain pain then some miraculous happen people support help him come out and take some bold steps forward and saving her life. A global acceptance of his ideas can also be shown as there is international support.\n\nI really had great expection from thie movie, but surely did failed. And all the songs of this movie are absolutely boring. And Atif Aslam was best if he would sing but Mohit chowhan is absolutely bogus. A fully bakwas movie. The worst movie I have ever seen in 10 long years..."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "amsajadh",
        "review_rating": "10",
        "review_title": "ROCKED",
        "review_detailed_main": "Amazing love story between protagonist and music the heroine is his music and the way it portrayed wow mind blowing felt like floating while watching the romance and music made it to the peak amazing performance from ranbir wow mind blowing never felt like a drama going too boring movie is about 2 hours 40 minutes but not at all felt like wasting time literally fell into the movie. Awesome charecterization,awesome transformation,still the songs are running inside the mind visuals are stunning and fabulous extraordinary work from the whole team.100 percent genre film never seen an Indian movie like this."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Diksha-sharma-301-48782",
        "review_rating": "10",
        "review_title": "Lived it.....and loved it!!!",
        "review_detailed_main": "\" out beyond the ideas of wrongdoings and right doings, there is a field. I will meet you there\" - rumi. The quote says it all, This movie changed my perception of love. Ranbir at his best, god only knows what can he do better than this. Nargis was OK, but could have taken some other actress. A r rehman is a god of music and Imtiyaaz Ali who has given us a movie like jab we met before. All of them proved to be a great team and the only missing piece in this jigsaw puzzle is Mohit Chauhan. Movie revolves around a guy named janardan jhakar played by ranbir, who wants to be a rockstar. He was told that if wants to be one he has to get his heart broken as there is no pain in his singing. He comes across this beautiful girl heer played by nargis who is famous for breaking hearts.....therefore he goes and proposes to her. Now what happens next, did she break his heart and he became a rockstar or she gets her heart broken, and much more..........watch it to know more guys. You are gonna love it."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "amarnath-34837",
        "review_rating": "10",
        "review_title": "Nice movie and excellent performance by Ranbir",
        "review_detailed_main": "Direction is good and excellent performance by Ranbir. It's a good movie to see."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "amritboruah",
        "review_rating": "10",
        "review_title": "Movie that i never get bored",
        "review_detailed_main": "Its been 7 years and must say this still m not get bored watching this movie. Doh its not a great movie but i like this hence giving a 10 star"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "viswadravid",
        "review_rating": "8",
        "review_title": "A different flick by RK with mesmerizing music by ARR",
        "review_detailed_main": "An idiotic dumb guy doing his college falls for an hottie of that college.While, he has passion for guitar, but initially never knew how to operate a guitar,literally. Then he meets Heer (Nagris Fakhri) in the college, became friends and soon very close to each other.This dumb guy, who knows everything about his town takes Heer throughout the city. Soon, as our Indian culture is, Heer's parents find a big shot guy for her. Disappointed and heart broken Heer, gives a adios and leaves offshore. AS Janarthan(RK) couldn't forget about her, becomes a aggressive violent rockstar soon after. He then gets a chance to meet that girl the thrill yourself with the soothing music from Mozart of Madras. I have now started finding better movies at www.flickstree.com. It not only suggests great movies ,but also where to watch the movie online."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "pawan-nirvana",
        "review_rating": "10",
        "review_title": "Not to be missed if u're looking for something original. (10 out of 10)",
        "review_detailed_main": "I know I'm a little late on this but I literally couldn't keep my hands off the keyboard..saw Rockstar a few hours back and here's wot i've got to say about ROCKSTAR.\n\n{truely magical n spell-binding..} after watching it..i really couldn't sleep..a wink..not even a wink!! It made me think about the whole movie even after 12 hrs of watching it..Every few decades a movie is released that changes the lives of its viewers forever..and i must say..rockstar is one such movie. one gem of a movie!! A beautiful film about LIVING, LOSING and LOVING..!! Hats off to Imtiaz Ali for the artistic touch ,scintillating direction n outstanding plot,, Ranbir for superb performance..and ohh music was heaven..every song's a masterpiece..thank u Rahman sir.\n\nI think this movie will make u love ur loved ones..a lil' bit more :) coz there's a little ROCKSTAR in every one of us..\\m/ \\m/ story: 9/10; direction:9.25/10; music: 10/10 average=9.42approx."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "socials-six",
        "review_rating": "1",
        "review_title": "Cant believe Imtiaz can make such a movie",
        "review_detailed_main": "'Rockstar' movie directed by Imtiaz Ali is not a great work from his all work. I am giving this movie 2/10 after considering various factors.\n\n1. Storyline of this movie is vague and looks really patchy. 2. Director was failed to produce act from Main actors(mainly Nargis and Rabir at some extent). 3. Theme of the movie is unpredictable. While watching this movie I was unsure whether its a Comedy, Adult Comedy, Suspense, Subjective, Melodic movie. 4. In lots of scenes, they were not able to convey any message or meaning. 5. Rabir as an actor has done a well job, but some scenes it looks like director is over expecting. 6. Songs are not so melodious. 7. A.R. Rehman has been repeating the same genre songs which are based on prayers in mosques. 8. The choreography is not novel.\n\nOverall the movie is not a entertainer but a killer. It takes you to a ride with lots of sudden stops and falls. So be prepare to watch with nothing in mind. I would be say not a one time watch when you really want to get entertained."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "chadebabrata",
        "review_rating": "8",
        "review_title": "Rockstar w'l ruled a milestone of Hollywood pattern movie.",
        "review_detailed_main": "Some where i found Imtiaz Ali as Tom Tykwer (Director of Run Lola Run, 3, Perfume etc.). what a sense of character changing (childish, crazy, series) with hero and his circumstances. Rockstar w'l ruled a milestone of Hollywood pattern movie. Ranbir w'l definitely be a Rockstar i mean he is Rockstar, nice and very sharp acting. Song's lyric as per situational reflection. In his Love journey he does know when he become a Rockstar. situational memory recall and hero on the screen. His temperament, his problem , his feelings but media and public always busy with there business and masti, nicely demonstrated. As debut heroin, she is also nice. in today's \"Ananda Bazar\" Bengali paper rupam Islam wrote in a way, that he does not understand the movie, they r in the queue of melody movie likers. They are having a mind setup before watching movies, like every story should end with happy couple. Anyway \"if there is no rumor, there is no popularity\", so we politely read/watch every reviews.\n\nThe name is \"Rockstar\" because of this was hero's Aim/target, but he ran after behind the love and in this span already he became a Rockstar.\n\nSo after Jab we met, Love aj kal & Rockstar we w'l wait for Imtiaz Ali's next Projet. By the time best wishes for Rockstar's success........"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "nbutt81",
        "review_rating": "10",
        "review_title": "Ending of this movie",
        "review_detailed_main": "Movie is awesome but i am quite disappointed by ending, I expected Heer recover since she cannot live without Jordan, her blood count was increasing so seeing her in coma made me upset and strange, could have been a happy ending, can the Producer REMAKE movie for happy ending just like I Am Legend. Its a nice movie showing how a star gets hard time becoming famous and wealthy but on the same time how much big sacrifice is given, specially when its your love you can live without. Rest life is nothing but pain. I really love to see its remake of ENDING and happy one. I REQUEST to Producer/Director to urgently plan for a REMAKE of the movie and sure that people would love to see it seeing both Jordan and Heer reunited. Heer getting cured from bone marrow disease."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sa_a",
        "review_rating": "8",
        "review_title": "BEST film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "almshahriar",
        "review_rating": "10",
        "review_title": "Feelings",
        "review_detailed_main": "Everybody can't understand this movie and can't feel. wow for this movie"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "iambindas-83749",
        "review_rating": "10",
        "review_title": "A beautiful and amazing romantic film. This is my all time favorite film in the universe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "anuvrat-bhansali",
        "review_rating": "9",
        "review_title": "Oye Ranbir Puttar! Aye le Twadda Haq. Rab Rakha!",
        "review_detailed_main": "No Ranbir snorting cocaine, no blurred-skin-make-love scenes with Fakhri, no breaking guitar on the stage and no family regretting the decision to throw-out their maverick kid. Yeah it was disappointing because Imtiaz Ali repeated scenes one after another and like our innate expectations there were no happy endings. Lastly, why on earth should the movie be called Rockstar, when it definitely looks like a love story more than an evolution of a legendary musician?\n\nRockstar isn't an ordinary fare by any measure barring the rather explicably missed transition of a Delhi boy from being a complete asshole to being Jim Morrison. It's a biographical of sacrifice, love & loss from the eyes of a musician, a real eccentric one. Yes, it's not a happy story, it makes you hate the guy, then love him, then hate him some more. By the end of it, you realize that your own emotions towards him are as frivolous as his mood swings. What makes Rockstar a real winner for me is undoubtedly the blend of the story with Rahman's genius musical stroke.\n\n\"He set out to conquer the world without knowing a dime about it and in return he lost everything he had. Now he pleads himself to return home – Oh Naadaan Parinday Ghar Aa Jaa!\"\n\nRockstar has been shot like a dream with those hair-raising scenes bathing in sepia, slow- mo shots, the mystique love of Prague and the subtle yet perfect use of documentary-ish footage.\n\nIn North India, we have a popular term called \"Ainvayee\" which quintessentially means out- of-context. Believe me, there are no \"Ainvayee\" moments in those two hours and more than thirty minutes. This is what makes us Bollywood aficionados keep the faith.\n\nIn good taste, the Kapoor scion is a wand of acting genius. Never in the movie has he made himself look awfully bigger than the situation or his co-stars. His pain, his trauma, his fighting his inner demons is as real as it gets. To quote Neetu Kapoor & myself, Ranbir Kapoor is to Raj Kapoor what Sachin Tendulkar is to Don Bradman.\n\n\"I have all there is to ask for but my heart is filled with anxiety and a burning sensation\". Not to forget, Nargis Fakhri who is a million times more gorgeous and a better actor than Siddharth Mallya's Girlfriend. She is totally smoking. By the way, whoever thought of casting Shammiji & Piyush Mishra, needs a Patiala pat too.\n\nAt last, a humble mention for Imtiaz Ali. You have created what a bastard child of Yash Chopra and Anurag Kashyap would have made. Here's a double toast to you and the writers who made sure that there are no dialogues for the obvious.\n\n\"Poetry & music only come out of broken hearts. The path to the top is full of insufferable pain.\""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "dazzling-aftaab",
        "review_rating": "1",
        "review_title": "Extremely Overrated movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "satsinjee15",
        "review_rating": "10",
        "review_title": "Fantasy",
        "review_detailed_main": "Bottom of story line was very good ! Before watching of this movie I am not expect that will be good or not! But one-thing I should know MUSIC by A.R.RAHUMAN.After watching this movie scene by scene I was enjoying with music at that time ! especially Background music was mind-blowing ! How the creativity was added by Imtiaz Ali(Director).Imtiaz Ali molded\n\n! Ranbir having these much of talent I was shocked for each scene.final touch of the song was really awesome.There is no word to say .RAHUMAN PLAYED VERY WELL.Great acting of RANBIR KAPOOR AND NAGRIS FAKHRI and Great Music of A.R.RAHUMAN is the Soul of the movie.Mohit's voice was awesome.A.R.RAHUMAN,RANBIR KAPOOR and IMTIAZ ALI are THE ROCKSTARS OF 2011. HATs of them ! BEST MOVIE OF THE YEAR and BEST SONG OF THE YEAR 2011."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "hv-87027",
        "review_rating": "10",
        "review_title": "PURE LOVE",
        "review_detailed_main": "Love can make you from animal to a human, Human to a animal. There comes a moment in your life when you changed/improved yourself to a extend that nobody could ever imagined that from you. Just for that person. LOVE is a blessing. Watched this movie countless times."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "Andy_totem",
        "review_rating": "8",
        "review_title": "Rocking even if not a Rock on !!!",
        "review_detailed_main": "Rockstar is an entertaining musical love-drama and could have been a cult movie for years to come with some crisp editing in the last 40 minutes..\n\nThe beauty lies in the direction as director' manages to show love blooming in scenic north India. the songs are paced/shot in a manner than is endearing and most important story moves ahead with songs which clearly is a winner....( u don't get bored of any song at all)..\n\nRah man music is magical and while Sada HQ, Jo Bi main and Katya are chart busters, the real gem fr me was Au ho (reminiscence of Dill Se another rah man movie of 98..)..Irshad ' lyrics gives life to the songs and Mohit chauhan ' voice from the heart is a treat. Under rah man garb, irshad ' words and mo hit' voice, only thing left for imtiaz was the soul and ranbir enlivens rock-star in style...\n\nNargis does a good job in the 1st half but while audience could relate to her joys, her mischief, her love in the 1st half some cant empathize with her pain in the 2nd half which is where the last 40 min disconnects a bit. (which is why its closer to 8 and not a 9 the rating)\n\nwhat made rock on an epic was the pace which was consistent and the end which was fulfilling..nevertheless this movie is for all music and ranbir fans..an Indian treat to be enjoyed .."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "zaeem143",
        "review_rating": "10",
        "review_title": "Loved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "yarrorai",
        "review_rating": "9",
        "review_title": "Rare commodity",
        "review_detailed_main": "I gave 9 in spite some flaws because its a rare commodity. mainstream movie are losing its soul and the indie movies are more art driven but very few fall in the soul full category. away form all the sci-fi complex stories or fancy CGI it is neither preachy nor is ignorant but is authentic. my favorite director is martin Scorsese because he never lies he is very authentic as it can get. Rockstar is like that yes not to forget two important ingredient which makes it memorable is A.R rahman music and ranbir kapoor acting. But credit goes to imtiaz ali for daring to create a sketch of the most tormented beings in the earth those beings are artists. who go great length to submerge in their work in their art and in that process they end up finding the lost pieces by being lost."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ralphmustang",
        "review_rating": "10",
        "review_title": "Magical Movie",
        "review_detailed_main": "This is the 1st time I am ever reviewing a film on IMDb, well I should tell u folks out there, This film was just magical for me. I was completely immersed in the depth of the story, It was something really really special to me. Strongly recommend this film, Ranbir Kapoor's acting was phenomenal, He has a great future, ever since I saw \"sid\" and his performance I started Liking his acting. His acting is so genuine and natural. Mostly It doesn't feel like its a movie, but real life. I am sure many people do relate them-self to these movies, and hats off to Ranbir Kapoor since he selects such good stories. I thoroughly enjoyed the movie Starting till end. A.R is the backbone, I love his music."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "chintan709",
        "review_rating": "4",
        "review_title": "\"bROCKenSTAR\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vermilion01",
        "review_rating": "10",
        "review_title": "A movie which is more than what meets the eye.",
        "review_detailed_main": "I really can understand why some people didn't like this film. A lot of folks skipped on the songs,which were a major part of the film. On top of that the trailer does not do the movie any justice. It is a very deep and artistic movie,that only can appeal to a certain crowd.\n\nA lot of people want their straight to the point,formula nonsense and this movie is absolutely nothing like that. Don't listen to the haters,watch this movie in it's entirety with all your concentration. Then you'll get the whole concept of the film. I watched it several times and found something new by the end of the film. That is quiet a unique experience on it's own,many movies cannot evoke such a feeling.\n\nBelieve me I am not a fan of Bollywood at all. There have been very few movies that came out of Bollywood that I can say have been good,and this is indeed one of those.\n\nIt's quiet a soulful film. Obviously the soulless crowd,which is in the majority will not like this film. There is no surprise to that,I am glad I listened to my friend and watched this. Cause I had no plans of viewing this film.\n\nAll I can say is,the concept,direction,and the story truly surprised me. It was an original and amazing effort by the director."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "A-J2006_777",
        "review_rating": "10",
        "review_title": "Beautiful !!",
        "review_detailed_main": "*\"Rockstar\" is a cinematic gem that delves into the complex emotions of love, pain, and the pursuit of artistic greatness. Ranbir Kapoor delivers an extraordinary performance as Jordan, a character whose evolution from a naïve college student to a tortured rock star is both compelling and heartbreaking. The soundtrack, composed by A. R. Rahman, is the soul of the film, with tracks like \"Sadda Haq\" and \"Kun Faya Kun\" leaving a lasting impact. The film's exploration of unrequited love and the destructive nature of fame is poignant, making \"Rockstar\" a powerful narrative that resonates deeply with the audience. It's a story of dreams, despair, and the heavy price of artistic success, making it a must-watch for those who appreciate films with depth and emotion.\n\nMust watch !!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "hasan-55419",
        "review_rating": "9",
        "review_title": "Mindblowing",
        "review_detailed_main": "Its different than the others Romantic based Movie."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "luthra-rajat",
        "review_rating": "8",
        "review_title": "First half is amazing.. Second half is a bit of a drag but the movie has a lot to offer, must watch !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "wespy",
        "review_rating": "10",
        "review_title": "Perfection",
        "review_detailed_main": "This is by far the best creation of bollywood of all time.\n\nIt has acting, direction, screenplay, setting and most importantly story (something that you don't generally expect from bollywood).\n\nRanbir Kapoor just nailed the character, his acting in this was pure class. The actress was a bit off (maybe because it was her first movie) but MAN! Ranbir Kapoor was truly expectional in this role. He is certainly the best product of nepotism in the bollywood industry.\n\nAnd lastly, Imitiyaz's direction takes us a beautiful trip from Delhi to Kashmir to Prague. Gosh! I am so jealous of the people who saw this in theatres."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rohitnagade",
        "review_rating": "10",
        "review_title": "ROCKSTAR",
        "review_detailed_main": "A piece of art.\n\nWhen u watch this movie for the first time then its looks like a normal movie.but when u see this movie for 2-3 times then you can feel the depth of the movie.this movie is not for everyone."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "ragpap93",
        "review_rating": "5",
        "review_title": "Good music, bad movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "virajpawar-07161",
        "review_rating": "10",
        "review_title": "A masterpiece!",
        "review_detailed_main": "Thank you Imtiaz Ali, Mohit chauhan, AR Rehman, Ranbir kapoor and Nargis Fakhri!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "zeeshanabid",
        "review_rating": "9",
        "review_title": "Great Piece of Art!",
        "review_detailed_main": "Rockstar is not a typical Indian movie. It completely skips the norms and standards of how a movie should be made. Scenes are not in chronological order. Film also skips the concepts of ethics and morality, and there is literally no message for the film watchers. Furthermore, there is no positive or negative ending, the Indian viewers are accustomed to have in every they watch.\n\nThis is a complete piece of art, much like abstract art, which one would either love, or completely misunderstand. The focus is entirely on Ranbir's character, who is a mentally weak person, but achieves big. But even after achieving lot more than he ever imagined, he's not happy in his life. He prefers pain and failure lot more than the success. Why? This is exactly the movie about. And Ranbir has done a great job and properly delivering that character. But he's supported really well by masterful music and background score by A. R. Rehman.\n\nSurely, the acting of lead actress is greatly disappointing. And at places it's kind of irritating that the makers of this great movie chose her for such an important role in this masterpiece. But Ranbir and A. R. Rehman's brilliance kind of made-up for that one major blunder by the producers.\n\nI will highly recommend watching this movie if you're looking for something entirely different compared to the regular Indian movies."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "chtnbhamare",
        "review_rating": "10",
        "review_title": "Masterpiece of Imtiaz Ali and Ranbhir Kapoor",
        "review_detailed_main": "Rockstar was the first movie i watch in theatres, So it is always special for me.\n\nComming to the point the movie as you start watching this movie you are start engage in the J. J s character simple sweet guy want to be a rockstar but thinking that he don't have any problems in his life while explaining to his sister. Then the real movie start involving you after the first half you are involved in the movie totally then In second half the JJ to jorden journey is so epic . When he has everything but not having his true love with him Jorden don't seems to be happy in his life. The music take your experiamce to the next level Sadda Haq anthem was excellent .after comming at the end of movie if you loved someone in your life tgen you will feel the pain in your heart. You will definitely feel Numb for a while.\n\nMusic is outstanding Acting is excellent Story is like for some peoples may not like because this is kind of artistic musical love story film.\n\nWhenever i feel bored i watch this movie my count is aprox 25+. The only movie i downloaded in my laptop and mobile is Rockstar."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jawsnnn",
        "review_rating": "9",
        "review_title": "A love story that does not make you cringe",
        "review_detailed_main": "The different thing about Rockstar and with all Imtiaz Ali movies is that it almost purposefully subverts all the accepted rules of movie-making and still comes up as a story that never shocks you, only lulls you into accepting what is happening on the screen as something that just is.\n\nIt starts with the simple fact the there is a marriage in the story and the people being married are not the lovers. This situation has been done to death in umpteen films where the ceremony is interrupted at the last moment by the lover, who is then handed over the bride by the sacrificing groom. In this film, we don't even get to see the marriage. It happens off-screen somewhere in the middle of the several flash backs and flash forwards, where you do not care. When the leads meet after some years, and the love story begins in earnest, you stop caring for right and wrong and start wondering how this will all end. There are several such minute shocks in the movie. From the detailed character roles, to the length of Ranbir Kapoor's hair which serves as a faithful barometer of his connection to the physical world. From the lilting musical score, to the tastefully shot locales - this is an Indian love story told in the language of the world.\n\nI must also add a note on the actors. Virtually everyone in the movie is overshadowed by the towering performance of Ranbir Kapoor who loses himself in this one. He gets almost everything right - his mannerisms, wardrobe all suggest a man who has stopped caring what the world thinks, and his dialog delivery is still steeped in innocence of a small town boy who speaks his English with a tone. Nargis Fakhri starts out very rough, stumbles then redeems herself in the closing shots. Others glint and shine throughout the movie, but this one belongs to Ranbir Kapoor.\n\nI gave it a nine, as this is not a perfect movie. But as far as romantic movies in contemporary cinema go - this is by far the best one in recent years."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "rifaz-khan",
        "review_rating": "8",
        "review_title": "Some rhythms can be played without any rules",
        "review_detailed_main": "Before You Watch i should remind you that: \"Assume There is no any bindings or restriction in love\"\n\nA unique love story that beyond anything in this world. A spiritual musical journey that can awake hidden love into your heart. Ranbir Kapoor acting was so prestigious, victorious & hilarious.\n\nIn this movie you'll see, that sooner or later there is nothing without love & music is the most unique weapon to know who we are and also help to express moments of love. We all do love but our every beat of heart make us so individuals from others. When you'll find out the same rhythm beats in his or her inside, your love story will known as LEGENDARY like this ROCKSTAR movie."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vermaharshal",
        "review_rating": "9",
        "review_title": "Trio of IMTIAZ ALI, AR RAHMAN and RANBIR. Boom.",
        "review_detailed_main": "Numbers of lesson speaks movie. I give credit to imitiaz ali , rahman sir as well as the acting score of ranbir. Ranbir do his best in entire movie while he speaks a dialgue while he lipsing any song on stage. And one lart of credit goes to the costume desinger of movie which really attracts your mind by time."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "saadgkhan",
        "review_rating": "4",
        "review_title": "Victim of Incomplete & Bad Editing",
        "review_detailed_main": "Rock Star – CATCH IT (C+) Rock star is one of the most confusing incomplete movies ever made in India. The story is simple but the presentation and execution is way confusing. The movie shows life and love of rock star singer of a different kind. During all 2 and half hours, it jumps forward 4years then comeback 2 years then again jump forward 4yeas then 2years back then again 4years forward and 2years back. Two things only stand out in the movie, A.R.Rahman's fabulous music and Ranbir Kapoor's superb performance. That's the only reason to sit through 2 and half hours of rock star. Nargis the new girl didn't look Kashmiri or married or even anyone from Indian cultural values. There is no characterization to her character, whether she is married or not she lives the same life. Poor direction, poor ending in hurry and wrong actress casting makes rock star dreary most of the time. Overall, watch it for its music and off course Ranbir Kapoor."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "prakash-feb",
        "review_rating": "8",
        "review_title": "Just missed from being very good musical to a great movie",
        "review_detailed_main": "Imtiaz Ali's movie on all accounts. It draws many similarities from his previous movies like Jab we met and love Aaj Kal. The problem of many Hindi filmmakers is they don't know how to end a movie. First half of the movie is very good and fun to watch but in second half it's only the songs which holds the attention. The music of movie is tempting me to watch it again but equally opposite is the effect of few scenes in the movie.\n\nInstead of his previous associate Preetam, this time he has gone with A R Rahman. And this is the decision which has made this movie a real Rockstar movie. A R Rahman the hero behind the scene who has proved once again why he is one of the best music director out there. He has created the magic once again.\n\nPerformance wise Imtiaz Ali is able to extract good performance from every actor. Ranbeer Kapoor has got into the role very well and has shown that he is the best fit for that kind of roll. The on screen chemistry between Nargis Fakiri and Ranbeer Kapoor is great. Nargis acted well in romantic scenes but could't handled emotional scenes."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vikasnair-380-184619",
        "review_rating": "8",
        "review_title": "Subtle, suave and sensible!",
        "review_detailed_main": "Imtiaz from his usual self diversifies into passive evolvement stirring the protagonist to exemplary pinnacle through this artistically overwhelming narrative. The journey from Janardhan Jhakar to Jordan is subtly captured with neatly etched characters, slick editing and a finely crafted script. Looking at the intricate detailing and contrasting patterns of Ranbirâ(TM)s character, it would be a tough choice to find an alternate calibre to breathe life into Jordan. Though with the initial revelation of 14 tracks from the maestro stirred some question marks, Ali seamlessly nurtured the amalgamation turning every subsequent frame into a finely woven poetry. From the raw innocence of an aspiring college boy to the ingeniously interlaced affair eventuating a pain stricken dogmatist star, Ali sways with ease in sketching precise screenplays for his unusually conventional characters. A far riskier and jagged terrain than his blockbuster jab we met , Rockstar certainly celebrates Ali's doorway to sensible cinema."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "mu_amir",
        "review_rating": "8",
        "review_title": "A passionate Love Story",
        "review_detailed_main": "I was waiting this because of A R Rahman but i found movie a classic love story. Imtiaz Ali again craft an excellent Love Story however again his hero and heroin love arouse after the marriage of heroin as in Love Aaj Kal. Beside this another thing is again heroin is too bold for the south Asian culture. But the story, direction, acting and above all music make it worth to watch again and again. Jangli Jawani (wild youth). Ranbir is maturing day by day and Nargis did marvelous job considering her first movie. The passion showed is great. Overall a good romantic musical flick. The treatment, tempo of the film is nice and you will not find dull moment. Shammi Kapoor's presence is added point."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shahrohan07",
        "review_rating": "9",
        "review_title": "It is a burst of emotions through music",
        "review_detailed_main": "Amazing movie...\n\nGreat Direction by Imtiaz Ali & Mind-blowing Music by A.R.Rehman...\n\nThe entire plot of the movie is surrounding an unusual guy, his passion, his love, his pain and his destruction...\n\nOver a times the movie does feel a little slow, but the creativity of direction hides it all...\n\nIt is a movie which makes you think, that even Bollywood movies can be original, unusual and yet entertaining...\n\nRanbir Kapoor deserves a lot more attention and appreciation, then he has received for his acting in this movie...\n\nIn all \"Jordan\" is amazing and I am his big fan..."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "vishant_desai",
        "review_rating": "2",
        "review_title": "Horrible had to watch newton to get out of rockstar zone",
        "review_detailed_main": "These many years i had avoided watching this movie .. but last night i dared to watch the movie and it was the greatest mistake of my life.. The rockstar in this keeps in saying yaa yaaa yaaa dont know which genre of rock is this??\n\n, The lead actors in these movies do whatever they wish to do ..\n\nI feel bad for that girls inlaws and her husband who suffer for no mistake of theirs."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shiraz_a",
        "review_rating": "5",
        "review_title": "Music overshadows bad writing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "geeteshsaini-97144",
        "review_rating": "2",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "It would be better if this movie was named \"Impulsive Behaviour\" Instead of Rockstar."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "avinash-60568",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Same concept of love story old love stories of 90's."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "bittookumar",
        "review_rating": "5",
        "review_title": "Hypothetical story of pain and creative genius.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "arijit4711",
        "review_rating": "4",
        "review_title": "Disilussioned direction",
        "review_detailed_main": "A big let down from Imtiaz Ali. As a director of better movies like Socha na tha, Jab we met and Love aaj kal, I was expecting a very good film from him and even was quite excited on seeing the promos. But at the end Imtiaz made a caricature with neither any plot development and nor character development. Any sane person willn't be able to relate to the pain, agony and the anguish through which the protagonist traverses. Neither the love shown between the duo was worthy nor the passion of music inside Ranbir Kapoor was consistent. What baffled me most was the fact that each time the hero finds her love, he forgets everything about his music. This is pretty bullshit because one who adores music in such a way can never be a rockstar. For a rockstar, his music is his life..And even the eccentricities that are so prevalent in a genius are portrayed so absurdly. Even one doesn't understand about the genesis of his anguishes and to whom they are directed and why the hell he is angry.\n\nNewcomer Nargis Fakri is adorable until she opens her mouth and acts. Her acting is just so cold and frigid. Ranbir excels but alas, the director makes a mess. A.R. Rehman is brilliant but the songs don't make any sense on screen, though when you listen it offscreen you will marvel at Rehman's creativity. Story and Direction sucks, I can't be more modest than this. The director presents an utter wrong impression of a rockstar and their oft followed path of self- destruction..Rather he confuses and amuses us with such a 'bang your head on the wall' type movie.\n\nMany people have loved the film and that's very evident from IMDb ratings too, but any person who goes with a preconception of watching a movie on a rockstar's life, his priorities and eccentricities, his road to self-destruction and actualization etc etc will be severely disappointed. The only silver lining is Ranbir's acting and Rehman's music.\n\nIn a nutshell, the movie completely wasted a mindblowing concept and made a total shitty mess. Not at all expected from Imtiaz Ali. My heart pains to criticize Imtiaz but I can't give it more than 4 out of 10."
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "jaynairdrl",
        "review_rating": "1",
        "review_title": "Very poor plot and badly made",
        "review_detailed_main": "Its an understatement to say am a minority here:-)...i absolutely hated this movie from the first 15 min for various reasons and that's when i quickly checked the reviews here and endured it fully. I was reminded of the movie \"Tamasha\" which was another 'tamasha' according to me on the audience by Imtiaz Ali.\n\nJust an implausible plot and some very bad acting by the lead lady made it unworthy of a movie made by a director who also made Jab We Met, Cocktail, Love Aaj Kal & Highway.\n\nI lost it when Ranbir, the all quiet and shy guy suddenly (on director's instructions) starts acting very aggressively to woo the gal and then in disbelief I watched how the lady (who was completely disinterested all along) seemed to be just waiting for him...reallly???..come on...is this plausible!!! And a husband who allows his wife to go off to her lover just coz she wants to??? And the director doesn't even pause to explain how this could possibly happen. What makes the husband do this?\n\nThroughout, the movie jumps frames as if to say that the audience is a fool and wont understand. I hate this type of movie making. I have no issues with the morality or lack of it in going after a married lady...but for God's sake make it well. And I just didn't understand why Ranbir was angry??? Was society against him at any time?? What was the reason for his angst...I mean its so stupid to show a normal guy suddenly very angry and talk about Sadda Haq...What haq? Not explained. The song is very good of course and well shot. I would rather watch it on youtube then endure the movie and dislike the song too as a fall out of a bad plot:-(\n\nMost times the lady looked disinterested for a relationship and Ranbir looked like one of the thousands of creeps (men) who just don't take 'no' for an answer...and this i found very disturbing. I am not for glorifying such behavior which is what the movie does in some ways.\n\nIt is a movie which was panned by critics and the audience alike and I am happy that happened. However it now seems to ring a bell with few and well...everybody has their own way of looking at things.\n\nTo me a movie you must not waste your time on!\n\nRating: Must avoid!"
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "aryplayer",
        "review_rating": "",
        "review_title": "don't watch the movie if you want to save your time & Money,rather buy its music CD's and enjoy,It is very promising but eventually it disappoints a bit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "mukeshangel",
        "review_rating": "",
        "review_title": "rockstar( another adaptation of Erich Segal's Love Story)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "sarosh-mohammad",
        "review_rating": "",
        "review_title": "A romantic journey...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "shubhamjain1012",
        "review_rating": "",
        "review_title": "A movie that hits you hard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1839596",
        "movie_name": "Rockstar",
        "movie_rating": "7.8",
        "review_username": "pushkar-dhawale",
        "review_rating": "",
        "review_title": "Dhassu Beginning.. Bakwas Ending...",
        "review_detailed_main": ""
    }
]