[
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "pawanpunjabithewriter",
        "review_rating": "7",
        "review_title": "MEET THE RAREST BOLLYWOOD SCI-FI COMEDY. A CULT CLASSIC FOR THE 90s KIDS",
        "review_detailed_main": "It's a fantastic watch for the first time. Can watch a few times more. But for us, 90s kids, it's such a cult classic, we can watch again and again due to the creative memories and emotions it brings to us. Hritik Roshan's best performance till date. No wonder he has been favourites of many till now despite average acting performance in the 2010s decade. At that time, it was a movie none had thought of witnessing. However, there were few flaws, very few. Can ignore them and enjoy the comedy and Aliens in this movie. They gave Aliens a face for the Indians 😂. If truth be told, Preity Zinta became the crush of many guys after this one. No doubt, everyone was waiting for the sequel, it delivered well and better. This is the Krishh 1 movie, most of them would know. It's a keep watching movie for me every year. Love it, but yes, it's not the great/greatest Bollywood movie ever. My ratings justify how it is. Highly Recommended."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "ClonesMakeMeCrazy",
        "review_rating": "8",
        "review_title": "Just for fun",
        "review_detailed_main": "If you watch Koi Mil Gaya with an open mind with no expectations, it's a really good movie. It isn't made too well and has loads of glitches, but movies are made for the sake of entertainment and this entertains. There are parts where you cant stop laughing and exciting parts as well. Hrithik Roshan has acted remarkably well in this movie. Although the plot line isn't original and some parts are copied from various Hollywood movies, it is an enjoyable movie with good music (although it could have done without 'Haila Haila') and it was basically just plain fun. Worth a watch."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Peter_Young",
        "review_rating": "6",
        "review_title": "Entertaining film for the entire family, but mostly for children",
        "review_detailed_main": "Koi Mil Gaya is a nice film for the entire family, but mostly for children. Not much does it offer to adults. It does not mean the film is bad or something, I really enjoyed it for being a very well-made movie, but it's just not a film anyone would want to watch twice. To its credit, this is one of the only sci-fi films made in Hindi cinema, and it has succeeded as such. It benefits from great music, effective special effects, but above all, Hrithik Roshan's extraordinary performance as a mentally disabled young man. It also has lovely appearances from other actors, including Preity Zinta's light yet great portrayal of a modern young woman who learns to communicate with Hrithik's Rohit, and Rekha's moving act of his mother who is in a daily struggle with her son's defect. But these ladies succeed because they are two actresses of great screen presence. Otherwise the film was clearly made by Rakesh Roshan for his son. I frankly get a bit angered that all three of his films starring his son did not give any notable scope to other actors but were mainly created to promote Hrithik. The film is considered to be revolutionary, while clearly it is not. We had Mr India in 1987 which was in my view better at its time. Koi Mil Gaya is similar to E.T, but frankly pales in comparison. This Jaadoo, while a sweet creature, is plastic. BTW, he can't act (just kidding!). Anyway, the film is worth watching for its innovative concept and light, endearingly childish script."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "krustycola",
        "review_rating": "",
        "review_title": "Koi Mil Gaya",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Abdulxoxo",
        "review_rating": "7",
        "review_title": "Solid entertainment",
        "review_detailed_main": "Rothik Roshan nailed the role and brought a completely different side out in the film. You felt his pain and struggle to fit in and become the hero of the story. Preity Zinda is decent and well, is quite pretty to look at. Rekha is wonderful as the worrying mother of Krish. The story seems to be a fusion of plenty other films out there but what I like about it is that it manages to blend it all together well, and doesn't feel forced or out-of-place. The alien entity looks like baby Yoda, they could have been creative with it but still looks cool for that time. I like the transformation of Krish, he goes from zero to hero, I think it's smooth and the viewer will have no choice but to root for him. The soundtrack is absolutely memorable and iconic to some extent. Overall, I had a good time watching this flick."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "johnshay",
        "review_rating": "9",
        "review_title": "Solid family entertainment",
        "review_detailed_main": "Just came back from seeing this film on opening day after waiting four months....and can say it was definitely worth the wait. The acting is top-notch -- Rekha is wonderful as the mother, Hrithik pulls off his character with aplomb, Preity does a splendid job as the new girl in town, and Johnny Lever has never been funnier. Even the super six do a great job! The story reworks elements from the Mahabharata into an ET-/Close Encounters-style science film story. All the production elements are terrific: music score, song-and-dance numbers (including a wonderful homage to Singing in the Rain), camerawork, lighting, and -- yes -- the spaceship special effects. One particularly amazing dance sequence has Hrithik cavorting with his own shadow. An instant classic that we'll be talking about for years to come. Congrats to all involved!"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Good movie",
        "review_detailed_main": "Rakesh Roshan after launching Hrithik in KNPH(2000) re-launched him literally with KOI MIL GAYAA 3 years later\n\nThe film seems inspired from ET and reminds us of FOREST GUMP, SPIDERMAN.etc but the film has strong emotional quotient which works in it's favour\n\nYou have the 90's type comedians, too much dance, some romance and a lot superficial scenes\n\nYet the first half is full of fun, the scenes where Hrithik are bullied, all the scenes were he is in distress move you Even his scenes with Preity are good while Rekha and he too have several good scenes\n\nThe interval point introduces Jadoo here things look too fake compared to ET like him uttering crap Hindi words but you forgive such things in Hindi Movies The film does drag towards the climax and the film is ended too too fast\n\nDirection by Rakesh Roshan is the best in dramatics Music is good\n\nHrithik lives his role to the T, in fact for most of the film you forget you're watching Hrithik but Rohit instead He is brilliant in emotions, comedy and everything This film was a turning point in his flagging career Preity too does a decent job, though there are some scenes where she does her usual annoying shouting Amongst kids Hansika is a delight, so is the Jatt guy and the others Johny is funny Mukesh Rishi is alright Prem Chopra hams as usual, Rajiv Verma is as usual too Rajat Bedi is good in his part Rekha excels, Rakesh Roshan is good in a cameo"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "gurdeepmann59",
        "review_rating": "9",
        "review_title": "The Indian version of E.T.",
        "review_detailed_main": "An Indian version of E.T.(1982) would be particularly outstanding\n\nHrithik Roshan plays an abnormal youngster who meets the alien The alien revives his mind and enhances it making him not wear glasses, jump higher than Spiderman, extra-intelligent and a superb basketball player\n\nThis film does impress and was India's first go at the science fiction genre There are also six kids who act as Roshan's friend Roshan's father plays a cameo in this film Only Rekha could have done Roshan's role with such sympathy\n\nHrithik Roshan, Rekha and Preity Zinta leave their mark with this film Rajat Bedi is impressing as an annoyed young man who is jealous of very attraction to Zinta Prem Chopra is convincing Mukesh Rishi has done a good job Johny Lever is funny"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "jotix100",
        "review_rating": "6",
        "review_title": "Hooray for Bollywood",
        "review_detailed_main": "Koi...Mil Gaya proves that Indian cinema has nothing to envy any other type of cinema. Bollywood produces hundreds of films that are pleasant, if somehow naive, for the Western taste, but they are so well intentioned that who can find fault with them? Either you go and enjoy, or avoid them like the plague!\n\nThis film has a little bit for everyone. Director Rakesh Roshan has crafted this film very carefully. The beauty of the region where it was filmed, is the best backdrop to this movie with the right elements to please whoever venture to the theatre to watch it.\n\nThe film is greatly helped by the two stars, Hrithik Roshan and Preitty Zinta. Both are handsome performers, as well as dancers. The musical numbers are very well staged. At times they feel one is watching a musical video of an Indian song.\n\nWhile this film will not convert anyone to a Bollywood devotee, it's pretty enough to enjoy. Spending a steamy summer afternoon in air-conditioned surroundings taking the music and dance numbers will make you think: Yes, Hooray for Bollywood!!!!"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "gb-1",
        "review_rating": "10",
        "review_title": "Hrithik's Back!",
        "review_detailed_main": "This is a thoroughly entertaining movie (except for the melodramatic scenes in the end) and Hrithik shines in the role of a mentally challenged boy. I have enjoyed the songs, the gravity-defying dances by Hrithik and how well Hrithik has captured the mannerisms of a mentally challenged boy. Some people might compare it to a range of Hollywood films, but let's just appreciate that a different sort of movie has been attempted and for goodness sake let's just enjoy it. This is a great family movie and a great treat presented by Rakesh Roshan."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "wajeehkhan01",
        "review_rating": "7",
        "review_title": "Hrithik is great!",
        "review_detailed_main": "This is a movie to watch with the whole family. It has a nice story (even though it's kinda like E.T.), nice music, and great acting. Hrithik Roshan did amazing in this movie. He played the developmentally disabled Rohit very well, and he totally fit the character. He totally deserved all the awards he got for this film, because he did superb. His dancing was also great. Preity Zinta was okay as well, but she didn't do great. The only things that needed work on was the effects, (but you forget about that due to Hrithik's good acting), some clichés and some pretty cheesy scenes (the basketball scenes). But overall, I think that many people will enjoy this movie, and kids as well, because this is a kid friendly movie and it is clean. Out of the entire Krrish series, this one is definitely the best."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "kirkthenelson",
        "review_rating": "9",
        "review_title": "Classic Mentally Challenged Indian Man Meets Alien, Sings Songs, Overcomes Local Bully, Loses Alien, Rescues Alien, Sings More, Gets Girl Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "santhosh-10290",
        "review_rating": "7",
        "review_title": "Koi... Mil Gaya",
        "review_detailed_main": "Good Movie. The movie was interesting. Hrithik Roshan and everybody acting was good in the movie. Songs were not so good in the movie. But the BGM in the movie was so good. The movie was so entertaining. VFX scenes in the movie was also good. Good Movie."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "qadirmagsi",
        "review_rating": "5",
        "review_title": "I guess indians should stick with what they do better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Bollywood in Sci-fi league",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "shivakumarvishwa",
        "review_rating": "7",
        "review_title": "Good movie",
        "review_detailed_main": "This is a good movie with a good watch.The tag line of the movie is very god.Title is very good.Story is good too.Opens when Dr Mehra discovers a new thing he reports it to other scientists but they don't listen.On the way he dies in a road accident.His wife is pregnant then.He gives birth to a boy named Rohit.Years later Rohit is an adult but has a mind of a child.Then he comes across Nisha.They both discover an alien named Jadoo.The movie is nice.Hrithik is great,Preity well looking pretty as ever in a great performance,Rekha did well,Rakesh did well,The kids were great,Others were great too.To me the star of the show was the alien.He was plain excellent.Script is good and so is the dialogs.Cast is great too and so are their outfits.The cinematography is great and so is the dancing.The music is fabulous.A perfect time pass movie.A good movie with really nice songs Rating-7/10"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "hcdahale",
        "review_rating": "10",
        "review_title": "Best In Class for its kind,Absolute Amazing Journey",
        "review_detailed_main": "In the summary,I mentioned that it's an amazing journey as I am fully internally related with this film and I know this film's every aspect in detail,It was my growing journey, as I grew up watching the same flick infinite times.Now its 2015 and the film is 12 years old.After the film the makers kept the film alive for almost 10 years as they gave us 2 more installments after this.The film is full of kindness of the main character that is Rohit Mehra who is mentally abnormal.He lost his father before his birth in an accident in which his pregnant mother was injured and due to the accident Rohit's brain was injured.He is a young guy in his twenties but still studying in a school,failing since many years.He stays with his widowed mother in a town named Kasauli in North India.He is very close to his friends who are kids studying with him.His friends know about his deficiencies and thus they help him every times.Hrithik Roshan who played the protagonist Rohit Mehra did an excellent job after which he swapped all awards for Best Actor in same year.While shooting this he was in late twenties and playing an mentally abnormal childish role was surely challenging.The role was not of a typical abnormal child,but of an innocent guy who don't have knowledge how to deal with advance yet cruel world.Overall the character delights us and immediately after a glimpse we would start believing the character even though he don't exists.The acting never goes up and down which keeps the character real and up to the mark.I as a reviewer I am damn sure this character melts everyone's heart except Satan hearted peoples.The Character Rohit eventually starts liking New Girl in city Nisha and he tries to impress her but he is constantly gets bullied by Raj and his companions.Raj and his family are family friends with Nisha's family since many years.In beginning due to some incidents Nisha hates Rohit thinking he looks innocent but is a bad guy inside eve teasing girls but later she knows truth of Rohit's disability. Later on she befriends Rohit and vice versa. Nisha is played by Priety Zinta and has not left any complains about the role. The main story focuses when Rohit and Nisha meets an alien in jungle whom they keep safe at Rohit's place as they know cops may kill him or can give him any harm for research purpose. Now Jadoo the alien transfers some of his energies and power to Rohit and things changes like anything. Now Rohit can do anything which peoples in his age can't do and all his disabilities are cured.Now there is a typical heroish Hrithik who completely impresses the world with his activities indicating his brilliance.But evil rises when the Cops get information that Rohit has hidden Jadoo the alien which results into a chaos around his house.Rohit never leaves his duty as a friend and he completely safeguards Jadoo which results into a sweet climax of the film.The film wins hearts in every scenes because of its excellent direction and all co ordination. It is directed by Rakesh Roshan.The director himself works very hard and makes the actors work which is proved by excellence of the film.Such excellence requires huge patience which is in the filmmakers.The supporting actors Rekha and Johny Lever done a great job.Veteran Actress Rekha did a memorable job here and the virtual motherhood of her wasn't virtual looking at all.She suited Hrithik Roshans mother in this film.Overall my review completely praised the film as it was totally praiseworthy.If you still haven't watched this watch it Asap."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "AZAM-KHORASANI",
        "review_rating": "6",
        "review_title": "Drink 'Coke' and ride 'Honda' motorbikes...",
        "review_detailed_main": "One of the overriding messages i took from Koi Mil Gaya was the blatant advertising of products (i.e. Honda - basketball scene with the tournament the players were taking part in being called the Hero Cup which might as well have been called the Honda Cup with the Pandavas being clothed in shirts bearing the Honda insignia. Also i lost count at the number of times i saw a Coke being consumed with the can being on display. This in a way infuriated me and spoiled part of the film where i felt market forces had directed what was in short advertising space within the film which i didn't already get in the commercial breaks (I watched it on Channel 4). So all in all i largely ignored those scenes as being part of the film which i did enjoy probably as i hadn't watched ET/Close Encounters of the 3rd Kind in a long while so had forgotten the story lines of both so wasn't incessantly comparing them to Koi Mil Gaya. The movie may rip off both movies but we must remember that the film in being made for a largely Indian audience who may not have watched any of the aforementioned movies. So it is a decent take on two of Hollywood's finest movies mixed with a healthy Indian dose of melodrama and musical numbers.\n\nAlso found Preity Zinta's cheering during the basketball scene very irritating."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "mintchocolategum",
        "review_rating": "10",
        "review_title": "WHAT A MOVIE. ET DOESN'T COMPARE",
        "review_detailed_main": "I don't know how many times I've seen this. This movie IS my childhood. Every last frame is perfection.\n\nIt's packed with action, suspense and intense emotion - made me cry many tear of joy and sadness. A seriously well made movie.\n\nMy cousin does not stop singing when this movie comes on.\n\n#stanJadoo."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "MuviFan73",
        "review_rating": "9",
        "review_title": "Indian version better than 'Extra Terrestrial'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "tnkcool",
        "review_rating": "10",
        "review_title": "bollywood's first sci-fi flick...a must watch!",
        "review_detailed_main": "Three Cheers to the new age of Bollywood! This movie proves that Bollywood has become conscious of it's viewer's tastes and is finally taking steps to please it's vast audience! Koi...Mil Gaya is a sci-fi flick with a heart of gold. Hrithik Roshan is the child of a dead scientist who believed he had made contacts with aliens. However, a car accident kills him before he can prove it and leaves Hrithik (Rekha is pregnant with him)mentally retarded. Hrithik grows up but his intelligence level stays at the grade 7 level. Nisha (Preity) is a friend of his who sympathizes with I'm and thus hangs out with him. Together, they accidentally send sound waves in outer space while playing with his dad's old computer. Thus comes a response to their waves and an alien lands on Earth..in their small town. Hrithik and Preity befriend him and name him 'Jadoo'. The story proceeds so forth and so on. Hrithik is just BRILLIANT! Preity Zinta looks really good and has complete justice to her part. Rekha convinces us well. Hrithink's grade 7 friends and Johny Lever have done a great job. Overall...a fabulous movie! A must watch! Take a Bow Roshans...you've done a terrific job!"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "yasir_mushtaq",
        "review_rating": "3",
        "review_title": "Press B C E and F on your computer's keyboard to talk an alien",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Mr. Bug",
        "review_rating": "",
        "review_title": "A step in the right direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "mpdmsadu",
        "review_rating": "10",
        "review_title": "Why rating 10",
        "review_detailed_main": "Innocence, action, intelligence, friendship, family values. Everything 10/10"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "papanloveu",
        "review_rating": "8",
        "review_title": "Great!!",
        "review_detailed_main": "My favourite childhood movie and the very first one where I distinctly remember going to the theatres to watch it with my family. I was just 7 at the time.\n\nMore than 11 years later and I still look back fondly to this movie.\n\nSci-fi, comedy, romance, action, emotional drama...This movie has it all."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "TharsheyN",
        "review_rating": "10",
        "review_title": "Koi Mil Gaya - A Masterpiece!",
        "review_detailed_main": "I first watched this movie many years ago and loved it. Then I watched it again a few years later and loved it even more. I finally watched it a third time now and if it's even possible, loved it even more!\n\nThis is one of the few movies that can cause me to cry, when Rohit's scooter gets destroyed in front of him... my heart breaks every time and I find tears in my eyes.\n\nThis movie is the first Bollywood sci-fi film to ever be made and released and does a spectacular job to! The storyline is absolutely brilliant and has us routing for the Rohit and Nisha the entire time. The special effects are brilliantly done and fit in perfectly with the movie with nothing overdone or looking fake at any time. Rohit's kid friends are awesome, especially Bittu! The Music/Dance sequences are really superb as well and while I normally skip dance scenes in Bollywood films, I've never done that in the Koi Mil Gaya/Krrish franchise.\n\nThe acting is amazing and Rekha's performance as Rohit's mother feels super genuine and really powerful while Nisha portrayed by the beautiful Preity Zinta has the viewer both checking her out while still supporting her ship with Rohit and also routing for her good and kind side to stay strong in the face of adversity. She is a wonderful person thou and ends up cutting ties with Raj due to his treatment of Rohit along with his lies about them agreeing to get married. The irony is Raj dug himself a hole and pushed Nisha away simultaneously and then instead of climbing out of said hole he decided to lay in it and get buried in it. Though the viewer will also be wanting this as it means hope for our favorite couple Nisha x Rohit! Hritik Roshan's performance as Rohit is on a whole different level, it's made apparent once Rohit gains his powers from Jadoo and Hritik starts playing a more or less normal young man. All I can say is amazing performance! It could have gone so wrong but instead went so right!\n\nA moment that stands out to me and is one I'll never forget is when Jadoo leaves and Rohit loses his powers because of that. Raj and his gang confront Rohit and Nisha while they're walking home(after Rohit is celebrated as a hero by the entire town), Raj insults Rohit and Nisha tells Rohit \"While Jadoo may have taken your powers away he hasn't taken away any of my love for you\". This just reverberates so strongly within me, and Nisha is raised even higher in my eyes. She loves Rohit for Rohit and will stay with him at his side no matter what. Even if he had to revert to being mentally young again Nisha would have been there with him, loving him and helping him the entire time!\n\nTo round it off here's a rating list of each section of the movie!\n\nStoryline - 10/10\n\nMusic/Dance Scenes - 10/10\n\nActing Strength - 10/10 (Rekha/Preity/Hritik are just the best!) Special Effects - 10/10\n\nCostume Design - 10/10\n\nOverall Rating: 10/10\n\nP. S. Go watch the sequel Krrish if you enjoyed this movie and you haven't already!"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "muhammedsiam",
        "review_rating": "9",
        "review_title": "Just because childhood memory....",
        "review_detailed_main": "I'm rating this 9/10 not because of it's storyline, just because it brings childhood memories back. Back then there were no smartphone and cable TV's. Our uncle's used CD player to watch movies. I remember when I was a kid I watched this movie along with my cousins and childhood friends (probably brothers). Those feelings, I know I can never feel them again. Those were the best time of my life. I would never be that happy ever again."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "mehta-nishank",
        "review_rating": "3",
        "review_title": "WARNING : Only for children under 6",
        "review_detailed_main": "Koi Mil Haya is supposed to launch Bollywood in the hi-flying arena of sci-fi films. Instead it comes out as a film that is an insult to human intelligence. Yes, there is an alien in the film- Jadoo they call it. Rumoured to have been designed by Australian animation specialists, Jaoo looks more like a screwed-up Star Wars pygmie. Rajesh Roshan's sound-tracks (all stolen from somewhere or the other) are comical. Everything ranging from cinematography to script is bad, really really bad. For those who believe this to be path-breaking cinema, fine go boil your heads over this stupid so-called sci-fi flick.\n\nHrithik Roshan needs a counseller. Being a gifted actor and an amazing dancer that he is, does he have to do such awful roles just for his untalented father. Grow up, man - and do some serious cinema. Preity Zinta sadly has nothing much to do in the film and would rather have not signed it at all. The rogue 'super-sixers' stink like hell. Johny Lever comes p with some silly comedy, hardly laughable. In fact, what is intended to be serious sci-fi action is more comical than Lever's camaraderie.\n\nBetter avoid this one, if you want to preserve your senses."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "jungleking",
        "review_rating": "",
        "review_title": "KYA MIL GEYA...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "ahmedawais-66974",
        "review_rating": "10",
        "review_title": "A true masterpiece in every sense and my favourite movie.",
        "review_detailed_main": "To be honest, I lost touch with this movie for a long time, then I rediscovered it and also why its one of my all-time favourite movies.\n\nHats off to all for the superb performances, Hrihtik and Priety pairing was brilliant and the supporting cast did one hell of a good job.\n\nA great movie and career defining part for everyone involved."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Ephesians60",
        "review_rating": "10",
        "review_title": "What a Tribute to true friendship",
        "review_detailed_main": "This is a film that the whole family will enjoy throughly. in fact I cried through most of the second half this film shows what true friends will do for each other they will risk all for those whom they call friends. It is in Hindi a Indian language English subtitles. I truly enjoyed this film to the maximum. in my experience the Hindi films have more of a story line then most Amercian films, and th music is mind blowing. t is a Long film so you have to have at least 3 hours to devote to movie watching. I want to say to the director Brovo I give this film a very high ten stars,*********. Please enjoy this film with the ,kids.\n\nSincerely Sean, the Movie Guy"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "BiswajitSince2005",
        "review_rating": "9",
        "review_title": "The Alien",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "AishFan",
        "review_rating": "10",
        "review_title": "Sensational sci-fi movie with Indian emotions still strongly intact",
        "review_detailed_main": "Every single thing about this movie is absolutely fantastic! I must start off saying that Hrithik's acting was marvelous! He does a great job pulling off a mentally challenged character (hmmm...). He has put in tremendous effort into each and every dialogue, in every nuance of his character. Preity, of course, was fabulous and brings zest to the movie. Her relationship with Hrithik was indeed a unique one and was well presented. The special effects are great and believable, a rarity in Indian movies. I usually find the kids in Indian movies rather irritating as they are stereotypically projected as an overly lovey-dovey kid who is always happy and loves eating chocolates and ice cream. In this movie, each kid, however small his/her role was, had a unique and interesting character. Not to mention, they have some funny, witty lines. The alien was terrific! It has its own complexes, fears, and the ability to love. It was really cute. The songs are great and are well picturized. Some have double meaning and keep the sci-fi feeling. With so many great things in the movie, the emotions in this film are what make it absolutely wonderful. It is easy to lose emotions in a sci-fi flick but such is not the case. Whether it is the attraction between a boy and a girl, the support of friends, the love for a mother, a mother's fears and protection, having to lose your best friend, or the feeling of not \"fitting in,\" each person can relate with the characters. The characters are so well-developed, that you start to sympathize for a fictitious creature! I also admire how the movie, having a modern setting, does not try to show westernization but proudly celebrates Indian culture and intelligence such as by using \"Aum\" for detecting extraterrestrials."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "ashlondon-80474",
        "review_rating": "3",
        "review_title": "An adult female falls in love with a disabled man child",
        "review_detailed_main": "This is a film about an adult woman (Zinta) falling in love and taking advantage of a disabled man who thinks he's 8 years old\n\nHrithik Roshans acting is so embarrassing, he has set back Bollywood perhaps 50 years in its evolution. I think disabled people would be offended to watch this\n\nFor some reason there's an alien involved. It's kind of part of the story I guess, but I didn't really notice because of the confusing love story going on. They threw an alien into the mix, god knows why\n\nIf this film was a parody then it would be perfect. But since it's a real attempt at a film, I have to mark it down. The Josef Fritzel-esque love story was just confusing."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "falak11mufc",
        "review_rating": "",
        "review_title": "Is it a proper Sci-Fi?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "kastorplus",
        "review_rating": "8",
        "review_title": "excellent for the family",
        "review_detailed_main": "My children enjoyed a lot this movie, (me too, I have to say) Being the first \"bollywood\" movie they saw, and without knowing the language (my younger child couldn't even read the subtitles) they saw all the film without taking a break. They were chanting jadooo, jadooo later. I had to rent it again... and maybe I will have to buy a copy. I am a science fiction fan, and so I \"know\" that this movie can barely be considered a sci-fi (but who knows?, I do not consider ET a sci-fi either) That movie is an ET?, well, maybe, but also ET could have received inspiration from The Alien (http://en.wikipedia.org/wiki/The_Alien). Some emotions are universal...."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "amitgarg_pta",
        "review_rating": "10",
        "review_title": "It is film off festival recreate in stage over review in time over time in decade over time in past decade off time in dirt off story via imprint.it is film festival.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "espiritlibre",
        "review_rating": "10",
        "review_title": "Rekha's best performance...",
        "review_detailed_main": "Rekha's maternal acting was wow! I mean she really stuck up for her child. She supported her husbands ambitions as well. Rekha is an angel in disguise. Ideal woman! Hritik too is very talented...that is why he is being selective, he is young he should not try to get everything too soon. Priety did not disappoint. I am proud that she had the humility to apologize, she had no ideal he was developmentally disabled. The teachers did not believe in him...that is vital because the teachers are supposed to facilitate learning not hinder it. when a teacher acts like a child they should be treated as such. what comes around goes around bad or good. I love the its Magic song..."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "rock_roy2",
        "review_rating": "10",
        "review_title": "fresh new and exellent for bollywood.",
        "review_detailed_main": "With Koi... Mil Gaya, director Rakesh Roshan has proved two things. One, he truly can give Hrithik Roshan a role to chew into and two, it takes guts and gumption to make a really ''different'' film within the commercials parameters of filmmaking.\n\nSanjay Mehra (Rakesh Roshan) is a scientist who is trying to make a breakthrough - his aim is to establish that there is life on other planets and that it''s possible to reach them. For that, he has set up a computer, which transmits different sounds - Aum being one -- in different variations to space. One day he gets a response from the outer space but the scientists at the Indian Space Research Organisation dismiss his findings as a big joke. When his pregnant wife Sonia (Rekha) and he are returning home, he sees a spaceship in the sky. Elated by the sight his car rams into something and Sanjay dies. His wife gives birth to a mentally challenged boy, Rohit (Hrithik Roshan) who she lives with in Kasauli. As years pass by, Rohit grows into a young man but mentally he is still a child. While Rohit lives a carefree life - that is when he is not bullied by the neighbourhood hero, Raj (Rajat Bedi) - with a group of small kids, his mother increasingly worries about this future. Enters Nisha (Preity Zinta) who after the initial hiccups befriends Rohit and becomes his ''girlfriend''. A couple of songs later, Rohit and Nisha one day come across the computer his father had created at his outhouse. Accidentally, they find out about the ''Aum'' signal and send it to the space. That night, a spaceship visits Kasauli leaving the entire town in disbelief. It''s then found out that some aliens from ''the other planet'' had come down and one of them has not gone back. Rohit and Nisha find it - an adorable three-feet high alien, which looks like a seagull - in the jungle and hide it in the outhouse. They call it Jaadu because it manages to make the \"kachha\" Rohit into a \"pakka\" young man. Which means, Rohit can now flex his bulging muscles, which develop overnight, can see without his glasses, dance like Michael Jackson and play basketball with Raj and his bullies. All''s fine till Kasauli''s police officer (Mukesh Rishi) finds out about Rohit''s little secret. He, with the help of the district collector (Prem Chopra), start tracking down the alien, so that they can hand it to the scientists for further investigations. Meanwhile, Rohit decides to call the spaceship back and send Jadoo back to his rightful place, the other planet. Rohit succeeds though in the bargain, he loses all the powers Jadoo has given him. But no sweat, what''s a good Hindi film without its happy ending...\n\nKoi... Mil Gaya is an immensely enjoyable film. Yes, there are people who may find it a copy of ET-meets-Forrest Gump but what the heck, it''s still a film that''s not been seen on the Indian screen before. The special effects may come across as child''s play and Jadoo may look like a small child disguised as an alien but it still manages to touch your heart.\n\nThe film gives many reasons to smile. First and foremost, it looks very fresh, including the freshly scrubbed Preity Zinta. The breathtaking locales of Nainital and Canada provide ample visual relief. The cinematography by Ravi Chandran and Sameer Arya is awesome. The music by Rajesh Roshan though not in the league of Kaho Naa Pyaar Hai is still hummable, especially the title track and the superbly choreographed Idhar chala number. The dialogues by Javed Siddiqui (some of the lines actually bring a lump in the throat) and the screenplay (Sachin Bhowmick, Honey Irani, Robin Bhatt and Rakesh Roshan) too are above average.\n\nLast but not the least, Koi... Mil Gaya sees some wonderful performances by Rekha, Preity Zinta and Mukesh Rishi. And of course, Hrithik Roshan who lends his all to Rohit Mehra. It''s very obvious that Hrithik has enjoyed playing the mentally-challenged-boy-transformed into-your-regular-hero (in fact, the transformed Rohit reminds you of Raj of Kaho Naa... Pyaar Hai) immensely. He plays the character without any inhibitions and succeeds in involving you in his life. Your heart really goes out to Rohit Mehra.\n\n10/10"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "chutneylix",
        "review_rating": "5",
        "review_title": "A below average film with a commendable performance",
        "review_detailed_main": "Okay so Koi Mil Gaya came out during a time when Hrithik Roshan's career was in a nosedive. After its success, everyone talked about how Rakesh Roshan saved Hrithik's career.\n\nThen I watched this movie and all I have to say is that Roshan Sr. should be the one thanking Hrithik. I will, however, give Rakesh Roshan credit for bringing a novel idea to Indian audiences. Science fiction stories are not common in Bollywood, and the director has helped in moving the film industry in a new direction.\n\nApart from this, the only other asset of Koi Mil Gaya is Hrithik Roshan. He brilliantly plays the part of a mentally disabled man who is a child on the inside. He is able to add layers to the character despite gross oversimplification by the writers. However, as Rohit is slowly cured by Jadoo, Hrithik's performance slides into mediocrity alongside the rest of the movie, mainly because the character ceases to be interesting.\n\nApart from this the movie has nothing else to offer. The rest of the cast overacts and the story itself is boring and predictable. Its sad when a director can't make a movie about an alien, interesting.\n\nRakesh Roshan has always been a below average director. Adding a science fiction angle with new special effects (for India) will not make him better. A talented son doesn't make the dad a better director either. We all know that Hrithik is a star but he also has a lot of potential to be an 'actor'. I hope he begins picking better projects both inside and outside his own production house."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "ksbhutani",
        "review_rating": "",
        "review_title": "sci-fi movie with an Indian touch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "JAGDEVS",
        "review_rating": "8",
        "review_title": "A fanstastic attempt at something differnt",
        "review_detailed_main": "Unfortunatley, I'm not sure that the indina public are ready for such a film though. Especial where the hero plays a difficult role IE there is some real acting involved. Bollywood heartthrob Hritik Roshan usually seen in glamourised love storys and stories where the hero sweeps the hearts of the female watching public does role that really gives him a chance to do some propper acting. His role as the mentaly retarded boy is well done and the issue is sensitively handled. Preity Zinta looks abslolutely stunning throughout the film. The special effects used in the film are top notch. they dont look tacky or cheap. The film takes on several storylines from various hollywood sci-fi films and creates a story that could be classed as India's ET. The only drawback is the length of the film. Maybe bollywood needs to shorten it films. to two hours rarther than the exhaustive three which does not work with all storylines. What seems to drag mid first half suddenly picks up second half and gets really exciting second half. The alien \"Jadoo\" has been created quite well with eye movements and some basic hand manouvers.The space ship looks top notch just like the big hollywood blockbusters something out of star trek of starwars! The kids in the film are lovely and funny. Rekha gives a soulful performance as Hritik's mum. The soundrtack is quite unique and suits the film well. definately a good one to watch..."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Sher_Babbar",
        "review_rating": "10",
        "review_title": "It's Hrithik - all the way!",
        "review_detailed_main": "Some of my thoughts on KMG :\n\nIt's a GOOD film - but not that GREAT! It could have been a lot better! Rakesh Roshan has done a very good job by making such a promising film! I'm impressed by his work. He's fantastic! But he has faltered in the climax. The climax is weak; in fact totally unimpressive. It doesn't impress at all - the way it should have been! That's the weakest aspect - the climax!\n\nThe music by Rajesh Roshan is nice. All the songs are nice and unique in their own way. He definitely deserves a round of applause for composing such an impressive MUSIC; for such a different and unique film.\n\n\"Idhar Chala,\" is definitely the best of the lot. It has been choreographed/picturised brilliantly! AWESOME! I'm simply in LOVE with it. The music is so catchy and makes you even dance. The atmosphere is just stunning! Preity Zinta looks gorgeous in it... in fact, mindblowing! Her facial expressions are extremely cute!\n\nAbout the dancing, HR is simply outstanding! He is great! He makes you fall in love with the song even more and more... every time you see it. Full marks to HR, and also Farah Khan for coming up with such a stunning choreography.\n\n\"Haila Haila\" is also very impressive in terms of Hrithik's great dancing skills. He dances exceptionally well again. Same goes for \"It's Magic,\" as well.\n\nSpeaking about the performances, it's Hrithik Roshan - all the way! He has done a GREAT JOB, as a mentally challenged young man. His facial expressions, body language, dialogue delivery is just extra ordinary. What an impact, he has registered here in KMG - bound to win him so many awards next year! You just fall in love with him. Whenever he cries, he makes you cry... whenever he laughs, makes you laugh as well. He carries the viewer with himself in each and every scene and emotion. 10/10 to him! Bravo!\n\nPreity does a very sincere job. She is very nice, but doesn't have much to do. She looks so cute and gorgeous, everytime she comes on the screen. You like her company. I have never seen her look so dashing before - to be honest.\n\nRekha is simply outstanding, whatever she has to offer in terms of acting. I simply loved her in KMG. Nice to see her back... the actress of her calibre! That scene where she delivers a lecture to Preity and her friends, blow you into pieces.\n\nThe other supporting cast is just horrible. Every other individual is just annoying and doesn't just impress at all.\n\nOh, and I forgot about the alien completely. He looks cute and one would like to hug him as well. Not that bad from Bollywood's point of view. Of course, KMG isn't a HOLLYWOOD film. So, the alien is fine in that regard!\n\nOVERALL, a good, and very different type of entertainment altogether. The film is UNIQUE! It's not that GREAT! But could have been a lot better, had the climax been done with perfection. That's where the film is unimpressive!\n\nAlso, the basket ball match is boring. I didn't like it that much.\n\nBut then again, nothing is, and nobody's perfect in this world. And that's how, we should take KMG in the end... expecting it to be a good quality entertainment and not larger than life thing!\n\nI'm satisfied here!\n\nRating : 8/10."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "husnain_05",
        "review_rating": "10",
        "review_title": "Hrithik and Priety were great together.",
        "review_detailed_main": "Sanjay Mehra (Rakesh Roshan) is a mad scientist involved with the research of extraterrestrial life. After spending many years in the scientific field, he succeeds in inventing a computer capable of transmitting messages into space.\n\nHis belief turns into reality when his invention begins to communicate with a space ship. But before Sanjay can enjoy the fruits of his labour, he and his wife Sonia (Rekha) meet with a horrific accident. Sonia survives but Sanjay loses his life. He leaves behind Rohit,(Hrithik Roshan) his mentally retarded son whose only compassionate friend is Nisha (Preity Zinta). One day, Rohit stumbles upon his father's computer. Inquisitive to know what secrets the old computer holds, he decides to set it up with the help of Nisha.\n\nUnaware of the consequences which are to follow, both Rohit and Nisha become engross with the display of images on the monitor. But all of a sudden, the whole town witnesses a blackout and much to everyone's surprise, a colossal spaceship is sighted - very much like what we have seen in Steven Spielberg's latest television series, Taken. This marks the beginning of some sinister goings on. Footprints are discovered in a near by woodland. But their shapes do not correspond to that of a human or animal. If you want to know what happens next watch Koi mil gaya."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "paribadar",
        "review_rating": "8",
        "review_title": "AAn other flick by Rajesh Roshan",
        "review_detailed_main": "An amazing drama copied from Hollywood film. I think it was Hrithik who was the best in the film. The story was copied of Hollywood film. E.T 's copy well done Rakesh Roshan for making such an great copy.\n\nHrithik was the best ever.\n\nMusic was fabulous so is the the super six. Preity looked fantastic so is Hrithik.\n\nEditing was great so is the flick copied from the E.T\n\nRekha was excellent. The direction was great but I tell you each bollywood film is copied from Hollywood film. Those directors do amazing jobs and than here bollywood copies. They don't get original ideas. I mean why can't you make great movies like original like water and like DDLJ. K3g and original like anand film.\n\nAlways running behind Hollywood. Dhoom and Dhoom 2 is an copy of a Hollywood film as well. Be original damn you people. Get real and to take the plagiarism of other films. this flick was good copy but be real."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "aparna-1",
        "review_rating": "2",
        "review_title": "Koi Mil Gaya - Just Met Someone .....",
        "review_detailed_main": ".....Here that someone is none other than ET - Extra-terrestrial !! - come right from the Outer Space.\n\nThe hero of the movie is shown here as a mentally challenged boy whose mental maturity level stops maturing after 6 years ..but physically he grows up to be a highly muscular, hulk of a man.\n\nHis playmates are of course kids between the age group of 6-8 . He is teased by his earlier classmates but he does not mind as he does not understand that he is being teased.\n\nIn comes a beautiful, scantily dressed oomph - shown driving the open jeep - don't miss her short skirt - and the kid-at-heart hero falls in love with her and expects her to marry him ! His Mother then explains him that his father was a scientist who had found out a way to connect to the outer space and invite the people residing in the outer space ..and when she was carrying him - they had met with an accident as the Outer space creatures had actually come down and messed up a lot many things ! So the reason behind his immaturity was the Outer space fella.\n\nThis, the Outer space fellow was hearing it all , hidden in the basket (as he had already descended on Mother Earth and was taken care of by the hero)- The ET heals him and he becomes the most macho - most sought after man around.\n\nThe heroine obviously agrees to marry him quickly and alls well that ends well !!\n\nConclusion : The Bollywood Directors are basically infants at heart and have reached the peak of pitiable condition ! - also they are showing false hopes and dreams to the physically challenged and handicapped children as they all know that nothing of this sort will ever happen with them...but this is not stopping them from falling in love with some pretty neighbourhood lass and getting heart- broken in return - as no normal girl would like to spend the rest of her life with an idiot.\n\nBefore making a movie, the Directors should think of the consequences as well !"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Herag",
        "review_rating": "",
        "review_title": "Mai Kya karo Ram muje Jadoo Mil gaya,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "disharma-24131",
        "review_rating": "10",
        "review_title": "Brilliantly portrays the innocence, childlike wonder of the character",
        "review_detailed_main": "Koi Mil Gaya is a popular Bollywood film released in 2003. Directed by Rakesh Roshan and starring Hrithik Roshan, Preity Zinta, and Rekha, the movie falls into the genres of science fiction and drama. Here's a review of the film:\n\n\"Koi Mil Gaya\" is a heartwarming and entertaining film that takes audiences on an extraordinary journey. The story revolves around Rohit Mehra (Hrithik Roshan), a mentally challenged young man who comes across an alien and befriends him. The alien, named Jadoo, possesses special powers and helps Rohit discover his own abilities and potential.\n\nOne of the standout aspects of the film is Hrithik Roshan's exceptional performance as Rohit Mehra. He brilliantly portrays the innocence and childlike wonder of the character, making the audience empathize with his struggles and cheer for his transformation. Hrithik's dedication and commitment to the role are truly commendable.\n\nThe film beautifully blends science fiction elements with emotional depth. It explores themes of friendship, love, and acceptance, making it more than just a typical sci-fi adventure. The relationship between Rohit and Jadoo is heart-touching, and their bond forms the emotional core of the movie.\n\nThe visual effects in \"Koi Mil Gaya\" were groundbreaking for Indian cinema at the time of its release. Though some of the effects may appear dated by today's standards, they were impressive for their time. The movie successfully creates a believable alien world and captures the awe and wonder of encountering extraterrestrial life.\n\nThe songs, composed by Rajesh Roshan, are melodious and memorable, with \"Jadoo Jadoo\" and \"Haila Haila\" becoming popular hits. They enhance the storytelling and add to the overall charm of the movie.\n\nHowever, \"Koi Mil Gaya\" does have its flaws. The pacing of the film could be tighter, particularly in the second half, where the plot meanders at times. Some of the comedic elements may feel forced and unnecessary, affecting the overall flow of the narrative.\n\nDespite its shortcomings, \"Koi Mil Gaya\" remains an enjoyable and heartfelt film that captivates the audience with its emotional core and unique premise. It introduced a new dimension to the Indian sci-fi genre and showcased Hrithik Roshan's versatility as an actor. If you're a fan of feel-good movies with a touch of sci-fi, \"Koi Mil Gaya\" is worth a watch."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "amu_26",
        "review_rating": "10",
        "review_title": "MIND BLOWING PERFORMANCE BY THE INDIA'S MOST UNDERRATED ACTOR",
        "review_detailed_main": "I never had an iota of doubt that Hrithik is going to rule bollywood for at least a decade, his performance in Koi.. mil gaya is simply superb. i cant think that any of his contemporaries wud have been able to do the role with great ease and aplomb with which he carried it off, only other actor who cud have been able to do the role wud have been sanjeev kumar if he was young and alive. Coming to the film.. It only and solely belongs to Hrithik Roshan, this mentally challenged role required lot of sincerity and Hrithik has given his 200 percent to the role, Rekha is also superb, her outburst over Prity and her friends in the first half bound to give u impression that how good she is in carrying of emotional scenes, what i liked more about the film is that for the first time in Indian cinema history i have seen such refined special effects, thank god days of double standard special effects are gone, even if it is for the time being i am happy that I can compare one Indian movie with the quality and technique of Hollywood.... I can only say that this movie is worth a watch because FOR LAST 50 YEARS WE ARE SEEING U.F.O. LANDING IN AMERICA, NOW THE TIME HAS COME THAT IT SHUD LAND IN INDIA"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "alexdeleonfilm",
        "review_rating": "10",
        "review_title": "Top entertainment with tour-de-force Retard turn by Roshan",
        "review_detailed_main": "KOI MIL GAYA -- (I've found someone ...) or E.T.lands in India image1.jpegí Viewed during Bollywood film week, Budapest, Oct. 2016, starring Hritik Roshan and Preity Zinta, with a special appearance by the legendary Indian actress, Rekha. Check adult mind and critical faculties at the door. Just come in, munch on you popcorn, kick back, and EnjoOOOOy. Lots of fun for three and a half hours with plenty of cinematic tricks and trompe l'oeil.\n\nKMG is basically a science fiction fairy tale for children of all ages with no holds barred. Director Rakesh Roshan (61) has done his Hollywood homework, basing this movie squarely on Spielberg's E.T. and incorporating a dance sequence that is practically a quote from 'Singing in the Rain'. Through it all dashing Romantic star Hritik Roshan pulls off the challenging role of a retarded young man, with \"a child's mind in the body of an adult\" with such engaging aplomb that he won numerous Best Actor awards in 2004.\n\nUnlike the Hollywood Extra Terrestial, there is no reaching for any kind of scientific validity -- it's all done on a level that any child can understand and that is exactly the charm of this film. There are several basketball sequences where slam-dunks are executed by flying children and forget about normal hardwood reality. This is just entertainment with a capital E and was a blockbuster hit in India, mainly, I guess, for the transformation of usually dynamic handsome leading man Hritik Roshan into a mental retard -- who becomes a hero under the influence of the magical powers of our lovable cuddly blue skinned visitor from outer space.\n\nThe setting for all this is what seems to be a resort mountain town with magnificent Himalayan mountain peaks against which the usual extravagant Bollywood dance numbers are set. The dancing in this film is particularly eye-catching as Hritik, once empowered by E.T. unleashes some of the amazing rubber leg moves that have made him famous as Bollywood's premiere male dancing star. Anyway, pure enjoyment from start to finish. Preity Zinta has gotten a little plump but the extra roundage has not impaired her dancing duets with Hritik one bit."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "jennmunt",
        "review_rating": "2",
        "review_title": "cheesiness at its best...",
        "review_detailed_main": "All right, I'll admit it, I'm a biased, American college student. Anyone from outside the states probably thinks that I'm ignorant about foreign films and the like. But this movie reminded me of t.v. shows that I watched on PBS when I was 6. It was just that ridiculous.\n\nI'm trying to be nice... really. I would agree that the acting of Hrithik Roshan was pretty impressive at some points. But as for everything else, this movie was completely cheesetastic.\n\nSeriously...\n\nI swear that for the first hour or so nothing interesting happened at all. Or at least nothing of any importance. It makes me really sad that I wasted three hours of my life watching this film."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "isha_agarwall",
        "review_rating": "",
        "review_title": "Hrithik Roshan is getting himself confused.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "nataniaf",
        "review_rating": "10",
        "review_title": "Even better than ET",
        "review_detailed_main": "It isn't really fair to compare this movie to ET, since it a Bollywood-style film with singing and dancing, some romance and life lessons, but I personally enjoyed it more. The song \"Ithur Chala\" is still stuck in my head, and i cannot get over Hrithik Roshan's incredible performance as a mentally challenged young adult. his mannerisms and voice are so convincing, I found this movie more emotionally moving than Kal Ho Naa Ho. This movie deserves all of the awards it won and more!\n\nAlso, it should not be viewed as \"Bollywood's attempt at science fiction.\" It is not about discovering extra terrestrial life and the consequences, it is about the power of friendship. The alien is merely a representation of a friend who helps Rohit and receives help in return.\n\nGenerally Bollywood's attempts to \"modernize\" are unsuccessful. For example, the new movie Kuhbie Alvida Na Kehena was melodramatic portrayal of relationships that served as an opportunity for each of the actors (especailly Sharuk) to cry, look tortured and feel sorry for themselves. This Hollywood-esquire film still captures the innocence traditional of Bollywood while adding in new elements that have not been seen before. Highly recommend for ALL ages!"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "jskog",
        "review_rating": "3",
        "review_title": "Party killer",
        "review_detailed_main": "This movie is a real party killer. I didn't know anything about it more than that it is an Indian sci-fi movie. Since I enjoy Indian movies I thought that I might be worth seeing, so when I had a bunch of friends invited last week we were watching this movie. And it was not a success:\n\nThis movie is even slower than the average Indian movie. Nothing - that is really nothing - happens the first 90 minutes of the movie. Although the movie is quite cute, its just way too slow. A total party killer. 8 of 10 guests had left within the first third of the movie, which means that I cannot give it a higher rating than 3. And then I've been nice...\n\nTip of the day: try this movie if you have a sleeping disorder. It'll definitely make you fall asleep!"
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Whitejedi",
        "review_rating": "1",
        "review_title": "Where's the off button??",
        "review_detailed_main": "I was actually getting into this film and enjoying it..... until the Hindi hoedown started up. Oh the disappointment left me shell shocked because I foolishly thought that for once a film made in India could be spared all the dreadful Bollywood rubbish. This just proves that Bollywood song and dance DOES NOT GO with science fiction. As soon as the very first song starts, you're reaching for the OFF button which is a shame coz the film was looking really promising up until then but like I said, as soon as the BS starts it turns into a Mr Bean moment full of cringe factor 10. It wouldn't be so bad if the songs actually enhanced the story but they don't. You'd get the same WTf!! factor if you were watching say for example \"Independance Day\" and instead of Bill Pullman's speech to the pilots you got the spice girls bouncing out the hanger singing if you wanna be my lover. That's how disjointed Bollywood is. They shoehorn song and dance into every film because they just can't bloody well help themselves. Kinda like Bollywood torretts syndrome."
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "Mozjoukine",
        "review_rating": "",
        "review_title": "Striking mix of naive and sophisticated film show cases a substantial lead performance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254481",
        "movie_name": "Koi... Mil Gaya",
        "movie_rating": "7.1",
        "review_username": "iwfsniw",
        "review_rating": "",
        "review_title": "New type of Hindi movie, very entertaining",
        "review_detailed_main": ""
    }
]