[
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kingderella",
        "review_rating": "6",
        "review_title": "awful... and yet and yet",
        "review_detailed_main": "the original comic book version of tank girl is a cheerfully nonsensical riot of sex, violence and awesome fashion. unfortunately, for some inexplicable reason, the filmmakers have decided that the film-version of tank girl has to make more sense and be more \"deep\". so they gave her an environmental motivation, a shy best friend she can empower, and a little girl whos mother figure she can be. none of this works, and it takes away a lot of the charming randomness that made the original tank girl so awesome. add some pretty bad performances, unfunny jokes and a boring plot, and you have a seriously awful movie. and yet and yet... i found myself enjoying it. is it because of my low expectations? or because of my weakness for ass-kicking female leads? the funky costume-designs? the high energy level? or was i just won over by that male strip early in the movie? (every movie should start with a cute dude getting nekkid!) whatever it was, tank girl is fun despite its frustratingly low quality - the way barbarella or xena warrior princess are fun."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ufster-2",
        "review_rating": "6",
        "review_title": "One trick pony",
        "review_detailed_main": "Interesting concept, creative art style, cute characters and a goofy tone throughout but that's about it. It's like the generic romantic comedy of light cyberpunk(ish?) movies, lacks real depth, has one gear and sticks to it and last but not least can't build on the universe. This is unforgivable in any movie which asks that little bit more from the audience to suspend disbelief, like one set in a post apocalyptic Australia ruled by the iron fist of a mega corporation in a fascistic regime. The creators probably thought the silly tone would make the audience overlook this lack of story building but as a result the movie ultimately falls short of the premise and fails to capitalize on the aforementioned positive aspects.\n\nAs a final note, this movie is not cyberpunk. It has some influences (just like the comic series) of cyberpunk but that is as far as it goes."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "lost-in-limbo",
        "review_rating": "5",
        "review_title": "It's bad- but it has some charm to it!",
        "review_detailed_main": "It's the year 2033 and Kesslee, the leader of Water & Power holds the World in his clutches as he controls all H20 after the meteor hit creating vast desert wastelands, though tank girl and Jet girl team up with some scientific kangaroo creations called Rippers who want to bring down Water and Power.\n\nWhat you get is a very colourful over-the-top and in-your-face film on a British cult comic strip. I have never read any of these comic books, so I don't know how true the film is- but from what I mostly heard and read, it's not- but who cares it looked like it would be a fun viewing.\n\nAfter watching this mess I don't know why? As I just couldn't bear to fully bag it out and that's why I gave it 5. I know it was trash- but still I found it visually good and kinda amusing\u0085 in a stupid way.\n\nThe script is awfully bad, the performances were mostly ludicrous and direction was quite tragic, as the scenes just seem to limp along without any panache. Though the film makes up for it with its upbeat soundtrack that was coordinated by Courtney Love and featuring the likes of Bjork, Hole, Iggy Pop, Bush and Veruca Salt, while it's vibrantly rich and bizarre comic backdrop is quite eye-catching, even though the sets do look kind of cheap. The added comic cartoon interludes throughout the film I found to be more satisfying at times than the actual live scenes, making you think it would have probably been better if they stuck to a cartoon version.\n\nThe performances I had mix feelings about. Lori Petty as Tank Girl was fair and brings a chirpy attitude- but the humour at times was a bit stale, especially some of her cringe-worthy one-liners and from what I grasp about the character she was playing she totally looked the part but was no where near what she acts like in the comic series. Namoi Watts as Jet Girl I thought was the standout, which isn't saying much- but she was far subtle and innocently sweet and that worked for me. Malcolm McDowell wasn't too bad, as he really hams it up as the villain Kesslee and Ice-T as a Ripper is unrecognisable and fairly irritating- but anyway what's new?\n\nThe direction was really muddled, mainly flashier- but no substance in the scenes to make it stand out from the average Sci-fi film and the pace of the film was a bit patchy in spots, such as the flat musical scene and when Tank and Jet girl were hanging out with the rippers at their base. The Ripper designs were reasonably good by Stan Winston, with each with their own personality and distinguishing features- but that didn't make them likable.\n\nWhile the plot, if there was one was just basically a been there done that feel and lack any sort of detail and urgency. I thought the story started out alright and was quite lively but it kind of lost steam halfway through and especially when the annoying Rippers took centre stage. There are some interesting elements thrown into the mix, like the device that sucks water out of people.\n\nFor me it's one of those films that it's so bad, it's good entertainment. So it breaks even for me."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "roarshock",
        "review_rating": "",
        "review_title": "Even comics characters need at least two dimensions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "clairefairy",
        "review_rating": "1",
        "review_title": "Completely inaccurate to the comics",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Atrocious",
        "review_detailed_main": "There are many bad comic book adaptations out there, but TANK GIRL ranks as one of the very worst. This is a horribly dated comedy-action film set in a post-apocalyptic world ruled over by an evil megalomaniac, played by Malcolm McDowell with maximum ham. Into this world comes Tank Girl as played by Lori Petty, a loud, bratty, and entirely overbearing young heroine who proceeds to kick plenty of backside as she takes the fight to the bad guys.\n\nI remember thinking that Stallone's much-maligned JUDGE DREDD, which came out in the same year, was actually quite a fun film and TANK GIRL serves to prove that opinion; it makes JUDGE DREDD look masterful by comparison. This is a loud, brash, noisy, and stupid film, without an ounce of wit and plenty of stupidity instead. You have to wonder what possessed the producers to make such a derivative and dumb movie, filled with one-dimensional characters and no real plot amid the insanity. Modern viewers can only sit back and wonder at Naomi Watts in an awful early acting performance and the stupidity of the costumes of those kangaroo people which come straight out of a kid's film. So bad it's good? Nah, so bad it's plain silly."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "trouvere_2000",
        "review_rating": "7",
        "review_title": "Fantastic Cult Classic!",
        "review_detailed_main": "A lot of people tend to dismiss this movie because of it's \"comic book\" feel and comic-book (really) transitions.\n\nI enjoyed this movie a LOT, as it has the same \"feel\" as the original comic books I remember reading, and the same style of humor. It's very well done for 1995, the dialogue is well-scripted for the intent of the movie, and the funny stuff is actually funny. Some of the action scenes are a bit \"campy\" - but then again, they're *supposed* to be that way in this kind of movie. In addition, I thought the acting was excellent, and that Lori Petty (who played \"Kit\" in \"A League of Our Own) Malcolm McDowell (practically legendary) and Naomi Watts were excellent choices for their characters, as were the rest of the supporting cast. Lori Petty hasn't been in anything \"huge\" since this movie, which is truly a pity as she is an excellent and versatile actress. Look for some interesting supporting actors, including Ice-T, Iggy Pop, and James Hong.\n\nListen to the comedic dialogue carefully - most of the punchlines are funny on several levels, which I found most refreshing, and you'll encounter a lot of funny double-entendre.\n\nDon't look for a bunch of CGI computer effects in this movie. However, well-designed and imaginative props and sets give a good feeling of \"authenticity\" to the scenes, and the visual and special effects are excellent.\n\nDon't bother critiquing little details and spurious claptrap like that with this movie - it sets out to be a comic-book-style fun action-adventure and accomplishes that goal magnificently. (The funniest thing is that the plot precept of a mega-corporation in control of the world's water supply is becoming more and more of a plausible idea and leads one to think of a possible metaphoric reference to the world oil situation) This movie might have been rated \"R\" at the time for adult situations & violence (and a little nudity), but I didn't notice a whole lot of \"foul language\", and I didn't really see much in the movie that wouldn't be put on broadcast TV today.\n\nThis movie has everything - good acting, evil villains, cute heroines, mutants, cool vehicles, explosions, big sets, a huge supporting cast, hilarious humor, great stunts, and even a classic musical number with a full chorus line! (\"Let's Do It\" by Cole Porter) It even pokes fun at beat poetry. All-in-all, well worth seeing.\n\nIf you like stuff like \"The Wizard of Speed and Time\", \"Flash Gordon\", \"Johnny Mnemonic\", \"Space Truckers\", \"Ice Pirates\", or \"Yellowbeard\" then you'll definitely love this movie. Even if you don't, see this movie anyway - it may change your mind about this genre.\n\nFrom personal experience: \"Chicks dig this flick.\"\n\nGet the popcorn & enjoy."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Jimbobobtel",
        "review_rating": "1",
        "review_title": "7 year wait ends in tragedy",
        "review_detailed_main": "When this movie first came out there was a lot of hype and I was keen to see it. Unfortunately (at least I believed it was unfortunate at the time), I never got around to it and so it was consigned to the \"I'll get the video out one day\" bucket.\n\nRecently, it was screened on TV so I recorded it. I was excited. I had waited a 7 years for this. And that is the why I forced myself to sit through the whole thing despite the signs being bad initially, falling to awful, then 'oh my god' and somehow still managing to sink further by the end.\n\nThis is the first time I've ever written a review of a movie for IMDB but was compelled to do so to try to save others from the suffering I endured as a result of this movie.\n\nTo name but a few of the very worst elements (and I really am skipping a *lot* of other bad things): i) Continuous \"cool\" \"attitude\" from the \"sexy\" heroine. Note the usage quotes to indicate those terms I believe to be woefully misused. By the end I really *really* wanted the bad guys to kill her. ii) Mutants (including Ice-T!!) dressed up as human kangaroos. Suspension of disbelief became challenging at this point. iii) \"Humour\" on a par with that of David Brent in The Office. For those who haven't seen The Office, David Brent is the ultimate exponent of not-funny-but-thinks-he-is and the point of the program is largely how cretinous he really is. Actually, Tank girl's writers were possibly worse. iv) No, sorry, can't really go on as the flashbacks are too painful.\n\nTank Girl has now taken the crown as the worst movie I have ever seen away from Highlander 2. I really didn't believe it possible, but there you go."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mikeburdick",
        "review_rating": "7",
        "review_title": "Underrated and ahead of its time",
        "review_detailed_main": "A comic book with a female hero in a post-apocalyptic world with mutant kangaroos. I can see why this didn't go over big in 1995. But these days, with comic books being regularly made into films, it's worth taking another look at this little gem.\n\nI can remember enjoying this film back then, but having viewed it fresh, there's a lot to admire: It's got energy. It's got a killer soundtrack. It's chock full of feminist grrrl power. The casting is interesting, from Malcolm McDowell and Naomi Watts to Ice-T and Iggy Pop. There's a seamless flow between the comic book and the live-action. The old-school, in-camera effects are pretty flawless—they dropped some serious coin. And Lori Petty really nails it, bringing a comic book character to life.\n\nLook, there's no deep moral message or \"hero's journey\" here—it's based on a comic book, after all. It's just fun, escapist entertainment. I'm generally a fan of world cinema, and \"Tank Girl\" is by no means a classic. But if you appreciate films that take chances, break the mould and don't take themselves too seriously, it's worth a watch."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tonygillan",
        "review_rating": "1",
        "review_title": "Possibly the most irritating performance ever by a lead actress",
        "review_detailed_main": "I watched this film thinking it might be in the spirit of Indiana Jones, but frankly it was only the fact that I never leave a cinema before the end of a film that prevented me from heading for the exit. I actually became annoyed with it for not finishing sooner.\n\nThe main problem was Lori Petty and her grating speaking voice. Didn't it grate on the director and casting director too?\n\nSilly I like. Stupid is rather different. This was stupid. The premise, the costumes and the scenery were fine. The dialogue on the other hand...\n\nAvoid at all costs."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "binro-1",
        "review_rating": "10",
        "review_title": "seriously under rated",
        "review_detailed_main": "This movie seems to have gotten a bad rep on IMDb. Less than 5/10??? It ain't Shakespeare, but it's better than that.\n\nThis movie was unpretentious and fun. You could clearly see that everyone involved in this project was having a good time.\n\nTank Girl is a campy comic-book splashed up on your screen. The folks who take it too seriously should lighten up. It was well written (as camp) and I really enjoyed all of the characters. It's the ultimate \"In your face\" movie. The feminist subtext was interesting. I didn't notice it right off, I was too busy enjoying the ride. But if you look at all of the characters, it's the women who are strong, and all of the male characters are either villains or are defective in some way (1/2 human Rippers).\n\nIt was (and is) one of my favourite flicks and I can be very critical of badly done movies."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "gavin6942",
        "review_rating": "7",
        "review_title": "Whatever Happened to Lori Petty?",
        "review_detailed_main": "Based on the British cult comic-strip, our tank-riding anti-heroine (Lori Petty) fights a mega-corporation, which controls the world's water supply.\n\nThis film is a very unusual adaptation, comparable to \"Super Mario Bros\" in how bizarre it turned out to be. Perhaps luckily, the \"Tank Girl\" comic never had the level of followers as the Mario Brothers, so there were fewer people to complain.\n\nThe film has an interesting parallel with \"Waterworld\", coming out around the same time and both concerned with water: one film has too much and the other not enough. This one, however, has the great soundtrack. Not to mention Malcolm McDowell, Iggy Pop and a pre-stardom Naomi Watts. With all due respect to Dennis Hopper, this is the better lineup."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "extravaluejotter",
        "review_rating": "3",
        "review_title": "Should have been animated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "nak15",
        "review_rating": "",
        "review_title": "Gotta love this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Herbiegreatone",
        "review_rating": "1",
        "review_title": "A masterpiece without equal!",
        "review_detailed_main": "I believe that this movie is the Holy Grail of bad films. It has everything one would look for in the worst movie of all time. Most annoying protagonist ever. Check. Terrible acting. Check. Bad storyline. Check. This movie is undoubtedly the worst film I've ever seen which is truly saying something. For years I have scoured late night TV, Wal-Mart bargain bins, and On-Demand looking for a movie to bestow this title upon and I can now say that I have completed this task. This film has no redeeming qualities either. Most movies you can say the acting was bad but at least it had a good premise, but not here this film has nothing going for it. I highly recommend that everyone watch this film because every movie you watch from here on out you can say at least it's better than Tank Girl."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "aimless-46",
        "review_rating": "2",
        "review_title": "Less Suspense Than an Abandoned Train Crossing",
        "review_detailed_main": "Ten years ago if someone had given you $25 Million dollars and challenged you make the worst flick possible with the money (stipulating that ALL the money had to actually be spent making the movie), it is unlikely that you could have deliberately matched Rachel Talaly's \"Tank Girl\". I blundered into a showing of \"Tank Girl\" during its short-lived (and basically disastrous) release and found it memorable for its comic page scene transitions (borrowed from television's \"Wonder Woman\") and its spoof of the action/adventure movie genre. Unfortunately the animation just makes you wish that the whole thing was animation while the moronic nature of all the live action scenes makes you question whether spoofing the genre was by design or by accident.\n\nTen years later it has some retrospective interest relative to the disparate career directions of Lori Petty and Naomi Watts. It is simply impossible to make Petty sexy; no matter how glamed-up, erotically posed, or provocatively scripted. Conversely it is impossible for Watts to not be sexy, no matter how hard they try to detune, grime-up, and disguise her.\n\n\"Tank Girl\" poses the question, why do so many people dislike it, both now and at the time of its release ten years ago? Lori Petty is the most obvious answer. Petty's basic personality embodies the most irritating qualities of Lucille Ball with none of Lucy's humor and charm. She is irritating even in her low-key roles (\"A League of Their Own\"). Apparently she was cast as \"Tank Girl\" for exactly that quality and Director Rachel Talaly managed to bring her full irritating potential to the screen. But the producers forgot to connect the dots before they spent $25 Million on production, irritating is sometimes good in supporting roles (insert Stiffer here) but not as the main character.\n\nAbout two thirds of the way into the story Petty and Watts fall into the hands of a group of genetically engineered fellows called \"The Rippers\". At first this appears to be going in the direction of \"Dark Angel\" meets \"Captain Kangaroo\". But Talaly switches direction a bit and ends up with a post-apocalyptic version of \"Snow White and the Seven Dwarfs\". For a few minutes the movie is actually a lot of fun. Then it is time to get back to the basic story, which by this time everyone (viewers, director, cast, and editor) has pretty much forgotten. This does not pose the post-production problems it does in other movies because Talaly seems committed to insuring that no element of \"suspense\" is present to distract you from Petty's irritating performance.\n\nThe Tank Girl comic strip embodied a freewheeling anti-authoritarian anarchism, with some feminist and even lesbian themes. Although Talaly faithfully captures a small amount of this spirit she fumbles big time with the basic storytelling (insert no suspense). Which is hardly a revelation given her other directorial attempts (including \"Freddy's Dead: The Final Nightmare\" and \"Ghost in the Machine\"-arguably even worse than \"Tank Girl\"). If she actually liked the comic strip she should have yielded control to a competent director or at least someone with a basic talent for directing actors and for making feature films."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "4",
        "review_title": "Not terrible, but not good either",
        "review_detailed_main": "That is my opinion of course. I noticed before sitting down to watch Tank Girl that it has got a bad reputation for being a Hollywoodised bastardisation of the cult comic. As someone who has a lot of fondness for the comic and as an admirer of Malcolm McDowell, I found Tank Girl neither a good or terrible movie. More the disappointing but sort of watchable neck of the woods.\n\nI do give it plaudits for the colourful visuals, the upbeat soundtrack and decent performances from most of the cast. Lori Petty does have some cringe-worthy one-liners but I did find her surprisingly credible, and while Ice-T has some irritating moments he has moments where he is also fun. The best performances however come from Naomi Watts and especially Malcolm McDowell who is over-the-top but in an enjoyable way.\n\nHowever, the script is pretty awful. The one-liners are enough to make you cringe, the humour is stale and it also lacked the sassy black-humoured feel of the comic. The story has a great concept but for me suffered from being too unevenly paced(mostly rushed) and predictable with many moments of dumbness, a couple of limply paced scenes such as the musical scene at the Rippers' base and a few too many moments where it steers off track.\n\nCharacters are a mixed bag. Tank Girl and Kesslee are fun enough, but Jet and Sub Girls are not as interesting personality-wise as they were in the comics and the Rippers more often than not are annoying. Another big disappointment is the direction, which is flashy but also too muddled, never knowing whether it is trying to handle a satire, comedy or futuristic action. Consequently the black, sassy humour could have benefited the satire and the comedy, but seeing as they were missing the humour to me seemed flat, and the more action-like parts looked clunky.\n\nOverall, I was willing to judge it on its own terms and to form my own opinion, but while I don't think Tank Girl is as bad as people say and I have seen far worse movies there wasn't really anything especially outstanding about it. 4/10 Bethany Cox"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Lady_Targaryen",
        "review_rating": "7",
        "review_title": "In 2033, justice rides a tank and wears lip gloss...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Ghulert",
        "review_rating": "1",
        "review_title": "so bad that it hurts...",
        "review_detailed_main": "Maybe it's because I'm no fan of the comics (but if the comics are of the same \"quality\" as the movie, it's hard to believe there are any), but this has to be one of the worst movies ever made. Non-existent plot, laughable acting, dumb dialogue... This movie is so bad that it hurts. A lot. That some people actually gave this one 10/10 is an insult to any good or at least mediocre (or at least bad) movie. If you hate yourself, then watch Tank Girl! On another thought, if you hate yourself THAT much, maybe you should just commit suicide... My rating: -34/10"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "OgreVI",
        "review_rating": "7",
        "review_title": "A Fun, Underrated Action Comedy",
        "review_detailed_main": "I saw this movie when it first came out years ago, and loved it. But it seemed like I was the only one who did; the reviews in the paper trashed it, my friends hated it, and it was out of the theater before most folks ever got a chance to see it. Now it seems to be having something of a renaissance on video. Its reputation is growing, but there is still an awful lot of silly hatred for this film out there, and I think folks are really being unreasonable about it. Okay, so this is a silly movie. So what? It was supposed to be. It's just an action flick. Check out the page for Die Hard, for example. That film rates an 8.0, while this poor movie is stuck at 4.6. Why? Sure, Die Hard had better effects; it had a slightly larger budget, too. But Tank Girl is funnier, smarter (no, really, I mean it) and has far more interesting characters. Lori Petty is sexy and mad-funny. Neither film is high art but this one is simply more enjoyable (and I like both), so why the huge difference in ratings? It seems like the expectations for this film were higher than they should have been, maybe because the feminist theme (good women kicking evil men's butts) misled people into expecting a work of serious political or social intent. But if anyone thought that, they obviously knew nothing about the film or the story coming into it. In the first place, the movie was based on a COMIC BOOK, for goodness' sake. For that matter, the comic in question was basically a feminized and humorized version of The Road Warrior, not all that serious a motion picture in itself. Also, the casting of Malcolm McDowell as the villain should have provided a clue; he's the most reliable bad guy in Hollywood, because you always know exactly the character you're going to get out of him. The trailer, with all the crazy outfits, ridiculous kangaroo costumes, and zany one-liners shouldn't have misled anyone. Plus, why on Earth would expect Citizen Kane from a film called \"Tank Girl\" in the first place? This movie is exactly what you want for kicking back and enjoying an evening: a fast-paced, engaging bit of semi-sci-fi which, surprisingly, really does achieve a few genuinely beautiful moments, especially the dust-shower scene (to Portishead's \"Roads\"). Ignore all the cynics. This film is a blast. It's pure entertainment with a good cast and zany, silly story\u0085it's the closest you'll ever get to a live-action Bugs Bunny cartoon. Just lay back and dig it. P.S. The soundtrack is fun, too."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "postdocct",
        "review_rating": "1",
        "review_title": "Gawd Awful",
        "review_detailed_main": "Looking for the living definition of a bad movie? How about a film starring a woman whose career includes playing a whinny foil to Gina Davis, and Caligula? Is that not the classic definition of on-screen tension? The plot? Weak. The acting? Where? The special effects? An oxymoron for this film. In short, this movie is the living definition of \"you'll never get back those two hours of your life.\""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Mephisto-24",
        "review_rating": "8",
        "review_title": "Great fun and visually interesting, with some wonderful one-liners and buckets of attitude.",
        "review_detailed_main": "One of the best films ever based on a comic, Tank Girl should not be taken seriously, but it's enormous fun, and a badly needed send-up of all those testosterone-pumped action movies. Instead of the usual male buddies, you have two sassy young woman, while a genetically modified and not very bright kangaroo plays the part of the Bond girl. All the leads perform well, particularly McDowell as the villain, and the script has some great one-liners, even if the plot is pretty dumb (it's a comic, ok? Get over it.)"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Raxing",
        "review_rating": "6",
        "review_title": "Not All Movies Have To Be The Same!",
        "review_detailed_main": "This movie may not be a masterpiece, but it is a testament to an era of movie making in which people still made movies for fun. Not all movies have to be high budget Hollywood movies trying to sell to China. Not all movies have to have serious plots, serious characters, and expensive action scenes. People's hatred of anything different is the reason why so many movies today are so unoriginal and dull. Anytime anyone tries anything outside of the standard formula, people rate it lowly and say it was the worst movie ever."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Richard-7",
        "review_rating": "1",
        "review_title": "Unbelievably bad",
        "review_detailed_main": "Saw this on cable. Unwatchable. Makes Manos, The Hands of Fate seem like Citizen Kane. Did anyone actually pay to see this?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "professorclint",
        "review_rating": "",
        "review_title": "Great movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kaukau1",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Horrible, horrible film. Scattered, frantic, with unlikeable characters and an uninteresting plot. The worst movie I've seen in a very long time. I watched about 2/3s of the way through because nothing else was on TV, and then turned the damn thing off and read a book. Nothing anybody does in the whole movie makes sense! None of the characters have coherent motivations, and the lead is especially bad - poorly acted, poorly directed, and poorly written. I'll never get that time back! I will say, though, that the costumes were \"fun\". How bad is that, when the only positive thing you can say about a movie is that the costumes were \"fun\"?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "cerealmon",
        "review_rating": "5",
        "review_title": "Worth a watch either you like it or hate it.",
        "review_detailed_main": "Having been wanting to check this one out for awhile. Well today was the day July 2019. Heard a lot of hate for this movie. Well it isn't bad but very unfocused.\n\nIt feels like the director wanted to get in as much of the comic as possible. I have never read any of the comics so not really sure.\n\nHas a great stylez. It feels like a comic, very well edited and the music is great.\n\nI would give it a watch, definitely will be a cult movie someday."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Quebec_Dragon",
        "review_rating": "3",
        "review_title": "Yes a tank can bomb too",
        "review_detailed_main": "I made the mistake of buying this since I collect comic book inspired movies. Even at 6$ it was too expensive. I thought there might be some campy fun in it, a \"so bad\" it becomes good vibe perhaps, I was wrong. I had watched it once long ago and didn't remember any of it. Now I know why. I was bored out of my mind and was looking for distractions to do something else. I'm all for grrrrl power, punk attitude and absurd humor but Tank Girl does not work on any front. The script is bad, you don't care about the characters and the humor is mostly lame except for a few amusing one-liners. The special effects or locations are poor or often replaced by comic panels or animations that are just too jarring compared to the live-action. It's like they didn't have the money to shoot the cool stuff and so resorted to drawings, however cool they might be (an uncensored animated feature would be way better for Tank Girl now that I think about it). The action scenes were cheesy but not in a fun b-movie way. The tank itself was far from impressive or dynamic although it was interestingly decorated. As a matter of fact, the best action scenes involving the tank were in animation.\n\nIt does have some interesting songs by known artists such as Bjork, Hole and Portishead but instead of improving the atmosphere, they just don't fit most of the time. Once they even break into a ludicrous song and dance number that was just senseless and horrible. I think that's when I totally tuned out. I suppose Tank Girl, played by Lori Petty, looks the trashy punkette part but beyond her \"attitude\" and sometimes barely amusing retorts, is more two-dimensional and superficial than the worst comic book characters. Jet, played by Naomi Watts, is probably the only saving grace of the film and it's amazing how such a good actress was involved in this mess. Malcolm McDowell wasn't too bad playing his usual villain role. It might be a cult movie for some but please consider that it's really different from the original independent comics and the original creators were disappointed with the movie themselves (check out the entry for Tank Girl on Wikipedia).\n\nRating: 3 out of 10"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "dannyshiro23",
        "review_rating": "7",
        "review_title": "It's Marmite*",
        "review_detailed_main": "*other yeast extract products are available.\n\nLoved it back in the day. About to watch it it again in 2019."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "5",
        "review_title": "tanks a lot",
        "review_detailed_main": "Mostly an excuse to be silly, \"Tank Girl\" is pretty fun. I'd never heard of the comic book when the movie came out, so the flick is my only exposure to the story of the tank-driving woman (Lori Petty) in a post-apocalyptic society battling a pernicious corporation that controls the entire water supply.\n\nI would say that the Rippers were probably the coolest characters in the movie. Naturally, it was a surprise all these years later to learn that the flick also starred a young Naomi Watts. But no matter what the case, this is one neat - if trivial - movie! Also starring Malcolm McDowell as the CEO; his role is like an evil version of Alex the Droog."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "stefrance99",
        "review_rating": "7",
        "review_title": "Come on, give it a 5!!!",
        "review_detailed_main": "Granted it's not a piece of art, but hey!!! it's an adaptation of a comic!! Come on guys how many shitty adaptation got way better than this lousy 4.6?? Are you just mad or plain stupid? The first HULK, 5.8!!! Fantastic 4, 5.8!!! Even Spawn & Judge Dredd got it better with 4.7!!! So what if it doesn't have loads of special effect to compensate for the lame storyboard you people put it down?\n\nSo let me just tell you, that movie respected the spirit of the book, the wackiness of the characters and therefore it deserve more than just a lousy 4.6, I don't ask for the moon, give a 5 or a 6 if you want, I just think it's a better than average movie, it's worth watching and enjoying it, and if you are not sure, check the comic first.\n\nThere is one down side in that movie, the rippers which are much more beardy in the comics, they are looking a wee bit too goofy...\n\nAnyway this post is just a cry for injustice"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "supercygnus",
        "review_rating": "1",
        "review_title": "So Bad It's Funny? Nope. So Bad It's Bad.",
        "review_detailed_main": "Where to begin? I've never really gotten into the comic, so I don't know if it's something a fan would prefer more than the average Joe would, but to be really fair, and taking all the merits of the film into account...it's really horrible. I'm trying my best to keep language clean here, so we'll just replace FOOLISH for another infamous word of the same beginning letter and STUFF for another almost as infamous word that also shares the same first letter as it's cleaner counterpart. That being said, who in the heck greenlit such a FOOLISHed up \"movie\"? This type of STUFF drives a FOOLISHing stake through my female parent FOOLISHing heart, as this gets made and some well deserving clever little film, probably deemed \"too clever\" by a STUFF filled studio exec, ends up sitting unmade on some script reader's desk. And LORI PETTY (who's name should in itself should be a profanity, after all of the atrocity we refer to as her film career)? LORI PETTY HEADLINING A MOVIE? LORI PETTY? Well, all I have to say is, she's no Carrot Top. Maybe if she clicks her heels three times and wishes the Aliens that left her here will beam her back up to the whacked planet she originates from. The entire movie can be summed up in one word: obnoxious. I will just pretend Malcolm McDowall wasn't in this and I will say Tank Girl's side kick as cute and likable. Here's to hoping Rachel Talay gets lost on the way to the set to whatever film she plans on directing next, and stumbles into a job that better suits her strengths. What that would be, I do not know, but I feel confident it has nothing to do with film making."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Quinoa1984",
        "review_rating": "9",
        "review_title": "a joyous find to find after so many years... Lori Petty's finest couple of hours",
        "review_detailed_main": "Tank Girl was a movie I had heard about for some years, but had never sought it out; not something I thought would make for quality viewing, some silly mid 90s comedy about some weird girl hero or other. Boy, was I wrong! This is a definition of guilty pleasure, or close to it for a mid 90s comic book movie, and it's one I would be more than happy to pop in on a sick day from work. It's a movie you have to smile at, feel like both the kid in you and the dirty bastard or girly girl loves to chomp on like some stupid comic book that has all the meat and gravy of a full-throttle action story mixed in with lots of irreverent humor. It pops and crackles like a comic book (hell, it even throws in animated segways, maybe as a way to save money, but it looks as cool as anything from the period), and it's got a weird ensemble ranging from Malcom McDowell to Iggy Pop and Ice-T... as a Kangaroo.\n\nLori Petty stars in what could be considered a real career high point. Before seeing her in this I only remembered her as Geena Davis's sister in A League of Her Own, and wondered if she could pull it off. At first her image is like a junkyard Gwen Stefani (and Stefani of No Doubt period), but she's got the attitude of a real bad-ass, which is important as her role in this often pitts her into the likes of Snake Plissken and some other cowboy types, but always with the spunk of a punk rock chick with style and wit to spare. She's in a post apocalyptic world where water is a precious commodity (though, unlike Waterworld, it doesn't flaunt the irony of 'all this water and not a drop to drink', albeit there's a hot 'dust' shower scene). A mad commander of a corporation (McDowell, subtle ham-bone if there could be an oxymoron as such) who controls water and, thus, power. He captures her for hard slave labor, but she teams up with a young Naomi Watts and escapes to a renegade gang of kangaroos as they plot to destroy the evil corporation and...\n\nYeah, kangaroos, and that's not all- one of them is really half kangaroo and half dog! It's all very silly, but it revels in its silliness, and makes a note of every other second or so reminding you how buoyant it is with its reckless energy and humor and design. It's a lot like if a Sci-fi channel of the week movie actually worked well; the production design isn't too tacky and eye-catching on a fairly low budget, the actors are all having a ball playing odds and ends of good guys or kangaroos or villainous water mongers. And at the middle is Petty, who is sweet and charming and dangerous and puts on an outfit and hair style like a reject from the latest Hot Topic catalog (and damn proud of it). You kind of have to dig what she's about in the part to dig a lot of the picture, but once plugged in- on top of stuff like McDowell's reconstruction surgery, Watts with black hair and glasses, and Ice-T and that guy from Buffy as kangaroo manimals- it's hard not to have a total gas with it. If you were a kid in the 90s, its hard not to have a go at it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ShootingShark",
        "review_rating": "7",
        "review_title": "Funny, Cute, Sparky Punk Girl Saves The World Wacky Comic Sci-Fi Action Caper",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Ripe Peach",
        "review_rating": "1",
        "review_title": "Why not just show two hours of the comic books?",
        "review_detailed_main": "Poor old Malcolm McDowell. He seems doomed to play villains in sci fi movies that feature such tiresome protagonists that you end up rooting for him. This is another in the series of big old messes to which he brings a much needed touch of class.\n\n\n\nNobody in this film (the weary veteran McDowell apart) seems to know what their character is supposed to be. There are few actual conversations, mostly confused monologues delivered to empty space; perhaps they're all too embarrased to make eye contact. There's too much budget to allow the raw charm of Repo Man, but not enough to make the FX anything other than embarrasing. Is the titular tank a tardis? Why is it the size of a winnebago inside, and is it a T-72, an M-47 or an M4? Why do bullets strike sparks when they hit sand? Everything about this film is desultory and barely adequate, and every opportunity to take a suprising direction or even provide a decent disjoint is missed. It's the slackness of indie filmmaking blended with the no-risk anodyness of Hollywood.\n\nThe biggest flaw is Petty. She switches from concussed to hyperactive more or less at random, and - while she does have a decent big eyed blank look going - she's simply too old to play a part that requires an almost unachievably idealised fantasy pubescent. Tank Girl needs the insane toothy over-confidence of youth, not the over-cosmetic and over-calculated maturity that Petty displays. She actually does manage to deliver some decently amusing one liners, but most of the time she falls slightly short of being genuinely winning.\n\nI would have given this a full 4/10 for the (initial) geek chic of Jet Girl, and for the unapologetic premise that the only thing not in short supply in this post apocalyptic world are cosmetics and ammo. However, it gets dinged one because of the comic cutscenes. Not because they're bad, but because they're the BEST thing in this mess: that just reminds us there's a fair amount of flair and verve here, being suppressed under the stifling blanket of no-risk filmmaking. And then there's the matter of the Endearing Child Hostage. I know it's a genre convention, but it's supremely annoying and utterly, bone chillingly irrelevant and unnecessary. Then there's the slight problem that towards the end, Jet Girl discovers lipstick and suddenly seems not to need her glasses. That's so teen movie that it's not even funny. So a full 1 out of 10, then. For shame, for shame."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "2001Rulz",
        "review_rating": "",
        "review_title": "Could have been better, but not the worst.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "omp9",
        "review_rating": "3",
        "review_title": "I'll believe Tank Girl would have been better inn all cartoon.",
        "review_detailed_main": "The film is very fast-moving, bizarre and colorful, it's like Mad Max on speed whit tons of colorers and make-up. Also very Cartoonish, as that said; cartoon sequence pops up here and there. The plot is also very saucy, but I'll believe it's meant too be. The thing that really drives me crazy in this movie, is the characters, they are painfully irritating, especially Rebecca played by Lori Petty, she's really annoying (I'll believe she is the most annoying creature I've ever seen). The editing is also annoying, very MTV stylized. Another thing that's missing from Tank Girl is an exciting adventure. The humor isn't much funny either. It has some nice visuals though.\n\nHowever a lot of people love this film, most of them are women, and that's not weird at all, because this movie is all about girl power.. Tank Girl this is a real chick flick, and the best example of an hate/love film."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Tracy_Terry_Moore",
        "review_rating": "2",
        "review_title": "I don't remember eating this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "morphion2",
        "review_rating": "5",
        "review_title": "Not for most... perfect for some.",
        "review_detailed_main": "For those unfamiliar with the cult British comic strip, which first began in 1988, Tank Girl will come as a bit of a shock. Directed by Rachel Talalay, the film is, visually, a little jarring, and the story is bizarre and really very silly. The jokes are mostly pretty crude, the premise for the plot is needlessly complex and the acting is nothing sensational. All in all, it's hard for me personally to come up with one valid reason for why I enjoyed it so much.\n\nThe year is 2033, and the earth is now rather barren; since a meteor hit the planet 11 years ago, it has ceased to rain. Water and power have been monopolized by a big, heartless company, aptly named Water & Power, and run by evil super-villain Kesslee (Malcolm McDowell). In the desert, however, lies a hippie rebellion commune who are secretly stealing water, whilst attempting to stay safe from the infamous race of monsters that live under the earth, known as Rippers. Amongst this community lives Rebecca (Lori Petty), a boisterous, fun-loving, thrill seeker with no respect for authority. But when Water & Power soldiers find out that their water is being stolen, the hideout is raided, and Rebecca is taken captive to work for the evil Kesslee. But wait; there's more.\n\nRefusing to co-operate, Rebecca is kept with countless other prisoners until she accepts the offer. Whilst here she meets a shy, submissive mechanic girl known only as Jet (a young and dark-haired Naomi Watts, sporting her natural Australian accent). Convincing Jet to rebel against the oppressive institution and break free with her to claim their lives back, they steal a plane and a tank to escape, the latter of which Rebecca takes a liking to, and thus the title.\n\nAnd the film carries on in this manner. Really, the plot is just an accessory to the outrageous absurdity that is the film and that some will find funny and others will not. Though playing a rather irritating character, Lori Petty doesn't give a terrible performance as Rebecca, aka Tank Girl. Malcolm McDowell, Naomi Watts and music performer Ice-T also do the best that can be expected, and they are all clearly having fun with this big goof of a movie.\n\nOne thing that the picture could be praised for, in terms of filmic value, is that it turns so many tired genres on their heads. The gratuitous violence and gaping plot holes akin to action movies (where the bad guys can never aim), the underlying voyeurism that seems to always come with Hollywood films that have any female characters, these things are all brought right out to the front and put in your face, a long overdue wake up call to film-makers who rely on such transparent cinema devices.\n\nApart from this, Tank Girl is really just a big silly joke. One that I, for some reason, actually found pretty entertaining and funny. What does that say about me, I wonder?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Rammstein-2",
        "review_rating": "6",
        "review_title": "Stupid but loads of fun",
        "review_detailed_main": "This really is a stupid film. Starring Lori Petty as the WEIRD Tank Girl and ICE-T as her human-kangaroo hybrid boyfriend (I particularly appreciated that one), this movie is one of the most weird and stupid movies I have ever seen. Actually, ICE-T:s character says it all. Just met me add: don't rent this movie when you want to watch something serious. It sure isn't."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tomshallruletheworld",
        "review_rating": "1",
        "review_title": "Awful.",
        "review_detailed_main": "This film commits the biggest sin in cinema, that is making the main protagonist completely unlikeable. I hated her voice, I hated her hair and I hated her personality. Where as other films like \"A Clockwork Orange\" had an Anti-Hero as a protagonist, I couldn't bring myself to dislike him even when doing these cruel sickening things, I can't even remember Tank Girl's name. Speaking of A Clockwork Orange, Alex (Aka Malcolm Mcdowell is in the film and he needs to escape before it's too late. The film feels so forced and contrived as well. I recall there was a Dance number out of nowhere. Why was it there? What point did it have? It in no way moved the plot forward. That's basically this film, a collection of plot points bridged together by pointless filler. Stay far away."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Al_The_Strange",
        "review_rating": "6",
        "review_title": "Tank Girl review",
        "review_detailed_main": "First thing's first: the film's opening credits montage is pretty darn cool. With the rock music and the flashing comic-book images, I was lured in with the promise of a truly punk-spirited post-apocalypse adventure.\n\nWell, the film delivers, in the sense that it's set in a post-apocalyptic world, and there's adventure. This is also a very wacky film, with cartoony comic relief, cheesy action, and a very cheap production value. The good thing about this film is that the main character's attitude is so wild and fun that accentuates the goofy nature of the film, and delivers the punkish vibe I was expecting. Everything else, however, tends to be rather ridiculous. It makes for a weirdly mixed experience overall.\n\nThis story is pretty basic stuff, lacking in depth or emotion. The plot wanders all over the place, lacking in specific direction. Chances are that you've seen better structure and deeper meaning in other great sci-fi films that bear all the same plot elements and characters. Tank Girl squanders its storytelling potential in favor of just being kooky.\n\nThis film uses pretty standard photography and editing. Comic book images are cut in at various places. A couple of scenes are animated, and those are probably the coolest parts. Acting is extremely cheesy and over-the-top; Lori Petty uses such cheese to craft an deliciously fun and hip performance, while a very young Naomi Watts plays a perfect square, and Malcolm McDowell does his usual schtick. Writing is pretty simple-minded. This production has sets, props, and costumes that are so cheap-looking, colorful, and clean; the film almost looks like what you'd get if Pee Wee Herman's playhouse survived the apocalypse and went just slightly feral. Music is alright; the score is okay, and a number of good songs are used to give the film a little more oomph to the punk factor.\n\nMuch like the actual tank in the film, Tank Girl is a cheap-looking, colorful, gaudy, haphazard assortment of random parts and cute decor. It's definitely cheesy, but it is pretty fun that way regardless. I'd say it's perfectly fitting next to other weird, cheap, and cheesy flicks like the Super Mario Bros movie, or Howard the Duck. If those appeal to you, then Tank Girl might be up your alley. Otherwise, move along, nothing to see here.\n\n3/5 (Entertainment: Good | Story: Poor | Film: Poor)"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "grimacinglummox",
        "review_rating": "1",
        "review_title": "Practically Unwatchable",
        "review_detailed_main": "Why Lori Petty was cast as tank girl, I'll never know. Her acting performance is lack-luster. Her voice is grating. It's almost impossible for me to put into words how bad this movie is.\n\nThere are several \"modern-pop\" references in the film, which I found to be very strange, given that the movie was supposed to take place far in the future. It wouldn't have been hard to make this premise interesting either. Some better writing would have helped loads.\n\nNaomi Watts makes an appearance in it as a mild mannered techno-geek. I think they should have probably switched roles.\n\nI'll never know why anyone would like this movie, unless they were a Petty fan.\n\nTry not to see this movie. Total waste of time."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "preppy-3",
        "review_rating": "10",
        "review_title": "One of a kind and I mean that in a good way!",
        "review_detailed_main": "Movie adaptation of a British comic book. It's 2033--Earth had been hit by a giant comet 11 years before. It wiped out most of civilization and (somehow) caused it never to rain again. Water is in very short supply and evil Kesslee (Malcolm McDowell) is hoarding it all and controlling it. He's attacked by the Rippers--a gang of mutant man-animals (don't ask). He also attacks Rebecca (Lori Petty) and destroys most of her friends. She vows revenge. That's (sort of) the plot.\n\nThe original comic book was great. Tons of sex, nudity, violence, strong aggressive women and a stubborn refusal to take itself seriously. The movie tries to recreate that--and it succeeds! The nudity is gone and sex and the violence were toned down but the strong female characters remain. It all starts out with a great opening song and cartoon images from the comic book shoved in your face. Then Rebecca orders her boyfriend Richard (Brian Wimmer) to strip at gunpoint! Then it starts to get strange... There is a plot but the story keeps taking detours with STRANGE (but fun) dialogue, a loud aggressive alternative soundtrack, animated sequences and even a show stopping song and dance number! This all somehow fits together and the movie never stops moving. Set designs are incredible--filled to the brim with pop culture. Director Rachel Talalay deserves credit for keeping this all together.\n\nThe acting is great--McDowell goes over the top (enjoyably), Naomi Watts is fun as Jet Girl and Petty is just beyond belief as Tank Girl. Loud, aggressive, snapping off one-liners left and right and a STRONG female character who never stops fighting. Just great all the way! United Artists had no idea how to market this picture (it IS difficult) so it bombed but it acquired a cult following. This isn't for everybody (a lot of critics hated it) but I loved it. A 10.\n\nBest exchange: Tank Girl asks the madam of a whorehouse to sing. The madam asks, \"What song?\" Tank Girl responds, \"Let's Do It by Cole Porter, 1929.\" The madam: \"I HATE that song\"."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "She'll be fun to break....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "blagtoof",
        "review_rating": "1",
        "review_title": "Overall, just terrible",
        "review_detailed_main": "A bad movie based on a bad comic book. The plot was full of holes and the acting was lackluster at best. Very little story cohesion. I never really got to, \"know,\" any of the characters as character development was nearly nonexistent. After the first twenty minutes I struggled to maintain an interest in the movie. Do yourself a favor and skip this one."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "gundamgirl2386",
        "review_rating": "",
        "review_title": "You have to have a warped sense of humor to REALLY get it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "jessegehrig",
        "review_rating": "2",
        "review_title": "here comes Johnny Yin again, he's like a sex-machine, with the liquor and drugs, he's gonna do another strip tease",
        "review_detailed_main": "Hard to understand. Its an \"R\" rated movie but its written for children, or maybe the problem is that it was directed and produced for children, whatever the case as an adult watching the movie is awkward. I'm not developmentally delayed so the child-like humor and wit of the movie is like drinking sulfuric acid, I mean Lori Petty's acting and delivery causes real pain. Some cut-scenes show the comics this movie is adapted from and those scenes are intriguing those scenes are vivid glowing things- and when you think that its merely comic book art stills, y'know, motionless movie frames then compare it to the actual motion picture, its clear that the drawings are the best parts. Everything sucks, the lighting the acting the costumes the sets, but raise a glass to Naomi Watts, she can actually act and is gorgeous as a brunette."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "BA_Harrison",
        "review_rating": "2",
        "review_title": "A charmless, chaotic mess.",
        "review_detailed_main": "In Rebecca Buck (aka Tank Girl), as played by Lori Petty, we have what is probably the single most irritating live-action comic-book character ever to make it to the silver screen. The intention was clearly to make Rebecca a lovable, quirky, anarchic, spunky, funny, sexy, alternative anti-heroine with attitude, someone with whom everyone, regardless of their sex, could fall for. Petty's grating grrl-power performance ensures that the opposite rings true: she is shrill, obnoxious and tiresome in the extreme.\n\nUnfortunately, Petty's painful performance isn't the only problem with Tank Girl. Director Rachel Talalay's attempts at capturing the rebellious spirit of the comic fall flat on their face. With seemingly no understanding of what does and does not work, Talalay chucks everything onto the screen no matter how cringe-worthy, including what could qualify as the most awkward song and dance number in the history of cinema. Meanwhile, Malcolm MacDowell and Ice-T chalk up another bomb on their respective filmographies and make-up legend Stan Winston tries but fails to make human kangaroos not look as stupid as they sound.\n\nA cool alternative soundtrack adds some much needed oomph to proceedings, there are some surprisingly slick scenes of animation (that suggest that the whole thing would have worked far better as a feature length animated movie) and Naomi Watts is likable as Rebecca's nerdy side-kick Jet Girl (the actress looking great with dark hair), but it's nowhere near enough to prevent this film from being a tedious, virtually unwatchable mess."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "SalutToi",
        "review_rating": "2",
        "review_title": "For Spice Girls fans",
        "review_detailed_main": "I really don't see what this movie has to offer unless you are a 13 year old Spice Girls fan totally into that \"girl-power\" thing. The whole movie is about the clothes, make-up and weird haircut of the lead actress. No deadly situation can stop her from delivering yet another cool one-liner and she always look her \"best\" (3 inches of fresh make-up and a new wardrobe) even after spending days crawling in a desert. The use of very long samples from hip-back-then rock bands and the very long cartoon intermissions totally kill the little momentum the movie has going. The story and acting are as pathetic as the \"special effects\" (you can clearly see the cables in the back of the jumping half-human creatures). Worst than Battlefield Earth. 2/10."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "bheadher",
        "review_rating": "6",
        "review_title": "You cannot appreciate this unless...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Jakemcclake",
        "review_rating": "5",
        "review_title": "Back in 1995 I was Lookinng For A Sexy Movie and I Found It But Not The Way I Expected",
        "review_detailed_main": "It was a Sunday in April 1995, and that I would find this Tank Girl Movie I saw advertised. I though Tank Girl being a bad ass woman would also be sexy, as I was into that sort of thing. I had to drive about 30 miles to find a theatre that still had it, and finally I found one in another State. Obviously this being a couple weeks after Tank Girl came out, this meant the movie did not do well.\n\nI watch Tank Girl and did not realize I was watching the same Lori Petty who played \"Kit\" the sister of the Baseball Star in \"A League Of Our Own\". Despite being a badass chick who always rode a Tank, Tank Girl herself was far from sexy. The hair the, tattoos, and the way she dressed, and other things about her were just too manly to be sexy,to me. The movie also interjected Cartoons of Tank Girl throughout, that at times were sexy, but most of the time were not.\n\nThe movie was really not very entertaining either and featured the typical cliché bad guys, who were, about as predictable as watching clock movement. This movie did not feature any deep thinking, or any original ideas, and was simply meant to entertain us with snappy and sometimes \"Off The Wall\" one liners from the Tank Girl throughout, which gets old after a while. There is also interspecies issues in the movie, and the less I think about those...the better.\n\nI was kind of falling asleep in the theatre. when I noticed that one of women in the movie was changing, that being Jet Girl played by Naomi Watts (with dark hair). At that point without giving too much away, Jet Girl goes from a mumbling, mousy under-confident, and quite unattractive, glasses wearing woman to extremely sweet looking and pretty and at that very same moment...\n\nshockingly sadistic and brutal.\n\nThis contrasting change-over that indicates the prettier, the more brutal, was very shocking and for me super sexy!\n\nJet Girl's changeover is the one thing, I will always remember about this movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "blakiepeterson",
        "review_rating": "6",
        "review_title": "An Underdog In Fearless Kinetic Energy",
        "review_detailed_main": "I shouldn't hate-watch movies. I know I shouldn't. You should walk into the theater with zero expectations, leaving with an unbiased impression instead of a smirk. But yesterday, I did something most movie critics should not do: I went to hate-watch Insurgent with my bubbly teenage sister who was most definitely not hate-watching the film. I won't go into details (to be fair, I just posted my review of Insurgent only yesterday), but what I will admit is that I left the cinema with a strong feeling of meh, if that's even a feeling (the youths act like it is these days). It's a \"blockbuster\" for the teen crowd, a B-version of The Hunger Games. Its biggest crime is not being meh; its biggest crime is being so devoid of any kind of personality.\n\nIn 2015, well-crafted action scenes and statuesque leads are not enough — they might have been in 1999, but we can no longer party like its 1999, because 1999 was, well, 16 years ago. Nowadays, all we can depend on is \u0085 spunk. It's a shame that a blockbuster as lame-brained as Insurgent is going to make so much money; what does it really have to offer?\n\nWhich finally brings me to Tank Girl, the 1995 would-be blockbuster that is better known today as being the film that lost $21 million dollars at the box-office, the film that should have made a Lori Petty a star but didn't, the film that Naomi Watts co-starred in before she became the \"it girl\" from Mulholland Dr., the film that now resides in the throes of two golden words: cult classic. I was reminded of the film during, yes, Insurgent, where Watts makes an appearance as the blandly handsome male lead's mother. In the theater, surrounded by giggling teenage girls, I found myself pondering about that money-losing cult classic I had known about but never watched for years.\n\nBut enough for backstories; mine, most likely, isn't as interesting as I'd like it to be. I guess the point I'm trying to make is that it's so unfair that Tank Girl, which is exploding with spunk and personality, is confined to the sad remarkability of a cult film, whereas Insurgent, which is about as interesting as your sad Uncle Alvarez, is going to make millions upon millions of dollars. (Cut to me going outside during this dark, rainy night, falling onto my knees, and yelling \"NOOOOOOOO!\" into the air like no one's watching.)\n\nIt comes down to this: please, please don't see Insurgent. See the breakneck speeded, freakish, abstract, one-liner infused saunter of Tank Girl. It won't make you smarter, and it certainly won't change your life, but I'll be damned if it doesn't enliven your spirits with its out- and-proud weirdness.\n\nThe year is 2033. 11 years earlier, a comet hit the Earth with devastating results, causing an endless drought that has turned most of the world into a parched desert. Little of the population remains; most work for, or head, the scheming Water & Power corporation, who use their massive authority to act as a sort of new, evil government. Their latest advancement? They now have the capability to purify blood into water, which is totally reasonable and not at all disgusting.\n\nA few people have escaped the clutches of the nefarious executives, however. Among them are Rebecca Buck, aka Tank Girl (Petty). She prides herself in her unwavering wildness: she's overtly sexual, loud, gross, and fearless, deadly with a gun and tough-talking in her words. Unlike the Trises and Katnisses of today, she is blatantly ballsy. She doesn't regret her actions, and she doesn't care what people think of her. When her commune is destroyed by W & P, though, she is kidnapped by their hilariously ghoulish leader (Malcolm McDowell), who sees promise in Tank Girl's defiant attitude but is threatened by it, throwing her into slave work. But of course, she escapes, with a new friend in tow (Naomi Watts). Of course, she embarks on a crazy adventure. Of course, she ends up winning the mini-battle against the company. But who cares about predictability when it's all wrapped up in a tie-dyed package of kookiness?\n\nAssembling itself in a sphere of scale-models, campy set-pieces, outlandish prosthetic makeup, animated interludes, and a soundtrack and tone that suggests it all was funded by classic era MTV, Tank Girl swirls in a blender of batshit energy, sometimes successfully and sometimes not. I guess it wants to be too many things at once: funny, sexy, cute, action-packed, and most clearly, fun, for lack of a better term. It isn't great at everything it attempts, but what Tank Girl never fails at is being downright amusing. Petty's tough broad façade is consistently charming; her presence is so essential that her hit-or-miss (but mostly miss) career can be blamed for this career-defining portrayal. Personally, I think she's absolutely fantastic, but others might not be so sure (she's so delightfully manic).\n\nWhat makes the film work is how well it recognizes the bombastic insanity of its source. The comics, from what I've seen, are eye-popping creations of exaggerated punkiness, having all the swagger of a 15-year- old brat's daydreams. That tonal emphasis is brought into Tank Girl without any misgivings, and that's why it's so much better than (here we go again) Insurgent. Insurgent is so afraid to fail that it doesn't even try to be anything other than a fill-in-the-blank dystopian-set action- romance. Tank Girl can fall flat on its face once in a while, but at least it has the nerve to do so. It's not perfect, but Netflix streaming is much cheaper than a wasted ten dollars."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "sherwoodhuff",
        "review_rating": "1",
        "review_title": "Worst of the Worst",
        "review_detailed_main": "Lame. Contrived. Pretentious. Awful. One thing (among many) destroy this film. The lead is one of the most unlikable, terrible actors I have ever seen. She fails miserably over and over.\n\nThere are a million other things to say, but I will stick with this. Naomi Watts = Excellent actress. Malcolm McDowell = nothing more needs to be said other than his talent was wasted.\n\nOh, I see. IMDb wants me to write more lines. THIS MOVIE SUCKED! There is one more. WORST LEAD ACTRESS OVER! Another one. MOST IRRITATING LEAD OF ALL TIME! One more. DO NOT BOTHER TO WATCH THIS INANE ATTEMPT AT KITSCH! And finally. actually watch this trash and judge for yourself how horrible it is, than watch something decent, and have some popcorn.\n\nUh, thank you, thank you very much."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "sqrt_-1",
        "review_rating": "8",
        "review_title": "great comic fun!!",
        "review_detailed_main": "Okay so not all people are comic lovers and neither am I. But this movie is wonderful fun. So maybe being male I find the girl more entertaining than necessary but it is still funny. One should not forget that this movie is based on a comic strip and therefor very simple and (slightly)predictable. There is no deep story here. It is a movie to watch with friends and enjoy the music(Bjork, Portishead, etc) and glib retorts of tank girl herself. Why the low ratings?? Maybe people just don't appreciate the humour and subtle jokes. Like the buffalo being a water buffalo! Think about it, it is very funny in context. This movie is a must-see cult classic. So maybe not Malcolm Macdowell's best(that is clockwork orange). Enjoy!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "fredward-22987",
        "review_rating": "6",
        "review_title": "Fun . . .with lots of crazy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "holyspiritdriven",
        "review_rating": "4",
        "review_title": "I Expected to Like this More",
        "review_detailed_main": "I had heard this was a cult classic & I usually enjoy those type of movies. From the description it sounded like my type of movie. Though there were some elements that I really liked, for the most part I was let down. I love the animated comic book sequences. Those alone were almost enough to rescue the movie. However, the visuals were not as stunning as I expected. Maybe its because it's an old 90's movie, but the the ships looked they were made of cardboard, the Rippers were incredibly cheesy costumes, etc. The plot felt like something I've seen before. Goofy & overly mean villain is holding the poor masses hostage & one of the peons rises to take him down. I felt like \"Rebecca\" was a really fun character for Lori Petty, but I thought she was kind of stupid, mumbling weird things all throughout the movie. There seemed to me a lot of disjointed imagery and side events that confused the main focus of the movie. Lastly...\"Tank Girl\" rarely ever even drove her tank!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "jaywensley2004",
        "review_rating": "",
        "review_title": "Lori Petty has a BIG....gun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "dromasca",
        "review_rating": "5",
        "review_title": "Comics on Screen",
        "review_detailed_main": "'Tank Girl' is the kind of film you expect it to be very bad, but somehow ends being better than the worst that you expected. Inspired by a comics series, it mixes actual comics titles with film. The characters are no more complex than comics characters, and the action-filled story ends by repeating itself. However, if you get in the mood, and if you ever liked reading comics stories, you may survive the film. Some of the effects are good, though most of them smell cheap budget. Punk and hard rock dominate the soundtrack, as you may expect. 5/10 on my personal scale."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "moonspinner55",
        "review_rating": "5",
        "review_title": "Brash energy and enthusiasm, but it's a near-miss...",
        "review_detailed_main": "From the cult comic-strip by Alan Martin and Jamie Hewlett about a post-apocalyptic smartass (Lori Petty) in a battle with the bad guys at the Department of Water and Power in the year 2033. Structured and designed just like a comic book with jagged editing techniques and animated fragments, but Tedi Sarafian's haphazard screenplay can't be camouflaged so easily. Sarafian never follows through on his ideas, while Rachel Taladay's direction is energetic but hectic. Petty is well-cast as Tank Girl, showing lots of full-throttle enthusiasm, but she's obnoxious instead of hearty (she's constantly in the audience's face). Had Taladay been more refined, we might have been charmed by Tank Girl's sass instead of constantly being put-off. Many proper ingredients are here for a live-action cartoon, yet the film is best described as a misfire. ** from ****"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "icet2004",
        "review_rating": "1",
        "review_title": "Trash comically bad the worst movie of all time 0/10",
        "review_detailed_main": "this movie is the worst movie of all time without a doubt.trash.there's no substance.Please, don't waste your money.crazy director.boring. unwatchable trash,garbage,rubbish,dumps,horrible,terrible,clueless, pointless,boring,meaningless,purposeless,senseless,nonsensical,and inane.Malcolm Macdowell worst role.Ice-T's worst role.Lori Petty's worst role of all time.Lori Petty is very sexy, but Tank Girl is pointless.if i can do anything,then i banned this movie for the whole world.actually i'm Ice-T's biggest fan,but this role is brainless and pointless.director made very bad work. i don't recommend it to watch even to my biggest enemy.Police Academy's and Tank Girl are the worst movies of all time,but Tank Girl is worst."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "theconjourer",
        "review_rating": "7",
        "review_title": "Many many flaws, but somehow still amazing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "crapple35",
        "review_rating": "1",
        "review_title": "Avoid this film at all costs",
        "review_detailed_main": "I cannot understand how anyone could subject themselves to this awful awful film. It's just not a good movie. There is only one part of the plot that is acceptable (corporation controlling the worlds water), but thats the only part of the plot/rest of the movie that isnt revolting. Oh, and there's this 10 minute comic sequence of the girls customizing the tank. It's so long and boring, it'll really make you wonder who the green-lighted this junk\n\n1/10\n\nIf you ever see this movie on the shelves of a video store, it is your civic duty to try to harm it in any way possible. The store owners might get mad at you at first, but that's only because they havn't seen the movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "7",
        "review_title": "love Jet Girl",
        "review_detailed_main": "The world has been devastated by a comet and most of the water is gone. Kesslee (Malcolm McDowell) and the Water & Power Corporation control 95% of the remaining water. Rippers are mysterious mutants killing and pillaging without leaving a trace. Rebecca Buck (Lori Petty) live in a small isolated community. W&P attacks and Rebecca is taken prisoner. She befriends scared mechanic Jet Girl (Naomi Watts). They try to use Rebecca as bait for the Rippers. Jet Girl musters up the courage and steals the jet to join her. She steals a tank and becomes Tank Girl. They discover that her young friend Sam was sent to work in the sex club Liquid Silver. After a failed rescue, Tank Girl and Jet Girl stumble upon the Rippers' hideout. They turn out to be mutated kangaroo-human supersoldiers.\n\nTank Girl may be the lead but I love Jet Girl. Lori Petty is possibly the perfect Tank Girl. She has the great irreverent energetic wildness. This is a campy comic book movie. It doesn't get campier than kangaroo hybrids but this movie won't be restrained by that. It is broadly amateurish and unrelenting cheesy. It's no masterpiece but it's awkwardly fun. Jet Girl does put this over the top for me and it's probably the first film I noticed Naomi Watts. It's likely years later that I realized that it was Naomi Watts after she got big. It also has some good music. There is simply nothing like this movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mcpartlin",
        "review_rating": "5",
        "review_title": "Fun but who was this made for?",
        "review_detailed_main": "Teenagers? Dirtbags? Simply fans of the comic? Anyway it's a solid 5. The cinematography is BRUTAL and the casting of Lori Petty was unfortunate, she was famous for like 3 years in the 90's"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "10",
        "review_title": "Sassy classic",
        "review_detailed_main": "Rachel Talalay 's Tank Girl is a supremely underrated piece of punk-ish post apocalyptic sass that I love to revisit again and again. It soars on the same hyperactive plane as Saturday morning cartoons, but with a delicious R-rated bite, and a spunky, out of this world lead performance from Lori Petty. It captures the breakneck pace of the comic it's based on, and indeed moves along at the speed of a hummingbird on Ritalin, rarely pausing for air. The manic colours pop off the screen, the performances leap out at you like delirious mascots on a cereal box, and the vibe is go, go go for 90 glorious minutes straight, with a thumping soundtrack to keep the energy up. Lori Petty is a sexy, ADD addled wonder as the titular heroine, a desert dwelling, adorable wiseass who finds her compound and safe haven overrun with goons of the monstrous 'Water & Power' corporation, run by the sadistic megalomaniac Kesslee (Malcolm McDowell). McDowell is no stranger to playing evil bigwig sons of bitches, and this one is the goddamn prototype. He leers, recites poetry, walks barefoot on broken glass with an sweetly angelic grin, and terrorizes basically everything that moves in a perfect performance of untold, ghoulish madness. Tank Girl finds herself at odds with the corporation, and swept up in a revolt against them, aided by shy, bi curious Jet Girl (Naomi Watts, who reportedly has bad mouthed this flick in interviews these days, now that she has a high horse to sit on. Don't listen to a word). She also finds allies in mysterious desert dwellin creatures who, get this, turn out to be genetic hybrids between humans and kangaroos, bred for war. The practical effects are wondrous, letting the actors shine through the masks. Jeff Kober is a sheepish joy as the dumb one, Booga. Ice T dials up the crankiness, and third who is the reincarnation of Jack Kerouac. There's a rollicking Cole Porter musical number, no end of incredible visuals, an Iggy Pop cameo, and a constant vibe of silly fun keeping this one alive. It's like a shot of adrenaline in a technicolor juice box, and is not to be missed."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "yv_es",
        "review_rating": "6",
        "review_title": "You wish it could be better than it is",
        "review_detailed_main": "It feels like there's a far better film hidden somewhere under the version of Tank Girl that we got. At its best, Tank Girl is a feminist punk story filled with irrelevant humor, psychedelic animation, and explosions. At its worst, Tank Girl tells a sadly conventional and safe story, with the same old heroes and villains you've seen ten thousand times before. The result is a film that doesn't seem to know what it wants to be, a film that left me wishing it could have been so much more.\n\nI went into this film with an open mind. I had never read the Tank Girl comics and had never even heard of the film before watching it (although I did check out some of the comics after watching the film). I immediately liked the setting and tone of the film. Lori Petty is a pretty excellent Tank Girl too. Cool, sarcastic, and always on the verge of breaking the 4th wall. She really carries the film, making something out of a fairly weak story. She is an unapologetic, non-traditional feminist character. And although Petty's Tank Girl may be a watered down-or at least more mainstream-version of the Tank Girl character from the comics, I'd still take her punk-ish grin over Ryan Reynold's masked winking any day.\n\nIt's a real shame they shoved her character into such a boring and conventional plot. There's a bad guy (Malcolm McDowell) trying to do generic bad guy stuff for generic bad guy reasons. He kills Tank Girl's friends, so now she's out not only for revenge but also to save the wasteland and a child who Mr. Bad has kidnapped. That'd all be fine if it was just background noise, but there are lots of loooooong and boring scenes that only exist to support this boring plot. This film needed to be more Mad Max 2 and less Mad Max 3.\n\nNot that Tank Girl is a completely boring ride mind you. There's action. There's singing and dancing. There are new friends, such as Naomi Watts' surprisingly bland Jet Girl (IMO she would have made a far better love interest for Tank Girl than dear Captain Kangaroo). Yes, some of it's lame but some of it is quite fun. The dressing room scene in the Liquid Silver club wonderfully skewer's how women are supposed to present themselves.\n\nOn the action front, by far the best action scene in the film sees Tank Girl hijack a moving semi truck from her tank, casually shooting goons with a bow while cooking hotdogs and surfing along the barrel of the tank, all while tossing out one liners that would make Arnold blush. It's random, it's silly, and it's awesome.\n\nHowever easily the best bits of the film are the few minutes of animation in the middle and at the end. These are amazing! They feel sort of like what would happen if Ren & Stimpy shot a music video set in the Mad Max universe. These psychedelic trips are over far too soon and leave you wishing you were watching whatever movie the animations came from instead of this live action fare.\n\nI was less stoked about how the film sometimes threw in comic book-style stills between scenes. This wasn't done with much consistency and it felt like they sort of forgot about it halfway through the film. The inconstant stylization and tone of the film make some of the more over the top scenes feel very out of place.\n\nAnd while most of the film features more of a punk/rock sound track, there's a really bizarre usage of a rap song (presumably by Ice-T) for about 30 seconds during one action scene. This is a very minor complaint, yet the song nevertheless felt so forced as to be emblematic of the film's core problem. Tank Girl could have been subversive yet fun feminist film that would still hold up well today. Instead it tried to be more of a badass Waterworld, and suffers greatly for it.\n\nSo overall, while the Tank Girl we got is not a bad film and has some memorable scenes, it mostly leaves me wishing I could watch the film it could have been."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "machrf",
        "review_rating": "1",
        "review_title": "Just as bad as the first time I saw it.",
        "review_detailed_main": "I saw this movie shortly after it came out. Thankfully, it was at a dollar movie house in Tx. I was with my girlfriend who liked watching chick flicks while I suffered. We would take turns picking movies and this time it was her turn. As per the poster this one looked like it would have some eye candy for me so I agreed. What did I get? Women in awful make up and clothes to match. Acting abilities that were none existent in both unknowns and stars. I suppose Malcolm Mcdowell thought he could try to reinact Soren in a desert full with strange crazy women. His acting came off dry and dull like most of his characters. He has been lucky to have some characters that are exceptional in his career and thats about it. James Hong is the only one that brings his character to life as small as it is. Scenes in the movie that might have been interesting are often cut with comic book pages cutting the movie to shreds. The costumes go from bad to worse. Between the awful lines and eye soar of sets and costumes, it is a movie in which to make your worst enemy suffer. We left asking, \"What the heck did we just watch?\" We both suffered through the movie and had to find something to do to save the evening. We went out to a fancy restaurant and had a great dinner. Why after all these years did I think my first impression was worse than it was is beyond me. It wasn't. In fact, maybe I can say it was not bad enough. This movie is the worst of all time."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "dtrionfi36",
        "review_rating": "",
        "review_title": "I love this movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Tito-8",
        "review_rating": "5",
        "review_title": "Fun, but not fun enough",
        "review_detailed_main": "Well, this was about what I expected. It was certainly offbeat, and it had a few funny moments, but all-in-all, it didn't really add up to much. All of the main actors definitely gave it their best shot, but the material just wasn't there. The good moments were separated by prolonged stretches of predictability and mediocrity, and these are problems that are just too great to be offset by the scenes that are quirky fun."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "alien_invasor_05",
        "review_rating": "5",
        "review_title": "Meh.",
        "review_detailed_main": "Well, i saw a video recommending some obscure movies of the 80's-90's, all was well until i reached this one on the list.\n\nIts weird to say the least. Im not entirely sure how to tackle it. Probably ill talk about the target audience first. I dont know who they were, and probably the director/writers werent sure either. You will see some dumb down scenarios where it does look like it was aimed to kids. But there are very adult oriented themes in there too in those same scenes. So definitely not for kids, and its quite boring for adults. Maybe for people in their late teens early 20's who enjoyed the punk world.\n\nNow, you should understand that the movie is a satire, of what i still dont know. I dont know if its a satire of a serious movie, or a satire of a comedy. In any case, you will see for instance \"goons\" firing at tank girl, being \"serious\" at it, while she is both returning fire and cooking a hot dog at the same time she is laughing with no cover. (its a good scene though, but weird)\n\nTank girl is the main heroine, she is like if 90's Gwen Steffani and Pee-Wee had a child. You will see her being rebel and care free at dire situations, while laughing like Pee wee all the time.\n\nThe plot, while overall is a good setting, good dystopian world in the big picture, the details came out of the mind of a 10 year old.\n\nThe main villain also came out of a cartoon. Oh, and there are kangaroo/ or who knows what are they are kind of humanoid mutants that are quite horny but dont exactly are explained in detail nor actually need to be in the plot.\n\nThere are some good bits, like the animation and the overall world they created, they are not really believable, but the movie was never meant to be a serious one. Good sets, art, music was allright.\n\nI wouldnt say it was bad acting in the movie. I actually would say that it is a very professional movie and the people involved there, except the writing. The actors just did what they could with what they had. Its just that while the pacing was ok, the plot is all over the place, some scenes are unnecessary, dont make sense or both.\n\nThe movie aimed high, and it would have done it with an actual script.\n\nSo in essence, this is a mindless flick, just like in the 80's, it is rebel, its irreverent, its funny (sometimes), but it has bad plot, it makes no sense, it tried to cover so much genres at the same time, it tried to cover all possible audiences, and it failed at everything.\n\nForgetabbe. Wont say to skip it, because there are a couple of decent bits, but you wont miss anything really. And you are not its target audience anyways, so its not the hidden jewel many people talk about. Its just a failed attempt to create a new genre."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "merklekranz",
        "review_rating": "1",
        "review_title": "I should have known better....",
        "review_detailed_main": "Sometimes a movie cannot easily be classified. Such a film is \"Tank Girl\", part cartoon, part comedy, and part action flick. I'm sure somewhere there is an audience for \"Tank Girl', but it is extremely small, perhaps punk comic book readers. Most viewers will be looking for an early exit or living with the fast forward button. The only redeeming quality are short bursts of humor \"find me a microscope and a pair of tweezers\", but these tiny moments of comic relief are far outweighed by the sophomoric action sequences. There is no character development, which is not surprising, since the source is a comic book. Do yourself a favor and avoid, avoid, avoid. - MERK"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "7",
        "review_title": "Secret success",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tonymars-63087",
        "review_rating": "1",
        "review_title": "Whoever scores this high should return their souls",
        "review_detailed_main": "One of the most abysmal, horrid pieces of garbage that has ever been vomited by Hollywood.\n\n10/10 votes are by people that want you to torture yourself.\n\nScrew this movie with everything that can screw things."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ImperialStarbeast",
        "review_rating": "6",
        "review_title": "Manic and Colorful",
        "review_detailed_main": "Way ahead of its time, Tank Girl may have failed because general audiences weren't ready for a female character this manic and colorful. Petty's film depiction of Tank Girl was uniquely absurd and made for a fun movie experience, paving the way for a future psychotic film character we all know and love, Margo Robbie's Harley Quinn. Tank Girl miraculously slipped into the 90's pop culture scene and quickly became a cult classic. Unfortunately its silly plot, lack of character development, and disconnected story structure contributed to its poor reception. Talalays' fight to stay true to Tank Girls rich source material was a worthy cause, but United Artists clueless movie execs ultimately hurt the film's potential.\n\nThe soundtrack is a hefty slice of '90s nostalgia and goes a long way in re-experiencing the film, placing Tank Girl into film history as a unique blend of pop culture and an aspiring steampunk adaptation of a well loved comic. Decades later, Tank Girl is lost amongst similar comic book film adaptations that missed the mark like Judge Dredd, Batman & Robin, Barb Wire, and The Super Mario Bros.\n\nBecause of the film's fun costumes, Stan Winston's fabulous creature design, music video style action sequences (live-action, and animation) I wanted to give this film a higher rating than it actually deserves... but I won't."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "marmar13",
        "review_rating": "1",
        "review_title": "Doesn't Qualify as a Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "GOWBTW",
        "review_rating": "9",
        "review_title": "It may have \"tanked\" in the box office, but I think it's a lot of fun!",
        "review_detailed_main": "Why do people rush into judgment on a film? Maybe it's not their taste. For me, \"Tank Girl\" was based on something good, but it didn't pan out for some people. Lori Petty plays the title character of the film. Foul mouthed, tough, rugged, and ready for anything thrown at her. Naomi Watts plays Jet, a mousy, yet efficient mechanic who joined Rebecca, aka Tank Girl. Tank Girl gets thrown in the prison ruled by an evil water corporation, gets her tank, find her friend, gets help from mutants, and not a drop of water be wasted on the villains. This movie is very adventurous to say the least, it has a few famous stars. So there's no need for cutting down on it. Since it is a cult classic, it is also a keeper. 4 out of 5 stars"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "1",
        "review_title": "Doesn't Qualify as a Movie",
        "review_detailed_main": "This movie is proof that it's not what you know, but who you know, because the only way this movie comes into being is by the people behind it being well connected. This movie was a punk rock bender. Dubbed as a comedy, there was nothing funny. The main character was full of puns that were slightly better than what you'd hear in an old episode of Batman. It was a hodgepodge of disconnected scenes, cartoonish acting, comic book pages, and violence. Not hardly qualifications for a \"movie.\""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "sgeralds",
        "review_rating": "",
        "review_title": "Full of Flavor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "darill-28027",
        "review_rating": "1",
        "review_title": "Sorry waste of time movie",
        "review_detailed_main": "All I can say is that this show isn't a show or a movie, it's a joke all the way and it's boring too. Not worth watching."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Swing_Hammer",
        "review_rating": "5",
        "review_title": "Great fun and brainless",
        "review_detailed_main": "If you want 90 minutes of mindless fun, this is the film for you. Pretty silly stuff with a standard post-apocalyptic storyline. I liked the overall imagination and intermixing of the original comic book text and real life, with some great tunes thrown in. The problem is the characters never really made it credible-as either cartoon stand-ins or real life. Ice-T plays his standard cardboard character that he plays in every movie and you'll either like Lori Petty's girl with attitude role (especially if you are 14 year old male or younger) or you won't. Personally it started to grate on my nerves about half way thru. The brainy sidekick was not only completely unbelievable (single handedly creating a tank and jet fighter that responds to voice commands) but not terribly well acted either(first role perhaps?)-OK I know it was supposed to be fantasy.In the end the comic strip was probably better."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "m-47826",
        "review_rating": "1",
        "review_title": "The girl that tanked at the box office...",
        "review_detailed_main": "And now I see why. The movie is a nonsensical mess, that is completely dated, and with too many quirkiness from the heroine. And cartoon intermissions. The fact that people call it underrated, a classic, or a gem even, is not surprising. Because by today's standards, this is the kind of movie to rave about. But I doubt that ten years from now, we'll have vegan mutant kangaroos soldiers, a drought so bad, water will be drained from the « source ». And things like slamming and listening to post grunge, will be the hottest trend out there. The movie has 90s written all over, the pop culture references and fashion, are proofs of that. And even the cast is now a bunch of « unknown » actors, with Naomi Watts as the only one who managed to make a name for herself, after changing her hair color..."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "jocelynbalbuena-01191",
        "review_rating": "6",
        "review_title": "A Fun 90s Adventure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "duckmang",
        "review_rating": "1",
        "review_title": "what were they thinking???",
        "review_detailed_main": "I'm not sure where to start. The script was putrid backwash from some writer's subconscious. I could have made a better movie using action figues in my back yard with a super-8 camera and a box of cheetos. That chester cheetah, what a guy. Malcolm Macdowell must have been eating out of dumpsters to accept this obviously half-dimensional role. Where did all these moronic one-liners that poured from Tank Girl's mouth come from? She would act ten times more skillfully if she got a lobotomy. There's only thing i can say about casting Ice-T in this movie: Why? I hope the madness will end someday. There was only one redeeming characteristic about this movie, and that was jet-girl. She was a babe. Too bad she was covered in grease for most of the movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "MikaelBenBaruch",
        "review_rating": "6",
        "review_title": "Are Lori Petty and Margot Robbie sisters?",
        "review_detailed_main": "Lori Petty was perfect for the lead role, she nailed it! However, Margot Robbie, Suicide Squad leader Harley Quinn, could also play this character in a remake. Would love to see a full series of this genre produced as it was so original and way ahead of its time when they released it. Probably one of the BEST Science Fiction Comedies I have seen, everyone really put forth their best effort in making this a CLASSIC!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "wimgielenglas",
        "review_rating": "1",
        "review_title": "Horrible. Just horrible.",
        "review_detailed_main": "Completely unconvincing main character and that makes the garbage script and to be honest the entire movie, unwatchable and just a waste of time."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "NightmareOnElmStreetFan",
        "review_rating": "10",
        "review_title": "Excellent underrated fun classic with Lori Petty",
        "review_detailed_main": "One of the most underrated excellent fun science fiction dystopian comedy's. I like Tank Girl. The movie really surprised me I thought it will suck but it really surprised me. I saw the trailer on VHS tape in 1997 when I was 13 about this movie. When I ask about this movie in a video store they told me they did not have this movie it was not available. Today I watch this movie for the first time and I really like it. Was directed by Rachel Talalay who directed Freddy's Dead: The Final Nightmare and I don't like that movie that much, but Tank Girl is improvment over Freddy's Dead: The Final Nightmare.\n\nIt stars Lori Petty, Ice-T, Naomi Watts and Malcolm McDowell and they are great excellent fantastic. The movie is based on a comic book and I never read the comic book or hear about it. But damn this movie was great. I love the soundtrack by Bjork - Big Time Sensuality great song, by Punk band Face To Face- Disconnected. Man this movie is awesome.\n\nLori Petty was so beautiful and gorgeous that time. She surfs on a tank gun awesome. This movie is great, it has action, comedy, good scenes. Awesome movie, it is not violent, it is a good movie.\n\nLori Petty and Naomi Watts had chemistry and they become good partners fighting bad guys. Malcolm McDowell was awesome bad guy. The antihero Tank Girl (Petty) as she, Jet Girl (Watts), and genetically modified supersoldiers called the Rippers fight \"Water & Power\", an oppressive corporation led by Kesslee (McDowell). After \"Water & Power\" kidnapped little girl Sam (Stacy Linn Ramsower) killed all her family and imprisoned Tank Girl and torture her. With the help from Jet Girl that Tank Girl mets they plan an escape and they do escape. Armed them selfs with a tank. They designed the tank and made it in to their own weapon. To fight \"Water & Power\" they go trough desert of wasteland and they find super soldier the Rippers they made an army and go in to a fight for justice against Kesslee.\n\nDuring their journey they met a lot of comic people and they do a lot of funny stuff. The movie is set in the future 2022 that will be in 3 years. Of course there is no supply of water and the roads becomes the desert. Tank Girl and Jet Girl becomes their only hope. You have Ice-T in this movie as T-Saint a Ripper who is suspicious of the girls. I really did enjoy this movie, it could be called cheesy, flop but It is MILES way better than Street Fighter, better than Barb Wire (1996) played by Pamela Anderson. Finally Rachel Talalay did a movie I like and I enjoy! Tank Girl blow with machine guns bad guys to pieces.\n\nTank Girl is a damn good parody action movie I like it. Naomi Watts is awesome and she rocks!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "TheMarwood",
        "review_rating": "7",
        "review_title": "A very special disaster",
        "review_detailed_main": "Very much a product of the 90s that encapsulates an aggressive hip style, this ridiculous comic book adaptation has no discipline, is mostly incoherent and ends with a quick animation instead of an actual ending. All its stupidity aside, there's nothing quite like Tank Girl. It's a mostly terrible film that I inexplicably enjoy and I couldn't in good faith recommend it. Director Rachel Talalay seems to be as disappointed with the film as most viewers are and I could only imagine how nightmarish the shoot was, that full scenes were 'forgotten' to be filmed and in two cases, animation was added to clear that up. Tank Girl does have a go for broke attitude that never relents. Lori Petty plays the role with boundless energy and she's fine, even though a stronger editor would trim her manic behavior into a more shaped performance. It's a bizarre film that really never works, but it's plenty of fun."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "The_Jinxed_One",
        "review_rating": "3",
        "review_title": "Only For Hardcore Fans",
        "review_detailed_main": "I REALLY tried to like this movie but it's just an hour or so of having your life wasted. I'm not saying it's the worst movie ever but it's not gonna be remembered at all. The jokes are lame; the acting is worse and it has Ice-T in it...I like Ice-T but come on! As the headline insists, this is for only HARDCORE fans of either the comic or kangaroos (lol)at the very least. I never read the comic but after seeing this waste, I'm guessing and hoping it's A lot better in non-real form. I have no idea what genius said, \"Hey, this will be an entertaining movie!\" but I hope they fired, tormented and made fun of his/her weight problem! Because the day Tank Girl got green lighted, it was destined to get a 3 out of 10!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "La Gremlin",
        "review_rating": "3",
        "review_title": "In-SANE! But I have to admit, I admire any movie where they have somehow convinced Ice-T to play an anthropomorphic wallaby.",
        "review_detailed_main": "\"Tank Girl\" was, I suppose, meant to be the \"Buckaroo Banzai\" of the 90's and was marketed as such. The comparison is, admittedly, appropriate; both movies have so many things going on in any given frame of film that, as impossible as the story is to sort out, it certainly isn't boring.\n\n\"Tank Girl\" is a fun enough ride if you turn your brain off before the movie starts. Otherwise you'll end up with a skull-cracking headache like me."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "bkrauser-81-311064",
        "review_rating": "1",
        "review_title": "Could Have Been So Much Better",
        "review_detailed_main": "You would think that a movie based on a harum-scarum comic book series, taking advantage of a punk-rock aesthetic would be an interesting premise. The titular hero is played by Lori Petty who up to that point was known for playing Geena Davis's annoying kid sister in A League of Their Own (1992). Here she's a zany post-apocalyptic scavenger, turned western-style avenger. After her commune is massacred by W&P, a pseudo- fascist corporation of ill-repute, she and fellow survivor Sam (Stacy Linn Ramsower) are captured, separated and tortured. Tank Girl escapes the clutches of the evil Kesslee (played in full check-collecting mode by Malcolm McDowell) and tries to save the young Sam with the help of Jet Girl (Naomi Watts), Sub Girl (Ann Cusack) and The Rippers who are basically mutant kangaroos led by Ice-T in heavy makeup.\n\nDespite the inherent ridiculousness of the characters, nonsensical story elements and, I kid you not, an extended musical rendition of Cole Porter's \"Let's Do It,\" Tank Girl could have been an interesting counterculture movie. The comic books the film is based on are considered far-left staples of Thatcher Era England, featuring an ultra-violent anti-hero with (gasp) fluid sexuality. While I credit the movie for being infectiously post-feminist, when compared to it's source material, it simply doesn't go far enough.\n\nNow granted the collection and subsequent bastardization of Tank Girl IP was followed by the movie licencing of The Mask (1994) a property similar in aesthetic and humor. Similarly the source material was watered down but what The Mask lost in macabre bite, it more than made up for in cogent storytelling. Let's not forget that the editing in Tank Girl is sloppy and slow, the cinematography reaches the slumping capstone of a sub-par music video and the art design, while lovingly anarchic can't help but feel lo-fi, and not in a good way. It's just a garish, slowly paced, sophomoric and pointless film that could have been something but is plagued with half-measures."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "backup-50362",
        "review_rating": "1",
        "review_title": "I love how bad it is, pure distilled 80s cringe",
        "review_detailed_main": "LOL I love how it's set in 2030 yet \"shockingly\" all the \"cool\" people are generic 80s dirty hippie punk-looking losers that were fashionable for some reason, back in the 80s.\n\nAnd yeah this is major cringe top to bottom, but she talks with a generic \"cute\" voice you see actresses pull even today to attract the incels, and it works - they'll love anything with a girl that talks like that, even if she's a dirty hippie with no redeeming qualities.\n\nIn a terrible movie with abysmal acting that had a lot of potential to be something cool and unique, but it's mostly painted-on sets and the aforementioned cringe and dirty 80s punk hippies.\n\nOh wait a second, this is a 1995 movie! It was outdated in its \"style\" even for the time, let alone now in 2022..."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "suite92",
        "review_rating": "6",
        "review_title": "You will likely either love or despise this one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "RoboRabbit89",
        "review_rating": "5",
        "review_title": "\"Tank Girl\" is not the greatest but not half bad.",
        "review_detailed_main": "This movie wasn't all bad, I will definitely say it was an interesting concept.\n\nI don't want to be too harsh on this film, but I do feel Lori Petty is quite enjoyable and sexy as this character.\n\nI think this was her third film so she was more or less starting out but I feel you could to worse than this.\n\nOnto the review.\n\nSet in a dystopic future of 2033, after a meteor hit earth, the word has been turned into a wasteland.\n\nAnd what's left of a government, if there still is one, is controlled by an industrial corporation called \"Water & Power\" that manufactures drinking water for the masses. And it's run by Kassel (Malcom MacDowell).\n\nRebecca aka Tank Girl played wonderfully quirky by Lori Petty, is the only one that can stop him, after his men storm her shelter, dredging the water supply, and kidnap her niece. She goes on a one woman army to get her back with a little help form some colorful goofy characters aka The Rippers mutant kangaroo men and Jet Girl (Naomi Watts).\n\nI honestly kind of liked this movie, I know it's not great and I'm not trying pretend that it is. But I feel it's kind of fun even for a so-so action-comedy like this, at best you can look at as an enjoyably bad film.\n\nI give it a 5/10. Like I said, for Lori Petty staring out, she could do a lot worse than this.\n\nSo if your curious to check this out, it's all right. My mom also thought it was okay. It's just a silly movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "PredragReviews",
        "review_rating": "7",
        "review_title": "What Ever Happened To Lori Petty?",
        "review_detailed_main": "The movie is based on the comic \"Tank Girl\". What happens when the water dries up and what is still out there is controlled by Water and Power? Well, a quick witted heroine and her awesome sidekick. This movie is a fun romp, great music and the acting is right on. Lori Petty was the perfect pick for the part of Tank Girl, her sense of timing is great and the one liners keep coming. Rising against oppression has never been so fun.\n\nHowever there is a dark undercurrent as well, a child is stolen and Tank Girl is off to rescue. Lori Petty is perfect in her role. And her side-kick Jet (I've forgotten her \"real\" name) is wonderful too. I really identified with Jet and find that Tank Girl and Jet's examples of independent, pro-active thought and action are inspiring. The movie is incredibly fast-paced, the visuals are very there, and the story is entertaining at all points. Lori Petty embodies Tank Girl, Naomi Watts shines in a pre-fame role, Malcom McDowell is (as always) the perfect villain, and even Ice-T, in one of his first acting gigs, does pretty well behind Stan Winston's (incredible) make-up. While the plot isn't entirely original either, it doesn't really matter. The props and outfits, plus entertaining dialogue makes up for it entirely. I also loved how it sticks to its comic-roots and uses comic panels to add extra flair.\n\nOverall rating: 7 out of 10."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "FantasticWilliam",
        "review_rating": "2",
        "review_title": "Chaotic Mess with a Few Sparks",
        "review_detailed_main": "\"Tank Girl\" combines the smarts and dumbs as a result falls flat as an adaptation as it tries to bring the same spirit as the comic book. As a result of the film's post-apocalyptic setting with a menacing Malcolm McDowell as the boss, we are introduced to Lori Petty's Tank Girl. As a result of Petty's Tank Girl's character traits, the audience is left unimpressed and annoyed rather than entertained.\n\nThe film has a very thin story and is composed of many ridiculous songs that make people cringe as well as poorly made animations that appear cheap and unoriginal. Despite the fresh designs within the film, the vision behind them gets lost making the entire piece messy and unorganized.\n\nPetty's role as Tank Girl lacks substance and feels superficial and like a stereotype instead of a character. Most of the film works against Petra's portrayal of Tank Girl besides Naomi Watts who acts as Jet Girl in her early role. Even the reliable McDowell's on-screen antagonist fails to impress in his performance.\n\nAlthough it has a cult following owing to its girl power beliefs and odd sensibilities, this one is suited only for the most ardent fans of the comic."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "sorchakaye",
        "review_rating": "10",
        "review_title": "Who cares if it didn't follow the comic!",
        "review_detailed_main": "All these bad reviews for it not following a dang book with pictures! This movie was hilarious. No it's not going to win any awards for best acting, sfx or even costume. But the jokes...if you have a sense of humor....are funny. It's a stupid funny but fun. This is a classic movie. Movies these days are all about making the money...this was about fun."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "karoshi",
        "review_rating": "6",
        "review_title": "Why did they saddle this thing with a plot????",
        "review_detailed_main": "If you're familiar with the Tank Girl comics, you're going to have some issues with this film.\n\nFor some reason, the filmakers decided to give Tank Girl a backstory, a name, a motivation, and all the other things she really doesn't need. Tank's a snog first, ask questions who couldn't care less if she uses her tankly powers for good or evil, so long as there's a beer and a laugh at the end of it all.\n\nLori Petty really does capture the spirit of Tank Girl pretty well, but the movie really is a mess. She stumbles through it gamely, but except for her, they couldn't have missed the spirit of Tank Girl further if they'd tried."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "The-Sarkologist",
        "review_rating": "4",
        "review_title": "I'm not even sure if the sound track can resurrect this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Starbabe",
        "review_rating": "",
        "review_title": "The best film ever made about Girl Power!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "4",
        "review_title": "Silly niche comic book tale",
        "review_detailed_main": "Released in 1995 before comic book adaptation films where relatively mainstream and populated. Having never read the comic series and not being aware of the origins of this film.\n\nTank Girl is quite a silly, bizarre and over the top futuristic comic book film which has solid visuals and a lot of interesting characters.\n\nLori Petty does a good job portraying the lead Rebecca (although it wasn't specified why she was called Tank Girl) as her character is similar to that of Harley Quinn in modern times.\n\nThe action is quite cheesy, nothing exactly is to be taken serious where the tone is comical and played for laughs. The look of the Rippers (kangaroo like human creatures) were bizarre looking but adaptable.\n\nFeatures an ending which somewhat ends abruptly but makes sense. Overall this film isn't as great as some make it out to be. It's watchable and solid at parts but nothing groundbreaking. For a certain audience."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "GregTheStopSign95",
        "review_rating": "5",
        "review_title": "Badly hamstrung",
        "review_detailed_main": "Yet another movie that serves as proof that studios should just keep their filthy hands OFF movies while they're in production. Or, at the very least limit their involvement to genuine suggestions rather than 'suggestions'. Especially after reading the trivia section on here.\n\nThat aside, it's not exactly a terrible movie but it really could have done a lot more with what it had. There are some great ideas here, especially in the visuals - both the animated inserts and the Ripper designs - but it all just feels a little bit TOO ADHD to really stick the landing.\n\nStill, it's Lori Petty, Naomi Watts, Jeff Kober, Ice T, Reg E Cathey, and Malcolm McDowell, so you can't be too sad about it, can you?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Tweekums",
        "review_rating": "7",
        "review_title": "A Guilty Pleasure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "AdoJac",
        "review_rating": "5",
        "review_title": "Chaotically fine",
        "review_detailed_main": "The movie Tank Girl movie was a nice watch for how chaotic it was. The movie was set in a dystopian world where there is very limited water. The plot was kind of lack luster, but the action and humor is there and nice. The main character was quite infectious with energy with her performance. The story concept wasn't exactly unique, but the way they execute it is fun. The idea of a person riding a tank and fighting back a water corporation and their control for the only source of water left in the world In the end, this movie is a fun watch, and it is even more of a fun watch if you do it with others, I give this movie a 5 out of 10."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "lordzedd-3",
        "review_rating": "7",
        "review_title": "Good but flawed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ambermejia-12916",
        "review_rating": "2",
        "review_title": "Tank Girl is a wild, weird movie set in a post-apocalyptic world",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "garybutler-65403",
        "review_rating": "10",
        "review_title": "Fun, and highly enjoyable",
        "review_detailed_main": "If youre looking for a laugh out loud comedy, thats like a mad max movie, this isnt your movie. Tank Girl is a fun, silly movie thats witty, and has a lot to offer. From the quirky characters to the transition from live action to comic strips, it's unlike any other movie i've seen. Tank girl is just a fun, enjoyable movie, the story isn't the best there is, but the characters make up for it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Scarecrow-88",
        "review_rating": "6",
        "review_title": "Tank Girl",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "shaunpearson-15947",
        "review_rating": "4",
        "review_title": "Once the Rippers (half-man/half- kangaroo) showed up, i found some genuine entertainment to be had.",
        "review_detailed_main": "My gut feeling was correct.\n\nI passed on Tank Girl for many many years, as the actress who plays Tank Girl (Lori Petty) looks nothing like Tank Girl. For me that amounted to a bad start.\n\nLast night i decided to give Tank Girl a whirl, and look beyond the visual differences between Lori Petty and the cartoon character (as can be seen in the images posted above).\n\nThroughout the movie, i could not help but compare the attitude + squeaky sounding voice of Tank Girl to that of Harley Quinn (Margot Robbie) in Birds of Prey (2020). Not good.\n\nTank Girl is a movie i stuck with all the while thinking not much to it. Sometimes the live scenes would be broken up by a cartoon squence. I quite enjoyed the cartoon sequences.\n\nOnce the Rippers (half-man/half- kangaroo) showed up, i found some genuine entertainment to be had.\n\nJet Girl (Naomi Watts) was excellent. She single handedly lifted the movie up a notch.\n\nNaomi Watts is a talent.\n\nTank Girl is one of those movies that likes fall back on playing various hit songs from time to time.\n\nOver all Tank Girl is a movie that feels like it is missing the mark for much of time.\n\nSometimes i would sense a fair budget in play, and at other times.. ..there were scenes that appeared to lack enough budget - resulting in locations that looked unintentionally sparse."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "krusty641",
        "review_rating": "",
        "review_title": "VERY ENTERTAINING!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "zeeshanshakil",
        "review_rating": "5",
        "review_title": "Feels like a chaotic punk movie!",
        "review_detailed_main": "Visually inventive, the footage combines live-action sequences with animation inspired by comic books, enhancing its already eccentric aesthetic. An eclectic soundtrack featuring the likes of Björk and Hole underlines the movie's anarchic vibe, making every scene akin to some sort of rebellious music video.\n\nWhat's ultimately at the heart of Tank Girl is this unapologetic, brazen rejection of normalization. It dives headfirst into absurdity whether that's through mutant kangaroo friends or randomness in costume design, all with a sly feminist bent, and to some critics, a mess but that's the point. It relishes in its shortcomings, capturing the true sense of counterculture within every frame."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "paul_haakonsen",
        "review_rating": "5",
        "review_title": "Watchable, but a rather somewhat spaced out movie...",
        "review_detailed_main": "I remember watching the 1995 movie \"Tank Girl\" back in the day when it was just released, but I have to admit that I only remember the movie by its title. I didn't recall the storyline, so I sat down in 2022 to watch the movie once again.\n\nNow, I never read the comic book, despite of being an avid comic book enthusiast back in the 1990s. So how true director Rachel Talalay was to the original comic strips, I have no idea.\n\nWell, it should be noted that watching \"Tank Girl\" and getting into the whole concept and the world in which it takes place definitely requires a special mindset. \"Tank Girl\" is unique, so very, very unique, and far out there actually. And as such, then I don't think that this 1995 movie is a movie that will easily please everyone in the audience.\n\nI was adequately entertained, however this is not a movie that I have taken a particularly liking to. Nor is it a movie that I think I will ever revisit. It simply was a bit too spaced out for my liking. But hey, it was based on a comic book after all, so perhaps it is a spot on portrayal of the Tank Girl character and the world in which it takes place.\n\n\"Tank Girl\" has a pretty interesting cast ensemble, with the likes of Malcolm McDowell, Naomi Watts, Don Harvey, Jeff Kober, James Hong and Lori Petty in the leading role as Tank Girl herself. And I will say that Lori Petty definitely spruced up the movie with her performance.\n\nI suppose that this movie is a niche movie for fans of the comic strip, because it is not a mainstream movie.\n\nMy rating of \"Tank Girl\" lands on a five out of ten stars."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "emm",
        "review_rating": "5",
        "review_title": "Insanely offbeat film might be fun.",
        "review_detailed_main": "TANK GIRL may very well be the BUCKAROO BANZAI of the 90s as it could someday attain cult-wide status. For being in the \"femme fatale\" category (the most controversial subject I've complained about before), it reeks. Call it a comedy and your life will be so much better. It's really your satire of post-Apocalypse movies, and another one from the \"alternative\" generation that shows off strong feminist superiority. Lori Petty, resembling the face of singer Gwen Stefani this time around, offers quite a lot of comical charms as a \"tank girl warrior\". The cartoon breaks compliment the story in a touchy way. Everything else leaves much to be desired, though. Only if you like unclassifiables."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "RNHunter",
        "review_rating": "7",
        "review_title": "Not Bad, for What it Claims to Be",
        "review_detailed_main": "First of all, let me be clear that not everyone will like this movie. I know a number of people who just do not like fantasy or silliness in movies. If you are one of those serious people, this movie is not for you. But if you are open minded and say - hey just show me something fun and silly that may not have any reality, then this could be your movie. It also however, does have some R rated sections for both violence and sexiness.\n\nI also believe that movies should be rated on what they claim to be. This movie certainly is not \"Gone with the Wind\", but then again, it does not claim to be. It claims to be a silly movie about a comic book heroine that is merely trying to be entertaining - assuming one likes that genre in the first place. To a certain extent, this movie reminded me a bit of a more modern version of Jane Fonda's Barbarella - a movie also made with a sexy most odd female in an odd sci-fi world. If you liked Barbarella or the silly movie Mars Attacks, you might like this one as well.\n\nAs for me, I rated this movie somewhat high based on that I think it did what it promised to do - be a silly, entertaining comedy. I also find it has an odd attraction. Again, this movie is not for everyone. But for some of us, was entertaining for 90 minutes or so."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "keitronwallace",
        "review_rating": "4",
        "review_title": "Yeah.",
        "review_detailed_main": "That's about it. Wasn't terrible. (And now I will keep typing until"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "bensonmum2",
        "review_rating": "6",
        "review_title": "\"I have two words for you. Brush your teeth!\"",
        "review_detailed_main": "I understand Tank Girl bombed at the box office back in 1995. Well, I'm happy to report that I was one of the few who saw it in the theaters. I'm also happy to report that I'm one of the fewer who seems to have actually enjoyed Tank Girl. While I may not hold it in as high esteem as I once did, I had a good time last night re-watching it. Tank Girl features a typical post-apocalyptic set-up: A a comet has hit the Earth, creating an 11 year drought. Most of the remaining water is controlled by the Water & Power Corp and its maniacal leader, Kesslee (Malcolm McDowell). Rebecca Buck (Lori Petty) is a member of a small commune living in the Australian outback who have illegally tapped into the water supply. Kesslee sends in the troops to destroy the commune, making an enemy of Rebecca. In short order, she steals a tank, befriends a Water & Power aircraft mechanic and pilot, and joins a band of mutant human/kangaroo hybrids. Together, they join forces to take on Kesslee and his Water & Power army.\n\nOne of the things I enjoy most about Tank Girl is also one of its biggest weaknesses. To say that Tank Girl is over-the-top would be a gross understatement. Costuming, music, action, set-design, acting, creature effects, dialogue, visuals - it's all larger than life and generally a lot of fun. It would be easy to give Tank Girl a 10/10 for trying to be a surreal experience. And while I get a kick out of most of it, there are times where I feel Tank Girl is trying too hard. It's pretty apparent that director Rachel Talalay was going for kitschy and off-beat. But there are definite instances where it all feels forced. Instead of letting things happen naturally as part of the story, some of what Talalay throws at the viewer lacks an organic feel. The best cult movies don't try to be cult movies - they just are. And Tank Girl's frantic pace doesn't allow for much in the way of character development or plot - things Tank Girl sorely lacks.\n\nYou can't really talk about Tank Girl and not mention Lori Petty. She's the heart and soul of everything. Given what Tank Girl is - faults and all - she's perfect. Her energy is as amazing and consistent as her ever-changing hair. It's infectious and impossible for me not to enjoy. I also get a kick out of the contrast of Naomi Watts' super subdued Jet Girl. They make a good pair.\n\nOne last thing, I really like the special effects in Tank Girl. Whether it's Stan Winston's amazing Kangaroo-men, the comic book cut scenes, or the many, many explosions, it's a real visual treat.\n\n6/10"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "omidjonkhan",
        "review_rating": "4",
        "review_title": "It's good but could be better. This should have been an Anime Film, to be honest.",
        "review_detailed_main": "Among them 'Tank Girl' (1995), in this film, the punk, post-apocalyptic heroine and her antagonist, a malevolent corporation, do nothing to save the day. The First time when I saw this Movie 'Tank Girl', there were some problems. First, the film is shambolic and jolting in its pacing. Because of the disjointed narrative from scene to scene, it's impossible to care about what's happening.\n\nTank Girl (Lori Petty), who plays the title role, is generally energetic, but often her over-the-top style feels forced. Instead of quirky and rebellious, she's more just irritatingly erratic. Much of the character's humor would have worked better in the comic than it does on-screen, and it frequently tries too hard to be edgy or funny.\n\nPitifully underdeveloped sidekicks and supporting characters. Malcolm McDowell's villain, (Kesslee), is an unintentionally sinister creation, but he's more of a stereotype than a villain to be reckoned with. Naomi Watts (Jet Girl) has equal potential. Still, while stunning on the big screen, she appears to have only been added as an ego-driven cameo rather than bringing anything tangible to the storyline. The hybrid kangaroo-humans are visually intriguing, but the strange beings are odd for the sake of strangeness rather than adding meaningful context to the story.\n\nOn a visual level, the film is, at times, stunning, especially when it comes to its colors and punkish design, which is often intertwined with the psychedelic, reflecting the comic's trippy sensibility. But the special effects bullet-time notwithstanding, and production design are usually cheap looking, and this is never more evident than during its cartoon sequences, which are derivative of the comic yet feel like a cop-out of scenes that might otherwise have been better shot for real.\n\nIn the end, I will rate Tank Girl a 4/10. Despite its cult status, it seems like a squandered opportunity. Its garish visuals and uneven pacing overwhelm its rebellious, feminist possibilities."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "dietpepsi98",
        "review_rating": "10",
        "review_title": "Open your mind and have fun",
        "review_detailed_main": "This movie, loosely based on the comic, is just plain fun. This is not a SERIOUS commentary on anything. Lori Petty plays the comic moments up well and the sound track is awesome. This is enough to have me sit through the movie but add Malcom Mcdowell and a Young Brunetted Namomi Watts and the interest factor just increases. Lori Petty is definitely an underrated actress and take this movie for what it is FUN, Lori Petty definitely did/does and it shows with the fun she has/had with her role.\n\nAny one know of a DVD for this movie and if there are any extras with it?\n\nAnd does any one know the one word that defines \"suspension of disbelief\"?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Doc_Who",
        "review_rating": "7",
        "review_title": "OK if you like the main star!!B grade sci-fi !!!",
        "review_detailed_main": "this movie stars Lori Petty as \"Tank Girl\", in a world without water. The movie deals with a mad max like world. Then there are the bad guys \"Water and Power\" lead by Malcolm Mcdonnell(villain from Star Trek: Generations). It has some OK action parts, but at times feels like a slow B grade science ficton movie. If you look carefully , you can star Richard Schiff(Forces of Nature,The West Wing,The Arrival) in the beginning of this movie!!I often wonder what the comic book was like as the director sometimes used comics to move the movie along!!If you like bad science fiction or Lori Petty , then you might just like this movie!BTW, the movie has a lot of alternative songs to the film's soundtrack!!!this is a movie I soon rather forget that i paid money to see this when it came out in the theater!!maybe if was on DVD, it would be better!!?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "CinemaSerf",
        "review_rating": "5",
        "review_title": "Tank Girl",
        "review_detailed_main": "Malcolm McDowell is the megalomanic \"Kesslee\" who in a post-apocalyptic Earth is determined to control the most important substance left to man. Water. Meantime, a rag-tag collection of miscreants consisting of the eponymous, \"Harley Quinn\" style character (Lori Petty), \"T-Saint\" (Ice-T) and \"Jet Girl\" (Naomi Watts) who are marauding around with a tank and a jet decide together with some angry kangaroos and \"Booga\" (Jeff Kober) that vengeance will be their's. What now ensues is a really derivative, repetitive and frankly rather dull semi-animated action adventure that rehashes just about every theme in the book and over-relies on the characterisations that are seriously under-delivered by a cast that are simply not up to the task. McDowell just hams it up the whole time and the dialogue is beyond banal. Rachel Talalay could have done so much more with the sort of \"Mad Max\" elements of the story, but instead allows this to just drift into a puerile, attitudinal, drama that offers little to engage and a suite of visual effects that we have seen loads of times before. There's a brief appearance from Iggy Pop and the \"rippers\" bring a certain, welcome, randomness to this otherwise really rather uninspiring flop. Sorry, but I wouldn't bother if I were you."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "laurenwashere04",
        "review_rating": "",
        "review_title": "Correction for Anders Asland",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "malpasc-391-915380",
        "review_rating": "5",
        "review_title": "Uneven and not particularly compelling",
        "review_detailed_main": "In 1995 Tank Girl was still quite a popular but cult/niche comic book. But inevitably Hollywood was going to have a go at turning it into a movie. The result is at best uneven.\n\nSet in a post-Apocalyptic 2033 where a comet crashing into the earth some years before had turned the land into desert. The remaining water being under the control of baddie Keslee's corporation Water and Power, Rebecca (Tank Girl) is a rebellious girl who fights this corporation and it's group of dumb footsoldiers to try and remove the hold they have over the water, and keep her friends safe/alive. That's pretty much the whole plot.\n\nThe good bits about the movie - Lori Petty looks great as the heroine. She has the look, the hair, the costumes and the cheeky feistiness needed to play the character.\n\nNaomi Watts as Jet Girl is another highlight, playing it subtly and in the beginning quite shyly.\n\nIf you like hammy, over the top performances then Malcolm McDowell as Keslee you will enjoy. I do quite like him in this. He plays it with plenty of ham and camp.\n\nVisually the film looks as good as a comic book adaptation can look given it's been transplanted to real actors and sets rather than being drawn or painted. Though we will see some animated parts throughout.\n\nThe bad bits - the plot. It's just so thin, there isn't enough here to sustain a 90 minute movie, so it gets dragged out and becomes repetitive and old quite quickly.\n\nThe script - whist Rebecca's one liners seem funny at the beginning there are far too many and it becomes a drag as the action almost stops whilst she says something really dumb.\n\nIt's boring. Because of the thin plot being stretched out it just feels limp and a bit dull, which to me should be difficult given the brightness of the original comic strips. Apparently studio and other interference ended up removing some scenes from the final cut, which actually explains why there is an uneven pacing throughout. Things either feel rushed or very slow.\n\nThe animations.. Small segments of the film are done in animation rather than live action. They look good because they hark back to the comicbook source, but they don't work and often feel like they're thrown in to save those that hold the purse strings money. In fact the entire end scene had apparently been made, but was replaced by an animated sequence.. Unsure as to why - money? Not enough to make it look as good as it could? Or just bad so needed to be replaced?\n\nIn conclusion, this isn't as exciting or fun as it could have been. I won't criticise the performances of the main cast as they worked with what they were given and they do mostly look and feel the part, but the overall result of a dull and thin plot, potentially not enough money, and some uneven editing, it's just uneven and not very compelling. A film you can watch, but will lose your attention from in parts of it, and will mostly forget about afterwards.\n\nWould a remake work? Bigger budget, stronger storyline? Not sure. How popular is Tank Girl in 2024?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "JoeB131",
        "review_rating": "4",
        "review_title": "Dumb fun....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mrd-15553",
        "review_rating": "1",
        "review_title": "Failed Mad Max copycat",
        "review_detailed_main": "To be entirely honest ... This movie was dog water. I do not recommend any poor soul to watch this movie. This is a failed attempt to create a Mad Max rip off with a comedic spin to it. I think this film did not try to make it a terrible movie so i just think that this film was a flop. The wacky zany main character is unbearable, her character is too over the top on how wacky she is. The interactions between her and the other characters is too forced. She makes no character development. The film makes no effort to make her struggle or overcome adversity, she simply gets lucky and is held captive my incompetent supervillains that for some reason keep her alive but kills everyone else that crosses him? Even know that she isn't tamed by him yet and he essentially gives her an opening to escape with no way to track her? No way to do anything about it no safety measures. The simple measure that they do gets easily circumvented. The plot is a straight rip from Mad Max, there was no creative spin at all other than the comedic aspect of the movie which at most points just feel forced. It ends up being like when someone makes a joke in front a group of people and they just nervously laugh because they feel bad if they stay quite about it. The only unique thing about this film would be the animal hybrids that have their own backstory but other than that i found their characters a failed attempt at their version of Chewbacca from Star Wars."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Magius-2",
        "review_rating": "7",
        "review_title": "will be a cult movie classic",
        "review_detailed_main": "I'm surprised with such a high rating that no-one else has bothered to comment. Every moment was a chance for Lori Petty to charm us with her insanity and it was beautiful to see that Jetta's mind learned to enjoy situations with more ease as well. Good character development for Jetta (but her only). The rest was filled with slapstick and one-liners that keeps me on the floor even after seeing it 10 times. The best part was \"Let's Do It - Cole Porter - 196(5?)\". I was also glad to see the movie gave credit to it's 2D origin."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "sol-",
        "review_rating": "6",
        "review_title": "Humanity's greatest hope in a future without water",
        "review_detailed_main": "With water a scarcity, a smart-mouthed young woman fights against the evil corporation in charge of the entire world's water supply in this dire dystopia comedy set in the not-too-distant future. The film is based on a popular comic book series with comic book illustrations incorporated well into the action; the sets and costumes are also delightfully imaginative and same goes for a water bottle weapon that sucks all liquid out of a person. The dialogue is surprisingly witty too with our heroine frequently giving lip in the face of adversity. Energetic as Lori Petty is in the lead role though and memorable though her lines may be, she nevertheless comes off as rather obnoxious overall. She does not have much respect for anyone, regardless of whether they are her adversities or not, and she comes off especially abrasive by contrast to her sidekick, played in an unusually dowdy manner by a young Naomi Watts. As a narrative, the film only really ever half-succeeds too. It all starts off rather promising with the water shortage concept and the offbeat notion that a hardly muscular girl could be humanity's greatest hope, but everything turns into chaotic action towards the end and interesting as the mutant kangaroo characters are, they come off as deserving of a film of their own rather than being written off as merely genetic engineering gone awry. It is easy to see why such a haphazard film as this drew negative reviews upon initial release. No, it is not nearly that bad, but whether the film's scattered virtues amount to a positive experience is likely to vary per viewer."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "buzzy_bob",
        "review_rating": "5",
        "review_title": "Could be very good",
        "review_detailed_main": "It could be very enjoyable....but fails on many levels , mainly editing, despite a lot of good things (evil corporation and even more evil McDowell, creativity and crazy comic drawn moments). I do like comics and surrealism, but the main actress is too cringy for me and the \"man-kangurus\" were too childish in comparison with the rest of the movie.\n\nIf you like the main actress and the genre, you'll surely like the movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "josephcoldwell",
        "review_rating": "10",
        "review_title": "This movie should be horrible but manages to be amazing",
        "review_detailed_main": "This movie has every opportunity in the world to be horrible and manages to be amazing. I don't know how the director, cast, and crew took something so absolutely ridiculous and make it into something so fun. It is a movie full of serious undertones and suffering, but manages not to take itself seriously at all and find the fun in all the pain. It is sassy and full of personality. If you want to watch something fun and full of attitude, something campy and endearing, this is for you. Though there are many sociological parallels to times of unrest and change, and a lot of interesting social and political undertones (like feminism, corporate greed, etc), if you're looking for something serious or something without plot holes, inconsistencies, and makes sense, give this a pass. This movie doesn't care to maintain the 4th wall and it doesn't care to follow logic, science, or even to make sense in all its details, but it is full of humor, great campy acting, and an \"I don't give a damn\" attitude that tugs at my rebellious heart strings. If I could give it 6 stars, I would.\n\nAnd for the Tank Girl Comic Book Purists out there. This movie isn't the comic book on screen. Like any good comic movie, it uses the comic book for inspiration and finds it's own way. If it took itself seriously enough to hold hard to comic book canon, the movie would have been absolutely horrible. This is Tank Girl for Christ's sake! A girl with a pet tank and a hippie kangaroo-man lover. Don't take it so seriously."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "nankipu",
        "review_rating": "",
        "review_title": "Becky's my grrl",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "rinohayakawa",
        "review_rating": "6",
        "review_title": "Character rather than Plot",
        "review_detailed_main": "I enjoyed this movie mainly because of the visual design of the characters. I like how Tank Girl's clothes were messy yet oddly fashionable at the same time. I felt it embodies her personality as a wild-natured, independent woman while also showcasing her feminine passion for fashion. Her various outfits definitely kept me entertained throughout the movie. It's cool to see movies that don't depict strong women by simply making them look stoic and masculine. I also thought that the design of the Rippers was better than a lot of the humanoid creature designs in more recent movies. I love how the Rippers have a distinct facial design that is easily recognizable as individual characters rather than just a copy-paste of the same creature's faces. It was interesting how expressive they were despite their seemingly emotionless beastly designs. I feel that it's a shame that we only get to see their faces later in the movie.\n\nWhile I do agree with many of the reviews on how bad the story is, I think that it is not the way to enjoy this movie. I felt that the movie is more driven by the main heroine's nature rather than the goal of saving the world from an evil corporation. One clear example of this is the scene at the Liquid Silver Club where Tank Girl spontaneously starts a musical sequence that has nothing to do with their objective of rescuing a girl. I simply understood that this movie is pretty much just about Tank Girl being Tank Girl."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "angelmaciel-90131",
        "review_rating": "6",
        "review_title": "CTVA215",
        "review_detailed_main": "Well, the first time I watched Tank Girl in class, it was quite unexpected. I knew from the outset that this was no ordinary action movie: set in some post-apocalyptic world, it is centered around Tank Girl-also known as Lori Petty-an extremely tough and defiant woman who drives a huge tank. The plot concerns her crusade against a corporate evil force controlling the last remaining source of water, but not for long, as in a moment it slips into a chaotic cocktail of strange characters, high-voltage action, and bizarre humor. The movie doesn't take itself seriously at all; I just found it confusing and kind of refreshing. I felt that was more about style and attitude than about having any decent plot or character development. Visuals are bright, colorful, at times cartoonish with live-action combined with animation; it's this feeling that's kind of unique in a surrealist way. At times, the fun action just feels utterly random, unrelated to anything else going on in the movie, or just the outrageous, punk-rock feel of the entire movie was the main purpose of the film. Wild, unpredictable, and all-around crazy, Tank Girl does not really make much sense with most of her acts, which is exactly the boldness that sets her character apart. Overall, Tank Girl is that sort of weird movie-messy, unpolished-yet has a lot of energy and weird charm to it. It is not the kind of movie one watches for an in-depth plot, but it is a movie worth seeing if one is searching for something odd yet fun."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tori_1995",
        "review_rating": "10",
        "review_title": "Tacky and Brilliant",
        "review_detailed_main": "Tank Girl is one of my all time favorite movies, it's tacky and kinda silly. But for some reason both I and everyone I show it too falls in love with her in-your face attitude and power.\n\nTank Girl is one of those movies you have to watch with an open mind, because the characters, plots and well almost everything else is very unbelievable and if you criticize it too much you'll hate every second of it.\n\nIt's an upbeat movie, that at the end with make you want to be just like her :) (I'm starting to read the comics and they're good too!) A cult classic, will a kick ass attitude"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "elijahkatz",
        "review_rating": "6",
        "review_title": "Worth a watch. Somethings missing though",
        "review_detailed_main": "Tank Girl is a movie I find compelling for its commitment to tone, costume, and set design more than for its actual storytelling. Adapted from a comic series known for its chaotic energy, the film takes viewers on a wild ride through a post-apocalyptic world, with Lori Petty giving an unapologetically bold performance as Tank Girl herself. Her attitude and style are undeniably cool, and she brings a kind of rebellious charm to the role that is hard to forget.\n\nWhat stands out most to me, though, is the film's aesthetic. The costume design, especially for the mutant kangaroo characters, is a strange triumph. Ice-T as a \"horny kangaroo man\" is certainly an unusual casting choice, but he fully commits to the role, adding to the film's eccentric charm. Malcolm McDowell also makes an appearance, and as a fan, I always enjoy his willingness to dive into bizarre roles with such dedication.\n\nDespite these strengths, Tank Girl often stumbles when it attempts to mimic the energy of the comics. The use of actual comic strips as inserts exposes just how far the film falls short in replicating the source material's anarchic spirit. The humor, too, feels hit-or-miss, leaning toward a meta style that prefigures Deadpool-a tone I find more grating than funny.\n\nIn the end, Tank Girl is an interesting film with a distinct visual flair and a commitment to being unapologetically strange. However, it's also limited by its budget, which constrains its ability to fully capture the comic's zany, unhinged essence. While flawed, it's a unique artifact that reflects the challenges of bringing such an out-there comic to life on screen."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Adam Tan",
        "review_rating": "",
        "review_title": "I can't help falling for Lori Petty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "giancarlopicanco",
        "review_rating": "7",
        "review_title": "Good acting, special effects, and weirdness",
        "review_detailed_main": "I was told that this is a comic movie before people thought they were cool. Except this was a more down to earth kind of comic, takes place in a dystopian future where a comet dried somehow halted Earth's water cycle. No powers, though there are the Rangers' abilities because of being abandoned genetic super soldiers and their body suits. But it does include a super corrupt corporation that may not be out of place for Lex Luther. Though I have a hard time believing that he and his company would focus on creating mutant creatures and trying to take all the water for themselves when it would be more beneficial for everyone for them to solve the water crisis. Perhaps it's meant as some commentary on the rich and powerful often think of themselves rather than helping for the better good, even when it would affect them in the long term as well.\n\nSome style and aesthetic choices I have a hard time picking, even with considering the futuristic, fallen setting of the movie. One would be the \"water power,\" the name itself I have a hard time taking seriously,\" wearing those metal square things with green scanners over their eyes. Others include the main character Rebecca's hairstyle and what the Liquid Silver's clothes looked like among the robed men. There's one thing that I can get behind, and it's the special effects, from the Rangers' animal bodies, even the way their ears move up and down, how people's bodies get drained when the corporate leader sucks water out of them with his device, and the holographic head. I'm starting to notice a pattern in cult films that have quite good special effects that are enjoyable to watch despite having limited budgets.\n\nWeird lines like the executive saying that most of the water in the desert now belongs to water.. The other is Rebecca using oil and vacuums as innuendos out of all things when trying to provoke one of the water power guards while being transported. Another is the corporate leader thinking about the creation of the world happening by the eight deaths just from being told Rebecca killed eight of her men. Maybe it is just people losing grip of their sanity from being in the apocalypse. Despite all this, I really loved Rebecca's actress' acting. She convinced me that seeing her loved ones getting killed and facing flashbacks of their deaths and attacks devastated her. In fact, another thing that I heard about the film is that the lead is the highlight of the movie, one of the main reasons why it has a cult following. I can see why for that reason, even if the supersaturation of the flashbacks she faced and the lines she gets ruins it a few times. Plus, it's clear that she cares for Sam, the young girl that gets kidnapped and taken, and that makes her good to root for.\n\nOverall, a movie that isn't great and can weird you out a few times, but that's why it ended up being so enjoyable."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "itsnoah-28899",
        "review_rating": "6",
        "review_title": "Review for class",
        "review_detailed_main": "Tank Girl, directed by Rachel Talalay, was released in 1995. It's a wild, emergency ride that breaks all the rules of \"conventional\" film making. It's based on the British comic book series of the same title by Jamie Hewlett and Alan Martin. The film is set in a post apocalyptic world, where water is the most important and precious commodity. The story follows Rebecca Buck, also known as Tank Girl, played by Lori Petty, who becomes a rebellious, irreverent hero fighting against the evil corporation Water & Power. The film's most distinctive feature is it's unapologetic and quirky punk, rock, aesthetic. From the vibrant costumes, to the chaotic and fast paced editing, TankGirl is a visual treat that captures the spirit of photography. The soundtrack was something to write home about. It complements the themes of rebellion very well within the film. I recommend this film to people. While it may not be a film for everyone, its unique style and daring approach make it a cult classic. It's a movie that celebrates individuality and rebellion, and it does so with a sense of humor and a lot of heart. If you're a fan of unconventional, offbeat films with strong female leads, Tank Girl is a must watch. It's a movie that doesn't conform to the usual norms and instead, creates its own wild, vibrant world. In conclusion, Tank Girl is an adventurous film that stands out for its boldness and creativity. It may be chaotic and over-the-top, but that's precisely what gives it its charm. It's a film that invites you to join in the fun, embrace the chaos, and enjoy the ride. If you're looking for something different, something that breaks the mold."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "TomSwirly",
        "review_rating": "10",
        "review_title": "If you don't like this movie, you probably don't like fun.",
        "review_detailed_main": "Loud, obnoxious, ridiculous - we laughed all the way through it. Full of visual invention and just plain silliness. I honestly think people don't like movies where all the heroes are female - like that happens so often in film - and that's why this gets such poor scores!\n\nAh, IMDb doesn't like my short, sweet review. Well, there's lots of good music, a quick cameo by Iggy Pop, a strong supporting role by Ice-T (as always, an asset), and a splendid villain in Malcolm McDowell.\n\nReally, IMDb, I have nothing else to say - please let me post. Must every review be an epic? I've been trained to be clear and to the point. If I don't have ten lines' worth of material, why must I pad?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kathyr-98595",
        "review_rating": "7",
        "review_title": "Loved how fun it was",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "buckaroobanzai50",
        "review_rating": "",
        "review_title": "No wonder it tanked!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "frostyde",
        "review_rating": "6",
        "review_title": "Stylisticly Great",
        "review_detailed_main": "... but! I fell asleep halfway through! :(\n\nNot to say it was boring. I think the dull acting and story wasnt gripping and the style couldnt make up for that. Not one to watch if you're not going to analyse the costumes and style.\n\nBut snappy graphics and soundtrack are surely worth it! - Right?\n\nI promise to give this another chance."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tylerkang",
        "review_rating": "7",
        "review_title": "Chaotically Fun",
        "review_detailed_main": "Tank Girl (1995), directed by Rachel Talalay, is a wild, punk-rock sci-fi movie based on the British comic of the same name. Set in a post-apocalyptic world where water is controlled by a greedy corporation, the story follows Rebecca, nicknamed \"Tank Girl,\" a rebellious and eccentric hero who teams up with Jet Girl and a group of mutant kangaroos called the Rippers to fight back and reclaim the water supply.\n\nThe movie is chaotic and over-the-top, much like its main character. Lori Petty brings Tank Girl to life with boundless energy and a devil-may-care attitude, making her a standout as the film's quirky, fearless lead. Naomi Watts, as Jet Girl, gives a quieter but equally enjoyable performance, balancing out Tank Girl's wild personality. Malcolm McDowell plays the villain with his signature sinister flair, but his character feels underdeveloped compared to the leads.\n\nOne of the most unique aspects of Tank Girl is its style. It mixes live-action, animated comic panels, and punk-rock music to create a rebellious, in-your-face aesthetic. The soundtrack, curated by Courtney Love, features bands like Hole and Björk, perfectly matching the film's edgy vibe. However, the movie's plot is messy and feels rushed at times, making it hard to follow. The humor and tone are hit-or-miss, and not everyone will appreciate its weirdness.\n\nDespite its flaws, Tank Girl is a fun, unapologetically strange movie with a lot of heart. It's not perfect, but it captures the spirit of the comic and stands out as a unique piece of '90s pop culture. For fans of quirky action films or offbeat heroines, it's worth checking out for its sheer originality and rebellious charm."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "magick-1",
        "review_rating": "10",
        "review_title": "rock'em sock'em grrl fun",
        "review_detailed_main": "funny, smart goodlookin and fast. and im just talking about the lead character...\n\nunique blend of action and comic cuscenes, good sets and costumes and a very good soundtrack.\n\nTG is a departure from the comic but a good one. dont expect to see the xrated antics of TG from the book, but do expect an in your face tongue planted firmly in cheek spoof full of wise cracks and light action.\n\na good time will be had by all! (especially tank girl)\n\nthumbs way up!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mitchs-5",
        "review_rating": "7",
        "review_title": "Sure The Movie Is Stupid, But Who Cares",
        "review_detailed_main": "I laughed myself silly watching this. Alright, so no one really believes the story, but who cares, this is entertainment. Grab a sixer, or more, sit back and enjoy! The movie is not brilliantly acted, but it does not pretend to be anything more than it is: escapist movie going. Come on, one of the stars is a talking mutant kangaroo! If only some of Hollywood's real major productions were as unpretentious they too would be fun to watch.\n\nThe action is wonderful, the cinematography is better than some high budget bombs, the acting is spoofy, the dialog is laughable and the big song and dance number is terrific. What's not to like?"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "EverlastingRosepetal",
        "review_rating": "",
        "review_title": "Let's Do It! *tiny spoilers*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "woo-movies",
        "review_rating": "6",
        "review_title": "Surprisingly good",
        "review_detailed_main": "So far after watching a bunch of cult classic, my expectations going into watching every movie has been low, so to my surprise, I enjoyed watching this movie. I loved the contrasting personalities of the two lead women, and their friendship where Tank Girl is daring, chaotic and all over the place, pushing Jet Girl to get out of her comfort zone. The sexual stuff was unnecessary in my opinion, but not deal breaking when watching the movie. When the animated clips showed I was pretty confused, but then after watching Tank Girl I read that it is based on a comic series, but even before seeing it is based on a comic, I liked the animations. It's different, as I do not think I have ever seen another movie do that type of editing style, and it made the movie even more interesting. Overall I liked the unique aesthetic of the movie, the clothes, the look of every character, and the weird personalities. Although there is not that much to the plot where she is basically fighting for herself and her friends, the actors succeeded in keeping me entertained."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "reddiemurf81",
        "review_rating": "6",
        "review_title": "Mid-90s!!! Ya gotta love it!!",
        "review_detailed_main": "I don't understand how this is supposed to be terrible,,, I grew up during the 90s and this is pretty typical of 95. Lori Petty and Naomi Watts battling it out against a tyrant (Malcolm McDowell),, what's terrible?!? Idk,, I like it. It's funny, lol\n\nSo just watch it!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "DownLoAdEr",
        "review_rating": "10",
        "review_title": "Fantastic Fun For Fun.... Fluffs!",
        "review_detailed_main": "Fabulous Film! Loved every moment! Girls the world over should see this and take note. Girls don't wanna have fun, they wanna TANK! Gimme more PLEASE!!!! I loved this popcorn munching evening getting lost in all the plot holes etc, what a scream! Everything is there, poor cgi, poor lines, poor screen play, but a fantastic story and idiots acting between all. This is a must see for all!\n\nDimm the lights. Switch on the surround, and make sure you have all the popcorn you need.....then ENJOY!\n\nIf you can't do that then you are brain dead or a critic without a brain.\n\nnuff said"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "charlieangel",
        "review_rating": "6",
        "review_title": "An amazing piece of subculture",
        "review_detailed_main": "This is cheap, dumb and ugly, and if you're looking for \"cinema\", forget about it. But what an amazing piece of subculture ! It goes weird as a 60s teenage psychedelic pulp flick, it embraces girl power style and attitude (Gwen Stefani, how many times have you seen this one ???), it mixes Mad Max and Mel Brooks, Punky Brewster and Spawn... Totally Z and yet unmissable."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "bad_kitty",
        "review_rating": "",
        "review_title": "Awesome movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "itsnoah-28899",
        "review_rating": "6",
        "review_title": "Review for class",
        "review_detailed_main": "Twin Peaks, created by David Lynch and Mark Frost, premiered in 1990 and is still one of the most unique and compelling TV series around. The first episode sets the tone with its eerie, dreamlike atmosphere that pulls you right into the world of this small, seemingly quaint town. The show's blend of mystery, supernatural elements, and quirky humor makes it a standout, unlike anything else on television at the time or since. The characters are a big part of what makes Twin Peaks so memorable. From the enigmatic FBI Agent Dale Cooper, to the quirky and complex townsfolk, each character is richly developed and adds depth to the story. Lynch's direction is meticulous, creating a sense of unease and intrigue that keeps you hooked. I think people should get into the series. Its unique blend of genres and its rich, atmospheric storytelling make it a must-watch for anyone who loves mystery, drama, and the bizarre. The series delves deeper into its intriguing world, offering twists and turns that will keep you guessing and coming back for more. In conclusion, the first episode of Twin Peaks is a perfect introduction to a show that defies conventions and draws you into its mysterious world. Its combination of engaging characters, eerie atmosphere, and compelling storytelling ensures that you'll be hooked and eager to see where the story goes."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "jonahstewartvaughan",
        "review_rating": "7",
        "review_title": "Tank Girl (1995)",
        "review_detailed_main": "Cult Cuts Volume 6\n\n#3/4: Tank Girl (1995)\n\n(7/10):Tank Girl is an avant garde style 90s superhero film based on a cult comic strip and I'll say, it's bizarre.\n\nIt's got a very unique and distinctive style to it that is a bit Mad Max,bit Comic Book and a bit Cartoon,mixed with a neo steampunk look and a one of a kind attitude.\n\nIt has some pretty big names in it: Lori Petty,Ice-T,Naomi Watts,Malcolm McDowell,Iggy Pop & also bit parts from James Hong and Doug Jones.\n\nThe storytelling format is very different as it felt like it moved at breakneck speed and then slowed down for a little then sped up again, that's also due to the avant garde style it uses.\n\nIt has a pretty damn awesome soundtrack and the effects are also done by the great effects titan Stan Winston and while we're on the subject here of the film's production value,can we just admire just how great the costume design is and also all the comic book art used in the transitions, because it excels at pulling off a great and unique look.\n\nI honestly didn't find it as funny as some people might, but humour is a very subjective thing, so it might not just be my kind of humour.\n\nIt does still stand as a very unique,fun,zany,odd and interesting film to watch, I would recommend it if you're looking for something a little different."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "KidUKnot",
        "review_rating": "8",
        "review_title": "Just plain campy fun.",
        "review_detailed_main": "Coming from someone who didn't read the comics before doing the movie, I find it to be just a pure fun nonsensical movie. Stupid fun! A movie that's fun to watch every few years to revisit. Go pretend it's summer and you're kicking back at the drive-in with no worries and have a good time."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "gian_99",
        "review_rating": "7",
        "review_title": "I wasn't a fan, was watchable",
        "review_detailed_main": "I watched this movie recently because I mistook this for a more recent movie (Amazon was giving 2023 as a date) and I did not understand it was an older movie until some time into it. I then discovered it became a cult classic and was probably a flop when it was produced in the years when the comics were popular.\n\nThinking about it, it came to my mind that tank girl had been in advertisements on old comics magazines in the early nineties and this movie completely brought to life the image I was remembering. It is ... cartoonish, a little childish, impossible, way too absurd, sexy also. And you will find yourself enjoying it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "peter_scott_best",
        "review_rating": "8",
        "review_title": "Do you like mental gymnastics?",
        "review_detailed_main": "When I went to see this I knew of it through a friend who avidly collects this sort of graphic novel. I took a girlfriend who obviously hated the movie and I could understand why. It tended to be overloud with comic book graphics inserted throughout. For those not familiar with the original graphic novels these tended to confuse the viewer though they were intended to inform the audience about events. Along the line of a picture paints a thousand words and saves about a half hour of filming and £500,000. As a movie though it worked, but only if you were able to survive the mental anguish of following the action and then interpreting the meaning of the graphic that popped up for 5 seconds, and back to action but one week later after whatever the graphic meant. I could do it, but for most of the audience that day the movie was too much work to follow. If you are familiar with the Tank Girl books or like movies you can watch and learn more from on each showing then yes this one it is worth it. If you are renting a movie for a night then generally forget it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "katjaweimer",
        "review_rating": "8",
        "review_title": "absolute fun!",
        "review_detailed_main": "i saw this film three times and i love it! it's so much fun to watch it. it's bright and funny. the main character is though she's quite childish, very sexy and a strong woman! and to everybody who says this film is stupid:come on!it's a comic! you can't make a comic serious! batman and robin is also not really serious,i mean:look at the penguin! it has to be weird and strange!bright and loud! it's fun,it's a party!when you watch it you also want to be as self confident and cool like the tank girl!..........i love it!the kangaroos are also quite cool!they got something that reminds to a motorcycle rider!if they were real men they would be quite sexy.....;-)WATCH IT!YOU'LL HAVE FUN!SURE!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "cb_whitewood",
        "review_rating": "8",
        "review_title": "Not deep, but chaotic and wild!",
        "review_detailed_main": "I can agree with some of the other reviews saying that there's not much character development/depth at play here, but nonetheless, Tank Girl is super fun! I loved the wild and yet not overly complex plot to this movie, and it's so easy to get swept up in the jokes and animations and comic shots. Tank Girl herself is wild and keeps you guessing her next move (something raunchy and crude, but what *specifically*?). Jet Girl is also fun if a bit whiny (I can relate), and the Rippers are a hilarious touch.\n\n8/10 for this one, because the two-hour length flew by, and I know I'd be down to watch it again. Somehow didn't catch that this was set in Australia, but with kangaroos as the only major tip off, I'm not feeling too dumb! Would definitely recommend."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "LigeiaCorpse",
        "review_rating": "10",
        "review_title": "Why does this cult classic have a bad rating?",
        "review_detailed_main": "I read the comics as a teen and I remember being so excited when this came out and it did not disappoint Almost 30 years later this still remains one of my all time favorite movies. Lori Petty does an awesome job as does the rest of the cast . This movie is everything you want a live comic book adaption to be. . I think most of the bad ratings come from the CGI culture. Guess what? This movie dont need it"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "KSprowl",
        "review_rating": "10",
        "review_title": "Despite hating Lori Petty as an actress..this film is good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kary82",
        "review_rating": "8",
        "review_title": "\"Tank Girl\" a bad movie?!",
        "review_detailed_main": "In my opinion, this movie is not as bad as everybody says... comedy isn't usually my favorite genre, but I have to say this movie is real fun:-)! Maybe not a masterpiece or something like that, but I thought it had quite clever humor and that it was not as silly as much more praised rubbish-movies... it was original and funny instead, and the \"after catastrophe\" thing was interesting... It deserved a little more success (partly thanks to Lory Petti and Naomi Watts)... and the soundtrack is so cool! Finally, (anti-)heroine Lory Petti was a really unusual and interesting character, and she played it really good I think"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "hwalls28",
        "review_rating": "8",
        "review_title": "I love this the way I love....",
        "review_detailed_main": "I love this the way I love Wayne's World, the Beastie Boys, and the concept of Catwoman. It's goofy/lovable, quick-witted/smart, and it's some sort of honest exploration of women as ruthless survivors (though it sounds like the comic books did a better job than the movie). Comic book adaptations today seem to be all about the special effects and having enormous balls. The female characters are sometimes more than one dimensional, but are probably not much fun to hang out with, especially during an apocalypse. Yes, I would want to hang out with Lara Croft during an apocalypse, but there you have it, the two leading roles played by women in action movies, the badass/serious/sexy and the damsel/maybe-smart-but-defenseless/sexy, so at least this movie has value in the fact that there are very few action movies with female leads in this sort of role.\n\nAnd the music, unhhh.....throwback whiplash. The Portishead and Bjork scenes especially. Yes. I should emphasize how campy this movie is in case anyone is expecting anything else."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "rowanthesloth",
        "review_rating": "9",
        "review_title": "You love it or you hate it",
        "review_detailed_main": "This is one of those films where you either love it or you hate it. Well, I love it. It is one of my all-time favourites. It's fun, funny, light-hearted, brightly-coloured comic book action/comedy at its finest. I really enjoyed that all the female characters were strong, colourful and well-defined. Lori Petty is fantastic in the title role, and her one-liners still get a giggle from me on the dozenth or so viewing. Malcolm MacDowell is exceedingly memorable as the main bad guy, and you can't help cheering for him a little bit, too. If you're looking for intellectual depth, look elsewhere. If you just want to unwind and have a few laughs with some smart, sexy heroines, I cannot recommend this movie highly enough."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Tallon",
        "review_rating": "10",
        "review_title": "Funny, weird and down right enjoyable to watch",
        "review_detailed_main": "I loved it so much I bought it. the plot was intense ,the story line easy to follow and the characters were some of the funniest that I have ever seen . All in all I would recommend it for anyone's vewing pleasure"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Crys-5",
        "review_rating": "10",
        "review_title": "A true girl-power flick",
        "review_detailed_main": "Lori Petty was born to play tank girl! Not that Niaomi Whatts is half bad, either.\n\nThis is a movie for the nineties... full of spunk, great hair, and bad-ass chicks with attitude. I have friends who would kill to be Rebecca.\n\nThis movie not only embodies the girl-power feel of the nineties, it brings it's own sort of reality to the screen. No one wants to see some pretty damsel swept up in the arms of some perfect, gorgeous guy. Life's not like that. Life is sweat, tears, and work. Oh yah, and reality also includes the girl PICKING the guy... We don't want some guy, full of his own self importance, picking us up and taking us to Laa-Laa land. We're people too!\n\nThis is an awesome movie, for many reasons, most of which give away the plot. So I won't spoil it for anyone... But I will tell you, I've got 7 scenes memorized straight from the movie.\n\nThat's how good it is. Oh yah, and it's not just for girls. I know a bunch of guys who think it kicks... But that might just be the generous use of Lori's flesh. ;)"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "thecanbykid",
        "review_rating": "9",
        "review_title": "Review of an excellent comic book movie",
        "review_detailed_main": "I saw Tank Girl for the first time when it was somewhat new, and enjoyed it very much, I have now seen it many times, and it is just as great. If you are looking for a movie with big name A-list stars, and huge F/X budgets, this is not that movie, but it's a safe bet you would enjoy it anyway! This movie is just good old fashioned outlandish, campy fun. Based on the British comic strip of the same name, it follows our heroine, Tank Girl, and her band of ragtag friends as they battle the evil Water & Power in a post-apocalyptic world with no rain. It has a great soundtrack that fits the film very well, lots of action, and a great sci-fi/fantasy plot with a little comedy thrown in, not to mention Lori Petty as Tank Girl makes the movie what it is, very enjoyable. Alongside her is Naomi Watts who plays Jet Girl in excellent fashion, as well as Ice-T and Malcolm McDowell as the sinister villain. The movie feels a lot like a low budget indie film that was picked up by a major studio, and there is reportedly some lost footage out there, but all in all, if you like movies like The Running Man or The Wraith or any other unconventional action/sci-fi movie, at very least, you will surely enjoy Tank Girl!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tobiwalker",
        "review_rating": "8",
        "review_title": "Ahead of its time",
        "review_detailed_main": "This film wasn't well-received at the time of its release but I think it deserves to have cult film status even if only for the music. Special effects may have gotten more slick since 1995 but women haven't gotten any sassier. I think today's girls will appreciate this much more than did mid-90s filmgoers."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "wiredrabbit",
        "review_rating": "10",
        "review_title": "Kicks Ass",
        "review_detailed_main": "If you didn't like it, it is probably cause your some middle class khaki wearing square. Well, that's most of the world I guess. But this movie rocks. It's stupid, it's funny, it has attitude. Girls kick ass."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tser",
        "review_rating": "10",
        "review_title": "killer movie with a strong female character",
        "review_detailed_main": "I adore this movie. It's in my top 10 favorite movies of all time.\n\nI really like movies that portray strong, perhaps rebellious, female characters. Tank Girl (Rebecca) definitely fits the bill, a witty, take-no-crap chick who leads the way with an almost nonchalant air. And I love Tank Girl's hair and outfits. She doesn't care what other people think about her.\n\nThe writing is excellent, I think it's a great adaptation from the comics (one of the few comics I have ever read). The witty word play is fun, the story is amusing and interesting (well done as a post-apocolypse movie, if not scientifically correct) and the characters are great, especially how Tank Girl holds everything together, and Jet Girl develops through the movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Reddinsd",
        "review_rating": "10",
        "review_title": "A New Cult Classic, A Zany Sci-Fi Masterpiece",
        "review_detailed_main": "To begin I personally am a fan of both Sci-Fi and of Action movies. I harkened back to the days of \"Mad Max\" and \"Solarbabies\", \"Tank Girl's\" Genra Rivals.\n\nSo I may exibit a bias in favor of movies of this particular Genre. I thought \"Tank Girl\" was a fantastic attempt to bring the spirit of an Irreverent Comic Book Charicter to the Big Screen. I understand that in order to make a movie such as Tank Girl marketable a Studio in this case \"United Artists\" must attempt to appeal to as many people as possable. Therefor some but clearly not all of the spirit of the origional Comic Book Charicter is lost.\n\nI have heard several reports about this film and let's just say that not all of them were favorable. However many people do not read comic books and therefore don't have the background to truly judge the attempt. If they had perhaps other comic to movie projects would have been reviewed more favorabley I.E. \"Judge Dredd\", \"The Mask\", \"Barb Wire\".\n\nI must state that I don't think a movie could have been cast with more accuracy. Lori Petty is the perfect Rebecca a.k.a. \"Tank Girl\". As her charicter \"Tank Girl\" She exuded irreverence, sarcasm, and spunk. Naomi Watts renderd a perfect \"Jet Girl\" A woman struggling to become herself. Ice-T was the perfect Ney-sayer, and Malcolm McDowell was evil incarnate.\n\nPersonally I realy liked the movie. I attended the original screening at a local theater and I am an owner of the Home Video version of the film.\n\nI was terribly sad to hear that there was a lot of original footage cut from the final product. Perhaps this footage would have brought the full character development that many of the films critics thought was missing.\n\nI was Outraged that the Studio will not allow a Directors Cut. I sincerely hope they will someday. Perhaps a DVD special edition with all the missing footage... A videofile like me can only dream."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "blueberryd",
        "review_rating": "9",
        "review_title": "Loved it!",
        "review_detailed_main": "I thought this movie was FANTASTIC! It is funny, and she has a tank. What's not to like? It really is just a silly little movie, not to be taken very seriously, or at all for that matter. It's got the whole \"girl power\" thing going on too, which usually is kinda annoying, but works in this movie. and Tank Girl is so punky and cute(like, in an adorable kinda way)! the music is awesome too. It has Veruca Salt, which in and in it's self is fabulous. bush and hole too? wow! it's like a trip down musical memory lane for me. I would recommend everyone watch this movie, although it's the type of movie that most people would hate and think was stupid. i loved it.\n\n...and I've always wanted a tank."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "debbiejane",
        "review_rating": "10",
        "review_title": "15 Times!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "scotrep",
        "review_rating": "10",
        "review_title": "Middle finger nostalgia!",
        "review_detailed_main": "One of my favourite films.\n\nWas 14 when it came out and it still holds up as a little weird dystopian fantasy!\n\nAction movies are boring as hell. Sci-fi can still sometimes turn it out (Well done Star Wars/Guardians of the Galaxy). Rom-coms have become tiring and formulaic.\n\nTank Girl stood out, and still does, as that little bit different.\n\nThank you Lori Petty for creating one of my childhood role models ;)"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "earlynr",
        "review_rating": "9",
        "review_title": "This Movie Rocks!",
        "review_detailed_main": "This movie *does* rock. The score is terrific -- totally cutting edge. From Lori Petty's deliciously kick-ass heroine to the goofy comic book scene cuts to the partying kangaroo dudes -- this is one hip and entertaining movie. Whoever selected the music, though, deserves the highest recommendation. Buy the Tank Girl soundtrack if you can."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "UniqueParticle",
        "review_rating": "10",
        "review_title": "Very underrated gem!",
        "review_detailed_main": "Sure it's cheesy but it's the best of weird action movies! Lori Petty is legendary throughout and flows with glorious charm! Feels perfect for a late night or other times if you're like me where you appreciate Tank Girl for what it is. Naomi Watts is lovely I like seeing her with glasses and black hair. Gritty cinematography with silliness and wonderful soundtrack!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "jimvandemoter-50236",
        "review_rating": "9",
        "review_title": "fun flick",
        "review_detailed_main": "This movie is all kinds of weird and i love it. Totally comic book from start to finish. I think people who hate this movie don't know how to have fun, and take life way too seriously. Just lighten up, stop being so pretentious, pull your cranium out of your rectum and enjoy the ride."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "scifi90",
        "review_rating": "10",
        "review_title": "Simply a fun movie",
        "review_detailed_main": "Colourful, positive, funny - plus the Tank Girl is hot :D"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mikes_baby_doll",
        "review_rating": "10",
        "review_title": "one kick ass movie!",
        "review_detailed_main": "i absolutely love this movie. every time one of my friends come over, if they haven't seen it, i make em watch it! and so far every one of them has loved it! i really wish there was some where that i could get my hands on the comics! i also wish they would come out with a directors cut or something cuz if you haven't read up on any of the trivia stuff and what not that tell you what was cut from the original and such, its a little hard to follow the movie. i have found some goofs in the movie that aren't listed on the goofs page. one of them is when keslee asks tank girl how many of his men she killed. when he is told 8, it should really be nine. i found some others as well but i cant think of them off the top of my head right now."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kados-1",
        "review_rating": "10",
        "review_title": "This. Was. EPIC!!!!",
        "review_detailed_main": "Officially my new favorite movie of all time!!!\n\nWhat other movie has psychedelic vegan hippy mutant kangaroos?! - NONE! xD And sexy punk protagonist who takes a sand-shower in slow-mo to Portishead?! And pimped out tanks that have a personality and shoot cans of beer?! Yeah.\n\nWhy oh why don't they make films like this anymore...? Man, I miss the 90's."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ZazuPitts",
        "review_rating": "9",
        "review_title": "What a great comic!",
        "review_detailed_main": "If you like comic books, you'll love \"Tank Girl\" the movie. Lori Petty is hilarious and the perfect fit. I couldn't imagine anyone better. The style and direction of the film make it a cult classic! I have been a fan of British humor for quite a while and this is just one form of it. If you come in to this film ready for a fun ride it will take you on one. If you haven't seen the unedited version there are deleted scenes that add a certain twist to the film. Life is too short...you have to laugh once in a while!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "BenO-5",
        "review_rating": "8",
        "review_title": "Switch your brain off and enjoy!",
        "review_detailed_main": "Not quite the film it could have been. Being a long term fan of the comic strip the prospect of a Tank Girl movie was a little bit daunting but it didn't turn out too bad. The performances were sound (in the case of Malcy McDowell, just OTT and hammy enough) and the plot almost non-existent. The same as the comic. However the characterisation was not the same. Still, if you have an hour an' half or so to spare, sit back with a beer and your mates and enjoy."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "vixvox",
        "review_rating": "8",
        "review_title": "powerful chick movie",
        "review_detailed_main": "There's plenty of macho movies to boost male egos...now it's our turn!\n\nThis isn't a sappy chick movie that makes you feel warm and gushy. This is a powerful, in-you-face, media sensation that makes you laugh and say, \"Chicks RULE!\"\n\nI loved how the movie's soundtrack was very prominent (great songs!) and how they mixed other media into the film.\n\nI didn't read any of the Tank Girl comics, so I don't know if this is \"on track\" with it's origins, but I still loved it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "batzi8m1",
        "review_rating": "9",
        "review_title": "Makes the boys stand at attention",
        "review_detailed_main": "OK Listen Up. Tank Girl. It's a comic. Punk rock squatters defy the evil empire that sells water at extortionist prices. Genetic mutant warriors recite beat poetry. Malcom MacDowell gives his best Alec (Clockwork Orange) leer. If you expect to follow a plot here, you miss the movie. It's about babes, dancing, defiance and motorized vehicles - The basic elements of Rock and Roll. Pedofiles, Dancers, Orgies, Decadence, Greed are all foiled by irreverent punks in stolen hardware while the heros enjoy their own. And the hero claims that pain makes her wet. For a follow up, I would suggest either a Checkered Demon or Horney Biker Sluts movie, but those might be just a little to strong. But then again somebody made a Crumb movie, and Fritz the Cat ... and Tank Girl."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Chihuahuabot",
        "review_rating": "8",
        "review_title": "It's Fun",
        "review_detailed_main": "A silly movie about a tough girl and her tank taking on the world in a post apocalyptic future. It's all very campy and fun. The effects are not too bad. The music is great. Malcolm McDowell is the bad guy. Lori Petty is well cast as tank girl bringing the kind of nuttiness that the role requires."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "belle1982",
        "review_rating": "10",
        "review_title": "One of my favorite sci-fi girl power movies ever!!!",
        "review_detailed_main": "First there was Barbarella, second there was Lt.Ellen Ripley, third there was Barb Wire and the last there was Tank Girl, TA-DAH!!! I'm talking about the go-to-war punk girl who wants to have fun and kick some butt! THIS MOVIE ROCKS!!! when I first seen \"Tank Girl\" which was based on a popular British comic book series,it changed my life! it made me believe that I have girl power and don't take no bull. This movie has everything:it shows scenes from the comic book,real action,and the best part is Tank Girl blowing up stuff and kicking other guys butts! THAT'S COOL!!! Unfortunately, \"Tank Girl\" wasn't a box-office hit but it was REALLY FUN TO WATCH if girls like me want to see how real girls in sci-fi flicks like this one go to war, get revenge and rock and roll. Lori Petty was so wonderful as the funky title role and Malcolm McDowell (from A Clockwork Orange and Time After Time and such cool flicks) as the supervillain who steals a whole bunch of the world's water supply is a highlight! The best part of the movie is when Tank Girl and Jet Girl does a musical number of the song \"Let's Do It\" I wish there was a sci-fi musical in the near future, WOULD YOU LIKE THAT? This movie should be recommended to everybody who likes comic books made into movie adaptations...........AND GIRLS WHO LIKE TO SEE GIRL POWER!!!!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "TomAyles",
        "review_rating": "8",
        "review_title": "Great B-Grade Fun!",
        "review_detailed_main": "If you hate campy, B-Grade science fiction movies based on comic books then stay away from Tank Girl. On the other hand, if you are a fan of the Tank Girl comics, or just love fun, irreverent movies with strong, sarcastic, ass-kicking female protaganists, give this movie a try. It is absolutely one of the best-produced and directed films in this genre."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "xxxoren",
        "review_rating": "",
        "review_title": "Not so bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "wingnut77",
        "review_rating": "10",
        "review_title": "Brilliant!!! Amazing!!! Classic!!!",
        "review_detailed_main": "The greatest movie ever!!!!!!! What else can you say!?!?!?!?!? Lori Petti you are a goddess!!!!! So original, so unique, so funny! THE BEST MOVIE EVER!!!!! So out there! It's like someone finally made a movie with all the people in my head!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Tank Girl Jet Girl Rock!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "moon_otter",
        "review_rating": "10",
        "review_title": "This movie is hilarious and deserves at least one look over by all.",
        "review_detailed_main": "Where do I begin? First of all Lori Petty and Malcolm McDowell, how can we go wrong? Sexy Lori Petty takes on the most powerful force left in the world, Water and Power led by Malcolm McDowell. She seeks help from a mutant army of kangaroo men (the Rippers) including Ice-T clad in Ripper gear, to help her get back her friend from WP. The movie is filled with beautiful comic animation interwoven with witty one liners and cyber punk clothing. This movie is totally pro-feminism and the girl kicks butt! All i gots to say is \"Pa-pa-pa-Pow!\" Give it a look over!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "oldbluebear",
        "review_rating": "",
        "review_title": "studio ruins a great film!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Simon-121",
        "review_rating": "8",
        "review_title": "Great fun",
        "review_detailed_main": "I've seen this film several times now and I still really like it. It's great fun and refreshingly different. The casting is inspired - I can't imagine anyone playing Tank Girl any better and the whole idea of Ice-T as a mutant kangaroo is hilarious. The comic-book style works so much better than it does in other more 'serious' films, like Dick Tracy or Batman."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Eric-1226",
        "review_rating": "",
        "review_title": "And now, for something completely different... Tank Girl!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tankgirl_ni",
        "review_rating": "10",
        "review_title": ":o)",
        "review_detailed_main": "well, I'm a HUGE tankgirl fan so this is probably biased.. but still. I've got all the comics and all the merchandise possible.. as for the movie.. well, ok so it was pretty far off the comic and the storyline is a wee bit dodgy if u dont know anything about Rebecca Buck and her friends, but it's a good laugh. Lori Petty was perfect for the role, and Ice T was class! I love this film and I will love it til the day I die. The soundtrack is amazing and the tank... well what can I say, part cadalack and part soviet MK1 tank.. excellent :D Bring on the sequel.. tho make it a bit more like the comic version! Cheers :D"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Kevinduran",
        "review_rating": "8",
        "review_title": "Lori Petty's a genius!",
        "review_detailed_main": "Cool movie that stays pretty true to the comic book. I always thought that Emily Lloyd would have been perfect for the role of Tank Girl- and was sort of disappointed when it was announced that Lori Petty would play her- but she was actually GREAT in the movie. Very creative and clever- I knew it would be \"lost\" on American audiences who really don't seem to have a lot of imagination when it comes to going to the movies.... and yes, I am an American so I can say that."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "gooffeefree",
        "review_rating": "10",
        "review_title": "Not for everyone, but a definite YES for me.",
        "review_detailed_main": "If you are a die hard Tank Girl fan you will probably find this movie a very watered down version of Tanky and Co. If you are a cinematography buff or fancy yourself a film critic, you will probably not enjoy this film. I, however, loved it! It's campy, it's silly, ... it's just out there in an absolutely fun kind of way. Lori Petty was a great choice for this role. She's got the right body type to pull of some of Tanky's outfits and she gives off that tough girl vibe that you just love about the character. Did it do the comic justice? No, but then movies rarely do in the eyes of a fan. Was it an enjoyable experience? YES."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "metal_man1789",
        "review_rating": "9",
        "review_title": "Brush Your Teeth",
        "review_detailed_main": "Warning: The viewing of Tank Girl may cause cavities. This movie is so bad-for-you sweet, it's like a Gotta-Have-It sized Cold Stone Creamery creation with every topping. This is one of those movies where they threw everything on the wall to see what stuck. Imagine \"Natural Born Killers\" meets \"Mad Max\" meets \"Tomb Raider\" and throw some puppets in there and ya got this little gem. Lori Petty was born to play Tank Girl. Now, the plot may be crap, but the fact that they even tried to give it a plot is amazing, considering the sporadic epitome that is the comic. The Rippers are awesome, especially Ice-T. Malcom McDowell was always meant to play deliciously evil guys, even his villain here is a baby compared to Alex. The FX are fun to look at, the soundtrack is aggravatingly cool, and Tank Girl is everything you want from a heroin - tough and funny without being a huge slut (I'm talking to you, Megan Fox.) Leave your disbelief and your seriousness at the door and come enjoy the punk rock party that is TANK GIRL!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ViolentPrettyDotCom",
        "review_rating": "8",
        "review_title": "Yeah OK right.",
        "review_detailed_main": "Tank girl would have better been brought to PG13 to target a teen audience. Intergalactic werewolf lookin' guys playing saxophone really wasn't anywhere near enough to get my attention.\n\nThe girl changes outfits between camera alternations. She talks like she's six, and she giggles while shooting people. Now, generally, the psychotic militant part is what makes the movie, but believe me, if you're expecting something special you will be LET DOWN.\n\nThere is absolutely nothing great about this movie, it's all bells and whistles and smoke and special effects makeup, and I wish I didn't love it..."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "DaFraggle",
        "review_rating": "10",
        "review_title": "Give me an ass and I'll kick it!!",
        "review_detailed_main": "I don't know what it is about this movie that so thoroughly kicks ass, but it undoubtedly does. the storyline is not the most amazing, but then the point of a movie is to entertain and it certainly does that!! the \"rippers\" are absolutely hysterical, and both tank and jet girl show us gals the kinda people we want to be.... The rather random musical number is beyond words, its what every comedy needs!! MacDowel once again makes a great baddy, made better by the bad poetry.... and as for the tank itself... i gotta get me one of those!! show me a girl that hates this film and i'll show you the next applicant to the sisterhood of uptight prudes!!! and guys... if you're living and breathing then you must love this... that is unless your one of those strange comic-book store owners....."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "wileykylie",
        "review_rating": "9",
        "review_title": "Guilty pleasure",
        "review_detailed_main": "I have to say that not, this is not the world greatest movie. HOWEVER, it is one of the most fun things I have seen in ages. A welcome release from testosterone ridden action films, it is great to see a girl kick some serious booty. Malcolm McDowell has lost none of his creepy \"Clockwork Orange\" devilishness. I have to admit, my best friend and I rented this on a whim, and it is one of my favorite good \"bad\" flicks. Besides, too few action movies have musical numbers. It is nice to see someone trying to tip that balance."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kimwells",
        "review_rating": "10",
        "review_title": "Girl Power",
        "review_detailed_main": "This is a great film-- even where it deviates from the original comic. Lori Petty is quirky, the sets & costumes are true to the punk style of the comic. It's not a glossy \"pretty girl gets saved by action hero\" movie-- the GIRL is the action hero, and she uses everything in her power to save the day. Yes, the film is campy, yes the interspersed comicbook shots are a little different.\n\nI love Ice T as the grumpy ripper. I like it that Tank Girl helps teach Jet Girl how to stand up for herself. I love it that while at Liquid Silver, Tank Girl shows, through her playful rejection of the vapid hologram \"perfect woman\" image that those standards of beauty are pure junk.\n\nThis is one of my all-time favorite movies; sci fi that explores possibilities beyond \"using the force\" and \"boldly go-ing\" to get chicks."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "PookieBear51087",
        "review_rating": "10",
        "review_title": "This movie is crazy and i love it",
        "review_detailed_main": "Well this movie was so funny to me, i really liked it. I thought it was well acted and everything but maybe ppl thought it was just too crazy. I also like Lori Petty...i've liked her since A League Of Our Own. She's a good actress that just doesn't get enough credit. She doesn't pick the really big blockbusters and i admire that. I would like to do independent films but want a big movie in between. Well i'm getting off subject. I just wanted to say i like this movie no matter what anyone or critic has to say about it. OMG! When I saw \"The Ring\" i knew i saw that chick somewhere before and then it hit me. She's Jet Girl!!! Crazy! It's funny where you see how some of the big stars got their starts!!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "blurequalsbest",
        "review_rating": "10",
        "review_title": "it was the best it could be",
        "review_detailed_main": "as everyone who has seen this movie knows, the story of 'tank girl' was based on the comics. i think that to enjoy this movie you would have to enjoy comics and their surreal adventurous nature. and lori petty was best for the character of tank girl. i think the movie was excellently put together and i give it a ten out of ten."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "julieburns",
        "review_rating": "9",
        "review_title": "You go, girl!",
        "review_detailed_main": "On second viewing, \"Tank Girl\" is a remarkably intelligent amalgam of cultural detritus encompassing allusions that range from Cole Porter to Busby Berkely to \"Shaft\" to the Beat generation -- and more. It's also a great in-your-face female flick, triangulated somewhere between \"GI Jane,\" \"Thelma and Louise,\" and \"Romy and Michelle's High School Reunion.\" While technically so-so (e.g., editing, camera work, etc.), this film is intellectually over the top. Oh, did I mention Malcolm McDowell as a grown-up \"Clockwork Orange\" punk? Great fun...You go, girl!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "tom_decuir",
        "review_rating": "8",
        "review_title": "One of the best of goofy/bizarre!",
        "review_detailed_main": "Okay people, it's a film based on a comic strip- expecting a \"serious film that will make you think\" means you've taken the wrong turn in the multi-plex... If you didn't get the over the top humor in \"Buckaroo Banzai,\" or failed to see past it in \"Raising Arizona,\" you probably won't like \"Tank Girl.\" (you're probably wound a little tight as well and could stand a night out with your hair down...) But movies don't have to be all things to all people, right?\n\nThis is a fast, cheap, out of control romp through a tattered eared 'zine that's been passed around from kid to kid- one dimensional, goofy fun playing on all the base emotions, set in a perfectly imperfect future. The cast, Lori Petty, Ice-T (Ain't gone be no crumpets and tea!), Malcolm McDowell, Naomi Watts, Iggy Pop are ideal for this frenetically driven Buzzed-by Berkely style piece, which by the way, has an excellent hard edged soundtrack.\n\nExpect to know exactly who are the good and bad guys are. Expect post-apocalyptic glee, expect mutant ninja kangaroos, expect low-IQ stormtroopers, expect grrrlll power, good bad one-liners, and a bad-ass heroine that rides a tank! (but don't expect any pretension.) For it's sub-genre, a near perfect film!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Toejelly12",
        "review_rating": "10",
        "review_title": "Love, LOVE, this movie!!!",
        "review_detailed_main": "Ever since I've seen this movie a year ago, I've fallen in love at first sight. The movie was so great, I've been watching it over and over again. A month later, I've ordered the soundtrack and added some of my favorite songs on my MP3 player from it. Then just a month ago, I've spotted the Tank Girl DVD at Wal-Mart and I had to purchase it. Oh, I've got to find the comic next. Tank Girl is one of the greatest movies ever made and it saddens me that they never even got a award for it. Oh, they've got to do a sequel pretty soon. That would be awesome. Anyways, Tank Girl is one of the greatest movies of all time and should win an Oscar or an Emmy for best picture."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "dante42",
        "review_rating": "9",
        "review_title": "Hilarious, but not for norms",
        "review_detailed_main": "This movie is hilarious, but is not for straights. Basically, as long as you don't mind your comedy a little surreal, you'll like it. On the other hand, if you don't understand Monty Python, Douglas Adams, or Kevin Smith, you might want to give this a miss. The humor is a combination of high brow with a vary large sprinkling of idiocy, even managing to throw in a floor show half way through the film. It captures the feel of the British Comic quite well, while still working as a 94 minute movie. The Ripper make up is quite good, and with the exception of a couple wires that can be seen (the budget wasn't that high...) the FX are actually quite good. The flash of comic pages at key points also works quite well. McDowell is an excellent villain, and both Lori Petty and Naomi Watts do great jobs as the heroes. All in all, a great movie."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "thollinger",
        "review_rating": "10",
        "review_title": "My top movie. Totally off the wall!",
        "review_detailed_main": "My top movie. Totally off the wall! Then again I loved Howard the Duck. If your looking for a movie where you can't predict what's going to happen next, try this one. It's also one of those instances where the cast must of had fun making the movie & it showed in the acting."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "hokeybutt",
        "review_rating": "8",
        "review_title": "Lori Petty... Where Did You Go? Come Back!",
        "review_detailed_main": "TANK GIRL (4 outta 5 stars)\n\nA great role for actress Lori Petty (even though she was practically never heard from again after this film came out). The movie may have a few problems but none of them stem from her fantastic, funny performance. She plays a punk rebel chick in the future who runs afoul of the rich, white people (led by Malcolm McDowell) who own all the water (and hence, the power). After her desert-dwelling comrades are slain and/or kidnapped to become slaves, Rebecca aka Tank Girl comes to the rescue. She teams up with Jet Girl (a dark-haired Naomi Watts) and some terrorist kangaroos (Ice-T among them) to put end to the oppressive power-mongers. Lots of great ideas in this movie and lots of great one-liners. The action scenes work for the most part but sometimes they just don't have the panache that they need for an action picture. I also could have done without the comic strip inserts and animation scenes that pop up every now and then. The look of the movie is cartoony enough without having to \"remind\" the audience that it was based on a comic book. And then there is the Cole Porter dance sequence which (though I admire the idea behind the scene) is filmed with such a lack of visual flair that it just stops the movie dead. I mean, if you are going to put a gratuitous musical number into a movie that isn't a musical... it better kick butt! (Takeshi Kitano's recent Zatoichi, for instance.) But, really, the flaws in this movie matter less to me every time I see it. Fans of really strange, weird, science fiction comedies should get a big kick out of this movie!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "draheim",
        "review_rating": "10",
        "review_title": "Girls Kick A**!",
        "review_detailed_main": "Not surprisingly a breakdown of IMDB votes shows that women liked this film far more than the guys did. Lori Petty, at her very best, plays the ultimate riot grrrl on a mission to save her sister. Aided by a rocking soundtrack that runs the gamut from Beck to Stomp, Ice-T to Courtney Love, Bjork to Joan Jett, this fun flick should have adrenaline coursing through your system by them time the credits role. Afterwards - go out and conquer the world on your own! An excellent choice for a girls' night video rental."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "our_lady_peace_218",
        "review_rating": "10",
        "review_title": "Comic Book Style Craziness",
        "review_detailed_main": "I disagree with what was written about this before. This movie is based on a comic book, it was written as a comic book, and the style of the movie itself was based on the COMIC BOOK. The movie was obviously made for fans of the comic, and it was a wonderful adaption."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "alamax",
        "review_rating": "8",
        "review_title": "Harley Quinn's Evil Twin",
        "review_detailed_main": "Watching for first time in 2020. Some of the best one-liners since Airplane! And Blazing Saddles."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "vampi1960",
        "review_rating": "8",
        "review_title": "Tanks a lot",
        "review_detailed_main": "As a fan of the the comic book tank girl,i thought the movie was very good and true to the comic,although not well received by critics and many moviegoers.the blending of live action and some animation was a great touch.the title credits were good showing all the different tank girl graphics.Lori petty(point break)does an awesome job as tank girl. and Naomi watts(yes king Kong's Naomi watts)plays her friend jet.and of course there's the villain played by Malcolm McDowell.who plays the villain so well.and would you believe old school rapper ice t as a mutant dog man?there's an awesome soundtrack that varies from Joan jet to devo.forget what the critics said about this movie,rent the DVD or tape or watch it on cable.its campy fun.as comic book movies go its brilliant.i give tank girl 8 out of 10."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ajmilne",
        "review_rating": "",
        "review_title": "So remorselessly, consistently silly, cheap, and cheesy, it's rather brilliant",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ee_burton_16",
        "review_rating": "10",
        "review_title": "tank girl",
        "review_detailed_main": "i thought this was a great movie. it had just enough action to compliment the comedy . . . plus a tough chick like her is something that should b shown more now days. she is some one i think young lady's should see. better her than petty women that cooks in the kitchen and cleans the bathroom a women that can do what needs to be done. without the need of a \"higher\" authority such as a man or any other restrictions a women has to face.i truly loved this movie. and i also agree with the person who commented before me, i think pink would have been the perfect actress for this role. a out spoken and tough as nails, but still beautiful and talented, everything a girl should be."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mutt12",
        "review_rating": "",
        "review_title": "Leave your brain at the door for this one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "nu-arc",
        "review_rating": "10",
        "review_title": "Totally My Scene!",
        "review_detailed_main": "I loved this movie as it revolves around the idea of a CyberPunk (Punk of the Future). They have so much colour, confidence, have guts and are so much fun! I couldn't believe this movie comes from the Australian Comic Book series \"Tank Girl\". WOW!!! I just love the future as real Cyberpunks, Cybergoths and Steam punks exist! They are usually seen in the Goth clubs and love industrial, EBM, IDM, experimental, drum 'n bass (although you don't get that in goth clubs though, same as IDM. Although, we wouldn't want to live in such a serious dystopia as this is the symbolism but it's great fun to get dressed and go listen and dance to some EBM!!! Really, they are like anime characters which have sprung out of a anime comic book! It makes life so colourful and interesting!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "pitchthedevil",
        "review_rating": "",
        "review_title": "Not AS Horrible as you think.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Hezakiah4",
        "review_rating": "8",
        "review_title": "Pretty good flik",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mlle-morrison",
        "review_rating": "8",
        "review_title": "Great movie!",
        "review_detailed_main": "Not sure why so many people planned this film. It's well written, well directed, and the line delivery is spot on.\n\nAs a sci fi action flick, it delivers funny one liners, vehicle chases, fight scenes, mixed with Mad Maxesque landscape and mutants AND an AWESOME soundtrack.\n\nI can't help but feel that the angst towards this flick would be non existant had the lead character been male.\n\nTo bad! The comic book is Tank GIRL get over it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "brian_herm",
        "review_rating": "9",
        "review_title": "It is what it is...",
        "review_detailed_main": "It's a comic strip, on film, in live action. If you're expecting \"On Golden Pond\", you'll be disappointed. \"Tank Girl\" is meant to be over the top, in your face, garish, campy and fun, and succeeds admirably. Criticizing the movie for it's lack of character development is like dinging \"Forrest Gump\" for not having enough car chases. Unhook the analytical portions of your brain, get some popcorn and beer, enjoy the movie for what it is. Lori Petty makes a great cartoon character, Naomi Watts is a quiet geeky babe, Malcolm McDowell plays his standard evil crazy character. Haven't read the comics myself, I'm guessing they're a little darker than the movie (and I was really unhappy that \"Spawn\" got the Disney touch). There's a fair amount of violence, but no blood anywhere (even when someone gets sprayed with bullets at point blank range, or body parts litter the ground), and the sex is merely hinted at."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "jetgraphics",
        "review_rating": "10",
        "review_title": "Skewed and screwy, but fine!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "CityOfAngels13",
        "review_rating": "",
        "review_title": "Naomi Saved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "viliporkola",
        "review_rating": "8",
        "review_title": "If u like borderlands and fallout games... Or u are a geek...",
        "review_detailed_main": "Then this is definitely for you, this movie will be a enjoyable watch to those who like these type of games, the movie feels like a mix of them.\n\nIts a hidden gem with an average rating for no good reason. Easy to watch, engaging, yah some parts are a bit unnecessary/brainless or could had been done different, but whatever, it was still a fun movie.\n\nALOT of effort put into effects, clothing, acting, character design, sets and story.\n\n\n\n\n\n\nOverall great work still!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "quis_ego",
        "review_rating": "",
        "review_title": "Appalling.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "uscmd",
        "review_rating": "8",
        "review_title": "A little bit of everything........I loved it.",
        "review_detailed_main": "Its oscar night, when movies become fims, and oh so serious. If you're in the mood for something irreverent, hilarious, camp, with a great cast and a very solid score....a mix of animation and 'real life', I strongly encourage you give this a try.\n\nIts based on a comic book, But so much more."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "navysealcdr",
        "review_rating": "",
        "review_title": "Kinda annoying",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "shaynacao",
        "review_rating": "9",
        "review_title": "Funniest apocalypse movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "A poor affair that has enough rough charm to appeal to a small audience but is mostly a bit all over the place",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ashleyvidana-hernandez",
        "review_rating": "10",
        "review_title": "Good cult movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "romlin24",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "nicholascurey",
        "review_rating": "8",
        "review_title": "A perfectly campy comic book fever dream.",
        "review_detailed_main": "When I told my dad I had to watch this film for a course on cult media he was dumbfounded. \"What do you mean Tank Girl is cult, do you know how many things you know of today that are influenced by that film?\" I didn't believe him.\n\nOne of my favorite bands is the Gorillaz and as soon as the first panel from the comic books flashed across the screen I knew exactly what he was talking about. This film is iconic.\n\nThe plotline was generic. The post apocalyptic setting was played out. The scenes jumped around sporadically from one seemingly random shot to the next. The movie was all over the place.\n\nYet, despite all these glaring flaws from an obviously low budget film from a bygone era, there were two things that stood out to me. The diamond's in the metaphorical rough that was this film, the characters and the art.\n\nI love Manic Pixie Dream Girls and while the titular character doesn't necessarily fit the bill one to one she surely is one. She's wild and crazy and all the aspects of punk rock personified. Without her antics I feel the movie would be a snooze fest, with nothing but campy action scenes to try and wake me up. She was genuinely the highlight of the film and Lori Petty made this movie what it is.\n\nNow, as I said earlier I love the Gorillaz. I have all their albums and have been to their shows when they come to my area. I was thrilled to discover that the original Tank Girl comic book is what inspired Jamie Hewlett when designing the characters. All it takes is one glance from any of the comic book panels shown on screen to see this influence. Phenomenal find for me and I will be going and reading the original stories to learn more.\n\nOverall I dont think this movie was that great as a film, My love for this movie falls entirely into the influences on pop culture that it insipred."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "joeny",
        "review_rating": "9",
        "review_title": "cult classic",
        "review_detailed_main": "Reruns galore. Nubile naomi watts a natural brunette. Sets/costumes/make up fantastic. Humor droll. Surpasses 'howard the duck' in that genre. Forget about brandon taking us(a) down while the media sft peddles our doo/m/gloom.\n\nPop a bag of corn kernels on ur couch then live the mindless moments again."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ricardogarcia-08965",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "kimals",
        "review_rating": "10",
        "review_title": "My favorite",
        "review_detailed_main": "This is one of my fav movies. Really fun punk comic movie to watch. Tank Girl, and later Jet, kick ass and have a lot of fun doing it. Which is great to watch. And it hardly ever happens in movie world that weird chicks with non giant boobs get to fight and win. Generally girl combat is a from a male vantage point which would include a Wonder Woman physique. Naturally, the losers here are men and the good guys are actually not even men but kangaroos. Anyways, I've not know too many men to enjoy this movie. Wondering if most of the bad reviews are from men. I noticed a lot of women enjoy this movie.\n\nShould be more movies like this. Its like Ice-T says in his song featured in the movie, \" she's a venomous feminist\".\n\nBut in the most delightful way."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "ovsannasinanyan",
        "review_rating": "8",
        "review_title": "great for people who love comics!",
        "review_detailed_main": "\"Tank Girl\" is a wild, unapologetically chaotic ride that takes viewers on a journey through a post-apocalyptic world filled with quirky characters and outrageous action. Directed by Rachel Talalay and based on the cult comic series, this film is a celebration of punk rock energy, offbeat humor, and fearless individuality. Lori Petty shines as the titular Tank Girl, bringing a magnetic energy to the role that's impossible to ignore. Her performance is bold, eccentric, and endlessly entertaining, perfectly capturing the rebellious spirit of the character. Naomi Watts provides a compelling contrast as Jet Girl, a quieter but equally resourceful partner in crime. Together, their chemistry adds a layer of charm to the film's chaotic narrative. The visual style of \"Tank Girl\" is as wild as its heroine. The mix of live-action, comic-style animation, and vibrant costume design creates a unique aesthetic that feels straight out of the pages of the original comic. The film's soundtrack, featuring punk and alternative rock hits, adds to the high-energy atmosphere and keeps the pace fast and fun. While the plot can feel a bit scattered at times, the movie makes up for it with its unrelenting creativity and sheer enthusiasm. It's clear that \"Tank Girl\" isn't trying to be a conventional blockbuster-it's a celebration of individuality and a playful middle finger to the norm.\n\n\"Tank Girl\" isn't for everyone, but for fans of cult films, comics, and punk rock attitude, it's a must-see. It's a chaotic, colorful explosion of fun that refuses to take itself too seriously, making it a perfect choice for anyone looking for something truly unique and unapologetically weird."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "dheather-965-891142",
        "review_rating": "10",
        "review_title": "CHEESE at its best!!!",
        "review_detailed_main": "I adore so many of the cast members that makes up for all the utter UGH moments. This film is firmly in my Top 10 Go To Movies!!!"
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "elisabeth_head",
        "review_rating": "10",
        "review_title": "Awesome distopia",
        "review_detailed_main": "A brilliant spectacle from start to finish with a banging soundtrack. Just a shame they didn't make more. I loved the comics as well! Watch it if you haven't you may enjoy it."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "pigsflew3000",
        "review_rating": "8",
        "review_title": "Oh, this is a riot!",
        "review_detailed_main": "When I rented Tank Girl for the first time, I had pretty low expectations. Movie adaptations of comic books can be pretty bad (like Spawn, for example) or well done (like Blade). Tank Girl falls into the latter category. It is very funny, even though it sometimes tries just a little too hard. The acting is right on, and stays on throughout the whole film. There is an action scene near the end that almost ruins the atmosphere of the movie in that it makes it seem like just another unfunny action movie but luckily its short. I'd give it an 8 out of 10 because its really fun to watch but its not a master work of genius or anything. Soundtrack is good too."
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Shadow_Play",
        "review_rating": "",
        "review_title": "Whoa..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "neilthehairybassist",
        "review_rating": "",
        "review_title": "hmm......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "mrjoojoobean",
        "review_rating": "",
        "review_title": "Mixed bag",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "wishkah7",
        "review_rating": "",
        "review_title": "I tried by best to like this movie.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "bronsonskull72",
        "review_rating": "",
        "review_title": "* OUT OF FIVE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "VirgoHorizons",
        "review_rating": "",
        "review_title": "Interesting movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "there_is_no_possible_way_that_is_cheese",
        "review_rating": "",
        "review_title": "leaves a bit to be desired.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "thejayster54-1",
        "review_rating": "",
        "review_title": "Even Ed Wood would hate it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "Counterfeit",
        "review_rating": "",
        "review_title": "Wha????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "damien34",
        "review_rating": "",
        "review_title": "If you like Flash Gordon and Big Trouble In Little China...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114614",
        "movie_name": "Tank Girl",
        "movie_rating": "5.4",
        "review_username": "anothrcrazdimond",
        "review_rating": "",
        "review_title": "comic book chick kicks butt",
        "review_detailed_main": ""
    }
]