[
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "suadabeslagic1976",
        "review_rating": "5",
        "review_title": "Deeply flawed, but undeserving of 4 razzie nominations",
        "review_detailed_main": "The Karate Kid, Part III、as the title suggests, is the third film in the Karate Kid film series, released in 1989, directed by John Avlidsen, and starring Ralph Macchio as Daniel and Pat Morita as Mr. Miyagi. The Karate Kid film series is a rather typical example of other 1980s film series (such as Robocop) which just run out of steam as time goes on to the extent that they began with a bang and ended with a whimper. Despite its flaws however, The Karate Kid, Part III isn't nearly as bad as some people make it out to be and is certainly no Robocop 3. This review will discuss the problems with the movie as well as what it gets right, with an overall assessment of the Karate Kid original film series as a whole.\n\nOne of the biggest problems with this movie is the lack of continuity with the Karate Kid Part II, which for all its flaws did genuinely advance the story and develop Daniel and Miyagi's character. The film is fairly graceless in its dumping of Daniel's love interest Kumiko; it's explained that she just got a job in Japan that she couldn't turn down. This just didn't strike me as believable, perhaps because they had done it before in Part II. Daniel's relationships always happen to end between films? It's frankly insulting when sequels hit the reset button like this.\n\nBut the real continuity problem is one that is never addressed at all, and that is the relationship between Yuki and Miyagi. This is not presented as a mere superficial teenage romance, but instead as true love. Miyagi even says that he would stay in Okinawa, if not for the people trying to kill him. So why doesn't Miyagi stay in Okinawa after the conclusion of Part II, or take Yuki to America? It's never explained. This film takes a dump on Miyagi and Daniel's development; the second film may as well have never happened.\n\nMoreover, all the balance and self-control that Daniel developed in the first two films is gone, indeed Daniel if anything seems even more neurotic and unbalanced than he was at the beginning of the original film. Daniel is whiny and angsty, going into long diatribes about his own inadequacy. This would be less irksome if it were a response to something far more drastic; but in Part II the villains were trying to kill him and his master; in Part III they are just trying to take away his title as champion by defeating him in a local karate tournament. So, Daniel is cool-headed when threatened with death in a foreign land, but the prospect of losing his title to a bunch of local punks turns him into a nervous wreck? The film also fails to find a coherent theme, besides poorly retreading the original.\n\nThat said, the film does manage to get some things right. As whiny as Daniel is, he retains something of his likability, even if it is diminished. We also have the things that make the whole series fun; wonderfully over-the-top villains and pseudo-eastern wisdom. The emotional core of the film is tarnished but intact; that of the relationship between Daniel and Miyagi. These two characters, although somewhat botched, still work together well.\n\nNone of the original Karate Kid films are by themselves incoherent, but taken as a whole the series is rather lopsided. They do get progressively worse as the series goes on, and by the end of Part III one is glad they never made a fourth film (unless you count the Next Karate Kid, and I don't). Still, while it's a shame that they never managed to quite recapture the magic of the first film, I'm glad I got to spend 3 films in the company of these terrific characters."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "KHayes666",
        "review_rating": "4",
        "review_title": "The ending...ugh...the ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Mr-Fusion",
        "review_rating": "5",
        "review_title": "It's kinda like the first two movies, just without the heart and decent characters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Joel_S",
        "review_rating": "",
        "review_title": "The Karate Man Part III",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "AaronCapenBanner",
        "review_rating": "3",
        "review_title": "Too Silly.",
        "review_detailed_main": "After returning from Japan, Mr. Miyagi & Daniel(Pat Morita & Ralph Macchio again) try to settle in to their lives, only to have old foe John Creese(Martin Kove) return seeking revenge after losing his students, his school, and his money. He turns to grateful Vietnam veteran buddy Terry Silver(Thomas Ian Griffith) to help him regain what he lost, and punish Miyagi and Daniel.\n\nA great pity this is such a comic book level script, with over-the-top villainy(at one point, both Creese and Silver laugh at Miyagi & Daniel like they're the Joker and Riddler!) and redundant character development(Did Daniel learn nothing from the first two films?) Only Pat Morita keeps this disappointment from complete ruin, with his fine performance(he looks appropriately weary of it all!) Ending is predictable, but too abrupt, leaving loose ends never tied up."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "grahamyounie",
        "review_rating": "7",
        "review_title": "Not nearly as bad as it's reputation would suggest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "write_the_wrong",
        "review_rating": "5",
        "review_title": "So bad that it's good?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "LuckyFour-LeafClover",
        "review_rating": "6",
        "review_title": "Cobra Kai 4",
        "review_detailed_main": "I'm guessing like a lot of Cobra Kai fans, I re-watched this movie for the first time in years recently. In Cobra Kai 4 Terry Silver returned and talked about how over the top the them of this movie was. Ralph Macchio has pretty much said the same in real life.\n\nDaniel goes from a confident fighter to an insecure and winy one. The plot is ridiculous as well: a billionaire who puts his life on hold to terrorize a teenager.\n\nNontheless Thomas Griffith was very good as Terry Silver the evil villain. It does still have some touching moments with Mr. Miyagi and Daniel. It's the last time the two are on screen together.\n\nUltimately its a ridiculous movie but not without its charms. Cobra Kai 4 did well to incorporate it unto today."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "tired repeat and silly villains",
        "review_detailed_main": "Disgraced karate teacher John Kreese loses his students and his dojo. He finds help from his Vetnam war buddy Terry Silver who is a wealthy toxic waste disposal businessman. Daniel LaRusso (Ralph Macchio) and Mr. Miyagi (Pat Morita) return from Okinawa to find their apartment being demolished. Daniel uses his college fund to buy Miyagi a bonsai tree workshop. Jessica Andrews (Robyn Lively) makes pottery across the street. Terry Silver buys properties for Kreese to restart his dojo. Miyagi won't let Daniel defend his title. Terry recruits thugs to force Daniel to enter the tournament. Miyagi won't train him and Terry tricks him into being his student. Terry teaches him all the wrong techniques.\n\nThe major problem is that this repeats the original and even ends with the same tournament. There are also a few minor annoyances. I doubt the cops would ignore the vandalism and the beatings. There has to be a more devious way to force Daniel into the tournament. Those young thugs are cheesy villains but Thomas Ian Griffith is infinitely worst. I love Martin Kove but his character mostly gets sidelined. The most disappointing is Daniel himself. After all these years, he has not grown much. The third film should have Daniel be a big brother to someone else. It's an obvious way for the franchise to continue but they decide to do a repeat."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jcrawley-00891",
        "review_rating": "7",
        "review_title": "better than it's rating",
        "review_detailed_main": "This movie is pretty much the same as the other two, quite predictable but still enjoyable. it's easy watching great to watch anytime"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "BatStarIndyFreak",
        "review_rating": "3",
        "review_title": "Lousy Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Khaled Yafi-01",
        "review_rating": "9",
        "review_title": "Dear God, Please Rid Us Of Daniel!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "Not that bad, but it is nothing brilliant either",
        "review_detailed_main": "Having enjoyed the first two films, I wanted to see this film too. While not particularly brilliant, I do think it is better than people make it out to be. The script is weak, the plot predictable and the villains unbelievable with somewhat unrealistic motives. However, it did move fairly briskly, had some neat direction, it looked good, the karate sequences were efficient and well choreographed, the ending was decent and there is some nice messaging. I have liked the character of Miyagi as well, he strikes me as wise and caring, the sort of character I like. The acting also was not too bad, Ralph Macchio once again is appealing while Pat Morita, who is always watchable, gives another solid performance. Overall, it was decent, while nothing exceptional. 6/10 Bethany Cox"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Agent10",
        "review_rating": "5",
        "review_title": "A bit vacuous",
        "review_detailed_main": "While this film went back to the more casual appeal of the first film, it proved to be a bit of a rehashing of the first. The only difference, we see Daniel take on the `dark side' (a.k.a. not Mr. Myagi's way) of fighting. Sure, this had to be a little different, but Daniel trying to be a tough guy seemed a little off in a way. Sure, this film was entertaining, but it proved the series was running on empty. However, Mr. Myagi proved he could still kick plenty of butt, making the ending all worth it."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bayou_hannibal",
        "review_rating": "",
        "review_title": "Unintentionally hilarious – does it deserve a 1, or a 10?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "TOMASBBloodhound",
        "review_rating": "4",
        "review_title": "I had forgotten just how bad it really was!",
        "review_detailed_main": "And yes, I have seen much worse in terms of films. But considering what a classic the original was... to arrive at this point is pretty sobering for a kid who was truly inspired by a great film in 1984. And part 2 was pretty good also, but mostly for the exotic location and convincing villain. But this 1989 disaster is saddening for two basic reasons. First of all, it has a ridiculous plot. And worst of all, it was obviously made for $$$ purposes only. All the inspiration was gone by this point, and this is painfully obvious in nearly every lame scene.\n\nFirst off, the film is oblivious to the concept of the passage of time. Five years had passed since the original film, yet the film would have us believe that it picks up the moment Daniel and Mr. Miyagi step off the plane from Okinawa. By 1989, Ralph Macchio was almost 30 years old, and he had gained significant weight since part 2 was released in 1986. And above all else, it just isn't natural that all of the things we've seen since the original could happen to one person in the span of only a year. The film doesn't even try to hide the changes in clothing and hairstyles. I was actually surprised I didn't see a bolo tie on any of the band members at that dance. Virtually every soft rock musician wore them back in the late 1980s. Anyway, the film is full of cheese, but there are some reminders of how good the series had been. And even some nice new things, too.\n\nThere are some good things in this film. Frankly, I think actor Thomas Ian Griffith walks away with this picture. He overplays his Terry Silver character to immense proportions, and he looks like he's having fun. The man never became the star he probably should have. Wouldn't he have made a better action star than the wooden Seagal? I think so. Anyway, it's fun to see him put Daniel through all the pain while training him for his title defense. Pat Morita is great as always with his humor and wisdom. He was the one constant in this series, and he was always on his game. The film also scores points for exploring a big rift that forms between Miyagi and Daniel. There are some scenes where the old man looks absolutely crushed that Daniel won't listen to him any more.\n\nBut there are more problems here, folks...... lots more. Simply put, the plot is so laughable that anyone over perhaps age 8 could have written the original treatment of the script. The thought of a millionaire toxic waste dumper tormenting a teenager to somehow win back the honor of the evil karate master from part one. Just laughable! How about the new tournament rule allowing the returning champ to only fight in the final match?? Huh?? That would be like allowing the Kansas Jayhawks to only play in the last game of March Madness this year while their opponent would have had to win 5 games in the tournament just to get to the game. Ludicrous! The dialog is so over-the-top, so amateurish that I cannot imagine how these actors got some of the words out of their mouths. Acting from many of the supporting characters is unconvincing to say the least. Robin Lively has no chemistry with Machio, but I guess they were just supposed to be friends. It wouldn't surprise me if they decided to just make them \"friends\" on the set when they realized how much older he is than her in real life. The actor playing Mike Barnes had some good moves, but no thespian talent to speak of. Oh well, the remake with Jackie Chan and Will Smith's kid is bound to be worse, though! 4 of 10 stars.\n\nThe Hound."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jaudon29",
        "review_rating": "7",
        "review_title": "Now the real pain begins, Danny-Boy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "gfnoyes",
        "review_rating": "3",
        "review_title": "worst one of the 3 in my opinion - possible spoiler",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "ant_zzy",
        "review_rating": "6",
        "review_title": "Good Movie, a little boring in the middle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "MaxBorg89",
        "review_rating": "5",
        "review_title": "Part III? What for?",
        "review_detailed_main": "Rumor has it Tom Cruise was offered the chance to reprise his signature '80s role in two (!) Top Gun sequels, but refused because he didn't want to do the same thing over and over. He has a point: some films, like Star Wars or Indiana Jones (even Rocky or Rambo, to a reasonable extent), can and in fact deserve to have follow-ups, because the people who made them genuinely think there is more to tell about those characters (Rocky V is too much, though); others, like Top Gun or The Karate Kid, are crippled from the beginning by the fact that they are indelibly connected to the decade that spawned them, and also suffer from having fairly basic scripts and characters that wouldn't really benefit from any continuation of the story. Sadly, Ralph Macchio never realized this, and so here we are: The Karate Kid, Part III.\n\nWhereas the first film dealt with a recycled subject (young boy gets revenge on those who humiliated him) from a new angle, Part III resurrects the revenge theme with all its clichés. The \"driving force\" (assuming there is one) of the screenplay (if you can call it that) is John Kreese (Martin Kove), the sadistic karate teacher whose students got their asses kicked by Daniel Larusso (Macchio). Broke and lonely, Kreese decides to ask an old army buddy, Terry Silver (Thomas Ian Griffith), to help carry out a diabolical plan that will make Daniel and Mr. Miyagi (Pat Morita) suffer like never before. Getting them to fight back, however, will prove harder than usual, as Miyagi is more interested in opening a bonsai shop and Daniel refuses to act violently since he is - what a surprise, this - in love.\n\nLove, vengeance, honor, blood and gratuitous butt-kicking are all thrown in the mix, though hardly any of them work to full effect. As a matter of fact, the more explicit violence suffocates the franchise's trademark comedy bits, leaving a few underwhelming Daniel/Miyagi moments with the duty of lightening the tone. Even worse, though, is the over-the-top behavior of the villains: Griffith does nothing but stare manically, shout and laugh, while Kove, who was funny in the first installment of the series, transforms Kreese into a grotesque parody of his earlier work. Only when the dead-certain final battle arrives, there is a sense of the trilogy regaining whatever it lost from Part II onwards. But the question remains: how many people will still be paying attention at that point?"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "robyn-710-767167",
        "review_rating": "6",
        "review_title": "Not as impressive as the first two",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "richspenc",
        "review_rating": "4",
        "review_title": "Almost accidentally funny, but worst of three Karate Kid's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "surrydaniel",
        "review_rating": "10",
        "review_title": "Hilarious. I think my stomach is still sore.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "aimb",
        "review_rating": "7",
        "review_title": "Why did they bring Daniel without a backbone?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Laner",
        "review_rating": "4",
        "review_title": "Horrible, terrible conclusion to the trilogy.",
        "review_detailed_main": "Ya just gotta ask, \"What were they thinking?\" The first movie was a classic - a genuine piece of pop culture, and a great \"underdog\" movie. While the second wasn't as good, it was still a decent movie which expanded on the story of Daniel & Mr. Miyagi. But this one stunk up the joint... first off the new bad guy Terry Silver (the millionaire mogul/karate expert) is laughable as a villain - his performance is *so* over the top it's ridiculous. It's obvious they got someone who knew his karate, but didn't know jack about acting. It's also ironic that he's actually younger than Ralph Macchio\n\nRobyn Lively - she's attractive enough, but belongs in sitcoms. Also, what's with Daniel *never* getting the girl in the long term???\n\nAs for Macchio - I don't know... he seemed to be *way* too enthusiastic. Was he this much of a motormouth in the first two movies? It's almost as if he was trying too hard to compensate for the fact that he is five years older, trying to portray a character that is only one year older.\n\nThe pacing of this movie is all wrong. They spend way too much time on trivialities such as the Macchio/Lively relationship. What was the point of that anyway? There was hardly any time spent on the training and actual fight (and as any fan of the Rocky movies could tell you, that's the most important part!)\n\nAs for the karate itself, it's L A M E. The Karate Kid series has always been more about the philosophy behind martial arts rather than the physical aspect. All of Mr. Miyagi's wise platitudes are dead-on, but the \"crane technique\" would be easily countered by any half-competent black belt. Even so, it worked in the first two flicks. But in this one, it's just ridiculous. The final fight, the \"bad boy of karate\" is whipping Daniel like a government mule, then in sudden death Daniel decides to break into his \"Secret Miyagi family kata\", which causes both his opponent and his partners to suddenly back away in fear! This is so absolutely ridiculous it's pathetic. Once again, any competent karate student would simply look at Daniel with a bit of confusion, then continue on with the business of kicking his butt. It just seemed all too anti-climactic.\n\nI'm really surprised they made a fourth movie after this stinker, but at least it gave us our first look at Hillary Swank. Yum :)"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bractune",
        "review_rating": "",
        "review_title": "A truly funny movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "sleazydinosaur",
        "review_rating": "1",
        "review_title": "So bad its good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Kingslaay",
        "review_rating": "7",
        "review_title": "A decent film in the Karate Kid franchise",
        "review_detailed_main": "I watched this film on Netflix after the teaser trailer for S4 Cobra Kai dropped and I'm glad I did. Terry Silver proves to be a decent two faced villain and ally to Kreese to settle an old score. The third installment nicely flows from the first two movies and mainly follows on from the first. It's tournament time again and I like how Daniel had to do a bit of soul searching. I also like that there was no weak romantic storyline to bring the film down, instead it was a nice platonic one and stayed that way. If you look over the cops conveniently not caring and Daniel being such an easy target this is not a bad film. A good installment in the 80s."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "hnt_dnl",
        "review_rating": "1",
        "review_title": "Awful film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "vailsy",
        "review_rating": "6",
        "review_title": "slightly better than I remember",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "broadfoot",
        "review_rating": "1",
        "review_title": "Should Have Stopped at Part II",
        "review_detailed_main": "When you look at the acting in this movie, it makes you realize that the first two movies were probably much better acted. Everyone in this movie, including Pat Morita, just ham it up. The worst offender has to be Thomas Ian Griffith, who plays Terry Silver. It looks like he and the actors playing the bad guys took acting lessons from Eric Freeman's performance in SILENT NIGHT, DEADLY NIGHT PART II. Eric won that role on account of his good looks, not his acting talent. I think it must have been the same situation regarding Ian Griffith.\n\nNext time you take karate lessons, use copies of the DVD to do your hand-breaking exercises."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "alkisphilon-12-257195",
        "review_rating": "7",
        "review_title": "Enjyoable movie",
        "review_detailed_main": "This definitely doesn't deserve such a low rating. Can it be compared to the first Karate Kid? No. But it has a good story, solid directing (of course...mr Avildsen) and nice characters. Surely it could go in a different direction, be more mature etc. But this movie is fun. Ralph and Pat are great as always."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jason-529",
        "review_rating": "4",
        "review_title": "Where was the movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "angcal-31871",
        "review_rating": "10",
        "review_title": "KKid III",
        "review_detailed_main": "Fantastic. I could watch it over and over again.... oh wait..... I did."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "vengeance20",
        "review_rating": "7",
        "review_title": "Not A Bad Conclusion!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "ThreeThumbsUp",
        "review_rating": "2",
        "review_title": "A HUGE step back",
        "review_detailed_main": "I enjoyed watching Daniel-son progressively develop his karate skills in KK1 and KK2, but then came the third installment of the trilogy.\n\nAfter defeating a pair of formidable opponents in the climax of the first two films, somehow Danny boy transforms back into a complete wimp, relying on a a questionable rule and fluky technique to defend his title at the All-Valley Karate Championships.\n\nSince he won last year's tournament, the suddenly weak Daniel is allowed a free pass to the championship bout without having to engage in a single fight. After getting thoroughly dominated in the match, Barnes, LaRusso's opponent and Kreese's hired hand, decides to toy with Danny and execute a rather cheap move, allowing for the score to get knotted up. But instead of standing up to Barnes like a true warrior, Daniel falls back and implements a technique called kata, which calls for short, choppy air punches and deep breathing, almost like meditation. Confused, Barnes charges and Daniel lands a frail, but victorious blow.\n\nNeedless to say, it was a profoundly disappointing to witness Daniel – the same guy that stood toe-to-toe with each of the Cobra Kais and kicked the crap out of the Chozen in a death match – regress so greatly."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "roh3220",
        "review_rating": "",
        "review_title": "BETTER THAN PART 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dfw_txs",
        "review_rating": "1",
        "review_title": "Just Terrible",
        "review_detailed_main": "I was going through my DVD collection and came across the Karate Kid Trilogy. It was right after Pat Morita died and I began looking over the DVD case and I remembered I had never watched the Karate Kid Part III.\n\nI was a huge fan of the original Karate Kid, and part II was a worthy sequel. I was bored that night and figured I'd give part III a try, even though I knew it would probably not be very good as most \"part IIIs\" of any movie typically pretty bad.\n\nI can honestly say, The Karate Kid Part III, is the worst movie I have ever seen - its a shameless rip off of the original. I wont go through a plot summary since that has already been done by several other reviewers here. But some of the low points are worth mentioning.\n\n1) Acting is terrible. Ralph Macchio either forgot how to act, or simply mailed it in, which is likely the case as who could get excited over this script? It was simply ridiculous to have a 28 year old man play a 17 year old teenager. Pat Morita's role was tired and predictable, and just worn out. Martin Kove, aka John Kreese, looked like a puppet with that goofy \"evil smile\" he had plastered on his face the whole movie.\n\n2) The plot was recycled from the first Karate Kid. You know the storyline: Daniel gets beat up by a superior Karate student trained by the evil John Kreese and sidekick Terry Silver. Mr Miyagi saves the day yet again with his unorthodox teachings, all culminating in a dramatic tournament at the end where Daniel surprises his opponent with some Karate move that looks more like a dance scene. Crowd goes nuts, evil John Kreese foiled yet again, My Miyagi smiling proudly, blah, blah, blah.\n\n3) The last fight scene. The only reason I did not turn this \"movie\" off half way through was because I figured at least we'd have a great fight scene at the tournament. Some type of payoff for having to suffer through this catastrophe. The fight scene was an unmitigated joke. The whole fight is Daniel getting his face beat in. Then, the very last scene when his evil adversary is going to win the title, Daniel does this gimmicky dance move and punches the guy in the stomach. Oh Boy!\n\nFirst, an 80 year old man could have defended such a lame move. And second, all the movie gave you was Daniel getting lucky at the end. I mean, the whole movie he is pulverized, and the very last scene he gets a lucky sucker punch in, wins the tournament and all is well.\n\nYou have been warned. Stay away from this mindless garbage."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "ma-cortes",
        "review_rating": "6",
        "review_title": "Final episode of the enjoyable trilogy with the lovely duo taking on violent bad guys",
        "review_detailed_main": "This third installment in the Karate Kid series begins moments after the conclusion of the second movie . This is an entertaining and heartwarming martial arts movie in which appears the intimate Ralph Macchio but the show belongs to Noriyuki , Pat Morita . First it was teacher to student. Then it was father to son. Now, it's man to man. The story deals with the troublesome young boy named Daniel , after vanquishing the Cobra Kais, and Miyagi humiliating their Sensei , Kreese (Martin Kove) and then all his pupils desert him . Kreese decides to close the Dojo , he then tells to his partner , Terry (Thomas Ian Griffith) , who is also the Dojo's proprietary , to turn in the keys , and announces that he is leaving city . Terry decides to send him on holiday , and while he's away , he'll get his particular vendetta on Daniel ( Ralph Macchio) and Miyagi (Pat Morita) . As the bad guy from KK1 attempts to gain revenge on Daniel and Miyagi, with the aid of an old army buddy . Part of his scheme is to recruit a violent karate fighter named Mike Barnes (Sean Kanan) , to contend Daniel in the championship but Miyagi thinks that it's not a priority . Again Daniel aware that Kung Fu is his salvation, as he fights an evil nemesis , facing down a deadly contender trained by an expert Karate man . Meanwhile , Daniel makes a new enemy and a new love , the latter named Jessica (is quite well performed by newcomer Robyn Lively). Then Mike terrorizes Daniel and his girlfriend and he faces an old rival .\n\nThis enjoyable third entry , a sort of junior version of 'Rocky', develops one more time a sincere and deep friendship among two protagonists , the rockie young boy and the wise old man . Using more than his fists , Daniel/Ralph Macchio learns about himself and the sense of life . As Miyagi/Morita , the great master of martial arts , teaches him that Kung Fu is not about punches and parries , but maturity and calm . Agreeable and likable acting by two main actors, Ralph Macchio and Pat Morita , accompanied by newcomer Robyn Lively along with the ordinary plethora of nasties this time played by Thomas Ian Griffith , Martin Kove , Sean Kanan , among others . The picture contains adequate cinematography by Yaconelli and long-standing score by Bill Conti , including usual leitmotif . This feel-good message picture is professionally directed by John G. Avildsen .\n\nThe two previous films, all produced by Jerry Weintraub , written by Robert Kamen and directed by John G Avildsen , are the following : original Karate Kid I (1984) in which are presented the classic characters and including Elizabeth Shue , Karate Kid II(1986) where the protagonists travel to Okinawa with Tamlyn Tomita , and subsequently ¨The new Karate Kid¨ by Christopher Cain with Hilary Swank and again Pat Morita . And recent version ¨Kung Fu kid¨ (2010) by Harald Zwart , it results to be a good remake starred by Jackie Chan , Jaden Smith and Taraji P Henson . Rating Karate Kid III : Acceptable and passable following , worthwhile seeing . This heartwarming and sure-fire crowd pleaser picture will appeal to Karate Kid trilogy fans."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Jake-60",
        "review_rating": "1",
        "review_title": "Absolutely No Redeeming Features.",
        "review_detailed_main": "The Karate Kid was one of my favourite movies. It was a fairy tale. Boy fights the bad guys with the help of a mysterious and wise teacher, overcomes the odds and gets the girl. Enough humour, action and feel good vibes to keep anyone smiling. But somehow....they lost the plot in the second sequel. \"The Karate Kid III\" is one of the lamest kids films I have ever seen. Ralph Macchio, who was only mildly annoying in part one shows he hasn't really learnt anything, despite looking like the only Forty year old teenager in California. I wanted him to get his head bashed in, if only to stop his whining. The bad guys dress in black (of course), and go Bwa-Ha-HA! a lot. They just need capes, top hats and long moustaches to fill out there characters. They certainly don't fill them out by acting. And the Climbing scenes!!!! Girl takes Ralphie rappelling down a cliff with no training and no safety rope, then they get back up by climbing hand over hand, which is frankly impossible for anyone lacking superhuman strength, and totally unsafe. What passes for plot is about Daniel-san not wanting to quit while he is ahead. Maybe the director should have taken the hint."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "fmarkland32",
        "review_rating": "7",
        "review_title": "For my money the best of the series...",
        "review_detailed_main": "This time Daniel LaRusso (Ralph Macchio) goes up against Karate's bad boy Mike Barnes (Sean Kanan) to defend his title and prove that karate is not to be used aggressively and repair what damage he did to Mr. Myiagi(Pat Morita) who refused to train Daniel due to the antics led by John Kreese (Martin Kove) and Terry Silver(Thomas Ian Griffith) Will Daniel regain his title or will Barnes clean the floor with him. People of taste in movies are often surprised as I label this as the best Karate Kid movie. \"But it had banzai trees!\" said my cousins in 1989 when I walked out of theaters and said \"Finally a good movie!\" Most people in the theaters as well as everyone in general were shocked that I could stand alone and praise this as the best of the series but for my money this is the best entry. Why? Because it is the greatest camp-fest of 1989.(Seriously Cyborg and Road House made more sense.) For starters we have Ralph Macchio looking in his late 20s playing a \"kid\" we have bad guys who for some reason throw their head back and laugh for no reason. I also want to acknowledge that Thomas Ian Griffith is great in this movie. His laughing at in which he gets the not too bright Daniel LaRusso to kick two by fours as well as punching solid wooden boards is ultimately great to watch. I also loved how Pat Morita refused to train Macchio for no reason, as if Daniel was supposed to drown rather than except the challenge posed by \"Karate's Bad Boy\" I also love how Macchio never seems to get the girl. (Come on even Sasha Mitchell finally had a wife in Kickboxer 4!) So the sheer homoeroticism between Morita and Macchio make this far more interesting than the hideously boring predecessor. (#2) After all the bickering between the two is non-stop. The Karate Kid III in all seriousness actually takes it's formula and provides more action and pumps up the villains to full effect and really it is this reason why I balk at the notion that this isn't the best movie of the series. In fact I think it makes required viewing for camp addicts, action fans and anyone else game for some fun cheese. Also watch for the final fight sequence which could quite possibly be the most one sided battle ever. Also it is worth watching just for the scene in which Daniel asks \"What do we do if they come back?\" to which a not even phased Myiagi says \"Sing happy song!\"\n\n* * * out of 4-(Good)\n\nP.S:Seriously check it out. It is made with enough craftsmanship that you can respect it but so blissfully stupid you just love it."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "littleriver95456",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever seen!",
        "review_detailed_main": "This movie is just awful! The story is tired and totally predictable, and the Ralph Maccio character is incredibly annoying! The ONLY reason I watched this movie was to see the parts filmed on the Northern California coast, near Kris Kristofferson's ranch in Elk. The scenery is just stunning, but only about 15 minutes of the film takes place there. Maccio's annoyingly juvenile babbling is at complete odds with the serenity of this beautiful and breathtaking Northern California setting, as it is with the teachings that the late Pat Morita tries in vain to impart to the kid for the third time in this series! Pat Morita is always a pleasure to watch, but everything else about this movie is just excruciatingly annoying and painful to watch."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Polotovar",
        "review_rating": "7",
        "review_title": "Bomb again",
        "review_detailed_main": "For me, again, the bomb. After a minor disappointment in the form of the second one, the third one surprised me more than pleasantly. Okinawa is gone now and so at the same time boredom disappeared for me. I liked the story very much. This time it shows the dark side of Cobra Kai even more. Compared to the second one, where I thought it was really unnecessary, here I devoured almost every moment and especially the finale was again grandiose and for me a nice ending to the trilogy. The only thing that bothered me in places was the cinematography. Some scenes seemed a bit overexposed to me. Maybe it was just my imagination. I don't know. To sum it up. It's still not quite up to number one, but it beats number two for me. This is purely my opinion. I really liked number three. I thought it was a little darker, and I like that. I think it's a good film, and I recommend it to fans of the series."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "averjee",
        "review_rating": "2",
        "review_title": "Tired retread of a good film",
        "review_detailed_main": "This is a walking zombie, brain-dead movie. It pretty much ignores the action in Part II, and plucks up the villains and locations of Part I.\n\nIf Part I was a knock-off of ROCKY, then this is sort of a knock-off of ROCKY II, but with less heart. John Kreese, the villain from the original whose philosophy was \"Mercy is for the Weak,\" is back, and wants to get even with our heroes. So he solicits the aid of business tycoon and martial-arts expert (Thomas Ian Griffith) - unfortunately, the new villain is a silly, shallow, cartoonish caricature - he pollutes, he's corrupt, he's a rich white guy, he laughs diabolically every few minutes, so you KNOW he's evil.\n\nGone is the sweet, father-son, vaguely homoerotic relationship between Daniel and Mr. Miyagi. Now the byplay is forced and predictable, and it revolves around bonsai trees - I guess they went for the most boring subject they could find.\n\nThere's another tournament, there's more bad people doing things to make Daniel breach his vow of non-violence, and there's another predictable climax. Have fun."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Hayden-86055",
        "review_rating": "8",
        "review_title": "So ridiculous, so much fun, so underrated",
        "review_detailed_main": "The Karate Kid part 3 is one of the most outlandish sequels ever, especially in comparison to the first two Karate Kid films. However, I've always highly enjoyed this film and the amount of disregard it gets is unjustified in my eyes.\n\nActing wise it's as good as ever Ralph Macchio is still spot on as Daniel, Pat Morita is better than ever as Mr Miyagi and Martin Kove is back as Kreese. You've also got newcomer Thomas Ian Griffith as Terry Silver, the craziest and most stupendous villain in any Karate Kid film, Terry Silver is highly unpredictable and completely off his nut, a millionaire who's main goal in the film is to go after Daniel and bully him into entering the all valley tournament (again) so new \"bad boy\" Mike Barnes can humiliate him in front of his town. It's a bonkers plot, but it completely works! Similar to the original Daniel finds himself a girlfriend, Jessica played by Robyn Lively; although this time she's not interested in him romantically.\n\nThe plot's quite good and is most similar to the original with many new plot points such as Daniel and Mr Miyagi opening up a bonsai tree shop instead of Daniel going to college and, most intriguingly is when Daniel chooses the super violent and very handsome Terry Silver to be his teacher over Mr Miyagi putting strain on their relationship, and also his body as Terry seems obsessed with sadistically pushing Daniel to the limit training wise, Silver is really a psychopathic character. The music is also of very high quality and is just as good as the 1984 original, if not better with Bill Conti again taking the reigns as composer.\n\n8/10: Extremely entertaining and no where near as bad as some reviewers make it out to be"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bkoganbing",
        "review_rating": "6",
        "review_title": "Plot for revenge",
        "review_detailed_main": "While Pat Morita and Ralph Macchio have been over in Okinawa, there old enemy Martin Kove has been plotting his revenge. However Kove believes as did the Bard that 'revenge is a dish best served cold',\n\nKove hasn't forgotten the humiliation that Macchio dealt his dojo or how Morita publicly humiliated him after the karate tournament. He's got an elaborate plan to ruin both of them.\n\nThere was a bit more plot to this final Karate Kid story. still it keeps up to the standard of the first two. Macchio and Morita as in the first two have some wonderful scenes together. You can almost hear the Facts Of Life theme playing in the background.\n\nTwo other cast members of note are Thomas Ian Griffith a friend of Kove's from Vietnam and Sean Kanan, a karate killer Kove is training.\n\nKarate Kid III as with the other two solid family entertainment."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Captain_Couth",
        "review_rating": "2",
        "review_title": "Revenge of the 80's: The Karate Kid, Part III",
        "review_detailed_main": "The Karate Kid, Part Three (1989). Well, well, well. The clock has struck twelve on this franchise. The series has finally ran out of gas and the cash cow is gone. Thankfully the last film of the trilogy has arrived.\n\nThe Karate \"Kid\" has to defend his title. Even though this takes place a year after the first movie, \"Young\" Danny has aged tremendously. He has a dilemma, defend his karate title or go to school. Everything seems to go along mundanely until an old nemesis comes back to haunt Danny.\n\nThe series has been ran into the ground and every single story line has been used. This is the worst of the series. Everyone looks tired or bored and they all go through the motions.\n\nRecommended for die hards fans only."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Old Joe",
        "review_rating": "",
        "review_title": "Karate Kid back for a third time, in a movie about revenge, independence and inner strength!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "act3scene1",
        "review_rating": "3",
        "review_title": "not very good, was it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "MikeK-7",
        "review_rating": "7",
        "review_title": "Real garbage...",
        "review_detailed_main": "The first one was great, the second one even did pretty well for a sequel, and third installment is the absolute worst. This time around, Daniel \"son\" (get a new kid, Daniel is now an adult) is being forced to fight a vicious opponent. His girlfriend Robin Lively, should have gotten a Rasberry Award for worst actress. What happened to Elisabeth Shue? When you see this, not only will you lose respect for Daniel, you'll actually want the bad guys to win. Even the fourth one was better than this.\n\nUGGGHHHH!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Andrew-143",
        "review_rating": "2",
        "review_title": "Why So Scared??",
        "review_detailed_main": "I consider this entry the weakest of the first three KK movies. It had it's moments, but it lost me with one irritating detail. Why was Daniel so darn scared to fight the new bully? Heck, he just fought for his LIFE in Okinawa! You'd think he would just be laughing in the face of the zipper-headed 'wonder boy' of karate....\n\nAlso, Daniel sure whined a lot during this entry..."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "insomniac_rod",
        "review_rating": "7",
        "review_title": "The MTV sequel.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "benjamin_380xd",
        "review_rating": "1",
        "review_title": "Lame attempt to cash in on the franchise",
        "review_detailed_main": "This movie reminds me of the cute puppy that we all fall in love with only it grows up and loses some of its \"cuteness\". That, in essence, is the KK part 3. Actually, the title itself is way off base here. Daniel-san is no longer just a kid, but here we have Ralph Macchio playing it just like he did in 1984! A better name could be perhaps the Karate Kid Wannabe, circa 1989. At any rate, the viewer is treated to clichés, plot lapses, and a simplistic script that wastes the talents of the actors. One would assume that since Daniel-san idolizes Myagi that Daniel-san would remember the old sage's advice and not turn to the so called \"dark side\" of Karate. As such, we see Daniel sucked into the dark side, all to easily it seems, and that makes me question Daniel-san's true roots and commitment to Myagi. Of course, without this character flaw, there would be no movie and that is just as well. Still, the character of Terry Silver provides some interesting moments. The final match, All valley under 18, (ahem!) is weak, obtuse, and overwrought with emotion. Naturally, Daniel-san has to win to give some thread of legitimacy to the plot but a neat twist would have him lose then spend at least 15 minutes of movie time figuring out why he lost, then set up a rematch for KK part 4 \"the new beginning\" or something like that. The franchise did just fine with the first two. They were fresh, unique, and realistic. The third was an obvious attempt to cash in and it shows from the storyline all the way to the anti-climatic ending."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "aefrench",
        "review_rating": "7",
        "review_title": "Not bad, but it's the weakest of the three",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Willie-12",
        "review_rating": "4",
        "review_title": "So Many Problems",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "liamsouthall-39252",
        "review_rating": "8",
        "review_title": "Good finish",
        "review_detailed_main": "Loved the karate kid trilogy. Now I can get the misses watching Cobra Kai on Netflix"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mdcowboy",
        "review_rating": "7",
        "review_title": "Mixed feelings... It's fun though.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Weak reprisal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "armen1000",
        "review_rating": "",
        "review_title": "First he suffers!....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "tagkeyon",
        "review_rating": "4",
        "review_title": "Big letdown -spoilers",
        "review_detailed_main": "Well, they really should have either left a good thing alone with Part 2, which I still consider to be the best of the trilogy, or brought Tamylin Tomita back so we could have watched her obviously predestined relationship with Daniel continue. This was my biggest gripe about this film. Daniel's \"romantic interest\" in this film isn't a romantic interest and quite honestly I don't even understand why she's there. Komiko would have been been excellent in this and also provided an added injection of emotion (conflict/possible separation) that was absent. Daniel's girl leaves before the final fight and we don't give a rat's arse. Also I find it annoying, as other posters have pointed out that Daniel manages to beat the life out of Chosen (an old school Karate master) in part 2 but can't seem to even fluster a token \"tournament fighter\" from the States. This film could've been legendary but instead just leaves us with a bad taste in our mouths. And yes, it looks liife Ralph has been hitting the Jack in the Box pretty regularly as he's obviouly packed on a few pounds. Maybe thats why Daniel seems to be off his game?"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mikeiskorn",
        "review_rating": "7",
        "review_title": "Not As Bad As People Say!",
        "review_detailed_main": "I actually really liked the idea behind this movie and as for some other reviewers saying it's unintentionally hysterically funny, it wasn't. It was just a late in the game 80s film. The only weird thing I found was Daniel's strange sense of being on coke and charged up in some scenes when it was totally unnecessary. Perhaps that's where people found the humour though."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dogger3333",
        "review_rating": "1",
        "review_title": "Horrible horrible horrible",
        "review_detailed_main": "What an awful movie. The plot is lackluster at best. Ralph Macchio also over-acted in too many scenes. The two main protagonists, especially the character Terry, provide two of the worst acting attempts ever filmed. Terry was just awful in every way\n\nThe movie is of course predictable as it goes along until it's ending with nothing that's too unexpected\n\nWhat a disappointment this movie was"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "DogePelis2015",
        "review_rating": "6",
        "review_title": "A good karate trilogy",
        "review_detailed_main": "This movie is decent and that's enough to entertain; the plot is acceptable and the fights are good; it is a good way to conclude the trilogy."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "ricsim78",
        "review_rating": "4",
        "review_title": "Fairly horrible sequel!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "aleg777",
        "review_rating": "6",
        "review_title": "Worth watching in 2020 if you dont compare it to the first one",
        "review_detailed_main": "Ok, I did a mistake of reading the reviews before watching it and was expecting a truly horrible movie. But decided to do it anyways mainly because of Mr. Miyagi :) I actually had a pretty good time watching it, there is definitely a group of people who will find part 3 enjoyable.\n\nIf you are inclined to a belief system where finding inner peace and faith in the first place can be more beneficial than ANY action taken in the state of fear, confusion, panic, or necessity to prove something to someone else, you might end up genuinely enjoying this movie. It has a familiar taste from the previous ones if that's what you are looking for. It has exactly the same values repeated again and again, but especially in today's world we need those values! The evil is as always almost too evil to believe in and exaggerated, Mr. Miyagi is as always wise, witty, unconditionally peaceful and a treat for the soar soul... Watching it in 2020 I personally was left with a very comforting feeling in the end of it all. Obviously don't expect it to be as good as the first one, but I know some people who liked the third part even better than the second, so it all depends, give it a try!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "view_and_review",
        "review_rating": "1",
        "review_title": "Nah I'ma Leave",
        "review_detailed_main": "I think it was the comedian Mitch Hedberg who did a joke about visiting peoples' homes and them requiring him to take of his shoes and saying \"namaste.\" He said, \"Nah I'ma leave.\" That was my response to this movie about halfway through.\n\nThe movie starts with a recap of the first \"Karate Kid.\" It was to remind the viewer of the character John Kreese (Martin Kove). He fell on hard times after his defeat in the tournament. He lost all his students and became penniless.\n\nAfter seeing a ruined Kreese we were introduced to his evil wealthy friend who owned the dojo Kreese operated out of. Evil friend vowed to get revenge for him. This rich guy was a caricature. He did everything but laugh while twisting the edges of his handlebar mustache. He was your stereotypical unscrupulous rich boy. He illegally dumped toxic waste all over the world, paid off prosecutors, and now he has this hard on about making Daniel and Mr. Miyagi (Pat Morita) suffer for humiliating his ex-platoon mate. It was like, \"You're worth millions of dollars, don't you have anything better to do than harass two struggling bonsai shop owners?\"\n\nThe answer to the question was a resounding \"No!\" because as he said, he was going to dedicate 100% of his time to making them suffer.\n\nPart of his plan was to send some low level goons, who were clearly rejected by other more competent bosses, to torment Daniel. They beat up and harassed Daniel to force him to enter the All-Valley Karate Tournament. Because part of wicked wealthy guy's plan is to beat Daniel in the tournament to take away his title. This is all a part of the revenge.\n\nThese drooling half-witted goons followed Daniel everywhere. They even followed him to some cliffs where Daniel and his female friend were repelling the cliff to get a bonsai tree. That's when I turned it off. I have better things to do. It's bad enough that these two amateurs are repelling a cliff to acquire a bonsai tree, but when they get down there the goons pulled up their ropes as one more terror tactic to force Daniel into the tournament.\n\nThis was making bad writing into an art form. This was black belt level atrociousness. There was no way I could survive another hour of the pathetic plot, the sorry script, and the cartoonish characters. It was at that point in the movie I said, \"Nah I'ma leave.\""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "wesperkins",
        "review_rating": "10",
        "review_title": "Terry Silver steals the show",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "angeltania",
        "review_rating": "7",
        "review_title": "I don't think it beats the first one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "CezzieQ",
        "review_rating": "4",
        "review_title": "An unsettling combo of extreme over-acting and cast members who just don't want to be here",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "noisy-pink-bubbles",
        "review_rating": "",
        "review_title": "Astonishingly bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "moviemattb",
        "review_rating": "4",
        "review_title": "Not the worst, but has its moments",
        "review_detailed_main": "After watching the first two movies, I might as well give my thoughts on this one because I have never seen this one, and I heard that this one isn't good. So, what's the story? \"The Karate Kid, Part III\" picks up where the second one left off (like the first one, recapping scenes as flashbacks like in the \"Rocky\" movies) as both Daniel LaRusso and Mr. Miyagi return home to Los Angeles after their trip in Okinawa started working a business of themselves by selling bonsai. Meanwhile, Kreese is now broken down after losing his students due to his behavior at the All-Valley Tournament wants revenge on Daniel and Miyagi as he calls in his old friend Terry Silver, who they serve together during the Vietnam War. So Terry agrees, and makes Daniel to be a bad influence by teaching Karate in the wrong way; its now up to Miyagi and Daniel to go one more round against Kreese; Terry; and their student Mike Barnes. First off, I don't mind the idea of a revenge story for Kreese getting revenge on Daniel and Miyagi, but it was not well executed enough. Secondly, didn't the filmmakers learn their lessons to make Macchio's character not be bullied like what he had in the first two movies? Guess not. Third, the new love interest Jessica Andrews played by Robyn Lively who I think is an okay actress in this movie but doesn't seem that interesting to me. I felt that it would've been something if either make our main hero be together with Kumiko from the second movie or renew his relationship with Ali from the first film; its one or the other but I think they are much better love interest in this girl in the third movie. Fourth, the ending is so anti-climatic because there nothing exciting going on, it has just gone back to basics like what the first movie did. I wish the action in the last act of movie would have been something new and different. Why not have Daniel go against Terry? If \"Rocky V\" can do that, so can this. What I mean is teacher against student. Miyagi is the good and Terry is the bad. Terry is suppose to be a bad influence for Daniel because he wants him to fight dirty and do what he does; he also has more of a personality than Mike Barnes. The first two movies where always about Daniel going against a bad student; this is one would have been something new and different if a student goes against a teacher. Daniel would have just said to Terry that he doesn't want to fight Mike Barnes, he wants to fight Terry because like said be a bad influence. That is what the ending should have been. Lastly, for my criticism, I wish if this movie hasn't taken the \"Rocky III\" route if you had Miyagi saying that he doesn't want to train Daniel anymore. Just like Mickey saying to Rocky \"Fight him without me.\" Anything good? Yes. I thought the movie does have some good acting, but for Ralph Macchio and Pat Morita. I am sure that these two will always have a chemistry than Morita having a chemistry with Hilary Swank, which I might review that one. For Macchio, I know he is a fine actor, but he looks old to be a teenager. Should have been called \"The Karate Man\" or something, which that would have been something if you are going for a different approach to the series. Also, his character is a bit to aggressive when he keeps having issues with bullies and losing his temper. The filmmakers would have made his character smart, but no, they didn't learned their lesson. The music by Bill Conti is very good as well as the film's cinematography. John G. Avildsen is a fine director, but he doesn't add anything new to the table besides bringing the old stuffs back. Of course, I do say Thomas Ian Griffith plays a very well done villain and I still wish if his character fights Macchio's character instead of Mike Barnes. The movie is watchable, but it is misguided. Sometimes I thought the series should have end with the second one. \"The Karate Kid, Part III\" is not the worst, but has its moments. I give it a 4 out of 10."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dthorsen1146",
        "review_rating": "7",
        "review_title": "Psychological test",
        "review_detailed_main": "I rented this one about ten or so years ago had my beers while I was watching and repeatedly went out of my head for a few hours. The first movie was a psychological attack on a lonely teenager getting attacked by a popular clique of stuck on themselves high school karate boys. This one has an older Danny getting back from Japan then proceeding to get a total psyche blast from someone who just wants to psychologically ruin his life by becoming his friend then taking that back then trying to destroy him by using karate. Danny has to figure it out on his own this time but Miyagi does help him eventually. Just for guidance and we finally get to see him fight what a scene! I'd recommend this to anyone liking the first one and maybe they did try to squeeze out another movie but it is way better than the next karate kid"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "carologletree",
        "review_rating": "5",
        "review_title": "It Really Doesn't Add Anything New to the Story",
        "review_detailed_main": "This third film is definitely my least favorite. Its main problem is that it suffers from superfluousness.\n\nRalph Macchio is still great as Daniel and Pat Morita is still great as Mr. Miyagi. Thomas Ian Griffith is also a fantastic villain.\n\nHowever, the story is pretty lacking. For the most part, it feels like a rehash of the first movie without nearly as much spark or charm. It adds nothing new to the Karate Kid saga, and the whole thing comes off as unnecessary and tired.\n\nDaniel's new love interest is nothing special, and the fight at the end, once again, really isn't anything we haven't seen before.\n\nI still feel that Part II would have been the right way to end the series. This film isn't awful, but it is a mediocre and routine third installment all the way. Recommended only to Karate Kid fans.\n\nRATING: C"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "marcharrison10",
        "review_rating": "7",
        "review_title": "Better than the rating",
        "review_detailed_main": "If your a fan of the karate kid it's better than the reviews say . Has to defend his title against the bad boy of karate . Classic nostalgic film you can watch again and again ."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Uriah43",
        "review_rating": "4",
        "review_title": "Going Through the Motions",
        "review_detailed_main": "This film essentially begins where its predecessor left off with both \"Daniel LaRusso\" (Ralph Macchio) and \"Mr. Miyagi\" (Pat Morita) returning from Okinawa only to find that the apartment complex where Daniel lives and Mr. Miyagi works is being renovated. So, even though he is now unemployed, Mr. Miyagi resolves Daniel's dilemma by graciously allowing Daniel to stay with him until the two figure something out. Meanwhile, having lost both his karate dojo and all of his students due to his bad behavior, \"John Kleese\" (Martin Kove) goes to see an old war buddy by the name of \"Terry Silver\" (Thomas Ian Griffith) who, not only has a great deal of wealth, but also shares the same disregard for decency as well. That being said, Terry promises John that he will do whatever it takes to humiliate and ruin both Daniel and Mr. Miyagi once and for all. And to make that happen, Terry recruits an extremely talented martial arts student by the name of \"Mike Barnes\" (Sean Kanan) who has a bad reputation as a dirty fighter--and his new target is Daniel LaRusso. Now, rather than reveal any more, I will just say, although it introduced some new characters, it still followed the same general outline of its two predecessors. To that effect, it didn't really offer anything that was really new or interesting and it seemed like everybody was simply going through the motions. At least, that was my impression. Be that as it may, while this may not have been a bad movie necessarily, the overall lack of originality was much too obvious and I have rated it accordingly. Slightly below average."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "omnidigitalbrain",
        "review_rating": "7",
        "review_title": "Karate is most useful if it helps you to succeed in life",
        "review_detailed_main": "Yes, yes, yes, I agree, the story is weak and Larusso is even weaker in this third installment of the Karate Kid where, after winning in a UFC-style match in Karate Kid 2, he somehow becomes afraid like a little kid in the finals against Mike Barnes. As a friend noted, it's like as if Larusso didn't learn anything from Mr Miyagi. However, what I loved about Karate Kid 3 is the Terry Silver character who, despite being twisted and devious, nevertheless shows that karate training could help a person succeed financially in life. In contrast, note how Mr Miyagi, John Kreese and Johnny Lawrence, in the new Youtube series Cobra Kai, were all struggling financially. What good is martial arts if the self-discipline and self-mastery learned do not transfer to real life??? Since Silver was the teacher of Mike Barnes and we know that Barnes is set to return in Season 2 of Cobra Kai, it will be interesting to see if Barnes has indeed become successful in life."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "zkonedog",
        "review_rating": "5",
        "review_title": "Watch, If Only For Miyagi/Daniel Relationship",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "BrickNash",
        "review_rating": "10",
        "review_title": "Doesn't deserve any hate. Great villain and an interesting story.",
        "review_detailed_main": "Karate Kid III is the final film in the Karate Kid series starring Ralph Macchio.\n\nThe movie has a reputation for being a re-tread of the first film, but honestly - nothing could be farther from the truth.\n\nBar the final ten minutes which does feel like the first film, the rest of the movie is a hugely entertaining chapter in the story. Here we see a devious plan to mentally break Daniel and drive a wedge between him and his beloved teacher Miyagi by new villain Terry Silver played by Thomas Ian Griffith.\n\nMake no mistake - Griffith absolutely steals the show with his manic and devilish performance. He is a proper snake in the grass, and it's great to watch just how subtlety he manipulates Daniel and slowly changes him into something bad. This corruption culminates in a heart-wrenching scene where Daniel loses his temper and makes Miyagi cry.\n\nRobyn Lively is very good as the supporting female character. It's astounding that she was just 16 years old while making this movie and Macchio was 27, yet they both look about 22. This age difference in the actors prompted the director to make the relationship of the characters purely platonic since Lively was a minor, but this actually helps to craft something new. Instead of just being a Bond girl type deal where yet another love interest in thrown into the pool, the fact that Jessica is simply a friend adds a refreshing feel to the dynamic. Plus, she's not just an ear for his emotions - she has real world skills which help out on more than one occasion.\n\nSpecial mention must go to Bill Conti's score, which think is the best of all the Karate Kid films. The piece where Miyagi and Daniel are on the cliff doing the kata is astoundingly beautiful, and Terry Silver's music is a wonderful pastiche of Vivaldi and mischievous baroque.\n\nFor me, Karate Kid III is on par with the second movie. It's hugely watchable, had a great villain, and it does something a little new in a few areas.\n\nIf the final showdown had been anywhere else but the tournament then I think it would have done better, and it's definitely the film's weak point. However, the movie adds so much to the Karate Kid lore, and watching Terry Silver work is just an absolute joy!\n\nThoroughly recommended!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "classicsoncall",
        "review_rating": "6",
        "review_title": "\"Extreme situations require extreme measures!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "tonosov-51238",
        "review_rating": "5",
        "review_title": "Dilapidated reshuffle with one saving grace",
        "review_detailed_main": "To point out the obvious, the concept has already exhausted itself after the first movie. Consequently, if you were to be adamant about keeping Daniel and Miyagi, it would inevitably regress into contrived drama.\n\nIt is difficult not to roll your eyes at Daniel's numbskull behavior. It is equally hard to watch him lash out at Miyagi, with these two characters seemingly not being able to communicate over a palpably simple issue. Therefore, you faintly believe in their estrangement. What doesn't help is Ralph Macchio's acting. He's got that baby face figured out, but his irritation is comically exaggerated, with him huffing and puffing.\n\nThe creation of Jessica is puzzling as well. I assume they couldn't get Kumiko's actress, and so she is written out in the same way Ali was in Part II. Now she is promptly replaced with \"not-love-interest\" because of age or something, and from my understanding, she is there for Daniel to vent because we can't have him talking with himself like a nut case.\n\nIn spite of that, one man bludgeons in to save the day. Thomas Ian Griffith is chewing the scenery, emphasized by the screenplay to be the most hyperbolized villain in the entire franchise. The man has an illicit toxic waste disposal business but he will dedicate money and time to gaslight some teenager and make him betray his own credo. What is more, Ian Griffith devotes himself to that role. The pure gleefulness he is playing it with is a sight to behold. Honestly, it's worth a watch just for him."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Intermopper",
        "review_rating": "",
        "review_title": "Heart-warming tale of a 30 year-old boy trapped in the early 80's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "vonnoosh",
        "review_rating": "3",
        "review_title": "Soooo many reruns on Cinemax",
        "review_detailed_main": "This is one of those movies you'd watch on cable and be vaguely interested enough to have it on in the background. It was hard to ignore because this was one of the top 5 movies they played the most. The others were Short Circuit 2, Who's Harry Crumb?, Police Academy 5, Twins, Road House, Memories of Me, Air America and Batteries Not Included. If you were a kid with cable back then, you saw those movies at least 30 times each and maybe only appreciated the comedies.\n\nThis Karate Kid, only has one memorable scene. Of course one of the bad guys has a pony tale and Mr Miyagi gets into a fight with him but manages to humilate him without hitting him. As the ponytaled guy sat on his butt covered in paint, Miyagi mockingly wiggled his hands in front of him saying \"wahhh wahhh\", he was mocking the way ponytale guy did the same. The plot isn't very interesting. I remember feeling like I was watching the first one over again but not liking it as much. Basically true for 99% of sequels made before the 2000s."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dbandeira",
        "review_rating": "7",
        "review_title": "The bad fame is unfair. Really not bad.",
        "review_detailed_main": "Just watched the 3 films with Ralph Macchio this past week (I've never seen any of the movies complete before, just bits when they aired on TV), and I have to say: Part 3 is just as good as the first 2. This movie really had an unfair bad reputation... the only problem is that Thomas Ian Griffith, as Terry Silver, is acting over the top, just a little. Not much different than Martin Kove (John Kreese) in Karate Kid 1.\n\nMy point is: If you never watched any of the films and is thinking about skipping the Karate Kid 3 because you heard it's bad, I advise you not to do that."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "RECB3",
        "review_rating": "5",
        "review_title": "A Nice Film For Everyone To Watch",
        "review_detailed_main": "This is a nice enjoyable film for viewers to watch. I enjoyed watching it. I felt that the storyline could have been a lot better but it was still fine. The cast selection was great. They strongly committed to this film and series. This instalment is not as strong and great as the first two films but it is still relevant. This instalment reveals to viewers the tools that are needed in life. This instalment teaches viewers the possibilities of trust. It also shows the true nature of growing up and building a life. This series teaches viewers a lot about how to manage life through challenges and difficulties. This is a great series for all viewers to watch, enjoy, and learn."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "d_m_s",
        "review_rating": "6",
        "review_title": "Waaaay better than part 2 and is pretty a pretty fun film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "akshatmahajan",
        "review_rating": "2",
        "review_title": "Loud and unnecessary",
        "review_detailed_main": "This franchise was in my watchlist for a long time and today I finally decided to start watching the franchise movies.\n\nThe movie was nothing like the first two parts. The story was silly and nonsense, the screenplay was little uneven and stretched, the direction was bad and the performances which were strong points in first two parts were also bad. In the first two parts, you can feel the connection with the both lead actors but you cant feel that connection in this one. The movie was just loud and an unnecessary addition in once a beautiful franchise.\n\nOverall, it's a bad sequel and I won't recommend it."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "whatch-17931",
        "review_rating": "6",
        "review_title": "Lousy cash grab but with some good acting by the new guys",
        "review_detailed_main": "Macchio and Avildsen both agree it was a bad imitation of the first movie.\n\nHowever, both Thomas Ian Griffith and Sean Kanan give dynamic spirited performances as Terry Silver and Mike Barnes, respectively. They're both somewhat over the top but the movie sorely needed that energy.\n\nAnd aside from John Kreese, Barnes still qualifies as Daniel's greatest enemy. It'll be interesting to see if Barnes shows up in Cobra Kai.\n\nThe funny thing about Griffith's Terry Silver character is that his casual plotting and criminality actually would fit in perfectly with CK. Though, there is a theory and possible foreshadowing that Silver is the father of Miguel Diaz, and I hope that's not true because it would be way too coincidental and soapy."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Dunkaccino",
        "review_rating": "5",
        "review_title": "Stop it already",
        "review_detailed_main": "According to IMDB trivia, nor did the star of the Karate Kid Ralph Macchio and director John G. Avildsen liked this installment. The latter one even said this is a \"horrible imitation of part one\". I just couldn't agree with him more.\n\nPart III is the definition of \"overstaying the welcome\". It has the exact same plot and formula of the first two films. And guess what? Daniel has yet another love interest! Wow, how boring is Daniel's relationship with women in the franchise.\n\nPat Morita and Ralph Macchio, alongside with the actors who played the villains Terry Silver and John Kreese did what they could do and it's not them to blame. The script is a copy of the wonderful first one which is made by the same person, Robert Mark Kamen.\n\nThere's another movie titled \"The Next Karate Kid\" starring once again Pat Morita. I cannot believe we have four exactly same movies existing in Hollywood."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dmusucksdonkey",
        "review_rating": "9",
        "review_title": "Diabolical film, but a good laugh",
        "review_detailed_main": "I've read a lot of the comments others have left about Karate Kid 3, and although the majority of them have a point, please bear in mind it's the third in the series of the Karate Kid movies for heaven's sake! Why are you people seriously analysing the realism of it? The whole concept from day one has been ridiculous. OK, so it IS possible for some wee wiener to somehow win a karate competition in a month or two of waxing cars, and painting fences, against guys who have been doing karate for probably their whole lives. But come on, the whole Mr Miyagi thing clapping his hands and rubbing Daniel's leg? Who is he, Jesus? So, when you bear in mind the whole series are stupid, why heavily criticise the film? You've obviously sat through one and two, so should know by now that the film is going to be poo, but it will be enjoyable. An ideal film to watch when you've had a few beers, or fancy laughing at the cheesy bad guy characters they've thrown in. How can anyone seriously say they don't like the film when Terry Silver delivers such classic likes as \"I love it when he pounds him!\"? I would recommend watching this movie, but watch it with a pinch of salt. Just enjoy the roller-coaster ride of hammy acting, and seriously un-menacing bad guys they have. I mean, Kreece was a cheesy slime-ball in Cagney and Lacey for God's sake. Are you really going to feel intimidated by him?"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "alexanderdavies-99382",
        "review_rating": "6",
        "review_title": "The first one was all that was needed.",
        "review_detailed_main": "After the unexpected success of the first \"Karate Kid\" movie, someone felt the need to make two more of them. Admittedly, the original movie is a good one and it deserves its cult status. Second one is quite poor. Part 3 is ever so slightly an improvement over its predecessor but it's still routine fare. As before, the martial arts is fairly tame stuff. Old Pat Morita still can't move all that quickly as his attempts at Karate only induce a few chuckles! It was good to see Martin Kove return as the former nemesis of Daniel La Russo. At the beginning, we are shown how the passing years have treated Reese (Kove). His dojo - once a thriving establishment - is now completely deserted. After the rather embarrassing events of the first movie, Reese is no longer in demand to teach Karate. We see a lot of unpaid bills and a man who appears to be a shadow of his former self. The camera passes along some remnants of the past: tournament trophies, posters advertising his dojo etc. The story offers nothing new at all but is just about digestible."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "kpruss3",
        "review_rating": "4",
        "review_title": "Daniel changed way too much",
        "review_detailed_main": "I only watched it when they announced that Terry Silver was going to appear in Cobra Kai season 4. I had no idea who he was and feel like I would miss some things when cobra Kai comes back.\n\nThe writing for Daniel was so BAD! He was such a lovable loser in the first Karate Kid. All he did in Karate Kid 3 was whine and complain! Why couldn't the writers just keep him the same? 🙄\n\nIt was very predictable but I only wanted to watch it for Terry's background. I'm defiantly interested to see what cobra Kai does with his character!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bmxrountree",
        "review_rating": "",
        "review_title": "confussed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "filipemanuelneto",
        "review_rating": "5",
        "review_title": "The weakest of them all in the Karate Kid franchise.",
        "review_detailed_main": "After an excellent initial film and a sufficiently honorable sequel, this film comes to us... and there is no way to hide that the quality of the material presented is substantially lower and that the film works badly.\n\nThe biggest problem with this film is the script, quite weak, poorly written and full of holes in which the lack of logic and credibility are closely associated with a dose of predictability that makes the film tiresome. The characters were also frankly poorly developed, the villains are stereotyped and loaded (the movie does everything it can to not like them) and the material given to the actors wasn't enough to guarantee a good job.\n\nEven so, it is necessary to recognize that Pat Morita and Ralph Macchio did everything possible to rise to the challenge, and to live up to what the audience expected from their respective characters. Morita remains a sympathetic presence and Macchio is not as immature and stubborn as in previous films, which shows some maturity in the character (although I don't know if this was intentional). The disappearance of Macchio's character's mother from the scene is justified in the most stupid way possible, and the place that was supposedly leased for the bonsai shop looks more like a warehouse than a commercial space.\n\nIn the midst of these problems, the film compensates us with regular cinematography, good editing, a pleasant pace and no room for dead moments. Filming locations are satisfying enough. This being an action movie, a fight movie, karate, I expected to have seen some more fights, it has a lot less fights than the previous movies, and the tension is not as palpable, but what was done is quite well done, and the fight choreographies were well rehearsed and carried out."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "disdressed12",
        "review_rating": "6",
        "review_title": "weakest of the original trilogy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dccomics58",
        "review_rating": "3",
        "review_title": "Expired material",
        "review_detailed_main": "I made this comment on the message board, but i will also add it here. I love the Karate Kid, but this film doesn't work. Everything from the script to the performances is irrational. It basically exists to cash in on the previous movie success, if you make a sequel to name as popular as the Karate Kid, anyone will see it if they like the series regardless if the material has worn thin (it will work once or twice). Basically, one sequel to many resulting in a film that has upset many loyal fans of the series looking for rationality and heart over formulaic and over the top production. I'm giving it a 2, just because id hate to give a Karate Kid movie a 1 since I love the idea behind the series."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "chris-683",
        "review_rating": "6",
        "review_title": "Not Quite The Movie I Remember",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "OK, it's pretty bad, but not as bad as a 3.9",
        "review_detailed_main": "Finally, I found the third Karate Kid! I was dying to know how the trilogy ended, this was a lot like Rocky. They were inspirational films and always made you feel like you could achieve anything. Now, the problems with the third installment, the plot was 4th grade, \"He hit me so I have to hit him back\", not to mention that the villains were just plain trying to hard. It was pretty bad acting, it was like they were trying so hard to convince me that they had no justice in their plan, totally unrealistic.\n\nBut, I mean over all it's not too bad, there are some very nice and heart touching moments in the film with the same inspirational message. So, just for the sake of completing the trilogy, I would recommend.\n\n5/10"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mcfly-31",
        "review_rating": "6",
        "review_title": "get your kix elsewhere",
        "review_detailed_main": "They try, and succeed some of the time in this film, but its just not enough for a recommendation. The villain is approached differently this time around, which was interesting. Yes, there is the usual hot headed punk bothering Daniel, but the real bad guy is Griffiths character who befriends Daniel. After returning from his Okinowan adventure, Danielsan tries to prepare for college. While he's busy with that, Koves evil teacher is out for revenge, and enlists the aid of old buddy Griffith. He convinces Daniel that he needs to change his approach, thus starting a deterioration of he and Miyagis relationship. It all unfolds decently enough, but the wrong turn is made by making the baddies so racist much of the time. And Kanan tries too hard to be smooth and just causes you to roll your eyes most of the time. Biggest of all, I couldve really done without that pointless, slower than hell bonsai tree stuff. Writer Kamen (of director Avildsen) shouldve tossed that out as fast as they could. It sucks up about 15 minutes of our time, a sequence that, if removed, woudlve made the film a little more tolerable. As for the ending, its back to a tournament finish, that hardly matches the first two films for drama. The musics exciting enough, the move Daniel uses was ok, but it was so quickly over that it lacked the punch of the others. Fair but not awful 3rd entry."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "NightmareOnElmStreetFan",
        "review_rating": "1",
        "review_title": "Daniel got his ass kicked the worst sequel ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "T-ZER0",
        "review_rating": "8",
        "review_title": "Clever movie with a hidden message",
        "review_detailed_main": "Now I know a lot of people will hate me for enjoying this movie, but I did. The hidden message in this film is powerful, and most will not get it. Can you guess what the message is? Here's a hint: Look at the poster!\n\nSo John Kreese returns with his pal Terry Silver to take revenge on Daniel and Miyagi. For me this was perfect, because Kreese was to me the greatest antagonist of the Karate Kid franchise, and still is. Most people will criticize it for copying the original, but for me, only 40% is copied. Also, it's not as bad as Rocky V. Rocky V was a train-wreck. I liked seeing the fight scene of Miyagi vs Kreese and Silver, that's something I always wanted to see even though it was brief, and the chemistry between the two leads is still there.\n\nHave you figured out the message yet? Okay, I'll tell you: I believe this movie sends a message to all those kids finally becoming adults. Like the poster said: \"Now it's Man to Man.\" There's a time in life where a kid will choose to associate with people who do not have their best interests at heart (Like Daniel and Silver), and this may cause them to hurt their parents (Daniel hurting Miyagi). But if they remember who has supported them all this time and \"Listen to their heart\". They will never forget what makes them strong and become the person they are meant to be.\n\nA thrilling conclusion to the original Karate Kid trilogy. Onto Cobra Kai!!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "tsmontana",
        "review_rating": "7",
        "review_title": "Underrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "asherrbh_15",
        "review_rating": "1",
        "review_title": "So bad, don't waste you time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "elshikh4",
        "review_rating": "5",
        "review_title": "The Karate Kid III: Fight The Anger !",
        "review_detailed_main": "Firstly, Viewer-San, must bear some idiocy:\n\nDaniel came back from Japan so tall (Boy! The kids grow up pretty fast in the east!). The returning Daniel seems to have gained at least 25 kg (Boy! They do eat too much in Japan!). The evil guy is a genuine nut-job who was a Vietnam veteran (Boy! The Vietnam war ruined a lot of minds brutally!). The Japanese girl left Danny (Boy! This guy sure knows how to lose girls!).\n\nThen Viewer-San, must bear main course in nonsense feast:\n\nThe movie has one of the silliest plots I have ever experienced in my life. Isn't a bit too far, exaggerated and complicated to plan this long-term scheme on Daniel?! Wasn't beating up him and Miyagi easier and faster?! Plus the whole first 15 minutes were a bore, the attractive details of Miyagi's techniques were out, and the shots of him and Daniel exercising were repeated lifelessly from the previous 2 movies with nothing new, except one helicopter shot that this movie doesn't deserve.\n\nAfter that Viewer-San, must know point of weakness:\n\nThis time, Daniel's girl just goes to come, and comes to go. One time, she goes to never come back! To add more fuel, (Robyn Lively) looks older than the lead. And about the interplay between them both; let's say that they were like Donald Duck and Minnie Mouse. It just won't work!\n\nAnd must know your enemies, your \"real\" ones!:\n\nThe performance of the bad guys was extremely fanatic. They seemed like a bunch of hopeless psychos that fit a (Police Academy) movie. While the viewing, I was doing a funny faces to (Thomas Ian Griffith)'s acting which was nothing but many evil smiles. Actually this portrayal, as a writing or acting, weakened the conflict, making it so predictable.\n\nThen Viewer-San, must know that greatest enemy could be your own hero!:\n\nIt is the biggest disaster at all; and I mean Daniel himself or (Ralph Macchio). He has to be in the world's records encyclopedia as the only human who can talk and talk without any stop to take his breath for the longest possible time! He was delivering the lines so fast, being in uncontrollable hype all the time, to a degree that pushed me to shout in many places: \"CAN'T YOU SHUT UP A LITTLE!\". Maybe the desire was to show how Daniel is living a tight phase in his life. But it is axiomatic that there is a difference between high-strung person, and high-strung performance! After the deep headache he gave me, I said to myself if that didn't make it to the Razzie at its time, then there should be an unnatural phenomenon behind that. Although I already found him on the list, but I was so angry when I discovered that he was a nominee not a winner!!!\n\nNow Viewer-San, learn this great deathblow:\n\nIt's the main problem forever and ever: the script. It's pretty obvious that the choice of the story was all wrong. And don't wait for the forth; it's no more than a remake of the first but with a girl. Anyway, some of Mr. Miyagi's moments, along with the sequence of the mountaineering, were the only bearable things in here.\n\nViewer-San.. Must control feelings:\n\nRead with me what was written on the original poster of it: \"First, it was teacher to student. Then, it was father to son. Now, it's man to man.\" WAW. How serious. I'm about to cry, really. But what was that about?!!!!!!!!!!!\n\nFinally, Viewer-San. OK to lose to movie. Never OK to lose to anger!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "brooke-98054",
        "review_rating": "6",
        "review_title": "Entertaining enough",
        "review_detailed_main": "Karate Kid 3 had nothing in it's plot. Nothing even happened throughout, and I just sat there thinking that I watched a movie about Bonsai Trees. There was barely any karate, and when there was, it was the best part. The best one was at Cobra Kai with Mr. Miyagi. The bad guys weren't that intimidating and Daniel was a little annoying this time around. I feel like there was no bonding between Mr. Miyagi and Daniel at all. The music was great and the scenery was amazing, yet this movie didn't do it for me. It's still entertaining enough because of past characters, but does not compare to 1 or 2."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "DarkVulcan29",
        "review_rating": "3",
        "review_title": "Better than part 2, I think NOT.",
        "review_detailed_main": "Part 2 was the best out of all them, the fight scenes were exciting, it proved to be better then part 1. Who would think this one is better then part 2? I thought Ralph Macchio's acting was so over the top, it was incredibly annoying to watch, his immature dialog was insane to listen too, when he is trying to play Daniel at 18, In real life he was 27 at the time. Not to mention he pudged up some. The late Pat Morita always gives a memorable performance as Mr. Miyagi, but he couldn't save this movie from the humiliation that it is. The fight scenes were not even believably, they more silly. I'm sure Ralph Macchio grabs his head like a headache ever time this movie comes to mind."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bhernandez2216",
        "review_rating": "7",
        "review_title": "The Revenge of Cobra Kai",
        "review_detailed_main": "The Karate Kid Part 3 is pretty entertaining at some point. It was alright, but usually enjoy Karate Kid 1 and 2. In this movie, John Kreese brooding over the defeated handed to him by Daniel LaRusso and Miyagi. They have pretty interesting new villains like Kreese's partner, Terry Silver and new former bully of Cobra Kai: Mike Barnes. And he only wanted the title match for payback against Daniel and Miyagi. Still enjoy the first and second movie."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "alex-law321",
        "review_rating": "3",
        "review_title": "Over-the-top and pointless",
        "review_detailed_main": "This time, we come back to insane karate teacher, John Kreese, who wants revenge on Daniel and Myagi for what happened in the first movie. So he contacts another crazy villain named Terry Silver to help him out with his plan. Meanwhile, Daniel and Myagi are opening a plant shop and have problems of they're own. A been there, done that feeling all the way through and tons of filler. The whole movie it's just one dumb scene after another and just goes on forever. The only thing mildly entertaining about it is the hammy, over-the-top acting from are two villains. I don't know how John Avildsen was trying to cap the franchise but he made this stupid and boring."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mariogomezg",
        "review_rating": "6",
        "review_title": "Fun and underrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "lad327",
        "review_rating": "2",
        "review_title": "Horrible Storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "loza-1",
        "review_rating": "10",
        "review_title": "Number three should have died the death, but it didn't.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "neil-476",
        "review_rating": "7",
        "review_title": "Diminishing returns...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Jsimpson5",
        "review_rating": "5",
        "review_title": "Could have been a lot better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "ponyboys-girl",
        "review_rating": "5",
        "review_title": "The Karate Kid triogloy could not be complete without it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "sassoula",
        "review_rating": "6",
        "review_title": "Rushed and juvenile.",
        "review_detailed_main": "This movie isnt as bad as ppl say, its not Super Troopers or American pie, aka the 'stupid American' movies we roll our eyes at over in Europe. But its still a half-assed movie. So i decide to write a 2020 review, since they wanted to revive part 1 by making these lame series now turning the tables on many aspects, which serves no purpose other than generating income for these old actors. So they are looking at the OG villains through a different lens.. John Kreese was the egomaniac/inferiority complex unethical guy who corrupted Johnny and Johnny's gang in part 1, so why bring him up again and also why hire Ralph Macchio again in his 50s. I never disliked Johnny btw and I never liked Daniel - if a different actor played the role, Id like Daniel more.\n\nI believe it was a bad casting choice in the first place. In part 1 I find myself wanting Johnny to win, in all honesty. Part 2, i liked Daniel more, but I hate how he looks and acts like a little kid. Daniel in part 3 is even more annoying and doesnt deserve Miyagi who has now lost some of the prestige he had in part 1&2. Daniel has gained that kind of estrogenic weight, he is swollen but with legs and arms like sticks, plus the actor was 28 yrs old and still looked like an awkward 16 yr old, walking funny and clumsy on his toes, constantly fidgeting and trying to make his voice sound manly - cringe fest. No wonder he cant keep a girl. I mean even the awkward way he is looking at Terry Silver talking to him (esp at the dojo), he seems intimidated and I cannot tell if that was part of Macchio's acting or spontaneous reaction because Ian Griffith was younger than Macchio yet he looks like a grown man (not talking about when Daniel seems confused as to why Silver offers help). Also that girl Jessica let him down by announcing that she will go back to her bf, no doubt, and so Daniel's journey is romance-free, and thats fine for a nerdy boy like him, but why invest so much movie-time in their friendship with Jessica. The set up of that store is also pointless and I was hoping we could see it evolve at least.\n\nMany pointed out in their reviews that the acting and roles of the villains were over-the-top, esp Ian Griffith's; I think this was the director's instructions, they wanted to convey that cartoon-type of the villain who is a mentally ill obsessed stalker. There is some truth to that, since I have witnessed in real life people acting and laughing like that when they bully someone. So not totally unrealistic BUT they have Terry Silver hysterically laugh like Jafar in his bathrobe lol and hide in the chimney, wtf. Thats very Home Alone-like and juvenile, so definitely it was the director's orders and not bad acting. I wish these parts were missing. I honestly believe the movie is watchable thanks to Pat Morita and Ian Griffith, the first one inspires respect and the latter is my kind of hot, and I also like the way the actor talks to Daniel in his face, looking at him like a snake ready to attack.\n\nI also like how Miyagi in this movie teaches Daniel that tournaments are a degradation and exploitation of that ancient art, and shouldnt be used as a means of gaining wealth or an ego/power boost. The reason why Miyagi challenged them to the tournament in part one was more ethical, so that the rivalry among these teens would end, and he supposedly taught Kreese a lesson too at the very end. Part 1 btw shows many impressive athletes in the tournament that Daniel was far from so we are aware than Danny wasnt as skilled. What I hate in part 3 is how Daniel cares more about bonsai than karate. he seems to have lost any skill he once had, acting like a beginner, making Miyagi look bad. Again, the only reason I watch this movie again is Miyagi and Terry Silver."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "TruthbeTold2626",
        "review_rating": "3",
        "review_title": "Had to turn it off",
        "review_detailed_main": "I couldn't watch it. The first 2 movies were good, but this one was awful. Danny sun seemed like a grease ball slime bag always taking advantage of his sensi. Terrible movie all around and discredits the first two. Avoid"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "wkozak221",
        "review_rating": "6",
        "review_title": "Kinda fun sequel.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "dee.reid",
        "review_rating": "4",
        "review_title": "Part III? They should have stopped at \"II\"",
        "review_detailed_main": "But then again, forgive me. I showered praise on \"The Karate Kid\" (1984) because I thought it was the first American-made film to portray martial arts in a non-stereotypical, serious fashion devoid of old chop-soki theatrics. \"The Karate Kid, Part II\" (1986) was not as good even though it followed up directly after the first film and kept me watching despite its contrivances. Now we're at 1989's part III, and those repeated spin-kicks to the head are finally starting to wear us down.\n\nDirector John G. Avildsen has never strayed far from his \"underdog\" story roots and it's a formula that has been ever-present in nearly flick the man has ever touched. It's a theme that has been apparent in both the \"Rocky\" movies and these \"Karate Kid\" movies and it's quickly tiring itself out and its welcoming as a formula. The sequels just keep repeating the same storyline: the hero gets his butt kicked, undergoes training, and finally finds the strength and skills to return the favor to the bad guys.\n\nIn \"The Karate Kid,\" of course Daniel LaRusso (Ralph Macchio, noticeably older and - pudgier?) had a pretty good excuse to be a wimp. He was the new kid on the block, a socially green transplant from New Jersey to California, he had set his eyes on a cute girl, ran afoul of her ex-boyfriend, he kicked Daniel's butt, Daniel meets Mr. Miyagi (Pat Morita), learns Karate, wins the cute girl's affections, and kicks the bad guys' butts at the big tournament.\n\nMost importantly in that earlier movie, we liked Daniel. Here, he's obnoxious, pathetic, and pig-headed. He even risks his life at one point to retrieve a bonsai tree from a steep cliff to aid Miyagi's blossoming business, which had been opened with LaRusso's college money. It's also a shame that his new crush (played by Robyn Lively) doesn't see it either. Plot-wise, Daniel gets it in his head that he needs to defend his title and eagerly awaits Miyagi's signature on an entry form. Somehow or another not long after, Miyagi's wisdom manages to convince the chap it's not worth it.\n\nMeanwhile, Kreese (Martin Kove, reprising his villain role from the first movie) has pretty much lost his entire business because of his defeat at the tournament. He's not had a student in some time and the bills are piling up. In desperation, he turns to his old Vietnam buddy Terry Silver (Thomas Ian Griffith), a slick businessman with a number of shady ties to illegal toxic waste dumping.\n\nThe two scheme together to get the ultimate revenge on Daniel and Mr. Miyagi by forcing them to enter the tournament to defend their title. To do this, Silver contacts Karate bad-boy Mike Barnes (Sean Kanan), whose reputation as a \"bad boy\" is a hazy shade of green to the fact that he's a violent psycho with a black belt in a sport that emphasizes discipline and self-control above everything else other than your self-defense training. It is Barnes's duty to coerce Daniel by any means necessary into signing his entry form so that he'll have no choice but to fight in the tournament.\n\nI really wanted to like this movie but I had to wonder, \"Gee, not only does it seem like Avildsen's running out of ideas, but does he hate Daniel so much that he sends a Karate-trained nut-job like Mike Barnes after him?\" I do get the picture that in the \"Karate Kid\" movies, our hero does have a penchant for attracting violent psychos.\n\nI guess in the end it's all good fun, even if it's strained. I'd like to heed Miyagi's advice from the first film though, \"Wax on, wax off.\" Being, \"wax\" this movie off your list and just stick to part I and, if you can, part II.\n\n4/10"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "deepfrieddodo",
        "review_rating": "6",
        "review_title": "Cartoonish Karate Kid",
        "review_detailed_main": "A storyline which in parts could have produced a good installment to finish the trilogy, The Karate Kid Part III instead takes an already outlandish roster of characters and turns them more into cartoons. The previous two films had their evident bad guys, with all the stereotypical habits, but Part III goes above and beyond this, not only is the new baddie a millionaire, but he has a ponytail, and is pure evil.\n\nIt does make the continuation just daft in parts, but really, no one is watching this film without having previously seen the others, and so the film needs to be judged based on how that audience perceives it. As a stand alone film, it's bad, as a third installment, albeit worse than the previous, it is still an enjoyable film. This is largely down to Morita as Miyagi. The character is brilliant and thankfully does not alter along the timeline. His comedic moments especially break through as memorable moments.\n\nUltimately, it comes down to characters. In the previous two, the 'bad' guys had grey areas, they weren't monsters, just misled in one way or another. This, like many films before and since, just pushes them beyond all sense of relatability, meaning it's looked on negatively by many. I feel The Karate Kid has always mirrored the Rocky franchise (and in the climax of this film LaRusso essentially does all but quote Balboa from Rocky IV), and whilst the stable characters put on a good show again, it's the newbies who jump the shark."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "gbheron",
        "review_rating": "3",
        "review_title": "Too Bad, Mr. Miyagi",
        "review_detailed_main": "The first Karate Kid was a wonderful, heart-warming movie. The first sequel, Part II, was a passable entrant, consisting of warmed-over plot lines, but at least the venue moved from California to Okinawa. Now comes the third installment and they're back to their old stomping grounds in California. The time is supposed to be only a year after the original and it's time for Daniel to defend his championship. I can't go on...the movie is too insipid. The moviemakers make a complete hash of Part III. All the characters are reduced to two-dimensional punch-outs. Nobody behaves believably, sadly even Mr. Miyagi. This is certainly a sequel too far. Avoid."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "cscoyle",
        "review_rating": "10",
        "review_title": "Good times",
        "review_detailed_main": "Movies in my opinion are hard to score. I have give this 10 simply because it's brought me joy over the years. That joy is more so now with the release of cobra Kai. We don't have to over think how movies are shot or how they was wrote etc. I can't compare this to the shawshank redemption because they are completely different. It's like saying do i like YMCA or love me tender more..... I love them both for different reasons. I refuse to let people score this below 5 because they just deem it silly. So I vote 10 to tip the balance. This is definitely worth watching for anyone who has only watched cobra Kai. Or if you've not seen for a long time I suggest this and cobra Kai."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "Danny Boy....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Dorminante",
        "review_rating": "",
        "review_title": "Worst of the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "danskent",
        "review_rating": "2",
        "review_title": "Just terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "pauljcolizzo",
        "review_rating": "7",
        "review_title": "Good movie though not as good as the other 2.",
        "review_detailed_main": "Many people have been too harsh on this movie over some i's that were not dotted coupled with the fact that it was not as good as the the first 2. Some seen it a predicable, but how many will admit that they foreseen Ralph Macchio having a romantic relationship with Robin Lively that did not happen? This movie looks like it could have been an alternative plot for the 2nd movie. In this movie John Kreese losses his students because of his harsh treatment of Johnny losing the tournament to Daniel by breaking his 2nd place trophy and nearly choking him to death. The head of Cobra Kai, millionaire Terry Silver helps John Kreese regain balance and hope in his life first through relaxation than revenge. Many thought it was over the top for a millionaire to take revenge on a teenager, but it was designed to show how Cobra Kai is set on revenge and no mercy of their enemies, in this case Miyagi and LaRusso caused a chain reaction, dismantling the life of John Kreese. Miyagi refuses to train Daniel to defend a plastic metal trophy, and Daniel gets forced into signing to fight a karate bad boy hired by the Cobra Kai millionaire. Daniel falls for the millionaire's deception and Daniel becomes his student since Mr. Miyagi will not train him for the tournament. When Daniel acts out his character he realizes it's not him. The highlight battle was between Miyagi and Kresse opposed to the tournament. The moral was that like a damaged bonsai tree that healed, Daniel also has a street root inside that needs to come out. No it was not as good as the first, but entertaining for those that allow the movie to stand on its own leg rather than comparing it to the first movie."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "gwnightscream",
        "review_rating": "5",
        "review_title": "Not Bad, But Could've Been Better!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "I know places and people, some that might pass for the world in The Karate Kid Part III. I have seen people drink themselves evil. I have seen young people fall apart because of those around them. But, I guess there is always the chance of coming out, and surviving, if you keep up the fight. Dysfunctional families live in decaying shacks, without money or food. Violent dogs are barking everywhere. Disagreements are settled by fistfights. The cinematography is stark and bare, with only the soundtrack adding some effect. The acting is very effective. This is the kind of film that proves that a small story can be much more meaningful than a larger one."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "yihdzelonh",
        "review_rating": "5",
        "review_title": "\"What's this? BLOOD! Make believe it's his!\"",
        "review_detailed_main": "In the \"Karate Kid III,\" La Russo has returned home from Japan and his demeanor and Karate skills, very strangely, are so inept that one would never believe that he has ever so much as 'practiced' any kind of Karate move -much less been good enough at one point to have even entered a tournament -and even much less 'won' it. His physique is very 'non-linear, his athleticism and stamina completely non-existent -- his walk is reminiscent of a 'miniature Big Bird.' Everything about him is absolutely 'pathetic' to the point of being a 'parody' of his former self...so much that it is quite 'hilarious' to watch...\n\nThroughout the movie he very effiminately talks and screams like Judy Garland -in the Wizard of Oz- and his naive face looks very similar to that of \"Princess Leia.\" The \"Karate bitch\" is preyed upon by one of Kreese's friends -and an upcoming 'bully karateka' in numerous ways: La Russo is 'coerced' against his will into entering the annual tournament...and the gullible retard LaRusso is easily tricked by Kreese's pal that he wants to befriend and train LaRusso.\n\nThe movie -a parody of the previous two Karate Kid movies -has many absolutely hilarious moments: The 'bully karateka' slapping LaRusso around inside of the bonzai gift shop and then taking off in his car whilst doing a few 'doughnuts' before narrowly missing a train, LaRusso asking Miyagi to show him 'sweeps' and Miyagi instead showing Danielson how to use a 'broom,' Silver training Danielson to become an aggressive 'pitbull' of a fighter by having Danielson breaking wooden stilts, Danielson breaking the nose of a boy 'hitting' on his girlfriend at a dance, and especially the entire final tournament: the 'bully karateka' yelling profanities at Danielson telling him his karate isn't worth (*bleep*) and then being 'psyched out' by Danielson in the finale and losing the tournament.\n\nThe 1980s is a decade rife with 'awesomely-bad' movies (perhaps much more than any other decade) and The Karate Kid III -though in most repects a 'bad' movie- is nonetheless somehow VERY 're'-watcheable...and one of the most 'awesomely-bad' movies I've ever seen. It is also easily one of the most 'unintentionally'-funny (or WAS it 'intentionally-funny'?) movies I've ever seen. One of my favorite movies of all time. 5 stars."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "princessstrickland21",
        "review_rating": "4",
        "review_title": "Losing its chique",
        "review_detailed_main": "First, second,remake; they were good. This seemed more like a comedy routine if it were done by the three stooges.\n\nActors are ok, but I think the story is pointless, and that's just in my opinion.\n\nRalph Machio was already in his mid twenties. This movie isn't great, but it's not horrible. But it seems to more of a comedy than a serious movie like the original. Or even the remake, but it is better than the next karate kid. I'm in between with this one"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "cambrige_girl",
        "review_rating": "10",
        "review_title": "Just a few things I would like to say...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Steve_Walls183",
        "review_rating": "5",
        "review_title": "Not Great, But Better Than Part -Two",
        "review_detailed_main": "This isn't a very good film, however it's better than the second one!\n\nI just watched all of the Karate Kid movies back-to-back, and Part III did have some good moments..... unfortunately, it still fell flat.\n\nThere's not much to say here, it's just another predictable Karate Kid film, with no big surprises.\n\nThe first film was the best one, there's no doubt about that. Big fans of the trilogy will probably want to pick up part III just to complete their collection, that's about it.\n\nI can only recommend this movie as a fun way to kill a boring Sunday afternoon.\n\n."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "modius",
        "review_rating": "",
        "review_title": "If it were a standalone film it'd work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jayjaycee",
        "review_rating": "3",
        "review_title": "An illegal blow to the face of fans of the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "damianphelps",
        "review_rating": "2",
        "review_title": "Even The Director Hates It",
        "review_detailed_main": "The Karate Kid was nearly 30!!\n\nSomeone invent a time machine so I can go back and erase everyone involved in this series and do the world a favour!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "artgutierrez",
        "review_rating": "1",
        "review_title": "KK3 = garbage",
        "review_detailed_main": "Knowing that KK1 and KK2 were massive hits beloved by everyone, it feels so disappointing that KK3 was such a steaming pile of cr@p.\n\nEverything that could possibly go wrong with this movie DID go wrong. Even the order of this sequel is wrong. This technically should've been the 2nd movie. And KK2 in Okinawa should actually be the 3rd and final movie. Yes, I said FINAL movie. The Hillary Swank turdfest does NOT exist.\n\nBut that's like nitpicking about the 5,638,924,106th thing that is wrong with this movie. For starters, at this point, Ralph Macchio was way too old and pudgy to still be portraying a 17-year old Daniel Larusso anymore.\n\nThe acting really sucked (looking especially at you, Thomas Ian Griffith). The story itself was so sloppy. How lazily convenient that Larusso only had to fight a total of one fight to defend his title. What kind of a tournament is that???\n\nThe ONLY part of this movie I enjoyed was Pat Morita's performance.\n\nAll in all, KK3 was nothing more than a shameless studio money grab that takes a massive dump on the previous 2 installments."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "talllwoood13",
        "review_rating": "4",
        "review_title": "Almost good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "chrisruleshughes",
        "review_rating": "9",
        "review_title": "Ralph Chunkio, but a great movie.",
        "review_detailed_main": "OK, it's obviously been at least two years between karate kid 2 and 3, so why on earth does the director feel the need to make it look like Daniel is coming back from Okinawa, when it's clear for everyone to see the difference, he's aged, he's got more flip, and yes, the actor has got fatter. Have you seen his chubby cheeks? All of this aside, the movie is very good i feel. Thomas Ian Griffith's performance is classic, threatening, but very funny. The conflict between teacher and student becomes a tad boring though,plus the little sweet love story between Danial and the tree girl is insulting, we have seen this in the first two movies, forget it,move on.\n\nThis is way better than the second, and has some better moments than the 1st. It's the most comical if you like that sinister style."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Gislef",
        "review_rating": "3",
        "review_title": "No Worse than the Rest",
        "review_detailed_main": "And that's about the best you can say about it. Kove and Thomas Ian are great villains, and they're actually more interesting than the now-badly-overaged Ralph Macchio and the endlessly philosophising Pat Morita. And I like watching Ralph Macchio get his butt kicked as much as the next person. Probably as good a way to end the series as any...ugh, but then they gave us Karate Kid IV."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "americanlit-1",
        "review_rating": "",
        "review_title": "Great, underrated film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "4",
        "review_title": "Back to ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "gridoon",
        "review_rating": "5",
        "review_title": "Familiar, but a definite improvement over \"Part II\".",
        "review_detailed_main": "\"Karate Kid III\" is a definite improvement over the dull and plotless \"Part II\". They actually made an effort to tell a story here, while the previous installment was just meandering along without ever going anywhere. The only thing the film lacks in comparison to the original is...originality: it all seems overly familiar by now. Still, Macchio (who looks, in some scenes, YOUNGER than he did in the original, even though he is 27 years old here) and Morita give OK performances and the film, mild as it is, has an atypically - for this series - fast pace."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "generationofswine",
        "review_rating": "1",
        "review_title": "An Honest Review",
        "review_detailed_main": "I totally forgot about this one until someone at work made an obscure reference about it... and suddenly I was faced with memories I'd rather forget. Honestly, when you remember The Next Karate kid and not Part III, it should tell you something.\n\nAnyway, he was right, it did have Robyn Lively in it and I think this is one of her early roles... and this and Teen Witch are kind of a shame because she can do a good job, a Twin Peaks quality job here and there but otherwise lingers in obscurity and really only surfaces for people like me who see her here and there in television roles and have fond memories of some of her better roles.\n\nAnyway, it also has Ralph Macchio doing a job that kind of makes sure to tell the audience that he does not want to be there, he does not think III is a good idea, and otherwise convinces the audience not to like it.\n\nAnd he was right, the script wasn't there. It was nice that he had a platonic interest and not a love interest, it was unique, it fit his character, it worked with the story... but the story otherwise wasn't there.\n\nIt's kind of a revenge tale that you have seen a thousand times over and this one doesn't say anything more than low budget Canon Pictures quality film."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "biggyjaay",
        "review_rating": "3",
        "review_title": "a real let down (some spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jimmybulmer",
        "review_rating": "10",
        "review_title": "When I read this it was 5.1!!?",
        "review_detailed_main": "I appreciate it's nostalgia to many. I also appreciate it's no blockbuster. The writing on parts is borderline poor. But on the whole this is an excellent movie with a huge heart, the basic principle behind the movie is something most parents should be instilling into their children. About appreciating our children will make mistakes but can put things right. I have watched this movie close to 50 times and look forward bro the day my daughter is old enough to understand the principle behind the movie, especially after No1. (I strongly dislike no2). A wonderful movie if you allow yourself to fall into the magic. The relationship between MrM and Daniel is amazing and tribute to production and direction and even writing, contuary to what I said earlier."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "stormhawk2021",
        "review_rating": "3",
        "review_title": "A big let down",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jeff-8",
        "review_rating": "",
        "review_title": "Back On Track for a Good time!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Calicodreamin",
        "review_rating": "5",
        "review_title": "Nothing you haven't seen before",
        "review_detailed_main": "An okay final movie in the karate kid trilogy, definitely the weakest storyline. The acting is okay and the action scenes are on par with the other movies. But the storyline is a real let down, slow pace, anticlimactic and lots of filler scenes"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "sunraider",
        "review_rating": "3",
        "review_title": "Painful to watch",
        "review_detailed_main": "I decided to revisit the entire original Karate Kid saga because of the remake that came out. Getting to part III reminded me of why I had not seen its original theatrical release. This movie is just awful. The twisted, overly-elaborate revenge plot cooked up by Sensei's rich friend is ludicrous and the acting, especially by Ralph Macchio is embarrassing. The villains are so over-the-top as to be cartoonish and Macchio's Daniel-san is exceedingly annoying, to the point that the film becomes nearly unwatchable. He acts like he's an overgrown teen with ADD. As someone else suggested, it appears as if Macchio actually forgot how to act. Any raw talent he displayed in the original film is completely gone."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bergemilia",
        "review_rating": "1",
        "review_title": "Super duper mixed story, makes no sense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "benblankenship-20805",
        "review_rating": "4",
        "review_title": "Horrible sequel",
        "review_detailed_main": "The acting was terrible . You could tell this movie was low budget . Don't waste your time with it."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "candyyt-05311",
        "review_rating": "8",
        "review_title": "The Best Movie Out Of The Trilogy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "The Karate Kid Part III",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "maya-25",
        "review_rating": "",
        "review_title": "Better than Part II",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "rollernerd",
        "review_rating": "5",
        "review_title": "A man can't stand, he can't fight.",
        "review_detailed_main": "Welcome back to another edition of Adam's Reviews!! **queue in intro music**\n\nTonight's movie review is the third instalment in the Karate Kid Saga, which is titled simply The Karate Kid Part III (1989), which follows after Mr Miyagi and Daniel LaRusso's trip to Okinawa, Japan. Daniel and his teacher decide to open up a bonsai business while Daniel crashes at Mr Miyagi's place until his mother returns back from looking after Uncle Louie in New Jersey. Also, we have the All-Valley Tournament coming up as well. Behind the scenes, the villainous Cobra Kai sensei John Kreese connects with his Viet-Con mate Terry Silver in order to orchestrate a revenge plot against Miyagi-Do slopes. We also have karate bad boy Mike Barnes who will do anything to have LaRusso to participate the All-Valley. This film has the same ingredients from the first and a nice introduction to the Terry Silver character who has a typical Steven Segal ponytail. In some ways this flick has a feel of the Star Wars movie where you have the light and the dark side which Daniel briefly has exposure to when Silver lures him to the dark side of the force.\n\nThe movie does not have the best continuity and yet again scraps out another love interest in the franchise. Also there is no real mention on what the go is with Mr Miyagi and Yuki from the Karate Kid Part II flick. The balance and self-control by Daniel are literally squashed and rejected in this film and is very unbalanced, which takes away from the growth the character developed in the first two movies. Also the one-dimensional character in this flick was too much which was due to the comic book level script, where both villains Creese and Silver laughing at the heroes in the flick feels like the villains from the Batman show laughing. Honestly I didn't mind the over the top but it could've been handled better by the filmmakers. Overall, the movie treads through the same ingredients from the first flick and lacks originality and magic in comparison to the first two films in this franchise, 5/10"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "gearyourlife",
        "review_rating": "4",
        "review_title": "Barely any Karate, standing still in the first half of the tournament fight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "tonymicki",
        "review_rating": "4",
        "review_title": "The Karate Kid III one time review",
        "review_detailed_main": "ToTallY agree with the reviewer who said the young kid was mainly screaming and shouting and whiny countless times especially after seeing it for myself. His calm deminor of the first 2 movies totally flew away in this Karate Kid part 3 movie. Yes Miyagi was his usual wisdom don't talk too much sef which didn't change, the kids dipped to another annoying level. It's a good watch nonetheless but it had the same plot of pursing his love interest while been conned into another battle by a bad business man which is a good theme to follow since that's what the franchise leaned on. On a normal Saturday with popcorn one can watch this over again as i did over the weekend. But the ending left much to be desired...such a rather abrupt ending to the Part 3. It's just a great throwback to the 80's."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "wiseguy233",
        "review_rating": "3",
        "review_title": "It's not the worst movie ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jokervbatman",
        "review_rating": "10",
        "review_title": "Terry Silver",
        "review_detailed_main": "Terry Silver makes this movie what it is campy silly fun\n\nits no where close to the original 2 bur Silver Kreese and how campy the movie is makes it for from boring\n\nits like batman and robin or the room its so bad and wild its actually good and entertaining"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "r96sk",
        "review_rating": "4",
        "review_title": "An irritating watch at times",
        "review_detailed_main": "I kinda like the premise, but man did I find this installment of 'The Karate Kid' to be an irritating watch at times.\n\nPat Morita (Mr. Miyagi) remains the best part of these films, I had a solid time watching his scenes. Behind him, though, it isn't great at all. Ralph Macchio's performance is a little annoying in this, though he isn't helped by the very poor dialogue - which is seemingly just an attempt for Macchio (Daniel) to say as many words in as little time possible in a shouty manner.\n\nRobyn Lively (Jessica) is only there to fill yet another love interest role for Daniel, a third from three films which is actually impressive. Thomas Ian Griffith, Sean Kanan and Martin Kove play the antagonists and they are the most irritating of all - so lazily written.\n\nAs noted, I did actually slightly like the idea that it attempts. It's nothing fresh or anything close, but if done differently it could've turned into an OK watch. Unfortunately, at least in my opinion, it's the opposite."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "whyte_knyte",
        "review_rating": "",
        "review_title": "A martial arts joke. Insult to the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "joebloggscity",
        "review_rating": "3",
        "review_title": "This film is best crane kicked away....",
        "review_detailed_main": "Having recently been engrossed in the new Cobra Kai series, I decided to rewatch the original trilogy after 30 years. Now much older but I still have a huge fondness for the original film, however this third movie is as bad as I remember if not worse.\n\nWhat made The Karate Kid stand out was that it was that it was the antithesis of the bog standard martial arts movie from back in those halcyon video days, yet the writers decided to move this film series into that direction. The main antagonists are like something from 'No Retreat No Surrender' and the ilk. That's a different world, with The Karate Kid universe more about life philosophy and self-defence, as well as self respect. This film sadly sacrificed the often beautiful father & surrogate son relationship between Miyagi and Daniel for dumb action, and the film suffered for it.\n\nBoth the leads deserved so much better, a last hurrah to complete the trilogy with further good humour and pearls of wisdom. Instead they are both given poor scripts with the wonderful Pat Morita as Miyagi painting by numbers for his role whilst Ralph Macchio as Daniel is made to be a whiny regressive soul. The OTT performances by the villains are cringe inducing, and I didn't buy it; as for their story? Best buried away.\n\nI was happy to see Mr Miyagi again, I love the character but he deserved better. This film killed so much opportunity. Its such a shame. Say what you like but at least The Next Karate Kid movie gave Miyagi a finer on-screen farewell to the audience to practise what was so great about the character despite the numerous flaws with that film too.\n\nA sorry end to the original trilogy, but it will never destroy the memory of the wonderful relationship of Daniel and Mr Miyagi, which has genuinely affected and touched the lives of so many of a certain generation. Thank you Pat Morita and Ralph Macchio."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mathijsschaap",
        "review_rating": "3",
        "review_title": "Never again",
        "review_detailed_main": "Today, fort he first time since it's realease 30 years ago, I watched this movie. Being a fan of the first two, I had to see it of course. I expected the worst, but like the first 30 minutes, it was not as bad as I expected. It has some beautiful shots. It was very nice to see Ralph and Pat together again. But in the end, the whole movie sucks. It has major flaws. Ralph Macchio looks too tall besides Pat Morita this time, his face looks like he's on prednison and he's acting like he's on energy drink the whole time. His female sidekick cannot act at all and is just throwing out her lines as if she's reading it from a card. Pat Morita's 'karate skills' are really bad and the difference between his portrayal as Mr. Miyagi and Fumio Demura's portrayal in the action scenes is way too obvious. Pat Morita's alcohol problems show through his performance really bad this time.\n\nThere is no character development, but in reverse. These portrayals look like a degeneration compared to the characters in the first two movies.\n\nOther characters are untrue, unconvincing and way too stereotype to accept. Everything seems rushed, unpracticed and amateuristic. Martin Kove's presence is an insult to this gifted actor.\n\nNobody asked fort his movie and it was never necessary. But it wasn't as bad as 'The Next Karate Kid'."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "askeland89",
        "review_rating": "3",
        "review_title": "Cobra Kai made it more relevant than it deserves to be",
        "review_detailed_main": "While I do love Cobra Kai, I don't love this. Terry Silver aka the villain is a poorly written character and he does not belong in this movie, or any other movie for that matter. He's only purpose for existing is for the viewers to hate him. There is no motive behind his actions, he's just being an a-hole for the sole purpose of being an a-hole and that's it.. And I always knew Creese was a rotten egg but at least he had a purpose.. They dumbed him down in this movie, he went from being one of the most iconic villains of all time to this.. Can't praise Daniel either, every one of his actions during this pathetic excuse for a movie was completely out of character and he had nothing in common with the Daniel we knew from the previous movies.. Miyagi behaved somewhat consistently but it's not enough to save it.\n\nI'm giving it 3/10 and that's about as generous as I can be. Honestly there is nothing likable about this movie.."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "politicalnewage",
        "review_rating": "8",
        "review_title": "Come on",
        "review_detailed_main": "The Karate Kid III is where the franchise really starts to break its own rules of believability, and it's hard not to call out the nonsense. Mike Barnes absolutely wipes the floor with LaRusso. He toys with him, manhandles him, and makes Daniel look like a kid who wandered into the wrong dojo. Yet somehow, LaRusso snags the win. How? Why? It doesn't add up. At this point, the underdog story isn't inspiring...it's frustrating.\n\nThen there's Karate Kid II. Chosen should have ended Daniel in about two seconds flat. We're talking about a guy with real stakes, real killer instinct, and Daniel still somehow \"wins\" by slapping his way through the fight with those ridiculous drum moves? Come on. The kid's luck is becoming legendary to the point of absurdity.\n\nAnd then with Cobra Kai. Terry Silver? That guy is a monster, ruthless, skilled, and always three steps ahead. He destroys Chosen, a man who already proved he could obliterate Daniel without breaking a sweat. Yet somehow Daniel beats Silver at the end? Not happening. Johnny Lawrence, too, let's be honest, would wreck LaRusso in a fair fight every single time. The writers threw in that little \"tie\" to keep the peace, but it's a stretch. Johnny's got grit, skill, and decades of fighting under his belt. Daniel has... what, Mr. Miyagi's ghost on speed dial?\n\nThe bottom line..The Karate Kid franchise works because people love the underdog story, but by Karate Kid III and into Cobra Kai, the victories start feeling more like fantasy than triumph. LaRusso should've lost and often. Let the guy struggle. Let him grow. Instead, he's pulling out wins that make zero sense, while far superior fighters like Barnes, Chosen, and Silver get shortchanged. It's a tough pill to swallow for fans who actually respect the martial arts aspect of the franchise."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "shelbythuylinh",
        "review_rating": "5",
        "review_title": "Really Not a Good Conclusion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Ridiculous Entry in What Used to Be a Good Series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jordanaguilar",
        "review_rating": "4",
        "review_title": "A masterpiece of American Cinema (sigh)...",
        "review_detailed_main": "You have to take this movie with a grain of salt. Purely unbelievable on some parts, KK3 is not nearly the movie of either part I or II. However, if you liked the first two you will enjoy the third. Terry Silver provides plenty of one-liners, but that alone cannot make up for the deficiencies of plot and script. This series should have ended with part II."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "pmtelefon",
        "review_rating": "5",
        "review_title": "Fine for ten year olds",
        "review_detailed_main": "\"Karate Kid Part III\" is a good movie for very young audiences. I think kids around ten years old will really enjoy this movie. I think movie was actually made for that audience. The story, characters and action all seem to be aimed at younger people. There's nothing wrong with that. It's just that I haven't been ten years old in 46 years. This movie does a get a demerit because it wastes Mr. Miyagi. Miyagi is a great character but in this movie he's given very little to do. Overall, \"Karate Kid Part III\" is an okay watch but it's not nearly as good as the first two in the series."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "gettodamoofies",
        "review_rating": "5",
        "review_title": "\"Now the real pain begins, Danny-boy.\"",
        "review_detailed_main": "FILM: 5/10.\n\nI wrapped up a watch of The Karate Kid: Part III, and unfortunately it falls even further in quality than the second entry. Martin Kove's Kreese is back, plotting his revenge on Daniel and Mr. Miyagi, but once again, he's underutilised. Instead, the focus shifts to an ex-student of his who's a sociopath, and it feels like a direct-to-video sequel.\n\nThe plot takes some ridiculous turns that consistently divert the action away from karate. The training montages are awkward and only serve to highlight the fighting superiority of Thomas Ian Griffith's, Kove's, and Sean Kanan's characters. Speaking of their characters, they often come across as hilariously stereotypical, and on some occasions, they're literally laughing like comic book villains.\n\nOne of the most disappointing aspects is that Macchio and Norita's relationship is sidelined, and it lacks the spark of the original. Macchio, who's now 28, doesn't convincingly portray a 19-year-old teenager. His fighting scenes feel lackluster, and it's hard to buy into his abilities.\n\nAs for the tournament finale, it's an embarrassment. The excitement and tension of the previous films are noticeably absent. Instead, it comes off as forced, uninspired, and amateurish.\n\nIn the end, The Karate Kid: Part III fails to recapture the magic of the original. It's a forgettable addition to the franchise, with a plot that meanders and characters that lack depth. While it's always great to see familiar faces like Daniel and Mr. Miyagi, this entry doesn't do justice to their legacy. If you're a die-hard fan, you might want to give it a watch for the sake of completion, but don't expect it to live up to the first film.\n\nFORMAT: 4K Ultra HD Blu-ray\n\nVIDEO: 8/10.\n\nNative 4K presentation, Detail level: Good, Colour reproduction: Excellent, Level accuracy: Excellent, Encode: Excellent, Master condition: Good\n\nAUDIO: 8.5/10.\n\nDolby Atmos audio, Dialogue reproduction: Excellent, Soundtrack & effects clarity: Excellent, Dynamics: Excellent, Surround sound presentation: Good, LFE content: Good\n\nMOOFIEMETER: 5/10."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "kevin_robbins",
        "review_rating": "5",
        "review_title": "The storyline for this isn't as well done as the previous film and seemed a bit forced.",
        "review_detailed_main": "The Karate Kid Part III (1989) is a movie my daughter and I recently watched together on Netflix. The storyline follows Mr. Miyagi and Daniel as they return home from Okinawa in the previous film and look to take their next big step in life, which includes them taking Daniel's college money and opening a business with Mr. Miyagi. Unfortunately for them, their days facing the challenges of local rival Cobra Kai are not over as their franchise owner will now come down on them for dishonoring their name. This movie is directed by John G. Avildsen (Rocky) and stars Ralph Macchio (The Outsiders), Pat Morita (The Karate Kid), Thomas Ian Griffith (Vampires) and Robyn Lively (Wildcats). The storyline for this isn't as well done as the previous film and seemed a bit forced. The intensity and fight scenes were a little more intense than the previous films and was uncomfortable at times. The villain was definitely the most evil of all of the films and the cast was definitely well selected for the storyline. There's still some good metaphors, lessons learned and dialogue in this, but this wasn't as well thought-out and seemed a bit forced at times. Overall I would say this is fairly average and I would score it a 5/10."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "quirozcoupe",
        "review_rating": "8",
        "review_title": "Broken noses",
        "review_detailed_main": "I don't know what the hold up is.... I liked it. Mean, what beats broken noses, Daniel stepping outside of the box, a new villain in town, and a fresh look at the fact that \"Mr. Miyagi\" ain't the only teacher around.\n\nOn top of that...Does this guy HAVE a 1st name or is ALWAYS Mr. Miyagi? Even to his ONE karate student?? Can we say...... Precocious."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "asd29",
        "review_rating": "5",
        "review_title": "A rehash of the original thats lazily written and directed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "SPZMaxinema",
        "review_rating": "8",
        "review_title": "Oh come on...it's not THAT bad. In fact, it's GOOD!",
        "review_detailed_main": "This movie is filled with drama and intensity and I think it's really good. And of course Cobra Kai makes it better. This should've probably been Karate Kid 2 but the 3 villains in this movie are well-acted, intimidating, and out for revenge. Daniel also has an important character arch that he goes through with his Karate and I really honestly don't get the hate for it! It had a plot that's engaging, good character moments, emotional scenes, and good fights toward the end as well! Give this a rewatch and then watch Cobra Kai, I'm sure it will definitely enhance your experience! People are so harsh on movies."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "billy_bass",
        "review_rating": "10",
        "review_title": "Best of the series and best movie in general!!!!",
        "review_detailed_main": "This movie is great. Ralph Macchio brings it and so does Pat Morita. John Kreese comes back to kick some butt and this time he has the help of \"as bad as he wants to be\" Terry Silver.\n\nThomas Ian Griffith gives one of the greatest performances ever captured on film.\n\nThis movie also contains other classic villains such a Snake (You know it!) and Karate's bad-boy Mike Barnes the tournament terror.\n\nA lot of jerks try to say this movie isn't any good but they obviously have no taste.\n\nThis is better than Jaws even.\n\nI would tell anyone to buy this movie because you will want to watch it over and over again.\n\nA true American classic."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "DunnDeeDaGreat",
        "review_rating": "9",
        "review_title": "Not as bad as the reviewers would have you think but not as good as the first two",
        "review_detailed_main": "The Karate Kid III isn't as bad as all the reviews but it's no where the levels of the classic first two. I think with the plot of this film more action would have been required. Daniel comes off as a jerk this time around but I personally wanted to see Daniel fight some more. Thomas Ian Griffith is good as Terry Silver though he has some good one-liners. But Mike Barnes is a horrible villian. All in all the formula is lost."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Grrrendel",
        "review_rating": "10",
        "review_title": "Absolutely right!",
        "review_detailed_main": "KK3 is the BEST of the series, no doubt. It may even be the BEST martial-arts movie ever filmed, because it's a movie about martial arts and real martial artists; not just a bunch of violence-loving machos, unbelievable kickin' combos and no-plot-please-who-needs-it.\n\nI liked the way that Macchio's character develops over the films, specially in this one. After all, he's a teen, and he wants to win again. He wants to compete again, attracted by fame, physical power and the possibility of earning the respect of his peers. Or so he believes.\n\nMiyagi's refusal to train him makes him closer to this \"dark side\" of martial arts, just like a fallen Jedi Knight :)\n\nOne more thing: have you noticed the utterly strange (for an 80's teen movie) absence of a girlfriend to Macchio? Oh, sure, there's one, but she dissapears in mid-movie to go see her real boyfriend, and doesn't appear at the climax. Doesn't appear anymore."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Angelus2",
        "review_rating": "8",
        "review_title": "\"Now, Miyagi teach you\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "OfficialCoachDanny",
        "review_rating": "9",
        "review_title": "It's one of those guilty pleasures",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "thegreatscott",
        "review_rating": "",
        "review_title": "Doomed if the did and Doomed if they Didn't",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jeffreyrobillard",
        "review_rating": "10",
        "review_title": "AWESOME FILM",
        "review_detailed_main": "The greatest Karate Kid sequel is an improvement over 2 but still lacking the heart that part 1 contained. Ralph Macchio was superb in his final performance as Daniel. He was a little fatter, older(27), and wiser. So wasn't Morita as well. The villains were top notch with Kove and Griffith doing a great job as evil Vietnam vets who want strictly revenge on the old slope and that punk kid. MIKE BARNES was awesome. The greatest challenge Daniel has ever faced. BARNES was better than Johnny in part 1 and Chozen in part 2. MIKE BARNES I think made this sequel turn out so good. HE WAS AWESOME. His karate was great while Daniels was a joke. I give Karate Kid Part III **** out of ****"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "MacFlux",
        "review_rating": "",
        "review_title": "Not bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "hazrow",
        "review_rating": "10",
        "review_title": "review of the karate kid part III",
        "review_detailed_main": "This is one of my all time favourite childhood films of the 80's.\n\nActually,my kids are sitting watching it this very minute and they love to too!\n\nI never get bored of watching it even though it's been at least once a week recently and neither do they!\n\nRalph is just to die for in this movie just ask any thirty year old female. Ha, ha!\n\nAlso each time I watch I still get butterfly's in my stomach at the big fight at the end.\n\nThanks for making such a trio of memorable movies as the karate kid trilogy.\n\nCheers!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Dale86",
        "review_rating": "10",
        "review_title": "Excellent Movie! The best of the series!",
        "review_detailed_main": "The Karate Kid 3 is an excellent movie, with Daniel facing the most difficult opponent he has ever come across. It is filled with plenty of karate, and is very dramatic. The best scene comes towards the end when Daniel goes to the dojo to tell his teacher that he will not compete. That's when his teacher brings out the opponent. It is a superb film. Don't let this one pass. It's better than the first two entries."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "twanster-97655",
        "review_rating": "8",
        "review_title": "Brilliant but..",
        "review_detailed_main": "I rewatched all the karate kid movies after watching cobra kai and loved them as much today as I did back in the 90s when I first saw them. My only disappointment with the 3rd movie is that they didn't cast the original cobra kai students (tho I know back then they didn't think there would be a follow up) and the other problem is the ending. I know they anticipated a 4th movie with Daniel-San but because he didn't sing on for the 4th, the ending for no3 is really disappointing,it litterly just ends... 1,2,3 are just brilliant to watch and now that cobra kai is here it really is worth watching them again."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "blstravlr2",
        "review_rating": "10",
        "review_title": "Always Great any Karate Kid",
        "review_detailed_main": "Of course the original was the best but the whole series was great any one who post negative stuff probably was not even born or was a kid when it came out lol morons very good movie the return of Kreese And Cobra Kai....."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "warriorytx",
        "review_rating": "9",
        "review_title": "Severely underrated",
        "review_detailed_main": "This movie is severely underrated Thomas Ian Griffith as Terry Silver is the best part of this movie, he genuinely makes me believe he wants to kill Daniel, But, his performance was so chaotic they stopped making Karate Kid movies. If you do so well in a movie that you get the series cancelled that's just wow."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "brezac2000",
        "review_rating": "10",
        "review_title": "Part 3, really has bad as you think? Naw it was pretty good. READ",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Ironic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "sting99-2",
        "review_rating": "9",
        "review_title": "The best in the series",
        "review_detailed_main": "This is truly the best in the series.I would suggest you buy this movie cause this is 1 of those movies you gotta see again and again.It had all the drama and alot of good acting.This movie should have definatly won a award.I give this movie a 9 cause it finished off the best.Its better then the first because the ending wasnt all that great.But the first one is also a classic.Ill reccomend everyone see this movie you wont be dissapointed!"
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "CriticsVoiceVideo",
        "review_rating": "8",
        "review_title": "Not the worst.",
        "review_detailed_main": "Definitely the weakest of the three but not too far from the first two films. It's fine."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mantua-12347",
        "review_rating": "10",
        "review_title": "Don't say lose Daniel!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "ShunLi",
        "review_rating": "10",
        "review_title": "Cool Movie in all (some spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "spauli1",
        "review_rating": "9",
        "review_title": "I saw this film.",
        "review_detailed_main": "I saw this film, and I really liked it. Someome wrote that they thought Daniel had not learned anything from Mr. Miyagi. I totally disagree. I think he learned a lot, but that he thought he could do better alone. He finally learned in the end that it took Mr. Miyagi's help in winning.\n\nSomeone also wrote, \"Daniel ought to be a man's man by this film, but he still walks like a girl, he talks like a girl, and BY GOD he still FIGHTS like a girl!!!\" How are they supposed to fight? I think that he fought quite well, and that he was a \"man's man\" in every way.\n\nI really enjoyed this film, and would recommend it to others."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Rainey-Dawn",
        "review_rating": "8",
        "review_title": "Not Bad - Rather Fun",
        "review_detailed_main": "I'll admit it. I'm a sucker for Daniel son and Mr. Miyagi so I did enjoy the film. Their old enemy Kreese returns with help to get revenge on them. Really enjoyed some of the corniness of the film.\n\nRalph Macchio said that he really wasn't happy with this 3rd film but happy it did help to inspire the Cobra Kai series.\n\nGuys, if you like just good fun and revenge stories then give this one a shot!\n\n8/10."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "BlueSkies765",
        "review_rating": "10",
        "review_title": "The saga continues",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Jordan_Haelend",
        "review_rating": "",
        "review_title": "The film failed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "justinericmaclean",
        "review_rating": "8",
        "review_title": "Better than what others are saying...",
        "review_detailed_main": "This was a great movie! The 2nd Karate Kid was HORRIBLE, snoozefest.\n\nCome on Cobri Kai John Kreese wanting revenge.\n\nReturn to the All Valley Tournament to defend title.\n\nIt's a LOT better than what people are saying... (In my humble opinion)."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Big Jon-2",
        "review_rating": "",
        "review_title": "Chop-sucky",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "Rodrigo_Amaro",
        "review_rating": "8",
        "review_title": "Highly enjoyable for those with patience to see it",
        "review_detailed_main": "Totally honest here but I was expecting a sour, trashy kind of experience as most people made out to be. I actually had a nice time with this third entry of \"The Karate Kid\" series that I kept avoiding all of these years. Nostalgia hit hard when remembering that the franchise used to get repeated afternoon airings on TV in here, and I was like \"why not?\". Yet, it's easy to understand the backlash this entry has since it's almost a carbon copy of the first (and the best) film with its teachings and some purpose of everything, but instead of a class act with many thrills, humor and great fights, this one offers an over-the-top view on almost everything it tries to do that navigates between hilarity, camp or annoying - depends on the kind of humor and the kind of person you are. But I had a great time with this one.\n\nDaniel LaRusso (Ralph Macchio) is still one of the most annoying heroes of all time but also a true icon from the 1980's. He returns with his grandmaster Mr. Miyagi (Pat Morita), to establish a new bonsai shop for the old man, as the younger one was supposed to enter college. But Cobra Kai dojo owner (Martin Kove) is fallen on hard times with the place's closure (for known obvious reasons), and along with a Vietnam War veteran buddy of his (Thomas Ian Griffith), a smug and over-confident businessman who also knows about karate, create a masterplan to defeat Daniel in a new tournament and humiliate Miyagi.\n\nThe rich man develops a double plan by pretending to help Daniel as his unorthodox training (after Miyagi refuses to help Daniel), at the same time he's the sponsor of Daniel's opponent Mike Barnes (Sean Kanan), your usual bully, killing looks/fighting machine kind of guy. He's so over-the-top and so one-dimensional with everything yet he's fun to watch; Griffith and his diabolical killer smile is so effective that even though we're programmed to hate the character, we end up loving. We don't those kind of villains anymore.\n\nIf there's one admirable note about \"The Karate Kid: Part III\" is how the script made the female character (Jessica, played by Robyn Lively) a friend of Daniel rather than a love interest. It's a rarity when it comes to 80's flicks, and a quite honorable one as it escapes the cliche that attractive men and women with mutual interests must date at a given time, and just friendship is impossible.\n\nWhat prevents this one being a better film is the series of challenging situations faced by the major heroic characters, which made the bad guys a lot more ejoyable despite all of them being one similar note. The whole chase after the rare bonsai on the waterfall, or the several attempts on convincing Daniel to enter the tournament, are a little lame. Even Mr. Miyagi felt a little erratic and slower than his usual. Daniel is always annoying and whiny.\n\nOn a depper different level, I was hooked by the different and painful training Daniel faces with Silver, a complete contrast to the more peaceful, almost spiritual teachings of Miyagi. A small but poignant view on the extremities of what is valuable and acceptable when it comes to fighting, winning and learning, and the drastic differences between the use of force in a respectful manner over pure hatred and contempt over an opponent. And the lesson? To find where your karate actually comes from.\n\nYet, it resonates with the same ideas from the previous films related with a teenager who takes a great time to actually learn about life and karate, always restless and not exactly thinking things through. Again, always entertaining. 8/10."
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "31416-1",
        "review_rating": "",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "stephenchase-63504",
        "review_rating": "10",
        "review_title": "Begging for fun!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "jaws!",
        "review_rating": "",
        "review_title": "second best in the series!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "What happened?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0097647",
        "movie_name": "The Karate Kid Part III",
        "movie_rating": "5.3",
        "review_username": "mack3175",
        "review_rating": "",
        "review_title": "Ralph Macchio what were you thinking",
        "review_detailed_main": ""
    }
]