[
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "arslanmna",
        "review_rating": "6",
        "review_title": "Yadav takes the bakery",
        "review_detailed_main": "A light family entertainer which contains many good laughs. The real star of Chup Chup Ke is Rajpal Yadav. He makes one choke with laughter. Surprisingly full mileage is not taken out of the roles of Paresh Rawal and Om Puri. Kareena looks stunning , ravishing and lot of ...ings and her chemistry with Shahid works for the movie. Now a few bad points. Shahid carries his role single dimensionally. Chup Chup Ke is a movie in which many people are surplus to the requirement. Neha Dhupia is wasted and so are Anupam Kher, Sushma Reddy, Om Puri and Paresh Rawal. Asrani and Shakti Kapoor are just a shadows of their former selves. Sunil Shetty looks tired and type casted. But the biggest let down is casting of Om Puri as a Gujju. Sushma Reddy looks unpalatable sans make up."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "BiswajitSince2005",
        "review_rating": "7",
        "review_title": "Ssshhhhh........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "Dream_Woman",
        "review_rating": "6",
        "review_title": "Funny film!!!",
        "review_detailed_main": "This is a really nice film to watch with your friends and family, i mean when i first saw this movie i really liked it and i would watch it again.\n\nShahid Kapoor is a great actor, he should do films with Akshay or maybe Salman Khan, he is very talented and was very funny in this film, and not to mention he is the next best danced to Hrithik Roshan. Kareena Kapoor was very good in the film, even though i am not a big fan of hers she is very talented and can go far in her career, that is if she picks the right roles. I also liked Anumpam Kher and Shakti Kapoor too also, they were very funny in the film.\n\nThe music is very good in the movie, my personal faves were \"Dil Vich\" and \"Hare Hare\"i really recommend it to everyone."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Enjoyable fare!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "ayushparasar",
        "review_rating": "7",
        "review_title": "The legend of Rajpal Yadav",
        "review_detailed_main": "Yup, this movie is and will be remembered for Rajpal Yadav.\n\nI could not stop laughing in the first half of this revisit.\n\nParesh Rawal, Shakti Kapoor & Late Shree Om Puri as usual did great job.\n\nThe movie has a decent plot with enough elements of chaos, but sadly the love story of Shahid & Kareena feels a stretch and unnecessary.\n\nAnd Sunil Shetty's character has got anger issues..."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "shovonbhattacharjee",
        "review_rating": "7",
        "review_title": "Good flim",
        "review_detailed_main": "This Flim shows us comedy and manything. I really enjoyed a lot."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "springsunnywinter",
        "review_rating": "10",
        "review_title": "Extremely funny and emotional",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "ravibigsun",
        "review_rating": "7",
        "review_title": "First half is amazing",
        "review_detailed_main": "Humour in first half is more than 10 on 10, kareena (with Neha dhupia) and Sunil Shetty bring down the movie with their sub par performance. If it would have just been a comedy movie would definitely would have gotten higher rating.. Across 10-15 years always used to miss the start and end of this movie despite repeated watch on TV. Finally saw it in 2021 in one sitting."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "sushantbehere-61672",
        "review_rating": "10",
        "review_title": "JABBA 😂",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "eternally_screwed89",
        "review_rating": "6",
        "review_title": "Comedy or Drama?",
        "review_detailed_main": "Being a Priyadarshan movie, everybody must have expected a comedy caper. Even i thought it was a comedy movie until the end when there was no 'hungama' with all the actors running around. Priya's trademark style.\n\nThe film was okish. The story was decent. But for a Drama subject, i don't see why there were so many unwanted characters. It makes one confused at some point in the movie.\n\nThe performance were okish by everyone except Paresh Rawal and Rajpal Yadav who were outstanding as always. Shahid Kapoor has a long way before being called a good actor. Kareena Kapoor had a surprisingly small role which she surprisingly performed well enough and she looked very cute and......reddish. Neha Dupia was good too.\n\nCatch this on a DVD and watch it with family. Its a clean movie."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "xpics",
        "review_rating": "5",
        "review_title": "The good news is that Kareena Kapoor doesn't talk in this film. The bad news is that everyone else does",
        "review_detailed_main": "The good news is that Kareena Kapoor doesn't talk in this film The bad news is that everyone else does\u0085 the problem is that they don't just talk but shout, scream, shriek, screech and yell.\n\nChup Chup Ke continues Priyadarshan's stint with loud comedies. The good news is that this Priyadarshani film has a story to narrate (unlike Garam Masala). The bad news is that this time again the story is a Hindi adaptation of a Malayalam film named Punjabi House (unlike Malamaal Weekly that was his only original Hindi attempt)\n\nHowever the story is interesting enough. Jeetu (Shahid Kapoor) is drenched in debts that he is unable to payback. So he attempts suicide by jumping in the sea only to be caught in the net of fisherman Bandya (Rajpal Yadav). Bandya's master Gundya (Paresh Rawal) in turn has taken heavy loans from Prabhat Singh Chauhan (Om Puri). As a loan security, Gundya keeps Jeetu as a deposit at Chauhan's house, who fakes to be a mute and deaf guy. Chauhan's niece Shruti (Kareena Kapoor) who is actually mute falls for Jeetu. Confusion seeps in the story when Jeetu's ex-fiancé Pooja (Sushma Reddy) comes into picture.\n\nThe good news is that Priyadarshan's brand of humor is not as bland or slapstick as David Dhawan's recent films. The bad news is that it's not as credible or tongue-in-cheek as a Hrishikesh Mukherjee or a Basu Chatterjee film, either.\n\nThe movie starts with a bang getting straight to the point. The director doesn't waste time in establishment of the characters. Right from the first scene, the story of the film keeps moving ahead, thereby keeping your interest alive. Priyadarshan doesn't experiment with the treatment of humor though, going on with his trademark style of comedy. The characters play out loud and to the gallery. Another problem with the Priyadarshan brand of comedy is that he stretches the humor in a scene a bit too much and doesn't know where to stop, thereby making it repetitive and monotonous at times. However thanks to some well-written scenes and Neeraj Vora's dependable funny one-liners that range from the witty to the corny ones, the film does succeed in making you laugh.\n\nOne more bone of contention is that the genre of the film is not just focused at being a comedy. That lasts for the first two hours after which the genre shifts towards drama. After a good dose of laughter in the first half, you don't feel like changing moods with the subsequent on screen emotional outbursts. And while Priyadarshan handles the comic portions of the film in a larger-than-life manner, his treatment of emotions is very much natural. (Not many might remember Priyadarshan as the director of touching emotional films like Gardish, Virasat and Sazae Kala Paani much before he molded himself as a comedy specialist). Conversely, how one wishes it were just the opposite in this film i.e. the comedy to be more natural while one could overlook the heavier side with some passable artificial emotions.\n\nThe fluctuating genres very much remind of Priyadarshan's Hulchul that too turned intense in the last one hour. Moreover the family setting and characterizations of Suniel Shetty and Kareena Kapoor seems to be directly derived from Hulchul.\n\nPriyadarshan has a standard team of actors like Paresh Rawal, Rajpal Yadav, Om Puri, Asrani, Manoj Joshi and Suniel Shetty with whom he extracts fine work. Paresh Rawal is getting repetitive though you love to see him repeat the act. From being a serious actor, Om Puri has already made a transition into the comedy arena with élan. Rajpal Yadav yet again goes over the top, but somehow in this film, this actor steals the show amongst others thanks to the best scenes and lines that he gets. His timing and expressions add to the effect.\n\nLike his team of actors, Priyadarshan also has a standard team of technicians in his film like cinematographer Tirru and art director Sabu Cyril. Sabu repeats the typical pillars-in-the-garden set design for the song sequences. The white color in costume designs is consistently maintained throughout the film to impart a pure look to the frames.\n\nThe good news is that Himesh Reshammiya composes the music of this film. The bad news (for some) is that he even sings some of the tracks here.\n\nAmongst other actors, Shahid is quite efficient. Kareena looks gorgeous and since she doesn't have to mouth a single line in the entire film (not even in a dream sequence), you are saved by her otherwise over-expressive dialogue delivery skills. In fact Neha Dhupia gets more scope and she makes the best use of it. Sushma Reddy is restricted only to some 4-5 scenes. Suniel Shetty is getting typecast in these kinds of roles playing the aggressive and protective brother. Soon he might become a substitute for Jackie Shroff.\n\nOverall, Chup Chup Ke isn't as silent as the title suggests. However despite it's loose (or loud) ends, it still manages to be a good family entertainer."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "Hunky Stud",
        "review_rating": "9",
        "review_title": "the funniest movie i have ever seen! best ever!",
        "review_detailed_main": "I have seen plenty of the Indian movies, almost all of them are about young men and women trying to get married. This one is a little similar, however, this film is so very funny. I had to rewind some scenes just to laugh again. I have never seen a film that made me to laugh so hard.\n\nBest of all, those funny scenes don't seem to be contrived. they are so natural. The actors are so good at it. Rajpal Yadav was the best. Indian movies tend to be more than two hours long with an interval. Most of the films lost its momentum in the first part. I very much enjoyed this film, I actually didn't mind that this film was so long, because they keep showing funny scenes one after another.\n\nIf you haven't seen it yet, you should definitely watch it. It will make you laugh so hard. Too bad, the storyline is mostly fit with the Indian society. Otherwise, I totally hope that Hollywood can make one based on this.\n\nShahid Kapur, he can really dance. there was one close up scene showing his teeth, he needs to see a dentist to fix his teeth. I suggest that he should use electrical toothbrush."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "muhsinali-04842",
        "review_rating": "7",
        "review_title": "ending was not good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "RAW_Agent",
        "review_rating": "5",
        "review_title": "Great Story, Awful Remake",
        "review_detailed_main": "This movie is a remake of a Malayalam Movie Priyadarsan made several years ago. The Malayalam movie was genius. It had no trouble mixing comedy and drama. Proving that mixing these two genres is very much possible. Heck the Malayalam movie was so good any person who's watched it, would still stop whatever they're doing to get another glimpse of scenes from the movie if some scene from the movie happens to be played somewhere around them.\n\nSo why was this movie so much worse than the Malayalam version? Well, let's see what changed, shall we? Pretty much the only thing that changed, was the cast. Actors in the Bollywood version was so horrible, it's incredible. In fact, the only person who acted well in the movie was Kareena Kapoor. Shahid simply did not do a good enough job adapting to the character. Not to an extend that is expected of him, who's otherwise a brilliant actor.\n\nNot even the comedians were able to pull of the brilliant Comic breaks that was scripted for them.\n\nBollywood has evolved into an industry people seek to join for it's glamour, and nothing but the glam and money. These days, it only has a handful of good actors. While the rest are popular only due to glam and gossiping. Shameful!"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "abhi-16044",
        "review_rating": "6",
        "review_title": "OK film by Priyadarshan !",
        "review_detailed_main": "This movie is not like other Priyadarshan comedy all time hits. It is a time pass movie.\n\nComedy scenes are good but the movie overall is like a drama which drags and feels boring. Shahid Kapoor seems like not suitable for this type of role.\n\nThe only thing which will keep you watching is Rajpal Yadav and Paresh Rawal. These two are gems of bollywood comedy movies.\n\nOnly for them it's a 1 time watch !"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "divysingh-77794",
        "review_rating": "6",
        "review_title": "Comedy film or emotional drama 🙄",
        "review_detailed_main": "Just 2-3 comedy scenes was in the movie and rest is emotional drama."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "dhimanshu05",
        "review_rating": "10",
        "review_title": "A family entertainment",
        "review_detailed_main": "This movie is a complete entertainment of comedy and emotions. Perfect for family watch."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "babudimu",
        "review_rating": "6",
        "review_title": "Ending of the movie could have been better",
        "review_detailed_main": "I personally didn't feel right to leave pooja as widow for her lifetime ."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "nallaiah",
        "review_rating": "9",
        "review_title": "For the acting",
        "review_detailed_main": "Entertainer...hilarious comedy...evergreen movie eventhogh its a remake of the movie punjabi house (a malayalam movie)"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "Sherazade",
        "review_rating": "6",
        "review_title": "What a great concept! A mute Kareena who doesn't show up until after 95mins into the film! Va!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "sashank_kini-1",
        "review_rating": "4",
        "review_title": "Not such a good movie by Priyadarshan",
        "review_detailed_main": "I have loved Hera Pheri, Hungama and Hulchul by Priyadarshan because they had the humor that could make me laugh a lot. The jokes in these three movies weren't repetitive and the movie didn't dull down any moment. When I saw Chup Chup Ke with my parents, I kept laughing just because my father was howling in laughter and I fond the movie funny. But when I saw the movie alone again, I did not find it funny at all.\n\nParesh Rawal got too repetitive in his manners and behavior. Shahid was an epitome of over acting. He looked weird rather than humorous playing deaf and dumb. Rajpal Yadav kept playing his usual role as a side kick who is made to do a lot of silly acts. I liked Kareena's acting as it was natural and, thank god, she did not talk throughout the movie. While the Gujarati family, which had Om Puri and a couple of hundreds of people, really addled my mind. I don't think we have wrestlers in Gujarat who keep fighting. Its normally done in the North. And instead of playing Garbo, the family celebrates singing Hindi songs and dancing as if they are Punjabis. I mean, in the beginning, most of the members of the family are shown as if they do not know any Hindi, and in the second part, all are shown singing in Hindi.\n\nThe second half of the movie was terribly dragging as members of the family kept weeping all the time. The film had too many characters and so, it became a complete mess.\n\nOverall, it is a bad movie. So I give it a 4 out of 10."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "chetanrajkadam",
        "review_rating": "9",
        "review_title": "One of the best Priyadarshan movie...",
        "review_detailed_main": "It's not perfect but it's hilarious and enjoyable. Feel good movie. Cast like Rajpal yadav, Paresh Rawal, Om puri and Shahid did great job. Some scenes are so funny people just rewatch them on youtube. People are missing this kind of movies nowadays. Good old times."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "Biswas_",
        "review_rating": "7",
        "review_title": "A hilarious yet emotional sweet tale!",
        "review_detailed_main": "If you must know, most of the FB memes have been picked up from this film.\n\nThis Priyadarahan film too has a lot of giggles and laughs initially but not before things get a romantic and serious towards the end. The climax is not a typical Priyadarshan comedy climax as this film itself is not entirely a comedy genre but more of a romantic drama genre laced with comedy hence you get a serious drama ending rather than those comical mindless endings .\n\nThanks to the legend Neeraj Vora, the comical scenes are spot on! Priyadarshan was at his peak when this man was giving him company sadly he's no more. Priyadarshan must be genuinely missing him.\n\nThe film's cast has almost all the regulars of Priyadarshan film except Shahid Kapoor and Kareena . Kareena's role is unique as she has no dialogues as she is plays a mute girl. Rajpal Yadav however is the star of this film with the best comical scenes given to him. No doubt this man has been the go-to man for Priyadarshan in almost all his comedy films and this is followed by Paresh Rawal who also does a great job in his comedy. Suniel Shetty is in a more serious role here unlike other comedy Priyadarshan films . Rest others like Shakti Kapoor, Asrani, Anupam kher etc have done good.\n\nThe film does get a tad slow and boring when the comedy starts to fade out in the 2nd half. This is where the film kinda breaks apart but then it is made up in the climax."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "namashi_1",
        "review_rating": "4",
        "review_title": "Chup Chup Ka fails to grip!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "najmulbappy",
        "review_rating": "8",
        "review_title": "Super",
        "review_detailed_main": "This movie was really entertaining. I watched this movie uncountless time. Really love it very much."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "vedang-02968",
        "review_rating": "10",
        "review_title": "All time best",
        "review_detailed_main": "Best Film anytime you can watch very funny every dialogue you will remember them."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "mittalsaurabh-71311",
        "review_rating": "3",
        "review_title": "Actual Rating 2 but an extra for yhe mwmes bois.",
        "review_detailed_main": "DECENT COMEDY BUT VERY SPOW STORY. Some things are not making sense like grief and all with the \"widow\""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "hiteshguhe",
        "review_rating": "10",
        "review_title": "Still an entertaining movie.",
        "review_detailed_main": "I've watched this movie like 25+ times and i still dont get bored. The characters matches the cast perfectly and acting is on next level. Still no match for comedy. One of my favourite movies."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "AishFan",
        "review_rating": "4",
        "review_title": "Note to Priyadarshan: stick strictly to comedy!",
        "review_detailed_main": "Chup Chup Ke is a terrible combination of comedy and drama, definitely the two worst genres to mix. From experience, we can attest that Priyadarshan is an expert in comedy and definitely not in drama/romance (with the exception of Virasat). The opening scenes in the film are a turn-off to an audience expecting comedy as it involves a hurt family and Shahid's unsuccessful attempt at suicide, etc. If there's anything that keeps you in your seats its Rajpal Yadav along with Paresh Rawal. The two are comic geniuses and are the saving grace of this film. Kareena comes in much later in the film and has a small, but obviously very important role. Shahid and Kareena give good performances. Neha Dhupia was a bit disappointing. After some comedy, the movie once again shifts gears to a serious mood, and by that time the movie becomes a drag. Songs are lame except for \"Dil Vich.\""
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "shivamguroo",
        "review_rating": "8",
        "review_title": "Very good comedy movie",
        "review_detailed_main": "Pridrashan always makes a good cinema. Paresh Rawal & Rajpal yadav Nailed it. Also good shakti kapoor, mohan joshi , om puri. Main lead shahid&kareena and also sunil shetti camiyo"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "saritalikun",
        "review_rating": "10",
        "review_title": "It's awesome and one of my favourites.",
        "review_detailed_main": "It's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie It's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie. I t's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie It's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie.\n\nI t's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie It's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie.\n\nI t's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie It's awesome and one of my favourites.\n\nIt's too good movie and good source of laughter.\n\nIt's awesome and my favourite movie."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "g_aparna",
        "review_rating": "2",
        "review_title": "Chup chup ke - Affair with domestic helper",
        "review_detailed_main": "Story line- The hero is in love with Girl A. He meets her 'chup-chup ke' – hidingly....because the money lenders are after his life.\n\nThe hero is under heavy debts, he drowns and is picked up by a poor boat owner – who uses his boat for fishing. Anyway – the hero lands up in the house of a rich man. The rich family keeps the hero as their servant and since he was somewhat deaf and mute (but actually he was fine – just pretending to be deaf and mute so that he does not have to go back to his own locality where the money lenders will all jump on him!)they gave him small odd jobs to perform.\n\nIn the same rich and affluent family, there is a girl (played by sex-siren Kareena – who was actually just mute not deaf). So her cousin finds that a new domestic male helper has joined who is also mute! The love story starts! Wow! What an idea sirji!! Whoever has written this utter crap story! OK there is a twist in the tale too – no rich and affluent male was ready to marry Kareena because of her handicap! So all the family members were looking for a suitable groom ...and were unable to find one! Like..... Are you kidding me!? Such a rich female ..plus beautiful and fair too - who will get a huge dowry with her – Indian families with sons will fall at her feet and lick it for the rest of their lives! There are many such educated but not very well off families in India who would do anything for getting a bride from a rich family...watch Saavdhan India episodes if you have doubts! Anyways, she falls in love with the guy who was hired as a domestic helper in the family. Later the beans got spilled and the Girl A – with whom the hero was actually in love comes to now that he was alive. When she confronts him, it was already too late – he had accepted rich and mute kareena – who was obviously much prettier than the Girl A..and was about to marry her! I mean why wouldn't he – he would be able to live happily ever after as a rich man and will even get rid of the money lenders! Girl A was dropped as a dead fly from the milk! End of story Conclusion- I have often heard that there are families –rich and affluent – having huge palatial houses...make the servants render sexual services too! Like fatso wives...whose equally ugly and fatso husbands pick-up (call) girls from the streets for a 'quicky' – or even visit brothels or – if a wee bit more rich – then they book a hotel room and sleep with the females engaged in escort services.\n\nProbably this is the reason why kareena's cousin introduces her to the newly acquired helper...at least she could taste...love..making?...since no one was marrying her? Btw. The fact that the females of the house sleep with the servants, drivers, gatekeepers..etc. is known to the males of the family – it is a 'you are OK, i am OK' relationship – the males eff around outside the famels eff around inside...since they are cultured and ethical and traditional – they eff indoors and not hire gigolos! Problem happens when dull headed males watch such films – if they reach some such house- as domestic helpers - where females are sleeping around and game...then things are under control...but if such dumb fools reach a decent, righteous household and try to act fresh (the film after all showed the possibility of the daughter marrying the helper...so such concepts raise expectations as well huh)- then hell breaks loose!...the helper gets beaten by the men of the family first and then by the cops –and ultimately he gets the criminal label for the rest of his life!"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "shahrukhullahkhan",
        "review_rating": "8",
        "review_title": "Sweet film.",
        "review_detailed_main": "It's a sweet film. Comedy is great and story is also sweet, simple and emotional. Very underrated film though it got mixed reviews from audience and critics but I like it"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "sherlockholmes99",
        "review_rating": "1",
        "review_title": "Shame",
        "review_detailed_main": "Shame on Bollywood Remaking South Indian films and taking all the credits Better watch the orginal version with the help of subtitles 1000 Times better than this 💯"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "pratikkainbox",
        "review_rating": "10",
        "review_title": "Very Funny Movie",
        "review_detailed_main": "Rajpal Yadav do better very funny, comedy, romantic movie 🍿. Nice movie, Watch the movie must watch. 🤣🤣😂 Very comedy movie. Shahid Kapoor , Paresh Rawal, Karina Kapoor Khan, Om Puri, Sunil Shetty Very comedy movie."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "dxckjydk",
        "review_rating": "10",
        "review_title": "Best comedy movie till date",
        "review_detailed_main": "I'd still rate it a 9/10 in 2023. They don't make good comedy movies like this anymore. This is a family movie, nowadays people are selling nasty stories in the name of comedy. Priyadarshan should definitely come up with a sequel for this movie. The story had a good plot, and very good supporting actors who performed better than the lead roles. The songs were also a big hit back then and it's still not boring at all. Most old movies get boring after a point, especially when you're watching it in 2023 but this one doesn't bore you at all. Totally worth spending 3hrs on this movie! Please make it available on Netflix and Amazon prime too."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "sabooravi",
        "review_rating": "2",
        "review_title": "Worst movie by Priyadarshan",
        "review_detailed_main": "Unbelievable that this movie has a rating of 7. There are so many negatives that don't know where to start.\n\n1. Bad story.\n\n2. Very poor direction, how could Priyadarshan do this?\n\n3. Huge underutilised cast.\n\n4. Very very bad acting . Shahid doesn't know how to act.. unimaginable that a director like Priyam took him as main lead.\n\nGod is great and an old saying that \"Bhagwaan meherbaan to gadha pehelwaan\" fits perfectly on him. Near Zero acting skills but doing good even now. Sushma Reddy is poor and wasted. Rajpal Yadav has repeated the same act in so many movies that it is repeatative. Khatta Meetha, Bhool Bhulaiya, De Dana Dan, etc. Anupam Kher is wasted."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "sahebaazbanzara",
        "review_rating": "8",
        "review_title": "Must Watch!",
        "review_detailed_main": "It's one of the best Bollywood Comedies. In short, It's a must watch Comedy"
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "rishitchakraborty",
        "review_rating": "2",
        "review_title": "It is a cult classic......but......",
        "review_detailed_main": "Jokes are cliche......rajpal yadav is annoying.....typical Indian love story....and also kind of offensive towards disabled people.....Sunil Shetty is just the worst....the worst ..."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "nostalgicjoy",
        "review_rating": "9",
        "review_title": "Best Comedy",
        "review_detailed_main": "This is certainly one of the Best comedy movies ever made in Bollywood. I give it 9 iut of 10 for brilliant comedy, superb plot and outstanding acting by the actors specially Rajpal Yadav, Paresh Rawal and Om Puri."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "satrajitb",
        "review_rating": "8",
        "review_title": "Have such great comic lines.",
        "review_detailed_main": "I am a huge fan of Priyadarshan. I like almost all his movies mainly because of the comedy factor and great punchlines that are still remembered. Chup Chup Ke was also one of the best in terms of the comedy. The storyline is set in a Gujarati family. For that, some characters are written in a bit stereotypical way. Coming to the performances, Rajpal Yadav and Paresh Rawal were the ones who are remembered the most in this film. Such great actors they are. Even now also I laugh at their scenes from this film. Shakti Kapoor was also great in this film. Shahid Kapoor's character was too one-dimensional. Didn't find him that great in his role. Asrani and Om Puri - they did their parts well. Sunil Shetty looked tired and somehow typecasted(I found his acting same in Hulchul also). Kareena looked beautiful. Shahid-Kareena's chemistry was also a positive point of this film. Neha Dhupia had a meatier and impactful character than Kareena and she had done her role well. Sushma Reddy's role had a very limited screen time. Same goes to Anupam Kher. Songs are also great in this movie.\n\nOverall, an entertaining comedy movie you will really love it. It is frequently shown on TV or available in YouTube as well. Can check it out I have given 8 stars."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "bhavooksingh",
        "review_rating": "1",
        "review_title": "Absolutely pathetic movie",
        "review_detailed_main": "Movie start with wrong message, end with even pathetic."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "disharma-24131",
        "review_rating": "10",
        "review_title": "Chup Chup Ke is a light-hearted and enjoyable Bollywood comedy",
        "review_detailed_main": "Released in 2006, Chup Chup Ke is a Bollywood comedy film which is directed by Priyadarshan. Chup Chup Ke features a star-studded cast including Shahid Kapoor, Kareena Kapoor Khan, Suniel Shetty, and Paresh Rawal. The movie revolves around the story of a young man, played by Shahid Kapoor, who finds himself trapped in a web of financial debt. To escape his troubles, he fakes his own death and ends up in a small seaside town. There, he encounters various colorful characters and comedic situations that lead to a series of misunderstandings and hilarious chaos.\n\nThe film blends elements of romance, comedy, and drama, which are often characteristic of Priyadarshan's directorial style. It is known for its light-hearted humor, witty dialogues, and slapstick comedy sequences. The performances of the lead actors, especially Shahid Kapoor, received positive reviews for their comic timing and portrayal of their respective characters.\n\n\"Chup Chup Ke\" was generally well-received by the audience upon its release. It gained popularity for its entertaining narrative, catchy music, and dance numbers. The film's soundtrack, composed by Himesh Reshammiya, became popular with songs like \"Dil Vich Lagya Ve\" and \"Ghoomar.\"\n\nHowever, like any film, \"Chup Chup Ke\" also had its share of criticisms. Some viewers felt that the plot was predictable and the comedy relied heavily on slapstick humor, which might not appeal to everyone's taste. Additionally, certain aspects of the film, such as the pacing and exaggerated characters, received mixed reviews.\n\nOverall, \"Chup Chup Ke\" is considered a light-hearted and enjoyable Bollywood comedy that offers a dose of entertainment through its comedic moments, lively performances, and foot-tapping music. If you enjoy Priyadarshan's style of filmmaking and are looking for a fun-filled ride, this film might be worth checking out."
    },
    {
        "movie_id": "tt0464160",
        "movie_name": "Chup Chup Ke",
        "movie_rating": "7.0",
        "review_username": "bhupidafriend",
        "review_rating": "8",
        "review_title": "Hillarous, musical.",
        "review_detailed_main": "It's one of the Dinesh comedy of Priyadarshan.\n\nI am not if it's a copy or original movie.\n\nBut it's comedy it too good at every place.\n\nYou will hard find that the comic jokes kr dialogues not working. Every comedy scenes is amazing.\n\nHave a really nice music and songs.\n\nActing wise Paresh Rawal ang Rajpal Yadav are killing every scene by their expression and comic timings.\n\nOm Puri is also good to watch.\n\nIt also have some emotional scenes which are also impactful.\n\nGod know why we do not such more movies now where we can laugh and laugh more.\n\nShahid Kapoor is also did a good job.\n\nSunil Shetty is role is more of a sentimental brother which is been played nicely as well."
    }
]