[
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "Technically impressive and enjoyable, but somewhat forgettable too",
        "review_detailed_main": "This movie had a lot of potential. While technically impressive and very enjoyable with some genuinely funny moments, for some reason it falls short. Of course there are redeeming qualities, such as the fun music score by Danny Elfman, one of my all time favourite film composers and an amusing turn from Robin Williams. Also the special effects are greatly improved from the effects in the Absent Minded Professor, and Flubber who is so cute steals the show. The performances from Clancy Brown, Ted Levine and Marcia Gay Horden are entertaining, and Jodi Benson (who voiced Ariel in the Little Mermaid)is a delight as the voice of Weebo, whose death is absolutely heart-rending. However the story is very predictable, and offers few surprises, and the physical comedy was better than the patchy script which in places felt uninspired. That saying some of the physical comedy has strong hints of deja vu, and is rather hit and miss. Of course kids will lap it up, but adults probably won't like it as much. The second half of the movie is more meandering in quality compared to the first half, very little of interest happens and some of the situations come across as ridiculous. All in all, somewhat forgettable, but for a kids movie it is pretty entertaining. 6/10 Bethany Cox"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Pilsung89",
        "review_rating": "4",
        "review_title": "Not Williams' best role",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "daisukereds",
        "review_rating": "4",
        "review_title": "Quixotic Movie",
        "review_detailed_main": "A very basic and childish movie. It's fast paced, chaotic and nonsensical.. enough to keep the kids interested. As a grown up, it might make your eyes roll a few times.\n\nThere's not much to say other than it makes little sense, specially when the invention of a flying car comes AFTER the flying talking and sentient AI robot. Even as a Robin Williams film, this isn't particularly fun or worth a watch. Marcia Gay Harden and Christopher McDonald look too much like brother to make it awkward when they are \"romantically involved\". And the bad guy and plot are like 20 minutes of the movie. Wil Wheaton is hilariously bad (as he often is).\n\nI'm inclined to seek out and watch the \"Absent-Minded Professor\" (1961), since this is a remake of that (thing I didn't know until recently).. and looks apt for the time it was made. Which might explain why this 1997 adaptation doesn't work for me at all."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "Good possibilities that don't pan out",
        "review_detailed_main": "Phillip Brainard (Robin Williams) is the absent-minded professor. Chester Hoenicker (Raymond J. Barry) threatens to close the college run by his girlfriend president Sara Jean Reynolds (Marcia Gay Harden). He keeps forgetting to go to their wedding and she vows that this is the last attempt. His work with a new compound as an energy source can save their college. He has a mechanical assistant Weebo. His hated old partner Wilson Croft (Christopher McDonald) visits after stealing all of his ideas and now is after Sara. Chester's son Bennett (Wil Wheaton) is failing Brainard's class and he expected his father had already bought the grades. Chester sends his henchmen Smith (Clancy Brown) and Wesson (Ted Levine).\n\nThere are a lot of good possibilities that don't pan out. Weebo is not cute and a bit of an annoying jealous brat. There is an uncomfortable man-machine love story. Also he has a flying robot. HE HAS A FLYING ROBOT! That is probably enough to keep the college going. Professor Brainard is not lovable enough. Christopher McDonald is too good at being creepy and I can't buy anybody even liking the guy. MGH is not likable either. There are too many broadly unlikeable characters. The Flubber itself is fun for a little while and Williams has good imaginary chemistry with an imaginary object. It allows him to have some physical humor. Although it gets very repetitive. There is only so much Home Alone slapstick that should be repeated. It's also very stupid that people saw the basketball game without figuring it out. This should be funnier but it's not."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "ccthemovieman-1",
        "review_rating": "7",
        "review_title": "Fun Mainly For The Kids",
        "review_detailed_main": "This was a fun remake of \"The Absent-Minded Professor,\" with special-effects the main show here. We see and hear the following impossible things: inanimate objects become human (with feelings, no less!) and a flying computer called \"Weebo.\" Obviously, this is just a far-off story designs only for laughs (I know one person who actually took some of this stuff seriously.)\n\nDespite a bowling bowl repeatedly hitting someone in the head, it's a fairly harmless movie with no language problems, which is a rarity in a Robin Williams film. Robin is the \"absent- minded professor,\" in this \"Dr. Philip Brainiard.\" You can call him, \"Dr. Phil.\" There are one or two sneaky-vulgar lines but nothing much.\n\nWith the flubber-substance making balls bounce forever, into every object, you get a lot of slapstick scenes that are either stupid or laugh-out-loud funny. The story, geared a lot more for kids than adults, has a nice lighthearted feel to it. For adults, one viewing is plenty, but kids will enjoy it multiple times."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "SmileysWorld",
        "review_rating": "5",
        "review_title": "Great talent,dry story.",
        "review_detailed_main": "I admire Robin Williams.His quick,improvisational humor make him the most unique entertainer of our time.However,he does from time to time make bad choices,and Flubber was indeed a bad one,at least scriptwise.This movie's problem is not from bad performances,but from terrible writing,and that often makes the performers look bad.The intentions here are good,but the movie just fell flat in all aspects.If you want to see a movie about flubber,I would highly suggest \"The Absent Minded Professor\".It's a classic and it's much better."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "inkblot11",
        "review_rating": "6",
        "review_title": "Entertaining and visually impressive, the film nevertheless falls short of the joyous satisfaction found in the original AMP",
        "review_detailed_main": "Philip (Robin Williams) is a chemistry professor at a college with financial woes. On a side note, the school's president, talented Sara Jean (Marcia Gay Harden) is Philip's girlfriend and she is deeply disappointed that he has left her standing at the altar THREE times. Yet, Philip truly loves Sara. His problem is, of course, that once he is into an experiment, he loses touch with everything else in his life. The day Philip misses his third trip up the aisle of love, he discovers something big...that is, flying rubber or flubber. Knowing this could be the invention that turns the college's ledger into the black, he is eager to tell Sara of the news. Unfortunately, she won't talk to him and is receiving the attentions of a rival chemistry prof at a nearby university. It is this rival's intention, along with a host of others connected to the school, to steal the rubbery substance for their own purposes. Will they succeed? This is a mildly entertaining film, mostly due to Williams star power and the spectacular visual effects the movie offers. Flubber, indeed, takes on a green personality not unlike the Pillsbury doughboy and bounces all over the place, causing much fun and havoc. There is also a tiny robot-computer, living with Philip, that is very appealing. Add on the eye-treat of flying cars and basketball superduper jumpshots and you have a technically impressive film. Yet, somewhere along the way, a bit of the original film's soul and joyous freshness is lost. No, its not the fault of the talented Williams, Harden, Christopher McDonald or the other cast members. They are quite fine. There are also some laugh out loud scenes, such as the one where Professor Philip starts giving a lecture, not noticing that he is in a figure drawing class, or the ones where a neighboring boy, quite rightly fears, to his father's consternation, what is outside his window when flubber is out and about. In summary, the film's problem is probably a case of trying too hard in the special effects category and not enough in the remaining aspects of film making. Even so, it is not a stretch to say that most families will like Flubber, as everyone will be amazed by the stunning look of the movie."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "JamesHitchcock",
        "review_rating": "5",
        "review_title": "When your most interesting character is a computer, you've got problems.",
        "review_detailed_main": "\"Flubber\" is based upon that old comedy cliché, the absent-minded scientific genius. The central character, Professor Philip Brainard, is a brilliant inventor who has not only invented a robot that will do the housework for him but has also cracked the artificial intelligence problem by producing Weebo, a computer with its own personality that can not only talk to him but also fly. At present he is working on \"flubber\", a rubbery substance that will allow cars and other objects to fly through the air. For all his intellectual brilliance, however, his private life is so disorganised that he has forgotten to turn up to his own wedding to his attractive sweetheart Sara, not once but three times.\n\nThe plot turns upon Brainard's attempts to produce his flubber, which he sees as a solution to the financial problems confronting the college at which he teaches and of which Sara is the principal. (Like another reviewer, I found myself wondering why he didn't just try marketing his domestic robot or his talking computer, inventions which I thought would have had just as much commercial potential). Along the way, he has to fight off Wilson, the handsome but too smooth principal of another college who is his rival for Sara's affections, and a corrupt businessman who wants to use the flubber for his own selfish ends.\n\nThe film was clearly designed as a comedy for children, and works quite well as such, aided by a good deal of slapstick humour, mostly involving Robin Williams as Brainard. Unlike some children's films, however, such as the \"Harry Potter\" series, this one does not have much in it to keep adults entertained. Williams is clearly a talented comedian, but strangely enough, with a few exceptions such as \"Mrs Doubtfire\", he has been most successful in films with a serious purpose like \"Dead Poets Society\" or \"Good Morning Vietnam\", although even in these he often manages to find a use for his comic talents. In many of his comedies his talents just seem wasted. \"Club Paradise\" is an example, and \"Flubber\" is another. All the other characters, with one exception, just seem like stock figures with little individuality about them.\n\nThe one exception is Weebo the computer. The British computer pioneer Alan Turing devised what has since become known as the \"Turing Test\" for deciding whether a machine can be said to be intelligent. A human judge engages in a conversation with two other parties, one a human and the other a machine; if the judge cannot tell which is which, the machine is said to pass the test. Unfortunately, if the human involved were one of those in this film, Weebo would fail the test. She (Weebo has a female voice and personality) is smart, funny, sensitive and lovable, much more so than anyone else in the film, so it would be easy to tell them apart. And when your most interesting character is an electronic rather than a flesh-and-blood one, your film has got problems. 5/10"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "PyroSikTh",
        "review_rating": "6",
        "review_title": "It's a Live-Action Cartoon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Mort-31",
        "review_rating": "4",
        "review_title": "Bearable only for kids",
        "review_detailed_main": "A few good jokes, tolerable special effects, that's all. This film doesn't try to be a great piece of art, it wants nothing else than to entertain people, mainly children. And for children and also other people who don't think about it any longer, it's fun and therefore able to bring the producers a lot of money. For people like me, it rather hurts. A machine falling in love with a professor? Is that cute? A man who misses his wedding three times? Not really. Luckily, we're told in no uncertain terms that John Hughes is responsible for this: the \"Home Alone`-head-bangings come up again and again. And everybody's laughing...?"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "knightviper56",
        "review_rating": "10",
        "review_title": "Great kids movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "TeddySmashings",
        "review_rating": "7",
        "review_title": "LOVED this as a child.",
        "review_detailed_main": "I'm giving it a 7 because as a child it was an absolute 10/10 but can appreciate as an adult it wasnt the best probably a 6/10 so decided on 7. I think any child under 10 will be absolutely creased with laughing throughout."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Boba_Fett1138",
        "review_rating": "5",
        "review_title": "Still somewhat enjoyable as a kids movie but it had more potential really.",
        "review_detailed_main": "This movie really feels like a wasted opportunity. With so many talent involved, how could this movie turn out to be so disappointing? It probably is due to the messy script that uses too many plot lines that never get fully developed or that work out completely the way as they were suppose to. You can say that the movie feels incomplete. I don't know, were they in a hurry or something to complete this movie? I have a feeling that a month or two more work on the movie- and perhaps its script, would had made this movie a better one.\n\nIt's still somewhat decent entertainment for the kids. The characters should be enjoyable for them and some of the comical situations are good enough to make them laugh.\n\nRobin Williams is always fun to watch in a comedy but however in this case it feels like he's holding back to not completely play a nutty professor. It's perhaps a bit of a disappointing to most. When you know Robin Williams plays the lead role in a comedy you would expect some more fireworks and hilarious situations from him. His talent is wasted, a real missed opportunity for the movie to become a great one. Christopher McDonald plays a typical 'villainoush' Christopher McDonald role and he does it once more really great. Other well known actors in the movie are Marcia Gay Harden, Raymond J. Barry (boy, he's beginning to look really old now), Ted Levine and Clancy Brown. But none of the characters feel really developed well enough in the movie, with the exception of the robotic character Weebo. Of course it's not a very good sign when the best developed- and featured character of the movie is not even an human...\n\nAlso the use of 'Flubber' is highly below par. From a movie named \"Flubber\" I expected something more from the green slimy stuff. It however doesn't play a that significant role in the movie and the things that are done with the Flubber are far from original or interesting. The Flubber itself however looks fantastic through some early computer effects. Remember that this movie was released in 1997 when the special effects were of course not as advanced as present day is the case. The effects from this movie look great and really fully convincing. Too bad that it isn't featured very well in the movie.\n\nThe story is of course predictable from A to Z and the movie has absolutely no surprises in it. It makes \"Flubber\" a very easily forgettable movie that is far from great. The movie had far more potential really. If only that had made some better choices with its story and perhaps picked a different director...\n\nThe movie is good and professional looking, so from a technical point of view the movie does really not disappoint. Also the fun musical score by Danny Elfman makes the movie a watchable one\n\nThe kids will probably still enjoy it but still the movie feels like a big waste of some far more and greater potential, which the movie really had.\n\n5/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Mildly amusing kids film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "4",
        "review_title": "Flying Rubber",
        "review_detailed_main": "Disney got Robin William's who became popular in the 1990s with family entertainment films to remake the The Absent Minded Professor. Popular with kids at the time mainly because it was co- written by John Hughes who put some of his Home alone slapstick formula with two comedy henchman played by Ted Levine and Clancy Brown.\n\nWilliam's discovers discovers some kind of flying rubber which may save his college which is in a financial crisis. So excited he is with his invention that he forgets his wedding day for the third time. Why his bride to be could not make sure that in case he forgets, he is accompanied by two people to drag him to the church on time is anyone's guess.\n\nHis girlfriend who also happens to be the College Dean gets the attention of a love rival and a mobster wants the formula for flubber and sends his henchman to retrieve it.\n\nWilliams is assisted by an Artificial Intelligent flying robot called Weebo which strangely is not marketed by Williams to save the college.\n\nThe film is knockabout slapstick squarely aimed at kids and they will appreciate it the most. Adults will find the film too silly, flawed and simplistic."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "maddiebuggie",
        "review_rating": "7",
        "review_title": "Flubber review",
        "review_detailed_main": "I watched this movie when I was a kid. It was good from what I remember. But it wasn't a story a watched super much as a children. I loved that this movie was about a scientist. That was cool. I think everyone should watch this at least one in their life."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "d5witkow_99",
        "review_rating": "1",
        "review_title": "Painful and Droll",
        "review_detailed_main": "On a flight home from Japan the in-flight movies were Flubber, Home Alone 3, and For Richer or Poorer (starring Tim Allen and Kristie Allie). These are by far three of the worst films I have ever been subjected to. How I managed to see them all in one shot, I will never know. Luck I guess."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "mfellipecampos",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "Flubber - Uma Invenção Desmiolada is brilliant and relaxed from the 1961 remake of The Fantastic Superman! Phillip Brainard (Robin Williams) is a badly awkward inventor and tries everything to reconcile with his fiancee and save the city college, even though it's a movie it's not a big deal anymore it's good ... I don't understand Rotten Tomatoes put 15% approval of the film is good and I recommend watching it with your family will bring nostalgia and laughter."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Mister-6",
        "review_rating": "1",
        "review_title": "Fred MacMurray, where are you??",
        "review_detailed_main": "Words escape me. My jaw is on the floor. How can this be?\n\nYou want to see how NOT to make a kid's comedy? Watch \"Flubber\" then count with me the ways:\n\n1) Williams isn't funny (his hair seems to put in more acting time than he does).\n\n2) It's written by John Hughes (and it isn't even good on a slapstick level! Sheesh!!).\n\n3) Marcia Gay Harden is completely, totally, hopelessly wasted (did I say \"totally\"? Good!).\n\n4) There aren't HALF as many funny situations in this one as there was in the original.\n\n5) The bad guys act as if they're in a serious movie (though since there wasn't any laughs in this one, I can see where they would get confused for content).\n\n6) There are more FX than anything else (when a movie forsakes its story in favor of an FX loop, it's not a good sign).\n\nThere are more, but we're only allowed 1,000 words for reviews here.\n\nOne star. For the FX. They're good."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "OllieSuave-007",
        "review_rating": "6",
        "review_title": "Flubber is for the kids.",
        "review_detailed_main": "This is the remake of 1961's Absent-Minded Professor, where Robin Williams plays Professor Phillip Brainard. He works with his assistant Weebo, a talking miniature flying robot, and created a rubber-like substance called Flubber, which can make objects fly through air. His scientific research has caused him to miss his wedding to fiancée Dr. Sara Jean Reynolds (Marcia Gay Harden), who ends up going out with Professor Wilson Croft (Christopher McDonald). Therefore, Brainard works to get Reynolds back, and deal with a couple of criminals who want their hands on Brainard's scientific work.\n\nI haven't seen The Absent-Minded Professor, so I couldn't compare the two films. But, to evaluate this movie alone, I'd say it is just an average movie with some whimsical fun and silly slapstick comedy, and a plot that really goes all over the place. Williams looks pretty odd in the movie, Harden did an OK job in her role, and McDonald was just plain annoying in his performance. I enjoyed the Weebo character, voiced by The Little Mermaid voice actress Jodi Benson. The little flying robot reminded me of the little aliens in the sci-fi flick *batteries not included, and her little TV screen that shows various Disney cartoon scenes whenever she makes emotions is a clever touch.\n\nOverall, I didn't think it was a really exciting movie, but for its whimsical, slapstick and childish elements, this movie is best left for younger children to enjoy.\n\nGrade C"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "blazesnakes9",
        "review_rating": "1",
        "review_title": "Liked it when I was a kid. Not so much now.",
        "review_detailed_main": "As a boy, I was always impressed and amused by the movies that I saw. Some of them bring back memories of me watching whatever kids movie that made me excited. But as time goes on, those memories are still embedded in my memory bank. And sometimes, an fellow movie-goer can sometimes get teary-eyed by going down memory lane. Some of those movies do hold up well. Some of them, well.... get lost in my mind.\n\nTake Flubber, for example. Flubber is the kind of movie that I enjoyed as a young boy. But, I've grown up over the years and to tell you the truth, it doesn't hold up for me.\n\nThe story was originally from the 1961 comedy film, \"The Absent-Minded Professor\". In that film, Fred MacMurray played the lead character. MacMurray's character was a complete nut case who invents a new and improved substance that can bounces off the floor due the amount of energy stored inside. The substance was named Flubber, due to the fact that it is flying rubber. The absent-minded professor tried to convince his colleagues that flubber can saved their university from going into shambles.\n\nHere, Robin Williams plays the absent-minded professor. Professor Phillip Brainard, (who could be a distant relative or son of the original Absent-Minded Professor), is in the process of creating a new substance that can raise money to save the college from closure. Brainard's colleague is a flying robot called Weebo. Brainard soon discovers flubber and from the start of it, Flubber doesn't want to settle down.\n\nThe story deepens as Brainard tries to convince the college president and his fiancée, (Marcia Gay Harden), but it doesn't turn out the way he wants it to go. He even expands the idea of flubber by converting the substance into a liquid and then into a white cream. In one particular scene in the movie, Brainard tries out the flubber by spraying it onto a basketball that can bounces as twice as much as a regular basketball. The idea even becomes more popular when it spreads onto a basketball team. Their sneakers are also sprayed with flubber, making them bounce more higher and faster than ever.\n\nThere are, however, bad guys in Flubber, and their job in the movie is to try to steal the substance from Brainard. But, to tell you the truth, you seen these bad guys before in a movie. And it's no surprise that these characters are ripped right out of Home Alone. It's ironic because the script for the movie was written by John Hughes.\n\nI don't know what happened to John Hughes back then. He started off his career with good movies like Sixteen Candles, The Breakfast Club and Planes, Trains and Automobiles. But, after the big success of Home Alone, I believe Hughes dropped his pen and started depending on recycled material from his other movies to substitute in his scripts. Recycled material soon resulted in forgettable movies like Dutch, Career Opportunities and Curly Sue. Bad career move. And I supposed Flubber can be included in this specific category of forgettable John Hughes' movies.\n\nRobin Williams looks as if he was practically on speed throughout the entire movie. At certain times throughout this movie, I thought he overacted as being the main character of the story. The slapstick did not work this time around since it didn't make me laugh the first time I saw it as a young boy. The flubber wasn't even worth my time since there wasn't anything special about the green goo. In fact, when Flubber soon shows up, the movie goes downhill from there with the green gelatin bouncing around the movie, breaking windows and panes of glass. I realize that after the movie was over, I forgot how many times Flubber went through a window or a pane of glass. It was very tiresome and boring the second time around.\n\nIs there anything else I forgot? I don't think so. Except to say that I won't be looking forward to seeing this movie since this is one of those kids' movies that I like to forget. But, don't worry. There's plenty of other good or great kids' movies that I saw in my childhood. Flubber wasn't one of them. ★ 1/2 1 1/2 star."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "Not As Good as \"The Absent Minded Professor\" But Pretty Funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "MovieFan983",
        "review_rating": "7",
        "review_title": "Entertaining smash hit",
        "review_detailed_main": "This was definitely Robin Williams magic, maybe it wasn't the best ever made, but it was definitely entertaining. 7 out of 10. Rated PG for slapstick violene and mild language."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "The-Sarkologist",
        "review_rating": "4",
        "review_title": "Not really all that great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "TheLastStop41",
        "review_rating": "",
        "review_title": "A truly underrated comedy classic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "filipemanuelneto",
        "review_rating": "2",
        "review_title": "Too much potential badly tapped.",
        "review_detailed_main": "In my opinion, this is one of the most discreet and little-known films of Robin Williams' career, despite having had a lot of publicity and media coverage when it debuted. It tells the story of a distracted scientist who creates a gelatin-like green substance that has a life of its own and can solve the world's energy problems. In the midst of all this, his robotic helper falls in love with him and ruins his marriage. The story of the movie starts from an original idea, but it has many flaws and gigantic plot holes. Robin Williams looks good in the main character, although he does not look very motivated. The actor's tone is much warmer and lazier than usual. Flubber, as a character, was absurdly underutilized in the film, even considering the brilliant musical scene made with this character. The nature of the substance \"Flubber\" is never clarified, nor is it really alive. Weebo, the assistant of the scientist played by Williams, ends up becoming the most complete character of the film, with a strong dramatic and psychological depth and well-made humor moments. The villains are good as comic elements but they also were not very developed as characters. All this harms the film a lot and causes adults to reject it altogether whereas the children, for whom the film is clearly directed, merely laugh at their jokes. We can conclude that this film is a succession of very positive and promising elements that failed because they were not exploited in the best way. Maybe that's why the movie was never a success. It simply did not stay in the memory of that generation and eventually slipped into oblivion over the years."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Atreyu_II",
        "review_rating": "7",
        "review_title": "Not a great movie, but a funny one",
        "review_detailed_main": "\"Flubber\" is nothing special or extraordinary, but it is a funny one although, for such, it's important not to take it too seriously, otherwise...\n\nWhile certainly not a great movie, the movie is very underrated and for sure not as bad as many people make it sound. It's one of those movies which I think people tend to exaggerate on their criticisms. Of course that this is just my opinion. You don't have to agree with me, as long you respect my opinion in return.\n\nThis is kind of a silly comedy, one of those made purely for laughing, fun and entertainment - its major priorities. To make sure it would be a crazy comedy, they chose «the man of the 1000 voices», Robin Williams, as the absent-minded/nutty scientist professor Philip Brainard. The result is, of course, a real scream, with this actor in a funny role instead of certain ridiculous roles he plays (such as that in \"Birdcage\"). Anyway, lots of humorous gags and laughs are a guarantee in this movie, even if the movie isn't super.\n\nNevertheless, I seriously think that its biggest strenght is on its first half, while the second half is less funny, become a bit more ridiculous. But in general it is a watchable movie, one that is not as bad as you might think and also without bad stuff or bad surprises. I loved the Weebo character, just for the record.\n\nI confess that I never saw the original movie and I didn't know this was a \"remake\" of an old movie. But I hope to see the original sometime and compare them both."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "elshikh4",
        "review_rating": "2",
        "review_title": "The Half of Everything !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "MichaelMRamey",
        "review_rating": "6",
        "review_title": "A Part Of My Childhood",
        "review_detailed_main": "I remember enjoying this film as a kid and was my second Robin Williams film I ever saw after Hook. I recently got the chance to revisit this film and although it didn't live up to my memory of it, Flubber was still a decent family film. It suffers from of the classic film tropes especially one that I hate where people are just ignorant to what is going on around them. A fun Williams film you can watch with your kids."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "briancham1994",
        "review_rating": "6",
        "review_title": "Fun moments but not much else",
        "review_detailed_main": "This film is like an endless gag reel. If you view it as just physical comedy, you won't be disappointed with all its comedic moments. Beyond that, the story and characters are barebones and just exist to set up all the slapstick. You get what you expect."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "view_and_review",
        "review_rating": "4",
        "review_title": "Not Good",
        "review_detailed_main": "\"Flubber\" is a remake of the 1961 comedy \"The Absent-Minded Professor.\" Professor Brainard (Robin Williams) in this case is the Absent-Minded Professor who forgets everything, big or small, such that he even forgot he was getting married. His college is on the brink of financial ruin unless a miracle happens. Brainard's invention of flying rubber aka flubber is just the invention that can save the school.\n\nThis movie took silly and amplified it. Flubber was fine for 1961, but even in its recreated state it was not meant for 1997."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Sapphire383",
        "review_rating": "8",
        "review_title": "Flubber, the get together, family film.",
        "review_detailed_main": "When I saw the reviews for this film, I was expecting something very poorly made and bad quality. True, for an adult without a kid it isn't ideal, but why buy a film if it has a cover like this when you're not a child any more? Everywhere online it says this is a great kids flick, for families and more. If you're like me and read reviews before buying or renting a film, then you'd know not to get it.\n\nGetting to what the movie is like, these aren't the best graphics, but what do you expect in an 1997 film? The Flubber, Weebo etc. are already neatly done, which I find quite impressive for a film made at that time.\n\nThe humor in this may not be the jokes, but not all kids understand certain types of joke, so in the film they just went for the classic 'Bad Guys Whacked In The Face' type. There is no gore or extreme violence in this, everything has a light-hearted touch to it and the flubber truly seems fun to play with.\n\nRobin does do a good job as the professor, making many wacky inventions and always forgetting. Weebo played by Jodi, continues to be the kind, thoughtful person - or in this case computer - that she is when she plays Ariel in the little mermaid.\n\nOverrall it's a pretty good film, not ideal for adults but then why get a kids film?"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "svincent-72075",
        "review_rating": "6",
        "review_title": "Hilarious and loved but scientifically unaware",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "IonicBreezeMachine",
        "review_rating": "4",
        "review_title": "John Hughes copies himself once again and crudely staples it to a 36 year old film",
        "review_detailed_main": "Professor Phil Brainard (Robin Williams) is an absent-minded professor of physical chemistry at Medfield College engaged to be married to college president Dr. Sara Jean Reynolds (Marcia Gay Harden), not for the first time, but his third. When Phil becomes wrapped up in one of his experiments when his robot assistant Weebo (Jodi Benson) deletes his wedding from his schedule, Phil discovers he's invented a substance, Flying Rubber or \"Flubber\", that has the power to build upon whatever energy is applied to it in an exponential manner (in that it bounces higher and higher with each bounce) and even make material fly when applied with Gamma Rays. Now Ned must try to win back Sara's affection from his unscrupulous former partner Wilson Croft (Christopher McDonald), test his newly discovered material, protect Medfield College from closure by a vindictive money hungry Chester Hoenicker (Raymond J. Barry), and sell Flubber for the resources needed to keep Medfield open and keep it out of the hands of Hawk.\n\nFlubber is a 1997 remake of Walt Disney Pictures' 1961 film The Absent Minded Professor. While the original film was only okay and hasn't stood the test of time, it was used as a template for early effects work that would be utilized in other live-action Disney productions such as Mary Poppins and the various high concept comic adventures that would refine and build upon the effects work. Flubber is the second film produced under the short lived John Hughes label for the Disney Company, Great Oaks, which one year prior had seen success with the Glenn Close staring live-action remake of 101 Dalmatians. While John Hughes is credited as a writer on Flubber, Hughes based Flubber so much upon the original script that the original screenwriter Bill Walsh was given screen credit despite having died in 1975. While I wasn't a big fan of 101 Dalmatians, I did at least appreciate that it was trying to do something different regardless of its success. Flubber on the other hand is basically a point by point remake of the original film with only the most superficial of details added or changed and rendered through the lens of John Hughes' \"bumbling pratfall\" framework that had long been run into the ground after an endless parade of Home Alone rip-offs, many of which written by Hughes himself.\n\nRobin Williams unfortunately isn't all that effective playing a professor and this role that was originally written as fairly simple and reserved for Fred MacMurray just doesn't play to Williams' strengths of madcap manic energy. Most of the time Williams isn't the one giving energy and most of the energy is coming either from the special effects department or stunt coordinators who use a mixture of CGI and wirework to make things bounce around and break things or cause others to do exaggerate pratfalls. Poor Marcia Gay Harden is wasted in a role that wasn't all that well written in 1961, and while they've tried to add some more agency to the character it's still a thin role with nothing all that substantial for Harden to grab onto. I will say that Christopher McDonald is probably my favorite performance in the movie as he effortlessly plays conniving self-serving jerks and his delivery coupled with a complete lack of any subtley does make for some humorous moments (intentional or otherwise) where he's basically saying in play speech \"I'm the antagonist\". The movie also adds a strange subplot in the form of Phil's robot assistant Weebo voiced by Jodi Benson of The Little Mermaid, and there's a weirder and much more interesting plot going on within the movie where Weebo is in love with Phil and at one point even creates a holographic human projection of herself so she can \"kiss\" him while he sleeps. It's a very strange thing going on thematically because Phil is her creator so Weebo could be seen as having an Electra complex in addition to being a machine in love with a human and of course being a Disney film this isn't addressed at all and is pushed in the background so we can focus on more of Hughes' regurgitation from Home Alone.\n\nFlubber isn't a good movie, it's not charming, not funny, and not interesting and the only things that do kind of work is McDonald's complete \"no care given\" performance and the odd nature of the Weebo subplot feeling really out of place and unnerving if you think about it."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Sweetestsixteen",
        "review_rating": "",
        "review_title": "It was great except for one thing...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "peterw1210",
        "review_rating": "4",
        "review_title": "Dull Story, Was Not Close To Its Potential",
        "review_detailed_main": "Flubber had a lot of potential, but this storyline was just not good and made no sense some of the time. There were very few moments dialogue wise where I felt like I was in the story with the characters. Just poorly written. Near the end I almost fell asleep, it was just getting very dull and the film is only about an hour and a half.\n\nOverall, 4/10."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "ThunderKing6",
        "review_rating": "6",
        "review_title": "Flubbadub",
        "review_detailed_main": "Its great for children it has so much mischievous moments.\n\nRobin Williams was awesome. Shows that this guy was made to act and make me laugh.\n\nI'd say its better than the original.\n\nVerdict: The Gates did a fantastic job in this film. Shows he is a very talented actor comedian."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Dadge",
        "review_rating": "2",
        "review_title": "Half-baked",
        "review_detailed_main": "Boy, was this a rubbish movie. I sat through it amazed that Robin Williams had agreed to have anything to do with it. Maybe he said yes before he read the script. Not only does the movie give Williams very little opportunity to be himself, it makes far too little use of the comic potential of the green goo itself: just a couple of set-pieces. All in all, a wasted opportunity, a waste of my time and a minus point against Robin Williams."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "xinzhaorekter",
        "review_rating": "7",
        "review_title": "So stupid and goofy that it works!",
        "review_detailed_main": "This movie is not that great if you are looking to compare it with others, but if you are watching it alone or with friends, this movie is a blast, the premise is so stupid and goofy that it just works, the cartoony slapstick is, kinda obvious but its good, the only lowlight were the scenes with the robot assistant to robin williams (forgot her name) and that flubber dancing scene, but the movie is, at least in my opinion, harmless fun"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Mickey Knox",
        "review_rating": "3",
        "review_title": "another remake............",
        "review_detailed_main": "These 2 words are so oftenly said nowadays that i got sick of them. Another remake. It looks like people in Hollywood are running out of ideas and all they can do is take older ideas and make them spectacular.\n\nWith Flubber it's not only an idea copied. It's the whole film. Except a few scenes everything is like in The Absent Minded Professor. Only with better effects.\n\nI gave this movie a 3 out of 10 for 2 reasons: 1. Robin Williams, a great actor, and 2. the effects - pretty good.\n\nExcept that Flubber is awfull."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "IceCream-57",
        "review_rating": "7",
        "review_title": "Flubber",
        "review_detailed_main": "Only thing I can say about this film is how silly it is. Only way I can put it. Silly. I would say the film is something that you can watch with your kids for good clean fun humor. Robin Williams was good in this film. He stars as a goofy, absent minded professor. He is a good kind harded man, but he is a goober. The story is centered around the main character trying to become relevant in his family's life and trying to win back the trust of his future wife after forgetting g about their wedding.. for the 3rd time. He the creates this slime called flubber that a wealthy businessman wants to get his hands on. Fun story."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "LAWigley",
        "review_rating": "1",
        "review_title": "Is there any vote lower than a 1?",
        "review_detailed_main": "This is an abysmal remake. The script is horrid. Robin Williams\n\nflops. Time is too valuable to waste on this movie"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "10",
        "review_title": "It's flying rubber... It's, Flubber!!",
        "review_detailed_main": "A remake of an old black and white Disney flick called The Absent Minded Professor that has long since gotten a bit stale, Flubber took all the best elements of that and breathed new 90's life into the premise, most of the pep in its step coming from star Robin Williams. Keep in mind it was a critical bomb though, which just doesn't make a shred of sense to me. It's fun, lighthearted, hilarious and just a bit raunchy in places where it can pull it off. For whatever reason, it didn't sit well with anyone other than fans like me who will furiously shove a copy in your face if we hear that you haven't seen it. Williams is college professor Philip Brainard, who is so absent minded it borders on dementia. He leaves his lovely fiancé (Marcia Gay Harden) at the alter TWICE, prompting the advances of irksome college dean Shooter Mcgavi- I mean Christopher Mcdonald. He's on a quest, you see, an obsessive quest to find the formula for... something. That something turns up after a destructive whirlwind of disasters in his basement lab, and in the form of Flubber, a lovable ball of green goo, infected with incurable ADHD and an inexhaustible sense of humour. While the utter the life of the party, Flubber does have its practical uses, such as making cars fly and turning the hopeless varsity basketball team into a bunch of flying Tasmanian devils who nail every dunk. This all gets the attention of insidious local philanthropist and lowlife Chester Hoenicker (Raymond J. Barry) who greedily wants the discovery for his own. He sends his two goons Smith (Ted Levine) and Wesson (Clancy Brown) to rob Brainard of his precious sentient mucous, which turns into one of the most hilarious displays of slapstick comedy since the Three Stooges. Oh, did I mention Williams has a little flying UFO sidekick named Weebo, who has a perfect GIF reaction to everything, before GIF's were even a thing? So much to love about this little classic. Williams is his usual buoyant self, with some of his trademark razor focus diminished in favor of doe eyed, vacuous forgetfulness that would make Jason Bourne guilty for ever whining about his predicament. Special effects are top drawer too, Flubber would look dapper in Blu Ray if they ever felt so inclined as to release one, not to mention aforementioned airborne automobiles and dear little Weebo. Can't give enough glowing praise to this little treasure, and hiss enough venom towards those sourpuss critics who assaulted it. Flubber for the win."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "anselmdaniel",
        "review_rating": "7",
        "review_title": "A silly science-fiction movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Chinook-3",
        "review_rating": "2",
        "review_title": "Sleeping Pill......",
        "review_detailed_main": "I actually gave it a 2, because to give it a 1 I would have had to be awake during all of it...and that simply wasn't possible. There was absolutely no reason for making this film. Disney wasted its computers, its studio, a darn fine actor (Williams) and my time. Shame...."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "eu-51",
        "review_rating": "",
        "review_title": "Gives Remakes a Bad Name",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "luv_may82",
        "review_rating": "1",
        "review_title": "WTF is wrong with you people?",
        "review_detailed_main": "You guys are all idiots for rating this dumb-ass movie so highly because it really sucked big donkey dick. Well, this movie and the \"new\" version of A Nightmare on Elm Street. I bet you dummies would even vote Howard The Duck as \"a highly well-thought out film with excellent imagery.\" Puh-lease!\n\nDo all of us a favor: don't rate any more movies on IMDb because you all SUCK!\n\nI hope I never have to sit behind you guys in a movie theater. What an awful critique of such a horrible film! Ugggh! It makes me want to throw popcorn at your nappy little heads!\n\nSomebody tell these guys that they need to go back to their home planet right now!\n\nI ABSOLUTELY love the part of the film where that Nickelodeon stuff is bouncing all over the place. It really makes my balls tingle. Oooooooooh!\n\nAnd Robin Williams, wow! His acting was even better than in Patch Adams.\n\nI can't wait until Flubber Part 3 comes out. It will be a real hoot!"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "lisafordeay",
        "review_rating": "6",
        "review_title": "ONLY for the late Robin Williams this film is actually hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "alon-3",
        "review_rating": "4",
        "review_title": "Simply badly done.",
        "review_detailed_main": "Being a university student, I can set aside scientific truths for watching a film, if it is done well. This one isn't. It's nice to invent a gooey green subtance which generates energy, but a totally different thing is to give it a personality. Well, come on, it's just chemicals in an experiment. Also, robots that have emotions and intelligence are not feasible, not to mention them falling in love, or \"dying\".\n\nWith that said, the movie still could have been made FUNNY, especially with Robin Williams. However, the funny parts of the script were cut to a minimum, leaving only CGI pyrotechnics. Well, I didn't go to this movie to see CGI, I went for Robin Williams, which is my favorite actor, and discovered that even a great actor can't save a bad script.\n\nThe script was so unamusing, that I would have stopped watching it in the middle if I weren't with my girlfriend. She actually liked the film, although I can't understand why."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "creidy-92302",
        "review_rating": "7",
        "review_title": "Scientifically interesting, though not accurate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Beta_Gallinger",
        "review_rating": "5",
        "review_title": "A kids' movie, one which could have been worse, but is still nothing special (at least not for adults)",
        "review_detailed_main": "I remember watching this film more than once shortly after it came into stores (I would have been around eleven years old at the time), but can't remember exactly what I thought of it, so I obviously didn't absolutely love it or hate it. Would I have watched it years later if I never saw it before? Probably not, and DEFINITELY not for any reason other than Robin Williams' starring role. However, since I had seen it while growing up, I decided to try it again, and unsurprisingly, it turned out to be average overall.\n\nProfessor Philip Brainard is an absent-minded professor with a living computer named Weebo that floats through the air as his assistant. He is in love with Dr. Sara Jean Reynolds, the president of Medfield, a college which is in financial trouble. Brainard is busy trying to create a substance that will save the college, and has failed to show up at his attempted wedding more than once. Sara gives him one more chance, and if he fails to show up this time, it will be the last straw! That night, he successfully creates a living green substance which he calls \"flubber\" (after Weebo says it's \"flying rubber\"), and it appears this substance will do the trick! Sadly, he also misses the wedding again, and Sara is fed up. Nonetheless, he thinks about how he's going to use flubber to save Medfield College, and tries to once again win the heart of Sara, who is now going out with Wilson Croft, Brainard's rival. Meanwhile, Bennett Hoenicker is a spoiled student whom Brainard has failed, and his father, the extremely wealthy Chester Hoenicker plans to persuade the professor to pass his son!\n\nRobin Williams is a very talented comedian, but that doesn't really show in this movie. He's a bit tamer than you may expect, in the kind of role you may expect one to act crazy in, and he is certainly not very funny. After saying that, I should also point out that \"Flubber\" as a whole fails as a comedy. I certainly didn't laugh, or even smile very much, and the part that I remember laughing the most at wasn't even supposed to be funny! The scene I'm talking about is the one where Sara says \"This is going to be the very last time I try to marry you,\" which reminds me, the relationship between Philip and Sara is a rather awkward part of the story, and I guess there are problems with the script. The only really good INTENTIONAL gag I can think of is the \"Let him have it. Give it to him. No, give it to him. Stop that and give it to him...\" one. Another problem I can't forget is the villains, ones which may not belong.\n\n\"Flubber\" is a remake of the 1961 Disney film, \"The Absent Minded Professor\", which I haven't seen (I didn't even know \"Flubber\" was a remake until around the time I last saw it), but know the 1961 original is generally considered superior. Well, it is a common thing for remakes to be inferior to their predecessors (I'm certainly not saying they always are, but it's not uncommon for fans of the original to be disappointed to some degree by the remake), and I'm sure this one is no exception. Whether you've seen \"The Absent Minded Professor\" or not, and whether you like it or not if you have seen it, you have to remember that \"Flubber\" is a kids' movie, and for most adults, other than parents, it is an insignificant flick, and probably not worth it."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Kamurai25",
        "review_rating": "6",
        "review_title": "F-L-R-U double B, -errrr, the wonderful thing about Flubber is Flubber's a wonderful thing",
        "review_detailed_main": "Great watch, would watch again, and can recommend.\n\nI'm a fan of Robin Williams (silly or serious), but, having just watched the original, they just didn't believe in the charm of the original.\n\nFor some reason, instead of a miraculous invention, he creates sentient life (that doesn't mind being used, divided and chemically produced into solutions, or trapped in a metal containment unit). This of course is in addition to Weebo, a flying (no exhaust propulsion, like ET UFOs), wireless device with a smart A.I. in 1997. What was he doing looking for the next big thing, he had already invented it! I want a Weebo.\n\nTo be fair, he claims he couldn't recreate Weebo like it is, but any facimile would have been wonderful, in 2020, let alone before smartphones were common place.\n\nAll the differences aside, they we very deliberate in setting themselves apart from the original, when they very easily could have. The characters were also modernized quite a bit: the romantic rival was much more blatant about being awful in many different ways, alongside Wil Wheaton and his dad, sealing their irredeemable qualities.\n\nMy only real complaint with the writing was that with inventions so grand (world changing, mind you), his vision was so short sited to only save his college, where he worked and made money, so it's still a little selfish: he could have made a point of making it's usage for all, or at least selling it to someone who would commercialize it so. It makes a weird dent in the vehicle of righteousness is all.\n\nBut this is a lot of fun, even if it leans on Robin Williams a bit."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "5",
        "review_title": "Flubber",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Good update!!!!!",
        "review_detailed_main": "Time for some wacky, funny, scientific fun with Robin Williams as he takes the stage as the \"Absent-Minded Professor\" in Disney's 1997 remake of that movie, known simply as \"Flubber!!!!!\"\n\nHe has a robot assistant, Weebo, and he was late (again) for his wedding, all because he was making \"flubber,\" flying rubber as it was known. He used the flubber to try to explain everything about his no-show, from falling off his classroom window (which didn't work), to a high-flying basketball game!!!!!\n\n\"Flubber\" is one of those films that is better than the original. Sure, both are excellent pieces of \"genius,\" but this one blows the competition away. Which is why I give it 10 stars!!!!!\n\n10/10"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "kyle_is_awesome",
        "review_rating": "7",
        "review_title": "Some stupid humor.",
        "review_detailed_main": "This movie is about a proffesor (Phil). He keeps forgetting to marry his wife (?.) Yeah. But anyway his wife starts dating someone else. And Phil tryes to impress her using his \"Flubber.\" An invention he created. Its a wierd plot. But it has it's funny parts. Good for young kids."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Guck!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Cinematic Inner Minds",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "dedmonds",
        "review_rating": "5",
        "review_title": "\"Flubber\" flubs it.",
        "review_detailed_main": "This remake of Disney's 1961 classic, \"The Absent-Minded Professor\", stars Robin Williams as Professor Philip Brainard, who invents a hyperelastic polymer which returns more energy than is put into it. This basically means that if you throw it at something, it will bounce back harder than you threw it. He names his invention \"Flubber\" (flying rubber).\n\nFor reasons never explained, Flubber's amazing hyper-elasticity also allows it to hover, change course in mid-air and dance the mambo. And in a remarkable stroke of luck for Hollywood's legions of character animators, Flubber is also intelligent and imbued with a lively and playful personality.\n\nNo Disney movie these days is complete without a cute little sidekick-who-messes-things-up-but-then-saves-the-day. In \"Flubber\" this role is played by \"Weebo\", a flying pet robot that Brainard invented. Strangely enough, while scientists, car companies and bad guys are all getting excited about flubber's potential for flying, no one seems to give a passing thought to Weebo's fully functional Artificial Intelligence and apparent mastery of antigravity.\n\nOkay. so Disney films aren't meant to be physics dissertations, but it would have been nice if at least one of Newton's laws of motion had survived more than three minutes beyond Flubber's first appearance. If you wonder why your kid is failing science, look no further.\n\nRobin Williams is wasted in this movie. He has few, if any, good lines, and his hyperactive humour never seems to go much beyond dodging flubber-propelled projectiles.\n\nIf you enjoy watching glassware get smashed up and seeing bad guys get hit on the head with bowling balls -- repeatedly -- then maybe you'll enjoy \"Flubber\".\n\nPersonally, I preferred the original."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "mark.waltz",
        "review_rating": "6",
        "review_title": "Effects 10. Script 2.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "refinedsugar",
        "review_rating": "5",
        "review_title": "Strictly for the kiddies",
        "review_detailed_main": "Robin Williams seems to have these \"trips\" where he does a bunch of silly \"family\" movies in succession. This is one of them. Here Williams plays a tad introverted, brilliant scientist who invents a substance that's highly kinetic which leads to the usual assortment of hi-jinks and hilarious situations involving the bouncy substance.\n\nI say \"hilarious\" depending upon your take of Robin Williams and your sense of humor. I've reached the point (where for now) I don't like the material Williams decides to appear in. In Flubber's defense, I think it was primarily made for children. I find it hard to see this movie being aimed at anyone over sixteen years of age.\n\nIt's a Disney movie starring Robin Williams after all. Not Spartacus by any length of the imagination. That's it's own explanation. This is indeed a kids movie. If your young, I'm sure this movie is delightful. All a child's mind asks is to be entertained. In this case - see Robin Williams in all of his glorious silliness - mugging it for the camera and to laugh over some popcorn. It's harmless and it's forgettable. Like-minded adults are forewarned."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "HabibieHakim123",
        "review_rating": "7",
        "review_title": "Entertaining, enjoyable, and fun",
        "review_detailed_main": "\"Some scene are great, some scene are very boring, but it's still enjoyable, Robin Williams as usual he is very funny guy, not a Robin Williams good perfomance ever and not a Robin Williams bad performance ever, it just a fun movie\""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "DJ_Shilo",
        "review_rating": "2",
        "review_title": "Flying Rubber",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "tobybunning",
        "review_rating": "6",
        "review_title": "More a kids film but has its moments",
        "review_detailed_main": "Not the best of Robin Williams performances when compared to his more classic performances (Aladdin/Jumanji), but still has his moments aimed at kids where they would class it as hilarious, but adults would class it as a little funny. Serious low blow to Clancy Brown's roles in films (Smith) as he was in one of the most celebrated and beloved films of all time (Shawshank Redemption). The same goes for Will Wheaton when compared to his performance in Star Trek: The Next Generation. It has its moments of sadness but they are quite short as the film is classed as a comedy. Overall this film is easily seen as aimed towards kids as mainly all the moments are aimed at them but adults after a period of time could watch it for a nostalgia of their childhood."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "jamesjustice-92",
        "review_rating": "5",
        "review_title": "My childhood movies that hadn't stood the test of time, part one",
        "review_detailed_main": "I used to have a VHS cassette with this movie back in the days and I watched it so many times that I almost knew every line from it by heart - it was funny, it was warm and interesting and sweet but after twenty years even the warmest of memories get cold and become sour, and so is the case with Flubber.\n\nI love Robin Williams and his mannerisms, the way he transforms every role he's given to fit his persona in a little bit but in this movie I didn't see even the quarter of his fantastic comedic genius. His absent-minded professor hasn't got anything to root for in a well-written character, except maybe for his good soul and pure intentions. Marcia Gay Harden is no match to Robin but her character here shows a bigger variety of emotions than Williams' character nonetheless. All the rest of the cast members are just plain dull and one-dimensional villainy villains that are there to be a comedic relief but what was funny for me back in the day now doesn't work and feels forced, unnatural and simply stupid and unfunny to say the least.\n\nWhat gives though is the beautiful score by maestro Danny Elfman whose music makes you sit through the whole movie, enchanted and amazed. Special effects are on the high level as well, considering the movie was made more than 25 years ago but overall the magical constant that was present in me since the first time I watched this on the VHS has gone, the illusion is broken and now I can finally see the movie for what it really is - a mediocre but good-hearted family flick that didn't stand the test of time thoroughly and I believe I will not ever watch it again."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "TheHonestCritic",
        "review_rating": "10",
        "review_title": "This, in my opinion, is Robin Williams' funniest movie of all-time.",
        "review_detailed_main": "\"Flubber\" (1997), this is one of the first movies I've seen in a movie theater. What a great movie this was when I first watched it! I have seen the original version; \"The Absent Minded Professor\" (1961) with Fred MacMurry. As much as I enjoy that film, I love the remake even more. Yes, this is a rare example where a remake is better than the original. Robin Williams pulls off the role of Phillip Brainard perfectly, and the rest of the cast is brilliant as well! \"Flubber\" has a perfect story, perfect acting, perfect sets/locations, perfect special effects and of course a perfect soundtrack. This movie fires on all cylinders, and it's classified as a perfect movie by my standards! If you have children, make sure you show them this movie. Although, I can see anyone at any age watching it for the first time and enjoying it. This, in my opinion, is Robin Williams' best comedic performance. I could watch it over and over and never get tired of it! Obviously, I give this film a full 5 out of 5 star rating, which equates to 10 out of 10 IMDB stars. If you haven't seen \"Flubber\", what are you waiting for? You must check it out! Also to wrap up my review, let's give a moment of silence for one of the funniest comedians of all-time, Robin Williams. Thank you for all the movies and laughs you gave us throughout your phenomenal film career. Rest in peace, Robin Williams."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "slightlymad22",
        "review_rating": "6",
        "review_title": "Nobody Plays A Giant Douche Like Christopher McDonald",
        "review_detailed_main": "Due to having two sons I watch a lot of kids movies, and appreciate them for what they are, some I enjoy (\"Underdog\") and some I loathe (\"Son Of The Mask\") but I always bare in mind it's aimed at kids!!\n\nPlot In A Paragraph: An absent minded professor Philip Brainard (Robin Williams) tries to save his college from being closed down by developing a new energy source.\n\nThis fails on almost every level, it's special effects looked awfully dated, it's script was awful, and it's plot was pretty much throws every cliché in the book at you.\n\nI could understand the late Robin Williams taking this at a low point in his career, but he was still a really popular actor when he made this tripe. It's a shame to see Clancy Brown (Kurgan from \"Highlander\") here too. Will Wheaton is OK and nobody plays a giant douche like Christopher McDonnald. My favourite character in the entire movie was Weebo (voiced by Jodi Benson), Philip's hovering robot assistant.\n\nFinal assessment Williams tries hard, but these are not 100 of his better minutes."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "ironhorse_iv",
        "review_rating": "5",
        "review_title": "This remake is not really good. This flub of a movie will not bounce back. It's pretty weak.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "mcfly-31",
        "review_rating": "",
        "review_title": "Hughes knock it off already!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "YungRapunxel212",
        "review_rating": "5",
        "review_title": "I want a Flubber...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "D_I_Sammi",
        "review_rating": "3",
        "review_title": "Nothing Sticks Together",
        "review_detailed_main": "'Flubber' had many of the ingredients necessary for a fun heartfelt family movie, but instead flumps its charms in place of overly chaotic and almost violent slapstick much to its embarrassment.\n\nRobin Williams can do no wrong and is by far the best part of the movie, but the entire supporting cast is weak, especially Wil Wheaton who really struggles to act.\n\nThe highlights are the gentle moments Robin's character has and the quality CGI special effects of the gorgeous green goo shooting around the screen.\n\nUltimately the fault lies with the writers and director Les Mayfield. They were incompetent and not up to the task and didn't understand how to create a thoughtful inspiring movie."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Charbz_Bee_Bee",
        "review_rating": "10",
        "review_title": "FLUbb AT iT's BeSt",
        "review_detailed_main": "Flubber was an excellent movie. There was excellent dialog, and the story line was one of a kind! Children of all ages will enjoy this exquisite movie! Flubber starts off as a ball of flubb. A science experiment goes horribly wrong, and suddenly, the ball of flubb that was, becomes an unstoppable machine, much like the terminator. The mad scientist (played by the great singer Robbie Williams, who sings such greats as \"Lets be a Better Man\" and \"Doing it with the Kids\")is a kooky old dude with an attitude to kill. The special effects are amazing, as the director has managed to capture the true essence of flubb. Viewers will be amazed."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "oxjf",
        "review_rating": "8",
        "review_title": "Review of Flubber",
        "review_detailed_main": "This movie , i would say is an 8/10 it is both great for the family of all ages, and great for the lone watcher.\n\nI would have to say that anyone who hates this movie, has a dislike for a character or director as there is very little to criticize it for otherwise, it has a highish budget, which means it has potential and it delivers, so ignore haters and give it a go! The general plot is a clumsy Professor created a new life form made of flubber with strange properties, I cant really say more as it would ruin the plot. However i can say that children will love the film, adults will like the film and elderly will find it amusing, which in my books is good enough reason to buy."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Zycho-3",
        "review_rating": "",
        "review_title": "Not Quite As Bad As You Can Imangine.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "brandonmullins398",
        "review_rating": "8",
        "review_title": "it flows normally then flows quickly!",
        "review_detailed_main": "OK the film is enjoyable and funny but after Sara and Phillip got together, the film ended really fast. Are they trying to finish up the film quickly? There is some slow parts. But most of them are fast! I feel sorry for people that didn't see much of flubber and Sara and Philip being together. Im glad that weebo released flubber even Phillip told her not to. Or we wouldn't see more of flubber. He transforms into different forms of beings. Just like morph from treasure planet does. Now for the ratings:\n\nI will rate each element of the film! Story: The story is about professor Phillip working on something new that will get Sara to like him. He made a green flying rubber that names flubber. He makes flubber liquid mix to the spray and the can to make the object bounce upon impact on the ground or something. So i like the story. So i rated it 7/10\n\nDialogues: the dialogs are fine. But weeber has no dialogs. But shows the videos explaining about whats going to happen or expression. Some of her videos are funny. So i rated it 8/10\n\nCasts: its pretty well matched with the characters. They coulda put Jim Carry as Phillip and the film will be hilarious! But they needed a actor who is the best for the professor. And thats the guy who's the expert at lab work. So i rated it 7/10\n\nGood title for the film? Well yes. Because its about flubber! Why not?"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "mothman-2",
        "review_rating": "",
        "review_title": "Almost as bad as \"Mr. Magoo\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "t_medinapadro",
        "review_rating": "10",
        "review_title": "childhood favorite",
        "review_detailed_main": "This is a good feel movie for people interested in science or research OR a great movie for robin williams fans. I truly watch this film once a year because it was one of my favorite movie tapes to rent as a kid.\n\nFlubber is a great comedic scientific experiment. Robin williams plays a funny, gentle scientist at one of the best universities. He does great technological innovations that are years ahead of our time. Also he's yellow robot personal assistant is the cutest thing ever. I wish there was a disney ride themed after this great film. I loved it and always will.\n\nIt inspired me in many ways to study STEM and continue my studies."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "paul sloan",
        "review_rating": "",
        "review_title": "So Bad It Smells!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "zacharybarker-37829",
        "review_rating": "10",
        "review_title": "Flubber IS AWESOME",
        "review_detailed_main": "Flubber is one of the best cinematic masterpieces I have ever been subjected to and experienced. Those who disagree in ANY way, wether verbal or online, have not witnessed any film that is considered PEAK POWER!!!!! This is better than the movie Up, and Bambi. It beats the entire series of Spongebob Squarepants, and all of the MCU. Any who disagree will fall to the bottom of the darkest pits of horror and dispair, where not even the power of FLUBBER will save you. You will die a horrid and terrifying death if you disagree, and must agree with the FLUBBER!!!! This is the only reason to get Disney Plus."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "TMC-4",
        "review_rating": "",
        "review_title": "Ultimately Pretty Dull",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "dockerykelli",
        "review_rating": "10",
        "review_title": "A WONDERFUL Film",
        "review_detailed_main": "Flubber is STILL such a wonderful movie!!! Shot beautifully and had a great storyline along with a FANTASTIC cast!!!! TONS OF LAUGHTER, love, heartache, learning more about science. This movie has it all. Does NOT DISAPPOINT!!!"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Doc_Who",
        "review_rating": "",
        "review_title": "Watch the original instead of this really awful movie!!Avoid it at all costs!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "LittleLouLou-2",
        "review_rating": "10",
        "review_title": "Super Family Entertainment",
        "review_detailed_main": "Have just watched Flubber for the first time. I expected to be disappointed since I was such a fan of Fred MacMurray's version. Who else could do justice to the role of the absent-minded professor! I was to soon learn that Robin Williams can (and did). It was a delightful movie with no profanity or vulgarity. I can't say there wasn't any violence, but it was humorous violence, and one realized that nobody was really hurt. I felt really good and uplifted after watching and, unfortunately, I can't say that about most any movie nowadays. There were some very funny moments. I particularly liked the little boy who saw things that weren't really there (according to his father, that is). Of course, it was the brilliant comedic acting of Robin Williams that made the movie a success!"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Kyle Westphal",
        "review_rating": "",
        "review_title": "Why was this overlooked for a Razzie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "stefanozucchelli",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "I think it's one of the best performances of Robin Williams maybe because it was the first movie I saw of this actor and I didn't like the others very much.\n\nThere are funny moments but also many sad and romantic feelings."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "A flubbery flop of a film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "michal753",
        "review_rating": "10",
        "review_title": "Cinematic amusement park",
        "review_detailed_main": "Full of charm, joy and unbounded creativeness. At the same time touching and perfectly paced. One of the movies, that show what the magic of cinema is. An absolute must-see."
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Lho3323370",
        "review_rating": "",
        "review_title": "Entertainment!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "durand-28133",
        "review_rating": "8",
        "review_title": "Great and funny classics that is great for children",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "metboyie",
        "review_rating": "10",
        "review_title": "Flubber Bubber, don't forget to wear a rubber!",
        "review_detailed_main": "The absolute PINNACLE of film making.\n\nThe decision to cast Robert Williams as \"flub daddy\" remains just as bold today as it was 22 years ago when this film originally graced our eyes on the silver screen.\n\n-Rusty"
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Hassard1994",
        "review_rating": "",
        "review_title": "As good as i remember it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "blairmail",
        "review_rating": "",
        "review_title": "Children Care About Plots!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "apocalypse_66613",
        "review_rating": "",
        "review_title": "Who was that singing in the Flubber dancing scene?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "joseav10",
        "review_rating": "",
        "review_title": "Disney down...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119137",
        "movie_name": "Flubber",
        "movie_rating": "5.3",
        "review_username": "poj-man",
        "review_rating": "",
        "review_title": "Moronic script aimed at a 5 year old child's mind",
        "review_detailed_main": ""
    }
]