[
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "kapilnegi",
        "review_rating": "9",
        "review_title": "Don't watch dubbed version - Not for non Hindi speaker",
        "review_detailed_main": "I watched this movie nth time with my dutch friend. We have similar kind of taste. Then I realized he didn't like the movie at all. I would like to highlight the following facts for a non Hindi speaker. The acting is intentionally over the top.\n\nIt's a spoof movie. Spoofing many of the cliché Indian movie scenes.\n\nDo not watch if you can't understand Hindi. This movie simply can't be translated. The film have so many rhyming dialogues which can't be translated to other language while maintaining the humor. The movie has dialog which feel funny to Hindi speaker but not to Non Hindi speakers.This I realized with my dutch friend.\n\nThis is the reason I don't watch Korean comedy films although I'm a huge fan of Korean movies. The humor gets lost while translating."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "chutneylix",
        "review_rating": "9",
        "review_title": "One of the funniest movies in the last few decades. MUST SEE!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "viveck_thakur",
        "review_rating": "9",
        "review_title": "This comedy has a script !!!",
        "review_detailed_main": "Its a spoof, its an intelligent comedy, it has some a pathetic action and choreography (and mind it, it is intentional), good hummable songs, good performances by the entire cast, brilliant by Amir, Salman and Paresh and over all an script which is so rare in Indian cinema that too in comedy (watch David Dhawan, Harmesh Malhotra etc). Story is of two wastrels whose only aim is to get rich and famous by any which ways. They come across one such way when they find out that a rich NRI is coming India to get married. Rest of the story is about oneupmanship and how these wastrels try to out wit each other. Entire cast is perfectly cast right from Deven Verma till Viju Khote. Songs are rightly placed and are funny. Surprise package is Salman who acts with perfect timing and this particular act gave him his style of comedy.\n\nAll an all a fum film which you should not ignore if you like and watch Indian Cinema."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "moviebuff81",
        "review_rating": "10",
        "review_title": "The best Hindi comedy ever made!",
        "review_detailed_main": "There have been very few great comedy films in the history of Hindi Cinema. Andaz Apna Apna happens to be one of them. The film is based on a very simple story of two poor young men (Aamir and Salman) who dream of becoming rich by marrying a millionaire's daughter (Raveena). Aamir and Salman Khan try their best to outwit each other and woo Raveena. The plot thickens when Paresh Rawal & Co. plan to take over all the wealth. The movie is well paced and very funny. Rarely does one come across a Hindi comedy which is both funny and intelligent. This is one of the few films with Aamir and Salman together (probably the only film!). Unfortunately it did not succeed at the box-office, and we might never see a film of this calibre again. Aamir Khan is brilliant in the film and has proved his versatility as an actor in this film. Salman Khan gives a very good performance as a dim-wit. Raveena plays a convincing role as a confused rich girl, and Karishma who is Raveena's assistant/friend is also funny. Paresh Rawal, Junior Ajith, Shakti Kapoor, Deven Verma, Jagdeep and Tiku Talsania just add to the flavour of the film! All in all, the best Hindi comedy ever made and I wish they make more quality films like this one. You will want to watch this film time and again.\n\nP.S - For those of you who have watched this film, I also suggest Gol Maal, Chupke Chupke, Chhoti Si Baat, Naram Garam, Hera Pheri (old and new), etc."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Fatehsher",
        "review_rating": "10",
        "review_title": "Funniest Indian movie of all time.",
        "review_detailed_main": "This movie is simply excellent. For some reason it wasn't a success at the box office in India. In New York, however, I have yet to come across a person who disliked this movie. This is definitely the funniest movie to come out of India. Everyone gives a good performance; Amir Khan; however, just takes over and puts the movie over the top."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "iamricky",
        "review_rating": "10",
        "review_title": "funniest movie of the century",
        "review_detailed_main": "There are some movies that are loved by almost everyone who you come across and yet happen to be box-office failures. Andaz Apna Apna, an intelligent and hilarious comedy falls in that catogory. For once, an Indian director has kept in mind the sensibilities of the audience, and not churned out a Kader Khan type stereo-typical hoax. The movie is about two guys who dream of riches, and try to accomplish that by wooing a millionaire's daughter. A humorous drama unfolds while a lot of complexities surface in the story. The complexities add to the sheer comedy of the entire plot. Aamir Khan plays the a street-smart guy, while Salman Khan gives an unexpectedly good performance as the dumb guy. The villian played by Paresh Rawal,and his henchmen, Junior Ajit and \"Kaliaa\" make you laugh in your sleep. Although the movie borrows from a lot of other movies, despite shoddy camerawork, and despite being \"loud\" at times, it remains one of the scarce \"funny\" movies Bombay has come up with after movies like Padosan, Golmal and other Amol Plaekar movies. It is sad that it didn't do well at the box-office, for that means producers turn back to formulas and creativity is abandoned."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "coolchic-1",
        "review_rating": "10",
        "review_title": "Best Indian Comedy Ever!!!!!!!!",
        "review_detailed_main": "This is my favourite Indian movie of all time. It is comic genius. Salman Khan is hilarious. But Amir Khan steals the show with his witty dialogue. Karisma Kapoor's outfits tell a story of their own - makes you wonder if the stylist deliberately made her wear some of the clothes just to make the movie funnier (at one point she looks like she's wearing a nappy). Andaz Apna Apna is the only comedy genre movie to make me laugh from the beginning till the very end. There is not one dull moment, every scene is hilarious, even the songs and dance moves will have you in stitches of laughter. I especially loved the scene in which Amar (Amir Khan) 'regains his memory'. I've seen this movie so many times I've lost count. And I'm so glad to say that this time Bollywood can take all the credit for this fantastic movie as far as I know A.A.A it is not a replicate of a Hollywood movie (THANK GOD). Overall I recommend this movie to anyone who understands Hindi/ Urdu and loves good comedy.\n\nWatch it you'll love it!!!!!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "iqbal_maskatiya",
        "review_rating": "10",
        "review_title": "Best Indian comedy of the Khan era!",
        "review_detailed_main": "It's simply ridiculous how underrated this movie is. It is one of the funniest movies I have ever seen. It never lags, it never slows down, it is a movie that has a wonderful flow to the plot. That along with the brilliant writing makes this an awesome movie. Aamir and Salman are outrageous, even Raveena and Karishma are funny in this movie. Paresh Rawal and Shakti deliver some great bad guy comedy, but Viju Khote and the Ajit-wannabe are the best with their dumbfounded bad-guy intentions. If you want to laugh, and enjoy a movie, watch this movie, do it with family or friends, you will not regret it. Most indian movies tire me out by the end, cause they are 3 hours long. This movie is just as long, but I wish there was more when it ends, cause it's an amazing flick."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sushant_el",
        "review_rating": "",
        "review_title": "Most Comic movie in Recent times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "SnoopyStyle",
        "review_rating": "7",
        "review_title": "Bollywood fun",
        "review_detailed_main": "Raveena Bajaj is an heiress from London who has come to India looking for a man. Amar and Prem are two of the many men trying to make a match. Both slackers are from working class families. The two lying rivals join forces to get rid of the other suitors. Raveena's father's secret twin also has a scheme to get the family fortune.\n\nThis is an old fashion screwball comedy from Bollywood. It has the broad vaudevillian comedy with the prerequisite song and dance. Comedy often struggles to cross national boundaries. Reading subtitles is an extra hurdle that one must fight through. Aamir Khan and Salman Khan are both charismatic performing fools. Their madcap antics are light fun. It's the broadest of comedy in the old fashion sense and one can feel the fun."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "irimpansenior-59135",
        "review_rating": "3",
        "review_title": "Why this is the 108th best movie?",
        "review_detailed_main": "I am really surprised to see this movie as 108th best movie in IMDb. I have watched this movies quite a long time back . I have watched it once. And its not even a one time watch.. I have watched far better comedy movies in Hindi or in any Indian language for that matter. The actors in this movie have become wonderful and performers of Indian cinema, and may be be call it as Indian cinema, But when we talk about this movie, it cannot be in the top 250 list. The rating system should be a little more output oriented. This review and rating is purely on my personal opinion. I am a big fan of Indian cinema. And more over the rating came from just 25k votes, That system should be changed. For a movie to be rated in top 250 , it should have a minimum number of votes . that is my personal opinion."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "chiraag87",
        "review_rating": "10",
        "review_title": "Best Indian Movie Ever",
        "review_detailed_main": "i have been watching this movie repeatedly, since it came out. even though it is 8 years old now, it still cracks me up. the jokes are still hilarious and the way the characters are portrayed will make anybody of any age laugh like they've never laughed before. Enjoy it"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Xstal",
        "review_rating": "6",
        "review_title": "Delhi Belly...",
        "review_detailed_main": "I adore the cinema of India but always struggle with its in your face comedy and this is a full on facial massage. Showcasing the brilliant Aamir Khan before his legendary rise to stardom, it's a tricky navigation to undertake for so long if you're not laughing out loud and, in my case, left me feeling rather empty and evacuated."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Bore_dom",
        "review_rating": "3",
        "review_title": "Woeful - Carry on Film style comedy at best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "avjnp",
        "review_rating": "10",
        "review_title": "DO NOT watch this if HINDI is NOT ur 1st language or u value more TECHNICAL aspects more than ENTERTAINMENT",
        "review_detailed_main": "I m forced to write this because of new reviews of foreigners(who don't speak hindi) who had to watch this movie(because it is in Imdb250) & rating it 1*,3* to lower the rating (so i had to rate 10*).This film is not about TECHNICAL aspects of filmmaking, it is a comedy which depends on ridiculously funny plot, mannerisms & dialogues to provide a laugh riot."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "exinator",
        "review_rating": "10",
        "review_title": "Brilliantly Marvellous",
        "review_detailed_main": "Andaz Apna Apna is a movie that I treasure and its one movie, I don't mind seeing at any time... well almost any time! This movie is simply marvelous and according to me, is the funniest movie I've ever seen! And yes, I do put it over Hera Pheri... reason? Hera Pheri has scenes you'll watch out but Andaz Apna Apna? Not possible! Simply because every scene is a scene you got to watch out for! Aamir & Salman share great chemistry and are perfect in their shoes but I'll put the characters in order of favoritism:\n\nRank # 1. Crime Master Gogo (Shakti Kapoor's best performance till date and yes, this happened before the casting couch): Gogo is an innocent character who belongs to well reputed family of Mogambo (Mr. India fame). Crime Master Gogo is actually Mogambo's nephew but for Mogambo, he's more than a responsible, handsome, charismatic charming son. Gogo, makes the biggest mistake of life by lending 36,000 rupees to Teja (who is as Balla had once said, \"A Fraud and a Cheat!\"). Now, Gogo's only goal is to get back what's his and in his journey of recovering his lost money, Gogo realizes that there is more than 36,000 that he needs to achieve and thus begins... Gogo's struggle against the sinner-world.\n\nRank # 2. Teja (Teja Main Hoon, Mark Idhar Hai!): Teja is an evil character who is Ram Gopal Bajaj's twin. Originally named Shyam Gopal Bajaj, Teja chooses to change his name to suit his personality. Teja, as a child had always envied his brother and then one day, things took a turn for the worse when his father gave his entire wealth to Ram Bajaj. Teja decided to kill his father but in the night's darkness, instead killed Munshi Harish Chandra (Raveena's Dad), though Teja doesn't regret his actions. Teja's sole mission, now, is to get back his property somehow and start his own Poultry & Bakery Farm. Teja also needs to return back the loan to Gogo (but has no intentions whatsoever to do so). In order to achieve his evil goals, Teja employs two people: Robert (Vijay Khote, who is very good at aiming) and Balla (Shahzad Khan, Ajit's clone and son... who is a very very smart boy!)\n\nRank # 3. Amar (Aamir Khan): Wants to marry the rich heiress Raveena, so he sells his father's cheap saloon and heads off for Mumbai. Amar, has no problem taking care of the big business that Raveena's father will hand him over after their wedding and is willing to sacrifice his happiness and shift to London, if needed.\n\nRank # 4. Prem (Salman Khan): After Gogo, Prem is the second most innocent character to appear in the movie and the way Amar tries to take advantage of him in the mask of a friend, is tragic.\n\nI won't reveal any more characters because Jesus Christ! I just wouldn't stop typing! The movie is outright stunning! Go and get the DVD now and beware of those cheap VCDs as they have omitted many good scenes out of the movie.\n\nThe background music is stud and the action is better than the Matrix, especially the final encountered between Prem and Crime Master Gogo (watch out for it), it appears in the climax. Andaz Apna Apna is also a drama with many negative and positive characters and teach us a lot about life and values and ethics. It teaches us about bravery (why else would Amar ask Prem to stay back when they go to meet the kidnapper, even though Prem was complaining that he had to go to the toilet???). Andaz Apna Apna is also a tragedy, especially the scenes where Salman is targeted by Aamir and is given overdose of stomach-upsetting pills, the part where Teja reveals his sad feelings regarding why he couldn't go to London and the part where Gogo is arrested in the ending, without even getting back his 36,000. Andaz Apna Apna is overall a complete package.... sit back and enjoy the ride! Bet there'll be a second ride after that... and then a third!\n\nThe movie was considered a flop back then and I bet no one liked it but buckle up guys! This movie is a big hit! Even if it didn't have enough people coming to theatres, the movie is one of the highest selling Home DVDs and one of the most frequently movie on most of the channels so the producers have laughed their way to the banks long time back!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sghnmbjb",
        "review_rating": "10",
        "review_title": "One of the best comedy movie ever made in Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "falak11mufc",
        "review_rating": "9",
        "review_title": "Hilarious...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "raisaahab",
        "review_rating": "",
        "review_title": "AAILA!--A lots of background things to look for as well.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "gjohri",
        "review_rating": "10",
        "review_title": "Amazingly funny",
        "review_detailed_main": "I find it hard to believe that this movie has such a low rating. It is arguably one of the best comedies ever made, and surely the best Bollywood comedy of the 90s. The film did not do too well on the box office and people had diametrically opposite reactions after seeing it. My guess is most people didn't expect it to be an all-out comedy and were expecting a regular movie. If you love comedies, this is a must-see. And Aamir Khan is outstanding."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "pawana-320-558825",
        "review_rating": "7",
        "review_title": "Funny Funny - but overrated",
        "review_detailed_main": "Funny movie, catch watch multiple times..... It has reached the status of cult movie..but IMO it is overrated..there are lots of other Indian funny movies which I will watch over it like Dharmendra's chupke chupke or Gol maal........but if you still watch it won't disappoint you and will tickle few bones for sure Try editing"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "prtimilsina",
        "review_rating": "3",
        "review_title": "Its so bad, its good....",
        "review_detailed_main": "9 stars for this piece of sh*t? really? This is funny only because it's downright ridiculous. We we watch laugh loud at videos where people slip and fall at banana skins, fart loudly in meetings, kick someone between the legs: this does not mean these are to be considered cult classics. Some of the songs are good, but you could easily hear them on your music player or over the youtube. Performance wise, Aamir proves that he can act really bad and weird at times, Salman is not and never was a good actor. However, acting was never a requirement for this movie. They have excelled in the other department ( screen presence). Going with 3 stars because some scenes are funny because, they are so weird."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "pramodfanda",
        "review_rating": "10",
        "review_title": "Ha..ha..haaa.haa..",
        "review_detailed_main": "This movie is an amazing comedy.. the script is too funny.. if u watch it more than once you will enjoy it more. Though the comedy at times is silly but it really makes u laugh!! Salman Khan and Aamir Khan have given justice to their roles. After 1994 i have not come across any hindi movie which was as funny as this."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Ahead of it's times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "wvriend",
        "review_rating": "4",
        "review_title": "Humor differs with culture, quality clearly not",
        "review_detailed_main": "This top 250 2016 film might be considered funny depending on your sense of humor. On the other hand, the story, script and acting does not match a IMDb top 1000 quotation. Almost three hours is too much for the simple story, the over the top acting, the odd sound effects, etc.. Most of all, the acting of main actor Aamir Khan is far over the top and can become annoying. If you want to see a good Indian movie, do yourself a favour and look at the film's average score of the top 1000 users/scorers at IMDb."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "vinayaktyagi",
        "review_rating": "10",
        "review_title": "Such Comedies r made once in 10 Years",
        "review_detailed_main": "Well to start with Rajkumar Santoshi is not a comedy film maker ,and this is really unfortunate because the only comedy film he has made is a masterpiece.This film is really funny .Loud in bits ,overacted in a few scenes but still the dialogues r really laugh riots and characters r really full of fun . Story line in simple a Billionaire's daughter come to India for marriage and Two young chaps r behind her ,the story has a twist as well with a connection of a Gangster .Aamir playing a street smart guy Amar has played his role with brilliance and Salman has played the role of an innocent stupid to perfection.Raveena has done fine ,but Karshima really turns irritating in some sequences .But real show stealer r Paresh Rawal and Shakti Kapoor ,they enter the frame and automatically u start laughing . Overall such an enjoyable film that u can watch it any no. of times without getting bored."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "burningsoul",
        "review_rating": "10",
        "review_title": "a hilariously funny movie!",
        "review_detailed_main": "a hilariously funny movie! of course u gotta have a sense of humour to be able to appreciate it. the music is excellent, reminded me of 50-60's hindi music which is a rarity nowadays... worth the $$$! go check it out :)"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "SangamYadagiri",
        "review_rating": "",
        "review_title": "good comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "hadjiquest79",
        "review_rating": "10",
        "review_title": "Hilarious Hindi Film",
        "review_detailed_main": "I love this film. Shehzad Khan's portrayal as Bhalla a.k.a. \"Shut up, Robert!\" was so hilarious. Whenever he got hit during a fight scene, you could hear him squeal. Viju Khote is the dumbfounded Robert a.k.a. \"Rabbit\". I love that Shakti Kapoor a.k.a. \"Crime Master Gogo\". Paresh Rawal's double role is so awesomely hilarious for his portrayal as Ramgopal Bajaj & Shyamgopal Bajaj. Raveena Tandon and Karishma Kapoor are out of this world. My brother does a really good mimicry of Bhalla saying. \"Relax. PLEASE relax.\" I love the scene in which Aamir Khan puts a laxative in Salman \"Muscles\" Khan's food which caused the irregular bowel movements forcing him to use the toilet umpteen number of times."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "israr_ar_rafi",
        "review_rating": "10",
        "review_title": "Undoubtedly a classic that deserved better in the box-office",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "ChiBron",
        "review_rating": "8",
        "review_title": "Hilarious, but a little too silly at times.",
        "review_detailed_main": "AAA is definitely among Bollywood's funniest movies of the last 15 years. Thanks to Aamir and Salman's comedic talent, the movie starts off well and is downright hilarious during 70% of its length, but sadly begins to lose pace during the final 30 mins. or so. I don't mind cheesy slapstick humor, but what I do mind is cheesy humor targeted at 6-10 year olds. Some of Salman and the 'Goondas' antics during the 2nd half are downright stupid, and NOT funny. Stuff like 'crime master gogo' may appeal to people who laugh too easily....but it ain't my cup of tea.\n\nNonetheless, barring the final 35 mins. or so and the occasional silly humor, AAA is a laugh-riot not to be missed led by Aamir and Salman's great performances. The chemistry shared between these two is something we probably haven't seen shared between any two actors since. Karishma and Raveena have also lend in fine support. Paresh Rawal's double role is a standout among everybody else. Overall, AAA is a hilarious flick with good repeat value."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "raghibali94",
        "review_rating": "6",
        "review_title": "Good, but not great.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "rowan_vanduren",
        "review_rating": "1",
        "review_title": "This was a horrible movie.",
        "review_detailed_main": "I cannot understand that this movie can be listed in the top 250. The movie has a rating average of 4.3 of the top 1000 voters, which is rating for a bottom rated movie.\n\nI've already seen quite some Hindi movies. My conclusion is most Hindi movies are just average quality. Indeed there are exceptions. The movie 'Dangal' is a good (not super as 8.9 on IMDb) I prefer that IMDb would only list the decent movies in their Top 250. Something remarkable in the top250: Almost all recent Hindi movies are starring Aamir Khan. It's an OK actor, but sorry it's not possible that all his movies are Top250 worthily (with exception maybe 'Dangal'.\n\nIMDb should really redefine the factors, which define a movie for the IMDb Top250 movie.\n\n(1) Top 1000 voters should be an important factor (2) Amount of votes (3) Is the movie new or old. (To avoid hype movies, but also introduce classic movies) ++ Movies should earn there place ++, timeless is also important. (4) Last but not least >> Origin of the voter: Example: An Hindi movie rated by an Italian or American, should have a bigger impact, than an Hindi person.\n\nI'm a Dutch speaking guy, where are used to see several movies in other languages than on native language. This also opens our eyes, regarding what makes a movie good or bad.\n\nI can understand that sometimes you are not always objective in your rating. But I would also understand if rating of foreigners would have a higher weight on the movie. This can make people discover new movies in other languages. Japanese/Swedish/German/Spanish/French movies can be really good."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "gk303007",
        "review_rating": "10",
        "review_title": "11/10 is also less.",
        "review_detailed_main": "Was shocked when i came to know it was flop in its time. But, who knew it would end up a cult classic. Everything was fabulous be it characters, dialogues, set or the fight sequences. Awesome. The only other movie after Sholay whose each and every sequence and dialogue are equally famous and popular. I cant recount but its not less than 10 times i had watched it with full heart and ready to watch again."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "zafar142007",
        "review_rating": "7",
        "review_title": "a classic comedy of deserving fame",
        "review_detailed_main": "This is an old classic. Situational comedy--achieved mainly through hilarious dialogues--is the forte of the film. The story is simplistic, and not much could be said about the filming, or the 4 minute song sequences. Even though the acting is average, the film scores in its genre of silly comedy and infantile dialogues.\n\nWith characters named like 'Crime Master Gogo', bimbos and eccentric caricatures of old Hindi film villains (including Mogambo), there is not a dull moment in the entire film. Aamir Khan and Salman Khan on the screen gel well together. One of the reasons why every scene of this film has tremendous recall value in India, is because it has been screened an insane number of times on TV, and since its forte lies mainly in scene-to-scene situational humour, one would never really need to see the entire movie to enjoy it. So almost everyone would have seen some part of this movie in India. In that way, the absence of any serious plot has actually been helpful in making it a cult comedy.\n\nOverall, a classic of deserving fame."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "michaelradny",
        "review_rating": "1",
        "review_title": "AAA: Another Awful Atrocity",
        "review_detailed_main": "Andaz Apna Apna might well prove how bland, unoriginal and unfunny Indian humor is. Throughout I couldn't help myself but to think how anyone could find this funny in the slightest. The acting, amongst the story are plain and boring, and the whole film is an extremely unnecessary 2 and a half hours.\n\nAndaz Apna Apna may go down a the worst movie in the IMDb top 250. For anyone that is crusading to complete the list, you may have the unfortunate time to have to view this film. Why it has been rated so high is well beyond me, but it is there for now. One of the worst films I've ever seen, alongside Superbabies."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "kulkar2",
        "review_rating": "",
        "review_title": "This is the best out-and-out hindi comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Funniest Bollywood Film of all time",
        "review_detailed_main": "Andaz apna apna is one of the funniest films of all time. Very underrated, which i cant understand. Andaz Apna Apna is a intelligent Comedy which we don't get much of in Bollywood. It has its own style and for a change it is not a copy of any Hollywood or previous Bollywood Film. The Director Raj Kumar Santoshi has given us Many Hits like Ghayal and Khakee. He goes one big step ahead with this movie. Aamir Khan is superb in the most funniest role he has given us. Salman Khan is Very amusing in one of his Best Comedies ever. The actresses are not too bad, Raveena and Karishma. The supporting cast are very good. Paresh Rawail is terrific as usual in a double role. Shakti Kapoor is amazingly funny as the cartoonic Bollywood freaky villain named Crime master Gogo. This is a non stop 2 in a half hours entertainment. This is definitely worth the price, A Must See."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "walentys",
        "review_rating": "8",
        "review_title": "One of the most bizarre comedies ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "littlewoo",
        "review_rating": "8",
        "review_title": "this is both the best AND the worst Indian movie i have ever seen",
        "review_detailed_main": "SOOOOO FUNNY in all the ways it should probably not be. There are scenes that are very much like the Keystone Cop silent films. Such a pathetic fight scene I feel like both clapping for and sending hate mail to the choreographer. But with all the quotable lines and memorable characters (Crime Master GoGo especially), it feels like watching a cult hit for the first time. And it has Aaamir Khan in it, in tight pants, so how bad could it be?? The music is great, but the dancing...eek. However, you can tell that the director really loves movies, just enjoy his enthusiasm as you watch AAA. This movie was so bad, my husband told a friend about it, and now HE thinks he needs to see it."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sakku-fkd",
        "review_rating": "10",
        "review_title": "Best movie Over",
        "review_detailed_main": "Funniest Hindi movie ever seen. Actor Salman khan and Amir khan Rocked it.\n\nI've been watching this movie since i was a kid, i grew up watching this movie , I have seen this movie n no. of time, Its still so refreshing even if i watch it again.\n\nCrime Master GoGo, Aaakho ki goti bana ke khelunga, Hailah, Oooimaa these are signature dialogs.\n\nExcellent Punch lines, each and every character have been chosen so carefully\n\nLove this movie. This is best movie Indian cinema has got."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "himanshujoshi2005",
        "review_rating": "10",
        "review_title": "if u haven't seen it u have missed something awesome!!!!!!",
        "review_detailed_main": "very rarely it happens that i sit down to write a comment for a movie....but this movie!!!!!!oh my holy god!!!!!!!!never ever was there a Hindi movie better than this......and never ever there came a movie better than this......it's the king of all comedies.....\n\naamir khan is arguably the best COMIC actor in Indian film industry...though its funny to say that because he is a class act,not a comedian...but what he has done in this film is perhaps the most hilarious performance by any Indian actor in an out and out comedy...\n\nsalman khan has never been a good actor in my eyes....but this movie got the best out of him....he was innocently comic...if ever there was a term like it....just what the doctor ordered as far as his role in the movie was concerned...\n\nrajkumar santoshi i don't know why, never tried his hand at comedy again....he directed great ventures like The Legend of Bhagat Singh and khakee but could not recreate the magic of andaz apna apna....\n\ni don't care why this film bombed at the box office....though i feel sad that a film like \"hum aapke hain kaun\" was the reason for it's failure...... as of now i hope the rumors become true.....there'll be \"andaz apna apna-2\" they say.......we as the audience can only say AMEN!!!!!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "manohar_rajkumar",
        "review_rating": "3",
        "review_title": "Over-Hyped Comedy movie",
        "review_detailed_main": "There are far better movies in Indian cinema. This movie lacks in better story-line,good plot and well executed screenplay. There are good parts in the movie which make it funny. But to rate it as the comedy movie of the century is a lot over-hyped. Its like the American Pie of Hindi cinema minus the adult content. The acting is also below par standard. Over the course of duration, it becomes dull and irritating. Many remakes have been made based on this movie that are far more better than this one. Like \"Ullathai Allitha\" in Tamil. There are lot more funny movies that deserve far better than this one. Hope my review makes it clear to the common cinema fan."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "shalu1104",
        "review_rating": "10",
        "review_title": "Excellent movie",
        "review_detailed_main": "AAA is my favorite movie... I have seen it a number of times (don't remember the count now) and every time I just love it.... This is the best movie of Raj Kumar Santoshi..The comedy, dialogues, and performance is amazing.. All the actors and actresses have done a superb job... You cannot stop laughing while watching this movie... its just hilarious... Amir khan and Salman Khan have done a great job... and acting by Paresh Rawal was excellent as always..... The music is inspired from the old Hindi movies (60s music) and is good...the entire cast of the movie has done great job...\n\nOverall its a great Indian comedy movie to watch..."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "svorva",
        "review_rating": "5",
        "review_title": "Justfied?",
        "review_detailed_main": "Andaz Apna Apna is the most recent instance of a growing trend of Bollywood movies to briefly surface on IMDb's Top 250. Personally I have found these films hit or miss, and Andaz joins the clear misses. Films with almost a perfect rating need to justify themselves. Certainly a victim of high expectations, Andaz failed to update or improve comic shticks that were unoriginal fifty years ago. Energetic and upbeat, this film had its heart in the right place, but could rarely elevate jokes above the \"smirk\" level. Every character was initially amusing, but their simplicity and lack of evolution aggravated the already substantial run time. The music was not even memorable. This is not to say I hate the movie or was even particularly bored. Hijinks were certainly abound. I was never surprised by any outcome, but was at least amused watching each bit of chicanery unfold. Humor is arguably the most subject aspect of film, and I will surely not claim that I was able to pick up every subtlety across the language barrier. I am happy for the many who enjoyed this film more than I. Andaz Apna Apna was simply not inspiring. An average film."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Laiticia4u",
        "review_rating": "",
        "review_title": "Great!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jeshj316",
        "review_rating": "10",
        "review_title": "Career best from Santoshi",
        "review_detailed_main": "If anyone says this movie is funny, that would be an understatement for sure. This one is Hilarious, a laughter riot!! It has potential to bring your mood from sad to stomach aching funny...\n\nI saw this movie in every mood and end result was same, was fresh and happy by the time I completed the movie. And I watched it for more than 50 times. Each and every character in the movie has a cult following in itself... Amar n Prem's AAILA UIMA.. crime master Gogo.. Ram Gopal Babaj n Shyam Gopal Bajaj (aka Teja)'s double role... super-smart Bhalla n Robert... half-brain blonds Ravina n Karishma... just to name a few..\n\nNot only characters, movie has unforgettable dialogs and scenes... one of the intelligent joke.. remember the coin flipping sequence... Anand Akela asks \"tum logo ne sholay dekhi hai??\" Prem replies \"haan haan, dus baar\".. Amar snaps \"Iske baap ne likhi hai\".. as Sholay was written by Salim Khan (Salman's father in real life) and Javed Akhtar... quite intelligent..\n\nfrom 1994 (release date) to 2010, I'm yet to meet a person who didn't like this movie, but alas this movie was not even a hit during that time..\n\nThere were many movies came before and after AAA, but none come even close to it in craziness factor... hats off AAA"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "markovd111",
        "review_rating": "8",
        "review_title": "Unbiased western review!",
        "review_detailed_main": "So, what exactly is \"Andaz Apna Apna\"? It's actually your typical Bollywood movie with love triangle, dance and singing scenes and a lot of cringe moments. I find Indian movies fascinating because they are so naive and silly it hurts and you feel like a kid made them, but at the same time you cannot help yourself not to enjoy them. While jokes don't always hit the mark, there are many scenes in this movies which are very funny and even some of the songs are catchy. Oh, and acting is decent, though not devoid of usual Indian exaggerating! All in all, \"Andaz Apna Apna\" is a fun ride from start to finish. You just have to turn off your brain and not compare this movie to western ones because it's entirely different world! 8.5/10!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "shu-04699",
        "review_rating": "10",
        "review_title": "no one can rate this movie.. its best",
        "review_detailed_main": "This film gonna live forever and will go on for many generations"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "nitinabhishek21",
        "review_rating": "9",
        "review_title": "Thia movie is a very exceptional case of indian cinema",
        "review_detailed_main": "Well... This movie was a flop at box office as many imdb users who saw the movie for the first time would agree. The movie later started getting telecasted in indian TV channels and over the years and years it became \"The cult classic of Indian Cinema\" . Whats the reason ? The reason is the subtle moments . When you see the movie for the first time you don't know whats gonna come next and you don't focus on the subtle moments. You see it again and you get few things but still not very great for you. Now you see other set of people praising the movie like hell! You start noticing few scenes which are like a laugh riot for huge group of people but wasn't so for yourself . And when you again watch those scene to understand why others are laughing , that is the moment you get into the minute subtle moments of the film which makes it great. The movie is literally like a red wine which you like more when it becomes older i.e. when you watch it again and again . Subtle moments like Aamir displaying football with the glass and Salman taking a burp while drinking the sharbat , \"ye teza teza kya hai\" remark of Shakti Kapoor, \"Teza mai hun mark idhar hai \" of Paresh Rawal , etc and etc couldn't be enjoyed if watched for the first time by many , but these scenes become the laugh riot and defining scenes of the movie later."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "abbasalib8",
        "review_rating": "10",
        "review_title": "An enviable comic ensemble",
        "review_detailed_main": "Mehmood saahab Jagdeep sir Paresh Rawal Shakti Kapoor Tiku talsania Viju Khote Aamir & Salman at their first and best attempt at comedy Not to forget raveena & karisma\n\nAnd above all The director Mr. Rajkumar Santoshi\n\nA big big thankyou This for crores of fans is the best movie and I am one of them"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "JakeBrinkman",
        "review_rating": "2",
        "review_title": "\"Comedy\"",
        "review_detailed_main": "The comedy in this movie is so old and unrealistic that I'm not sure how anyone today could actually crack a smile at it, let alone laugh. The writing feels like it was made in the 1930s-1950s despite being written long after many comedic greats have been produced."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "dhakateakash",
        "review_rating": "10",
        "review_title": "Only Parody movie made in India!",
        "review_detailed_main": "The movie has multiple references of various movies, actors and events. Watch closely and you will appreciate each and every scene and it's brilliance!! Happy watching !"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "thomsonfelix",
        "review_rating": "2",
        "review_title": "Not worth",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "irfanirfa",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "devangpandya-07675",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "One movie I have seen more than 160 times & I still enjoy as much as I had enjoyed the movie for the first time! I wish I could give 20 out of 10 stars. Though this epic movie was flopped in the cinema halls initially, I consider myself so lucky to witness this greatest comedy in a theatre and that experience is still very fresh in my memory. I and my friends literally laughed to death. This movie can't be compared with any other Indian movie. I just want to thank Rajkumar Santoshi ji, Aamir, Salman & entire team a BIG thank you on behalf of billions of fans of this greatest comedy ever."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Highly under-rated classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "coolzain_me",
        "review_rating": "10",
        "review_title": "Best Movie Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "anarachy",
        "review_rating": "10",
        "review_title": "The smartest , funniest film ever produced by Indian Cenima......",
        "review_detailed_main": "The first time I watched it was when it came out (1994), and the last time I watched it was just before writing this review.. It still makes me laugh my brains out...after all these years,it dose not disappoint. Truly the smartest Bollywood comedy ever made. This is one Indian movie which deserves its place in the IMDb Top 250. Aamir Khan and Salman Khan in probably one of their best performances in comedic roles. The thing that makes this one a time less classic is its comic timing and wonderful editing...The jokes are refreshing and not cheap.. This is one film truly ahead of its time. If you haven't seen it yet GO WATCH IT NOW !!!!!!!!!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "brackster007",
        "review_rating": "9",
        "review_title": "I would call this a perfect Hindi stoned comic",
        "review_detailed_main": "The best part about this movie is that you can watch it over and over again n still not be content of watching it. I have watched this movie least 10 times over the past 12 years and still it makes me laugh as if i was watching it for the first time. I have great liking for good comics like the Orgazmo,Cheech n chong, Monty Python series and many others but this one in Hindi is one of my favorite outstanding movies. Some of them recently in Hindi are Golmaal,Munnabhai series and Herapheri series. SO all i can say is Hind comedy is finally evolving. But Andaaz Apna Apna is pretty different from the movies i have said above. Its what i call the Hindi stoned comedy and very few of the kind found around 1994 in Hindi cinema.Cheers to Rajkumar Santoshi for the brilliant movie."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Vartiainen",
        "review_rating": "3",
        "review_title": "Sometimes humour simply doesn't translate",
        "review_detailed_main": "Everyone Has Their Own Style, or Andaz Apna Apna, is an Indian comedy starring Amir Khaan and Salman Khan as two good-looking losers, who decide that their way to riches is to woo a rich heiress who has returned to India to look for a husband. Unfortunately their \"romantic\" efforts are constantly interrupted by scheming bad guys, questionable plots and random comic book villains. Yes, comic book villains.\n\nWe'll return to our two main leads and their despicability in a moment. But first, let's talk about the actual comedy. This era of Indian film-making seems to think that it's the height of humour for the main character to say something that gets misunderstood, pull a funny face and get whacked on the top of their head. That's about three quarters of the jokes in this film. Stuff you would see in Looney Tunes here in the West. Except more subdued and slow because it's a life-action film.\n\nAnd I'm sorry, but that's just not funny. Perhaps it is to an Indian audience. From what I've read, this is a beloved comedy classic in India. But humour is very subjective and often very hard to translate. And this is a fine example of just that.\n\nIt doesn't help that I found the two main characters to be utterly loathsome human beings. Everything they do, they do for money. Sure, the film tries to convince you that they end up caring for the heiress and her household, but that's a lie. These two shouldn't get the girls at the end of the film. That's a horrible message to convey to your audience. A sick, disgusting message.\n\nNot a good film. This comedy is not funny, subtle or benign. If given the chance, give it a hard skip."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jasjit_us",
        "review_rating": "10",
        "review_title": "One of the best movies ever",
        "review_detailed_main": "Andaz Apna Apna in my opinion ranks among the top 5 comedy movies of all languages that I have ever watched. The jokes comes hard and fast and they never stop. Aamir and Salman are in top form and no one overshadows the other.\n\nThe characters, every one of them performs so well, that it all gels together.\n\nHowever, this madcap movie mayhem may go over the heads of non-Hindi viewers, a cultural grounding of India and Hindi, is just as important to appreciate it as in sense of understanding comedy.\n\nIt is no different from me wondering why so many western English movies get some so high ratings but make little sense. Examples are the superhero movies. But I respect their ratings, because I understands my limitations to appreciate them.\n\nTo illustrate my point- ANDAZ APNA APNA IS STILL EVERY BIT AS FUNNY AS IT WAS 20 YEARS AGO. BUT NOT IF YOU TRANSLATE THE DIALOGUES, THOUGH THE TRANSLATIONS ARE FUNNY IN THEIR OWN WAY. HERE ARE SOME OF THE FILM'S BEST MOMENTS, KILLED BY ENGLISH. Andaz Apna Apna is still every bit as funny as it was 20 years ago. But not if you translate the dialogues, though the translations are funny in their own way. Here are some of the film's best moments, killed by English. Haila, Juhi Chawla: Goodness, Juhi Chawla\n\nKud kud ke chalega, kud kud ke chalega: It will jump jump and go, jump jump and go.\n\nAise lag raha hai jaise bandar ke sar pe tarbooz: He looks like a monkey with a watermelon on his head.\n\nGalti se mistake ho gaya: By error a mistake happened.\n\nAap bare woh ho. Kya? Woh. Kya? Woh na. Oh, woh. Woh toh main hoon: You very like that. What? Like that. What? Like that only. Oh like that. That I am like.\n\nYeh Vasco da Gama ki gun hai. Kiske mama ki gun?: This is Vasco da Gama's gun. Whose uncle's gun?\n\nUnkey ek ek sawaal, hamare do do jawaab. Sawaal ek, jawaab do: He had one one question, we had two two answers. Question one, answers two.\n\nKhandaani chor hoon main, khandaani: I am a dynastic thief, dynastic.\n\nBread ka badshah or omelette ka raja - Bajaj! Hamara Bajaj: Emperor of bread and king of omelettes, Bajaj. Our Bajaj.\n\nGogoji aapka ghagra: Gogo sir, your skirt."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "catchuec",
        "review_rating": "2",
        "review_title": "Silly Comedy",
        "review_detailed_main": "The movie might have been good when it was release but it is a little too silly for the 21st century. After movies like Hera Pheri, Munnabhai etc. this movie stands nowhere in comparison. The movie revolves around two silly men (Amar and Prem) trying to impress the heiress of a rich man but the acts they do in the course are totally childish and only stupid people can enjoy such things.\n\nI can't believe this movie came from the same director who made legendary films like \"Pukar\" and \"The Legend of Bhagat Singh\". I wonder how can people consider Andaz Apna Apna to be one of the best Hindi comedies ever. The only thing I found funny about this film was that people find this film funny."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "miko-chan",
        "review_rating": "",
        "review_title": "I make marbles out of your eyeballs.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "vishal_wall",
        "review_rating": "10",
        "review_title": "Apna?? Apna??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "srikz-01",
        "review_rating": "10",
        "review_title": "Please watch only if you understand Hindi",
        "review_detailed_main": "It is a light-heart old Indian comic , suitable only for the audience from Indian Sub-continent. My dear Non-Hindi speaking friends , its a good movie only if you understand Hindi . Does not make any sense for you to watch the movie dubbed in any other language ( as the comedy and timing goes well with the native language) because it is in TOP 250 list and then write a review that would be titled as \"Spoiled My day \" . No offense to anyone , everyone has their freedom to express their views like I did :)\n\nI have seen many non-Indian friends complaining about this , thus writing this review ."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "saad565",
        "review_rating": "10",
        "review_title": "Do chaye q? aik chaye wapis aik chaye wapis!",
        "review_detailed_main": "What a movie. No hanky panky business. No dirty stuff. Even today this movie is going to cheer you up. This is some thing todays generation should watch and get inspired because this is the true meaning of comedy movie! the expressions, the gestures, the jokes and time momentum of this move is all amazing. You have to watch it very closely to pick up a lot of not too obvious jokes. For example when Amir khan walks in to the restaurant where he meets a person telling him about union strike. There Amir asks him for his cigarette to light his biri. After lighting up his biri he returned his biri instead the cigarette. Fun stuff. Every time Bhalla goes to rober \"follow me\" robert starts leading in front. What a funny movie. I just finished watching it for like 100th time or more."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jaamr",
        "review_rating": "10",
        "review_title": "Epitome of comedy",
        "review_detailed_main": "This is a milestone in Indian cinema. I must have watched this movie hundreds of times and know each and every dialouge but still cant get it enough of it. I can watch it every day of my life and still will not get bored. Every scene is done perfectly and none of actor over did the comedy. It was just subtle funny moments that are stitched together to make this master piece."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "mdamir-74018",
        "review_rating": "9",
        "review_title": "THE BEST COMEDY FILM EVER",
        "review_detailed_main": "Such a great comic story with iconic characters. This film is above the words , marvellous/ masterpiece/ cult classic /iconic."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "MartinTeller",
        "review_rating": "4",
        "review_title": "Andaz Apna Apna (1994)",
        "review_detailed_main": "Almost fascinating in its awfulness. There's very little funny going on in this \"comedy\" full of goofy sound effects, exaggerated facial expressions, dumb slapstick, diarrhea gags, and wacky mix-ups. Stuff like VEER-ZAARA is merely trite and clichéd, but this is painfully obnoxious. I thought Salman Khan was the most ridiculous star in Bollywood, but Aamir Khan (who is great in LAGAAN) matches him every step of the way, both of them being grating knuckleheads (not to mention the horrible fashion sense and bad mullets). The sad thing is there actually are some decent comic ideas in the script, but it's all executed so amateurishly and clearly aimed at the lowest common denominator. There were a few moments I found myself having fun with it, but then something stupid would happen and ruin it all over it again. Even the songs are disappointing. Ugh."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "kishoremehta-55692",
        "review_rating": "10",
        "review_title": "G(old)",
        "review_detailed_main": "Rare indian historical comic movie. I find it funny every time i watch."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "amitjodha99",
        "review_rating": "4",
        "review_title": "It may be iconic, but it was not funny",
        "review_detailed_main": "Only desperate audiences who have never seen comedy can find this movie funny, as I'd call stupid to the point that it's almost irritating.\n\nIndia already had comedy movies, and the golden era for comedy was definitely the 2000's where we saw Salman in No Entry, MPKK among his other funny acts, and even Amir had 3 idiots to his credit, which is amazing in every way. We don't need this movie to be among the most iconic comedies of Indian cinema.\n\nNow, let's call the film what it really is, it's iconic alright, due to Salman and Amir being together and making a slapstick that can be termed as mindless comedy. But the sheer amount of stupidity and borrowed dialogues really tries to make you stop the whole thing, but you just survive in order to complete the thing thinking that this is the only time we are seeing these two guys together and it should be funny afterword.\n\nThis is the trend shown by the film on Imdb as well, where it was the highest rated Bollywood movie at a time and now it's down to a more reasonable 61st position, which is still high given that original good comedies like Welcome don't feature in the list, but the rank is sure to increase once more people see it in search of good cinema and find it underwhelming.\n\nJaane Bhi do yaaro was much better just on the fact that it at least came before this and hence was more original."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "w-jaiswal21",
        "review_rating": "10",
        "review_title": "Why a 10/10 rating, you ask?",
        "review_detailed_main": "I will always rate this movie all stars, whether the scale is of 10, 100, or even a 1000 stars. My prime reason is this is a pure and true comedy in every sense of the word. This is what comedy is all about. You ask me to buy confusion as comedy, I won't. You ask me to buy insult as comedy, I won't. If you watch this movie thoroughly, you will notice the hero of the movie is the script, the screenplay, the dialogues, the situations, the context, and everything else that is similar. Never ever you will feel that something or some situation is being thrust upon the audiences. You will laugh at all the small things in this movie, if you notice. For example, the random money that the guys give to shyamgopal Bajaj, the number is also funny, INR 8535.29. And the reply that Bajaj says, \"Ye firauti ke paise hain ki mayyat ka Chanda hai\" You won't be able to stop your laughter. Plus this is only a few of those movies that do not make you uncomfortable while watching with your family.\n\nAnother such movies that I would recommend is Dhamaal. Pure raw comedy."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Overlong but generally very funny comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "namashi_1",
        "review_rating": "10",
        "review_title": "A Magnificent Comedy!",
        "review_detailed_main": "Rajkumar Santoshi's Cult-Comedy 'Andaz Apna Apna' is a classic that has aged well. Its still as funny, as silly & as entertaining as it was 2 decades ago. I re-watched it & believe me people, I laughed till my lungs began to hurt!\n\n'Andaz Apna Apna' Synopsis: Two con men competing for the hand of a heiress get drawn into love - and into trying to save her from an evil criminal.\n\n'Andaz Apna Apna' is unabashedly silly & also non-sense at times. But that's its charm. Santoshi's Screenplay is hilarious & offers tremendous scope for spontaneity. While he Directs this wacky tale with such freeness & energy, its hard to lose focus at any given time. Watching the nutty protagonists fight for love, money & madness, thoroughly engages you!\n\nThe Performances are flat-out hilarious too. Aamir Khan & Salman Khan are the comedic duo of, perhaps, all-times! As Amar & Prem respectively, the Superstars are at their funniest best & their on-screen camaraderie is the highpoint of the enterprise. Raveena Tandon & Karishma Kapoor willingly add to the craziness, while Paresh Rawal is mesmerizing in dual roles. Viju Khote & Shehzad Khan are superb too. But its Shakti Kapoor's Tour-De-Force as Crime Master Gogo, that merits the highest praise.\n\nOn the whole, 'Andaz Apna Apna' is comedic magic!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "ashu-modi",
        "review_rating": "10",
        "review_title": "A must watch for any Indian film buff",
        "review_detailed_main": "Before Aamir had his 3 Idiots, Salman had Dabbang, before Paresh Rawal became the King of Bollywood comedies ala Heri Pheri, before Karishma dropped the 'h' (and the Hindi film industry dropped her) to become Karisma and Raveena was the Mast Mast girl, there was Andaz Apna Apna.\n\nThis is one of the best movies to have come out of the Indian film industry post the new age cinema wave of the 70s. After the dime-a-dozen masala potboilers of the 80s (not to take away anything from the films of that decade: different times, different sensibilities) Andaz Apna Apna was like a breath of fresh air. The antics of the entire cast leaves the viewers in splits. The comedy might be a bit slapstick and the editing a bit shoddy, but the performances seem at ease. I remember watching this movie in the theater: the laughter never died: it was one gag after the other.\n\nEven after all these years, I remember all the dialogues in the movie. And like another all time great Jaane Bhi Do Yaaron, this movie does come up for discussion each time my friends and I watch any new comedy to come out of the Hindi film industry, serving as a benchmark.\n\nP.S. I have watched the movie at least 15 times :)"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "shubh-shbm",
        "review_rating": "10",
        "review_title": "my favourite comedy movie of all time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "ymousnona123",
        "review_rating": "10",
        "review_title": "Best Hindi comedy movie I've ever watched!",
        "review_detailed_main": "I don't really write reviews, but I felt compelled after reading some of the more recent reviews on this film. First of all, yes there are many people who enjoy this movie due to nostalgic reasons. If you are someone who wants to watch this movie past the year 2015 and you've never seen it before, then yes the movie might seem really outdated. However, I think you need to give it a chance! When the movie first released, it was considered a flop! It began to gain recognition later on. So, one cannot dismiss it based on its release date.\n\nI watched this movie when I was a kid and I laughed at the awfully choreographed fight scenes because I thought they looked stupid. Now, I am in my mid-twenties and every time I watch this film, I remind myself that this movie doesn't take itself seriously. So why should I?\n\nThe performances are great, especially Aamir Khan's acting. Even the \"villains\" are hilarious, and Paresh Rawal is a wonderful actor. I would have to say my favorite character was crime master Gogo (Shakti Kapoor). He is supposed to be the bad guy, but he's pretty naive and every scene of his is wonderfully humorous.\n\nI've watched this movie countless of times, and each time I laugh from beginning to the end. It's original, and it's comic genius! Every single scene, song, dialogue, and behavior is intentionally meant to make its audience laugh. It's a silly movie that doesn't shy away from laughing at itself. The best thing about this movie is kid friendly. It doesn't rely on vulgarities to make its audience laugh.\n\nIf you just want to sit back and watch a light comedy, then this is it!\n\nI would like to add that it might not be as funny to those who do not speak or understand Hindi. This movie's humor is highly specific and there are a lot of rhyming jokes that just would not work via subtitles or dubbing. It can get lost in translation."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "I just was not the intended audience for this one.",
        "review_detailed_main": "I am no expert on Indian films. While I have seen at least a couple hundred, which is very unusual for an American, compared to most Indians I am far from being an expert! In fact, I have noticed that nearly all the films I have seen and reviewed from India were made after the mid-1990s. Now I mean no offense by this, but I notice a HUGE difference in the quality of the films made before this and after. The earlier films tended to have poor sound (the dance music sounds canned), the acting is broader quality-wise most of these earlier films don't come close to the quality of Hollywood's productions. But this definitely has changed in recent years, and now often Indian movies are among the best and highest quality you can find.\n\nI decided to watch \"Andaz Apna Apna\" even though it is an older Indian film because I have so enjoyed the movies of Aamir Khan....and Salman Khan to a lesser extent. But I soon realized the film would not appeal to me for a variety of reasons. The sound quality was terrible...cheap and flat. The acting was broad and over-the-top...and about as subtle as an episode of \"Benny Hill\" (at best). Finally, the film makes many references to films made before 1994 and apart from a few films where and there and the very realistic movies of Satyajit Ray, I just didn't understand the references. Had I been Indian and grew up with the films, I am sure I would have appreciated it much more.\n\nSo this is my verdict. If you like older Indian films and don't mind ridiculous comedy (accompanied by funny sound effects and broad overacting), you'll probably love it. But for westerners not in love with older Indian films, it will be a chore to finish."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "pyare_mohan_aryan",
        "review_rating": "10",
        "review_title": "The Best Comedy Movie Ever seen !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "abhivankit",
        "review_rating": "1",
        "review_title": "Over-rated",
        "review_detailed_main": "I simply fail to understand the parts which are supposed to be funny in this movie. Aamir and Salman both mentioned in their interviews that the test audience watching the rushes of AAA were ROFL-ing. If that is so, then they must have definitely watched some other version of the movie. Because the real audience back then in the theatres didn't find anything funny, and it's fate at the box office is known to everyone."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jahangirhussain74",
        "review_rating": "",
        "review_title": "Watch it only for the performances and comedy but don't expect logic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "anand_anderson_hunt",
        "review_rating": "10",
        "review_title": "Surely among top 10 movies you should watch before you die.",
        "review_detailed_main": "I have seen lots of movies from all around the world. I have watched lots of western comedies , from china , from japan, Korea, from India too. But Andaz Apna Apna is a class apart. Comedy in this movie is not cheap, it does not involve any cheap adult dialogue or comments like western comedies. It has very simple dialogues and body gestures which makes you laugh, which gives the sense that the writer and director has really worked hard on the movie so that every section of the society can enjoy it. You got to understand Indian humor in order to enjoy this movie. I feel sorry for western or other countries audience they will miss this super comedy. I have watched it like 10000 times and I still watch it and will do so till I live. Thank you Raj Kumar santoshi for making this movie."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "asksahil",
        "review_rating": "10",
        "review_title": "Main To Kehta Hu Ki Aap Purush hi nahi hai.................",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jsbco2000",
        "review_rating": "10",
        "review_title": "The film works and how!",
        "review_detailed_main": "According to me, a movie can be best rated by the number of 'best scenes' there are. There are probably at least 80-90 scenes in the whole movie that is probably rated as 'best' by somebody or the other.\n\nThis movie is a masterpiece. Period. I know many who have called it ahead of its time, probably because it bombed at box-office. However, I think any generation can relate to this movie and have a good laugh through out.\n\nI am personally glad that Mahmood is part of the movie too. His role isn't that 'meaty', however its good to see that he is a part of the cast in the funniest Hindi movie ever."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jitendramodi",
        "review_rating": "10",
        "review_title": "Awsome Just Awsome 90s movie",
        "review_detailed_main": "An absolute benchmark for how a comedy movie should be made, more than 95% of the movie scenes are comic , the best part is that there is no serious scene in the entire movie. Full of super amazing characters, I think everything just worked for this movie."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Internet_User_Forever",
        "review_rating": "9",
        "review_title": "Great time-pass movie!",
        "review_detailed_main": "The jokes are great and non vulgar, Aamir Khan, Paresh Rawal, Shakti Kapoor acted really well. Even Salman Khan was fairly good too. The confusion between who is Raveena and who is Bajaj end up in a hilarious mess up! Definitely watch."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "aircel13",
        "review_rating": "1",
        "review_title": "Wrost Movie",
        "review_detailed_main": "such a big bore.. did't\\'t like it .. not much entertaining...\n\nWhen Aamir Khan and 'Salman Khan' were approached to sign the contract for the movie each of them wanted more screen time than the other, but finally settled on being on screen for the same amount of time. See more » Goofs: Continuity: In the climax when Aamir tells Crime master Gogo more about his childhood expression, Gogo in a long shot holding a gun on his right hand happily shouts to everyone about what others were thinking about him. A close-up is followed afterwords and it is visibly clear that Gogo is holding the same gun on his left hand without revealing why and how. See more »"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "ankurashwinmehta",
        "review_rating": "9",
        "review_title": "What a movie.. True example of a sleeper hit....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "classicsoncall",
        "review_rating": "3",
        "review_title": "\"The stars of my destiny are about to shine!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "aries7at6",
        "review_rating": "",
        "review_title": "just sit and enjoy the ride.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "rabeenj-97464",
        "review_rating": "10",
        "review_title": "Bound to be a cult classic",
        "review_detailed_main": "This movie is best to watch with friends and family with lot of inside jokes and lot of clever scenes which makes you appreciate this movie more on rewatch."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sharma-rajesh352",
        "review_rating": "10",
        "review_title": "Only for hindi understanding people",
        "review_detailed_main": "This is the best comedy film ever made, not just bollywood but all film industries I am talking about. After Sholay this is the only movie whose dialogues are still after 25 years so popular. I will give 11 out of 10 only if possible."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "disharma-24131",
        "review_rating": "10",
        "review_title": "Andaz Apna Apna\" is a timeless comedy that has stood the test of time",
        "review_detailed_main": "Rajkumar Santoshi's 1994 release of the iconic Bollywood comedy Andaz Apna Apna deserves to be commended. Starring Aamir Khan, Salman Khan, Raveena Tandon, and Karisma Kapoor in lead roles, the film has achieved a cult status over the years and is widely regarded as one of the funniest films in Indian cinema.\n\nThe comedy-drama centres on the amusing exploits of two slackers named Amar (Aamir Khan) and Prem (Salman Khan), who want to marry a rich heiress in order to get affluent. The comedy-drama centres on the amusing exploits of two slackers named Amar (Aamir Khan) and Prem (Salman Khan), who want to marry a rich heiress in order to get affluent.\n\nThey both fall in love with the same girl, Raveena (Raveena Tandon), and try to win her heart. However, their plans take a comic turn when a villainous duo, Teja (Paresh Rawal) and his sidekick Robert (Viju Khote), enter the picture with their own nefarious intentions.\n\nOne of the biggest strengths of \"Andaz Apna Apna\" is its incredible comic timing and witty dialogues. The film is packed with hilarious one-liners and slapstick humor that still manage to tickle the audience's funny bone even after all these years. Aamir Khan and Salman Khan's on-screen chemistry is fantastic, and they deliver their dialogues with impeccable comedic timing, elevating the humor to another level.\n\nThe film also features memorable supporting performances, including Shakti Kapoor as Crime Master Gogo, who has become an iconic character in Indian cinema. The music of the film, composed by Jatin-Lalit, is catchy and adds to the overall entertainment value.\n\nHowever, \"Andaz Apna Apna\" did not fare well at the box office upon its initial release. It was only in the years following its release that the film gained popularity and became a cult classic through television reruns and word-of-mouth recommendations.\n\nOverall, \"Andaz Apna Apna\" is a timeless comedy that has stood the test of time. It is a must-watch for anyone who enjoys light-hearted humor and wants to experience one of the most beloved comedy films in Indian cinema."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "prashantvashishth",
        "review_rating": "10",
        "review_title": "Next freakin level!!!",
        "review_detailed_main": "Never have I seen a better movie than AAA when it comes to comedy. Watch the flick without a second thought: I assure you'd watch it again and again and again and never get jaded of its masterclass."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "IPyaarCinema",
        "review_rating": "9",
        "review_title": "Enjoy With your family",
        "review_detailed_main": "Review By Kamal K\n\nIn a parallel universe \"AAA\" could have been forgotten for its over acting and silly dialogues. However, there in lies its genius. This is a movie for the ages as it can be seen with the family across all ages and even the most poker faced member would clutch his stomach laughing . This is also a movie that can be seen many times across one's lifetime. Kudos to Raj Kumar Santoshi & Team for giving us 160minutes of 'Pure Happiness'. No wonder, it has achieved a cult status in the comedy genre."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "briancham1994",
        "review_rating": "3",
        "review_title": "Extremely silly",
        "review_detailed_main": "This film has the energy of some overactive school students who discovered a video camera for the first time and improvised some very nonsensical skits. If that's your style of humour, then watch and appreciate all the fun surrealism. But if you're like me, don't waste your time."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jsincro",
        "review_rating": "10",
        "review_title": "This film is for those who understand hindi really well!",
        "review_detailed_main": "And also for those who understand comedy well.\n\nFor those who are genetically depressed souls, this film wont help clear the blues.\n\nThen there are those who get very technical about a film and miss the overall feel- those types will also rate this film low.\n\nThis is a go to movie for me whenever I am down or need a break from the realities of life.\n\nThis movie has a different world feel of it's own, the innocence in all it's characters - even the Dark characters with their biggest dream of starting a poultry farm- simply warm your heart throughout the run time of the film.\n\nThis is a must watch .\n\nGive your over logical brain a break.\n\nBut this film has a logic of it's own, and it is smooth and that's what makes it so funny!\n\nWatch it!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "akumbhar",
        "review_rating": "5",
        "review_title": "One word review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "shrikant-narayanan",
        "review_rating": "",
        "review_title": "Remake of Tamil comedy films Bommalattam and Thenmazhai and scene borrowed from Adimai Penn",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "anandkaran",
        "review_rating": "9",
        "review_title": "Movie was great",
        "review_detailed_main": "Songs were more funnier then movie enjoyed watching the movie after gew drinks."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "IdlyViswanath",
        "review_rating": "8",
        "review_title": "Cult Classic Hindi Comedy",
        "review_detailed_main": "Rajkumar Santoshi's Andaz Apna Apna is about Amar and Prem who are trying to marry a rich man's daughter, Karishma. How they convince Karishma to fall in love with one of them and how they compete with one another makes the movie, while Karishma is facing threats from a doppelganger of her own father, makes up the movie.\n\nOne of the most favorite aspects of this movie for me was the music. Each song was a gem, and since I watched it yesterday I have been listening to all the songs on loop. The music was a great call back to the classic songs of the late 70s and early 80s. Wonderful music and I loved the references within the songs to different actors and iconic songs.\n\nThe comedy of the movie was really good, it was the right amount of fun. I usually find myself bored in a lot of recent Hindi comedies, especially the Akshay Kumar ones like Good Newz and even Welcome. I just find them boring and cringey and too over the top for my taste. But Andaz Apna Apna was the perfect comedy and will from now on be my go to comedy in Hindi cinema. So glad I finally got myself to watch them.\n\nThe acting in the movie was really good and it was filled with a great star cast. I put it aside a little as I'm not a fan of Aamir Khan, although I mostly watched his post Dhoom 3 movies which had some good movies but bad acting for most part imo. But he was amazing in Andaz Apna Apna, and I definitely want to explore his 90s movies and classics more now. I love SRK because I did this kind of exploration of how he grew through 90s and 2000s, want to do it with Aamir now too. Salman was fine, he was fun to watch with his mannerisms. Paresh Rawal was a laugh riot, love the man in anything I watch, and he did not disappoint a single bit in this film. I was not very familiar with Shakthi Kapoor prior to watching AAA, but now I will remember him forever as Captain GoGo that is the most iconic comedic villain in Hindi cinema for me. I would not at all have minded a spin off after this for Captain Gogo. Raveena Tandon and Karishma Kapoor did well in their roles, I liked the twists and turns and the meta humor with their names.\n\nHonestly, after watching the film, I was surprised to learn it flopped. But I am glad it reached cult classic status and it will be one of the classic. Overall, a great comedy which everyone should try. Also please enjoy the album, it's such a banger."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "rahulsanyukkta",
        "review_rating": "10",
        "review_title": "Hilarious Comedy Ever! Great..!!",
        "review_detailed_main": "Hats off to all coincidences which makes such a possibility like AAA. Great Comedy, great dialogue delivery, every thing is just great. Every one in the movie is best fit. Direction of Santoshi amused me and at the same like the way he directed with excellent sense of humor. No challenge about the performance of Salman, Aamir, Raveena, Karisma, and specially Paresh Rawal with Crime master Gogo. And also other team made it best performance in their carrier I think so. Rajkumar Santoshi made various experiments in the movie like using old songs with classic music and lyrics...just awesome. Also a variety of comedy scenes with hilarious punches."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "qewlpal-101-247849",
        "review_rating": "10",
        "review_title": "Greatest Comedy film from India, subjectively of course.",
        "review_detailed_main": "Watched atleast fifty times, and found new scenes and dialogues that were hilarious, that I missed the previous times for each re-watch. Best comedy movie from India, for my subjective taste."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "dnisha-28732",
        "review_rating": "10",
        "review_title": "Cult classic",
        "review_detailed_main": "Very rarely it happens that people remember all the dialogues of a movie and use them in their conversations. Movies like this one, Sholay and DDLJ are few of those.. This is my all time favourite. It will never lose its charm and will never get old!!!!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "krishsingh-35435",
        "review_rating": "1",
        "review_title": "UTTER CRAP",
        "review_detailed_main": "I always thought that it's a masterpiece, but it's nowhere near to the F of funny.\n\nGod knows why it has a rating of 8.2 instead it should be 2.8 Never live in the illusion that andaz apna apna is a comedy film."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "saimaq-27868",
        "review_rating": "9",
        "review_title": "Never gets bored",
        "review_detailed_main": "I have watched this movie 5 times and never gets be bored for even one second it has good comedy good acting over all a good movie."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "lakshmishaks88",
        "review_rating": "9",
        "review_title": "Cult Classic Masterpiece",
        "review_detailed_main": "Andaz Apna Apna was introduced to me by the way of various comedy scenes that I caught up in social media. This induced my curiosity to go and watch the movie.\n\nThis type of silly comedy without going down the route of profanity is rare in Hindi cinemas. And hence this movie is a cult classic. Each of characters are so interesting and funny. The whole premise is ludicrous but you are drawn into it as the movie keeps you interested.\n\nI give full credit to the director and producer for assembling such a star cast and manage to get the movie on to production. The actors have all delivered justice to their roles. Let us be honest, these are not oscar winning roles that challenges these actors but there needs to some involvement and seriousness that delivers believable performance.\n\nBut more than the lead cast, it is the support cast that is memorable. How can anyone forget Crime Master Gogo or \"Rabbit\". That is what makes movie so thoroughly enjoyable.\n\nOnly thing that I would have against the movie is that not all of the music and song/dance sequence is upto the mark. Some of them are purely skippable (though understandable that it would have been difficult then to remove songs all together given the established norms)\n\nIn the end, this is a must watch movie for any Hindi movie buff and should be among the various lists of movies."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "dsengar",
        "review_rating": "9",
        "review_title": "best cult comedy",
        "review_detailed_main": "Although it took four years to complete the project and opened as a box office failure ,how strange that people rejected such a timing comic movie,I remember there were only 20-30 people in the movie theater during its opening week.this movie had an original script,i don't think that the scenes were lifted from any other movie.The timing and coordination of all the actors was great although behind the scenes amir,salman,raveena and karishma were not in talking terms during its making.The dialogues were so well written that every scene can make you laugh. must watch 9/10 for good ride of comedy. Watch out if u haven't seen yet."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sangeetakumar-06058",
        "review_rating": "10",
        "review_title": "Bestest movie ever",
        "review_detailed_main": "I think this is the best comedy movie till date, the whole movie is full of comedy, there is no lack of anything anywhere.\n\nI liked the chemistry between Salman and Aamir, both of them have acted very well together. I never hesitate to watch this movie, its a very favorite movie, its vibe is not going to go away in any decade, it has left such an impression on the viewers.\n\nSome scenes of the movie are very relatable, like the Sholay scene where Aamir says that Salman's father has written it Notice that in many scenes, Salman Khan's hair keeps changing from big to small, big to small again and again 😂 That scene is also very laughable where Prem and Amar go to pick up uncle and give money to Teja in return, then all three of them are unable to sit on that small bike. 😂😂😂"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "reshabhisnalin",
        "review_rating": "10",
        "review_title": "Best Comedy Movie Ever",
        "review_detailed_main": "It is the best comedy movie of all time in Bollywood. The comic timing of Salman and Amir is amazing. Script, Dialogues, direction, songs everything is outstanding. Salman and Amir has shown their class and you will laugh at each every dialogue of the movie."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "riyaj-mulla",
        "review_rating": "10",
        "review_title": "Mind blowing Masterpiece!",
        "review_detailed_main": "What should I say about this movie? If I want to gift happiness to someone I will show this movie and I'll watch them smile, jumping on seats,laughing rolling on the floor. This film brings live to our sad and lifes. Such a smooth start and then takes you on high very high laughing mountains with each characters introduction and phenomenon reaches at peak in climax. All actors and everyone involved in making had done tremendous haedwork and its visible with performance.\n\nIf you missed this go catch now. You will never see Aamir Salaman, Govinda, Shakti, Paresh, Juhi, Ravina, Karishma together again.\n\nSpecially Legends like Mahmoud Ji, Deven Varma Sahab Jagdeep sahab, Viju Khote Ji, Utra promax Legend Tiku Talsania ji. All great great actors. Harish Patel also with small cameo of Hotel clerk was played hilariously well.\n\nSongs sounds old but comic book feel gives suitable sounds.\n\nDialogues and writing is absolute deserve Oscar.\n\nAlready seen more than 1000 times infact i forgot my count.. But will watch today again.. Come watch it😂"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "GypsiB",
        "review_rating": "5",
        "review_title": "Like Watching the Monkees",
        "review_detailed_main": "Young con-men Prem (Salman Khan) and Amar (Aamir Khan) both set out to woo and win the same rich girl, but comic complications arise. (Raveena Tandon and Karisma Kapoor also star.)\n\nWatching this movie is like watching an episode of the Monkees: it is ridiculously silly, and yet has it's own sweet charm. Sadly, the musical numbers do not add anything to it, the plot is predicable, and the humor gets tedious at times. While it's a cute movie, it's best watched in small doses and with the understanding that, in the end, it's not particularly memorable."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "ajitbakshi",
        "review_rating": "9",
        "review_title": "thw greatest comedy film in the history of indian cinema.",
        "review_detailed_main": "G. O. A. T IN COMEDY GENRE MOVIES OF BOLLYWOOD. A CULT CLASSIC. TRULY A MASTERPIECE."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "kamina-68501",
        "review_rating": "8",
        "review_title": "One of the best comedy movie in Bollywood",
        "review_detailed_main": "Excellent piece of comedy,but one thing i don't understand that why everybody is praising the comedy of aamir and salman. First of all, salman comedy sucks in this movie but aamir khan's flawless comedy successfully balance the equation. BUT there is only one who steals the show and thats THE PARESH RAWAL i never saw somebody who can do comedy as well as a very bad guy. The temple scene, vasco de gama scene only a genius can do this EPIC. And now the bad ones karishma and salman khans constantly winking scene, one the most irritating scene of the whole movie.crime master gogo is good enough to grin on your face but not as the teja who is able to create a lmfao moment whenever he comes."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sanahashamkhan",
        "review_rating": "10",
        "review_title": "Best comedy movie ever !!!!",
        "review_detailed_main": "Andaz Apna Apna is a classic Bollywood comedy that has achieved cult status over the years. The film follows two slackers, played by Aamir Khan and Salman Khan, who compete for the affections of a wealthy heiress while trying to outwit a criminal mastermind. The film's humor is irreverent, slapstick, and often absurd, with memorable characters and quotable one-liners that have become part of Indian pop culture. While the film was not a commercial success upon its initial release, it has since become a beloved comedy classic, appreciated for its zany sense of humor and the chemistry between its two lead actors."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "shahrukhullahkhan",
        "review_rating": "10",
        "review_title": "One of my favorite comedy film",
        "review_detailed_main": "I love this film. My all time favorite film. Bohat maze ki film hai or comedy bhi achi hai. Climax wala scene bohat maze ka or funny"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "vjnambu",
        "review_rating": "10",
        "review_title": "The best madcap Indian comedy film ever",
        "review_detailed_main": "If you make a list of top Bollywood films which were flop when released in theatres but became a cult film in DVD, VHS etc, the one film which will always top the list is Andaz apna apna. Anyone who watches AAA will get shocked to hear that it was a flop in theatre. Though there were many cult classics like agneepath, lamhe, swades etc, they had its own share of flaws and were not entirely a blockbuster material. But AAA(barring songs) had everything right in it to become a huge money spinner. It had Aamir Khan and Salman Khan as the male leads who were young superstars at that time, Raveena tandon and Karishma Kapoor who were rising female heroines at that time, Third directorial venture and first full fledged comedy film of Rajkumar Santoshi after action drama Ghayal and social drama Damini. But poor marketing and long delay in making turned it into a complete washout winding up within three days of release. Later as it deserved became a huge sensation when it came on DVD and television. It narrates the story of Amar(Aamir) and Prem(Salman) , a lazy guys dreaming to achieve big without any hardwork. When a rich girl Raveena(Raveena tandon) comes from London to India for marrying a suitable groom, Amar and Prem comes and start hitting on her trying mostly to outsmart each other. But Teja(Paresh Rawal) twin brother of raveena's dad wants to kill her and usurp her property. How Amar and Prem saves Raveena's family from bad guys is the rest of the story. I loved the performances of Aamir Khan, Paresh Rawal, Shahzad Khan and Shakti Kapoor especially my personal favorite is Shahzad Khan as Bhalla whose peculiar dialogue delivery I love to imitate while watching. I liked Salman's performance in the climax. Heroines have nothing to do other than being a mere spectators of the chaos. The only drawback of AAA is its songs which sounded like 60's instead of 90's. But that can be forgiven for a film which is so entertaining. Rajkumar Santoshi proved his versatility in handling comedy effortlessly. On the whole AAA till now is the only madcap comedy film till now which instead of scratching your heads will put a smile on your face from start to finish"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sauravjoshi85",
        "review_rating": "10",
        "review_title": "One of the best Hindi comedy movie. A Must Watch!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "hamza-57723",
        "review_rating": "10",
        "review_title": "Timeless Comedy",
        "review_detailed_main": "Best Bollywood comedy movie, a roller coaster of laughter from start till end. Every time I feel sad or depressed, Or watch something horror, I watch this movie. May have watched more than 100 times but never get bored."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "rahulomreniwal",
        "review_rating": "9",
        "review_title": "review for film",
        "review_detailed_main": "what are you favorite comedies I have a great deal of love for the film. I have not seen anything like this You are the best film on Rajkumar Santoshi you are always a lucky comedy movie I can see you here.if you never watch this film please purchase and watch as soon as possible.. i hope you like it."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "aaarjun888",
        "review_rating": "10",
        "review_title": "Classic collection best comedy movie of bollywood history",
        "review_detailed_main": "This is by far most hilarious comedy movie bollywood ever have.\n\nI bet for single minute you hardly get to not to laugh.\n\nThis movie must be in collection of history of bollywood."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "puneetkumar-31221",
        "review_rating": "9",
        "review_title": "Awesome movie",
        "review_detailed_main": "After approximately 22 years past its release, \"Andaz Apna Apna\" continues to enthrall its audience like no other Bollywood film. It has achieved a cult status in the brethren of Hindi cinema and will always be remembered as one of the best comedy movies of all time. Directed by Rajkumar Santoshi this movie presents a new side of its lead actors Salman Khan and Aamir Khan. Both have done exceedingly well with their comic poise and timing. Another thing about the film is that is clichés which would get any film panned works wonderfully for it. Names of bygone characters of Hindi cinema – Robert, Teja, Amar and Prem add to its charisma and mass appeal. Even the side characters of the movie like Shakti Kapoor, Harish Patel (lodge owner) have performed their parts brilliantly and have never let the comic intensity of the film break. Compared to the present era of comedy in Bollywood where you cannot sell joke without giving a sexual meaning to It; this movie reminds us how a cult classic is made.\n\nComing to the music of the film; the songs of the film are not worth remembering and you forget about the lyrics as soon as they get over. Though the lead players get all the applause and rightly so, you should reserve some of your applause for the dialogue writers- for me personally the scene where Aamir Khan spells out \"Aap purush hi nahi, mahapurush hai\" stands out, not just for the effortless dialogue delivery by him but also for the subtle changes in dialogue when the viewer least expects it. Leaving apart music; this movie has all its bases covered. A very good story and screenplay coupled with brilliant performance by everyone in its cast makes it my favorite Indian Comedy till date."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "akshay-ak-kumar",
        "review_rating": "9",
        "review_title": "An All Time Classic",
        "review_detailed_main": "How does one describe the movie 'Andaz Apna Apna' or AAA ??\n\nFrankly, there is no story. Its a wafer thin plot of two wastrels trying to out smart each other in order to marry a rich girl.\n\nBut the characters starting from the lead pair of Amar Prem to the villain Teja to the side characters like Crime Master Gogo and Bhalla & Robert to the dialogues to the scenes and screenplay are all (in words of Barney Stinson)....wait for it....Dary...Legendary !!\n\nIts a slapstick comedy which makes me feel happy and nice whenever I watch it again and again.\n\nIts a pity that Santoshi couldn't make another film like this...I call it a master piece and believe it or not, the movie flopped when released only to become a cult hit decades later.\n\nIts also ironic that we call AAA as one of the best Hindi comedy films ever made which was very clean - no gay & double meaning jokes, no foul language and no toilet humor when today's comedy films are full of nonsense stuff I wrote in the above lines. Pity today's film makers praise AAA but fail to learn anything from it."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "punit-47220",
        "review_rating": "10",
        "review_title": "My all time Favourite Movie",
        "review_detailed_main": "Andaz Apna Apna is by far the most Funniest Film i have ever watched. Aamir Khan is a gem in this Role - so are the Others... Raj Kumar Santoshi is a Master Director proving that he can handle different Genres perfectly - be it Heart Hitting Damini, One of Sunnys best Ghatak, Full on Comedy Andaz Apna Apna or a Film like China Gate - with no young Hero but full on Entertaining.\n\nThank you Bollywood and the 90s for such Classics"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "shreyashrks",
        "review_rating": "8",
        "review_title": "Best Hindi Comedy Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jaheenahmed",
        "review_rating": "10",
        "review_title": "Bollywood version of Tom and Jerry",
        "review_detailed_main": "I was shocked that the movie flopped badly, despite being such a good and light hearted comedy film. The film has such a humorous dialogues and funny scenes especially the \"Yeh teja teja kya hai\" scene and I will definitely recommend this movie to Salman Khan haters\n\nThe songs are good, screenplay is good, storyline is good, direction is also good and mostly Aamir Khan and Salman Khan should work together again\n\nthis is a must watch movie for everyone\n\n10 out of 10 stars"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "paularjyarishi",
        "review_rating": "10",
        "review_title": "Innocent and Lovable. Smug intellectuals, stay away.",
        "review_detailed_main": "It's steeped in old-school comedy. People have to understand that it reflects the 90s, an era devoid of internet smartness, and global exposure. The characters are naive and hence, effortlessly funny, so much so that they will not appeal to a young or a new-age, smartphone generation kid.\n\nEnid Blyton's fantasies will never be able to compete with JK Rowling's creations. But even then, the 50s kids remain Blyton's fans.\n\nPopeye the Sailorman has a separate fan-base from the 60s to the 80s, although it's completely redundant to modern day kids.\n\nSimilarly, Andaz Apna Apna remains the therapeutic comfort food for 90s Indian kids, especially from the middle class.\n\nIt understandably will not appeal to the newer generation audience. But that doesn't take away any of its charm.\n\nJust as the cumbersome gramophone holds its own in the age of Share-It and Xender, Andaz Apna Apna, smelling strongly of the 90s, continues to shine, even if in selected corridors."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "jomy-augustine",
        "review_rating": "10",
        "review_title": "Perfect retro comedy",
        "review_detailed_main": "Never have I ever watched a movie more than a hundred times and laughed the same each time... The script is impeccable... In fact the best that Bollywood has ever reached and if Salman Khan has ever acted good, it's only in this movie.. each character has done their best... Perfect script, casting, acting and direction."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "wajeehkhan01",
        "review_rating": "10",
        "review_title": "The best Indian comedy film ever!",
        "review_detailed_main": "Two of Bollywood's biggest stars, Aamir Khan and Salman Khan, unite in this hilarious joyride! This film is the best Bollywood comedy film ever, period. Only Hera Pheri is at it's level. The jokes are hilarious, the references are great, Aamir and Salman, along with Paresh Rawal, and the duo of Bhalla and Robert, and Shakti Kapoor as Crime master Gogo really entertain! All the characters are remembered well and iconic. All of the actors had such good chemistry. The movie has really great comedy and a great script. So many of the dialogues are remembered today, such as \"Happy Birthday Rabbit!\". Many of the scenes are also remembered today, like the cups scene and the Bade Mamoon Chote Mamoon scene. That's how good the script was, along with the directing. I'm really surprised at how the heck this wasn't a hit at the box office, because this film really deserved it! .The story was a common,typical Bollywood love triangle type of story, but the story was played out really well, and that makes you forget about the basic story being common. Everyone should watch this film, I guarantee you will be laughing!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "Biswas_",
        "review_rating": "9",
        "review_title": "Establishment of Slapstick comedies in india",
        "review_detailed_main": "Andaaz apna apna was the first film that went on to actually establish Slapstick comedies in india. And when you talk about Slapstick comedies, you must be prepared for overacting and loud scenes and this film delivers it very well and well within limits. It was then when Karishma Kapoor looked so sweet and her voice too was super sweet to hear. Amir and Salman at that time were so full of energy and zing . Shakti Kapoor as Crime master gogo is one of the most memorable comical villian Bollywood has ever produced while Paresh too does a great job. Highly enjoyable film."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "LondonLady",
        "review_rating": "10",
        "review_title": "Pure genius",
        "review_detailed_main": "I cant say anything more than just pure genius. I was holidaying in India when this movie premiered in the cinemas. I watched in in the best surrounding and was fully entertained. One of my most memorable films and we still use the dialogues in our family. Its the most hilarious movie everrrrrr."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "kkartik-72126",
        "review_rating": "10",
        "review_title": "Life is incomplete without this movie",
        "review_detailed_main": "Although the movie released in the year I was born, even though after these many years and watching it almost numerous times It still gives same humor like watching it for the first time, The is the best comedy movie produced in Bollywood till date I must say!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "sdsr-55675",
        "review_rating": "9",
        "review_title": "Cult yet underrated",
        "review_detailed_main": "Andaz apna apna is one of the cult comedies of cinema.. Watch it for Two paresh rawals Two khans and their immense chemistry Shakti Kapoor in one of his most hilarious roles And lovely dialogues Just like sholay, few movies create such impact it is one of them.."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "nadkarnisumeet",
        "review_rating": "9",
        "review_title": "Cult Classic.",
        "review_detailed_main": "Andaaz Apna Apna review :\n\n\"Do dost ek hi pyaale se chai piyenge...\" suggests one superstar to another in one of their initial and only film together...Andaaz Apna Apna is indeed one of its kind.\n\nConsidered a cult classic today, the film was a box office dud when it released way back in 1994. I was amongst the few who saw the film as a college kid at the near empty Metro Cinema in Mumbai. I laughed my guts out at antics of Amar and Prem (Aamir's Hai-la perfectly complemented Salman's Ooi-maa) and looking at the then tepid audience response, wondered why such a rib tickling sparkling clean super slapstick comedy fail?\n\nLack of promotion, underwhelming music and then reigning Hum Aapke Hain Koun (1994) occupying most of the theatres were some of the reasons cited for the films failure.\n\nRevisiting the movie again on DVD last night with my teenage son, he casually remarked that this film would've been a blockbuster had it released today. It then struck me that perhaps this movie was a few decades ahead of its time and would've actually clicked with today's gen had it come now. Imagine watching Aamir Khan and Salman Khan together in a totally mad caper with unforgettable characters like Tejaa, Bhalla, Robert and Crime master Gogo mouthing hilarious dialogues like \"Tejaa main hoon mark idhar hai...\", \"Galti se mistake ho gaya..\", and \"Aankhen nikal ke gotiyan khelta hoon\". Every scene and dialogue of this Raj Kumar Santoshi (written and directed) venture brings atleast a smile on your face if not LOL.\n\nPlanned as a quickie, Andaaz Apna Apna took more than three years to complete and there were rumours of Aamir - Salman ego issues being the reason for the delay. However, in a recent interview, director Rajkumar Santoshi refuted these claims though he admitted that getting the actors' dates was a challenge. An additional song (Shola Shola) was recorded but not filmed keeping in mind the film's run time. The makers expected the movie to be a runaway hit but unfortunately, that was not to be..\n\nAndaaz Apna Apna is not the only hindi film which attained cult status after failing in its initial theatrical run...Raj Kapoor's Mera Naam Joker (1970) and Guru Dutt's Kaagaz ke Phool (1959) (both my personal faves too) are best examples of the failure turned classic story. Andaaz Apna Apna belongs to that elite club.\n\nRegards, Sumeet Nadkarni"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "manish-anandrpr",
        "review_rating": "10",
        "review_title": "Comedy milestone",
        "review_detailed_main": "All protagonists and other supporting actors have immortalized their characters and these are even used today. One of best Indian comedy movie."
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "bdcactusandsucculentsociet-17601",
        "review_rating": "10",
        "review_title": "A Joyful movie !",
        "review_detailed_main": "Perhaps this is the ever best movie in Indian Comedy. The more you see the movie.. the more you enjoy ! This kind of movie is specially a family comedy Drama and is a full entertainment for all the ages !! All the actors are fantastic and The Director did a great great job. The two Khan(s) Amir & Salman showed their extra ordinary talent of acting. Nonetheless the Heroines are fabulous too !! If you really want to enjoy your precious time, it would be the best movie to enjoy. If you want to enjoy your good time with your kids to lough around, This movie is for you. If you are with your loved one, This movie can lasts a sign of romance. Starting from make-up man to Dress designer, this movie is the bench mark. In one words, Its a movie to enjoy which is time worthy ! Grab your copy and keep in your collection. Who knows !! May be your grandson would like this movie too !! Hope for the Best !!"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "mankshar",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": "Best, Best, Best, Best, Best, Best, Best, Best, Best, Best, Best, Best,"
    },
    {
        "movie_id": "tt0109117",
        "movie_name": "Andaz Apna Apna",
        "movie_rating": "7.5",
        "review_username": "pranubh",
        "review_rating": "10",
        "review_title": "Brilliant movie",
        "review_detailed_main": "If ur having a rough day then watch this movie as many times you want, it never gets old.best movie ever."
    }
]