[
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "dineshprakash",
        "review_rating": "7",
        "review_title": "It is enjoyable at the condition to leave your brain at home.",
        "review_detailed_main": "Watched \"BOL BACHCHAN\". It is a typical Rohit Shetty's film. Just go to theater with your heart and leave the brain at home. Then you will enjoy the movie. It is a paisa vasool movie. It bores in the starting 45 minutes but after that, you will start enjoying it. Rohit Shetty has a different style of filming movie and always tries to show something different in action. He proves himself right again. Music is as usual weak of Rohit Shetty's films. One track could have been popular \"CHALAO NA NAINO KE VAAN RE\" but I think it was not well promoted. Screenplay by Yunus Sajawal is weak. It is jerky. Transition is not very smooth. It is forced. Dialogues by Farhad -Sajid are awesome at places but same time somewhere worst too. Ajay Devgan is marvelous in action as well as in comedy scenes. Abhishek Bachchan is irreplaceable as Abbas Ali. He has proved himself after \"DOSTANA\" that no one can carry a gay character better than him. He is simply mind-boggling and very enjoyable as Abbas Ali. When he comes as Abbas Ali movie sparks. Asin is a too good actress but totally wasted in this film. She does not have any good scene, so she can show her performance. I am shocked with Krishna Abhishek. I am a big fan of him in Comedy circus. I just laugh and love to watch him. There is some magic when he performs in Comedy at small screen but in this film, I am disappointed. His magic is missing in big screen. After all it is enjoyable."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Time-Pass!",
        "review_detailed_main": "Rohit Shetty's Much Awaited 'Bol Bachchan' is a Time-Pass Fare, that shouldn't be taken seriously. Its strictly pop-corn entertainment, that doesn't even attempt to be remotely remarkable. If having fun at the movies is what you're looking for, then 'Bol Bachchan' is waiting for you.\n\n'Bol Bachchan', inspired by the classic 'Gol Maal', tells the story of how one man's lie, leads to a puzzle of confusions.\n\n'Bol Bachchan' has a hilarious first-hour, with each passing scene standing out. The interval point, is simply superb. However, the second-hour loses pace & the climax seems a bit stretched.\n\nYunus Sajawal's Screenplay is funny & entertaining, but it definitely could've been stronger in the latter hour. A Special Mention for the dialogue written by Sajid-Farhad. The dialogue are simply hilarious! Rohit Shetty's Direction is good. Cinematography, Editing & Art Design, are efficient. Action-Sequences are over-the-top. Music by Himesh Reshammiya & Ajay-Atul, is energetic.\n\nPerformance-Wise: Ajay Devgn is excellent, yet again! He very playfully plays his part & delivers the funniest lines with ease. His broken English is sure to bring the house down. Abhishek Bachchan does an equally good job. The actor scores as Abhishek & is simply flawless as Abbas Ali. Asin & Prachi Desai get limited scope & they both deliver mediocre performances. Krushna Abhishek, Asrani, Neeraj Vora & Archana Puran Singh are simply fantastic in supporting roles. Amitabh Bachchan appears in the title track.\n\nOn the whole, 'Bol Bachchan' works till it lasts."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "silvan-desouza",
        "review_rating": "5",
        "review_title": "Mix of Hrishida + David Dhawan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "bhaveshbhatia",
        "review_rating": "7",
        "review_title": "A movie for the entire family that can make you laugh and laugh till you drop!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "kunalkhandwala",
        "review_rating": "6",
        "review_title": "Lesser the expectations, more the entertainment",
        "review_detailed_main": "It is a known fact that Rohit Shetty is synonymous with nonsense. With a fight composer's blood running in his veins, he spares no penny in over-the-top action sequences that would put Tollywood to shame. His comedy is bi-polar as well, ranging from inane and retarded to occasionally, genuinely funny. Music has never been tasteful in any of his films nor has the importance of characterization and plot. After his career highlight, 'Singham', Shetty partners with Ajay Devgan (also co-producer) in this outlandish remake of 'Golmaal' (Shetty can't get over it) which would be as forgettable as his previous films were it not for some funny dialogues, situations and Ajay Devgan.\n\nAbbas Ali (Abhishek Bachchan) is running out of luck in Delhi as he loses the case around his ancestral property. Along with his sister, Sania (Asin), he pays heed to Shastri's (Asrani) advice and moves to Ranakpur to work under Prithviraj (Ajay Devgan). Unfortunately, in a brave attempt to save a child from drowning, Abbas opens the gates to a controversial temple and after the tension around Prithvi's family feud cools, his friend had no choice but to introduce Abbas to Prithviraj as a hindu, named Abhishek Bachchan. From hereon begins a series of goof-ups, cover-ups and unabashed lies that conceal Abbas' true identity. However genuine his intentions may be, he would always have to confront Prithvi's stringent policy of honesty with fear.\n\nAjay Devgan is the major reason you would bear this film. His comic timing, expressions and dialogues are the saving grace. With equal ease he transforms into the angry Singham version when enraged. Abhishek Bachchan is passable. Comedy isn't his expertise and he does try hard but in an unconvincing manner. Others could've played his role better but then they're not a Bachchan. Asin looks beautiful but has little to offer in her acting, Asrani was splendid and Krishna Abhishek is hilarious especially when he weeps in nervousness. Archana Puran Singh was hilarious switching between two characters and Neeraj Vora, although loud, portrayed some natural comedy.\n\nThe film works in many of its dialogues, confusing situations and being a spoof of several films. Where it falls flat into Rohit Shetty (nonsense) territory is its overdone mockery of the English language, the ridiculous action sequences, the wasteful song and dance and the immature climax that drags the film to unnerving lengths. With smaller expectations, the film delivers the goods. Popcorn entertainment is what we can categorize it as and after a few laughs, you won't regret spending the time and money."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "darshancruz",
        "review_rating": "4",
        "review_title": "Rohit Shetty's version of the old and classic Golmaal with an Aneez Bazmee climax disappoints.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Abhishek Bachchan and Ajay Devgn rock,movie sucks!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "achyutaghosh",
        "review_rating": "6",
        "review_title": "mindless comedy salvaged by plot and acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "bobbysing",
        "review_rating": "2",
        "review_title": "Hope this trash from a Hit director stops the avoidable trend of remaking the Cult Classics of Hindi Cinema.",
        "review_detailed_main": "When a director is back after delivering a fabulous string of 4 big blockbusters in a row, then it's indeed going to be a hugely stressful event for him undoubtedly. Because not only the viewers but the industry also is bound to expect a lot from his project keeping in mind the excellent track record of his successes. And when further, the same director is back with a remake of one of the Top 10 All Time Favourite Comedies of Indian Cinema then obviously the expectations are going to reach sky high.\n\nSo here we have director Rohit Shetty striking again with his updated version of Hrishikesh Mukherjee's Cult Classic GOLMAAL, to which he tries to give his own twists and turns instead of copying the original as a true fan. In fact this very intelligent step of the director remains the only plus point going in his favour, as there are not many in this world (including myself) who would appreciate seeing an updated revised version of that incomparable original classic having a tremendous repeat value of itself.\n\nNow what Rohit does in his BOL BACHCHAN is that he re-writes a completely new & fresh script around the basic storyline of the original GOLMAAL and never makes the viewer feel that they are watching just a pure re-make. On a positive note, this is exactly how it should be done as there is no way that any director can re-live a classic film like GOLMAAL after more than 3 decades with the same elegance. So though we have the same plot being worked upon here, still Rohit tries to rope in some new characters, more comic mannerisms and few more forcibly funny sequences to make his BOL BACHCHAN a completely fresh film based on a famous masterpiece.\n\nBut unfortunately, the sad part of all this hard work done by the director and his team is that they hugely fail in the process and their newly added ingredients in the re-written script of GOLMAAL simply do not work or fall flat. In other words, the last 20 minutes of the film, even make you wonder that Is this really a Rohit Shetty film running on the screen? Moreover, the disappointment doesn't stop on the writing and execution level only as all the actors in it also remain a big let-down throughout which was not at all expected in a film by the director, who is known to have the pulse of his audience.\n\nBB starts off unlike a comedy and surprisingly there is no great funny stuff to be enjoyed in its opening 40 minutes. With such an uninteresting start, all the high spirits of watching it actually turn negative and this continues till the intermission working against all the expectations from the Hit team of Rohit Shetty and Ajay Devgan. In the second half too, the director tries to add more elements than required which actually result in a poor mess. Particularly the inclusion of a gay character in the script remains the weakest part of the film as neither the actor (Abhishek) nor his director are able to handle it well.\n\nHonestly, I only enjoyed watching Neeraj Vohra &Prachi Desai alone, despite of the presence of all the know actors in this big banner project. Ajay, more or less remains in his SINGHAM hangover only & Abhishek tries too hard to be funny without any success. Frankly I neither could laugh on the English dialogues of Ajay nor on the weird kind of Kathak dancing of Abhishek which was really awful. Asin is just there to look beautiful and Archana Puran Singh does make a sincere effort to generate some laughter. But overall they all are not able to put up a good show collectively. Plus I remained hugely dissatisfied from the supporting act of Krishna, who unarguably was given a role much below his actual caliber.\n\nBB also falters in its action and cinematography department as whatever happens on the screen looks like 'all seen before' in the director's earlier films only. Its high time Rohit should realize that he cannot use the same kind of camera-work, slow motions, fighting stunts, flying people and car blasts in all his films repeatedly. Musically also the film doesn't have anything great to offer apart from one interesting song \"Chalao Na Naino Se Baan Re\". Just like the film, its title track also goes over the top showing the over-confidence of both its actors and the director.\n\nTo be straight, BOL BACHCHAN is just not a Rohit Shetty film full of light entertainment as compared to some of his previous ventures. I loved watching his GOLMAAL 3, ALL THE BEST and SINGHAM, but BOL BACHCHAN is simply not anything even close to these. Interestingly one sequence of the film (when Archna Puran Singh is introduced in a Nautanki), also reminded me of a similar scene in Mukul Anand's HUM, wherein Kader Khan is discovered in an exactly similar situation by both Anupam Kher & Anu Kapoor.\n\nThe director revealed his fascination towards the cult classic GOLMAAL (1979) when he started using the word in the title of his chain of films beginning with GOLMAL: FUN UNLIMITED in 2006. But now when he has re- made the classic officially, he simply misses the opportunity and comes up with a project which will be surely remembered as a \"Bad Attempt\" in his career.\n\nHowever, there is one silver lining in this black cloud that after BOL BACHCHAN, perhaps the silly and avoidable trend of re-making the golden classics of 70s & 80s would come to an end. Because if this doesn't stop here, then be ready for seeing many more such trash remakes of those cinematic masterpieces, which surely indicate the emergence of a \"Creative Block\" in our Hindi Film Industry."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "kinjalprabodh-vh",
        "review_rating": "7",
        "review_title": "twin splitting comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "harrym63",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": "Bakwaas story... In spite of this, very good direction by Rohit Shetty. Very good acting by Ajay Devgan, Abishek Bachchan. Koja Abbas was good too.\n\nScriptwriters for the movie should get the worst scriptwriting award for this movie... Even a fifth grader could come up with a better story than this. But Rohit Shetty has done an excellent job of directing a bad story. Since the story is absolutely worst, it seems Rohit Shetty has painstakingly gone through the trouble of giving the movie a life. If the movie was directed by a bad director, the movie would be a total flop. Kudos to Rohit for his brilliance.\n\nAjay Devgan was very humorous with his English."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "ishanrohit",
        "review_rating": "8",
        "review_title": "Kudos to Abhishek Bachchan!",
        "review_detailed_main": "Bol Bachchan is a typical Rohit Shetty movie with a little more substance. It has cheap jokes - this time on lousy understanding of English by Prithviraj - character played by Ajay. It has those characteristic action sequences - people and vehicles flying in the air. It has few songs, which are light and melodious.\n\nBut this film should be remembered for an actor who has worked out of his skin to entertain audience - Abhishek Bachchan. I have never seen Abhishek show so many emotions in a single film. He is good at comic roles - if we see Dostana and now Bol Bachchan. Action sequences and sharing chemistry with females is where I find him a little uncomfortable. He should not be compared to his dad now. He has carved an audience for himself."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "vatsalspandya",
        "review_rating": "7",
        "review_title": "Enjoyable :A typical Rohit Shetty Family Entertainer",
        "review_detailed_main": "It's a good Rohit Shetty comedy which has his Zameen cast thrill again. It's a movie seen without a brain. The story is all rattled and tries to create subplots just to not let it get boring while the comedy is a little missing in the starting of both the halves. Yet, it gets really hilarious at times in the first half that it's difficult to control the laughter. Also, the fighting scenes almost show super humans in action and the fights do go a level beyond Singham and you get a smile while seeing the nonsense-action.\n\nAmong the cast, Prithviraj Raghuvanshi takes your breath away with his English and his shocking expression and even his innocence seems to work. Abhieshek unexpectedly comes with a superb act as Abbas Ali, the dance teacher. He is too good for what is probably his first complete comedy movie. And among others, Asrani rocks in his little screen time. The screenplay disturbs you as it prefers first time bollywood actors like Krishna over veteran Asrani. He just has too much screen time to handle. A little more VIP in sharing time with him would have helped. Yet, both of them were decent. Even Archana, I thought could have got more screen time.\n\nAlso, please tell me why can't the actress in in a movie have some punches. Both, Asin and Prachi Desai have little time on screen and then they have to take care of the emotional content in that too. I would prefer Kareena in Golmaal 3 over these. These talented actresses were not used properly. In the actors, even the characters are developed well. A little more to the 2 actresses could've helped.\n\nLastly, this movie does have a little lack of originality but it still doesn't bother the viewer much as AB Jr. and Ajay just excel. Watch it for them. It's sort of a 7.5 movie but I think lack of story and well developed subplots brings it down to 7."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "mailctj",
        "review_rating": "1",
        "review_title": "Don't Watch!!",
        "review_detailed_main": "Please don't watch the movie. Just a waste of money and time. There is nothing in this movie that is watchable. Songs are not good, the movie is a remake of a classic movie Golmaal which is narrated very badly. Ajay Devgans role in the movie is to bash the villains and mobs in the city and walk away in a slow motion. I don't know how can it make sense?? The songs come in the place where they are not at all needed. Romantic songs in an tragic scenario. Abhishek is just a gay and he'll always be like that since Dostana i guess. Prachi Desai has given a decent performance in the movie but still something is missing that makes her a good actor. Asin has given a performance like in every movie, we can't expect anything good from that girl. Overall my rating is 1/10."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "Reeshab-dutt",
        "review_rating": "6",
        "review_title": "Classic Roht Shetty",
        "review_detailed_main": "This movie has got Rohit Shetty written all over it. It's loud, chaotic and entertaining. The action sequences are also very typical of his work. lots of noise, cars flying, and superhuman fighting skills. To enjoy this movie I suggest you leave your brains at home and watch it. Ajay Davgan has done a good job like he always dose in a Rohit Shetty film especially his English which was the only thing that got me chuckling in the theater. Krishna Abhishek has done a lot of overacting like he always dose even in his laughter challenge TV shows. People like him but I'm not a fan in particular. Overall I think it's a one time watch. Don't look for sense in the movie."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "ehizvostro",
        "review_rating": "6",
        "review_title": "Family Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "anagpal",
        "review_rating": "5",
        "review_title": "A delicate balance of funny and cringe-worthy moments",
        "review_detailed_main": "To the old, sweet, amazingly funny, classic comedy, Golmaal (Hrishikesh Mukherjee, 1979), apply the Higgs Boson particle to it ie attempt to make it a 'mass' film, an 'entertainer'. So add liberal doses of silliness, unnecessary plot complications, shrillness, crassness, slow motion fight sequences and many, many blown up vehicles. Also add a few sequences & a few jokes that really make you laugh. Just pray that the cringe-worthy moments don't outnumber the LOL moments & that depends entirely on your sensibilities.\n\nThe broad outline of the original story is retained. Ajay Devgn, local tough & rich landlord, employs Abhishek as a supervisor. Unfortunately, Abhishek, a Muslim in the film, has to pretend to be a Hindu in front of Ajay. One lie leads to another and soon he has to invent a gay, Muslim identical step brother, a mother, the mother's identical twin sister etc. Prachi, Ajay's sister, is Abhishek's love interest. Asin, Abhishek's sister, is Ajay's love interest. And Jeetu Verma is there as Ajay's evil cousin only so that muscles can be rippled and bones broken. Neeraj Vora as Ajay's sidekick and Asrani and Krishna as Abhishek's uncle and son, respectively are there to attempt to wring a few more laughs from you.\n\nAjay's character likes to speak English and mangle it beyond belief, and this ability provides many of the comic, funny moments of the film. You watch in awe, wondering what he will come up with next, a bit like when you watch Sidhu comment on cricket. It works in short doses and appears a bit stretched in the second half. 'When elders get cozy, youngsters don't put nosy' or 'Thank you for the Complan Boy' (compliment) don't seem rib tickling but given Ajay's fulsome delivery and the situation, it does generate quite a few laughs.\n\nAbhishek plays his two roles quite straight, pun intended. The sequence where the gay character has to dance to a medley of songs in unison with two of Ajay's henchmen is crass but makes you laugh in parts. Asin is strangely muted in the film, while Prachi also has a small role, without much meat.\n\nThe movie is too long, the songs aren't great, the fight sequences too similar to what we've already seen from Rohit Shetty's earlier films. There is a vision here to make it a comedy for the masses and judging by the loud laughs from the audience, he's got it right.\n\nI feel, with the same cast, just keeping it along the lines of the original could've worked just as well, but I fear I would be in the minority in the industry. Would love it if there was a face-off between an intelligent, well made comedy (like a Vicky Donor, Khosla ka Ghosla) & a 'mass' one like this, with similar level of star power in both. I wonder which film would then have a bigger box office ? More at www.apurvbollywood.blogspot.in"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "maneckk-414-209658",
        "review_rating": "",
        "review_title": "Bol Bachchan .... will remind you milk no. 6",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "uqbaankhan",
        "review_rating": "7",
        "review_title": "Best of Rohit Shetty!",
        "review_detailed_main": "Probably a better Family Entertainer than other Shetty's films. Not boring , dialogues are written perfectly , keeping in mind the comedy . Dialogue delivery is perfect + Abhishek Bachchan & Ajay Devgan rule it . The other supporting actors are well . .... ... Don't go for any other Shetty film (except GOLMAAL 2006) they are sh** but this one is Great!"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "phadvijayanand",
        "review_rating": "1",
        "review_title": "Worst ever Rohit Shetty Film !",
        "review_detailed_main": "Yes, you won't believe but that's true. After Golmal series & Singham, I was expecting a lot from Rohit Shetty. With stars like, Ajay & Abhishek, Directory Rohit Shetty you definitely expect a lot. But this movie has failed in each category.\n\nStory: A big rubbish, copy of Amol Palekar's Golmal, some part from Chor Machaye Shor (almost copy of old Golmal). But directed so badly, that the copy is even worst.\n\nDialogues: Not a single dialogue, which you can laugh on. They are so worst, if you have ever watched Comedy Circus, you will definitely cry on poor dialogues. There are 3-4 dialogues which are repeated 3-4 times !!!\n\nThere are so many loopholes in the movie, you can't think about it. If this movie was named 'Golmal 4' may be I would have said less bad about it. Cause that's what the series is all about. But with so much bol-bola(Hype) of Bol Bachchan, you expect a lot from the movie.\n\nScreenplay: So much of messy in screen play, even if you miss anything, not a prob, come at any time, you will understand the story. There are so many things which happen in the movie, which has no relevance in later part.\n\nActing: Not much, with poor dialogues & direction, even good actors can't do much.\n\nOverall my ratings would have been -10/10. Watch movie only if you can keep your brain out.\n\nThumbs down."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "saytosandeep",
        "review_rating": "6",
        "review_title": "MY REVIEW: Why they made it?",
        "review_detailed_main": "Why you would pick the classic subtle comedy like Golmaal directed by great Hrishikesh Mukherjee, remove the subtlety of it, add some boring characters and serve it again? Movies like Bol Bachchan are only made to exploit this plot again and again. I am fine if you use the basic plot of any movie, but why to keep the scenes as it is as if you don't want to pay anything to writers. The things look fine in the acting area but dialogs are not funny. Music is also not upto the mark. Rohit Shetty should stick to new age ideas like Golmaal series rather rehashing the old hits. Watch it as if you have not watched the old classic at all."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "sasikanth20",
        "review_rating": "4",
        "review_title": "Skip it please!",
        "review_detailed_main": "I had no intentions of watching this film, but was forced to do so as there was nothing better running in theaters. After two and half hours, I walked out with a bad headache.\n\nOverall, an utter waste of time. If you really want to watch a comedy film, grab a copy of the original Golmaal instead of wasting your time on this crap.\n\nActing: 5/10 Story-Screenplay-Direction: 3/10 Technical Aspects: 6/10 Is it worth your time and money??: No. Unless you happen to like such boring comedies, or have time and money to space, skip this one please.\n\nFor a detailed review, please visit sasikanth.me :)"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "suman_emma",
        "review_rating": "9",
        "review_title": "Bol Bachchan is a laugh riot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "Vivekmaru45",
        "review_rating": "6",
        "review_title": "Good Time Pass Film With Hilarious Moments. It's As If Mr. Piryadarashan had directed it himself.",
        "review_detailed_main": "Plot in a nutshell: Abbas Ali (Abhishek Bachchan) lives in Chandni Chowk, New Delhi with his sister Sania (Asin Thottumkal). They are legally fighting for an ancestral property— land case. But the odds turn against them and they lose. Their well wisher, Shastri Chacha, advises and convinces them to migrate to his village Ranakpur where he assures Abbas that he will get him a job at his owner's place. The owner being none other than the powerful Prithviraj Raghuvanshi (Ajay Devgn). Abbas enters Ranakpur village and while saving a child trapped inside a temple, he breaks open the lock of an ancestral temple but fate plays an important twist in Abbas' life as the whole village including Prithviraj's step-brother Vikrant opposes Abbas' actions but Prithviraj arrives and handles the situation. On being asked his name, Abbas's friend comes out with a fake name 'Abhishek Bachchan', as it would create a rage if villagers came to know that the lock of a temple had been broken by a Muslim. From here starts a series of cover-ups, goof-ups and comic situations where to cover one lie, Abbas starts padding up with a bigger lie telling people that he also has a twin brother with no moustache. From here on starts the topsy-turvy journey of a single person acting as two different entities.\n\nPrithviraj is made to believe that Abbas is a gay. So he appoints Abbas as a kathak dance teacher to his sister Radhika (Prachi Desai). This makes Abbas to work as supervisor as Abishek Bachchan at morning and kathak teacher to Radhika at night as Abbas. Soon, Radhika and Abbas fall in love. In the climax, Prithviraj comes to know the truth, but he likes Abbas's character and spares them.\n\nVerdict: as I said its a decent time-pass comedy film. Abhishek looks and acts well. I always thought he was a decent actor in comic/oddball roles. Well also see Krishna Abhishek the nephew of Comedy King and Dance Superstar Govinda. Govinda is in a \"CLASS\" all by himself and an Indian CINEMA ICON. Will Krishna surpass him? It remains to be seen...."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "sujit104-491-882688",
        "review_rating": "1",
        "review_title": "One of the worst movies",
        "review_detailed_main": "This is one of the worst movies of all times. This is one more Golmaal rip off. I don't understand why the director is obsessed with Golmaal. He has already made a string of sequences of it. There is nothing to laugh in the film - not the situation nor the dialogues. There were one or two good comedy dialogues by AB in the whole film - that's it! Krishna also fails at comedy, he cries in a particular way whenever something bad happens in the film. It is supposed to be funny - I don't think so! AD speaks some weird English language, but again not funny. Prachi Desai looks sweet and Asin does OK in whatever chance she gets. Overall - one of the worst films. If such directors are encouraged in the industry, then I don't see a good future for our films."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "sandeepbihani",
        "review_rating": "1",
        "review_title": "We will no more keep our minds at home",
        "review_detailed_main": "Seriously Mr Shetty??? Are you serious. We are living in world of OTT and have seen such classy content. Your content is like a lump of poop.\n\nAnd your star cast is so cliche'. Can you stop using a formula and start using this platform to good use. Stop apologising to one community and make them feel good. We are now a matured society and can handle matured topics.\n\nNow when an Indian cinema goer is paying such a huge amount on multiplex ticket, how dare you say to them to leave mind at home. Are we crazy?\n\nAnd stop blowing car and keeps in air!!! It is juvenile and idiotic.\n\nAnd about the movie!!!! Yawn yaawn and more yaaaaawn."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "shankar-68749",
        "review_rating": "1",
        "review_title": "Trash!!",
        "review_detailed_main": "It is an absolute piece of garbage produced by the Bollywood Mafia. The spineless Bollywood Mafia whose only aim is to show Hinduism in poor light. Best avoided so that your time is not wasted.."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "xplodee-virus",
        "review_rating": "8",
        "review_title": "A Must Watch !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "jm00888",
        "review_rating": "10",
        "review_title": "Laughed out Loud!!",
        "review_detailed_main": "Yes!! this movie is awesome, and with very good comedy. In short movie has a good story, the crew is excellent, and fantastic acting by Ajay Devgn, and Abhishek Bachchan. Sometimes you just to have come to cinema with open mind. Don't over-think much about this film, as it just goes with the flow :). Ajay Devgan and Rohit shetty pair once again proved that only this pair can make the best commercial movies. Ajay Devgn's acting and comedy( just mainly of using wrong English words) is too good. Abhishek Bachchan's acting timing is also very good. Its a full entertaining package for everybody with family. Prachi Desai looks cute in the movie. This movie is going to be a super-hit. Awesome 10 out of 10!"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "bbb-bibekanandan",
        "review_rating": "9",
        "review_title": "Simply funny and Entertaining movie",
        "review_detailed_main": "now logic,no pressure on brain.. just watch--> interpret --> laugh ;) spending on this type of movie is truly worthier . Direct translation of Hindi Dialog to English . Amazing . Those who like fun, funny, laugh therapy.. just watch it. 2+ hrs full entertained so putting this type of review...\n\nCast : Ajay Devgn, Abhishek Bachchan, Asin Thottumkal, Prachi Desai, Asrani, Archana Puran Singh, Neeraj Vora, Krushna Abhishek, Jeetu Verma... Director :\n\nRohit Shetty Producer :\n\nAjay Devgn, Dhillin Mehta Story : The film is inspired by Hrishikesh Mukherjee's 1979 classic comedy Gol Maal. Genre :\n\nComedy"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "cricket10",
        "review_rating": "10",
        "review_title": "bast of the Rohit Shetty Ajay Devgn and abhishek bachan....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "nimjoy",
        "review_rating": "9",
        "review_title": "Awesome and full entertainment!!!!!",
        "review_detailed_main": "Rohit again directed superb combo movie(Action,comedy)..... Movie is awesome and full entertaining...... In whole movie you will not feel a moment of boring and keeps you laugh!!!!!!!!\n\nAjay and Abhishek has Rocking performance!!!!!! In last 15 minutes you will feel the same scene as in \"no entry\" movie,however Rohit directed it in much better way!\n\nEnjoy the Movie and it will make you Relax and feel better! Krishna also done good performance,but some scenes you will feed he has done over acting.\n\noverall good Movie!!"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "GrandMasterrrr",
        "review_rating": "10",
        "review_title": "Superstar Ajay Devgan shows what a great actor he is",
        "review_detailed_main": "The story is not the greatest of all... but this amazingly entertains and leaves a very good taste in the audience, Rohit Shetty did a marvelous job. The movie stars Ajay Devgan and Asin.\n\nI went to watch this with my friends and we enjoyed this movie from the beginning till the end. Ajay Devgan bashing the goons with charisma and with broken English that is hilarious, Devgan has improved his comic acting so much in the last few years, this movie belongs entirely to him, he carried this film on his shoulders. Movie would of been a flop if it had another actor.\n\nAjay Devgan was very humorous with his English."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "thp75",
        "review_rating": "10",
        "review_title": "most hilarious and fantastic movie with great message underneath",
        "review_detailed_main": "It is fantastic movie, forget the performances of all whether they are good or bad.. movie ends with great message with style and fun... It should be seen with no brains from beginning but brain will be invoked by the end automatically and u will get the message right with lots of fun.. great movie by rohit shetty. it is the best so far from him. All characters are playing as usual but the storyline and end output is superb and one shud give full marks to Rohit shetty and direction and story writers.. It is best movie of 2012 with lots of fun.. after long time it was movie from bollywood that delivered with fun and hit on the target..well done.."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "barun-devnath",
        "review_rating": "8",
        "review_title": "It was fun to watch it.",
        "review_detailed_main": "This movie was really funny. After long run of crappy Hindi \"funny\" movies it was a really fun to watch this movie. Well I am not saying this is a hilarious movie. But its not that bad as the reviews are showing. The matter is you have to know about our Indian culture (specifically village culture) to enjoy the funny part of this movie. Also there were some parts where actors said some dialogs from previous funny movies. Those were also funny. So you see if you don't know about our culture or about our long tradition of funny films culture - you wont get the funny essence from it.\n\nAbhishek Bachchan, Ajay Devgan were awesome. But this girl \"Prachi Desai\" is a gorgeous actress (or whatever) but she does not know how to act. Also \"Krishna Abhishek\" in some part of the movie did some irrelevant overacting."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "Bol Bachchan (U/A)-------my Rating: 4/5 SUPER HIT",
        "review_detailed_main": "Bol Bachchan (U/A)-------my Rating: 4/5 SUPER HIT\n\n* It is an action comedy entertainer......\n\n* Cast : Ajay devgan and abishek stunned the audiences by their performances especially the comedy characters will take with unlimited laugh throughout the movie, where as Asin and prachi comes in short role... * story is the remake of the Tamil movie\"THILLU MULLU\" so the story is predictable and stunned the screenplay with marvelous laughable dialogues..... *Music and BGM rocked the theater ... * Rohit shetty direction was very good as his usual scenes of car,bus fly in the air in the action sequences....\n\nFinally the movie is the clean family entertainer....\n\nBol Bachchan is a Bollywood romance comedy film directed by Rohit Shetty. The film stars Ajay Devgn, Abhishek Bachchan, Asin Thottumkal, and Prachi Desai in lead roles"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "tonysbansil",
        "review_rating": "9",
        "review_title": "Typical Rohit Shetty",
        "review_detailed_main": "You'll either love it or hate - it's a typical slapstick comedy from Rohit Shetty. However, it's far better than the Golmaal series.\n\nBoth Abhishek Bachchan and Ajay Devgan are on top form and the comedy timing is superb.\n\nIf you don't want to watch anything too serious and fancy a laugh it's definitely worth a watch."
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "amarmann9",
        "review_rating": "10",
        "review_title": "Hilarious and fun movie!",
        "review_detailed_main": "If you are looking for some Shakespearean drama, then this isn't the movie for you. If you want a really funny, somewhat silly, light and fun movie, then this IS for you. Thought this was a great movie! Even my kids enjoyed it. The highlights were Ajay's one-liners in English (ever cent discounts!) and Abishek's dual-role. He pulls off playing a flamboyant gay man really well! Almost too good! Anyway, lot of fun and don't listen to all the uptight party-poopers who are just haters. The story moves along at a good pace and does not drag like your typical bollywood film. Enjoyed some of the cheesy stunts and fight scenes too. Some of those were unintentionally hilarious, but all of it adds to the charm of the film. You won't regret watching this unless you're an unhappy smug person like some of the other reviewers on here. Enjoy! We loved it!"
    },
    {
        "movie_id": "tt1728986",
        "movie_name": "Bol Bachchan",
        "movie_rating": "5.6",
        "review_username": "Rupinder124",
        "review_rating": "",
        "review_title": "A purely nonsensical film made watchable by Ajay Devgan.",
        "review_detailed_main": ""
    }
]