[
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Farstrider",
        "review_rating": "3",
        "review_title": "Not worth the time",
        "review_detailed_main": "This movie was terrible to put it simply. I wasn't expecting it to be great, but I wasn't expecting it to be as bad as it was. It seemed that they took a really bad, wannabe Kung-Fu movie added some Street Fighter names and thought that would good enough to pass it off as a Street Fighter movie. Horrible, almost nonexistent plot, bad acting, and terrible fight scenes make this movie not worth the time it takes to watch it. At times it was funny though, but not intentionally. When certain characters try to be serious or they throw out some line they think would be good catch phrase you can't help but laugh at how poor the acting was."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "on_the_can",
        "review_rating": "3",
        "review_title": "Ridden of it's goodness",
        "review_detailed_main": "If you think my heading is cheesy and stupid you're absolutely right and I heartily agree...unfortunately that vary statement is the crux of the latest Street Fighter attempt's plot.\n\nIgnoring the 1994 Van Damme version of the franchise this film starts anew, focusing on the character of Chun Li, a young Asian woman highly skilled in both piano and martial arts. Her dad gets taken away from her at a young age by M. Bison who uses him in his criminal plot to overthrow Bangkok. Unfortunately for Bison Chun Li grows up, meets a mystic who teaches her some freaky stuff and sets out to kick his ass. While the Van Damme version was far from spectacular it had a sense of humor about itself and wasn't afraid to have fun with the material, which was at the very least entertaining for a lazy hour and a half. The Legend of Chun Li tries to be a dark brooding action thriller with something like Batman Begins as its model...but the material just doesn't support it. The plot goes back and forth between clichés and just plan dumb hokey sci-fi stuff. Yes, being \"rid of your goodness\" is actually a plot point.\n\nThe script is loaded with cheesy dialog and flat characters which doesn't make the actors' jobs any easier and they really don't live up to the challenge. Chris Klein is particularly bad in his attempt to be the bad ass.\n\nYou would think the action would at least make it worth the time but even that is nothing to brag about. The fights are far too staged and obviously fake. They throw in some signature moves from the video games that are beyond reality. If they'd been shot differently they would've been cool, but here they just look ridiculous. These are things that would fit at home in a more cartoony film like its predecessor...but sorry, no go."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "jamylie",
        "review_rating": "3",
        "review_title": "A Legend Worth Forgetting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "kels-errific",
        "review_rating": "1",
        "review_title": "The god-awful, the bad, and the ugly",
        "review_detailed_main": "So this movie has been on my radar for quite a while. I was smooth talked by Justin Mark's assurance that his treatment of the movie was respectful and to be prepared for a new era of gaming films. I was pumped and on board, and then... I saw the film. THE GOD-AWFUL The script from this movie was a joke. When Bison utters something about milk and expiry dates, I laughed. It was a nervous laugh, but it was laughter. This movie makes no sense to me at all. The pitch was it was a Chun Li story about looking beyond revenge. In the end, she gets her revenge and the moral is? Revenge is the answer. THE BAD The costumes in this movie can also suck it. I felt terrible for Kristin in the night club scene, wearing a ridiculous dress and using her feminine wiles ( primo top dollar dancing to the unaware) to lure Cantana, a lesbian associate of Bison, into a bathroom. The pacing of this movie was dreadful, and we are hand-held for every scene, if Chun Li is walking on the screen she will undoubtedly inform us \"I was walking..\" ... REALLY? Really. THE UGLY The truth is this movie insults movie goers, gamers, and people, in general. Am I supposed to feel for Chun Li, even though she had a privileged life, and a loving mother? How is she a victim of circumstance? Am I supposed to feel Vega's threatening persona through five minutes of him getting the crap kicked out of him? Am I supposed to believe Bison is all evil when he continues to nurture his daughter? I think this movie was seriously edited so terribly, whatever good there was to salvage was lost on the cutting room floor. Whoever edited this needs to be bird kicked in the throat. It just makes no sense to me how the editor could do his job, watch the movie and allow this to enter the theaters. The best parts of the movie involved subtitles, and a sunset. That is it. So there you go, street fighter 2? Most assuredly, not."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "barretto_chris",
        "review_rating": "1",
        "review_title": "This movie is the worst movie I have ever seen",
        "review_detailed_main": "I don't even know where to start. For anyone who knows anything about Street Fighter, set yourself up for disappointment because the movie has absolutely nothing to do with the game. There are little to zero special effects and the ones that are in the movie do not revolve around the fighters special powers. Let's talk about the characters....I realize the movie is suppose to be about Chun-Li, but that does not mean exclude every other character in the game. The ONLY characters are Chun-Li, Balrog, Bison, and Vega. None of the characters have the same power or skill that they display in the game. There are also a lot of over played scenes by useless characters such as Chris Klein's Interpol character and the other Asian chick that also has no purpose. They only serve as pawns in making the movie more irritating. If there was ever a punishment you wanted to dish out to anyone or revenge you wanted to take upon somebody, just have them watch this movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "gale_winters",
        "review_rating": "1",
        "review_title": "-or- How to Make the Worst Movie Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "the_final_ninja",
        "review_rating": "1",
        "review_title": "Bad Movie. Big Disappointment.",
        "review_detailed_main": "This movie is very terrible in many ways.\n\nFirst off, the choice of characters is the worst possible ever for a game movie. Chun Li is meant to be Chinese yet you've chosen an actress who has problem speaking the language in the movie (when for example she asks for help which she asked in a terrible accent).\n\nGame movies are not really easy to be pulled off along with good reviews, not many are out there. The reason is shown very clear in this movie. The director ALWAYS misses the point of what the movie should be about; I mean fair enough you don't want a movie about Ryu fighting Ken or Bison, and want a Legend of Chun Li, But you could've put a better story in it, or give the movie better actors (I can't believe the acting in this movie). Take Marvel for example, their world interacts a lot of different marvel characters, but when it comes to their own movie/cartoon, they actually make the story relevant to the characters life(e.g just because Bison was the boss, it doesn't mean that Chun Li's life has to be revolved around killing him (which is what Ryu does)).\n\nThe choice of camera shots used to try and show the story was also done badly. For example when Bison was trying to show the camera that he had a picture of his wife and daughter, which were dear to him; First off, would Bison do this? Secondly, this is very very corny.\n\nThis movie had made me dislike street fighter. I would highly recommend better actors and directors AND story writers if another street fighter movie comes out.\n\nP.S Didn't finish the movie, it was that bad."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "srkooijman",
        "review_rating": "1",
        "review_title": "Holy shi-- what was that?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Floated2",
        "review_rating": "2",
        "review_title": "very disappointing",
        "review_detailed_main": "When i first saw the trailers of this movie, i thought that it was gonna be great and entertaining. I remember playing the video games of street fighter while growing up and remembering the characters so i got excited for this. But this was a big disappointment. I can honestly say that the script was just plain awful. Since the script was crap i cant blame the actors for there performances. Except for Nash (Chris Klein) he was truly terrible, how the hell is he able to be an actor and who is the idiot that decided to pay him for it. they should of really ran through the script and made sure it all made sense. The first fight scene was actually good so i thought it was going to be a good movie, all though i did not like the intro to the movie since it dragged on. I hate movies where the characters tell their story and when their telling it from their prospective. That was how it started for street fighter. Vega was over too quick and not great, the club scene was all right until Chun-Li did her upside down kick it was way poorly done. And the ending was really weird. While Chun-Li and Gem are talking, Gem mentions Ryu's name..it must be a hint that there will be a sequel. Hopefully if there is one, it will be better than this.\n\nThe movie was very confusing to watch and I just didn't understand what exactly was the point. I just got cheesed off at a point. They ruined another video game movie...way to go. I would not recommend this movie to anyone, seriously bad"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ed_die_master",
        "review_rating": "2",
        "review_title": "Street Fighter ....disappointing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "earlsy",
        "review_rating": "9",
        "review_title": "Enjoyable romp",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "helmutty",
        "review_rating": "6",
        "review_title": "What i saw is not the worst movie ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "grenmonkey",
        "review_rating": "1",
        "review_title": ".....",
        "review_detailed_main": "How can a movie that runs for a hour and a half feel so long? Street Fighter: The Legend of Chun-Li (2009) is a horrible, unimaginative, cheesy and just plain stupid movie. The dialog made me laugh at the movie, not with the movie – the actors didn't pull through with the cheesy material. The acting is agonizing along with the script that makes very little sense if any, even the action is dull.\n\nThe whole movie is just one big pile of rotten cheesy clichés sewn together without any idea of what is being made. The first Street Fighter movie (1994) at least made me smile once here and there with it's \"camp\" -attitude, Legend of Chun-Li tries too hard to be a seriously taken \"growing-up\" drama that the fail is twice as bad that it could've been. I felt ashamed even just watching the movie, must've been tough to be actually a part of it. Well, at least they all got paid.\n\nI really don't have anything positive to say about the film. 1/4"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dark_mullet",
        "review_rating": "2",
        "review_title": "You'd Think Capcom Would Make It MORE Accurate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ninja209-1",
        "review_rating": "5",
        "review_title": "decent kung fu action flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "wynonasbigbrownbeaver",
        "review_rating": "5",
        "review_title": "Round.... One....... FIGHT!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "maxiam_us",
        "review_rating": "5",
        "review_title": "A good popcorn flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "allanthewrestler",
        "review_rating": "4",
        "review_title": "Don't Wast Your Time",
        "review_detailed_main": "This movie was bellow par. Horrible graphics and bad dialog. I would rather have payed to watch the original movie with Jean Claude. If they make another one they really need to step it up and use the original back ground stories on characters. Chun-Li's dad was a lead detective in China not a business man! Hopefully Capcom will actually screen the next movie and not let it suck so bad. All in all just a bad bad movie that didn't stick with the video game/ cartoon background info on these characters. But play Street Fighter 4 the game is awesome. All the great old characters and handful of good new ones. Make the next on better please!!!!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dbborroughs",
        "review_rating": "5",
        "review_title": "Okay, but I'd wait for cable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "funnyartist2200",
        "review_rating": "1",
        "review_title": "How come no one looks their part?",
        "review_detailed_main": "Seriously, I rather watch the first live-action streetfighter just because some of the cast actually looked like the role they played.*(Zangief, Sagat, Bison, Blanka ..a bit, etc) In this movie, NO ONE LOOKED ANYTHING LIKE WHO THEY WERE SUPPOSE TO BE!! (except maybe Vega and Balrog. I only recognize him from his mask and claws) Honestly, I couldn't tell who was who until they say their name. I was so disappointed in Bison. He's looked nothing like the one from the game. The effects were pretty awful. Anything good? Well Michael Clarke Duncan as Balrog (he did a good job) and Kristin Kreuk looks really hot. =) Well I watched this movie after playing good old Streetfighter so I'm basically comparing this to the game. Overall, don't watch this movie. Sorry Kristin Kreuk. You're hot but this movie is not. (sorry bad pun)"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "sami-somermaki",
        "review_rating": "8",
        "review_title": "Definitely no masterpiece, but still a nicely entertaining action movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Filmverse",
        "review_rating": "6",
        "review_title": "Some thrills for fans, but sadly uneven...",
        "review_detailed_main": "Having enjoyed the game as I a kid, I was excited to see Chun Li in a new feature adaptation. The cast showed signs of \"mixing it up,\" with its choices and I was willing for the ride.\n\nWhile the overall origin story is strong (the piano playing a very nice touch for depth) unfortunately many scenes come off as campy. On a scale, the strongest scenes are easily those between Kristin Kreuk and Robin Shou as Chun Li and Gen, and sadly the weakest being Michael Clark Duncan and Chris Klein's characters of Balrog and Nash.\n\nThat was the central problem for me here, there is an exciting action piece at work but is jumbled with various other plot lines and set pieces that really feel out of place. The feeling of the film comes off as uneven as was also the case with Director Andrzej Bartkowiak's previous works in CRADLE 2 THE GRAVE and DOOM. This film unfortunately continues Bartkowiak's pattern.\n\nNevertheless, Chun Li was carried well by Ms. Kreuk and the effort was well mounted.\n\nRT."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Ramascreen",
        "review_rating": "1",
        "review_title": "An Abomination!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "beobnoxious",
        "review_rating": "5",
        "review_title": "Street Fighter in name only",
        "review_detailed_main": "A wonderful and beloved franchise dies with the creation of this film. From reading the tittle you start thinking maybe this will be an origins type of movie and it is but its horribly lacking in cameos, special effects and meaning fullness.a complete disappointment. The only thing going for this film is the lead actors/actresses try there best with the garbage there given and the martial arts sequences are well put to gather and powerful looking. Basically the street fighter name is used to garner sales if was named Streets of Bangkok I probably would have given the movie a 6.5 because character names and martial arts is the only thing this film has in resemblance to Street Fighter."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Just as bad the second time around",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "lastliberal-853-253708",
        "review_rating": "5",
        "review_title": "Sometimes you have to stand up when standing isn't easy.",
        "review_detailed_main": "Let's go through this again for the benefit of those who are thick- headed. Books, video games, and movies are separate art forms. Comparing them is an exercise in futility.\n\nGiven that, you can expect that will be a review of the movie. I do not care what relation it has to a video game. I am strictly looking at the story presented, and the actors involved.\n\nFirst, I like that Neal McDonough is the bad guy. he is a very bad guy, to say the least. I didn't like his character in Walking Tall, and am glad to see him get more of the treatment he deserves here.\n\nI didn't like Michael Clarke Duncan at his side. He played such a good character in The Green Mile, that it is difficult seeing him playing a baddie. He did a great job nonetheless.\n\nKristin Kreuk is new to me as I never watched the WB. She did a fair job, and kept me interested so much that I hung in there way past my bedtime. I wasn't familiar with Moon Bloodgood either, but she was definitely hot, and worth seeking out in other films. The Surrogate sounds like a good one to watch."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "RichardSRussell-1",
        "review_rating": "3",
        "review_title": "Wait for Watchmen",
        "review_detailed_main": "Always a crapshoot when you base a movie on a video game. Things this one had going for it:\n\n \u0095 Kick-ass female protagonist, Chun-Li, played by ...\n\n \u0095 Kristin Kreuk (Lana Lang on Smallville)\n\n \u0095 Respect for the locales and cultures in Hong Kong and Bangkok (some subtitles)\n\nRegrettably, that was about it. The story had some promise but was ruined by terrible writing and the worst individual acting performance I've seen in years (Chris Klein as Nash of Interpol).\n\n2 SF&F elements: (1) the good guys could conjure up scintillating globes of force; (2) the bad guy was able to transfer all his goodness into the soul of his unborn dotter. Those 2 accounted for maybe 4 minutes total and weren't integral to the plot. Otherwise it was mainly whack, bash, kick (none done memorably), and occasionally shoot."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dvc5159",
        "review_rating": "2",
        "review_title": "You either love it or hate it. I did not like it.",
        "review_detailed_main": "Okay, I'm having a tough time here. In the cinema I was enjoying myself, and back home two days after watching it I'm starting to feel like I hate it, not sure what movie I just saw. I wrote a positive review here but this is an edited one to show my genuine feelings for this film (usually I don't do this), so bear with me on this one. The first with JCVD is better and more entertaining than this droll.\n\nThe only good thing about this movie is Kristen Kreuk. Let me say that she is absolutely gorgeous, and that she is perfect for the part of Chun-Li. For those who say that she could not play Chun-Li because she's American, stop whining. She pulls it off in her role. She's also in plenty of fight sequences in here, most of them testing her physical abilities, which is a good thing.\n\nIt is barely entertaining, as the action feels forced and rushed. The fight sequences and choreography, however, are well handled, contain little-to-no traces of CGI , and loyal to the game. It becomes clear that the filmmakers have played the game and done their homework, trying to best to imitate the moves. Chun-Li's trademark kicks and fireball superpowers are shown here (okay, sometimes TOO loyal). The special effects, however, are lackluster.\n\nSecondly Chun-Li never quite had an explained background and here it's sort of okay, if not clichéd, to see how she became who she was destined to be. It's a good, cheesy story with a bad script, as it has cheesy one-liners, but not as excessive and extremely cheesy that the first Street Fighter film had. Now instead of laughing at the mistakes, we dread them.\n\nThe supporting actors are okay additions to the film. Tough guy Michael Clarke Duncan as Balrog and Taboo as Vega (surprisingly he's not bad) however, is wasted and their performances fall flat. But the real show-stealer here is Neal McDonough, who looks like he's having a blast playing the main villain, Bison, a role that tarnished the great Raul Julia's career (sadly it was his last cinematic performance) in the first movie.\n\nWhat makes the film give credibility is the lively and kinetic direction from director Andrzej Bartkowiak. The man is no stranger to martial-arts movies, as he directed Jet Li in \"Romeo Must Die\", \"Cradle 2 The Grave\" and Steven Seagal in his last big movie, \"Exit Wounds\". He is no stranger to video-game movie adaptations either, as he directed the lackluster \"Doom\" starring Dwayne \"The Rock\" Johnson. However he has not quite bowed out of video games just yet. Hearing his name behind the camera brought me a glimmer of hope that this movie could very well be a success. Nope.\n\nIf you are disappointed or hated the first film, or if you love the first film, the I don't know, because the film is disappointing. Sorry for those misleaded who thought I was writing a positive review. But then again, I don't know. I think I enjoyed the first one more than this. At least the first had something to laugh at.\n\nOverall: 3/10"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Mash-the-stampede",
        "review_rating": "1",
        "review_title": "Street Fighter: Legend of ZZZZZzzzzzzzzz........(snore)",
        "review_detailed_main": "Not surprisingly; no Ryu, Ken or Guile doesn't make for a very good Street Fighter movie. So naturally, my expectations for this film weren't very high. What I didn't expect however, is the possibility of the film actually being worse than I expected!!! Quite simply, this film is terrible with a capital \"T\" and a bunch of exclamation marks after it!!! How is it possible in this day and age that films this bad get made and worse, actually make it to the big-screen??? No doubt actual Street fighter fans everywhere (including myself) will be out for blood after seeing this cinematic atrocity!\n\nI can't be bothered wasting my breath about this \"film\" but I'll just say the special effects were certainly special but more in a South Park 'Timmy' kind of way, the fight scene's were even worse and the acting and plot were non-existent! It was like watching porn without the porn! Pointless!!!\n\nThe only potentially cool character (Vega) got taken out in about 30 seconds! Lame!!!\n\nIf you thought the Van Damme Street Fighter film was bad then you're in for a major surprise with this one!!!\n\nHonestly, the whole thing plays out like a bad made for TV movie and is just horrible. Not even good for a laugh! AVOID AT ALL COSTS!!!!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Quinoa1984",
        "review_rating": "3",
        "review_title": "when you have to keep quiet in a movie when Chris Klein is about to speak (for all the wrong reasons), oh boy",
        "review_detailed_main": "This is the kind of generic claptrap that you don't even want to think about once it ends. It's made by a studio and by proxy filmmakers (or is it the other way around) that didn't care for an instant about its story or its own franchise of characters and the fans of the Street Fighter video game. If they did, it would look at least somewhat like the 1994 Street Fighter movie (which, of course, wasn't good either, but that at least tried). Instead we get a weak story of Chun-Li's \"legend\" of going from a nice existence as a concert pianist to going to the streets to uh learn how to fight (who and from what, maybe it's the scrolls, is never explained) and make fire/energy-balls from her own inner-self. That's about as much as I got on what it's about, except there's a villain played by Neal McDonaugh with an inexplicable and horribly acted Irish accent, and Chris Klein playing... holy s*** it's Chris Klein trying to channel what Nicolas Cage is doing right now, which is not something pleasant to watch! I watched it for all of the reasons of a guilty pleasure movie night with some laughs. Some are to be had. Other scenes are just filled with dull and overly-written narration and the kind of dialog that I wouldn't trust with the best actors. Then again, nobody really associated with this movie is OK... except Michael Clarke Duncan, he's one to root for even as a crappy villain. Grade: D"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "david-wei-jiang",
        "review_rating": "1",
        "review_title": "yikes! what a mess",
        "review_detailed_main": "So... I was pretty excited about this movie.. then bad reviews kept me from seeing this movie in theaters. And again, when it came out on DVD. I waited for a month to give it a try. I finally picked it up for free using a coupon and now I regret wasting the gas to pick it up. I was expecting the worst and the movie was worse than even that. The screenplay and the dialogue was so bad that I couldn't help but laugh at it. It was so cheesy that I couldn't even bare it in fast forward.\n\nHere are the worst of the worst parts. Chris Klein tried to put on a serious face to play a bad ass cop only to have it come off as if my 5 year old nephew is pretending to be mad at me....\n\nThere was a huge scene where Chun-Li, the heroine, is sobbing and whimpering before she leaves for Thailand (a temporary visit). She goes \"I'm leaving everything I know... etc.\" WHAT THE HELL. Would \"the bride\" whimper and cry to her friends before she goes off to KILL BILL??? Did I mention the bad screenplay???\n\nFor spending her entire life in Hong Kong, Chun Li could not speak Chinese to save her life.\n\nThe funniest part was when Chun Li's dad was being dragged away by Bison's Crew. Chun Li's mom comes running out hysterical only to get slapped down to the ground. It looked like a Marlon Wayans hysterical run from \"Scary Movie\".\n\nThe script begs the question.. which idiot producer read the script and green lighted the film? And how desperate were the actors to take the role? I mean I've seen bad.. but this is just nonsensical."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "aj_ajc_aj",
        "review_rating": "8",
        "review_title": "bad movie? i beg to differ!",
        "review_detailed_main": "I myself used to play street fighter when i was a young lad and actually picked chun li a lot. When i saw the film she did every move i used to and made me love the chun li all the more. The action is tight packet.\n\nI admit some of the scenes are most certainly cheese but overall this was an impressing movie. I actually did not think I was going to like the film at all, I was forced to buy by my little sister, Im so glad that I bought because it really is an entertaining film. Were not expecting X-Men, Push, or TMNT, which by the way was a god awful movie. Were talking about Street Fighter!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "iamcoolstephen1234",
        "review_rating": "6",
        "review_title": "Not as bad is people make it sound",
        "review_detailed_main": "This movie wasn't THAT bad. Everyone acts as if they would rather spend 90 minutes strapped to a bed of nails whilst being whipped by a hairy woman in leather named Butch than they would spend the same time watching it. I assure you that is not the case.\n\nIf you're expecting a repeat of the vandamme flick, then you will be disappointed as that is not what you will get. This is not a turn by turn fight movie; it is an adventure movie. Chun Li goes to Hong Kong to rescue her father and ends up fighting a bunch of people along the way. Many of the fights involve gun ambushes and typical fight scenes for cheesy action films with people who don't do martial arts in real life. There is no tournament, just her journey. The fighting is marginal, the acting is marginal, the action is marginal.\n\nKristen Kreuk (Chun Li) is the same character as any other part she plays (notably Lana in Smallville) - she talks the same and pretty much acts the same, but with more violence (not that much more). She is not a great actress, but she's not a terrible one either, considering she has played the same role her entire life.\n\nChris Klein, however, should die. He is almost entirely useless and tries to be a bad ass/smart ass/\"I say clever things and look really cool while saying them, then make a cool face after I finish the sentence\" character, but he fails. It was painful to watch him because he's just so terrible in the movie. Imagine his character in American Pie or the one is Just Friends as a \"bad ass\" cop who wants to be cool and impress people, but can't, yet still thinks he does. It just hurts to watch. He is the reason I give it a 6/10. If he wasn't in it, it could be a 7. Or an 8...or a 9, maybe even a 10 I don't know I couldn't watch without wanting to rip my eyes out during his scenes.\n\nThe other people, though, are just plain average. They recite their lines and move properly. Overall a C for them.\n\nFor the movie as a whole, though: I went in expecting complete crap and came out feeling like it was a decent cheesy action flick. I would not pay good money to see this, but it wasn't necessarily a waste of time. If you're bored and see it in the video store for a dollar, why not rent it? If it's on TV or if you see it online and you have free time, go ahead and watch."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "wylfyr",
        "review_rating": "1",
        "review_title": "ugh, what a stinker",
        "review_detailed_main": "This movie can be described in a few words. The words that come to mind to describe it are as follows: awful, bad, lame, garbage and an insult to martial arts films everywhere and so forth. Where to begin ? lets start with Kristin Kreuk's acting...or lack thereof. Her performance is wooden and 2 dimensional as she conveys NO emotion from her character. Kristin Kreuk's performance in this film reminds people that a person should take acting lessons before doing a movie. If anything this film should of been killed off as its a waste of 90 minutes to watch it. I would give it a 0 for a rating but that would be generous as its not even worth that.\n\nIt seems that Michael Clark Duncan and Robin Shou must be hard up for roles if they took this king of a stinker. Don't even bother watching this film as a rental folks, its not worth it and you will regret spending your hard earned $$$ on this garbage. This film should be a major contender for the Razzie Awards. No wonder it bombed at the box office."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "moloko-4",
        "review_rating": "1",
        "review_title": "The CIA could add screenings of this movie to their already packed torture rosters at Guantanamo Bay",
        "review_detailed_main": "Quite possibly one of the worst movies I have ever had the displeasure to see. Chris Klein was laughably awful (no change there then), Moon Bloodgood was wasted (and rubbish) in her role.\n\nBest of all is M. Bison's hilarious Irish accent, if you can still take this movie seriously after witnessing that spectacle then you are either braindead or require urgent psychiatric attention.\n\nOne of the most diabolical, awful and basically laughable pieces of turd I have seen in all my life. I'd rather eat my own head than see this movie again.\n\nI'd rather soil myself in front of my family than watch this bungling turdfest of a movie and that is being generous.\n\nThis movie is what they must screen in Hell (they don't show it in Hell here in Grand Cayman though so at least some folks have been spared it seems)."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "How bad can these movies get?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Cool moves cannot save the disjointed story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dt10111",
        "review_rating": "3",
        "review_title": "Very Bad",
        "review_detailed_main": "One has to wonder what the point of making a movie based on a nearly twenty year old video game is, especially in light of the fact that this movie doesn't seem to have anything to do with the video game excepting the names of a few characters. Is this a video game franchise that even has any real fans anymore?\n\nI'm old enough to remember spending time playing Street Fighter and the various sequels at the local arcade, playing in tournaments, etc. There wasn't any plot in these games, just stylish characters and a fight tournament. Perhaps a dull premise that has been done, but it seems if the cartoonish style were translated into a campy action film, it could have been somewhat entertaining.\n\nInstead, we have a movie with a serious yet dull plot, horrible overacting, no real mythology, embarrassingly inappropriate music, visible boom mics, bad makeup and a terrible script. Even the fight scenes and choreography are bad, making this movie pointless and unwatchable. Really, there isn't anything very good to say about this movie and I really wonder what inspires someone to make a film like this. This is definitely not recommended."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "johnnymacbest",
        "review_rating": "4",
        "review_title": "What's my motivation? Somebody PLEASE tell me!!",
        "review_detailed_main": "My first reaction to Street Fighter: The Legend of Chun-Li was somewhere between skepticism and morbid curiosity; the latter of which left me with a feeling of stark-raving guilt after seeing it. Not a huge fan of the series, I just like fighting games in general, whether they're 2D or 3D, doesn't matter. But fighting games don't make for compelling story lines; after all who plays them for the story anyway (well at least for Soul Calibre among several other games)? Although I never had the pleasure of seeing the first film, I saw it on TV on a hot, boring day in the summer of '98; thank the stars!! Now with that out of the way, on to the review.\n\nOK, so the first film sucked badly and though I hated it, I kinda understand where they're coming from. So they decided to just start from scratch trying to make this new installment edgier and action packed with moments of emotion and drama but they only succeeded in making it marginally better than it's predecessor which isn't saying much considering the fact that \"Enter The Dragon\" was the main inspiration of the series. That film didn't have much of a story to begin with but at least the fight scenes were much more memorable and well choreographed than this film put together and overall better acting performances especially when Bruce Lee was on the road to martial arts super stardom at the time until his untimely tragic death; even to this day remains a mystery.\n\nWhich brings me to my next points: Fight scenes and acting. Kristen Kruek does her best for what she's given but the others are so flat-out bland that at times I found myself laughing and shaking my head in utter disbelief. We never get a chance to get to know the characters from the inside out or marvel at the fight scenes due to the consistent ADD-riddled editing and uneven pacing which, ironically, plagued the first film as well. Neal McDonough is the only one who's credible as bad boy Bison even more so than the late Raul Julia. There are many inconsistencies with some of the characters; namely Gen, whose supposed to be a Miyagi-type Kung-Fu master rather than a young man. I'm no purist but I was disappointed that they altered his character so drastically. Balrog and Vega, on the other hand are just \"extras\" to be kicked around when the film calls for them to do so.\n\nSpeaking of fight scenes I know martial arts films don't necessarily have to be deep and meaningful(with the exception of Crouching Tiger, Hidden Dragon) but c'mon give us a decent story. So Chun-Li goes to Thailand to seek revenge against Bison...big deal. What else is there for her? What purpose is she seeking beyond just revenge? The film never gives us an insight nor goes into detail beyond the basic plot. Granted, character development isn't one of the series's strong points but it wouldn't hurt to put more effort into the script and the characters.\n\nI suspect Bartowiak and co wanted to follow in the first film's footsteps and instead jammed together and rushed the \"finished\" product in the hopes that not a single idiot can't see the cracks. But I assure you, fans and moviegoers that I am not stating anyone is an idiot in this review. However I will state this: Video game movies JUST DON'T WORK!!! They never have, never will. Any way you slice it, this film is more or less just as bad as it's prehistoric cousin. Although Mortal Kombat was a little campy in some respects, at least they captured the look and tone of the games almost perfectly, combining impressive fight scenes with a thumpin' soundtrack and likable characters. It's an old movie but hey it's much better and cheaper than ponying up 12 bucks for this one.\n\nSo Kristen Kruek thought it was wise to leave \"Smallville\" to play the iconic role of Chun-Li. Only problem is she looks nothing like Chun-Li.\n\nMy advice: Get your kicks elsewhere. This regurgitated mess isn't worth the time and the patience to sit through.\n\nAnd one more thing. What's my motivation? Can somebody PLEASE tell me?!?!?!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "darkmoonlordevo",
        "review_rating": "5",
        "review_title": "the worst capcom movie ever made?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ed_wood_209",
        "review_rating": "5",
        "review_title": "Cheesy, hammy acting from Chris Klein - Excellent",
        "review_detailed_main": "I watched this last night, and to say it's the worst movie ever is an exaggeration (Uwe Boll movies take the top 10) It's not by any stretch of the imagination, a good movie, but it was decent, and enjoyable. It's street fighter! The cheesy hammy acting from Chris Klein was, I thought, it's saving grace and wanted to see/hear more from him! He's obviously played the games and watched the anime's. Maybe 5 stars is a little much to give it, 4 then. I watched this with no expectations, as I seem to have repressed the original street fighter movie, that said, I also hated street fighter 4 the game. . . So if your bored and like Kristen Kreuk, watch it, you'll enjoy it, or you wont!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "slideon",
        "review_rating": "1",
        "review_title": "Video Game Movies Aren't Getting Any Better",
        "review_detailed_main": "I semi-enjoyed Andrzej Bartkowiak last film, Doom. While Doom is no cinematic masterpiece, I consider it the best video game to film adaptation ever.\n\nEven saying that though, the film still isn't all that great.\n\nBut Street Fighter Legend of Chun-Li is really awful.\n\nDirection is badly done. I'm no director and Andrzej Bartkowiak clearly has more talent that I do, but really, even the average movie watcher will spot z-grade direction.\n\nThe film contains some Street Fighter characters, but the plot is made out of thin air, not from the games.\n\nThe film is also terribly cast. Neal McDonough is the worst Bison ever.\n\nI watched the old Van Damme film 2 weeks before Chun-Li, and sadly, the Van Damme version is better. I can't believe I'm saying that. But it's true.\n\nAnd the fact that it was in theatres for only a week tells you what kind of movie it is."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "UNRO",
        "review_rating": "8",
        "review_title": "It's NOT a video game, it's a pretty cool movie",
        "review_detailed_main": "Just back from the cinema and I must say I thoroughly enjoyed this movie. Enough nods to the game without trying to be the game, real enough without loosing it's fantasy edge.\n\nSure it's easy to hate, but lets face it, the reason the Van Damme movie was so bad was because it tried to emulate the game too much, this movie does not make that mistake.\n\nFight scenes are excellently done and well choreographed, plot is smooth without being too daft or serious.\n\nIf you are expecting a video game or to see \"Lana Lang\" expect to be disappointed. If, however, you want to see a fun, well executed action movie, with some beautiful locations you're in for a treat.\n\nAnd the fact the lead character is female should keep the ladies happy too."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "jay632",
        "review_rating": "7",
        "review_title": "Not absolutely terrible... as some users would say.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mackavelle",
        "review_rating": "2",
        "review_title": "This is a joke",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "jjoser27-1",
        "review_rating": "3",
        "review_title": "very disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Senor_Hugo",
        "review_rating": "3",
        "review_title": "Just as ridiculous as anything Uwe Boll has done.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Vercetti_33",
        "review_rating": "1",
        "review_title": "This movie deserves a negative score",
        "review_detailed_main": "Some of the worst acting I have ever seen, let alone a main character that changes skin tone from a child to adolescence all help make this a bad movie.\n\nThis movie has incredibly little to do with street fighter, other than the name, the script made no sense and for half the movie Kreuk is explaining her emotions to the audience because she is not a good enough actress to act them out. Cheesy action scenes and a script that makes no sense help guarantee this as my pick for 2009's worst movie.\n\nI see a lot of RAZZIE'S headed towards this movie.\n\nJust hope the Tekken movies better!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "blackbuster_critic",
        "review_rating": "1",
        "review_title": "Not for the fans...OR ANYBODY >=(",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ericthered01",
        "review_rating": "2",
        "review_title": "Can we get Van Damme back?",
        "review_detailed_main": "I've always considered Jean-Claude Van Damme's Street Fighter movie from 1994 to be one of the worst martial arts movies that I have seen but compared to this, it's not looking too bad anymore. I hesitate to mention acting when reviewing a martial arts movie but when it's this bad you have to mention it. Chris Klein's Interpol character was ridiculous. Everything he does is so over the top and exaggerated that it looks as though he watched every cop movie from the past 25 years to get into character. Of course when you are given dialogue like \"He walks through raindrops\" to describe the villain's elusiveness, there's not much hope to begin with. Oh and he loves his job. So much that not one, but two scenes are punctuated with him smiling to himself and saying \"I love my job\". Enough about acting though because good fight scenes can save any martial arts movie but unfortunately there's none to be found here either. Kristin Kreuk is never believable at all in the action scenes. Her character is shown being taught Wushu by her father in the beginning of the film but I would describe her fighting style later in the movie as wire gymnastics. Girl can flip good though, I'll give her that. It was good to see Robin Shou again even if he does have the thankless role of teaching Chun-Li how to make a floating ball of something. He's the only one of the main characters who has any real martial arts background. The dude from The Blackeyed Peas is a pretty good dancer though. Guess that's why he got the part of Vega. What I will never understand is this: If you are going to make a martial arts movie that has a terrible script and terrible acting anyway, why not cast real martial artists. At least cast a real martial artist in a role that has only two lines of dialogue. Terrible acting, terrible fight scenes, and a terrible movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Chris2210",
        "review_rating": "2",
        "review_title": "It's bad to the point where it hurts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Tsabaron",
        "review_rating": "",
        "review_title": "Whatever it was it was NOT Streetfighter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "AJx91",
        "review_rating": "2",
        "review_title": "IMDB Average Score Is Accurate",
        "review_detailed_main": "People who gave this 5 stars or higher, are tripping. They must be some hard core Street Fighter fan.\n\nNot only this is a bad movie, but it is a bad adaptation. I don't know what capcom was thinking when they green light this."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "sammysoupuk",
        "review_rating": "10",
        "review_title": "awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dschlatter",
        "review_rating": "7",
        "review_title": "surprisingly enjoyable",
        "review_detailed_main": "(This is for all the people who wrote 'worst movie ever' comments.) First of all: You obviously have yet to see really bad movie. (try the fantastic movie, or hell ride, that should give you some perspective.) Second: What were you expecting? Some Oscar-winning masterpiece, based on a game like street fighter? Please! In what reality do you live in? Anyway. Now about the movie. I'm a huge (and often disappointed) fan of martial arts movies. Having of course seen the 1994-van damme-version, my expectations were low. But i actually liked it! The movie is somewhat mediocre, thank the Hollywood goods for that! OK, so some characters (vega, the two detectives) were underdeveloped and didn't quite fit in. The acting didn't have 'batman begins' quality and the fight scenes weren't all fearless-y (jet li), but so what?!! Kristine Kreuk looked great in those fight scenes. The fights were original, acrobatic and fun. Better wire work as in romeo must die! It (almost) never looked fake. But what I liked most was that there were no unnecessary special effects. (remember 1994? OMG)\n\nIn other words: The film worked for me, because it was not trying too hard. Not too much action, drama and special effects. Its not a great film, but decent. Try not to expect too much and you will not be disappointed. (If you don't agree with me, you should go rent movies like the mummy 3 and have a blast with all the terrible CGI)"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "abovethelaw-95473",
        "review_rating": "2",
        "review_title": "One of the best fighting games doesn't deserves this rubbish.",
        "review_detailed_main": "It's time the martial arts movies get rid off the roped scènes, because it looks so freakin' unnatural. The same is the case in this film. Chun-Li (does not fit the profile), a woman who's father was kidnapped at an early age, seeks revenge with the person who took him, Bison."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "petzkin",
        "review_rating": "4",
        "review_title": "Great actors, BAAAD plot line..",
        "review_detailed_main": "As a fan of Street fighter games and the first movie with Van Dam (And a half-decent plot-line), this movie was a real disappointment.\n\nFrom start to finish i never got what the whole movie was about..\n\nThe actors like Kristin Kreuk, Neal McDonough and Robin Shou would have made this movie look excellent, but the scripts left a lot to be desired.\n\nThe action scenes were pretty good, unbelievable, but good, but what was up with those special effects?\n\nThere were a lot of scenes that were very predictable, making the movie a bit too boring for me.\n\nOverall i give it a 4/10 since the actors made it look better than it was!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "BA_Harrison",
        "review_rating": "2",
        "review_title": "Klein does it again.",
        "review_detailed_main": "Let's take a moment to consider what a lousy actor Chris Klein is. Merely adequate in American Pie (in a role that demanded little more from him than to sing, play lacrosse and look pretty), the guy has gone on to further show that he has the talent and emotional range of a brick, with some truly lousy performances that make me wonder why he isn't currently waiting on tables. I thought it couldn't get much worse than Rollerball and Say It Isn't So, but in Street Fighter: The Legend of Chun-Li, Klein goes the extra mile, putting in a turn (as tough cop Nash) that is inexplicably bad in every way, each line delivered in a raspy macho manner whether it suits or not, and with a range of bizarre facial expressions that are hard not to find funny.\n\nTo be fair, it must be said that it's not all Klein's fault that The Legend of Chun-Li is as terrible as it is—almost everyone in this clunker is dreadful, from Kristin Kreuk as the titular heroine, who never once convinces that she is capable of unleashing major whoop-ass, to Michael Clarke Duncan as musclebound henchman Balrog, who hams it up a treat, to Neal McDonough as head villain Bison, who gives Duncan a run for his money in the overacting stakes. Maybe something got lost in translation between the cast and Polish director Andrzej Bartkowiak, but then again, maybe it's just that everyone involved stinks.\n\nAdmittedly, Bartkowiak handles some of the fight scenes well enough, but he also throws in quite a few real howlers as well, worst of all being Chun-Li's nightclub seduction of lesbian henchwoman Cantana (Josie Ho), who she lures to the ladies washroom for a smackdown, a majorly mishandled moment that makes one wonder how anyone could have considered it a good idea."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "philip-473",
        "review_rating": "4",
        "review_title": "Great Mocking film... if your into that sort of thing that is...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "metallica1031",
        "review_rating": "5",
        "review_title": "Not that bad",
        "review_detailed_main": "I am no where NEAR a Street Fighter fan. I haven't played any of the games, I never saw the 94 film, and I didn't care that Street Fighter 4 was coming out when everybody was drooling over it. Give me Mortal Kombat any day.\n\nBut because a friend of mine bought the 3 disc Blu-Ray when he doesn't have a Blu-Ray player, I received this film (among a few others) for free. So I gave it a whirl.\n\nI feel that Street Fighter: The Legend of Chun Li is a fine Martial Arts film with a nice pinch of Fantasy. The Characters were all likable, hate-able, or just plain repulsive. That is the actual spirit of the Character... NOT their acting. The acting was decent and believable.\n\nSo would I watch Street Fighter again? sure... Would I become a die hard Street Fighter junkie because of this film. Not a chance.\n\n5/10"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "I've seen worst",
        "review_detailed_main": "Chun-Li (Kristin Kreuk) witnesses her father being kidnapped by crime lord Bison (Neal McDonough). Years later, she would go into the slums of Bangkok to search for him, and learn to fight from Gen (Robin Shou). Meanwhile Bison and his henchman Balrog (Michael Clarke Duncan) have used kidnapping and intimidation to steal the slums of Bangkok. Police detectives Sunee (Moon Bloodgood) and Charlie Nash (Chris Klein) are trying to bring down Bison.\n\nThere is good fighting action and some real Bangkok location shoots. It is putting a third or fourth important character from the video game as the lead. Granted she is one of the first female video game characters. But there is always a sense that this is a secondary movie. Kristin Kreuk is a TV actress and she looks like it in this movie. Neal McDonough brings his normal acting prowess. The story is fairly straight forward. But the production value is poor considering the big budget. It feels like a well funded B-movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Chinchillajs",
        "review_rating": "4",
        "review_title": "Does This Street Fighter Pack Enough Punch??",
        "review_detailed_main": "Would I be correct in assuming that if you're interested in seeing this movie that you're either: 1). A hardcore fan of the Street Fighter franchise; whether you read the comics, watched it in anime and for several hours played it in the arcade or at home. 2). A video gamer who's familiar with the basic storyline and it's characters. 3). A fan of movies packed with action and/or any martial arts. Unfortunately I'd have to say that \"Street Fighter: The Legend of Chun-Li\" was simply a huge disappointment across the board for those interested.\n\nThis movie is based on the popular series of fighting games of the same name originally designed by Takashi Nishiyama and Hiroshi Matsumoto which pit fighters spanning from around the globe against one another in a street like style and environment. In August 1987, Capcom debuted their first game of \"Street Fighter\" in what would be a long and successful line. Recently in order to boost the re-launch of the game series with \"Street Fighter IV\" Capcom's decided to do so with a joint venture of \"Street Fighter: The Legend of Chun-Li\" a second live-action film adaptation which wasn't as hokey as Jean-Claude Van Damme's \"Street Fighter\" from back in 1994.\n\n\"Street Fighter: The Legend of Chun-Li\" revolves around one of the fans favorite character's of the same name (Chun-Li) played well by the young, fresh faced Kristin Kreuk in her pursuit to stop and right the wrongs of the villainous (Bison/Vega(Japan)) portrayed surprisingly well by Neal McDonough. Unlike 1994's \"Street Fighter\" which managed to squeeze in at the time all of the game characters; this time around both (Director) Andrzej Bartkowiak and (Writer) Justin Marks decided to focus mainly on a handful of characters while developing Chun-Li for the most part. One other notable mention is (Gen, Chun-Li's mentor) played by Robin Shou (the veteran actor of video game to movie adaptations genre like Mortal Kombat), showed me that he's still very much relevant in the acting community and makes you wonder why he's not seen more often on the big screen.\n\nAs for the disappointing factors of \"Street Fighter: The Legend of Chun-Li\" revolved mainly around the major draw/concept to this film which was the fighting: 1). The epic battles of this movie were extremely short. 2). Nothing really stood out during or after any of the fights (for example: no real memorable move or moment). In fact the characters key/signature moves were hardly touched on. 3). Speaking of disappointment; why did Nutjaporn 'Bow' Swasdiprom (Casting) cast Taboo from \"Black Eyed Peas\" fame as (Vega/Balrog(Japan)). Instead of the menacing cutthroat image established from the franchise for this character, I simply started to laugh at how they made him look soft as hell and very laughable. 4). My one last issue with this movie was with (Charlie Nash) played by Chris Klein from \"American Pie\" fame. Prior to watching this movie I already had my reservations about him being in this movie despite the fact that I normally do like him as an actor but this simply wasn't his role. He didn't look the part and much like with Taboo I ended up laughing at the screen more often than not (though I must admit that I'm not entirely sure if it was Chris Klein's acting that I had a problem with or was it more so with the lines and role he was presented with by (Writer) Justin Marks).\n\nIn conclusion though I can appreciate the new take on the \"Street Fighter\" franchise and how they wanted to focus on someone else other than the usual Ryu and/or Ken, the movie itself fell short on signature moves, action and most importantly fights. Had this been called anything else, gone straight to DVD or had it been a made for TV movie then it would've been OK but for the simple facts that it had a much larger budget, several character actors, publicity/hype and worst off... the \"Street Fighter\" title attached; left me fairly disappointed and would suggest that you wait until you rent it or until it makes its way onto cable TV. I hope this post was of some help and use. Enjoy."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "eeveeespionfan2",
        "review_rating": "1",
        "review_title": "Its just not good",
        "review_detailed_main": "Honestly this movie goes down the same path as DragonBall Evolution while being a street fighter movie, it follows its own stupid story, M.Bison wasn't a leader of a drug ring or whatever they said he was and to be honest, i don't like the actor portraying Bison, also what the heck was wrong with Vega? everything was wrong with Vega.... and not to mention... NO RYU? yeah there is no Ryu, no Ken, heck there isn't even a Dan... Im not even going to mention the fact that Chun Li looks white, also where is Akuma, Blanka, or even any of the other Street Fighter characters? in conclusion, stop...just stop it and don't make another bad movie based off a video game... Im looking at you Hit-man:Agent 47"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "homedepo06",
        "review_rating": "10",
        "review_title": "Real life review.",
        "review_detailed_main": "I've seen many reviews on movies and i just half to say. I'am Very disappointed!!! Not on the movie but on peoples judgment of the movie Face it this world lives in the pass, saying its not original then all I half to say is F**k you Street fighter, i didn't care for, but ever since i've seen this new movie I'am amazed on how much better it will become in our generation And I will be proud to see A STREET FIGHTER 2 movie.\n\nThis new movie has better production than the Original Street fighter (sorry to the people who made the first movie) but this movie has a better cast and better production. So really stop complaining people its the new age, live in it or leave it alone."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "rockerbanger",
        "review_rating": "6",
        "review_title": "mindless fun for street fighter fans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "tylerrosin",
        "review_rating": "2",
        "review_title": "Stay far away from this dumpster fire.",
        "review_detailed_main": "This is such a awful movie and deserves all the hate it gets. I'm really not sure what they were thinking when they made this. Everything from the casting to the horrible fights scenes and the complete lack of anything related to Street Fighter makes this movie a mess. While the original movie was awful to at least it was fun to watch. Pass on this one."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Scott_Albinism_Vision",
        "review_rating": "2",
        "review_title": "Bad Treatment of 3 Women",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "White Americans Saving Poor Thais",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "latinways22",
        "review_rating": "1",
        "review_title": "Put it this way..... Don't even see IT",
        "review_detailed_main": "Don't see this movie......It's worse than power rangers!!! X / You would think that it would better than the first one. Wrong !! Much worse than the first one! The characters are not even Street Fighter material!! And I mean get the Power Rangers Director in there and help this director out! he needs medical attention! You could just see everything all fake and so on. Chun-Li not even Asian! and the fireball was all cheesy !! like the whole CHEESY MOVIE! I mean i could just tear the movie curtains for all I care just to bare watch the frustration and anxiety that rushes to your soul when you see the most Horrible F rated movie in all time !!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "lycanent",
        "review_rating": "1",
        "review_title": "A review to butcher the movie that butchered an amazing video game.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "jamesedwards9",
        "review_rating": "1",
        "review_title": "Terrible...",
        "review_detailed_main": "After expecting a half-decent kung-fu/action film, I was treated to this abysmal film. The kung-fu action itself wasn't as bad as the film, although many elements didn't quite work, and there were enough 'cheesy' moments to detract from what could have been o.k. scenes.\n\nThe plot seemed non-existent, with clear 'holes' in the script, and as plenty of mistakes in the film (the fact Chun-Li seemed to be able to converse in Mandarin to Thai people (perhaps that was just what I derived?) was just one of them).\n\nAdded to the poor acting, in which I highlight Chris Klein's attempt at being a tough, streetwise Fed (perhaps sticking to soppy love stricken characters is a good idea for the guy), the film left a lot wanting."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "polexia_rogue",
        "review_rating": "4",
        "review_title": "Toe the line",
        "review_detailed_main": "This movie was over 10 years in the making. For the 10+ years since the original fans expected this movie to be every thing that the original was not. We now know; be carefull what you wish for.\n\nThis version wanted to be taken seriously as a action film. They came up with a more developed story of an innocent girl who learned to follow her heart to become something legendary. And a bad guy who was left alone in as a orphaned baby; growing up to be a corporate psycho.\n\nBUT gone are the colorful costumes and carefree look of the original movie or even the video game. They went too far.\n\nBecause; gone are the original video game characters. From appearance to personality; this was not the movie we waited over 10 years for.\n\nNow all we, the fans can say is ; maybe they'll get is right next time. Maybe the creators can learn to toe the line between 'serious movie' and maintaining the spirit of the original game."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "trakx",
        "review_rating": "3",
        "review_title": "Why is this called Street Fighter?",
        "review_detailed_main": "I was excited when I heard back in 2006 or 2007 that they were making a new Street Fighter movie. I didn't have high hopes for it, but it just COULDN'T have been worse than the one done back in the early 90's, so...\n\nBut later I read an interview by the screenwriter, Justin Marks, where he explained how big of a fan he was, and that while a lot of people who weren't a fan of the video games didn't realize there was a back story for the characters, he did and he wanted to make that a big part of this movie. But in order to do that, he has to give characters ample screen time.\n\nWow, I was sold.\n\nBut the trailers that eventually came out looked mediocre and they changed a lot...\n\nBut it only got worse after I seen the film for myself. Why couldn't they just make a story around a tournament of world class fighters? People already know that they're seeing a fighting movie, so the worst they could do is be criticized for having TOO much fighting and NOT ENOUGH plot. Doing it the other way around - too much story and not enough action - is worse. Well, actually having too much BAD story is worse. And that's what we got."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mattboy61992",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "lu_morning",
        "review_rating": "9",
        "review_title": "Surprisingly Pretty Good!",
        "review_detailed_main": "This was a pretty good movie. Wonderful music, good action scenes, decent story plot as much as you can based on the video game, and hot eye candy Kristin in it too. What more do you people want? What's with all the negative reviews? This movie was picturesque with very nice scenery of cities, landscapes, night scenes. Had a touch of humanistic side and good unfolding and pace. The acting was very good from Kristin and did I mention she was smoking hot? The other cast were decent enough. The only one that I felt was lacking was her father. But with that minor distraction aside, the movie was done fabulously and I enjoyed it very much. I think Kristin brought out a more dramatic aspect to a video game action hero run of the mill action movies. She showed very nice intensity and seriousness to the action fights. She sets a darker, yearning tone throughout the movie and in those moments when she smiles, she lights up the screen. Did I mention she was lovely in the movie? She really was. Neal as Bison, Robin as Gen and Michael as Balrog were fitting supporting cast. Chris and Moon provided a distraction to the main story flow in a good way. I enjoyed it and cast my thumbs up to all you negative reviewers. In fact, I enjoyed the movie much more than most of the recent action movies I have seen,especially this boring Dark Knight. I threw that in because of all the high review for that movie on this site. Anyhow, I'm going on a tangent. It's a good movie, have open mind and enjoy it for what it is, a very nice movie based on a video game. I wasn't disappointed. Oh, Kristin rocks."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "MovieZoo",
        "review_rating": "7",
        "review_title": "Legend of Chun-Li manages to stay out of the gutter",
        "review_detailed_main": "I had never heard of Chun Li until I first saw the announcement that Kristin Kreuk would get the lead. What I eventually learned about The Street Fighter, I liked. A female lead in an action role which could compare somewhat to Batman sounded enticing. I guess another comparison that crossed my mind was Lara Croft.\n\nKristin Kreuk won a great part when she got the role of Chun Li. Being a fair-weather fan of Smallville, I had long hoped she would find a fitting character in the movies. Her time has come. I like her ability to show intensity and weakness. Emotion is her best partner in acting.\n\nAs far as the movie itself goes, I felt somewhat cheated. I was intrigued by the introduction which was narrated nicely by Kristin. Some of the narration that continued was OK, but it soon became an awkward and overbearing distraction. The director obviously did not recognize that crossing the line by over-narration in an action movie could be a definite drawback. He also did not seem to know that, while this is a movie about a fictitious crime/street fighter, you don't have to litter this kind of movie with weak and poorly played characters like Charlie Nash and Detective Maya Sunee. They both seemed to be square pegs being forced into round holes. Chris Klein overplayed his part as though he thought playing an immature detective meant acting like a 12 year old one moment and 17 otherwise. I am sure the 12 and 17 year-olds who played this game were just as disappointed as I was with his portrayal. Meanwhile, Moon Bloodgood seemed to be just as unsure what she was doing with her character. If there is a sequel, these two characters will have to be re-hashed - hopefully by two different actors. And at this point, I have to say, a new director should be considered as well. Andrzej Bartkowiak seemed too loosely connected to the true potential of this movie. Forget about accentuating bumbling law enforcement, focus more on action, mystery and oriental intrigue. Comic relief is good but outright stupidity is unforgivable.\n\nI found the fight scenes fun to watch and special effects were enjoyable although minimal. The story was good ; better than the story tellers.\n\nMichael Clarke Duncan and Neal McDonough both were great. The deadly threat they both portrayed helped to keep the story together by giving the good guys more evil to fight off than they seemed to be able to handle. And Robin Shou was a great trainer and partner for Kistin Kreuk. If Kristin and Robin come back for a sequel, then the sequel stands a chance of being better than the original, even though, I still give Street Fighter: The Legend of Chun-Li a 7/10"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "disdressed12",
        "review_rating": "3",
        "review_title": "was there an actual script?",
        "review_detailed_main": "where to begin with this.well,it wasn't the worst movie i have seen.i did expect more however.pretty lame action here and not very much of it.in my opinion also a lot of miscasting. i don't know What Chris Klein was doing here.i do know his acing was razzie worthy.come to think about it,his character was pretty pointless.Neil McDonough didn't really belong in the movie either.and Michael Clarke Duncan played the same role he always plays.Kristen Kruek is no doubt a talented actress,but i wonder if she read the script(if there was one)or if any body did.the only person who seemed to be decent was Moon Bloodgood and she was in an entirely different movie.for me,Street Fighter:The Legend Of Chun-Li is a 3/10"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "scorpius1486",
        "review_rating": "2",
        "review_title": "Plenty Potential, but poorly depicted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "lrdcampbel",
        "review_rating": "1",
        "review_title": "Don't know if I can finish watching it...",
        "review_detailed_main": "I'm almost thirty minutes into this movie, and I don't know if I can finish it...\n\nWow... Nash is bad. My rating of this movie would probably go up at least two stars if they just deleted all of Klein's scenes.. and I've only seen two so far.\n\nHorrible acting, accents that come and go or don't exist at all... changing ethnicities of characters... horrible dialogue that you know was intended to be profound.\n\nYeah... I don't think I can finish this one... and I've sat through a lot of crap movies."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "JungleBunnyBastard",
        "review_rating": "1",
        "review_title": "Horrible, boring action movie.",
        "review_detailed_main": "Dude, I can't even begin to describe how awful this movie is. The inconsistent and dull story, ridiculous action scenes, terrible acting, horrid dialog, just...everything.\n\nI don't even want to waste my time writing about this crap. The only thing I can really say is to stay as far away from this as you possibly can. If you have a friend who says: \"Hey, let's watch this just for fun,\" firmly tell him \"NO\" like he just offered to jerk you off with barbed wire. Of course, that would probably be much more enjoyable than Street Fighter.\n\nBottom line: this boring little turd of a film will make you want to kill yourself for spending money on it."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mental_override",
        "review_rating": "2",
        "review_title": "No don't rape my eyes",
        "review_detailed_main": "After being a fond follower of the Capcome series since before I can remember and as Chun-Li was one of all time fave characters I had to give this a watch. Firstly this has nothing to do with Street fighter apart from the name. Its a load of rubbish, Chun Li was the daughter of a police officer who Bison killed in her youth, for this she swore revenge, not some teaching business man. Gen was an old man who taught Chun-Li her way not a late 20;s early 30's rouge assassin. Balrog was a boxer but every time he gets into a confrontation is when hes holding a gun, the only thing I saw him hit was a punch bag. Bison, well Bisons's Bison Neal McDonough was the only person who played his character even slightly convincingly. There were no other Street Fighter characters which surprised me as Ryu and Ken trained with Gen in the games and even they don't make an appearance. Chris Klien or Nash as hes known, played the worst part of his career, his acting was stale and transparent, there was no enthusiasm, it sounded as if there was a kindergärtner reading from the script, reading everything monotone All that aside, if you've never played the games and only heard of Street Fighter because of this movie your still not missing out, the plot is weak, the acting is weaker and this lead to what seemed to be the slowest hour and a half of my life. Avoid like the plague"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "nvillesanti",
        "review_rating": "1",
        "review_title": "This movie makes Street Fighter 1994 Oscar worthy!",
        "review_detailed_main": "Talk about one of the most unpleasant, most disappointing moments of my life. Street Fighter: the Legend of Chun-Li is perhaps the worst movie ever to be put on celluloid. What I don't seem to comprehend is how 20th Century Fox gave the green light for this movie to be released? Is management at Fox blind, deaf and stupid?\n\nOkay let me begin with the positive\n\nPositive \u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\n\nNegative\n\n1. Chun-Li, supposed to be an Asian character. In this movie she is not.\n\n2. Bison's evil plot is to take over a residential area so he can build a rich people's resort, now that's evil!\n\n3. Vega is Asian. Yes, the claw, masked ninja menace is played by an Asian actor. We all know that Vega's character is from Spain, hello!!!\n\n4. There's not street fighting, seriously.\n\n5. The acting is below terrible.\n\nOkay, the list goes on and on. This film make Street Fighter (1994) look like a masterpiece. If you really hate someone and you want to play a prank on them, tell them to see Street Fighter: The Legend of Chun-Li. Believe me, they will never forgive you."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "thenexusone",
        "review_rating": "1",
        "review_title": "Almost thought this was an Ewe Boll Film...",
        "review_detailed_main": "So horrible. Horrible writing, direction, etc. Don't buy in the $5 bin at Wal-mart. Wait till the homeless guy trades this to you for a cigarette. Ewe Boll would have been simply proud of this film. Since this was a tad better than anything he has ever accomplished. Sad part is, Capcom lost a butt load of cash on another film. When you're praying Jean-Claude VanDamme will appear and save the film, you know something is wrong. It reminds me of Star Wars Ep. 1-3, you're watching great actors and actresses perform horribly due to terrible writing and direction. Pay NO ONE TO SEE THIS FILM!!! Use it as torture, I know I will."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "normanbeasleyii",
        "review_rating": "1",
        "review_title": "whoever liked this movie",
        "review_detailed_main": "to all the people that seen this movie and liked it... damn i hope you were doing something with your man or women in that matter and weren't paying attention...anyone else see it is horrible that see kills BISON?? let alone hurts him.i its freaking embarrassing to see all the things that went wrong GEN doesn't look like him... balrog and bison charlie all this was bad i'm done ready to attack someone over it I wish and hope no one else sees this movie movies that are suppose to help other know more about the games there suppose to portray are not doing it leaving others confused and the people that love the game or book they took from and killed it..."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "KKWcom",
        "review_rating": "10",
        "review_title": "If you're expecting The Dark Knight or Slumdog Millionaire, you're out of luck! This is straight up a popcorn flick!",
        "review_detailed_main": "Before I continue...I have a confession to make... back in May of last year I got my hands on the script to this film and yes I did read it. Because of that, I have to admit it hindered the film for me in a lot ways.\n\nThere was just so much in the script that I wish was in the film that wasn't! Overall, the script just read better than the film... Also I spent a lot of time comparing the film to the script... this is why I can't read books that are made into films before the film releases! The text is always better! To make this easier for myself and for you guys, since I really don't want to get into too much details, since I don't want to spoil the film TOO much, I'm just going to make a pro and con list for you all! Pros: - Kristin Kreuk, she was great in this film! and no it's not just my blind bias... REALLY! PROMISE! Honestly, she did a awesome job with the fighting and the acting. One thing I have to agree with IGN, Kristin did NOT make herself look bad in this film at any point! - Neal McDonough, also great! His Bison was badass! Also IGN can go somewhere with that review of theirs. The man didn't even have an Irish accent in the film! For them to mistake the accent Bison had as an Irish accent, makes me question them a lot! - Michael Clarke Duncan, for what he did in the film, I did enjoy his scenes.\n\n\n\n\n\n\n\n\n\nCons: - The Nash and Maya duo... I didn't enjoy neither of them at any point. Nash was overly corny and Maya just seemed to want to get into Nash's pants throughout the film. Funny thing is, when reading the script, I didn't care for Nash either.\n\n\n\nFinal thoughts: - My theater was pretty full, I was surprised by this due to the lack of promotions this film has gotten here in the states and because there was another theater about a mile away that also had a midnight showing."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "master__sonic",
        "review_rating": "6",
        "review_title": "Somewhat misses the mark",
        "review_detailed_main": "We now have Street Fighter: The Legend of Chun Li, a story about the First Lady of Fighting Games herself. Yes, Chun Li was featured in the previous movie (played less than adequately by Ming Na), but she was only a supporting character in that flick, and aside from knocking a few heads and spewing some lame dialogue, she didn't have much to do. So it's nice to see her finally in the spotlight, portrayed by an actress who actually bothers to put some effort into her performance: Kristin Kreuk.\n\nThe previous Street Fighter film pretty much failed to give its characters any good development or reason to show any real emotions, making it rather hard to connect with them. This new film at least tries, and even succeeds in some places; when Chun Li sheds tears in this movie, we know precisely why, and we understand her sorrow. She is endeared far more to us this time around. It would not be spoiling anything to say this movie is much better than its predecessor. But is it really a good movie? Well...\n\nNow, obviously director Andrzej Bartkowiak and screenwriter Justin Marks had a daunting task before them. They not only had to please Street Fighter and Chun Li fans around the world, but somehow try to make a good movie in the process. And, of course, you can't tell a story about street fighters without the proper pacing. Pacing, in fact, is where the movie's first failure falls into our laps, as it's tragically rushed in all the wrong places. Events that should be treated delicately and given sufficient screen time to allow us to appreciate their significance are whizzed right by us, drastically reducing their impact. Instead of thoughtful remarks, we're given more passing comments on things that are supposed to tell us more about the characters we're watching. And, aside from Chun Li, Bison and, to a lesser degree, Chun Li's father and Gen, none of the characters receives much by the way of development, thus causing this film to fail in the same general area the previous one did. And Interpol Officer Charile Nash (yes, the same Charlie Nash whom Guile was so eager to avenge in the games) is on the scene as well; he's determined to bring Bison down. If only we learned why. Actor Chris Klein and actress Moon Bloodgood (who plays his partner Maya) aren't given much to do, and what they are given to do isn't very engaging or exciting. Much of their contributions to the story are tossed out as quickly as they're flung in, leaving us very little time to appreciate any of it. And Nash's one-liners, which are, of course, meant to be witty, are not really that witty. Or all that funny.\n\nOn the whole, the movie doesn't quite work. It has some good ideas and an interesting story, but it really doesn't handle them properly. For every strong moment the film has, there is a weak one to bring things down again, and of course there's an open ending, though if they actually make a sequel to this I'll be amazed. I likely won't be the first in line to see it, though. I probably won't see the movie again, either... well, not in the theater, anyway. I may buy the soundtrack, however; the music wasn't half bad. If you like solid electronic dances tunes, the soundtrack may be worth your while. The movie, on the other hand, won't really entertain general audiences, and I imagine fans of the games will be pretty divided on it.\n\nOh, and they mispronounced Ryu's name. AGAIN.\n\nFinal score: 6/10. Nice try, but try harder next time, guys."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "PopcornLovesMovie",
        "review_rating": "1",
        "review_title": "Not True to The Street Fighter Series, Predictable and Awkward.",
        "review_detailed_main": "Only one word to describe this movie: awful.\n\nI have seen movies that failed in the same way this movie does. And there are many reasons for this. First, it is very awkward. Scenes doesn't always move smoothly. I can forgive this one because it only happen sometimes. Second, predictability. The scenes, the dialogues, it's all very cheesy and predictable. I also can forgive this one because, hey, what do you expect from a Street Figter movie. Third, lack of logic. In this movie we will find highly illogical decisions that will boggle our mind. I find this part especially irritating when watching this movie. They don't even bother to offer a decent explanation, everything is 'just because'. Fourth, it doesn't stay true to the game. Lets face it, we want to see awesome moves from the game. Instead, this movie offer very little of that and a lot of generic fighting & shooting actions. Fifth, it's about Chun Li, a fairly minor character in the Street Fighter series world whom not many care about.\n\nOverall, it's just not a very accurate depictions of the characters that we loved in the Street Fighter series."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "owenomac",
        "review_rating": "1",
        "review_title": "Big Let Down !!WARNING SPOILERS!!!",
        "review_detailed_main": "Typical, a game made into a movie, why do they always end up like this, to cut a long story short, this film sucks, the writer sucks and so does the director, i hope the critics lay into them hardcore, the first movie, with JCVD was actually more entertaining and true to the game, this is nothing but a shot at trying to make bank off a popular franchise yet again.\n\nPathetic\n\nSPOILER WARNING FROM HERE! There cannot be a true sequel, as both balrog and Bison are killed Did they even do there research about street fighter?!, bison killed by chun Li, what the hell, give me some bank, ill make a better movie"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "2",
        "review_title": "Deadly dull sequel that'll make everyone take back what they said about the original",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nThis rather belated sequel to the 1994 Jean Claude Van Damme movie that was universally panned but went to theatres has also arrived at a time when the game's popularity must surely have waned and anyone would have thought Capcom would have gone bust. Cinematographer turned director Andrezj Bartkowiak applies his trademark hip-hop/martial arts fusion to the familiar tale of a young woman, the titular Chun-Li (Kristin Kreuk) seeking revenge for the loss of her father at the hands of criminal mastermind Bison (Neal McDonaugh) while being guided in the ways of the warrior by wise master Gen (Robin Shou.) But it's amazing how lifeless and limp the whole thing feels, dull and unexciting, trying to be more serious and full of itself than it's more joyfully camp predecessor. Most notable is Michael Clarke Duncan in a supporting role as the bad guy's henchman, making you wonder how he went from being nominated for a Best Actor Oscar in The Green Mile to something as down market as this. Leaves you wondering what anyone was trying to accomplish with it. *"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "planktonrules",
        "review_rating": "4",
        "review_title": "It's based on a videogame....need I say more?!",
        "review_detailed_main": "The fact that \"Street Fighter: The Legend of Chun-Li\" is on the infamous Bottom 100 List on IMDB is not at all surprising. After all, films based on videogames often are terrible and several other films based on videogames are on the list--including \"Super Mario Brothers\", \"BloodyRayne\" and \"Street Fighter\"....yes, the first installment in this franchise. However, this sequel has none of the folks from the previous film and it has a very different look and style from \"Street Fighter\". It currently is #79 on the list and \"Street Fighter\" is #80. And, incidentally it earned back far less than the cost of the film.\n\n\"Street Fighter\" was a very cartoony looking film....with a ridiculous villain who seemed right off a kid's TV show. In contrast, \"Street Fighter: The Legend of Chun-Li\" looked much, much better and was much more cinematic. It also used a lot of modern wire fu and camera tricks....so the filmmakers looked far less inept than in the first film. But, one thing the first one wasn't was dull...and often this follow-up film is dreadfully dull. Too talky and with to many flashbacks and expositions. When the actually DID have fights, the film looked pretty good...and very acrobatic. Of course, with a dull story, these scenes cannot make up for all that...but they help a bit.\n\nThe story, if you really care, is about a young girl who sees her father abducted by some baddies and you know that sooner or later she'll have a day of reckoning with the blond guy. In between, there's a decent amount of boredom and mumbo jumbo involving her being trained to take him on in the final boss battle. My problem was I just didn't care about any of this and had a hard time focusing on the story, such as it was.\n\nOverall, a dull and oppressively dark story but not a completely terrible film. I am sure that it lost so much money because fans were disappointed...but disappointment is not exactly the same as this being a Bottom 100 film. I'd give it a 4...which is bad but not horrible...and there are thousands of more horrible films than this one.\n\nBy the way, again and again, I couldn't help but think....why didn't Chun-Li have a gun?! So many times it would have saved her from all these beatdowns! And, martial arts can't stop bullets."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Maziun",
        "review_rating": "1",
        "review_title": "God-awful movie",
        "review_detailed_main": "This terrible movie makes Van Damme movie look like a masterpiece in comparison. The movie makers were promising a more mature picture that will change the fate of movies based on computer games forever. Promises , promises\u0085 The movie seems to follow \"Batman begins\". The story about Chun Li reminds me quite a lot of Wayne's story – similar motivation , traveling around the world , finding a teacher from secret society , becoming an urban legend. The inspiration is good , but it's badly made.\n\nThe movie wants to be realistic , yet the fights defy the laws of gravity and there are magical powers too. The Dark knight trilogy had more or less far fetched science fiction gadgets , but bringing a magic into movie is a completely different thing. I mean seriously it just looks stupid and laughable when other characters seem to treat it as something natural . Either the movie makers should make a movie in fantastical world (like Van Damme's movie) where magic would be natural or set the movie in real world and don't use it . You can't have both the realistic world and magic . Same goes for the over the top fights . The lack of gravity in \"Matrix\" makes sense , here it doesn't.\n\nThe acting is awful . The only good actor here is Michael Clarke Duncan (RIP) , but even he is limited by terrible dialogue lines. It's sad to see him in another crappy movie. I guess it was really hard for him to find a good role worthy his talent considering his physical appearance. Kristin Kreuk who plays the main role is pretty and actually OK . She puts a heart in her performance , but she can't save this big mess. Other actors and actresses should never do anything related to movie making.\n\nI doubt that fans of computer game will be satisfied with this movie as adaptation . With the exception of Chun Li other characters who appear here barely resemble the characters from the game. Especially Vega who was supposed to be bad ass , yet ends pathetic. I understand the need for changes , but in the end Van Damme's movie has much more cheesy charm and reminds the game better. It also doesn't take itself too seriously like \"Chun Li movie\" .\n\nBad acting , dialogue , badly written screenplay , many scenes who were supposed to be awesome are laughable (the seduction of Bison's assistant , soul into child , escape from torture and many more) , dumb fights , weak special effects. Jesus ,seriously better watch Van Damme's movie . At least is unpretentious and funny.\n\nI give it 1/10."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dontspamme-11",
        "review_rating": "",
        "review_title": "Bad. So very bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "scronan2000",
        "review_rating": "1",
        "review_title": "The Worst Mortal Kombat Movie EVER!!!!",
        "review_detailed_main": "Yes, you heard it right, Mortal Kombat! I'll explain this more later, but first...*SCREAM*...*CRY*...*SIGH*....\n\nLet me start by saying that I am a hardcore, old school SF player, and have been playing the game for almost 20 years, been to tournaments, etc, etc. That being said...I will not nitpick about this sad excuse for a movies' mistakes in the SF universe. We all remember the last one. It was bad. We hoped this would be better, but we knew it wasn't going to be great. When your expectations are already very low and you are still disgusted beyond words, then you know you've got a real turd on your hands. I will let other SF players point out the flaws, which are far too numerous for me to mention. Suffice to say, if I may steal a line from Alex Trebek of SNL Celebrity Jeopardy - \"I'm speechless!\". :(\n\nTo sum things up, all I can say to the actors, producers and writers is - FOR SHAME! I know what it's like to do something detestable for money (like doing phone tech support, or maybe acting in a crappy movie)...but have you no honor? And what's more - how on earth did you expect this unholy abomination to actually make a profit? Alienating the SF fans is one thing...but making a movie this bad seems a total and utter waste of time and money. This movie isn't just bad...it's Highlander 5 \"The Source\" bad! I know, I know, that's a very low blow...but I feel that IT IS that bad...a movie that makes you just sit there and say \"WHY? OH WHY??? HOW COULD YOU SINK SO LOW?!?!?\".\n\nThis is the first, and probably last review I will ever write for a movie, so let me point out a few things that reflect my above sentiments:\n\nOn the Streets?\n\nChun Li's \"soul searching\" that she does on the streets of Thailand. Now then, as soon as I saw a beautiful, yet utterly broke, lost and homeless young Asian woman trying to find herself in Thailand of all places...I immediately thought of only one thing happening to her...and for decency's sake, I will not list it here! Unforgivable...\n\nSF IV?\n\nWhen the movie started...the first thing I noticed was that the SF logo was taken right from SF IV. I was excited thinking...hey, they're going to use this flick to promote the new game...right? WRONG! If it wasn't for the title, quite honestly, I wouldn't have any idea what game this movie was based on, and well, I still don't.\n\nIs this Mortal Kombat?\n\nWhen the female cop character was introduced...my first thought was...hmm, she sure doesn't look like any woman from SF...but hey, give her a skimpy outfit and a pair of sais or fans, and she'd be a dead wringer for Kitana or Mileena from MK II. And then when Gen came on the screen, I kept thinking...why can't I get MK out of my head? Then my buddy pointed out \"hey, he played Liu Kang in the MK movie!\"...so there you have it...the worst MK movie ever made!\n\nPlease Stop with the DANCING!\n\nLet me start by saying that I have nothing against dancing. I am a dancer! I used to hit the Salsa clubs and go Ballroom dancing 5 nights a week. But what the *#$* is up with so many movies putting in these stupid dance scenes? I blame Dancing with the Stars for most of this bile...come on folks this is supposed to be STREET FIGHTER, not DANCE DANCE REVOLUTION! Even with the kinda but not really hot girl on girl tone to the dance...it was still pointless...worthless...and in very, very poor taste.\n\nIn closing, if you are a fan of SF, AVOID THIS MOVIE LIKE THE PLAGUE! And for everyone else, AVOID IT LIKE THE PLAGUE TOO! The bar has been lowered so very low now, I don't think it is possible to sink even lower (well it probably is, as this movie has proved). And, this movie actually gave me motion sickness...but I'm not sure if it was from the whipping camera or my level of extreme disgust...ugh...:(\n\nBut I will add one positive note - the Tai Chi scene at the start...nicely, and beautifully done! As a long time student of Chinese martial arts...I was impressed by that...yes, those were real moves...someone did their homework for that scene...if only...if only the rest of the movie had followed...\n\nIf only...."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "kimberlymhn",
        "review_rating": "3",
        "review_title": "What! a white anorexic Chun-Li???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Sparkie_id",
        "review_rating": "3",
        "review_title": "Ack! But it has its moments.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "rongagain",
        "review_rating": "8",
        "review_title": "It was great for a movie, lemme tell you about the stuff i liked (no spoilers)",
        "review_detailed_main": "The movie itself was great but i have never played the game so i cannot say that it was even remotely close. I can say that the action was great and Kristen Keurk should be in more action movies. The plot line was slightly saddening but has to have been a very down to earth kinda girl. Of course you have to subtract the flips and all the flying and fighting. She is someone who you cannot relate to but just is totally awesome!!!!! Definitely see this movie right away. You can expect her to be her own person. I mean different from the game. Your eyes will never leave the screen. That is if you like a movie with a strong female role model, lots of action, and an awesome aura blast scene. You all know. I am talking about like in Dragonball Z."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "acutaboveentertainment",
        "review_rating": "6",
        "review_title": "I can't say I agree with the other reviews.",
        "review_detailed_main": "I can't say I agree with the other reviews. This isn't all that bad. Sure, it's low budget and mostly unknown actors. But the known actors are decent enough and the action is well filmed and quite credible. We don't watch these movies for the dialogue or acting. For what I tuned in for, I got my times worth."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "DICK STEEL",
        "review_rating": "4",
        "review_title": "A Nutshell Review: Street Fighter: The Legend of Chun-Li",
        "review_detailed_main": "Made in collaboration with Capcom, I think someone probably thought enough time had past and the past stinker forgotten, and to follow suit in a franchise milking programme like what Marvel and DC had embarked upon, a reboot is in order and the current buzzword. So just like how the characters in Street Fighter hail from all over the world, the production too has input from everywhere, like actors in the West and in the East, being filmed in Thailand and having Indian producing input as well. It's like a melting pot of cultures collaborating in breathing life into a possible franchise should this film prove to be successful. But chances are I suspect it'll at most hit the direct to DVD route after this.\n\nIt's a little surprising that the filmmakers opted for Chun Li instead of the signature character of Ryu. Maybe they have faith in Kristin Kreuk, better known for her Lana Lang role in Smallville, to pull in the fanboys, or once fanboys, of the video game. But as it turns out, while she may be a looker, and her personal grounding in gymnastics and martial arts do help, she's ultimately let down by a weak plot (ok, so that's expected) and some very weak supporting characters. On the side of the good, you have Cheng Pei Pei in a one scene cameo, who does nothing but to tell her to go to Bangkok and live like a pauper, useless cops with Chris Klein as an Interpol cop Charlie Nash who's basically cardboard and Moon Bloodgood (love that name) as a Thai policewoman Maya who just preens and purrs, and Robin Shou as Gen, a mystical David-Carradine-Kung-Fu knock off with long grey hair.\n\nAs if the villains were good enough, being nothing but bland and uninteresting. I thought it was a good spin on things to have Neal McDonough's Bison being a corporate raider with his Shadaloo organization, aided by lesbian femme fatale Cantana (Hong Kong's Josie Ho), a very underused Vega (Black Eyed Peas' Taboo) and Michael Clarke Duncan's Balrog, who's more like a relegated Kingpin of Crime from Daredevil, now playing sidekick. Like Robin Shou, who also once had leading role status, I feel that this film was like a collection of would be has- beens waiting for another chance at the big league.\n\nIf there's any cause for celebration, then it might be Edmund Chen's role as Chun Li's dad Heung. From Ivan Heng to Adrian Pang to Fann Wong and to the coup of seeing Chin Han having possibly the role of his life in The Dark Knight, Edmund Chen looks set to follow in the latter's footsteps, but only up until some stuntmen unceremoniously took over almost all his fighting scenes, even those that require him to perform some non-life threatening qi- gong stances. The body double is really too obvious and one can tell it isn't him at all. So shave off some 50% of his \"appearance\" from the film.\n\nStreet Fighter: The Legend of Chun Li is a straight forward film without much depth in its story, and it's relatively lower production budget translates to many of the jazzy special prowess in the game being considerably toned down. Perhaps director Andrzej Bartkowiak's intention was to have it more rooted to reality, but therein lies the danger see, because this film has tremendous parallels with that of another super-powered movie called Elektra. Both have recognizable female actresses in the lead role, and they share a plot involving secret organizations, mystical healing, an experienced teacher to learn the ropes from, and plenty of hokey martial arts. Even the training sequence looks super summarized, uninspiring and filled with unremarkable, clichéd dialogue.\n\nHaving said that it was more rooted in reality, that doesn't mean there weren't fun opportunities for some game-like signature moments. I had enjoyed how Bison power packs his punches and kicks, just like in the game but without any glowing-blue glove to visually enhance it (just throbbing sound effects). Chun Li doesn't appear in her iconic qipao, but makes up for it in one scene where she has to execute her Tenshokyaku, the spinning bird kick where she inverts herself and spins her legs like helicopter blades, and dons her hair \"ox horns\" style. Other than that, her costume's pretty much well suited for the heat and humidity of the Bangkok temperature, as well as the usual black ensemble made hip by X- Men.\n\nIt had tried to be more cerebral in crafting a father-daughter story between Chun Li and dad Heung, Chun Li and her master Gen, and that between M.Bison and her daughter Rose. But anything in depth has no place in the film as it opted to be more fleet-footed that even a three year old could follow. It's an origin story, and depending on which camp you're on, you may or may not agree with some of the tweaks made here to accommodate the film version of things. Despite being called \"Street Fighter\", the fights here are nothing too fantastic or memorable, and looks comfortably in place with many B-grade action movies out there, with the occasional lapsing into the crutch of having the fight scenes edited in double quick time.\n\nI suppose the filmmakers had tried their best, but there's a lot of room to try harder and come up with a better product. The lead to the sequel involves a martial arts tournament, but please don't go down the same road as Mortal Kombat and the likes. Come up with a proper and stronger story, and perhaps, we could get a chance to see a franchise being developed, straight to the cinema or DVD market. I'm willing to give it a shot, even with or without Kristin Kreuk returning."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "danX71",
        "review_rating": "1",
        "review_title": "this is anything but a street fighter movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "darkmax",
        "review_rating": "5",
        "review_title": "Plenty can be done and should have been, but no.",
        "review_detailed_main": "1. KK is a fine actress on her own, but this role is just not her on both ethnicity and her capacity.\n\n2. The story is a workable and could have been a lot more than it is. Everything just did not add up properly.\n\n3. Script should have been re-written. Some dialogues were just.....\n\n4. The movie would have gained one or two points more if they kept the pace up, and it should have been such.\n\n5. Ryu is pronounced rrr-you, not ra-you. A mistake carried over from that joke of the original movie.\n\n6. I get that Bangkok is a messy and seedy place, but why there? 7. Michael Duncan is a good actor but this role just isn't him, makes him look almost retarded. Sorry Mr Duncan.\n\n8. Why is there a need for Robin Shou to be in this movie? Can't they ask someone else? 9. Yuen Woo Ping should have been attached as martial arts choreographer, or is he too expensive now? 10. Why are they, kk, Robin Shou and Edmund Chen, all doing Tai Chi? It is a non-aggressive martial art form....\n\nAll in all, the role of Chun Li is a major mis-cast. KK is a good actress but she looks and feels nothing like a Chinese."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mkovanen",
        "review_rating": "1",
        "review_title": "Another bad fighting game movie",
        "review_detailed_main": "I don't understand why someone think fighting games make good movies. In fighting games you don't need any plot. You play them because of playability. Story can be anything as long as game is fun to play. Only entertaining fighting game movie I have seen is first Mortal Combat. That worked because fighting was the main thing and plot was secondary.\n\nThis movie has all things that make fighting game movies bad. Fight scenes were bad. They felt like cut and paste fighting. Actors didn't know how to fight and action was made cutting everything to small pieces. If you have seen Hong Kong fighting scenes with talented actors this just look awful.\n\nI haven't played the game. I don't know the characters. This movie didn't bother to tell me anything interesting about characters. All the time went with nonsense dialog and Asian bullshido wisdom. Some characters had some superpowers but I didn't get why.\n\nThere were Finnish crime boss who spoke Finnish. That was nice but I don't give another point for that. Movie is total waste of time. Story is nonsense. Dialog is nonsense. Fight scenes awful. From time to time this looks good but you can watch god movies that look good. It might be hard to find any bad movie entertainment from this since everything is just nonsense and uninteresting."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ennieday09",
        "review_rating": "2",
        "review_title": "As good as the first Street Fighter movie.....enough said",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dermotmurphy1",
        "review_rating": "2",
        "review_title": "Its worst than the original, ......... i cant believe i just said that !!!",
        "review_detailed_main": "Awful, bad acting, bad storyline, bad fight choreography and Chris Kline looks like he's trying to pop a turd every scene he's in ! The film just does not work on any level and the storyline feels if it has been lifted straight out of an abandoned Manga effort,even the lesbian scene falls flat on its face. Don't even bother with this one guys i'm just happy i seen it for free !!\n\nPs. - check out the original animated movie or Alpha movies if u looking for decent SF lore looks like all hope is gone for the big screen.\n\nThanks for reading Laters"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "clarkedwardobrien",
        "review_rating": "1",
        "review_title": "Remember when movies wanted to draw you in?",
        "review_detailed_main": "I think some directors these days lack the imagination to create a fantastical world that draws people in. This \"Its got to be realistic\" view of movies has been created so they don't have to put any depth into a setting that people aren't used to. I am a fan of the Street Fighter series so I know a lot of the stuff in the games wouldn't work in real life, but if the settings and story are good enough I'll happily suspend any disbelief and invest myself for a few hours entertainment.\n\nLets face it a guy who wears a gaudy military outfit as his fighting garb isn't any more bizarre then that whole pregnant sacrifice madness that went on in this attempt at a movie.\n\nAt the end of the day a real movie about street fighting would involve two or more drunk idiots trying to smash broken pint glasses into each others faces. If this franchise ever gets another chance go big and colourful just cos somethings a bit out over the top doesn't mean it cant have a soul It just takes some imagination and effort."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "donschmiddy",
        "review_rating": "1",
        "review_title": "You want someone to go insane? force him to watch this shitty movie 24/7",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "laluly_55",
        "review_rating": "10",
        "review_title": "Kristin as Chun Li is awesome!",
        "review_detailed_main": "I love this movie, Kristin did an excellent job in this one.. It was awesome to see Kristin in a whole new world for her, i mean she did some fighting in Smallville, but this is so much different, she grew up and i think that Smallville was good for her.. They respect the game and the characters, is not that different. Michael Clarke Duncan, Chris Klein and Neal McDonough also Great in they characters, i would like to see Michael Clarke Duncan a little more in the movie, doing some more fight scenes but whatever.. Great fight scenes, great effects, great cast.. so.. i like it and for me it worth a couple of dollars, buy some popcorn and enjoy it.."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "country_bunk",
        "review_rating": "6",
        "review_title": "Was better than expected",
        "review_detailed_main": "Everyone was so down on the movie but it wasn't as bad as i thought it would be. Kristen was an awesome Chun-Li. The beginning was too fast paced, and not focused on Chun-Li's emotions as much as they should have. I didn't feel the characters history impacted her enough to drive her as far as she did in the movie because it was too fast paced, but the stunts were believable. The only issue I had with this film was that I wasn't fond of the cops interference, i didn't see the point to them and if they were not there, and more focused on the main character, Chun-Li, it would of been a hell of a lot better. If they only used important parts (with the cops) and excluded their personal lives, it would have been a lot better, those parts were a waste of my time."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "kok_warlock",
        "review_rating": "2",
        "review_title": "Terrible movie, with mostly terrible acting, terribly made characters, just terrible, they should just name it Terrible Gun Fighting",
        "review_detailed_main": "This movie is pretty, well, terrible, but before we describe just how awful, it actually is, to be fair, I thought that Neal McDonough did a pretty decent job as Bison, more props to the actor, than to the character, that it was, much like the rest of the characters, badly written.\n\nKristin Kreuk, I always thought she wasn't a very good actress, but sort of attractive, well, after watching her as Chun-Li, I have to say this girl is a terrible actress and pretty ugly, at least she was in this movie, and I agree with another IMDb user, her trying to be sexy dancing was laughable, lame and whiter than Rod Stewart, the rest of the characters were portrayed as cliché as it gets, such as Det. Sunee, but more cliché than Chris Klein's Nash, there isn't, he is probably competing for worst portrayal with Kreuk, because, he was ridiculous, trying to look bad ass, instead, he looked like a 12yo on drugs.\n\nConclusion: I've seen worst movies, but this is still isn't even worth a free download.\n\n2/10."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mikely115",
        "review_rating": "2",
        "review_title": "Street Fighter: Legend of FAIL!",
        "review_detailed_main": "Is this movie better than the Street Fighter movie with JCVD? Yes and No...Yes because there was better acting and no because it's 2009 and they still can't seem to get it right. You would think they would of learned to make a better Street Fighter movie by now. It really all comes down to storyline and Ryu Story would make the most sense. It's what the games were based on so why make the movie on a different character? It almost makes me think Hollywood is racist cause the first movie was on Guile( who was played by a french guy)...great casting there...and now this street fighter, Chun-Li is played but Kristen Kreuk...While I really didn't have much of problem with Kristen playing Chun-Li, I think they could of found someone more true to Chun-Li's character. They should of started with Ryu's Story without messing it up and then maybe down the line had the story of Chun-Li. This was bad planning on the studio's part. How can they wish for a sequel when this movie's numbers suck. No one wants to watch another butchered Street Fighter Character's movie. They had a good chance to make something great but they failed. As a true fan of Street Fighter this really makes me sad. Stop making me sad Hollywood."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "wotmitinks",
        "review_rating": "1",
        "review_title": "Liked it when it ended.",
        "review_detailed_main": "I really do struggle to think of ANY good points from this laughable film. But bhoy can I think of bad ones: All but Kristin IMO are badly miss-cast from the game; which it partially is based on, seemingly only for attention. It could of been based on 'Streets Of Rage' and been none-the-wiser. Fight Scenes were typically poor given the dire directions this film partakes. Further all of the actual fights involved felt just odd and 'uncool' looking. Chuns unnecessary backflips over rooftops were funny. Dialogue is remarkably cheesy and even folly and awkward at times. It is so poor and offending to me and surely other fans of the game who are still waiting to see a decent Street Fighter movie. This is even worse than that other one apart from the strong hint of more to come involving a \"Street Fighting Tournament with Ryu\". Oh Kristin Kreuk is sooo Hot(suddenly thinking of them fireballs and how they were included as if an afterthought. So bad you will like it..when it ends. DO NOT SEE IT!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "vn_diel",
        "review_rating": "1",
        "review_title": "A Review and History",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "evilpoetry_4",
        "review_rating": "2",
        "review_title": "Pretty disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "AtotehZ",
        "review_rating": "1",
        "review_title": "A new level of low",
        "review_detailed_main": "There is absolutely nothing good about this movie.\n\nThe special effects were awful, i could do better in Adobe After Effects.\n\nThe script was bad, the plot and moral contradicted each other, the lines were corny and made me feel nausea. I truly feel bad for the actors, there were many well-known actors in it and this movie does not do them justice.\n\nI didn't expect much of the movie, but this was so bad that if i hadn't been too lazy to put an another movie on i would've turned it off before the end.\n\nI don't recommend anyone to watch this, even with your expectations turned down to a minimum you will still feel like someone has tried to feed you horse dung."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "oozecaglar",
        "review_rating": "1",
        "review_title": "Total crap.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "chrichtonsworld",
        "review_rating": "1",
        "review_title": "Forget this movie ever being made,better still Ignore it completely!",
        "review_detailed_main": "Why to write a review about a movie I didn't like. Well,simply for the reason to warn people that a movie like this, will be a waste of your precious time. I am not going to rant about plot or the bad adaptation of the video game characters or other elements concerning the Streetfighter universe. That also would be a waste of time. I will try to limit my criticism to a few points that matter. Since this is a movie based on a character based from a fighting game you at least would expect some good action. But for some reason the people responsible for this product couldn't be bothered. Even skilled martial artists like Robin Shou looked bad in this picture. The fighting scenes are edited so poorly that makes it real hard to enjoy them. And this is the second point I want to make. The lack of humor. This movie takes it self too serious. Say what you will about the Jean Claude van Damme version. At least it was funny as hell and a bleeping masterpiece compared to this piece of crap. So do your self a favor and ignore this movie!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "timbo911",
        "review_rating": "10",
        "review_title": "A Crime Lord to Rival The Godfather",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "klchu",
        "review_rating": "7",
        "review_title": "Not so bad",
        "review_detailed_main": "This movie obviously angered a bunch of \"Street Fighter The Game\" fans who all gave the movie a knee-jerk rating of 1. I won't speak to any of the SF mythology but as a stand alone movie \"Chun-Li\" is okay.\n\nIs it awesome? No. But it's no where near a \"1\" just on production quality alone. The story is basic, but that's not why you watch this kind of movie. The stunts and fighting are pretty good. I like the Kristin Kreuk seemed to do most of her own stunts. If she didn't then that's another kudos to the film makers. The music is good, as are the set and costumes.\n\nI also like to see Neal McDonough in pretty much anything he does. Moon Bloodgood was also nice to watch. I wasn't that crazy about Chris Klein or Robin Shou."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "j-pryde",
        "review_rating": "1",
        "review_title": "it even rivals the ill-fated Van Damme movie",
        "review_detailed_main": "In a nutshell - the movie is bad. For example: M.Bison is a Blondie and not even a menacing one - i still wonder who has been hired as the casting director of that crappy movie. I'm talking about Transporter 3 bad. Chris Klein is even more annoying than that red haired chick from T3. From the very first scene you see him you either think he is drunk or in the \"zone\". This movie is not even worth watching on DVD, let alone on basic cable. To give you an idea how awful it is - i rather watch a movie with Paris Hilton.\n\nplot - bad, screenplay - really bad, acting - contender for all Razzie Awards...overall i'd like to give it 0 out of 10 stars. Unless they get John Woo or Tsui Hark behind the camera don't bother producing another Street Fighter movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "drMannevond",
        "review_rating": "1",
        "review_title": "How is it possible?",
        "review_detailed_main": "This \"movie\" is dumb. I mean, really, really, really DUMB! The \"plot\" is so lame I can't even begin to describe it's lameness, the acting sucks like a Volta (especially the cops, God, it still gives me nightmares!), and worst of all - there's hardly any action or fight scenes in the movie at all. The few action scenes that are in there are so bad it's a relief when they're over (usually after 5 seconds), and everything in between is just unbearable to watch. I'd rather be water-boarded than watch this filth again. And one more thing : Justin Marks, if you read this (nothing personal) : STOP WRITING MOVIE SCRIPTS! I swear, if Sony let you ruin Shadow of the Colossus like you did with this movie I will set myself on fire outside your house. Besides, there IS already a king, and his name is Uwe Boll."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Carl42691",
        "review_rating": "2",
        "review_title": "Weak Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "or_yo",
        "review_rating": "1",
        "review_title": "This makes the 1994 title look like an Oscar nominee.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "giddeo",
        "review_rating": "1",
        "review_title": "LOL! The comments on this film are the best part",
        "review_detailed_main": "OK, well the movie goes on and on and on and on about pretty much nothing.\n\nM.Bison's performance was the ONLY thing in this movie worth even glancing at.\n\nThe best way to describe this movie would be to imagine a day time sci-fi or true films movie that seems to never end.\n\nThe guy who played bullrog is normally bang on the money, I'm not sure what happened there.\n\nAnyway reading some of this comments made me laugh quite a bit so that was for me the high light of the whole thing for me. Reading the funny criticisms, there's just so many :D\n\nSo good are the bad reviews for this movie that people are giving it 10 of 10 just so they can get their voice heard on just how bad it is, that's amazing!!\n\nSo yeah read these through, they're worth a chuckle but don't see the movie. Seriously, or fast forward 90% of the movie if you can.\n\nOh and one more thing\n\nNEVER PUT RAPPERS IN MOVIES! EVER! EVEN IN BIT PARTS! PLEASE STOP! THEY CAN'T ACT, ARE YOU BLIND!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "truecrimsondeath",
        "review_rating": "1",
        "review_title": "Blanka",
        "review_detailed_main": "I'm just about to watch this movie. WHERE THE HELL IS BLANKA? I didn't see him in the cast. This movie will suck without him! He's the best character. And why is a white girl playing an Chun Li? Hollywood you've done it again... Stupid bastards think they can just do what ever they want. It's Transformers all over again.\n\nTen lines of text minimum? That's bull$#!%\n\nhead lice pick nose pop zit bleed profusely take an effin shower this has nothing to do with anything this is pissing me off I need to clean my fish tank Soundwave sucks in the new Transformers movie Why do they have to ruin everything from my childhood?\n\nThere. Happy now?"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "MCMAYNERBERRY",
        "review_rating": "2",
        "review_title": "I Can't Hold My Tongue. This Movie's Terrible",
        "review_detailed_main": "Powerful forces are converging on the streets of Bangkok. They are warriors, some of whom possess extraordinary abilities, all of whom are determined to see their side prevail. Some fight for us; the others for unlimited power. Now, they are preparing for the ultimate battle—of terror versus beauty, light versus darkness, and good versus evil.\n\nThe forces of darkness are led by Bison (Neal McDonough), a crime boss of seemingly limitless power, and whose past holds a shocking secret. Bison's syndicate, Shadaloo, is taking over the slums of the Thai capital, a task overseen by Balrog (Michael Clarke Duncan), a massively built enforcer and killer. Also in Bison's employ is the assassin Vega (Taboo, of the group The Black Eyed Peas), a masked talon-wielding warrior, whose weapon is tailor-made for slashing and stabbing attacks. Bison's attache is the beautiful but deadly Cantana (Josie Ho). Street Fighter: The Legend of Chun-Li 2/10\n\nAs Bison instigates a wave of violence in the slum districts, grabbing power and land no matter what the costs to its residents, a team of heroes emerges. Chun-Li (Kristin Kreuk) is a half-Caucasian/half-Asian beauty who gave up a life of privilege to become a street fighter, battling for those who cannot fight for themselves. Her kung fu master, Gen (Robin Shou), once a feared criminal, now fights for the forces of good. Equally determined to stop Bison is Interpol cop Charlie Nash (Chris Klein), who has tracked the crime boss all over the world, and Nash's partner, gangland homicide detective Maya Sunee (Moon Bloodgood)."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mikayakatnt",
        "review_rating": "1",
        "review_title": "Turn away now before you waste your time",
        "review_detailed_main": "Confusing plot, crappy villain. This movie deserves a special place in film hell.\n\n.5/5. Would give 0 if I could."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "thelordoftherings21",
        "review_rating": "10",
        "review_title": "Sorry, but I LOVE this one",
        "review_detailed_main": "This movie has incredible martial arts, a beautiful heroine, lots of action, cool quotes, an epic infiltration scene, parcour (freerunning), a wise master, you see the use of \"CHI\" (chinese life energy) and you get an incredible show of Wushu.\n\nAnd yes, of course it might not fit your expectations if you want to see the best movie of your life, but ey, it's really really good entertainment.\n\nHey, I normally share the opinion when the vast majority of reviewers say \"BAD\". But here I just had to state that I actually love this movie!\n\nGo Kristin Kreuk!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "nosferax2000",
        "review_rating": "7",
        "review_title": "Better trip than expected",
        "review_detailed_main": "This movie wasn't bad at all; By seeing some \"deeply\" negative reviews, I was expecting far worse. While it's true that the story doesn't closely follow the original, I found it way more enjoyable than the first movie based on the street fighter franchise. To all who rated \"The legend of Chun-Li\" badly (die-hard fan for the most part I guess), go see \"Blood Rayne\", and you'll have a definitive guide of \"What not to do with an adaptation\".\n\nI have to say, I was impressed by Kristin Kreuk performance as Chun-Li; I didn't think she could fit the role that well. She was expressive and authentic. The same goes for Robin Shou as Gen, and this excellent duo master/disciple fortunately caught up with the poor one formed by Nash and Sunee. Dunno whether it was because of their acting or the script they had to follow, but I really didn't care for them.\n\nWatching Chun-Li's life from her training with her father in a luxurious home, to the slums of bangkok has proved to be a good trip. I wouldn't say no to watch a sequel with other Street Fighter figures."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "utgard14",
        "review_rating": "2",
        "review_title": "Terrible But Some Laughs to Be Had At Its Expense",
        "review_detailed_main": "Hilariously bad video game movie that doesn't miss a single cliché. Petite, whispery-voiced Kristin Kreuk is the title character, a concert pianist who undergoes martial arts training to get revenge on her father's killer (Neal McDonough). This is the kind of movie that is just awful if you watch it alone but, if you watch it with friends, you can have a great time making fun of it. The direction is terrible, the script is moronic, the action lackluster, and the performances range from mediocre to pathetically bad. Chris Klein -- oh my god Chris Klein -- you have to see this turd just for his performance. It is the worst! I couldn't believe what I was watching. Was this guy for real or was he deliberately being bad because he hated the script? I mean, he's Chris Klein so nobody expects much from him to begin with but his performance here was one of the all-time stinkers. Every line delivery, every facial expression, every single scene he has is a lesson in bad acting.\n\nStreet Fighter was pretty big in the '90s, which is when they made the last Street Fighter movie. Why in the world they thought Street Fighter was still popular enough to warrant a movie in 2009 is beyond me. I guess it was either this or Q-Bert. It's manure but it's worth seeing if you enjoy laughing at bad movies with your buddies."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "clerk123321",
        "review_rating": "3",
        "review_title": "what a piece of.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "stormofwar",
        "review_rating": "4",
        "review_title": "Better then the original SF movie.",
        "review_detailed_main": "Picked this one up at the redbox, and hearing a few friends tell me how bad this movie was, I was bracing for the worst.\n\nHonestly, I found it better then the original Street Fighter live action film. Overall, the acting and script was adequate, minus a few wholes, and some parts were unintentionally funny. Some of the scenes in the film are absolutely beautiful and the action scenes are fairly par for the course, but this isn't bad.\n\nThey took a few liberties with the origin of the video game character, but I can forgive that to make the film work.\n\nOverall, it's an average flick and good popcorn and riff material. Far from painful, but I would really only recommend this film if you are a fan of cheese."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mpopy1",
        "review_rating": "5",
        "review_title": "Neither good nor bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "diogomanuel",
        "review_rating": "3",
        "review_title": "Street Fighter fans deserved more and better",
        "review_detailed_main": "\"Girl power!\" should have been used as the name of the movie. However, to attract a bigger audience they have used the Street Fighter name and some (too few!) of its game characters, which so many fans payed a ticket to see portrayed 'in real life'. If it had any other name, it would be an average movie only worth watching when there is nothing better to do. As it is inspired in what is for me one of the best games ever (and this was the main reason why I chose to view it) it gives us Street Fighter fans a real sense of disappointment.\n\n3 out of 10."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "flermavris",
        "review_rating": "5",
        "review_title": "Remarkable in a bad way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "megoobee",
        "review_rating": "1",
        "review_title": "Umm, no. This is not relevant to Street Fighter.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "taylormade-31857",
        "review_rating": "2",
        "review_title": "Atrocious",
        "review_detailed_main": "Stumbled across this film whilst on holiday. Good job I was drunk! What on earth possessed chris klein to act the part the way he did? He was like some camp detective when he was clearly going for gritty or menacing. The rest of the cast chimed in with similarly wodden performances which wad a shame after Michael Clarke Duncans performance in the green mile. It could have been a good film if they hade greater control of the actors and stopped them taking the film in their own direction. Quite a shame for the leading lady who clearly wanted it to be her big break. Really badly acted, poor script and terrible storyline. Glad I didn't see the end!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "emsyquinn",
        "review_rating": "10",
        "review_title": "This is a great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "xamtaro",
        "review_rating": "6",
        "review_title": "what went wrong?",
        "review_detailed_main": "This movie is obviously going for a \"re-imaging\" of Street Fighter. Take a storyline and make it realistically believable. A number of movies adapted from comic books, cartoons and games have succeeded in that aspect; choosing to disregard the more far fetched and fantastical concepts and replacing them with aspects that are more rooted in contemporary reality.\n\nI respect such a decision and who is to dispute it? Previous game adaptations that stuck with its more \"unrealistic\" concepts(Dead or Alive, Street Fighter 1994) never did as well as those that underwent a realistic re-imaging; like Tomb Raider and Resident Evil. In fact, it would be a breath of fresh air to have a Street Fighter story firmly grounded in reality and without all the campy goofiness that made its predecessor such an embarrassment.\n\nSo what went wrong? The story was simple enough to follow. The main character was well developed, as was she good eye candy. The acting was adequate with Neal McDonough giving one fine performance as a screen villain. Intense action and well choreographed fight scenes coupled with all the right camera angles made each battle a treat to watch.\n\nif its one thing that director Andrzej Bartkowiak can do, that is stage a fight and work a camera to bring out the best in that fight scene.(and not surprising since he was originally a cinematographer-turned-director). Each kick and punch is shown with such vivid impact, yet wire stunts and what not are played out with restraint so as to not take away from the realism of the show. Whats more, the director is in familiar territory. With crime syndicate/revenge/martial arts movies like Cradle 2 the Grave and Romeo Must Die in his resume, Legend of Chun Li is right up his alley.\n\nSo what went wrong? Indecision. Either it was indecisiveness or a case of \"too many cooks spoil the soup\".\n\nI bet the producers were split 50/50 on whether to make\n\na) Make this movie a complete realistic re-imaging or\n\nb) Stick to the far fetched concepts of special powers and \"dark qi\" and evil organizations bent on world conquest\n\nIn the end, they took what could have been one of the MOST grounded-in-reality story for any video game adaptation, and threw in some of the most unbelievable, far out elements from the game. THe movie was going strong until 30 minutes into the film when you see a character tossing a \"special power fire-ball\" around. Yes i know the game characters tossed special power balls around like pies among clowns but against such a realistic setting and backdrop, such a concept would be ludicrous. Fine, they changed Bison from a power hungry, \"psycho power\" wielding dictator in charge of his own terrorist nation, into a more realistic underworld crime lord who works through blackmail and subterfuge. Then they had to go and throw in \"ancient dark arts to rid a person of his conscience by transferring it into a baby\". One of the silliest things i've ever heard; it sounds like something out of a bad 70s cartoon.\n\nUnable to decide if it was going to be a straight out adaptation or a re-imagine, this movie failed to define its target audience and instead delivered a half baked product that was all over the place but not where movie goers want it to be. Overall, it is an entertaining but slightly clichéd cop/criminal organisation/martial arts/revenge story. This movie could have been so much more, but alas, it was not to be. Watch this one just for the fight scenes, and the ever attractive Kristin Kreuk. Way-ta-ruin a movie Capcom and thanks for the fireballs."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "IntraSting-1",
        "review_rating": "4",
        "review_title": "Were they TRYING to make an awful movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "punisherversion1",
        "review_rating": "2",
        "review_title": "Stick with the animated movie instead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "francoisbe",
        "review_rating": "1",
        "review_title": "Possibly the worst movie to hit the big screen since.....well a while",
        "review_detailed_main": "I would like to start off with a little background, so i don't appear biased. I am a huge movies fan, and will watch almost anything that might be stimulating, and i have been playing video games including street fighter since the first Nintendo entertainment system.\n\nI had seen the original streetfighter, which was just below average, so i was quite happy when they opted to remake it. This was clearly misplaced optimism, the legend of Chun-li is such a poor film, that i consider the fact that it made the big screen, cunning and deceptive.\n\nThe movie has the feel of having being shot using an old tea bag as filter, and a camera crew comprising three people. i would even allow Jean-Claude to complain about this movie, because the previous one was better, and that statement speaks volumes\n\nWith that said, had the film had it's full compliment of camera crew, it still would not have rescued the weak plot, and even poorer performances. The cast itself was OK, but when you mix underrated actors from your typical blood and guts films, with semi-household names the likes of Michael Clarke Duncan, their average performance resemble the rest of the poor actors.\n\nanother corny thing i need to mention, every time Bison alights on the screen, a sound clip or a tiger is played???? HIS NAME IS BISON.\n\nThis movie is horrible, really poor, the locations were pretty nice, but that was about it, i was half expecting Steven Seagal to have a Cameo. This movie will cause cataracts"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "TheMovieDiorama",
        "review_rating": "1",
        "review_title": "Street Fighter: The Legend of Chun-literally becoming Caucasian.",
        "review_detailed_main": "Come on! Even if Kreuk is of Asian descent, she's blatantly miscast considering her character is predominantly Asian when portrayed as a young girl (and the source material). Laughably absurd whitewashing aside, this is without a doubt one of the worst video game adaptations I have had the misfortunate of viewing. Did anyone actually try here? It shouldn't be that difficult to make a Street Fighter film, yet this atrocity makes the 1994 adaptation look surprisingly decent (newsflash: it's not). Chun-Li's father is taken by a shadowy organisation who wants to redevelop Bangkok's slums (of all places...) She grows up and naturally seeks revenge by \"becoming one with the streets\", because y'know...it's Street Fighter.\n\nPunches weaker than Chris \"Keanu Reeves\" Klein's acting, which literally seems impossible at this stage, and kicks lighter than Kreuk's skin colour, which conversely is entirely possible. There really isn't a redeemable quality to be found. Despite Bartkowiak seemingly trying to direct a relatively mundane plot into a more exciting direction, everything he touches turns to 16-bit nonsense. The inclusion of A-list actors, Clarke Duncan as Balrog and McDonough as an unnecessary Irish Bison, hinders both the film and their careers. Honestly, no one is acting. And it's as if no one has played Capcom's arcade fighter before, as nearly all the characters except Vega are completely wrong.\n\nThe plot, characters, score, direction, visual effects, costumes, Chun-Li's hair, fight choreography, my life and dance sequences (no seriously, Chun-Li dances and it's like watching a horror scene) were all the epitome of frickin' boring. Sleep-inducing nonsense. I was howling when Chun-Li kicks the mask of Vega only to reveal, the one and only, Taboo. \"I Gotta Feeling\" that \"Imma Be\" using my \"Boom Boom Pow\" to Hadouken this abomination into a million tiny pieces. \"Shut Up\", \"Rock That Body\" and \"Pump It\" into oblivion. \"Where Is The Love\" for this rubbish? \"Out Of My Head\". (Okay, I'm done...)."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Merklin",
        "review_rating": "1",
        "review_title": "Honestly, Is it really that hard to make a good live action Street fighter movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "juliankennedy23",
        "review_rating": "5",
        "review_title": "Tomb of the Video Game Adaptation",
        "review_detailed_main": "Street Fighter: The Legend of Chun-Li: 5 out of 10: A Batman Begins style reboot for the Street Fighter series which up to this point consisted of one highly derided film released 15 years earlier.\n\nThe Good: You know if you forget this is supposed to be a Street Fighter film (Not hard to do at all since outside of some the character names this really has nothing to do with Street Fighter) this really isn't that bad. Good production values and location shooting with the occasional action beat. Considering this is currently at number 76 of the 100 worst movies of all time on the IMDB list, the low expectations do it some favors as well. Both Kristin Kreuk as the titular star and Moon Bloodgood as a detective are watchable and refreshing. In addition, Michael Clarke Duncan is clearly having fun and his enthusiasm is infectious.\n\nThe Bad: Entire doctoral thesis has been written about all the things wrong with the movie. Among the various sins child actors that look nothing like their adult counterparts (to the point of being a clearly different nationality), Chris Klein is awful and drags down every scene he is in, Chris Klein is in way too many scenes, and the villain makes no sense.\n\nThe Ugly: Here we get to the crux of the hatred for this unremarkable action film. Street Fighter fans. This is, by any measure, a terrible adaptation of the source material. Now I have to admit my eyes glaze over when rabid fandoms go on the attack because the backstory written to sell some toys and fill five minutes of a twenty-four-minute cartoon is treated as if Moses himself brought it down from the mountain. (I am looking your way Transformers fans), but Street Fighter fans have an understandable beef.\n\nAs source material goes Street Fighter is a pretty thin gruel. Unlike many modern video games, Street Fighter has more in common with Pac-Man or Donkey Kong than say The Last of Us. You have colorful characters and a fighting tournament outside of that a screenwriter pretty much has carte blanche to do what he wants with the story. Guess what this movie does not have? If you said a fighting tournament and colorful characters guess what you win a prize.\n\nIn Conclusion: Clearly, the screenwriter had a Tomb Raider script sitting in a dusty drawer (The film makes much more sense as a Tomb Raider reboot than a Street Fighter one) and got a call from his agent. Meh, one video game is the same as another just change Lara Croft to Chun Li and change the Irish real estate mogul into Bison and we are good to go. No need to change the plot about the cave of soul cleansing or the mysterious scroll or the heroine living alone in the mansion with servants after her father's disappearance.\n\nDecent B movie action film but in all fairness a horrible adaptation of the source material."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "allenarmstrong22",
        "review_rating": "2",
        "review_title": "Just not right",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "chilchix",
        "review_rating": "1",
        "review_title": "Worst representation of Streetfighter's Chun li",
        "review_detailed_main": "I've been a big fan of Chun li since 1994, and Kristen is NOT a good pick to represent Chun li at all! This movie somehow managed to have the weakest plot, poor directing, and bad casting all in one. Aside from having an anorexic actress playing the buff and powerful Chun li, the plot is so unforgivably predictable. At the very end, at least throw us fans a bone and put on the Chun li costum...Go watch this movie if you are NOT a fan of Chun-li, into skinny chick that pretend to throw a punch, bad and predictable plots, shallow and lame character development and BAD acting...Its not even worth it to download it, God forbid if you actually buy the DVD!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "shadowheartz87",
        "review_rating": "10",
        "review_title": "My Review on Street Fighter: The Legend of Chun-li",
        "review_detailed_main": "Now, before I had watched this, I read a lot of reviews about the movie. And For some reason the majority of the reviews were harshly negative! Now I just watched it today and to tell you the truth, I went in expecting it to be horrible. But as I watched it I became confused because I was waiting for it to suck big time! But through the whole movie I maintained interest! The movie had a plot and story that kept me hoping that Chun-Li will get her way. I kept wanted to know what would happen next. And I thought the fighting was pretty well done. They made sure to include some of Chun-Li's signature moves which I was excited about and to tell you the truth I thought Kristen Kreuk was a good pick for the part. If you pay attention you realize that in some ways she kinda looks like Chun-Li. Now I had read a review on IMDb saying \"Kristen Kreuk managed to turn in the least sexy fighting heroine ever.\" But you see, I am glad they didn't try to make it all about how sexy Chun-Li is, but more about her and how she became such a great fighter. This movie isn't all about sex and flash. In fact there was only one kissing scene. it was all about Chun-Li! The title explains it! \"The Legend of Chun-Li\"! not \"The Body of Chun-Li\" Get a clue people! Now I will admit that I have been a big fan of the game Street fighter ever since i was a kid! When it was first on Nintendo AND I Ain't TALKING ABOUT SUPER NENTENDO! And yes Chun-li was always my fav! So maybe I am a little bias. But isn't that why they made a movie about the game? Because they were fans and wanted to make something for the fans? And of course they would hope to attract some people who may have not played the game before. But if you are going to watch the movie and make a negative review about it because they didn't make her into a sex goddess then maybe you should go find some anime porn! I am sure they have plenty of Street fighter Cartoon porn out there for the masses! I am happy that they made a new movie for the game, and I can't wait for the next one! RYU!!!! WOOT WOOT!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "serialteg",
        "review_rating": "7",
        "review_title": "Be prepared to get surprised.",
        "review_detailed_main": "As you will have or have probably read, almost every single comment on the Internet on this one was negative. At least until stumbling upon it on IMDb, to which to my surprise, had a few positive approaches. The movie's not that bad. It's just like what happened to me before watching Dark Knight: people had pumped it up so much, that when I went to the movies, expecting to see the best picture of my life, what I saw just didn't cut it. Not saying this is the Shawshank Redemption, but hey, if you're a martial arts fan (especially Tai Chi), and if you're a Street Fighter fan to boot, give this one a spin.\n\nGotta give it to you dissers, Chun Li's special moves look like *crap*."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Java_Joe",
        "review_rating": "2",
        "review_title": "It's just... bad.",
        "review_detailed_main": "In the pantheon of movies based on fighting video games you can count on really one to be at least decent if not actually good. And that's the original \"Mortal Kombat\". While not a masterpiece in any way it still shows decent acting, some good fighting from... most of the people involved and stays reasonably close to the story line.\n\nBut that's more or less where it ends. While some might have a soft spot for \"Street Fighter\" it's not really a good movie but it's high art compared to this trainwreck.\n\nLet me put this out there first. While I think Kristen Kreuk is a lovely woman her acting is atrocious. I'll even forgive them using a white girl to play a Chinese girl as Kristen is part Asian. I can think of a half-dozen other actresses that could have played Chun-Li and would have been much better in the role. But one bad actor shouldn't take away all the fun from a movie so I doubt a better actress would have made it at least watchable.\n\nThe story shows us Chun-Li's life from the time she was young to the end when she receives word of another she should meet, namely Ken Masters. But this movie didn't do so great so any chances of a sequel starring Ken or anybody else was cancelled.\n\nThe pacing was bad. The acting was bad and the movie was bad.\n\nBut to be fair it's not the worst fighting game out there. That goes to Double Dragon."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "rls0812",
        "review_rating": "5",
        "review_title": "Confused Movie",
        "review_detailed_main": "Here we have yet another movie that uses the Street Fighter name, yet has no idea who the individual characters are.\n\nEvery one, with the exception of Barlog and Vega, were completely out of their \" Street Fighter \" character .\n\nThis movie would have done much better if they dropped the Street Fighter name, and come up with something original.\n\nOn it's own, it's an alright martial arts / revenge flick / action genre, nothing spectacular, but still an average B action movie ( better than most of Steven Seagal's movies ).\n\nThe good points: Camera work was pretty good. Fight choreography was OK. Set design was good.\n\nThe not so good points: The actors were trying, but their deliveries were awkward at times. There are a few plot holes that are never explained. The music at the club scene - WHY did they choose something that BAD? Decisions made by Chun-Li, no real life human would ever do. A lot of padding was used that slows the movie down to a snails pace. Overuse of wire \" acrobatics \" during combat ( along with pseudo Matrix sound effects thrown in ).\n\nIf your in the mood for a generic action movie, and have nothing better to watch, this movie would be perfect for you."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "bigjakeriz",
        "review_rating": "3",
        "review_title": "Yup.... Van Damme's was better.",
        "review_detailed_main": "Yeah i said it, i freakin loved that movie, but i watch it as if it were a comedy, not a serious SF movie. But this one, MAAANN!! Chris Klein....just stop it. Now, i thought it was bad, but some scenes in the movie i actually perked up, just a tad. They had some story OK, like rose. But so many other mistakes. Like Vega was a very big disappointment. A lot of people complain about Liu Kang, I mean Gen, i didn't think he was that bad. And the fact that (SPOILER DO NOT READ IF YOU DO NOT WISH TO KNOW) Bison dies in the end is pretty disappointing, but in the actual story bison dies and returns a couple times. So, i am just hoping that this sorry excuse for a Street Fighter movie is just a really bad prequel to a very improved sequel. But who knows."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Heislegend",
        "review_rating": "4",
        "review_title": "A case study in over-acting",
        "review_detailed_main": "Seriously...this could be studied in film schools for years to come simply because of the sheer levels of self-seriousness and overly dramatic delivery of the actors. It's bad...really, really bad but it helps the movie in a strange way because you just can't help but laugh at it. The only person who isn't tripping over themselves to deliver this trash is Michael Clarke Duncan...but what do you expect from a man who's usually hired more for his stature than his talent? I'd love to be able to say this was better than the original Street Fighter live action movie, but it's not. Mind you that it's bad for very different reasons, but still...it's pretty lame.\n\nThe only thing that really bothered me in this film is the absolutely perverse amount of clichés and the stunning amount of suspension of disbelief required (Kristen Kreuk as a Wushu master? I barely buy her as a human being). Yeah, I realize it's a movie based on a video game, but there's got to be a line somewhere. And if anyone reading this is old enough to remember when Kevin Costner caught all that crap for his on-again-off-again English accent in Robin Hood, then you'll practically die laughing when you hear Neal McDonough lapse in and out of the worst Irish accent I've ever heard...ever ever ever. Oh...and don't forget Chris Klein as the tough Interpol agent who can't stop delivering some of the most ridiculous dialog and one-liners I've ever heard. But the funny thing is that despite all of this the movie manages to at least be watchable. You just can't help but laugh at this stuff and, while that's not it's intention, it doesn't make it any less entertaining. It's a bit of a crap shoot...if you've got something better to watch, go with that. But you might not be as disappointed as you think with this one. It's good for all the wrong reasons."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "bikeboy_bmxer",
        "review_rating": "4",
        "review_title": "Thought it was a TV show...that's how bad the acting was.",
        "review_detailed_main": "I honestly thought I was watching some low budget TV show. But then it went on for over an hour and a half...so I began to think I was watching a special extra long premiere. Then during commercial break it said something about the Sunday night movie will continue... I couldn't believe that this was an actual movie...as a TV show it was OK but knowing now that this was an actual movie that someone wrote and directed is just disgraceful. I would like to see the street fighter series made for real. This movie would be suitable for teenage kids. But true street fighter fans may want to wait for the real deal to be made."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "culwin",
        "review_rating": "5",
        "review_title": "I didn't think it was that bad?",
        "review_detailed_main": "Not sure what this movie is doing rotting on the bottom 100 list. It isn't too good, but it isn't that bad either. I'm not sure it has much to do with Street Fighter other than a few character names, but it's just a somewhat weak fighting movie. There's not a bunch of cheesy dialogue like the first Street Fighter live action film. No ridiculous characters like that one either. Actors are fine, plot is straight-forward. Maybe it just doesn't seem so bad because I saw 3 other worse movies earlier, all with higher budgets than this. But the worst I can say about this one is that it's just not very interesting. Meh."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "gerumghl",
        "review_rating": "3",
        "review_title": "Hahaha",
        "review_detailed_main": "This made me laugh. This whole thing was useless. If you like long spanned stories with weird business stuff in it, this is for you. Nothing inspired from the games."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "starlimitz2",
        "review_rating": "2",
        "review_title": "I thought the first one was bad...",
        "review_detailed_main": "When producers know that the 1994 movie completely flopped into nothing but an inside joke, they could have turned around and decided to make a serious movie that could have driven the Street Fighter game to new levels, but no, they crapped it all down the tubes. The sequencing is absolutely terrible, they start out with a narrative, and have a few good parts, but then the narrative just keeps going and the movie keeps bogging itself down with very poor wire-stunt work, and some of the worst acting I've ever seen. The \"kungfu master\" Gen, who is obviously a combined character of Ken and Ryu, has the most cliché dialog ever thought up to go along with his infinitely cliché role. The only really good performances I could find were from Michael Clark Duncan and Neal McDonough. Through out the movie, you could very easily predict what was going to happen several minutes before it actually did. All in all, another depressing look at one of my favorite childhood past-times, put into live action and carelessly flailed across the screen."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "luke_bale",
        "review_rating": "10",
        "review_title": "Street fighter",
        "review_detailed_main": "Im giving it a 10 just to try and balance out all of the awful reviews.\n\nCostumes are not the same as in the game??? (well that worked for the x-men films, wolverine, yellow spandex anyone,and didn't work in the slightestfor the Van Damme version of street fighter, yeah the costumes were true to the game but in real life they are so very wrong) The costumes in the game are slightly ridiculous so to make any attempt of making this a serious film they had to change that.\n\nBison is wearing a suit, and has a beard (yes cos most druglords wear military outfit despite not actually being in the military, I see why people would care about that???) Some bad wire work, but lets be honest no worse than in a lot of Chinese films and how else were they gonna recreate moves from the game which are ridiculously over the top in the first place. I thought it was a good effort at bringing those into the film. As for the rest of the action their were some pretty damn good strikes and locks as well really impressive flips, rolls and break falling especially when you consider the main character is from smallville, I was really surprised.\n\nIm surprised at how seriously people criticised this film as well as overacting, I have seen so much worse and at least someone is making street fighter movies. Oh and Chris Klein was in American Pie, so what, also shocked at how many people said this was trash compared with the Van Damme film, I don't think their is one decent martial arts technique in that film, Van Damme did none of the good stuff you see in his older films,the costumes were camp, most of the cast were rubbish in their roles, nothing about that film was good..."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "jason_Xspike",
        "review_rating": "7",
        "review_title": "not that bad!",
        "review_detailed_main": "it wasn't that bad. maybe the story was a little different than the game. but still better than the van dammme street fighter movie. at first before it released i thought it was gonna suck ass because ryu wasn't in it. but when i saw the movie and thought about, it makes sense. maybe not perfect but pretty well done movie for an action packed game. at the end of the movie gen speaks about the street fighter tournament and ryu. so there will be a sequel and maybe that one will be even better. so whats up with the disappointment everybody? cheer up. i think this movie deserves good reviews because it wasn't bad as those other game based films like DB:evolution that sucked big time! any way i would recommend everyone to watch this movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Buddy-51",
        "review_rating": "3",
        "review_title": "Hardly a legend",
        "review_detailed_main": "Ever since she was a little girl, Chun-Li's sole ambition in life has been to become a world-class concert pianist. But when her businessman father is unceremoniously whisked away in the middle of the night by a ruthless corporate tycoon bent on ruling the world, Chun-Li agrees to be trained by a martial arts master so she can get her father back and bring the villain's empire crumbling down around him at the same time.\n\nBurdened by kindergarten-level storytelling that makes \"Kung Fu Panda\" look like stark documentary realism in comparison, \"Street Fighter: The Legend of Chun-Li\" is a far-from-legendary, barrel-scraping fiasco marked by stock characters, bland performances and rote dialogue.\n\nHeck, even the martial arts sequences fail to generate any genuine excitement or pizazz. Stick to the video game instead. At least you can participate in that one."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Tkosan",
        "review_rating": "3",
        "review_title": "Only good thing...",
        "review_detailed_main": "It was miracle that the European boss was Finnish (Sami Vayrynen). So we got to hear few (two lines) of Finnish.\n\nEvery other thing falls flat. Chun-Li didn't look like Chun-Li. Gen didn't look like Gen. Bison(Vega) didn't look like Bison(Vega). Vega(Balrog) didn't look like Vega(Balrog). Well Balrog(Bison) so what look like Balrog(Bison), but with others wasn't enough. So casting was off very much.\n\nAnd ending was disappointing. It left too much open. And same time it reveal too much.\n\nSo we are left wait sequel that by my option is going to suck more."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dilbertsuperman",
        "review_rating": "1",
        "review_title": "Total piece of junk from stem to stern. Bad casting, but the opening scene is a funny fight.",
        "review_detailed_main": "This is a real stinker. The casting for Chun Li is terrible, the girl has tiny arms that can barely lift a tennis ball much less be a convincing fighter. The acrobatic scenes are laughable wire fu/wushu garbage. Chun Li's dad is kidnapped and she sets out for revenge against a super bad guy who has Vega as one of his henchmen. The fight scenes are bloodless and ridiculous, the movie is not true to the video game character.. so anything you came to see is not here.. the lead girl is neither a convincing fighter nor is she hot, she should be both. A twelve year old might like this movie, but I would expect them to have higher standards."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "ankitvohra",
        "review_rating": "2",
        "review_title": "Not even worth a penny!",
        "review_detailed_main": "The movie sucks big time. Being a fan of Street Fighter games, I had high expectations but it all ended within 15 min. I waited desperately for something. And then I was waiting for the movie to get over.\n\nIt lack in almost all the departments. The dialogs were worse than even imagined, a 5 yr old could have done better job with it. The direction is so so bad that I would like to request Mr. Andrzej Bartkowiak to please have a disclaimer that it must not be watched.\n\nLastly, I would just like to highlight my rating that gives 2. The only reason why it doesn't deserve 1 is because of some tolerable action stunts that otherwise are quite normal but for a movie of this low level seems good. So people if you want to be a fan of Street Fighter franchisee please DON'T WATCH THE MOVIE>"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "MisterSaxon",
        "review_rating": "4",
        "review_title": "(Unintentionally) The Comedy Of The Year!",
        "review_detailed_main": "You know how they say that some movies are so bad that they're good? Well, \"Street Fighter: The Legend Of Chun-Li\" may be so brain-boilingly awful that it's actually incredible. Take pretty much everything that you know about the video game this is based on, and throw it all out of the window because that's exactly what the makers of this movie did!\n\nNow have a think about the following question. If you had been orphaned as a small baby in Thailand, what accent would you have after growing up there? Well, according to the makers of this movie, it would be Irish. If you're looking for an explanation to this, the movie intelligently provides one by informing you that the character in question (Bison, for those of you who know your Street Fighter games) had an Irish mother.\n\nErm...right!\n\nThis is a movie in which we have a renegade cop called Nash who has obviously never had the time to look up the word 'cliche'. With two day stubble, he swaggers around his scenes shouting things like \"What orders?\" or growling at computer screens. At one point he walks straight up to the camera to recite plot-moving dialogue straight to the audience with a knowing wink.\n\nThis movie is awful. Absolutely terrible. There is even a scene in which Chun Li actually has a sexy dance-off with a lesbian enemy. I swear to God, that I'm not joking about this. What's even better is that this scene ends with a character asking renegade cop Nash 'Are you going to tell me or should I guess?' with Nash growling back in a Dirty Harry voice (whilst squinting like somebody playing a parody in one of those \"Epic Movie\" abominations) 'Go ahead and guess.' It's as though Chris Klein (who plays Nash) was the only actor who realised that this entire movie was a joke and decided to pretend he was in a comedy.\n\nI can't recommend this movie enough if you get any amusement over cinematic car crashes.\n\nTerrible. Just terrible."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "solobutt",
        "review_rating": "3",
        "review_title": "Bold but True Statement - Worse than the First",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "undrtakr22",
        "review_rating": "5",
        "review_title": "Okay. It's not a glam action movie, in now way. But, it's got some good scene's in it...",
        "review_detailed_main": "Okay, just watched this movie(As I also watched the original, with JCVD, when I was a kid.). Trust me, it's not worth the trip to the theater's, that's for sure. Now, with that said. Let me break it down a bit here. It is NOT an all out martial art's fighting style of movie. And, here is actually why many people let it go over their head's(Because, I have seen many of these type's of spin-off's. If you want a better idea, of why I say it's a \"spin-off\" & a cliche' style of a backtrack to the first movie &/or the game. It may not be a game. But, it does refer to the background's of the original character's, of the original movie's. Check on the movie \"Logan\", in reference to where Wolverine, from the X-Men came from. It's not an all out battle and special FX through the whole movie. It's your basic dull climb to where the original could actually begin, or start from.). Okay, to not give away any spoiler's, the plot that seem's choppy to most and a downer, to them. Is actually set on the beginning of the lives of certain character's, like Chun-Li(AKA Chun-Lee, if you seen the name, in I think 2 of the original game's, for the Nintendo, or Super Nintendo. I forget which one, though.), Bison & Vega. Before she get's the dual side hair bun's and her infamous dress, that you see her fighting in, in the game's. It's basically, an intro, to the possibilities of the original. Kinda like the Star War's movie's. How, they made them, like 30 years, AFTER the original trilogy. To me, they were cheesy and dull. But, what do you expect, from an intro style movie!? Where, the character's, don't really know, who they really are, yet? It's kinda like a right of passage, to give a background story, on the character's, themselves, to let people see, where they came from(Exactly the same thing, that they were doing, with the X-Men movies. When, they spawned the Wolverine side movies. And, those, after the first, weren't too bad. But, the first of those spawn's, was dull as a marble. But, it set the ground, of where to take the next sequel that would eventually, lead up to the original movie.). So, I wasn't expecting the tournament style fighting. But granted, I did expect some better acting. But, it didn't seem like the actor's were really at fault. I have seen many of the actor's/actresses in other movie's/show's. And, they did much better work in those. So, it seemed like they were at a loss, of which way to turn, without their leader(The producer, to tell them, what they needed, for the scene to look more realistic.). As if, the producer, just told them, to ad-lib half the movie. Where, they kept bumpin their head's, a lot, when they should have been more in-sync, then tryin to cross each other's path's. Now, most of the fight scene's were pretty good, like I said. Where, the obvious best, were between Robin Shou(Loved him, as Liu Kang, in the original & sequel of Mortal Kombat.) & Kristin Kreuk. And, the fight in the girl's restroom, with Josie Ho & Kristin Kreuk, wasn't bad, either. But, there are a few other good short fight's, where it makes it worth while, to get the cheap seat's, for the movie. I would bet, if they had a different producer, that knew what they were doing, it could have gotten a 7 or 8, or maybe a 9, instead of the 5 star..."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "rytops1",
        "review_rating": "3",
        "review_title": "Typical, thoughtless, gamer movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "amantzgjani",
        "review_rating": "10",
        "review_title": "Great performance by Kristin Kreuk and Neal McDonough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "yiNXs",
        "review_rating": "7",
        "review_title": "OK, it has not much to do with the game Street Fighter, but...",
        "review_detailed_main": "I tend to make it a habit to vote on IMDb after I've seen a movie, and usually I'm pretty spot on with the grade I have in my mind compared to the average here. I did expect to be voting above average this time, but I didn't expect the average to be this low.\n\nTrue, during the movie there were quite a few moments that I had to laugh because of predictable, or over the top things, but I expect that from a movie based on a game which is over the top by itself. Now it's also true that the story hasn't got much in common with the game story, but I also think the game story isn't that extraordinary to care for it. Perhaps they could have called it differently, and use different names. I had not problems putting it aside.\n\nAnyway, when I started this movie I was expecting something bad, but I was in the mood for something bad with over the top martial arts. Unexpectedly, something about the movie just grabbed me. Even though the plot is not spectacular, it was definitely not unwatchable. Most modern action movies have me lose my attention soon, because of their simplicity. They usually just dump a handful of characters on your screen, tell you who's good, who's bad and then let you watch two hours of constant running and fighting. In this case they did seem to wanna try and tell the story, and not just put a bit of story in there to justify the fighting, so I guess that made the difference for me.\n\nCompared to the 1994 Street Fighter I think it's a lot better, even though that's not very hard to do. 6.5/10 rounded up."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "cj-london",
        "review_rating": "4",
        "review_title": "A golden opportunity wasted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "uchechinonso9",
        "review_rating": "3",
        "review_title": "The 1994 movie is a masterpiece compared to this trash!! Avoid!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "reddiemurf81",
        "review_rating": "5",
        "review_title": "Uh,,, great cast at least,,,",
        "review_detailed_main": "By NO means is this a GOOD movie,, and that's a shame. Kristin Kruek is the PERFECT actress to play Chun Li!! With a different director and better writers this probably could've been something incredible. Oh well. If you want to turn off your brain and watch a movie,, this'll do."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "garycool12",
        "review_rating": "1",
        "review_title": "Definition of a bad crossover.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Paragon240",
        "review_rating": "4",
        "review_title": "It's impressive how this terrible movie makes the outrageous cheese of the 1994 Van Damme film look like a masterpiece.",
        "review_detailed_main": "Two stars might be generous for this one, but I had a fun theater experience laughing with my friends at how unabashedly awful this movie was. Movies like this are why video game adaptations have such a bad reputation. Street Fighter: The Legend of Chun-Li tried to make a gritty, more realistic version of the games while simultaneously using every cheesy cliche they could imagine. I can go down the list from there on how bad the acting, stunts, fighting, and costumes were. This movie felt like a bad straight-to-TV movie directed by the B-team at the CW. The crazy thing is that Capcom was heavily involved in this film and still let this disaster see the light of day. Hopefully, it's been long enough for a Street Fighter reboot to make its way to the silver screen once again."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "he88",
        "review_rating": "5",
        "review_title": "What Did You Expect For A Fantasy B Grade Movie?",
        "review_detailed_main": "I give a five out of ten because it is a cheesy B grade movie so why judge it like a higher grade movie? To me the biggest draw backs is the writing, acting, and directing has many signs of weakness throughout the movie. On the other hand the over all production gives it a glossy appearance of oa much better movie so it's not like the cheesy martial arts movies in the past.\n\nThe fight scenes is about what you'd expect. People getting hits that cripple or kill most people only these people keep coming back for more. On the other hand the gun scenes get even more ridiculous because even automatic weapons just can't hit some people. That's something I've seen in too many comic book heroes portrayed on TV. When mere humans outrun automatic fire....Ya! That's pure bull...\n\nIt's worth at least five stars because in the end...You watch it because sometimes you like a cheesy B movie just for kicks....And this does deliver."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "john-5853",
        "review_rating": "2",
        "review_title": "I feel bad for Kristin Kreuk",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "martinwlicht",
        "review_rating": "5",
        "review_title": "You really need to be a Street Fighter fan",
        "review_detailed_main": "As a huge Street Fighter fan since childhood, I couldn't leave out this movie despite all the bad reviews.\n\nThe script is cringeworthy at times, but there is some surprisingly good dialogue still: \"as time went by I was getting further and further away from all I ever was, I felt lost chasing a ghost I might never find.\""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "abhansen-874-996709",
        "review_rating": "10",
        "review_title": "Am I the only one here who actually likes this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "sikuyabatok",
        "review_rating": "7",
        "review_title": "You said it's bad, i says it's worth.",
        "review_detailed_main": "How the bad thing become a worst? Ask Michael Bays, he answered with transformer 2. On Legend of Chun Li, you'll see the bad movies chemical inside struggling it self to be unrecognized.\n\nThe Bad become only bad.\n\nAnd it is worth for mediocre motion pictures for gamers freak. At last, this movies surpasses the shitty legacy of JCVD's Street Fighter. I vote it 7 stars, for being decent movies, the fight, the breast cleavages, and the non-English words. At least major police station in Bangkok didn't placed at the cheap showrooms. Last, i think they take it seriously to doing something for uneasy story like Street Fighter's. It become bad, but i gave them salute."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "4",
        "review_title": "\"Street Fighter: The Legend of Chun-Li\"- Basically every bland 90's direct-to-video action-flick, but with an actual budget and an inexplicable theatrical release.",
        "review_detailed_main": "Honestly, perhaps the most perplexing thing about 2009's \"Street Fighter: The Legend of Chun-Li\" is just how completely and utterly average a movie it really is. It's basically completely sanitary and relatively inoffensive in its structuring, with just competent enough production values and a generally passable cast. But it's so plain and \"blah,\" you can't help but feel yourself starting to nod off should you chose to give it a watch. And I think that's the real problem. It's not the terrible crime against film that it's made out to be... it's just so wholly unremarkable as a movie-going experience, that it feels empty and pointless.\n\nIt really does remind one of those cheap-o 90's direct-to-video action flicks that used to pollute the video-store shelves back in the day. This feels like the sort-of film you'd rent on a whim because it looks like it might be good for a laugh, watch on a Friday night and forget about a day later. The sort of film Z-grade actors like Antonio Sabato Jr. or Cynthia Rothrock would pop up in and kick some butt while a cheesy synth soundtrack blared in the background. But inexplicably, this one somehow got a theatrical release, a $50 million budget and was tied in to a popular tournament-fighter video-game series. Unfortunately, unlike the other \"Street Fighter\" live-action adaptation, which at least was semi-comedic and benefited from campy laughs and a great performance by the late Raul Julia... \"The Legend of Chun-Li\" is just boring and mind-numbing in its standardness.\n\nThe film follows one of the characters from the \"Street Fighter\" game series, Chun-Li. When she was only a child, she witnessed the kidnapping of her father by the dreaded M. Bison. Years later, after losing her mother to cancer, she encounters martial-arts master Gen, and trains under him, vowing to get vengeance for her father's abduction. And so, the film degenerates into a standard tale of action and revenge as our heroine faces various thugs and obstacles in her struggles against Bison and his cronies. Yawn.\n\nIt shouldn't be too surprising that the film is helmed by Polish cinematographer-turned-director Andrzej Bartkowiak. After all, he was already responsible for another extremely bland and toothless video-game adaptation in \"Doom\", and this film falls into many of the same trappings as that release. Inspired by a video-game source material yet afraid to follow the details and formula of the original work. Filled with lots of high-concept ideas but a slave to clichés. Cast with generally decent performers who are hampered by sub-par screen writing. And assembled with relative competence while simultaneously feeling generic and trite. While Bartkowiak's films might not be as ludicrously awful as other, more infamous video-game movie directors (I'm looking at you, Uwe Boll), in a way, his films are worse. At least the poorer films generate some talking points due to their overt failures... Bartkowiak's are merely wholly forgettable.\n\nTo give credit where it is due, the film does have some minor strengths. I really liked some of the supporting cast for one. It was really great seeing \"Mortal Kombat\" star Robin Shou back on the screen as martial-artist Gen, and he's a criminally underrated and highly likable actor. It was also good fun seeing the late Michael Clarke Duncan as one of Bison's main cronies. Some of the action was appropriately thrilling and the effects were generally passable. And there's even a few really fun, schlock-tastic instances of blood and gore in the Unrated version of the film that generate an appropriately queasy response.\n\nBut the script by Justin Marks is the most basic of the basic, the cinematography is flat and uninspired and lead actress Kristin Kreuk is hilariously un-charismatic, leaving the film just feeling dull. Not terrible. Just dull and average at best. There was really no reason this film should have been tied to \"Street Fighter\" besides brand recognition, and it could just have easily been re-written to be an \"original\" story. The purported $50 million is barely visible on- screen and could easily have been slashed in half. And the movie really didn't warrant a release on the big-screen. This really is just about on- par your standard direct-to-video action-thriller. And that's where it should have been released. At least then, I would have known to set my standards a bit lower.\n\n\"Street Fighter: The Legend of Chun-Li\" is a 4 out of 10. If you catch it on cable and there's nothing else on, give it a shot. It'll at least kill 90 minutes on a slow afternoon. But if you're thinking about actually paying to rent or buy it, don't bother."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Batzarro-1",
        "review_rating": "2",
        "review_title": "A waste of a perfectly good movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "bobbbyjoe",
        "review_rating": "3",
        "review_title": "Such a great fun-bad movie",
        "review_detailed_main": "They completely change the characters origin, then the movie follows a story that would make sense to the original origin. Every change to the story they made made their movie more convoluted. Amazing."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "derektrotteresq",
        "review_rating": "1",
        "review_title": "A steaming turd of unparalled proportions",
        "review_detailed_main": "I once wrote that 'Batman& Robin' was the worst movie ever made, boy was I wrong! Street Fighter: Legend of Chun-Li is worse, so much so that my eyes actually started to bleed whilst watching it. The film bears little to no resemblance to the story or characters of the video game for which it was based, instead it plods away at a suicidally slow pace whilst throwing in every cliché and corny line that it can muster. I can't say that i've heard of Chris Klein but i can tell you this....... Chris Klein desperately needs acting lessons - had they hired a tone deaf mute with one leg and no fingers, i'm pretty sure he would have done a better job in the role, this man made me want to actually pour acid into my eyes rather than watch him for one more second. For the first hour of the film, nothing happens then when the last forty minutes of eyeball torture comes around......nothing happens. Basically the film is a big bundle of nothingness, wrapped in a tea cosy of nothingness......shrink wrapped in nothingness for good measure. Save yourself one hour and forty minutes of your life by avoiding it like you would a vat of aids or a politician."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "callanvass",
        "review_rating": "2",
        "review_title": "And people claim Street Fighter is bad?. Trust me, this is much worse!.",
        "review_detailed_main": "I actually enjoy the original Street Fighter, for what it is, but this on the other hand, is a piece of garbage, that has all the fun taken out of it. I dig Neal McDonough, but he plays a terrible Bison, with a horrific accent!. The fights are filled with nothing but people on wires, and fancy looking stunts, where as the original actually had some Realness to it!. The cast in the original was a lot of fun. They weren't the best actors, but they were fun to watch, in this movie they all take it seriously, and that's what really killed it in the end for me, along with the terrible acting. I realize this movie is not based on the original, but it's missing all the key characters, that made the original so much fun in a cheesy way. The movie relies heavily on the development of Kristen Kruek, aka Chun Li. Her character is interesting, but not interesting enough to focus an entire movie on her revenge plot. The people who complain about how bad Street Fighter is, I suggest you take a look at this movie. You may think twice, about calling that one bad.\n\nPerformances. Kristin Kreuk is pretty, and her performance ranges from weak, to above average. Here she is riddled with inconsistency. She clearly gives it her all, but the movie isn't good enough to support her. Chris Klein is an actor, I actually like, but his wooden, cocky performance here, does not do the movie any favors, what's with the hair do?. Neal McDonough is terrible as Bison. He looked like he was having fun, but I didn't have fun hearing that god awful accent, and he's certainly no Raul Julia. Robin Shou isn't bad, but his charisma can only take the role so far. Michael Clarke Duncan has spirit, I'll definitely say that much. Moon Bloodgood is good eye candy, but that's about it.\n\nBottom line. This is the pure definition of a clunker. There are no redeeming qualities about the movie, nor is there much entertainment value at all. It's a rather dull 90 minutes of your life, that you can spend much better elsewhere, Avoid.\n\n2/10"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "KyleKatarn1980",
        "review_rating": "1",
        "review_title": "It's not Street Fighter, and it absolutely has nothing to do with Chun-Li or the fighting game itself",
        "review_detailed_main": "Honestly I have nothing more to say about this awful movie. I myself have actually enjoyed playing Street Fighter games because their movesets are very simple to pull off and most of it's roster just has the perfect kind of appearance they would also look for most of Capcom's gaming lineup.\n\nSo this is based on Street Fighter's iconic female fighter Chun-Li, this movie is focused around her and the revenge she gets at M. Bison for killing her father. And asides that this movie tries so hard to explain her story throughout the film, it seems to fall off so hard and panned.\n\nThe casting is pretty god-awful and horrible and it seems to me like they added Kristen Kreuk to play as Chun-Li. Even though she was a lot better playing as Lana Lang in Smallville, I feel that her role as the popular female fighter is an absolute mis-cast because she happens to be a mixed-race (she is Chinese Canadian) for the Street Fighter character who is fully Chinese, at one point in this movie she puts on her trademark hairbuns and wears a blue dress (not even a qipao), but then the rest of this movie shows her wearing black or other clothing that doesn't match Chun-Li at all. Neal McDonough is even worse for playing as M. Bison because he looks nothing like his video game counterpart, doesn't even wear his iconic outfit, at least Raul Julia had dark hair for the role of M. Bison back when he played as him before his death. Although we can safely say that Julia's role of the villain had more better experience than that of McDonough who's hardly even acted out like Bison especially with that dumb fake Scottish or Irish accent. Chris Klein and Moon Bloodgood that both played as Charlie Nash and Maya (who is basically C. Viper from SFIV) don't even look like their video game counterparts and just go off as useless detectives in scenes from this movie. They're using guns most of the time and I don't know if they would've known that this movie is called Street Fighter and they should've been using their hand-to-hand combat besides using firearms for most of the movie. Two other one of Bison's Shadaloo men Balrog and Vega were played by the late Michael Clark Duncan and Taboo (singer of the Black Eyed Peas). Both of their roles also had major flaws. For Duncan on his role as Balrog goes off using firearms and can't even throw punches at one of his opponents just because he's a boxer. For Taboo on his role as Vega shows that he's too short to play the role and is also Native-Mexican while Vega in the games is actually tall and Spaniard. Overall the one interesting role I would somewhat like is Robin Shou who you might remember him as Liu Kang in Mortal Kombat from 1995 and plays a small role as a pirate leader in DOA: Dead or Alive. He plays the role of Gen who is Chun-Li's master and spends his time training and also fighting alongside with her in the movie. The one thing that throws me off is when he pronounces Ryu as RAI-YOO and not REE-YOO or if you were to roll that \"R\" with the name it would've sounded more accurate.\n\nThe fight scenes in this movie somehow feel ok at times but then they would show the scene where Chun-Li would actually kill one of those guys in this movie especially when she's a police officer! And not only that, there are some brutal scenes that make it a little hard to watch just because they would slap on the Street Fighter name on the title of this film!\n\nThe special effects in this movie are absolutely the worst ones yet. There are times when you know that the bullet shots are digital effects without using prop firearms. And the Kikoken scene is the most terrible cheap special effect of all-time. It's not even colored blue like in the games, and the appearance on it looked like it was taken from an old 90s computer graphics that still looks awful today.\n\nThe quotes in this movie are probably the worst, no where near as corny as what we usually would hear in Street Fighter the Movie with JCVD and Raul Julia. That movie at least was cheesy and had fun moments which still shows some better word quotes from characters like Guile like when he gives out a speech or M. Bison talking about raiding Chun-Li's village ending with the phrase \"For me, it was Tuesday\". But in Legend of Chun-Li, it seems their lines were murky and also uninspired like Bison would tell Chun-Li that her father is the milk of his business and would finish with \"But even milk has an expiration date\". I mean how would you not know that milk goes bad all the time! Especially all the other characters quotes feel so flat and terrible in terms of a scene they would be mentioning.\n\nOk so this movie of it's own would think that Rose (and yes I'm talking about Rose from Street Fighter games) is the daughter of M. Bison. There is no blood-related connection between them in the games. Rose is in fact Italian from the fighting game she originates and has a fortune telling ability. This movie's version of (White) Rose is nothing more than coming off as Russian (due to the language she spoke) and is never actually a fighter.\n\nOverall this movie is nothing more than a pretty bad reception and a god-awful superhero like fighting game adaptation. Everything about this movie is so bland, most of the characters in this movie don't even look or dress like their appearances from the video games because they're all wearing black for the majority of the film, the special effects are all so cheaply made like it's an independent movie despite being released by 20th Century Fox (now known as 20th Century Studios), the acting and writing is so piss-poor with each character's lines saying something nonsensical, and all about this movie is that they were planning to have a sequel with Ryu and Ken Masters. Unfortunately it didn't happen and I'm just so glad that the sequel of this misstep of an adaptation would never have been made, it could've been much worse.\n\nThis movie's runtime is about 96 minutes, well apparently the deleted scenes included multiple scenes that were cut from the final product! One being a cameo scene with the producer of Hyde Park Entertainment, Ashok Amritraj. And at the very end is suppose to be I think a post-credit scene where the White Rose is at the police station then all of a sudden her eyes show that she's possessed almost thinking she's taken M. Bison's aura around her. But again overall I'm just glad that a sequel had to be cut out for this abomination.\n\nIt's hard to believe that the writer for this movie would later go on to write the live action Disney Jungle Book movie from 2016 and of course probably the best drama movie of all-time, Top Gun Maverick! It's incredible he went from a rocky start to a smooth flowing safe trail. I recommend watching those movies instead, but stay FAR AWAY FROM LEGEND OF CHUN-LI!! I recommend axing it or Hadouken it in flames!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "SoloScreener",
        "review_rating": "3",
        "review_title": "Not the worst movie I've seen",
        "review_detailed_main": "The plot is pretty loose: kidnapping, some almost spiritual journey to beat the bad guys without being angry, some random sub-plot about the \"white rose\" which didn't add much/make much sense, in my opinion.\n\nFight scenes were pretty standard for poorly rated martial arts films. Also included some pointless Matrix-style stunts.\n\nThere were a few actors I recognised but this film didn't do much for them. It was all pretty cringe.\n\nI especially find films that insert themselves into another culture, especially commenting on that country's politics/social issues, are even worse when they use mostly American actors."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "tcs-14",
        "review_rating": "8",
        "review_title": "A kick ass movie with a story!",
        "review_detailed_main": "I totally disagree with those negative reviews!\n\nI just came back from watching \"Street Fighter: Legend of Chun Li\" at the cinema and the movie is better than my expectation! Way much better than the 1st movie which was so lame to watch even on DVD! I'm not an ardent fan of the game but I'm familiar with the characters and Chun Li is my favorite kick-ass heroine. Kristin Kreuk did a pleasant job as Chun Li!\n\nMy salute to the production team and the director for keeping the spirit of the story/game. It may not be the best action movie but certainly a good kick ass movie with a story that worth your money! So why are you still reading this review at home/work?! Go and watch the movie at the cinema now...wherever you are!!!!!!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "xens_pineapple",
        "review_rating": "7",
        "review_title": "More than I had expected",
        "review_detailed_main": "It's historical that most movie adaptions that are based on games have a poor history. Some take the comical route as did \"Double Dragon\", which went well in my eyes when I saw it as an early teenager - I would find a lot more to bash about it today, some were written with monkeys with down syndrome; Mortal Kombat: Annihilation, case in point, and others veered from the original idea to form their own story; Resident Evil.\n\nThe original \"Street Fighter\" was terrible; now comes \"legend of Chun Li\". To be honest I didn't know what to expect and I merely wanted it for my collection - just another DVD I could poke fun at with friends down the road. Though not perfect, I found this to be far more entertaining than I was going to give it credit for. I didn't find any overly-drawn out romance scenes, I didn't notice any over the top special effects or special moves (Though I did recognize some of the fighting moves as those found in the various \"Street Fighter\" games) and just about everything is almost plausible as far as realism in the fighting.\n\nAlso to note, I don't feel any one character was over-cast or added in \"just because\" as was the case with \"Mortal Kombat: Annihilation\" (take Rain for instance). Vega only has a handful of scenes, Balorg is merely the Hench man without much dialog to screw up, and the only other character besides Bison is Chun Li herself (obviously) and Gen (acting as mentor).\n\nI laughed at some of the attacks, like Chun Li's spin-kick, but moments like that were too far between for me to seriously point out as down grading the movie. Also it almost gave me a toned-down \"Kill Bill\" feel, and while I won't reveal any real spoilers, I would like to address that this movie is probably to date, one of the rare gems that don't put shame the title it's representing (\"Street Fighter\").\n\nThe movie does end with an opening, suggesting there may be sequels or a franchise (I can only speculate that the series would, if pursued, will follow the likely trend of drifting down hill). It does have some dialog that is pretty stock and uninspiring, but I can't really downgrade my rating based solely on that.\n\nWith all the Hollywood adaptions of popular themes (Transformers, Terminator, X-Men, etc), they could have done far worse with this movie than they did.\n\nYou can't please the fans, they will always find something to complain about (I'm a \"Street Fighter\" fan and I could have found lots to bash), so I take a step back and review it if I were going into this movie without a clue about \"Street Fighter\", and the result is, while not perfect, it's not a bad flick. I'll end this by saying, watch this with an open mind and average expectations and you will find an enjoyable 97mins."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "A Decent Martial Arts Revenge Actioneer (Unrated Version)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "jhpstrydom",
        "review_rating": "7",
        "review_title": "Truly not the best but not the worst either.",
        "review_detailed_main": "STREET FIGHTER: THE LEGEND OF CHUN LI starts with a young Chun Li whose father gets kidnapped by M. Bison and Barog, years later Chun LI is all grown up and sets out on a journey to bangkok to find a warrior named Gen who will show her a way to defeat Bison and get her father back.\n\nThis game to film adaptation is directed Andrej Bartowiak, whose credits includes more superior fare such as ROMEO MUST DIE, EXIT WOUNDS, CRADLE 2 THE GRAVE and the game to film adaptation of DOOM, although this film is not the director's best work but it is far from being the worst movie ever made, this adaptation is mostly reinvented, the characters are portrayed differently such as Vega who in the game wears a mask to protect his looks, in this film he wears a mask to hide his identity, none of the things that were attempted in this film were meant as bad intentions, it was a case of the filmmakers maybe wanting to give STREET FIGHTER fans something different, only it wasn't very well received.\n\nThe acting isn't all bad but not all good, seeing Chris Klein as Nash who is a cocky police detective, you kind of figure someone needed to tell him that he didn't need to make it so obvious that he was acting lame, Robin Shou who plays Gen is not a bad actor but here he's a bit wooden as if he didn't have much to work with, the rest of the cast did all right, but Chris Klein doesn't fit in with his role.\n\nOn the Positive side there are a few good fight scenes and a strong female lead, its truly not the best action film you'll find but at least it won't join the same list as the game to film disasters of Uwe Boll."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "miketaylor2007",
        "review_rating": "8",
        "review_title": "critics don't know a good movie when they see one!",
        "review_detailed_main": "This was a good movie I don't understand why people are hating on it so much. Just don't watch it expecting it to be the standard Street Fighter plot because it's not. This movie is not about entering a tournament and competing against other fighters instead it just focuses on the character Chun-Li's story. Rather then being a fighting movie it struck me as more of an action film. The cast was great and perfect for each character they played. Sure there was some fighting in there it could have had a little more fighting scenes but other then that I really enjoyed it. The explosions and gun fire makes up for the lack of choreography even though there is a few decent fighting scenes anyways. From the way they ended this it looks like they are going to make a sequel and if that happens id definitely pay to see it. At least they aren't painting the same picture over and over again because the standard fight in a tournament film has been done too many times and it's good when they throw some action into the mix like they did here. I gave this one an 8/10 because I really enjoyed it."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "fusion31003",
        "review_rating": "6",
        "review_title": "entertaining movie",
        "review_detailed_main": "I don't personally care if a movie follows a comic or a video game accurately. I don't play games or read comics so others might have different opinions. I really liked street fighter: the legend of Chun-Li. It was better than i thought it would be and it had a lot of action. I recommend seeing it if your looking for an entertaining action movie with some cool martial arts. I liked the characters and thought it was better than the van-damn version. It was a good movie. I thought it was cool how they controlled energy and showed a little power. I also liked how cops were involved. I don't think it was bad that they used the actors they did."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "empreslyni99",
        "review_rating": "8",
        "review_title": "Good and Bad are so wonderfully blurred",
        "review_detailed_main": "I think you should give this movie a chance if you're unsure.\n\nI liked this movie for the horrible acting by Chris Klein you can't help and laugh at everything he says and does. However his horrible acting made everyone else look good comparably! I thought Kristin Kreuk was adorable, Robin Shou was totally believable (after all he was in the mortal combat movies), and Neal McDonough makes such a great bad guy. I recommend this movie to people who know how to find the good in bad movies and how to love the bad parts equally.\n\nI would have loved to see what happened next but I have a feeling they won't make a second one."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "EchoMaRinE",
        "review_rating": "7",
        "review_title": "better than most of the game to movie adaptations",
        "review_detailed_main": "I read some of the comments and I must say I don't agree that the movie is bad. After watching so many ultra bad adaptations of games to movies, I didn't feel bad about this movie at all. I am not saying this is a master piece or something like that but come on, it deserves much better than 3.9. I guess they failed with the marketing. Otherwise, there was no substantial problem. Some people still couldn't understand how to evaluate a movie. This is a game adaptation. Characters were good, plot was OK (except these police guys that didn't have any influence on the story), directing was quite good and the overall performance was better than average. Chun-Li fights exactly the way it was shown, some of the street fighter characters were there and most importantly they at least stick to the general plot of the game. If you remember Max Payne for example, the movie had nothing to do with the game, yet it was never evaluated as harsh as this one. I am giving a 7 because the movie deserves a 7 from my point of view. If you don't know anything about Street Fighter, the plot may look strange. But apart from that, if you ever played the game, you are likely to enjoy the movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "pbouri",
        "review_rating": "10",
        "review_title": "Best Street Fighter Movie ever",
        "review_detailed_main": "Honestly, what is there not to love in this Street Fighter movie.... Kristin Kreuk.... Chris Kline.... Moon Bloodgood.... It is the best comedy I have seen in a long time.\n\nChun-li is a fragile little dumpling that somehow becomes strong enough to destroy Bison. The most priceless thing is how Chris Klein walks around posing and squinting half the time and trying to act sexy, and always giving zoolander Blue Steel looks. It's hilarious. The conversation between him and Moon bloodgood is also so funny. They try to turn each other on, but it's like watching a bad 90's sitcom. This movie is the perfect combination of pathetic and failed franchize all in one....but Kristin Kreuk is good to look at ....especially when she is dancing in the club and trying to trap the lesbian 50year-old crime boss. I can't...this movie is too good!\n\nOh...and did I mention Robin Shou's bad make-up to make him look older? He looks like an old man had too much plastic surgery.\n\nWatch the movie and have an amazing time :)"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "TheHande",
        "review_rating": "7",
        "review_title": "Admirable effort",
        "review_detailed_main": "The Legend of Chun Li takes a vastly different approach to the Street Fighter franchise compared to the 1994 film. It focuses more on a single character and tries to depict her as well as her adversaries as interesting characters with history. The effort is admirable though doesn't work perhaps completely all the way through.\n\nAfter a fairly strong beginning the second act of the film deteriorates a little bit. The section following Chun Li's life in Bangkok suffers from some shotty editing and skipping between unrelated events. The feeling of a coherent transition is lost because of this. The film also makes the faux pas of redundant flashback usage in a 90 minute film.\n\nHowever, the effort seen in the dialogue scenes of the film's shows that this is clearly trying to be different from most other video game movies. Sadly the Doom-director's natural ability for action-scenes doesn't lend much here and a few of the scenes feel sobby and forced. But at least the film made the effort.\n\nOver-all the actor performances for the more recognisable characters are all solid and only Charlie stands out as being a clichéd character-type. The action-scenes look excellent and if the dialogue scenes were a little bit more involved then the movie would certainly earn praise.\n\nEven as it is, the film is good and worth a watch, but I personally always preferred the entertainment value of the 1994 film more."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "gtiff-97360",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "This was a great movie and who underrates it?? If only it hit the theaters... I've watched this movie so many times that I actually have to buy another dvd of it cause the other was scratched. Kristin is always such a great character in every movie and my fave."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "cptncaveman",
        "review_rating": "6",
        "review_title": "Its not a bad film, just a bad conversion",
        "review_detailed_main": "Being a film lover, and even being able to enjoy watching even a good B movie, I rate this as a better than average game conversion movie.\n\nIt has a nice budget, plenty of action, a story than generally makes sense, some fairly well known faces and even starts off fairly promising.\n\nThe main rub is that it tries to make the film appear almost every-day believable, which just doesn't work with it also trying to be a totally fictional game conversion where there are special powers all over the place.\n\nToning down certain abilities, and omitting characters from the game will always upset hardcore gaming fans, which is a shame as the film really isn't all that bad.\n\nMy biggest bug-bear is the directing. If you are going to do an action movie then pick an action director and style it that way, but if you are going to try and throw in romance, military and martial arts as well then at least pick a director who has a familiarity with those genres.\n\nWhat you get here is a film that works in places but fails in others, because the director has no idea of how to shoot scenes with police or the armed forces and yet insist on including them in the plot. Mistake!"
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "BatsyCharky",
        "review_rating": "10",
        "review_title": "Impressive",
        "review_detailed_main": "I heard a lot of bad reviews but I honestly think that this movie doesn't deserve it. Chun-Li was always my favourite character and to see a film just of her was so entertaining. I watched it when it first came out and I'm watching it again. It's better now. And Vega and Chun-Li always had bad blood. It's fun to watch them fight."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "svetiev_b",
        "review_rating": "6",
        "review_title": "Hmmmmm ... completely brainless, but... judge for your selves",
        "review_detailed_main": "The plot and the dialogs are idiotic and I can not stress this enough, they are really moronic. However the action sequences are entertaining and the lead actresses are good looking.\n\nSo if you are able to completely switch off your brain for an hour and a half, you just might get some mild entertainment from this action flick.\n\nOther than that, there isn't much else to say about this movie, they fight, but the fights have no meaning for the story, some of the characters don't develop at all and others develop in an irrational way. The movie has no real point other than to obviously jump start a series, but honestly with such a lame start I can't see how it would do that.\n\nIt's sort of like \"Knight Rider\" the start of the new series, only much worse."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Hardryv",
        "review_rating": "6",
        "review_title": "Simply better than a '3.9'",
        "review_detailed_main": "I was rather shocked to see a 3.9 for this title. When I reviewed the voting record the truth was revealed -- about 1/4 of the people that bothered to rate the film rated it a '1'. Some angry / jealous Virtua-Fighter fans maybe...? A movie would have to be truly horrible to garner a 1 from me, not just have a 'score I disagreed with that needed lowering' as many dishonest IMDb idiots appear to vote at times.\n\nOf course it wasn't a 'great' movie, and in fact seems best suited for people that are either huge fans of Kristen Kruek (KK) and / or Street Fighter. I liked it well enough to post a '6', but admittedly I'm a big KK fan from her Smallville work.\n\nThe flow was good, and it was cast well all around -- as well as can be expected for a movie cast from a video game with virtually .no. plot to it. Arguably KK doesn't have the quads to play a live-action version of Chun-Li, but in my eyes her very decent acting made up for that.\n\nThe plot had some unexpected happiness within it also and that became what I cherished most about it."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "lilmike991",
        "review_rating": "6",
        "review_title": "it was OK? okish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "PWNYCNY",
        "review_rating": "6",
        "review_title": "It's about The Angry White Man",
        "review_detailed_main": "This movie should have been entitled \"The Angry White Man\" because the main character is a nasty white man who is angry and is determined to act out his nastiness in Bangkok, Thailand, which far from appearing exotic, looked a lot like a combination of downtown Los Angeles and midtown New York City. The other characters serve peripheral roles and, with the exception of Michael Clarke Duncan who plays Mr. Bison's henchman, all of them are quite unspectacular, some being outright ludicrous. The young lady playing the street fighter is utterly miscast and her mentor-friend is equally out of place in this otherwise interesting if not overly impressive movie. The movie does have its good moments but only when Mr. Bison or Mr. Duncan are in the scene. Mr. Bison is the only character which is developed in the movie, the others being mere caricatures of good guys or bad guys. A good performance is given by Mr. Duncan who could have played the lead villain too. Mr. Duncan deserves kudos for his performance."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Seth_Rogue_One",
        "review_rating": "6",
        "review_title": "It's not really as awful as the rating would suggest",
        "review_detailed_main": "No, it's not amazing and no the story is not an emotional journey that makes you both laugh and cry... but.\n\nIt's a video-game adaption, and you really can't go in to them thinking they are gonna blow your socks off because really, most of them aren't that great.\n\nThe 1994 Jean Claude Van Damme adaption was genuinely awful and that was pretty true to the (no) plot of the video-game so of course they had to do something different here, which I am glad they did, not just fighting all the time but an actual story.\n\nNow of course the story does have a bunch of plot holes (but honestly what video-game adaption that doesn't?) and Chris Klein's acting in particular is pretty dodgy, he plays a tough guy cop which he tried to do again in CAUGHT IN THE CROSSFIRE (2012) but he fails every time.\n\nI like him fine usually but yeah he's not at all believable as a 'bad ass'.\n\nBetter is Kristin Kreuk in the lead and Michael Clarke Duncan and Neal McDonough are pretty cool as the bad guys.\n\nAnd most of the fight-scenes are pretty well orchestrated (except perhaps the dance-club scene) and the cinematography is good and keeps at a good pace plus a pretty good soundtrack as well.\n\nAll in all, not a 'great film' but perfectly watchable if you leave your thinking cap on the shelves and just take it for what it is, if you enjoyed ELEKTRA (2005) you should be able to enjoy this... If you didn't (which granted many didn't) then tread carefully I suppose."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mrdonleone",
        "review_rating": "7",
        "review_title": "No ethical background but great movie",
        "review_detailed_main": "This is really nice movie it has all the right ingredients with fighters and all this kind of things and it's definitely interesting enough so why the low points are definitely wouldn't know and all these things are definitely great but it can be said this movie unfortunately does not have the right ethical background."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "kbarnett-45912",
        "review_rating": "7",
        "review_title": "I Enjoyed it.",
        "review_detailed_main": "Great fight scene's, acting was good. English was great. I enjoyed the movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "andre-71",
        "review_rating": "6",
        "review_title": "entertaining and not bad",
        "review_detailed_main": "I do not know the video game, nor have I seen other Street Fighter movies. Obviously, I watched this without a bias. And I thought it was entertaining. The female lead character came across convincingly, so did the villain. In fact, the villain was one of the most engrossing I have seen in a while. I could also enjoy the support characters, they all seemed in tune with the film. The martial arts were not the most impressive I have seen but they were appropriate for an eastern movie. At no point in time did it bother me. I suspect the movie's main issue is it's name which rises expectaions beyond any limit. What a pity in this case."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "Marcus_Flavius",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "A little silly at times, especially in scenes with the Chris Kline. He is a stooge. But Kristen is the most perfect little hottie in my lifetime, so to me, it's worth watching. Also the fight scenes are choreographed well for this type of movie."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "aliyjam",
        "review_rating": "7",
        "review_title": "just ignore bad comments and enjoy the movie",
        "review_detailed_main": "People who do trash talk about the movie are probably video game geeks and big fans of Van Damme's crap Street Fighter stuff. First, this is an origin story of a character so put that in mind. Second it is not a Street Fighter movie so don't expect to see something like Mortal Kombat with a bloody tournament. It is a good written action move which includes the taste of Street Fighter elements. The Movie has a story which is kinda true about Chun Li at some point. Just give it a try and, it is not absolutely perfect but it is not really that bad. In my opinion, it is very good movie to enjoy the night."
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "mergatroid-1",
        "review_rating": "6",
        "review_title": "Very entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "dylan-ht-informal",
        "review_rating": "",
        "review_title": "A few good fights and a terrible plot. Typical, really.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "filmnut1",
        "review_rating": "",
        "review_title": "Perhaps a better title would have been Chun-Li Begins",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0891592",
        "movie_name": "Street Fighter: The Legend of Chun-Li",
        "movie_rating": "3.7",
        "review_username": "rustyxbox",
        "review_rating": "",
        "review_title": "The Story of Street Fighter: The Legend of Chun-Li (Part One)",
        "review_detailed_main": ""
    }
]