[
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "utgard14",
        "review_rating": "3",
        "review_title": "Stinks",
        "review_detailed_main": "Garbage superhero movie based on the Superman spin-off character, Steel. One of the all-time bad comic book movies. Shaquille O'Neal is terrible, delivering lines like he's reading a menu. The armor his character wears is ludicrous and cheap. His sidekick is a woman in a wheelchair named Sparky, played by Annabeth Gish. Poor Annabeth tries but the material she's given is dreadful. Judd Nelson gives a self-consciously bad performance as the villain Burke. He knows he's in trash and doesn't even try to make the material work. In many scenes he's clearly suppressing laughter at the terrible lines he's given. It may not be professional behavior but I can hardly blame the guy. Collect that paycheck, Bender. Despite taking place in 1997, the police are driving cars that look like they're from the early '80s. Just another sign of the shoddy production, I guess. The whole thing looks cheap like it was produced by the dollar store. I suppose there is some unintended comic value of the \"so bad it's good\" variety. But mostly it just stinks."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "dee.reid",
        "review_rating": "4",
        "review_title": "It's good for a rainy day, I'd say...",
        "review_detailed_main": "With all this madness about superheroes going on right now (\"The Avengers\" just opened today), I decided to go back in time to 1997, to the poorly received box office flop \"Steel.\" I was 12 back in 1997, but I have to admit that I liked \"Steel\" then (I also liked the big-budget adaptation of another favorite superhero of mine, \"Spawn\").\n\n15 years later, a lot has changed. For one, I've grown up. I now realize that \"Steel\" is not a very good movie. I remember around that time, my cousin saw \"Steel\" in the theaters and told us that it was not a very good movie. The critics and most sensible audience members seemed to agree.\n\nBut I digress; \"Steel\" is good for one thing and one thing only: a rainy day, like today. Since I'm not daring brave the over-crowded theaters for fear of being over-run by Avengers fan-boys (and fan-girls), I decided to pop in my 14-year-old VHS copy of \"Steel\" and relive 1997 like it was just 15 years ago (which, in fact, it was).\n\n\"Steel\" is the live-action adaptation of the second-tier DC Comics character co-created by Louise Simonson and Jon Bogdanove, with NBA star Shaquille O'Neal playing the titular steel-armored, non-super-powered superhero whose real name is John Henry Irons in his civilian identity.\n\nI'm not really a fan of the movie anymore (most readers will remember that I'm largely a Marvel Comics reader), but I find the history of the original comic book character to be quite fascinating: as yet another proud, positive black-American superhero in comics, John Henry Irons is a brilliant former weapons designer for a private arms-manufacturing company whose life is saved, both literally and metaphorically, by the mighty Man of Steel himself, Superman. Ironically, a later incident with the powerful super-villain Doomsday costs Superman his life, and Irons's life is changed forever when he decides to don a powered suit of armor of his own making - much like Marvel Comics' Tony Stark/Iron Man - and fight crime himself as Steel (with Superman's logo blazoned mightily on his chest as a reminder of his inspiration) and wielding a powerful sledgehammer, too.\n\nThe 1997 live-action adaptation removes any mention of Superman (or his apparent death), except for a tattoo O'Neal has on his arm, and goes forward with its own origin story. Certain aspects of the movie are faithful to the comics, but the rest of it is pretty campy and just bloody awful. This time out, Irons is a weapons designer for the U.S. Army and when an ambitious rival, Nathaniel Burke (Judd Nelson), is involved in an accident that kills a U.S. senator and leaves his best friend Susan \"Sparky\" Sparks (Annabeth Gish) a paraplegic, Irons resigns from the military in disgust.\n\nIrons (whose name is reportedly inspired by the legendary black-American folk hero John Henry) returns to his home in Los Angeles, only to discover that street gangs are out committing brazen bank robberies using the exact same, albeit heavily modified, weapons he designed. With Sparky and Uncle Joe (Richard Roundtree) by his side, Irons dons a custom-made suit of armor as the armored superhero Steel. As he dives deeper into his investigation, he discovers that his old rival Nathaniel Burke (who has since recruited young neighborhood street kids to do his bidding) is behind the robberies and the deadly new weapons out on the street.\n\n\"Steel\" is pretty cheesy and campy, and I don't mean that in a good way.\n\nUnlike most people, I don't think Shaquille O'Neal is that lousy an actor. I think that if he were given the right material, he would manage out OK. At least here, I think he seems perfect for the part of John Henry Irons/Steel; it's just a shame that the rest of the movie, as written and directed by Kenneth Johnson (\"V\"), is just not very good. In other words, Shaq just needed a better movie. The special effects, the hokey street dialogue, and the performances don't help matters much either. Richard Roundtree and Irma P. Hall do what they can, but aren't given a whole lot to do beyond offering elder-generation advice to the younger folks. Judd Nelson relishes his role as a stereotypical villain, but it's really Annabeth Gish as the physically handicapped yet resilient gadgeteer Susan Sparks who really seems to shine the most in what could have been a very limiting part.\n\nI sense that a remake/reboot is, or soon probably will be, in the works sometime in the near future, and that is one \"Steel\" I just \"may\" (italicized) fork over $7.50 at my local movie theater to see. Until then, \"Steel\" will continue to mightily serve its purpose for rainy days (and some late-'90s nostalgia)...\n\n4/10"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Jojosh the Pi",
        "review_rating": "3",
        "review_title": "good movies have good dialogue",
        "review_detailed_main": "This movie could have been lifted out of the doldrums with decent dialogue. Shaq was much better this time around (as opposed to \"Kazaam\", although that's not saying much). Burke's \"wisdom\" to his gang member is absolutely laughable, and especially don't miss Shaq's awful \"cool, just like you\" at the beginning.\n\nSteel did some things right; some parts they tried to make funny were genuinely funny, and the plot was pretty interesting. However, the parts where you \"laugh with\" the scriptwriter are pale in comparision to those where you \"laugh at\" the scriptwriter.\n\nIn summation...you need to see this movie."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "miguelsanchez69",
        "review_rating": "5",
        "review_title": "so bad it's good",
        "review_detailed_main": "This is a B-movie classic. The special effects are awful and the acting is worse, but at least it's not boring. As a cinematic experience, it's below par, but as entertainment it's top notch. It's basically like a B-movie, unintentionally hysterical version of Superman (which makes sense, since apparently Steel is based on a DC comic series which was an offshoot of the Superman Funeral for a friend storyline) , except Steel's only discernible superpowers are: being tall, having a metal suit that makes him walk slowly, and uttering unfunny catch phrases that are so bad you have to bust out laughing. This movie is probably the funniest thing I've seen all year. Of course, it's not intended to be funny most of the time when it is.\n\nWatching Shaq \"act\" is the highlight of the film. I fell out of my chair laughing every time he said something. Shaq's still a better actor than Hulk Hogan though, not that that's saying much. They should give Shaq more movies. Hulk Hogan made a dozen or more, and they were all awful, why not Shaq?\n\nThe special effects look like they were made in the 1980s. Bad miniatures and Superman-esque laser effects look pretty silly in this day and age. This adds to the fun factor of the movie though since you'll probably scream \"Dear Lord that laser is the same miniature they used in Godzilla in the 60s!\".\n\nThe plot to the movie isn't horrible, even though it's pretty thin. Basically Steel is a superhero with a secret identity out to save the world from an evil supervillain. Pretty standard superhero fare.\n\nThis movie has earned its place in my heart alongside other bad movie classics like \"cool as ice\" starring vanilla ice. A must-see for bad movie buffs. Some folks who like superhero films might like it too since it's mildly diverting and quick-paced. Those who relish quality cinematic experiences should avoid."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "The_Movie_Cat",
        "review_rating": "5",
        "review_title": "\"Well, I'll be dipped in s*** and rolled in breadcrumbs\"",
        "review_detailed_main": "Steel is one of those films where you constantly have to keep telling yourself \"this is NOT a TV movie\". A cheap, outrageously bad superhero vehicle for the acting... er... talents?... of 7'1 basketball player Shaquille O'Neal.\n\nCommendably, the film does actually have three clear acts, and Steel's emergence, though underplayed, doesn't happen for over forty minutes. In-jokes are a-plenty, as it mentions Batman, Superman, Jerry Maguire (\"show me the money!\") and three instances of John Irons (O'Neal) having to net basketballs. The final time sees a life-threatening toss of a grenade. A lousy basketball player throughout, Shaq gets to quip \"I never make these\". Or would you prefer Richard Roundtree as Uncle Joe, who designs Steel's hammer for him? \"I did the metalwork,\" he explains, \"I especially like the shaft.\" Cue lots of double-takes and knowing glances, with Roundtree looking round, hands in the air, proclaiming \"what?\"\n\nThe special effects are reasonable for tv movie land, but, as this is (pinch me, I must be imagining it) a real cinema movie, they're quite cheap. Steel is badly written, contains atrocious dialogue, is poorly acted, shabbily directed and with an overbearing, repetitive musical score. It is, of course, tremendously entertaining."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Rammstein-2",
        "review_rating": "1",
        "review_title": "I don't know whether to laugh or cry",
        "review_detailed_main": "Oh man, I don't believe this. Perhaps with the exception of \"Barb Wire\", I don't think I have watched anything that comes anywhere near this. When I come to think of it, \"Barb Wire\" is actually better than this, because I could laugh while watching it. This film is so bad it reaches a certain quality of lousiness only reserved for the very worst of bad ideas. I mean - Shaquille O'Niell in a steel suit with a super weapon made from the contents of a lost-and-found at the scrap yard? Please!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "btapplegate",
        "review_rating": "1",
        "review_title": "Sure, the acting is bad",
        "review_detailed_main": "Sure, the acting is bad, the special effects are amaturish, the direction incompetent, the story sadly changed from the comic book, and the screenwriting lame, lame, lame, but the casting is interesting in a drug induced sort of way. I was hoping that this would be one of those \"it's so bad, it's funny\" movies\", but it was just bad. Please don't watch this fiasco, it will just steal precious moments from your life you can never get back. I beg of you, your brain cells beg of you, just say no. Shaquille O'Neil should be legally barred from acting. Annabeth Gish should be ashamed, Judd Nelson couldn't possibly sink any lower, and poor Richard Roundtree, how the mighty have fallen. I hope the next time I see Shaft, I don't remember seeing this waste of time."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Robert_duder",
        "review_rating": "",
        "review_title": "A lesson in swallowing reality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Ian_Maitland",
        "review_rating": "5",
        "review_title": "Loved it",
        "review_detailed_main": "Charmingly terrible but fun. I don't know if this is a pro or con, but at no point do you forget that you are watching Shaq. Con is you can't forget about the actor and enjoy the character. Pro is shaq is hilarious and charming. Generally fun. May as well give it a shot."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "BENARES-2",
        "review_rating": "1",
        "review_title": "I've seen Steel and I'll never recover.",
        "review_detailed_main": "I've never seen a movie as bad as this one. A few come close, but none have the power to topple \"Steel\". First off, when are people going to realize most athletes can't act, ESPECIALLY Shaq?? The effects are not-so-special, and are in fact quite terrible, which is ironic because so is the plot, the acting, and generally everything else in this so-called movie (read : vehicle to make some money off Shaq's name). I think the director and producer deliberately wanted to insult the audience with this tremendous piece of crap."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "lemon_magic",
        "review_rating": "2",
        "review_title": "Complete waste of a decent premise and a potentially strong character",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "vbites",
        "review_rating": "10",
        "review_title": "Fun movie",
        "review_detailed_main": "I actually liked this movie (as did my kids). Surprised by the vitriolic reviews. I found Steel to be a campy, playful movie. Nobody took themselves seriously and just had fun with it. The kids loved Shaq....found him a big, endearing sweet guy. I guess if you were expecting a pricey high tech, serious super hero movie, you'd be disappointed. This is a warm hearted superhero spoof. Lighten up and enjoy!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "bellino-angelo2014",
        "review_rating": "7",
        "review_title": "This movie doesn't deserve to be in the Bottom 100 at all",
        "review_detailed_main": "STEEL is for almost everyone a dreadful movie. On IMDB it has a score of 2,8 and few months ago, when it reached 10,000 ratings, it ended in the Bottom 100 (the list of the 100 lowest rated major releases according to users' ratings). Unfortunately, I am not the typical viewer, since when I saw it when it was 32 ratings shy I gave it a try, but I didn't ended up hating the movie. In reverse, I ended up enjoying it very much and I personally couldn't believe all the hate that surrounded this movie for years.\n\nThe movie begins with John Henry Irons (Shaquille O'Neal) that is in the Army and he is trying a super-powerful cannon. A fellow serviceman, Nathaniel Burke (Judd Nelson) set the cannon at the maximum power and there is a horrible accident that destroys a entire building and cripples Irons' friend Sparky (Annabeth Gish). Nathaniel is of course expelled from the Army and Irons returns home to his grandma.\n\nLater there is a street gang that robs a bank using the weapons with Burke and Irons' technology. Irons realizes that Burke is dealing with all the weapons smugglers and dealers for letting people using his dangerous weapons everywhere. So it's up to Irons, Sparky and Uncle Joe (Richard Roundtree) to stop Burke. And so Irons creates a steel (for some looks like made of rubber) suit and a huge hammer/weapon and goes out at night to fight crime and, as everyone would expect, he succedds in defeating Burke.\n\nSo why I didn't hated the movie? Well, the plot in my opinion gives a message like ''don't never give up in defeating your enemy, because the day of revenge will come sooner or later''. And I found the soundtrack pretty cool since it gives a nice and nostalgic 90s feel. Despite Shaquille O'Neal is a bit one-note in his performance (and he was even nominated for a Razzie for Worst Actor the following year) and he looks like the largest sardine can ever made with that steel suit, I have to admit it, he was much better than in KAZAAM (his other leading man movie). About the only thing I would agree with most of the reviewers is that the special effects look a bit dated even for 1997 standards, but at the end, for me it wasn't a problem. If this movie would have been made with the same budget of movies like THE AVENGERS or IRON MAN then I would have hated it, but since the budget wasn't that huge the movie was adequate.\n\nDon't be afraid to buck conventional wisdom, because I think that there are some that might enjoy this movie just like I did, and trust me, there are much WORSE movies out there!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "adam b",
        "review_rating": "2",
        "review_title": "When good ideas go bad",
        "review_detailed_main": "If you're like me, you're frustrated at how few comic book characters translate well to the big screen. The Punisher. Captain America. Now, we have Steel. And it's a shame. Steel is one of those characters that had enough depth and nobility as a character that it could have been pulled off without a huge budget. And that seemed to be the idea of this movie. So why is it so bad? Well, for starters, Steel looks ridiculous. Why does the suit have to be made from junk-yard leftovers? He was in the military, so why couldn't he have swiped a cool-looking prototype? And where's the cape? Call me corny, but what gives the suit its majesty is that big, flowing red cape. No references to Superman, or the sense of awe and gratitude that inspired John Irons into becoming Steel. And the hammer as a gun? Puh-leeze. Still, this could have been a decent movie if the guy who wrote the plots had hired someone else to do the dialogue. Judd Nelson is a good villain, and Shaq might have been able to pull off a true hero had he not been reduced to one-liners and jive talk. Also, why is it that no one in Shaq's hood can figure out that the 7 foot tall Shaq is the 7 foot tall Steel? This movie is so self-conscious that the obvious noble aspirations just seem pitiful. Like most comic characters, Steel deserved much better writing (like that found in his comic)."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Patrick G. Smith",
        "review_rating": "",
        "review_title": "Romantic Comedy of the year!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "jay_042",
        "review_rating": "1",
        "review_title": "Worst. Comic. Book. Movie. Ever.",
        "review_detailed_main": "Batman and Robin, Catwoman, their awfulness pales in comparison to this turkey. Shaquille O'Neil wanted to be an actor and Hollywood was happy to enable his fantasy. Much like the terminally ill cancer child wanting to go to Disneyland, the gave Shaq a free ride through the studio. It's bad nobody told him to not to touch the equipment.\n\nWith TV movie production values (Kenneth Johnson just is not meant to work on the big screen), a ridiculous premise (yeah sure, Shaq designed these highly advanced weapon systems), and a cast that found themselves literally overshadowed by the star of the film (you have to feel sorry for Richard \"Shaft\" Roundtree) it's amazing the movie ever saw the light of day. I notice that even today the movie has not made it's way onto DVD, and maybe that is for the best."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "korch-3",
        "review_rating": "1",
        "review_title": "DC Comics worst nightmare. This definitely isn't your father's Superman!",
        "review_detailed_main": "Several years ago, DC Comics killed Superman. Four characters leapt to the forefront and claimed to be the fallen Superman. Steel was one of these characters and he showed great potential.\n\nThen a movie was made bearing the same name. The movie sounded good in theory and it showed much potential. Then someone casted Shaq and the rest was history. Other bad choices were made like casting Judd Nelson. On top of all that a director was chosen.... not Oliver Stone, not even Tim Burton, but Kenneth Johnson. Kenneth who? The same Kenneth Johnson who did \"V\", \"Alien Nation\" and \"The Incredible Hulk\". It is no wonder the Hiroshima of cinema was created. This movie is the exact opposite of what a good movie should be. Bad acting, bad script, bad directing. This movie became something that would have made Ed Wood proud. The rest of us on the other hand should forget this movie was ever made. I know it is hard, but try...... please try to forget."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "cardsrock",
        "review_rating": "2",
        "review_title": "Why Shaq Daddy, why?",
        "review_detailed_main": "I wish this was in the category of \"so bad it's good,\" but unfortunately it's just plain bad. It's like the worst, cheesiest TV movie you could imagine. The acting is atrocious, the writing awful, and the whole production a travesty. Shaq is charismatic, but severely limited in his acting abilities. If you have the opportunity to watch this, don't."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "planktonrules",
        "review_rating": "4",
        "review_title": "Sort of like \"Iron Man\" meets \"Sanford and Son\".",
        "review_detailed_main": "\"Steel\" is, by accounts, a bad movie. It's IMDB score is currently an appalling 2.8 and it was on IMDB's infamous Bottom 100 List until recently. Why is it no longer on the list? Well, the new standards say that a movie must have 10,000 votes to be eligible for this list of worst-rated films...and \"Steel\" is 103 votes shy...meaning it may just be on the list in the near future if it can get more votes....and would rest about #22 on the list. And, incidentally, Shaquille O'Neal was nominated for the worst actor Razzie for this performance. So why did I watch it? I have a weird passion...to see all 100 on the list...because many are simply hilarious and aren't intended to be! So is \"Steel\" as bad as its score would indicate? No. Now it is NOT a good film....but I can think of hundreds of worse movies. Certainly NOT a ringing endorsement!\n\nWhen the film begins, John Henry Irons (Shaquille O'Neal) is in the army and there is a test of a new super-weapon. The baddie in the film, Nathaniel Burke (Judd Nelson), did not listen to John's instructions and there's an awful accident. Nathaniel is rightfully tossed from the service and John quits because he wants to work on weapons that neutralize the enemy...not kill them.\n\nSkip ahead a bit of time and suddenly an LA gang is using a weapon based on the technology that John and Nathaniel developed. John realized that Nathaniel must have gone evil and is about to make a killing selling these dangerous weapons to the highest bidders. So, it's up to John to create his own super tools--with not only a high powered neutralizing gun but a steel suit to protect him from Nathaniel's evil weapons.\n\nSo is it terrible? No. It's not good...but not terrible. O'Neal is a bit wooden, I admit it, but he also is pretty cute in his scenes with his grandma....and I think the film would have been better with more of these sorts of scenes. The plot is a bit silly and in many ways, the film comes off like merging \"Iron Man\" (with O'Neal being a brilliant inventor and superhero like Tony Stark) and \"Sanford and Son\", as John's hideout is in a junk yard and his costume, in part, is made from junk. The bottom line is that the film isn't much fun BUT it didn't seem awful or painful to watch...which disappointed me because I was hoping the film would totally embarrass O'Neal."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Marthian80",
        "review_rating": "1",
        "review_title": "Should have been an actual parody, but there are still enough laughs in it",
        "review_detailed_main": "I thought we had hit rock bottom with Batman & Robin in '97 regarding comic-book movie adaptions, but then I discovered this amazing production that takes it even further, oh boy..\n\nThe story starts with our main action hero John Henry Irons (played by professional basketball player Shaquille O'Neal) who is in the army creating and testing new super-weapons. One soldier named Nathaniel Burke (Judd Nelson) for some reason decides to set a weapon to maximum when John's team is testing a new sonic gun, which blows up the building the team is in. The building collapses which cripples John's partner Susan \"Sparky\" Sparks (Annabeth Gish). John doesn't like that and leaves the army as does Burke who is dismissed from the military for doing stupid things like blowing up buildings he is standing in... While John goes back to LA and takes a shot at a three-pointer (which he misses, isn't that hilarious?!? An actor who is a professional basketball player misses a shot? Well wait till you see the other basketball jokes...!), the evil Burke teams up with a video arcade manager (???) to hatch a plot to sell the not-so-secret high-tech weapons to criminal gangs. John witnesses a bank robbery organized by over the top acting gangsters wielding the high-tech weapons he helped designing. Because he is unarmed, he decides to chase one gang member armed with a high tech gun who makes a run for it, because you don't just shoot down John! After going unarmed to the not-so-secret hide- out of the over the top acting gangsters and not getting any information, John decides that enough is enough. He goes to get Sparky Susan, who is very depressed being wheelchair-bound but is instantly happy by just opening some windows, get's her to work for him and with the help of Uncle Joe (?? who?), in-explainable technology and some lame 80's music he forges a suit of armor and bring Justice to the city, HA!\n\nLet me start that there is absolutely nothing in this movie that can be defined as \"good\". The acting is extremely bad, not only is our main hero a lame actor but the rest of the cast is also not really going for any awards here. The special effects look awful, those super-weapon look like cheap firework and the Steel suit is comparable to what you could wear to a larp event. How the suit operates is never explained, magic I guess? Shaquille also looks really silly in this costume, I almost fell off my couch from laughter when he waves his finger at the gangsters when they try to shoot him. The plot is behind stupid as well and it makes no sense whatsoever. The main villain want to lease weapons because he is the only one where they can charge up the guns? Why don't they just shoot him and take the guns for free?\n\nYou can ask yourself that question a thousand time during this movie: \"why don't just shoot him/her!?\". Especially when John goes chasing an armed gangster unarmed and when Sparky Susan fires off her wheelchair guns... Oh my goodness that was another moment when I couldn't stop laughing. I never laugh at people in wheelchairs but this looked so ridiculous that I just couldn't help myself. Ow and don't get me started on the basketball puns, I completely lost it and had tears in my eyes from laughter during the final act when he has to throw a grenade trough a hole. \"I never make these!\". Ow make it stop!\n\nSteel is an awful movie but it's so bad that you should watch it for the laughs. If they hired some comedy actors and marketed this as a parody, it could have worked though."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "capone666",
        "review_rating": "3",
        "review_title": "The Vidiot Reviews",
        "review_detailed_main": "Steel\n\nWearing a suit made out of steel sounds amazing. Moving around in a suit made of steel sounds impossible.\n\nFortunately, the 7-foot tall vigilante in this action movie has the strength to manipulate his metal pants.\n\nWhen a weapon he designed for the army causes an accident that cripples his friend, Sparky (Annabeth Gish), John Henry Irons (Shaquille O'Neal) retires.\n\nWith Irons gone, a duplicitous army officer, Nathaniel Burke (Judd Nelson), begins selling Irons' lethal inventions to the criminal underworld.\n\nWhen Irons' gets wind of this, he recruits a now wheelchair bound Sparky and Uncle Joe (Richard Roundtree), to help him wage war against Burke and his cronies in an impenetrable armoured suit.\n\nBased on the DC Comics character inspired by Superman, Steel's armour has many chinks: namely Shaq's acting abilities and its insufferable script.\n\nSadly, when this African American hero arrives, old white women still think he's the villain.\n\nRed Light\n\nvidiotreviews.blogspot.ca"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "rocky_howard",
        "review_rating": "3",
        "review_title": "This movie is bad, but bad becomes good if Shaq is in it!!",
        "review_detailed_main": "The movie is pretty bad if we go by film standards and conventions but you can enjoy it as a light, not-to-be-taken-too-seriously kinda movie.\n\nSteel doesn't have any relation to Superman in this movie, except for the S-sign tattoo that Shaq has on his arm (which leads me to believe it was one of the reasons for him to be cast as Steel)\n\nSteel is your typical run-of-the-mill superhero movie. John Henry Irons is a pretty clever man who creates harmless armament that just disable instead of killing or harming. His creations are used for other purposes . He fights back while teaching his little brother a moral lesson and getting the girl in the end.\n\nBy the way, don't pay attention to the previous comment because the author doesn'tknow what he's talking about.\n\nHe says \"Steel, unlike Batman, has no powers but use gadgetry\" when it's a VERY WELL KNOWN FACT that Batman doesn't have powers neither and he relies on gadgetry too..."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "GeneralMcHonkadonk",
        "review_rating": "9",
        "review_title": "Oh it's not that bad.",
        "review_detailed_main": "Well, it is. But it isn't worth a 2.7/10!\n\nI shall get to the point. Steel is abominably written, poorly acted (with the exception of Richard Roundtree, who for some reason actually tries) and shabbily directed. Surely then, it is a bad film?\n\nWELL.\n\nI have just finished watching \"Now You See Me\", and it really helped me to understand that a film being objectively \"good\" or otherwise is not the same as it being an enjoyable experience. I can still watch Steel and even while laughing at it, can really get into it. Say what you will about its writing, the writer at least didn't get ahead of himself - didn't go writing some deep, intricate epic without any skill to back it up. Say what you will also (and please, I encourage this one) about Shaq's acting which, especially in the army scenes at the start of the film, is unstoppably dire. But he's never required to do something which puts the weight of the film on the subtleties in his performance (Shaquille O'Neal as Oskar Schindler?).\n\nI probably don't make myself very clear here but, simply put, if you take the film for what it is it's still possible to enjoy it. It's functional, if nothing more, which is not something I would say happily about \"Now You See Me\". I also love the theme tune that's pretty much just the latter half of the 20th century mashed into one big brassfest. At the end of the cliché, I had fun watching it and you can't tell me I didn't.\n\n\"Eat the hot-dog. Don't be one.\""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "ReelCheese",
        "review_rating": "6",
        "review_title": "Jumbo-Sized Hero",
        "review_detailed_main": "Let's get the worst facets of STEEL out of the way first. Yes, Shaquille O'Neal is a dreadful actor. Yes, he looks like the world's biggest sardine can in his Steel armor. Yes, the dialog is bargain basement. Yes, Judd Nelson makes for the worst comic book villain this side of Mark Hamill as The Trickster in THE FLASH television series. And yes, the film embarrasses itself even further by clumsily trying to deliver a we-must-stop-using-weapons-to-settle-our-differences message. Happy?\n\nSTEEL is not a masterpiece in any sense of the word, but that doesn't mean it should be completely written off. It's one of those pictures that requires you to set aside your pre-conceived notions about good film-making and just enjoy the ride. Do that, and STEEL is a surprisingly amusing little adventure. O'Neal is fun, if not unspectacular, as our jumbo-sized hero, a do-gooder vigilante cleanin' up the streets with a big ol' hammer and souped-up motorbike. He's aided by wheelchair-bound hottie Annabeth Gish and an aged Richard Roundtree as his off-the-wall Uncle Joe.\n\nOur hero's climactic showdown with the one-dimensionally evil Nelson is incredibly cheesy, as are many scenes, but the film has its heart so firmly in the right place you'll be more than a little lenient. As usual, what Shaq lacks in talent he makes up for in charm and a deep likability that seeps right through the screen.\n\nSTEEL is an uncomplicated film that seems custom-made for little boys, who will absolutely adore it. If you're in the right mood, you'll like it, too."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "MichaelMargetis",
        "review_rating": "1",
        "review_title": "Quite Possibly the Worst Movie Ever Made",
        "review_detailed_main": "Uncle Joe: Well dip me in sh__t and roll me in breadcrumbs.\n\nWithout question, 'Steel' is in the running for worst film ever made. However, it is a fun movie to watch to make fun of. You'll be laughing hysterically, but not as the filmmakers intended. Shaquille O'Neal's acting skills are kind of like Adolf Hitler's morals. They're seriously lacking. This movie does have some classic one liners like \"Y'all stay cool now.\" a line Shaq delivers to a couple of old people he returns a stolen purse to, and my personal favorite, \"Well, dip me in sh__t and roll me in breadcrumbs!\". I highly recommend 'Steel' if you need a good laugh. I think I laughed harder during this than I did during 'Borat'. Grade: F"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "One of the worst movies I've ever seen, and I've seen quite a few.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "brc_sjcc",
        "review_rating": "2",
        "review_title": "In my top 10 worst films list",
        "review_detailed_main": "It's astounding that this was made for theatrical release. There are very few movies out there which are worse than this one. It was too violent to really be a small childrens movie, but it had drama and dialog that couldn't interest anybody over five years of age. I couldn't give this movie a \"1\" because a few of the props were not made of cardboard. If you liked this movie, I recommend you also watch R.O.T.O.R. and seek professional help. Action: terrible, Script: horrible, Acting: pathetic, Effects: amazingly lame, Unintended Comedy Value: medium-high\n\nThis movie will be with me in my misery for a long time to come."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Bossk1",
        "review_rating": "1",
        "review_title": "This Steel is quite porous...",
        "review_detailed_main": "Wow, I feel dumber for even having seen a portion of this movie. Its been on HBO a lot lately, and unfortunately, I had the misfortune of glimpsing it. Shaq should be banned from the planet Earth for being in such a bad movie. Who was the genius who okayed this movie?? This is right up there in one of the worst films ever. A 2.8 user rating is WAY too high for a movie of this low calibur..."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "FlashCallahan",
        "review_rating": "4",
        "review_title": "I especially like the shaft........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "sgbdestroyer",
        "review_rating": "4",
        "review_title": "Another failure from Shaq",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "alexander3000",
        "review_rating": "2",
        "review_title": "what is 7'2 high and walks around in plain steal ?",
        "review_detailed_main": "this must be one of the worst movies i have ever seen and i have no idea why shaq took this part. there's nothing good to say about the film, its a lousy script, it has bad actors, the \"action scenes\" sucks big time and there's no more to say about this film, just that everything sucks."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "YellowJacketYJ",
        "review_rating": "1",
        "review_title": "I found Superman's kryptonite.",
        "review_detailed_main": "Steel is one of those movies that you hear how bad it is, but, in your mind, believe that it can't be that bad. This time, it is that bad. Steel is the equivalent of going to a PETA meeting wearing a fur coat with snakeskin boots, with deer blood dried onto your pants, while holding a platter of ham, chicken, turkey, and other \"animal cruelty\" foods in one hand, and a deer head in the other. To make it easier to understand, it feels out of place and doomed to fail (and possibly pelted with tomatoes).\n\nShaq, as the movie poster refers to him as, plays John Henry Irons, a weapons designer for the military. After a tragic accident occurs (not the board meeting to green-light this movie), Irons retires his position and returns to the safety of his home. Within a few days back, he takes notice that his dangerous guns are running amok in the streets, thanks to Nathaniel Burke, a former sergeant (I'm probably wrong about his position, but who cares) relieved from his position for attempted destruction (and no, he wasn't the man who green-lit this movie. Okay, I'll stop).\n\nI want to stop right there and delve into the stupidity that this situation is. I'm still laughing at the fact that, instead of criminal punishment via jail time, a man bent on human destruction is just released from his military duties. What the hell?!? Did they honestly think he wasn't going to cause destruction once he got home? What if they did this in real life. For instance, when they found Saddam Huessin, instead of hanging him, they just spanked him on the ass! I'm sure that would've worked.\n\nAnyway, back to the plot (or as much of a plot there is). Once ahold of these guns, Nathaniel uses them to destroy Irons' hometown, and Irons himself. Of course, this doesn't keep Irons down, as he gets back up, renames himself Shaquille O'Neal, joins the NBA, and becomes a huge star. Okay, so this didn't happen in the movie. But I'm pretty positive this is how Shaq's career came about. My ramblings aside, Irons picks himself back up, grabs an old army buddy and Shaft (not kidding), makes himself the absolute worst looking superhero attire ever (it makes the Bat Nipples look like the Mona Lisa), dons himself Steel, and comes back to save the day, equipped with a huge sledgehammer (Triple H's inspiration), magnetic shield, and advice (once again, not kidding).\n\nThe sheer stupidity that is Steel is unprecedented. Yes, I've seen worse COUGH*Batman & Robin*COUGH. But, that doesn't do justice for the man of Steel (and insults the true man of Steel, Superman, which this story is based off of a side character after the death of Superman). Steel is so bad, that I was actually yearning for Kazaam shortly into the movie. Do yourself a favor, and shoot yourself in the foot. It's a lot less painful."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Dorkboss",
        "review_rating": "1",
        "review_title": "Awful comic book film",
        "review_detailed_main": "Whether it was 90's throw every comic books into a cash cow movie or Hollywood trying to turn Shaquille O'Neil into a megastar (more super than his Pepsi commercials), this movie is just downright awful. The plot, characters, humor, and everything about the movie is not worth interesting to see."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "senojtterb",
        "review_rating": "10",
        "review_title": "Wow",
        "review_detailed_main": "Shaq at his acting peak. Baby Ray J being in it was the best surprise the movie could have ever offered. Thank you Hollywood for this timeless year round classic."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "rizzo5-2",
        "review_rating": "6",
        "review_title": "this movie is absolutely hilarious",
        "review_detailed_main": "\"Eat the hot dog, don't be the hot dog,\" best line Judd Nelson's ever delivered. Every superhero cliché known is thrown in and hammed up to the extreme. The father figure killed by the bad guys, the tech whiz buddy that makes all of Steel's gear, the big bad evil high tech corporation, the sidekick in the wheelchair with the touching scene in which Shaq denies help her back up after she falls out onto the floor, and enough horribly brain dead one liners to choke several giraffes."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "erk_42",
        "review_rating": "1",
        "review_title": "The Movie That Killed Comic Book Movies for Nearly a Decade",
        "review_detailed_main": "This is one of the most horrifyingly awful films of all time. It would an embarrassment to your local dump to find this movie wallowing in there. It's not even worthy of that! Shaquille O'Neal delivers a performance that (gasp!) is worse than his awful performance in Kazaam! Apparently, after the mild success and small critical praise of Shaq's performance in Blue Chips, he thought he had a chance at a real acting career. I would like to know who it was that encouraged him to go forth with two more lead roles in his career?! The only reason he did so well in Blue Chips was because he was basically playing himself! Casting Shaq in this big, lumbering idiot of a role is so bad, it actually makes us laugh...hard. The costuming is a joke. It's all too obvious that Shaq is wearing a rubber helmet when its supposed to be made of steel! He also looks just plain ridiculous in that suit. He looks like an over-sized kid ready for Halloween, as he has to strain to peer through the eye holes. He just looks like a metallic turd. The special effects are mediocre at best, and the rest of the cast is bland. Judd Nelson, who's career said bye-bye back in the '80s, is among the worst villains in movie history, and certainly didn't help his career any. The story is ludicrous and often makes no sense...that is, when there is an actual story to follow, and the dialogue is so bad, that they have to resort to stealing lines from other, far better, action movies!! After this, its plain to see why you didn't see another comic-book based movie for a while (excluding Batman & Robin, which was a joke in itself). This movie literally killed the comic book movie for almost a decade."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "rayzor09",
        "review_rating": "",
        "review_title": "Not as bad as people say!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "tobalaz-305-290098",
        "review_rating": "5",
        "review_title": "Disappointing",
        "review_detailed_main": "Well, Steel is worth watching once.\n\nI didn't think Shaq did as bad as everyone claimed he did acting and turned out a surprisingly average performance for an athlete with no real acting experience or training.\n\nThe outfits, vehicles, special effects were all nothing special but we're serviceable.\n\nI enjoyed the Steel comics, and really thought he had the soul and values of Superman and could have been a special character. That being said, the movie has almost nothing to do with the comic except a name. If you judge the movie to the comic, it's basically one to two stars (of ten), but if you ignore the comic and try to think of the movie as a different character it's a middle of the road four to five star where nothing is great but everything is just average at best."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "IonicBreezeMachine",
        "review_rating": "3",
        "review_title": "Corny and silly, but also optimistic and good natured. Steel isn't \"good\" but it's hardly one of the worst films I've seen.",
        "review_detailed_main": "Military weapons designer John Henry Irons (Shaquille O'Neal) resigns from his position when his best friend and partner Susan \"Sparky\" Sparks (Annabeth Gish) is rendered a paraplegic by the misuse of Irons' sonic cannon by Nathaniel Burke (Judd Nelson). Irons returns home to South Central Los Angeles to live with his grandmother Odessa (Irma P. Hall) and younger brother Martin (Ray J). Burke having been dishonorably discharged from the army enacts a plan to utilize the stolen schematics of Irons' work and sell them on the black market. When Irons sees his weapons are now on the streets of his home city and finds himself unable to motivate his former superiors to intervene due to the \"classified\" nature of the weapons, Irons undertakes a crusade to rid the streets of these weapons with help from Sparky and his scrap/salvage yard owning Uncle Joe (Richard Roundtree). The three make a high tech steel armored suit and Irons fights against the proliferation of his weapons as the masked vigilante Steel.\n\n1997 was not a good year for superhero movies. With the instant punchline of Batman & Robin followed the underwhelming adaptation of Spawn in the first week of August, the Summer yielded yet another underperforming dud with Shaquille O'Neal vehicle Steel a mere two weeks after Spawn. The movie was a passion project for music producer Quincy Jones and his partner David Salzman with Jones in particular being a fan of the DC Comics character and wanting to make something for his children that carried a sense of optimism about it as the cloud of race relations and societal neglect was still hovering over the community from both the light shone on it in cinema with the films of Spike Lee, John Singleton, and The Hughes Brothers, as well as the ugliness raised by Rodney King and O. J. Simpson trials that had created a sense of pessimism in the black youth of the 90s. Shaq had been approached by Jones and Salzman regarding a possible adaptation of the Milestone Media character Hardware, but Shaq felt he related more to the Steel character. The movie was written and directed by Kenneth Johnson who's no stranger to superhero media having developed The Six Million Dollar Man spin-off series The Bionic Woman as well as the Bill Bixby/Lou Ferrigno TV series The Incredible Hulk in the 70s. While initially uninterested in doing a superhero movie, producer Joel Simon convinced Johnson that Steel would be more akin to a \"Knight in a modern day setting\" rather than a traditional superhero. While the movie is optimistic and there is a sense of goodness and optimism winning out over greed and corruption, it's also a movie fronted by an unqualified lead and is way too relaxed and slow paced for the type of movie it is.\n\nTo start off on a positive note, the movie's supporting cast is really quite good and clearly giving their all. Judd Nelson is having fun chewing the scene as villain Nathaniel Burke who revels in attaining power over others and prides himself on being the smartest man in the room and it's a solid hateful performance from Nelson. John Henry Irons' family consisting of Irma P. Hall, Ray J, and Richard Roundtree are all likable as Irons' grandma, younger brother, and uncle respectively and you get a strong sense of family from them that does make them a genuine pleasure to be around. But the standout performance is undeniably in Annabeth Gish who plays Irons' paraplegic best friend Susan \"Sparky\" Sparks and serves as the tech expert for John Henry Irons and her arc in the movie of overcoming the life altering event of losing usage of her legs does make her an engaging character and leads to some good scenes (and one somewhat demeaning scene where Irons picks up her wheelchair and carries her out of the Veterans' hospital, but what's done is done).\n\nWhat doesn't work quite as well are the actual superhero/action elements of the movie. The movie only had a $17 million budget which to put into perspective: Spawn had a $45 million budget and Batman and Robin had a $125-160 million budget so this movie didn't have all the resources of larger projects. The Steel costume is missing it's cape (a request by director Johnson to downplay the \"superhero\" aspect) and the suit tries to look metallic but can't disguise the flimsiness of the material, especially around the mask which often moves with Shaq's jaw. The movie also moves way too slow during the action scenes with Shaq clearly not fully attuned to the bulky nature of the costume and most of the fights and chases don't go above the pace of a light jog which kills any sense of tension to these scenes. While Kenneth Johnson may have been behind some influential action shows of the 70s with Bionic Woman and Incredible Hulk, it doesn't feel like his approach to action has caught up with the standards of contemporary audiences. Maybe if this type of movie had come out in the 70s and starred Jim Kelly or the 80s with Mr. T, maybe it might've been acceptable to audiences of the era (I say maybe, but we're talking about an era of the Salkind Superman, Flash Gordon and Sheena, so who knows?), but looking at Steel in hindsight it looks like a TV pilot cut from the same cloth as Glen A. Larson's Night Man or the short lived Fox series M. A. N. T. I. S. and not something you should be seeing in a theater. And as I'm sure you've guessed, Shaq's not all that good in the movie. Shaq is a large imposing presence so physically it seems like he's a strong candidate for a superhero, but in practice his performance comes off very stiff and robotic and his voice rarely changes octaves with moments where he should emote (such as the near death of a cop friend we never see again) coming off rather muted.\n\nSteel has its good moments, mostly from its supporting cast and a good natured intention, but it also is restricted by a clearly tight budget, an overly relaxed pace in the story and action beats, and a leading man who doesn't sell the lines he's saying. I don't think it falls in line with the category of \"worst ever made\" but it's also not really acceptable either."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "MoviesWithX",
        "review_rating": "3",
        "review_title": "One of the best bad movies ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "the_glorious_sob",
        "review_rating": "3",
        "review_title": "Pretty damn bad, but enjoyable 4 MSTies like me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "scubalife",
        "review_rating": "3",
        "review_title": "Great movie to watch if you are surfing the web and doing something else",
        "review_detailed_main": "If you take this movie for exactly what it's worth... A rainy day choice when there is nothing else on.\n\nFor the life of me I can't see why they have real actors on this show because they keep it on life support.\n\nI'm trying not to hate but it's an hour and a half I'll never get back.\n\nI've seen worse... Kentucky fried movie for example andalmost anything from Disney these days.\n\nI do think it's pretty funny that none of the police cars look like police cars and for some reason it cost $15 million dollars to produce this movie.\n\nI did enjoy the fact that there were no stuntman large enough so Shaq had to do all his own stunts."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "boblipton",
        "review_rating": "4",
        "review_title": "An Actual Actor In The Lead Might Have Helped",
        "review_detailed_main": "Shaquille O'Neal is an engineer working on energy weapons. When he is almost killed by rogue scientists who steal his work and try to kill him with it, he retreats home. There, with his junkyard-owning uncle Richard Roundtree, and wheelchair-bound Annabeth Gish, he makes armor and weaponry for himself, and to safeguard Los Angeles, because the cops ain't cutting it.\n\nThere are several problems. One is that O'Neal is not a good actor. His delivery of lines starts out as awful, although by the end of the movie, he's decent. Another is that the film makers find themselves trapped in the world of the comic book this is based on pawing uneasily at the stereotypes and conventions of the source material. And, of course, the plot arc has him fighting against bad guys armed with similar weapons. With Judd Nelson and Irma P. Hall."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "Shaq's Vanity Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "neacorp",
        "review_rating": "10",
        "review_title": "For 97 it's pretty good, unless you have anything else to watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "reddiemurf81",
        "review_rating": "6",
        "review_title": "Why the hate?!? It's fun! 6.4 all the way.",
        "review_detailed_main": "John Henry Irons works in military science and weapon manufacturing. After a weapons testing goes wrong, he and his friend return to his home to start a new life. However, not long after they get home, they begin seeing reports of weapons they helped design used in robberies and gang wars in LA. It seems the fellow military scientist they worked with has set out to make his fortune selling military grade weaponry. So Irons takes it upon himself to fight a little fire with fire.\n\nThis is by no means a great movie,, and it does not stack up when compared to the MCU, DCEU,, or the other superhero movies that came out before them. However,, it's a lot of fun! While Shaq will definitely not be winning any awards for his acting abilities (though I think his done fairly well with his comedy roles) he's not bad in this, not bad at all. The movie is very entertaining imo. I luv how they poked fun at the fact that Shaq can't make free throws (not that I can either). Also really liked the Shaft reference."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "PCC0921",
        "review_rating": "5",
        "review_title": "We Never Forget That the Star of the Movie Plays Basketball",
        "review_detailed_main": "So, I'm not going to bash this film as bad as others have, but I'm also not going to say this film is great by any stretch of the imagination. When this film came out in 1997, it was bashed so bad by the critics, was quickly becoming a box office flop and the idea of Shaquille O'Neal being the main actor in anything, was totally turning me off and the rest of the world. I never even thought of seeing this movie back then, because of all the bad press. On top of all the bad press, DC comics-produced movies were meeting a major downturn in quality and success during this time. This film was released two months after the disastrous release of the hated Batman & Robin (1997), film. Things would actually not begin to improve for DC until 2005, when director Christopher Nolan released Batman Begins (2005). Also, forget about Marvel during the 1990s. They had nothing really going on up to this point, although things would change for them, moving forward, with the release of Blade (1998), the following year. So, it's fair to say that comic book fans in 1997 were not happy to begin with.\n\nIt is fair to say, that some creators of motion pictures sometimes tend to mess things up when they are pet-projects. That is how things kind of rolled out here with the production of this film. Shaq was a big fan of the character of Steel. Television producer, David Salzman and legendary music performer, with money to burn, Quincy Jones, also loved the character. When a major NBA superstar says he wants to make a movie about Steel, then you just do it. That's where the trouble begins. They hired legendary television, director/producer/writer, Kenneth Johnson, to direct this film. Why they would hire a television guy to direct a major motion picture? Well, let's check his resume. Johnson was responsible for the creation of some of the best moments in fantasy/science fiction television history, from the 1970s to 1990s. He has huge titles on his list. TV shows like, The Bionic Woman (1976-1978), The Incredible Hulk (1977-1982), V (1983-1985) and Alien Nation (1989-1990), just to name a few. He definitely had the experience in fantasy, science fiction and comic book adaptations. The problem was it was for television and that is what comes out of the screen in Steel (1997). It feels like a cheesy TV show, not a major motion picture.\n\nIt is true this film has terrible dialogue, silly one-liners and certain moments in the film, that really make you want to shake your head. Having Shaquille O'Neal as your main character is not a good choice. Someone at Warner Brothers, should have gotten into Salzman's ear and convinced him to get Shaq to just be a producer on the film and hired a real actor for the job. You get scored on your pre-production as much as the production and post-production too. It sounds like the choice of Shaq was a huge turn-off for many theater-goers and critics. What also made things annoying to the fans for this film, was the blatant ignorance towards the original source material and the removal of the true story of Steel. Without getting into the full backstory to this character too much, Steel really shouldn't be around without Superman nearby. Steel is an important supporting character to Superman and that aspect was totally ignored in this movie.\n\nMaybe, I am used to watching the CW/DC superhero shows, that we see today in the 21st century. As I witness the demise of the, once respected, Arrowverse, from the CW and the coming end to those shows, Steel (1997), doesn't look any worse than the weaker days of the Arrowverse. Maybe Steel (1997), was ahead of its time, because it follows the same formula as those shows. This speaks volumes, because Steel (1997), should have been a TV movie. There are some good moments in this film, mostly related to Iron's relationships with his friends and family. The writers do try to build a good foundation with the main character, by developing the family Iron has around him. This includes his grandmother, but also could include his Uncle Joe (Richard Roundtree) or his commanding officer, Colonel David (Charles Napier).\n\nSo, with all these negatives floating around in the press, total avoidance of the original source material and egos sabotaging beloved characters, you have a recipe for disaster. Throw in bad interactions between characters, a cheesy TV aura and some messy editing and you are going to score low on your film. I still don't think this film is as bad as some say, so I am going to give it an \"E\" for Effort. It is interestingly funny, seeing Steel's arch enemy, Nathaniel Burke (played fairly well by Judd Nelson), trying to pick a fight with O'Neal's, John Henry Irons, while looking up at Iron's, like he's talking to someone on top of the Washington monument. The interaction between the two characters just looked silly. This film can go either way. It can be fun at times, but also has some painful moments in it.\n\n4.6 (E MyGrade) = 5 IMDB."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "nick_123",
        "review_rating": "",
        "review_title": "Yeah, It is a load of crap, but the bottom 100?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "erminahotmail",
        "review_rating": "4",
        "review_title": "The only thing made of steel are the mega pallets",
        "review_detailed_main": "This is the second film where Shaquille has a pianist because the first one was Kazaam which is truly incredible which I didn't mind at all I quite appreciated that film but this steel I have no room for nothing save So thisfilm doesn't have any interesting moments and then the quotes are really bad especially the main plugalista you can know why he makes a basketball player act but maybe because after the success that Michael Jordan had In Space Jam but it's a shame to replicate that same thing It doesn't the same thing about this basketball player and then the worst thing about this film is The Programmer's Armor seems to me instead to be the poor version of a tin man from the Wizard of Oz and then the gangs aren't funny at all I don't I can just see why create just thattype of film Let's hope that steel will come back to life with the films of the new shared universe to conclude rating 4-"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "jimwt66",
        "review_rating": "4",
        "review_title": "I wasn't expecting much and I still think I was short changed.",
        "review_detailed_main": "I am pretty sure this was not supposed to seem like a comedy or farce of an action film but it sure seemed that way. Except it wasn't funny in the LOL way. I gave this a lot of slack because it was Shaq and I wasn't expecting an emmy award acting job. Shaq lived up to what I expected for his acting ability.\n\nThe thing that dragged this down was the silly scenarios. First, there is no way a 7' something person would be in the military. Second, they show these blasts from weapons hitting buildings and other structures and decimating them but when it hits a person they act like they were hit with rubber bullets. The dumpster that was crashed into you could tell was plywood. When a grenade was tossed into the box that was the longest grenade timer in history. I think they could have had at least 2 maybe 3 other grenades go off in that time.\n\nSomehow they made all these batman type devices, a secret batman cave, a secret cargo van for him to drive into and hide from police. They switched lights from red to green and green to red and suddenly all the cars react like they had a yellow light in there. Changing the color of the light 1 second before they hit the intersection does nothing for clearing that intersection. If anything it would have helped the cops that were following them.\n\nIt also got annoying with them showing him trying to throw a basketball into a hoop and he keeps missing and saying you know I can't throw. Maybe once it was funny. Maybe even twice but they went overboard with it.\n\nI don't blame Shaw for this failure. I blame the writers. It was like they had a bunch of teens writing the script. No one had any concept of reality or how anything worked in real life."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "jtaylorcom",
        "review_rating": "1",
        "review_title": "Worst Ever!",
        "review_detailed_main": "Shak is the worst actor I have ever seen in movies and commercials ! He doesn't need the money so why is he doing this! All the companies that use him should come to their senses and stop using him!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "MrPaull0324",
        "review_rating": "3",
        "review_title": "This nearly ended the superhero genre",
        "review_detailed_main": "I've seen many superhero movies in my time, both good and bad. But \"Steel\" is undoubtedly the worst. In fact, it was so horrible, it nearly killed off the superhero film genre along with Batman and Robin and Spawn.\n\nThe film is only very loosely based off of the Superman character Steel. John Henry Adams (Shaquille O'Neil) starts off as an advanced weapons designer for the US Military. After an accident caused by another soldier named Burke (Judd Nelson) leaves Adams friend, Sparky (Annabeth Gish), paralyzed from the waist down, a disillusioned Adams resigns and finds work at a steel mill. Soon enough though, Burke begins selling Adams weapons to street thugs on the black market. Discovering this, Adams designs and builds a superhero suit at the steel mill and becomes a vigilante crime fighter with Sparky as his sidekick.\n\nDon't get me wrong. I've got nothing against Shaquille O'Neil. He's a great guy, was a first-rate basketball player, and has plenty of onscreen charisma. But he just wasn't cut out to be an actor. You'd think he'd realize that after his equally disastrous film \"Kazaam\" released only a year prior to this. His performance here is completely wooden, and he has a blank look on his face most of the time. Even his relationship with Sparky feels forced and fails to illicit anything from the audience. It doesn't even become romantic despite the chemistry between them.\n\nThe rest of the cast is only marginally better, putting up a sub-par performance. Judd Nelson seems bored and delivers his lines almost as poorly as Shaq. Only Annabeth Gish and Adams soufflé obsessed grandmother (Irma P. Hall) are half-way good or humorous. Another unintentionally funny tidbit comes from a random thug (Kevin Grevioux) screeching \"NOOOOO!!!\" before being killed by a grenade but that's about it.\n\nThanks to the low budget, the effects are totally cheesy and unimpressive. The weapons look like nerf guns painted black to look more real. Even Shaq's crummy suit of armor outfit is clearly made out of grey rubber, and he looks ridiculous wearing it. His stunts, which he had to perform himself, are boring and even laughable at times, such as when he slowly rappels up a building to escape the police or when ascending an escalator. There's nothing to enjoy here.\n\nThis made \"Batman and Robin\", \"Supergirl\" (1984) and even \"Catwoman\" look decent in comparison. Say what you will about them, but at least the leads were played by actual actors, not athletes with no business starring in pictures. The only reason to bother watching this is for a cheap laugh is morbid curiosity."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "ashfordofficial",
        "review_rating": "3",
        "review_title": "Campy",
        "review_detailed_main": "Based on the DC Comics character Steel (John Henry Irons). They really put some money into decent VFX and it shows. It was a pretty fun and campy movie. There were some comedic and heartwarming moments and also it had some cringeworthy moments too. Performances was surprisingly enjoyable (especially Annabeth Gish) but the script and the direction could've been better."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "vigilantereviewer",
        "review_rating": "2",
        "review_title": "Where to Begin",
        "review_detailed_main": "Steel would've been bad as a TV movie, and the fact that it isn't a TV movie makes it even worse. The movie is filled with terrible action, terrible one-liners, terrible acting, and even more terrible acting. The overall design of the movie is bad. Nearly everything about this movie is bad. In all honesty, the overall story arc is pretty good and with a much better screenplay there might, potentially, be a good movie in there somewhere. The overall story being decent and one clever batcave one-liner save this movie from a 1 star rating and bumps it to 2 stars out of 10."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "radiospots",
        "review_rating": "9",
        "review_title": "I actually was just doing a search for this film..not knowing...",
        "review_detailed_main": "I was actually doing a search for this film. I loved this movie when it came out and was trying to find it on other sites. The name did not come up on other sites, but it did here. Whoa, I did not realize that this was Shaq in the film. So I know that my influence for this film had nothing to do with Shaq fame. I really did like this and wish they would do a sequel. For now, it should be on DVD...I know it would sell."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "TonyVan",
        "review_rating": "7",
        "review_title": "Not that bad!",
        "review_detailed_main": "Despite a horrible preview, I felt the movie was not as bad as I expected it to be (and certainly not as bad as many other IMDB users have voted!)\n\nBottom line, nothing new here but a nice story about not giving up on yourself. Shaq is fine as the hero, and Annabeth Gish stands out as his crippled friend.\n\nI hope Kenneth Johnson gets more chances to direct, as I like his style. (look for cameos by Gary Graham and Eric Pierpoint, his two stars from the Alien Nation TV shown!)"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "A movie that's as tough as the title says...",
        "review_detailed_main": "Steel! Oh, yes! This movie is so tough, any movie like \"The Godfather\" and \"Casablanca\" will shatter into irreversible broken pieces if dropped on there! Shaq from \"Kazaam\" takes center stage in this exciting yet funky action film, and he is here to put the bad guys where they belong - in the trash! Seeing this movie makes my heart pump, my veins pop, my head explode (no, not really, but believe me, it is that exciting)! Don't believe me? Go watch \"Steel\" and see for yourself! Tell me if you think this movie deserves a \"1\" or a \"10!\" I give this movie a \"10\" all the way! Shaq is the man of the court and the screen!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "mjarvis0",
        "review_rating": "7",
        "review_title": "Easy on the eyes",
        "review_detailed_main": "I do get angry when a movie is unjustly slated and I am angry now. What some people should appreciate is that some movies are not made in order to give us an insight into the meaning of life. They are just there to be enjoyed. I enjoyed Steel. It is a good movie about making a difference, a moral movie without any pretensions of grandeur. If someone said to me that the makers of this movie had the same kind of budget as those who made X-men for instance, then I would certainly of expected more. But I am sure they did not and made the best of what they had. Okay Shaq is no Olivier but so what!! At least he was prepared to give it a go and I think he did okay. All the actors did. To conclude I liked the movie Steel and if it was available to purchase in the UK and would buy it. Please do not watch a movie having prejudged it, be practical and know that there are limitations and not all film producers have big budgets. This movie was well told, and the actors did the job."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "missed opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "mrgregorykitt",
        "review_rating": "8",
        "review_title": "A young brilliant weapons designer a suit of armor and designs new weaponry to clean up his stolen technology.",
        "review_detailed_main": "I liked the movie. I like superhero movies, and this was one of the first to introduce a little known character. It was ambitious. I liked certain sentimental moments in the film. I also like Shaq. I think he has made another positive icon for the youth to inspire to be like and emulate. Black kids are in need of heroes they can relate to, and this movie tried to provide characters which are familiar to the youth. Not perfect characters but characters with flaws. Shaq portrays a young, brilliant weapons designer who's weapons are designed not to kill. I think the movie and all those involved made a noble effort to teach kids not to kill, and that they, too can build and create new technology. Moreover, the kids see that they,too, can be heroes. If it's true Shaq did his own stunts, I'm even more impressed with his performance. I'm a layman and I don't know good acting from bad acting. All I know is I was throughly entertained by this movie. And I recommend it as a family movie. Something kids and adults will enjoy, especially kids."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "zardoz-13",
        "review_rating": "7",
        "review_title": "Shaq Can't Act",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "dbborroughs",
        "review_rating": "9",
        "review_title": "Its NOT the comic book.",
        "review_detailed_main": "How could it be the comic when much of Steel's early comic life was tied to Superman. Steel was one of the four possible Supermen who appeared right after Superman was killed by Doomsday in the comic book. There is no Superman, no Doomsday, almost nothing from the DC universe in the film, except the character itself.\n\nThis is not a bad thing especially since the Steel comic could have been created with out having come from Superman. The plot line of where and how Steel comes to be is a close approximation of what a Superman-less origin might have been.\n\nI don't think its a movie that wants to be any more than it is which is a fun little romp in a super hero sort of way. Shaq is fine as Steel which he plays to the best of his ability. Allowing that the character never had much depth the central performance is everything it should be. The rest of the cast is a great deal of fun as they chew scenery and try not to take anything too seriously.\n\nSo sue me I like this movie. Its a fun rainy day popcorn movie of the highest order. It had no calories and nothing in it will stick anywhere in your head.\n\nTry it. Its mindless fun."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Poor action stuff that will only appeal to children and undemanding adults",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "nryeomans",
        "review_rating": "7",
        "review_title": "A different, and fun, man of Steel!",
        "review_detailed_main": "I found this a fun romp through the super hero world. Yes, it does not always conform to what you would expect from a 'normal' world, but you don't watch these sort of films to be 'normal'!! You might as well say that RoboCop was a failure because it was unlikely! Of course, I am a comic book crossover fan, so this is just down my alley. Shaq performs nicely as the over-sized hero, who realises that he is the only person who can make a difference, ably supported by Uncle Joe, and Susan Sparks, who together pull an A-Team type stunt, creating his arsenal, and gadgets. The villains are suitably greedy, doing everything they can to force Steel out of business. As to how it ends? Get it yourself and enjoy!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "megaparrot",
        "review_rating": "10",
        "review_title": "This is a wonderful Movie",
        "review_detailed_main": "I thoroughly enjoyed this movie. I know that it didn't follow the story of steel from the comic books, but I didn't care. This movie had a very good message. As big and bad as steel was his friends and the community supported him and this is really what made him a hero. I enjoy watching Shaq. He is a good human being on and off the basketball court, and I enjoy this movie every time I see it. When I first saw the advertisements I thought it wouldn't be very good because it didn't following the the story from the comic books, but I realized there's nothing that says they should. The tools that Steel uses are inventive and clever. I would recommend this to anyone who enjoys action movies not just fans of Steel from the comic books. :)."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Coxer99",
        "review_rating": "",
        "review_title": "Steel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Bored_Dragon",
        "review_rating": "6",
        "review_title": "Thank God I don't believe ratings and reviews...",
        "review_detailed_main": "Steel has 2 on IMDb, 12% on RT and all reviews I came across are terribly bad. If I believed everything I read on net I would miss hour and a half of good entertainment. Movie sure isn't Oscar material, but to call it the worst movie of 1997 or the worst DC movie ever is very unfair. It has average story, typical for vigilante vs villain comic-book adaptation. References and one- liners are bit cheesy but in place for this kind of movie. Special effects are far from great, but decent enough for 90's. Actors and their performances, as everything else in this movie are totally OK, on level with better TV movies. The only real flaw of this movie is fact that O'Neal is bad actor, or more precisely, not actor at all. But at the other hand, he's not worse than Schwarzenegger, or Hulk Hogan, or Van Damme, and I don't see it's stopped them for making dozens of pretty successful movies. And however bad Shaquille might be, he has the cutest sidekick ever. Sparky stole the movie. I can not praise this movie cause it's really nothing special, bit it's not especially bad either. And it's surely is extremely entertaining.\n\n6/10"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "PJS-5",
        "review_rating": "9",
        "review_title": "****.5,4.5 out of 5 stars,heroes don't get any bigger & films almost don't get anymore underrated than this incredibly underrated flick.",
        "review_detailed_main": "I dunno why do so many people knock this one down immensely it's no where as bad as so many people have said(& no I'm not a fan of b-movies or shaq.) This film has plenty of good humor & amazing design. Well-made storyline & all that. OK so Judd nelson(jack of suddenly susan & hot rod(believe or not) of transformers the movie) did play his part well but he's not exactly the idea of an terrorist villian (so many people expected the villian to be a supervillian but the film ended up as having a terrorist as the villian) & sure the story had a major difference to the comic, but just because movies place in more than just a li'l bit of artistic license doesn't always make a movie bad (which I can say for the movies of SMB & street fighter) so there my 2 cents for right now."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "iLoveLamp62",
        "review_rating": "",
        "review_title": "aighhhhhh!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "hagan_family",
        "review_rating": "7",
        "review_title": "It's Not So Think As You Bad It Is ...",
        "review_detailed_main": "The premise is silly; the writing is juvenile; the acting is basic; the casting is actually fun and the direction is surprisingly consistent (given the subject matter, script and lack of pretension all around). So fundamentally, it's a movie about a SASH ... (Silly-Ass Super Hero). There is nothing super-serious in this film at all ... except some of the references to a few the realities of life in the 'hood (even though it's a pretty heavily sanitized reality).\n\nThis is one of those films that so clearly illustrates the difference between technical cinematic quality and entertainment for entertainment's sake. The qualities of a cinematic masterpiece may or may not be entertaining, and the acme of cinematic art is the effective balance and integration of those two components. \"Steel\" isn't one of those ...\n\nFrom my perspective, this film and its producers appeared to focus purely on popular entertainment and were not at all worried about competing seriously for critical praise of any type.\n\nThe actors looked like they had a lot of fun making the films and they neither took themselves nor the film too seriously at all. I particularly enjoyed watching a very young Shaq, still playing roundball at the championship level, having fun parlaying his popularity and his appealing personality into something that people other than film critics would appreciate (especially NOT film critics).\n\nThis is a family-fun-film with crystal-clear good guys, bad guys and clearly drawn right and wrong. There is so much \"deus-ex-machina\" in this film that you just gotta laugh at the absurdity. You see, it's the absurdity of it all that makes it fun.\n\nUltimately, the qualities of this movie demanded that this be the only one ... no more \"Steel\" and no franchise. It's like cooking fresh fish ... it's only good once, and besides, there's not enough leftover to make an actual second meal."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Op_Prime",
        "review_rating": "8",
        "review_title": "Warner messed up again",
        "review_detailed_main": "Much like Batman & Robin, Warner Bros. screwed up another great comic book character. Steel, who was introduced shortly after the death of Superman, is a great character who had potential to do well in outside projects. I can deal with the hammer is a gun thing and no cape, but no reference to Superman? It's not like they couldn't do it. Warner owns both characters, among so many others. For what it's worth, this was a decent movie with a decent premise and an okay star. Sadly, the idiots at Warner Bros. felt they should just cram in special effects to awe the audience rather than actually work on a movie."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "comic207",
        "review_rating": "",
        "review_title": "Um, this was based on the comic book character, right?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "jkhvegas",
        "review_rating": "10",
        "review_title": "Great",
        "review_detailed_main": "This is the greatest superhero movie ever, it's even better than the marvel movies. Shaq is awesome."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "insult2injury",
        "review_rating": "",
        "review_title": "Another promising story ruined...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Jason_VoorheesIMDb",
        "review_rating": "10",
        "review_title": "I liked it",
        "review_detailed_main": "Many people hate Steel and to honest I can understand why but I saw it when I was a kid and I liked it. Even today I still like it. Sure Shaq is a bad actor but this movie he was actually trying, unlike Kazaam!. In that movie he wasn't even trying because the script was so bad for Kazaam! it wasn't even worth trying. While Steel he actually tried his best, even if you hate this movie you have to admit the music is really good. While the movie was so bad it killed superhero movies for the 90's it's worth it just to here that theme song in the movie. While I like this movie I still wouldn't recommend you watch it. If you wanna check it out feel free to do so but you'll probably have the same reaction as everyone else. They all say it's awful. In my opinion I like Steel don't judge me it's my opinion, you don't have to like it but everyone else hates it. Thanks for reading."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "Lanraso",
        "review_rating": "",
        "review_title": "the very idea of this movie is a sin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "dickchenny",
        "review_rating": "10",
        "review_title": "How come Shaquille didn't get a Oscar nod?",
        "review_detailed_main": "This movie is a thing of true beauty coming off the Oscar winning movie Where Shaq dresses like a genie this movie only gets better the acting is amazing the plot great and the writing shocking with many twists. Don't listen to any other review unless good because this is a modern masterpiece. The greatness of this movie is insane critics bashed it because they were jelly because they will never be as good as Shaquille omg if only this movie had 5 million sequels then I would be able to die happy. This movie was as good as Shaquille free throw ability and that shows how good it is. This movie is better then Kobes whole career and will make you choke on your drink from laughing like the gsw choked and lost a 3-1 lead it's just truly great roger ebert was probably smoking wacky tabacky when he said it was a bad movie"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Just Another Cinematic Air Ball.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "AlanWelat",
        "review_rating": "10",
        "review_title": "Best movie back in the late 90's",
        "review_detailed_main": "Shaq does it again and again, hes a real champ for sure. I really liked the movie I watched it with some kids and as soon the movie was over the kids started to walk and do the thing like Shaq did. The kid was wearing a pan and stuff like that. LOL. I think that Shaq been doing some big and good progress when its comes to acting. He did a good job on Grown Ups 2 as Officer Fluzoo, funny name by the way. After all this is back in the late 90's and I most say that Kenneth Johnson had some good fantasy for sure. Annabeth Gish was hot in this movie and did a hell of a job too. Her latest acting been really horrible like her roll in Texas Killing Fields, terrible. Her roll in SoA was kind of (is that really her) I had to look it up just to be sure."
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "TMC-4",
        "review_rating": "",
        "review_title": "Somewhat Ingenuous, but Ultimately Ruined By its Script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "RightOnDaddio",
        "review_rating": "8",
        "review_title": "2023. A Gen-X Review of a Decades Old Film That I've Never, Ever Seen Before",
        "review_detailed_main": "Watching this, I think about what a movie star Shaq could've or should've been. I'm serious. Is this Shakespeare or even Die Hard? No, of course not, but with his size, screen presence and charisma. I could see him having aged to pull more than his weight in ensemble films like, The Expendables series. Couldn't you see him in those?\n\nIs this movie a straight cheese fest mid-to-late 90's straight to video superhero movie?\n\nOh, absolutely!\n\nBut does this mean it doesn't have its charms?\n\nIt's got the stunning Annabeth Gish in it, right around the time she would've done Beautiful Girls as well, which is wild.\n\nThe legendary Judd Nelson just a few years removed from his stellar performance in New Jack City.\n\nLook, I think at this time, Shaq's a massive international sports star and everyone is thinking he'll build on a lengthy movie career and why not climb on board and go with this momentum.\n\nPeople can hate on this movie, and obviously they have but it is good, solid, harmless family entertainment.\n\nI actually enjoy the cheap looks of it quite a bit.\n\nIs this the modern day MCU?\n\nHeck no.\n\nCan you still gobble down popcorn while you watch this much less bloated film by comparison?\n\nAbsolutely! Enjoy!"
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "alfred_zamora",
        "review_rating": "",
        "review_title": "Good as a comic, bad as a film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0120207",
        "movie_name": "Steel",
        "movie_rating": "3.0",
        "review_username": "ZachRomero",
        "review_rating": "",
        "review_title": "I was 7, I loved it then for even less reasons than I do now",
        "review_detailed_main": ""
    }
]