[
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "turnthefrogsgayy",
        "review_rating": "5",
        "review_title": "Exactly what it promises",
        "review_detailed_main": "Tall girl is a movie about a tall girl. Thats the movie, and don't you dare forget it. My favorite part was when the protagonist, Jodi, was tall."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Short_and_to_the_point",
        "review_rating": "5",
        "review_title": "I liked it and then I didn't and then I liked it and then I didn't",
        "review_detailed_main": "I mean, it wasn't bad... but I feel like they didn't quite catch Jodi's personality. It was mostly people telling us how amazing she is, but all we see is her being down or whinging about something. I would have liked to see the more caring and \"fun\" side. It was stated that she was \"fun\" a few times, but where was that?? It was very choppy in a few bits. Like there were scenes missing that could have added to the experience. There was one part, though, that made me a bit mad, and that was the caesarean part. I haven't had one myself, but that was incredibly offensive to millions of women. It's as though they were made to feel ugly for bringing life into this world and something that usually comes from an emergency. Not cool guys. The rest of the movie was average. In saying that, it was a nice, easy watch when you want to just turn off the brain and watch a Netflix teen romcom."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amytudorin",
        "review_rating": "6",
        "review_title": "A sweet teen movie",
        "review_detailed_main": "I'm not going to rant on about the plot because you can Google it but I will say that this is an adorable movie that for once didn't have the clearest ending. For once the main characters weren't 30 year olds playing 17 year olds and I think it was, overall, pretty realistic. The characters were pretty good and, as a short girl, I couldn't always relate to Jodi but the movie is about so much more than just height."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ladylions",
        "review_rating": "1",
        "review_title": "Not realistic",
        "review_detailed_main": "As a 6'2'' female this is highly unrealistic. People are not this shallow. This movie made it seem that being tall was a disease. Ridiculous."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ciociajenny",
        "review_rating": "7",
        "review_title": "I liked it.",
        "review_detailed_main": "Yes it was a Dumplin for Tall Girls. Which I loved Dumplin!!!! If you havent seen it go and watch it NOW!! Its a typical teen movie like in the 80s teen movies. But I liked this story too. We always see the chubby girl we never see a tall girl. Unless shes playing for the basketball team etc.... It was a cute movie. I loved Angela Kinseys role! Its so different from her office role lol. And Jodys sister that actually sticks up for her sister is great!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "soffsskrap",
        "review_rating": "1",
        "review_title": "Great butchering of Sweden!",
        "review_detailed_main": "Next time Netflix desides to make a movie with an exchange student - try casting one that actually speaks the language! The swedish was awful, the accent was horrible! It sounded like a mixture between made up german and russian combined. There is a distinct swedish accent, the actor just didn't have the decency to learn it. And sidenote, Sweden is the second best English speaking country for it not being the first language in the world, so a big part of the swedish population doesn't even have an accent. And also - no person in that young age would be named Stig or Ingvar. Those would be the names of 80 years old men. Is it to much to ask for Netflix to get an accent and a name correct? Instead they are lett with a really unbelievable story. Gör om gör rätt."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "brhomy-65743",
        "review_rating": "6",
        "review_title": "young love",
        "review_detailed_main": "When a young gay falls in love with whole passions and all what he's cares about is you are happy and enjoy"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Lia-74937rs",
        "review_rating": "1",
        "review_title": "File Under: Movies Written to Fulfil a Fantasy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Not a small feet",
        "review_detailed_main": "Pun aside, this is a very straightforward teen comedy. Ugly or in that case tall duckling included. It's still pretty neat and it may surprise you once or twice even if it is quite predictable overall. It is well played by the actors who have to fight through the obvious and try to maintain a mystery and suspense, even if we as viewers know better.\n\nSo overall decent, but more aimed at a certain audience who will leap this up and take it all in with gusto."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "anyalegs",
        "review_rating": "1",
        "review_title": "So far fetched and stupid story",
        "review_detailed_main": "She's not even that tall. I'm a 6'3\" female and I was never a social outcast. I always had a ton of friends and had a fantastic high school experience. My height helped me get recognized in sports. Getting a full volleyball scholarship to a Div.1 school. I've had modeling gigs and I love standing out in a crowd. This show shames tall girls like we're supposed to be embarrassed about it. This is a lame story."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "debdabootchic",
        "review_rating": "8",
        "review_title": "It was cute",
        "review_detailed_main": "This wasn't an award winning movie but it was cute ~ a little unrealistic in the fact that they made her out to be freakishly tall but she's not. I can't say anything terrible about it and it's one you can watch w your tweens. I enjoyed it!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amy-47543",
        "review_rating": "",
        "review_title": "Not that bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tallgirl-45656",
        "review_rating": "7",
        "review_title": "As a fellow tall girl, I enjoyed this cute movie",
        "review_detailed_main": "As woman who is 6'1.5\" (don't forget the half!) and always the tallest girl in school, I can completely relate to the struggles Jodi faces in this movie. The dumb jokey \"Green Giant\" \"do you play basketball\" comments always got on my nerves and I always felt out of place just like she did. I had a short boyfriend in HS and everyone teased us and made comments, but it just shows how superficial people can be. I finally found my peace with my height and wouldn't want to be any other way! This is a fun movie with a good message and not here to solve world hunger, so just enjoy it for what it is. I do think they purposely casted very short people in this movie to make her look even taller. My fave line was the very last and what I choose to do - stand tall!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mprebble-32259",
        "review_rating": "3",
        "review_title": "The exchange student \"Stig\" was in no way Swedish",
        "review_detailed_main": "Started watching this movie and it was watchable up until the point the \"Swedish\" exchange student began to speak English with a forced accent that didn't even sound remotely like a Swede speaking English and then his \"Swedish\" was clearly an American that had learnt a few lines of Swedish... Why couldn't Netflix actually get an authentic Swedish actor for this role? Immediately after this the credibility of the movie was shot and we stopped watching .. it was too painful to listen to."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "douglas-skene",
        "review_rating": "3",
        "review_title": "Tackiest Movie Since Swiped",
        "review_detailed_main": "Severely underwhelming coming of age film with some really strange choices at times re: parental shame, Cesareans, and stalking friendzoned chumps that can't take a hint.\n\nChoppy edits, poor takes on the \"mean girl\" trope and no developed relationships between anyone. Surface level and cringe.\n\nSwedish accent was also atrocious.\n\nLittle redeeming quality apart from picture and audio quality, which is a given from Netflix."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Dev1999",
        "review_rating": "",
        "review_title": "Could have been much better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "easterlily-60116",
        "review_rating": "7",
        "review_title": "Surprisingly good for what it is",
        "review_detailed_main": "Before my actual review, I dont actually understand all the negativty around this movie. Yes there are some querks and yes the film plot is very unrealistic framing swedes as a pretty silly stereotype. Being a swede myself I can easily see through how the movie producers really did not care for researching how to make a character and actor appear swedish - i mean even non swedish speaker must admit that his accent sounds more german than any nordic language.\n\nAnyway, all these issues aside, I genuinly enjoyed the movie. Being of a genre thats supposed to be a bit silly and shamy, you have to be the right type of person to understand it and i think im one of those. Dont take it too seriously and give it a shot."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "heidirebeccameyerallers",
        "review_rating": "1",
        "review_title": "Terrible with wrong messages being sent",
        "review_detailed_main": "Within the first 5 minutes, you could tell the movie was clearly terrible and not something I would want myself or my family to watch. What sent me over the edge was when they said a crude remark regarding caesarean c-sections, and \"if she really wants to go through the rest of her life with a big, old scar on that beautiful torso...\". I just had an emergency c-section and it's hard enough physically and mentally, society doesn't need a movie drawing out the negativites with the surgery because in reality, my child is here and healthy and that's all that matters, not some\" big, old scar\". However this day in society we tend to care too much about what is on the outside, and this movie encourages that."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sonia-95111",
        "review_rating": "7",
        "review_title": "Accept yourself movie",
        "review_detailed_main": "I decided to write a review because of all the awful reviews this film has received. It's a watchable film and not half as bad as the reviews it has gotten. Jeez! It's cute and worth watching!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sqpudm",
        "review_rating": "1",
        "review_title": "\"Pretty in Pink\" rip off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Cavebear1",
        "review_rating": "7",
        "review_title": "Enjoyed it.",
        "review_detailed_main": "Just another coming of age movie. Although there are plot points to wince over, I for the most part enjoyed it, and thought Ava Michelle did a good job in her first leading role."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "troy-daniel-bush",
        "review_rating": "1",
        "review_title": "Worst Movie of 2019?",
        "review_detailed_main": "The movie is of the opinion that even though the main character is a very attractive girl, since she is tall, she is therefore ugly. Yeah... That makes zero sense!\n\nThis movie is littered with embarrassing high school movie clichés!\nThe bully is a bully because she's insecure\nToken black girl best friend combined with the quirky best friend cliché\nMakeover\nClichéd insults like, \"How's the weather up there?\"\nHandsome foreign-exchange student\n\n\nThere are stupid set ups with equally stupid payoffs. Like the box the main male carries around. I mean, seriously?\n\nAnd what is up with the cinematography of this movie? It doesn't fit at all! It's like the director saw Mr. Robot and thought to themselves, \"Ooo, yeah, I want to do that!\""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "warthenee",
        "review_rating": "8",
        "review_title": "From a tall girl's point of view",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lisa-1150",
        "review_rating": "7",
        "review_title": "Overall a sweet movie!",
        "review_detailed_main": "Previous reviewers seem lost in the minutiae of this movie. I enjoyed it thoroughly!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "WpgJetsFan80",
        "review_rating": "3",
        "review_title": "Awful lol Save yourself and dont watch this",
        "review_detailed_main": "Some people are trying so hard to be oppressed. Such a corny movie. Like somebody had a terrible idea for an afterschool special and turned it into full length movie with cheesy dialogue, horrible acting, and just bad directing. It was raining all day on my day off so I stayed in and watched netflix. Should have just went and sat in the rain instead of putting myself through this."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "samanthabairdsb",
        "review_rating": "2",
        "review_title": "Awful",
        "review_detailed_main": "Everyone in this movie is terrible. They are all terrible people. The only genuine one is the beauty queen sister. This movie does send all the wrong messages to the audiences its aimed at and seriously homegirl is just tall...shes rich or at least not poor,pretty, blonde and tall."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "NoahAndersen845",
        "review_rating": "",
        "review_title": "Don't listen to the haters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mimigrimes",
        "review_rating": "7",
        "review_title": "Good Teen Movie !!",
        "review_detailed_main": "In a world full of bullying this movie shows the reality of high school life for some. A view point from several angles !! Our house enjoyed it !!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "l-eggeling",
        "review_rating": "2",
        "review_title": "One good thing at last",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "paytonalpine",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "annabrehn",
        "review_rating": "4",
        "review_title": "So sick of \"swedish\" in english speaking movies",
        "review_detailed_main": "I'd say it's sometimes trying too hard, and I think that it's time for mean girl in movies to change. The movie as a whole was ok and entertaining enough to have in the background while foulding laundry. So I guess that counts for something.\n\nThis poor swedish guy Stig Mohlin - btw, Stig and Ingvar are not that common names among teens - who speaks swenglish in a way that sounds like no accent I've ever heard before, more like maaany accents combined. Pleeeeease don't go there if you can't pull it off. This might be whiny, but I am done with the swedish accents in movies. Sincerely, tired and (maybe?) offended swede. 😂"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "MySmilie",
        "review_rating": "7",
        "review_title": "Not the best but good message",
        "review_detailed_main": "I just got done watching this movie and I thoroughly enjoyed it. It's a super sweet movie about a tall girl, Jodi, finding herself and being comfortable about who she is.\n\nI would recommend this movie, because sometimes you just need to be reminded that it's ok to be who you are, no matter the cards you've been dealt, you can work with it and you're still perfect and amazing."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "aivilovee",
        "review_rating": "1",
        "review_title": "As a tall girl myself, I can't believe this is a real thing",
        "review_detailed_main": "So I'm 5'10\". Three inches shorter than our protagonist, but still, I think I qualify as a tall girl.\n\nThis movie was both stupid, AND inaccurate.\n\nOn one level, it claims that being a tall girl is one of the worst things on the planet. Let's start by clarifying one thing: tall girls are NOT a marginalized group. To claim so is ridiculous and offensive to marginalized people who actually face discrimination. Aside from that absolute clownery, the plot was predictable, cheesy, and just stupid.\n\nOn top of that, it didn't even get the actual experience of being a tall female right. The one thing they focused on was the \"boy problem\", which isn't even the worst of it. There was a whole shopping/makeover sequence and there wasn't a single joke about jeans turning into capris when you put them on, or putting on a shirt and having to accept it as a crop top. There wasn't anything about looking for shoes by size first, and then deciding if you like the style. The Tall Girl never once had to cram into the small backseat of a car and deal with the lack of leg room, and never was she asked to grab the cereal off the top shelf. Even with the absolute idiocy of claiming tall girls are discriminated against, it didn't even serve as an accurate representation of being one.\n\nThe best thing about this movie is the absolute hilarious criticism it has spawned on Twitter and YouTube, and I'd highly encourage you to seek that instead of watching this dumpster fire."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mrdavid-94317",
        "review_rating": "8",
        "review_title": "If you like the title you will like the movie",
        "review_detailed_main": "A typical high school movie with a lot of cliches where the main character is an eccentric girl who has self-confidence issues because of her heights. The movie labeled a comedy but there aren't any jokes - or there are but those aren't that kind of jokes that make you laugh. Basically, the title of the movie says the whole story, it's so simple. But for those people who are into tall women like I am, I can tell, this is a really good love story. I was so excited the whole time about what will be the outcome of the story between the short guy and the tall girl. This isn't a groundbreaking movie, but it goes against \"the man has to be taller than a woman\" tradition and I love the movie for this."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "carolleejones",
        "review_rating": "6",
        "review_title": "Ease up!",
        "review_detailed_main": "This is a show for 11-16 year olds. With THAT in mind, it was a cute show with an important message. Almost everyone thinks they're a reject in one way or another when we're kids. This show just offered another angle in which to see ourselves."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "spam-787-886973",
        "review_rating": "1",
        "review_title": "Dumbest movie ever",
        "review_detailed_main": "I was in my class at the end of the school year and a girl asked the teacher for permission to put \"Tall Girl\". At first I thought I was going to get bored and it was literally like that for more than 3 classes we were looking at this stupidity that makes no sense. It is literally what you saw in those Disney Channel movies, the plot is of a girl who suffers bullying because only that is high. It makes me angry to think that jokes are not funny. The whole movie gives special cringe the \"Motivational Message\" it gives and I say it in quotes because it is not motivational. If you want to waste your time do whatever is less watch this movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "farmer_gnu",
        "review_rating": "2",
        "review_title": "Blue and yellow, blue and yellow.",
        "review_detailed_main": "This director really loves to put blue and yellow in every single scene. Unclear why, is it suppose to make us think of Sweden? Or perhaps they live in a parallel universe where the color combination is super duper popular. In either case stop it, it's super annoying.\n\nAlso the Swede does not speak Swedish so well. Maybe he just forgot how to?"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "I love it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tika90",
        "review_rating": "7",
        "review_title": ":)",
        "review_detailed_main": "Second half of the movie was great!!! The story is great.. first half was so-so.. but in the end I loved it so much :)"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "joel-six",
        "review_rating": "2",
        "review_title": "Ooof! What a stinker!",
        "review_detailed_main": "The problem here is it's not funny so it's not a comedy and it's too unrealistic to be a drama. The characters are mostly irritating and hard to sympathise with. Jody is so bland I could not care less about where she ends up at the end.\n\nPS the musical \"number\" in the first half of the movie was so cringey I could barely watch it! Stay away from this piece of trash"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "miraalindgren",
        "review_rating": "6",
        "review_title": "I loved the characters",
        "review_detailed_main": "Why is this good? I'm afraid I don't have the energy to answer. There's a lot of reasons and I normaly is really hard on movies."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "saraflatt",
        "review_rating": "1",
        "review_title": "Terrible and offensive",
        "review_detailed_main": "I watched approximately seven minutes of this movie and I can surely say it is already making me quite upset. Her father in his first scene of the film proceeds to attempt to take away his daughter's ability to have children someday because of the social pressures which make his \"unnaturally\" tall daughter not normal. He attempts to get her potentially harmful drugs which could affect her later in life and seemingly continues to prod her for her entire young life about what disease she \"must\" have in order to be so tall and freakish. It is so upsetting to watch a film with such terrible writing and even worse that it continues to isolate those who are on the taller spectrum of height. As a person with a female best friend who is 6'2\", I find this to be a terrible movie plot and I hope Netflix can get its act together and put out more uplifting and inclusive products."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "krobison-45174",
        "review_rating": "7",
        "review_title": "Not amazing, but not terrible.",
        "review_detailed_main": "I appreciated that this movie focused on the bullying and insecurities that can come with your height. Tall girls can readily be found on volleyball and basketball teams (and others), but not every tall girl wants to play sports. It's not the same for tall guys. Especially when you are particularly introverted, the last thing you want is to be a head or more taller than everyone else. The writing was funny at times and cringe-worthy at others (such is the style of teen movies). I enjoyed it overall. It was a clean movie with a good message about being proud of who you are despite what people say. Flaws? Yes, but what movie is perfect?"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cruizerdog",
        "review_rating": "3",
        "review_title": "So confusing. She's not even that tall.",
        "review_detailed_main": "The movie made no sense and didn't seem remotely realistic. Why was everyone so short? Started watching it not having the best gauge of the imperial system so was like, \"alright, 6 foot 1 must be tall. After googling it, it's only ~ 185cm. I at 16 I was probably about 178cm with a 11/12 men's shoe and that is pretty average. Why is everyone at this school so damn short? Make her least 2m tall if you want it to be remotely dramatic."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "judzus",
        "review_rating": "9",
        "review_title": "Funny feel good story",
        "review_detailed_main": "I was surprised to see the low rating. The main character was well played, her family funny and relatable. Go watch it, and ignore the ratings."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "helenehc1",
        "review_rating": "7",
        "review_title": "Not just another teenmovie",
        "review_detailed_main": "The Key point of this review: It gave me an amazing feeling of seeing a TALL GIRL in the lead role! Being a tall Girl myself, it is a nice feeling to see an actress on tv and be able to relate to that person!\n\nunfortunately the movie had a lot of clichés which ended up overlooking some of the important dilemmas that you meet out there. No reason to make a movie with so many stereotypes. No need to make you feel bad for the main character, next time just make a movie with a tall or a short or a skinny or a fat or a normal Girl as the lead role, and make her confident from the beginning."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hasansevik",
        "review_rating": "1",
        "review_title": "A \"white minority\" film at its best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "fiekedk",
        "review_rating": "4",
        "review_title": "Apparently I'm a giant?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "annieaellul",
        "review_rating": "",
        "review_title": "This is bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tomcaseharcourt",
        "review_rating": "6",
        "review_title": "It's a kids film",
        "review_detailed_main": "People who are slagging this off seem to forget that this is aimed towards kids/young adults. My kids enjoyed it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "SofiaHedge",
        "review_rating": "1",
        "review_title": "Annoyingly Unrealistic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "phd_travel",
        "review_rating": "6",
        "review_title": "Unconvincing ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "SteveSteinbergII",
        "review_rating": "1",
        "review_title": "Complete \"Pretty In Pink\" Ripoff",
        "review_detailed_main": "I watched this movie on Netflix hoping for something fresh and new and what I got was the complete opposite. The script and story is basically just an \"updated\" version of John Hughes's Pretty In Pink with a few and I mean \"a few\" character and story/location changes. When I saw this was the first writing credit for Sam Wolfson I wasn't surprised at all. You can tell. Everything that was entertaining about this film was created by a real talent over 30 years ago. It just goes to show, you don't need any real talent as a screenwriter, you just need to know someone who will get you're foot in the door."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "v-yaswanth16",
        "review_rating": "7",
        "review_title": "C'mon it isn't that bad",
        "review_detailed_main": "I know it's fast fetched. Still it ain't that bad............."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "TheMovieDiorama",
        "review_rating": "1",
        "review_title": "Tall Girl ironically belittles its message with a towering case of marginalised insolence.",
        "review_detailed_main": "\"You think your life is hard?\" narrates the eponymous skyscraper-like girl in a condescending tone as if one was participating in a selfless therapeutic course in torture. Life really must suck for her. No, seriously. I felt her solemn sadness. Being an attractive young privileged white girl with a height totalling, and this really takes the biscuit, six foot one really must take its toll. Six. Foot. Frickin'. One. Constantly getting remarks including \"how's the weather up there?\" and being titled \"beanstalk\" shatters the confidence and then some. I'm sure.\n\nUnable to obtain high school love and succeed in life due to her colossal height. Could you imagine being six foot one? Might as well just lobotomise yourself, y'know? Just so abnormal and rare these days. Tall females apparently don't succeed in life. Supermodels? Nope. Olympians? Who? Thank God this wasn't called \"Black Gay Jew\", as if it was treated with the same ill-mannered direction as Tall Girl, it may have been cited as a personal attack. Look, it's a somewhat innocent approach to acquiring self-confidence amidst a wave of pessimism. But when the script hones in on stupidity like cosmetic products inspiring confidence and automatically uplifting exterior beauty, to the point where you become a different person, it's just no! That's not the message we should be sending the next generation!\n\nMore importantly though, let's address the pressing matter here. No one, absolutely no one, gets bullied because of their height. No one! So automatically, there's no relation to the central premise. Never mind the mundane acting, ostentatious directing style and unhumorous dialogue. Those are just rotten ingredients in a disastrous meal. Netflix has, yet again, released another diabolically insulting high school \"comedy\" revolving around popularity and bullying. With a non-sensical reasoning for abuse that cements this as the worst of the year. By far. Six foot one!? Size 13 Men's Nikes!? She's not exactly \"Godzilla\" with clown shoes now, come on!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "seethachymiso",
        "review_rating": "8",
        "review_title": "This reached new heights...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "martin-t1783",
        "review_rating": "7",
        "review_title": "Amazing",
        "review_detailed_main": "Awe-inspiring movie about building self-esteem and finding yourself as an adolescent."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "yokoyakamori-33385",
        "review_rating": "1",
        "review_title": "Victim Complex: The Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "joriethomas",
        "review_rating": "5",
        "review_title": "It's cute and relatable",
        "review_detailed_main": "I liked the movie. I'm 5'11\" and have had these struggles and comments my whole life so I can only imagine a girl that's gone above 6'. I'm not athletic, actually I'm a klutz, so guess my height didn't serve me in anyway to make it cool. I get not everyone can relate and that's fine but I can. Never having shoes in my size, dating guys who are insecure about me towering over them, clothes never fitting, etc. Funny part is, I married a Swede who is only 5'3\" 😂 I got a good kick out of the Swede giant thingy even though his accent was terrible. It actually is kind of hurtful that so many people who I'm guessing aren't any taller than 5'8\" are condemning this like it's not an issue. They've made movies and shows about being overweight, I can't relate to that personally but I enjoyed them and felt empathy for that struggle. I would never judge another's struggle or hardship so if you can't relate, move on."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "matijs-46662",
        "review_rating": "",
        "review_title": "Why tall girl",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "martonban",
        "review_rating": "7",
        "review_title": "Feel good",
        "review_detailed_main": "A nice feel good film with a not so hard touch of the 90s rom-comedies. Perfect to autumn's night."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "anamojsoska",
        "review_rating": "5",
        "review_title": "ending was trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "nawresbk",
        "review_rating": "6",
        "review_title": "Good but where's the comedy",
        "review_detailed_main": "Simple story, Not bad acting, but the movie is kinda slow and not funny at all!!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "PennyReviews",
        "review_rating": "2",
        "review_title": "Not Good Enough",
        "review_detailed_main": "\" Tall Girl \" was just another Netflix bad movie.\n\nThere were many flaws in this movie, but I'll just point out a few : -The exchange student. It was nice that he wasn't English, which was a surprise, but he wasn't Swedish either. He had a horrible accent which he remembered to display here and there. -The stereotypes, like the one about everyone in Sweden being giants. -The girl was attacked because of her hight but I just can't believe that there were no other students with the same hight. -The sister and her odd reaction to her sister's romantic problems. What's up with that? -The big twist in the end was just too sudden and it should have happened earlier in the movie. -The ending was just idiotic. I did appreciate the final point that the movie wanted to made, but the story was not good enough to support it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Spidenus816",
        "review_rating": "7",
        "review_title": "A Much Better High School Romance than THE KISSING BOOTH",
        "review_detailed_main": "It's neither laugh-out-loud funny nor melodramatic. It's just a simple story about struggling to accept what we cannot change and change what we cannot accept. There are certainly better examples of such stories out there, and there are MOST certainly worse ones. I felt like the characters were written and acted in such a way as to make it easy to care about what will happen to them. All things said, I enjoyed this mostly light-hearted and straightforward romantic."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "insultingfilms101",
        "review_rating": "1",
        "review_title": "Tall Girl - 0/10",
        "review_detailed_main": "No spoilers! - Tall Girl\n\nit just is not true lol, being tall does not make every single person in school hate you. They might tease with the \"hows the weather up there\" comments but i dont think that BEING TALL RUINS YOUR LIFE ? If you were born that way i think you should embrace it. The recommended height for modeling for women in the US is 5'10\" and the mc is 6'0\" ? What is the big deal about being tall ? I just dont understand why she thinks that being tall is the worst thing in the entire world. Also all of the 7-10/10 ratings say like \"dont listen to the bad reviews\" but.. if this was a good movie it would have a better overall score than 4/10..\n\nWould not recommend and would not watch again!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dwsrmwolf",
        "review_rating": "9",
        "review_title": "Great movie about true love",
        "review_detailed_main": "Although at first blush the movie seems to be about standing up for yourself (pun intended), I think the fundamental premise of the movie is about true love: truly loving yourself for who you are, what it means to truly love family members, what true love is like between friends and romantic partners, and what true love for a potential romantic partner is not. I picked up on things the second and third time around that I missed the first time."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "6",
        "review_title": "Pretty good comedy",
        "review_detailed_main": "Quite enjoyable funny comedy and a okay story could have been better but still its a okay watch"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jamesfrankie",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Absolute garbage. I can't believe Netflix can go so low. Horrible concept for a movie. Everything is awful about this."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ThisisFizban",
        "review_rating": "3",
        "review_title": "Could've been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "fira-kzn",
        "review_rating": "6",
        "review_title": "Just okay",
        "review_detailed_main": "The comedy is fine but what's up with the make up artist? Why does Ava's (Jodi) make up look horrible?"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sara-caroline",
        "review_rating": "4",
        "review_title": "Average",
        "review_detailed_main": "The guy playing the Swedish guy isn't even Swedish. And when you're gonna make a non Swedish speak Swedish you better do your homework so the person at least pulls off the small amount of words. He did not sound Swedish, that's for sure. Also, 185 cm isn't that tall. The movie is cliche but it's for teenagers, and I'm not a teenager. But try to deliver quality for God's sake. It isn't that hard."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "anthonyjames18",
        "review_rating": "7",
        "review_title": "Nowhere near as bad as people are making out",
        "review_detailed_main": "Found the film to be quite enjoyable and just light hearted. It's not an original movie by any stretch and has been done before time and time again, but like it's predecessors, has its own message it wants to say. It is just a good film for the kids to watch and not to bad for the parents either, so sit back, don't take the world so seriously and enjoy.\n\nHope this helped"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "salsabeelhmer",
        "review_rating": "3",
        "review_title": "predictable trope and cringe imo",
        "review_detailed_main": "Listen im all for representation i mean im a woman of color but this movie was so corny imo i see this exact same trope at least 1000 times :// also the part where she was likee u think ur life is hard im a junior w big feet or something and i was like girl there r bigger problems in the world queen."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "iloveburleson62",
        "review_rating": "7",
        "review_title": "Good Lessons",
        "review_detailed_main": "The set decorations are so strange. Crazy wall papers. Rings of Mean Girls and Disney teen series. Pretty good family movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "huongvuthanha",
        "review_rating": "1",
        "review_title": "the worst film i have ever seen",
        "review_detailed_main": "Such a waste of time\nboring story\nterrible actors\nDON'T WATCH THIS *** MOVIE"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "AhmedHeithem",
        "review_rating": "8",
        "review_title": "Its not that bad !!",
        "review_detailed_main": "Its a good movie the story is fresh and the ending is good but all that hate because the actor didn't talk swedish well 😏😏"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mcart-46642",
        "review_rating": "6",
        "review_title": "I am 16 and I am 6'9",
        "review_detailed_main": "So they a making out that people if your tall can't find love 6'1 ft is not that tall it's only 185 I am still 21 cm taller like what the heck\n\nThis movie must take place in the hobbit"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Falkunfetur",
        "review_rating": "2",
        "review_title": "I'm 6 foot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "astone-03682",
        "review_rating": "3",
        "review_title": "Unrealistic. This \"tall\" girl is throwing a pity party.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "rebornpss",
        "review_rating": "7",
        "review_title": "If you were an outcast you will relate",
        "review_detailed_main": "This movie is not meant to be precise or realistic about it's characters. You might even think that the girl is not tall enough. But in reality when you are a teenager and you are slightly different from the average you will feel like an outcast. It can be anything. If someone makes fun of you for it. Or your family makes comments about. It's all what you will see wrong about yourself. The movie is about this girl struggling to see herself, despite what people have defined her as. If I still was a teenager in crisis it would have given me a little inspiration to accept myself."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "audraeburton",
        "review_rating": "1",
        "review_title": "Netflix is grasping",
        "review_detailed_main": "This movie is seriously awful. I'm only writing this sentence because I have to write more to post this review. But the first sentence sums it all up."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "locklearconsulting",
        "review_rating": "6",
        "review_title": "John Hughes knock-off but OK",
        "review_detailed_main": "Sweet little film that has bits of John Hughes classics like Pretty in Pink and Sixteen Candles. It has Ducky and a rager party and teen angst."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "VS132",
        "review_rating": "5",
        "review_title": "\"I'm Tall And I'm Proud!\"",
        "review_detailed_main": "Tall Girl is much like Newton's third law. For every good (even great) elements the film offers, there are equally negative elements that do weight it down to its full potential. The acting was solid, but the popular click are extremely unlikable. The emotional moments and interactions are priceless, but the story and half the humor are a mess. Yeah the message (though cliche) was very well told, but some characters barely contribute. Even with a relatable character like Jody, the film is decent at best and did it's job right to entertain some people. By the way, loved Paris Berelc's performance."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "carolinelovesalan-06395",
        "review_rating": "",
        "review_title": "What the hell?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tiffanytallent1981",
        "review_rating": "7",
        "review_title": "I Really Liked it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ViciousCXY",
        "review_rating": "1",
        "review_title": "What is this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cartman_usaf",
        "review_rating": "9",
        "review_title": "A really good 2/3 of a movie",
        "review_detailed_main": "It was funny, sad but the last part was ok. Ava Michelle is a very beautiful girl. I hope she continues on the acting."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jon_pratt12345",
        "review_rating": "6",
        "review_title": "Not ground breaking but enjoyable",
        "review_detailed_main": "The story built reasonably well and some of the core characters developed in a satisfying way. I did find the peripheral characters very undeserved, particularly the best friend and sister. The script was fine and the acting was decent. Overall this was a conventional concept, executed by the numbers but I still found it enjoyable."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "CabbageCustard",
        "review_rating": "3",
        "review_title": "I lasted about 20 minutes",
        "review_detailed_main": "The shorts made me think that this might actually be a quirky, funny comedy. It's not. It's your typical American teen movie where the 'teens' are all played by twenty year olds. It boasts the usual cast of stereotypical 'teen' movie characters too - the smart annoying sidekick - black of course; the wise cracking pain in the neck hanger on; and Steve Zahn playing a harassed, clueless father - yet again. I didn't see the end of this, but I think we all knew how this would end while the opening credits were still running. I lasted 20 minutes or so before I gave up and looked for something better to watch. It wasn't a difficult search."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Nathan_Needs_A_Username",
        "review_rating": "2",
        "review_title": "Allowing Instagram to Decide What I Watch While in Isolation Day 2:",
        "review_detailed_main": "Did this film actually imply that cheating is okay if it's with someone who is less popular than your current girlfriend?\n\nA decent soundtrack (for the most part) is not enough to save this from being a generic \"comedy\" for whiny, self impressed pre-teens."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "saphira1310",
        "review_rating": "6",
        "review_title": "Not as bad as everyone says",
        "review_detailed_main": "My expectations of this movie were pretty low considering everyone said it wasn't worth the watch. I decided to give it a chance and it really wasn't that bad. Classic teen movie and pretty much exactly what I'd expect from a Netflix original, at least in this category. Everyone's complaints about her complaining she's \"tall\" are so over dramatic it's honestly ridiculous. Yes there are more pressing issues in this world and everyone understands what those struggles are. And apparently if one movie doesn't depict every single struggle every person deals with in the world, it's a terrible shallow movie? I personally didn't think it was bad and would put it on the same level as Sarah Burgess, To All The Boys..., and The Kissing Booth. Not bad but also not great."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "fieaoremaolmuire",
        "review_rating": "3",
        "review_title": "\"How's the weather up there?\"",
        "review_detailed_main": "To be fair, the horribleness of Tall Girl is so absurd it's almost comedic. I laughed for the most part of the film. However, given that the makers' intention wasn't to make me laugh at the parts I was laughing at, I rate this movie three stars.\n\nMy favourite part was when Jodi, the main character, says something to the effect of \"I stopped playing the piano because when you're good at something, people want you to do it, and I didn't want to give them a reason to stare\" in her most serious, melancholic tone of voice. Oh, and when her parents thought she was a freak of nature and compared her to the tallest man in the world. And also when three people in a row greeted her with \"How's the weather up there?\"\n\nP.S. Why did the Swedish guy's eye colour change from bright to dark at random? I thought they had switched actors mid-shooting!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "aimeevanhekken",
        "review_rating": "6",
        "review_title": "It has potential but is not living up to it unfortunately",
        "review_detailed_main": "There are some nice moments in this movie yet it seems poorly directed and executed.\n\nAt moments it's a B movie to me het unfortunately there are also C movie moments, and I wanted it to get better but it just didn't. For me it was an okay, wish it was better moviez."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "JC_Ride",
        "review_rating": "2",
        "review_title": "Years go by, yet Hollywood still fails to bring a remotely accurate representation of high school.",
        "review_detailed_main": "How is this a 2019 movie? This feels like it was made in 2007. Does Hollywood actually think that tall people are social outcasts? Especially preety and rich tall people? Did the people who make this actually ever attend high school? This is one of the most out of touch movies I've seen in a while. But it mentions the words battle royal so it's cool amiright? The characters are all walking stereotypes and none of them, not even the protagonist, are likeable or even remotely good people! Not to mention the acting is average at best, the humour is painfully bad and the plot has every single high school movie cliche in the book. The levels of unoriginality are staggering. The 2/10 rating is generous. Also, sidenote, if I was Swedish I'd definitely give this a 1."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "todor_pe",
        "review_rating": "6",
        "review_title": "Definetely not a oscar winning material but not bad",
        "review_detailed_main": "Well nobody will remember this movie in 2 years but overall above the average teen movie. I think the sidekicks were great specially the sister and the father. I had some genuine laughter. The tall girl and the swede were not the best actors but still you kinda care about them. Perfect movie to watch while scrolling internet on your phone."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "micheleklassy",
        "review_rating": "5",
        "review_title": "I was the tallest female in kindergarten",
        "review_detailed_main": "I'm only halfway through this movie and it's just annoying me. I'm 6'3\" and have been since 10th grade. The daily torture was horrific and still is. I literally can't leave the house without someone screaming \"Damn! You're so tall!\" People are mostly dumb and feel like they have to remind me. The \"Do you play basketball?\" line is the most used of course. Met a fellow tall person that told me to respond with \"Do you play mini golf?\" That's awesome. Hehe"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "genabon-87812",
        "review_rating": "10",
        "review_title": "Men's size 13 nike's",
        "review_detailed_main": "If you're complaining about watching this movie at least you don't wear men's size 13 nike's"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "isalyer-18069",
        "review_rating": "7",
        "review_title": "A bit cheesy, but a cute film",
        "review_detailed_main": "Sure, the movie might be a little cheesy, but I thought it was a cute story, and I think it gets a lot of unwarranted criticism from people. I thought it was a nice movie, and I'd definitely recommend it if you're on the fence about watching it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "anarchyONtheSHORTbus",
        "review_rating": "3",
        "review_title": "Mehh...",
        "review_detailed_main": "I tried to like this, but couldn't. Steve Zahn and Angela Kinsey and the reason for the crate were good, but everything else fell flat. None of the characters were well developed and the main character was unlikable. No chemistry between anyone, so it was pretty much anyone's guess who would end up together at the end. Definitely overplayed the whole height thing, because 6'1\" isn't that tall."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ktabby",
        "review_rating": "1",
        "review_title": "Worst film I've ever seen!!",
        "review_detailed_main": "The acting wasn't so bad but the storyline was seriously awful.\n\nIt shames women for giving birth by C-section, which is disgusting.\n\nIt also normalises stalking (creepy 'best friend', who continually pressures Jodi and makes her feel bad for not wanting to be with him).\n\nIt is, without doubt, the must cringe-worthy, disappointing film I have ever seen, ever."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tashanatmarshall",
        "review_rating": "6",
        "review_title": "Cute movie",
        "review_detailed_main": "It was definitely a cute movie. More geared towards the teenage community. But I've seen better rom coms."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jeremyjreimers",
        "review_rating": "2",
        "review_title": "what is this...?",
        "review_detailed_main": "So we have a tall, thin, blonde high school girl who comes from a rich family, plays piano and sings like a professional... oh, and she happens to be tall. She's only about half a foot taller than her peers (6'1\"), but they're sure to cast short people as her parents to make her look even taller. They treat her like she has elephantiasis despite her just being a bit taller than average and she acts like she's a circus freak. Literally everything in her life is perfect except shes a bit tall and makes it a huge issue.\n\nA guy shows up. Not just any guy, but a Swedish foreign exchange student who happens to be the same size as her. He's literally perfect. A genius model singer with an accent. Every girl wants him. There's a \"hot\" popular girl in high school who speak literally language fluently (because why not) and she's perfect too. She moves to take him and he's just kinda there, going along with it.\n\nBut NO!! He doesn't want the perfect girl, he wants the awkward model pianist who again, happens to be a bit tall.\n\nEnd movie"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "geraldmcginty-51583",
        "review_rating": "7",
        "review_title": "Use Your Differences To Empower You!",
        "review_detailed_main": "It was a great movie, filled with inspiration and EFFECT\n\nI really loved this movie,\n\nThis movie (Tall Girl) was about a girl who struggled with her height (it made her feel self-conscious). So basically she allowed it to overtake her confidence. It also didn't helped that she got teased for it for most of her life especially in high school (typical). Then later in the movie this exchange student came rushing in, and changed the bar for her. She crushed on him, and wanted him. Then it began that she started to get in this fight with this other girl (Kimmy), 'his girlfriend'. Jodi had a lot of empowering friends (Jack) who empowered her to be her unique self and her best friend Fareeda (the feisty one) who kept pushing & pushing & pushing, who had her OWN lifestyle.\n\nThe whole story that I took from it was STAND UP to adversity, because nobody is going to do it for you. She had a really supportive friend, one who bluntly was herself. She was strong willed and kind. She was basically 'the difference' in the whole story, (Fareeda) at least I believe that to be true.\n\nI think it was a very creative intake. When I looked at the cover of the movie, the thumbnail) from both NetFlix and YouTube I wasn't pleased, I felt I wasn't going to like it. It looked shallow to me. But my opinion was changed, when I watched the NetFlix trailer.\n\nThis movie basically teaches that it's okay to be different, that as a matter of fact it's GREAT to be different. I am very blessed to have seen this movie (Tall Girl) and that it was about a unique difference. The tallness thing meant a lot to me, as many abnormal differences would. Use your differences to empower you.\n\nIn this movie, there were a lot of the famous shows actors/actresses in it, and usually I don't care for that or just don't care. Just the people they put in, and how they 'roled' them in was just awesome. I strongly struggle watching this, especially if you feel there is something different about you and you don't like it. Because the truth people (*especially high schoolers) will usually see the worst and point out the difference in you in a very negative area. But please be strong. BE STRONG. Great movie, watch it NOW!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jumie_samsudin",
        "review_rating": "4",
        "review_title": "THE SCRIPT IS SO NOT FUNNY",
        "review_detailed_main": "The script is so forcefully trying to be funny but its not."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jgardiner-871-726729",
        "review_rating": "7",
        "review_title": "Find your own message in it",
        "review_detailed_main": "I'm so used to Asian movies now that when I watch an American movie and two people who just met kiss. It seems wrong somehow. She says I'm sorry and he says I'm not. Seems so unreal.\n\nShe didn't appreciate the guy who had loved her for so long and even her friend she had dissed. Life teaches us some hard lessons sometime and we need to wake up and smell the flowers.\n\nWhen we are young we make mistakes but the man who loved her made sure he was always ready to reach upward.\n\nLovely little fluffy, cringy and sweet love story for young adults. Find your message in it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "suzistringeris",
        "review_rating": "2",
        "review_title": "Tall Girl Gets Shamed",
        "review_detailed_main": "I'm 5\" 11 and a girl. I found this film insulting. I can understand if was firirected by or the screenplay written by a tall lady who got picked on. Well I got picked on. Get over it. I'm not tall. Men are short. Most men I know are six foot or taller. I hate these stereo type films. Does she get the guy? No. He's five foot eight"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "illisia42",
        "review_rating": "8",
        "review_title": "Not as bad as other people think!",
        "review_detailed_main": "A lot of these reviews are from people that were offended by one line (a comment about caesareans) in the film, or tall people who think the film is \"unrealistic\", etc. I am not a tall person and I wasn't offended by that scene (although I can see why a person would be, so if caesareans are a tough topic, steer clear of this), so I am going to give a review of the film from a more neutral perspective, here.\n\nFirst of all, that s is a teen romcom. If you are expecting something with real depth, look elsewhere, because you won't find that here. This film is cheesy and predictable! But that's not necessarily a bad thing. The basis for the plot is a unique one, the acting and direction was good, the soundtrack excellent, and the final scene made me really, really happy, and at-the-end-of-the-dat, isn't that \"ticking all the boxes\"?\n\nI agree with other reviews that perhaps this isn't\"realistic\", but it's not supposed to be! Again, if you want realism, look elsewhere. If you want *escapism*, something unusual, something feel-good, something cheesy, this is your film!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "luxuria1",
        "review_rating": "3",
        "review_title": "Her hight is normal in the Netherlands",
        "review_detailed_main": "Over here her length is perfectly normal. I know, we are the tallest people in world (I am a woman 169cm/66,53 inches and 6cm/2,36 inches below average over here).\n\nWhen I heard her hight at the begining with scene the boy who was 2 heads shorter than her(the boy who wanted to ask her out at first), I was only thinking... Why is that guy body shaming her while he is short for his gender.\n\nThat said, I don't think this is a good message for girls, because of the normal hight. Boys/girls short or tall, fat or skinny, there is a size for everyone! (As we say over here, op elk potje past een dekseltje: On every jar fits a lid)\n\nI think if they went for an absurt hight, it would be more watchable."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "elizabethmpatterson",
        "review_rating": "4",
        "review_title": "Stop auto-tuning!",
        "review_detailed_main": "I was getting in this fun, feel good teen romance... and then it was decided it was a good a idea to add in an auto-tuned song. For what was ultimately a throw away moment in an overall decent scene, it took me out of the movie enough that I needed to stop watching.\n\nAlso, joking about the ugliness of a c-section scar is a little off color considering it wasnt that funny of a line overall. Maybe would have played a bit better if the script writers had decided to play it differently (like if vapid, surface deep mother always talked about the c-section she needed to bring tall girl into the world. )\n\nJust some very bad choices overall."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "krbass-19277",
        "review_rating": "7",
        "review_title": "Just light hearted fun",
        "review_detailed_main": "I enjoyed this movie for what it is-lighthearted and predictable. I'm mostly writing a review because one reviewer noted \"absolutely no one gets bullied for their height.\" I can say that's not true! :) I'm 4'9, and even as an adult I get stares and all sorts of stupid comments that don't really bother me now. I was absolutely bullied in school for my height and cried more than I care to remember about how mean people could be. I totally related to the character's insecurity, just at the other end of the spectrum!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "nielsvdc",
        "review_rating": "5",
        "review_title": "Tall girl or small people",
        "review_detailed_main": "Yeah, not really that great of a movie. In the Netherlands we would call it a school with little people and one normal length girl."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Vetrrich_Chelvan",
        "review_rating": "7",
        "review_title": "A plain and simple feel good film",
        "review_detailed_main": "The film doesn't offer much, I agree but it's better than crappy films we see these days. I really loved the artwork and the little metaphorical details added to the film which makes it even more better.\n\nJust go for it or read a self help book. It will do."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "draftdubya",
        "review_rating": "2",
        "review_title": "Garbage",
        "review_detailed_main": "A 6'1\", wealthy class, blonde, pretty girl is just so down. The coaches at this school must have been smoking crack. They would've hounded her to be on the basketball or volley ball teams. Did she go to a school full of mini people? Those shorter guys would've been drooling over her(look up rule 34 giantess). If you really want to see a messed up high school girl, the pay attention to the chubby girl in Euphoria."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "davidsask",
        "review_rating": "6",
        "review_title": "It Is No Dumplin' Watch That Netflix Movie Instead!",
        "review_detailed_main": "Reverse pleasantly plump girl with Tall one! Less emotion, less acting skills. There is even a peagent in this movie, boo! Definitely tries to take some cheat notes from John Hughes (R.I.P) movies, not like that is difficult. Go watch those classics instead! Then talk with your parents the generation time differences, find out which ones are better and stand test of time! We know the answer! Added 2 stars for cute ending and quote, Hey am sucker he he 6./10"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "wanted to like it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "nf123",
        "review_rating": "8",
        "review_title": "Sweet movie for young tall girls",
        "review_detailed_main": "I would've loved this movie when I was a very tall teenage girl. This is a nice confidence booster for anybody who is different. I'm exactly the same height as a main character 6'1.5\" so I can relate. Where i'm from, people are generally not tall at all and I really was taller than any person at school. I was about 21 or 22 when I realized i'm not a bad looking woman and started having fun. When I moved to the US, I saw that population here is much taller and really got all the confidence I needed."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "boboceaelena",
        "review_rating": "6",
        "review_title": "Another movie branded Netflix",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "missyhurst",
        "review_rating": "4",
        "review_title": "A little cliche",
        "review_detailed_main": "For what it is, it was fine. I liked that they covered the pleaser box with that geometric paper, but they were still stripper heels in the original box lol... the premises was weak, 6'1 isn't obscenely tall. However if you're looking to watch something to kill some time, it has a cute message and is Worth a watch"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Thanos_Alfie",
        "review_rating": "4",
        "review_title": "Below average...",
        "review_detailed_main": "\"Tall Girl\" is a Comedy - Drama movie in which we watch a young girl feeling very uncomfortable due to her height. She is the tallest girl in her high school and she tries to avoid the attention of others. After some time she has to find the power to stand up and be just herself.\n\nI did not find this movie interesting and the way it was presented such a sensitive subject was not the best. The direction which was made by Nzingha Stewart was below average and I believe that her movie is for kids between 12 and 16. The interpretations of Ava Michelle who played as Jodi Kreyman, Griffin Gluck who played as Jack Dunkleman and Luke Eisner who played as Stig Mohlin were average and none of them succeed on creating a bond between him/her and the audience. All in all, I have to say that \"Tall Girl\" is a boring teenage movie that does not have anything to give so, I do not recommend it to anyone."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dodds-j",
        "review_rating": "",
        "review_title": "Ava just being herself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "danchilton-71955",
        "review_rating": "6",
        "review_title": "Disney plus",
        "review_detailed_main": "Essentially one of those highschool message films you find on the disney change channel with slightly higher production values. This means a fair amount of cringe to sit through but its mostly fun and the majority of the youngest cast are pretty good, with Sabrina Carpenter stealing the show as the tightly wound pagaent queen big sister. Loses points for casting a non Swede who cant hold the accent as the exchange student."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "carrey_85",
        "review_rating": "1",
        "review_title": "Tall seriously, try being ugly or fat, or both",
        "review_detailed_main": "Just the concept makes it the most stupid movie in history..Try being ugly for a day, how is being tall even a problem?\n\nNext time make it about a fat guy in a wheelchair.."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "roseagle",
        "review_rating": "6",
        "review_title": "Ok but could've been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "adsmith-03364",
        "review_rating": "1",
        "review_title": "You want to talk about oppression?",
        "review_detailed_main": "Ok so sad rich white girl with a terrible attitude and horrible personality thinks she's oppressed because she is heinously tall. And by heinously tall, I mean she is 6 foot 1. Only 6 foot 1!!!! I am sorry but ma'am, that is not even that tall. Girl be walking around like she some kind of freak of nature but shes actually the size of a short college women's volleyball player. She's super model height. I have no sympathy for this girl whatsoever, especially considering how terribly she treats everyone around her and how she is constantly complaining about how bad her life is. Maybe the reason you cant find anyone to date isn't because you're tall, but because you literally act like infant. Like were we supposed to feel bad for you? I was genuinely confused. You want to talk about real oppression, make a movie about the people suffering in Afghanistan. Make a movie about trafficking. Make a movie about people experiencing racism. But making a movie about a relatively tall girl who cant find a date to prom because she is oppressed and goes to a school of men who are exclusively under 6 feet tall...? Yall are ridiculous lol. Don't even get me started on the ending, i actually was so embarrassed for everyone involved with the film when i saw it. Thought and prayers go out to everyone still recovering from this film."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "calbrity",
        "review_rating": "6",
        "review_title": "It was just ok!",
        "review_detailed_main": "Like others I feel like it had potential but missed the mark a bit. The overall theme about loving yourself was nice especially for teens but it was pretty formulaic in general. And as a person who went through a pretty traumatic C-section I cringed at that whole part. It's unfortunate and could have been written differently without using it. Basically not essential to the plot line and ruins the point of loving yourself no matter what cause who wants an ugly scar across your belly (face palm). Anyways I agree that with all the canceled TV shows Netflix is doing. They are making themselves out to be the Hallmark channel or all MA material. They can do better."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "micaj-26849",
        "review_rating": "1",
        "review_title": "awful",
        "review_detailed_main": "The STUPIDEST movie they've made yet. the movie is literally about the opression of this white girl in high school for being tall. oh yeah bc TALL WHITE GIRLS are facing the MOST opression right now lmao"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mztracyr",
        "review_rating": "8",
        "review_title": "I was the TALL girl",
        "review_detailed_main": "I thought this was pretty perfect. I was the tall girl, 6'1\" by seventh grade. The only people taller were the male teachers and they were only a couple of them. Ava Michelle did a wonderful job here. It helps that she is herself a tall girl. The kids walking by asking, \"how's the weather up there?\", happened a few times a week. Being called Sasquatch was a daily thing. Unless you were, the tall girl, I don't think you can actually understand. Always easy to find in a crowd, because you stood two heads over everyone. And for those saying 6'1\" is not that tall, it is when you're the only one around that's that tall. Most likely those people are younger because yes, girls are taller now. But back in the 70s, nope. And if you if you didn't play sports, well... I loved how people always asked if I play/played basketball. Really! Yes it could've been better, yes the foreign-exchange student should've learned his accent better, but all in all it worked IMO! It actually plays more like a movie of the week so that's why it's probably a little cheesy in spots."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "carvalhinha",
        "review_rating": "7",
        "review_title": "i like and i dont like",
        "review_detailed_main": "The messege was kinda confuse, and 1,85? This is not a height to blow your mind. But i dont know, was good"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "fareedarowland",
        "review_rating": "2",
        "review_title": "This movie inspired me to do my laundry...",
        "review_detailed_main": "The main character (tall girl) has the charisma of an ironing board. She's boring and whiney. And FYI I have a huge ugly scar across my belly after my an EMERGENCY C SECTION cause my baby girl was in distress during birth... And I would opt for a million ugly scars if it meant having her.. So up yours Netflix!!!! And like I said... After about 30 minutes of this trollop of a movie, I decided to do my laundry instead."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "seshygrl89",
        "review_rating": "1",
        "review_title": "Toxic men everywhere",
        "review_detailed_main": "I have usually enjoyed Netflix's teen romances but this one bothered me the whole way through. The \"nice guy\" basically claims ownership of the main girl because he's always been in love with her and even though she's told him \"no\" repeatedly, he never gives up. He even goes so far to sabotage a potential relationship with someone she's actually interested in and I think he is the reason why that guy turned into by following his terrible advice. The scene where he goes into her room while she's sleeping is just creepy. He even says that he would wait for her forever even though she didn't want him at all. This movie tells guys everywhere that you can wear a girl down and to never take no for an answer. This guy had even an opportunity to move on with someone that actually liked him, but he wanted what he couldn't have. The dad wasn't much better because he kept basically saying there was something wrong with his daughter the way she is, though at least he realizes his errors. The main guy that the girl wanted, even though he was following the very bad advice of the other guy, it doesn't absolve him of being him either. This movie is garbage."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "llamaalpaka",
        "review_rating": "7",
        "review_title": "Great - the end disappointed me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "punkyello",
        "review_rating": "2",
        "review_title": "TERRIBLE!",
        "review_detailed_main": "Look, I'm not comparing this to a super indie alternative deep film, I love cheese teen movies from the 80s, 90s, 00s and so on.. but this one had no sense at all. The cast it's not even that bad, but the writing and direction.. oh my.. you have to respect, at least, your own narrative. No surprise it's the first script from the writer. You can pass this one or just enjoy the unnecessary, but always welcome, appearences of Sabrina Carpenter and her beautiful deepp voice."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "viktoriasporre",
        "review_rating": "6",
        "review_title": "Why always old names",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "leleveronez47",
        "review_rating": "2",
        "review_title": "Really bad",
        "review_detailed_main": "I dont know where to start..she is not that tall, the comment about c section was terrible, her best friend was stalker and they have no chemistry. The main caracther was so boring and with no personality"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "karljoaquintuazon",
        "review_rating": "6",
        "review_title": "Good film and charming at the very least",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ricardoibarran",
        "review_rating": "1",
        "review_title": "Surprisingly bad",
        "review_detailed_main": "6'1 is not even that tall.\n\nTall girl is not a nice person.\n\nNo message No real character development.\n\nI mean this is a really bad movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Sueso",
        "review_rating": "9",
        "review_title": "Great movie without nasty words or!",
        "review_detailed_main": "I'm amazed! I guess everyone is missing the sex, effen words, violence? Altho there was some violence come to think of it!) I was delighted to see that my grandchildren could watch this movie and learn a few positive things. It was not a classic, it was a show for teens! Thank you to those who care enough about our kids to make something worth watching and not making me cringe. Delightful!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bbduffus",
        "review_rating": "6",
        "review_title": "here we go...",
        "review_detailed_main": "My full review on tall girl: it wasn't the worst movie ever but certainly not the best. many parts were exaggerated in weird ways and like i have never meet someone who gets made fun of for being tall especially that severely lol. the ending was nice and i am satisfied on how they resolved the conflict. 6/10 would not recommend but would also not not recommend"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "starrynightsas",
        "review_rating": "1",
        "review_title": "I almost died from disgust",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tanna_reviewin",
        "review_rating": "1",
        "review_title": "If I could laugh, I could... The sheer stupidity of this movie is insane.",
        "review_detailed_main": "Honestly, why.\n\nEvery once a year, sometimes more, sadly, some really bad-cringe-haha-meme-on-tiktok movie comes out. And yeah, people like me want to watch it. To see the sheer stupidity and then regret the time wasted.\n\nAnd, alas, I did.\n\nWas it good? Of course not."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "MovieIQTest",
        "review_rating": "",
        "review_title": "Why not made this character more athletic?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "stefanamladenovic",
        "review_rating": "7",
        "review_title": "Unique story",
        "review_detailed_main": "This topic is quite unusual because it is not talked about it very often. I come from eastern Europe and in our country it is normal for female person to be 6'1\". Men are usually 6'4\" so it is interesting to see something that is normal in one country in other is stigmatic. Nice romantic comedy and it shows how love has no rules."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bergviciers",
        "review_rating": "2",
        "review_title": "Horrible for self esteem",
        "review_detailed_main": "Hate it. In this movie a tall girl gets a tall swedish guy crush and he never notices her and gets bullied. Her sister is a pageant queen and her mom is shorter and 'pretty' I like the tall girl character, going through bullying myself, but it portrays a very unrealistic harmful view to girls mainly (like me) showing that all your worth is for a guy. Having bad social anxiety, I related to the main girl character who feels single. (doesn't get invited to prom) and gets jealous understandably. I have been in this situation before.\n\nNot really inspiring for females to be single or independent. Showing them 'all you need is a guy to be happy' and the kindest guy in the film didn't even get much attention. It's all about popularity and who's the best. I hated the popular girl who flirts with the new boy and found her soo annoying. She was really nasty as well. I don't think any guy in real life gets flirted with that much. It was sooo dumb. As if an average Swedish guy looks like that, he's a popular actor and gives false representations of men. A lot of good looking men in Sweden are 5'7, so it's putting them to shame."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Snootz",
        "review_rating": "6",
        "review_title": "Almost a good movie",
        "review_detailed_main": "The redeeming part of this movie is the often-witty and enjoyable script. That kept me entertained most of the way through. And overall I enjoyed the film.\n\nHowever, a rather weak ending along with questionable plot elements pretty much knocked it off its perch. First: 6'1\" is indeed a tall girl, and school kids can be very cruel and mean. But every high school basketball team in the nation would be after her... as would any music academy (she was presented as an excellent pianist). So that fact kept sticking out all through the film. (On the other hand, ask anyone who has ever been teased about being short or tall or not the body-idol norm... and they'll verify the experience.) High school can be horrid for those who aren't \"part of the crowd\".\n\nThen there are the cliche characters... such as the older sister who pretty much had no purpose in the film at all. One might consider that between the two she was the actual \"freak\"... but it was a point poorly made and the part badly designed. The incompetent parent shtick, the all-knowing too-wise-for-their-age friends, the somewhat goofy principal... it's been done before. Lots.\n\nBut the biggest letdown (without spoilers) is the last 10 minutes of the movie, where it devolves into rather awful. The \"microphone\" scene was a complete wince moment that made me wonder what the writers were thinking (and what caused them to suddenly plunge to an after-school special mentality). The final few minutes while endearing were not enough to save the movie from what had gone just before. Ouch.\n\nSo all I can give this is a barely-above-mediocre 6 stars. I did find most of the movie entertaining, despite its flaws, but I do wish they'd have landed the ending better. It's like a plane that almost reaches its destination (with a lot of turbulence)... and then crash! Short of the runway."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "locxey",
        "review_rating": "1",
        "review_title": "Top 3 worst movies ever.",
        "review_detailed_main": "The whole movie is all about a 6'2 girl who throughout the movie is bullied nonstop for being too tall. Throughout the whole movie, all of the events seem so artificial. This is most of these actors first or second movie and this does not help. Being 6'2 as a female in high school isn't a disease like this movie portrays. Second worst film i've ever seen right behind Amy Schumer's standup comedy."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "andjones-55655",
        "review_rating": "7",
        "review_title": "Surprisingly fun.",
        "review_detailed_main": "Cast was pretty good, decent humour, satisfying conclusion, simple fun movie, no preachy political cringe which is a biiiiiiig plus for a 2019 movie.\n\nSuited for younger audience."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "fatt1988",
        "review_rating": "8",
        "review_title": "Not award worthy but enjoyable",
        "review_detailed_main": "I really don't get the hate for this movie as if most of the people who write the review is expecting and award worthy film. I don't care much about the Swedish accent since English isn't my native language anyway. I found the movie is fun but the script isn't really good at point and it really kind of cliche in a way. However I enjoy this movie as much and didn't expect that the main character didn't get the Prom Queen as I would think it is going to be which is great. I'm 5' 11\" and 6\" taller than average height in my country an 6'2\" is really tall here (don't get it why some complaint she isn't tall enough)."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "coollittlealien",
        "review_rating": "1",
        "review_title": "All the wrong messages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "becky-92346",
        "review_rating": "1",
        "review_title": "I wish I could give this 0 stars.",
        "review_detailed_main": "Tall Girl (2019) follows Jodi, a teenager who feels uncomfortable in her own skin due to her height, as she tries her best to gain confidence. This movie is terrible, with no redeeming qualities. I had no fun while watching and I couldn't wait for it to end.\n\nThe cinematography is bad, and you can tell no effort really went into it. The colour palettes are dull and the camerawork is lacklustre, the lighting is okay but very unimaginative. Additionally, the editing is too goofy, and not in a charming way. It just comes off as messy and irritating.\n\nThere isn't much to mention when it comes to the sound design, but the original score is terrible and incredibly grating. The soundtrack used is also very unfitting and makes the film feel even more messy.\n\nThe acting is bad from everyone, which isn't helped by the terribly written and dumb dialogue. The main character is extremely unlikable, and her best friend and eventual love interest, Jack, is even worse. Jodi and Jack have absolutely no chemistry, which makes the ending even more ridiculous and infuriating to watch. The writing feels super out of touch when it comes to teenagers and I can't think of anything nice to say about it!\n\nLastly, Tall Girl (2019) is a fast paced mess of a film, and not enjoyable in the slightest. The plot is so dull with no driving force, resulting in a movie that is almost painful to watch. The ending left me angry and I wouldn't recommend this film to anyone."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ersbel",
        "review_rating": "",
        "review_title": "Painful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sarandivyam",
        "review_rating": "6",
        "review_title": "Netflix Movie: Tall Girl (2019)- Review by Divyam Saran",
        "review_detailed_main": "I recently saw the movie, Tall Girl (2019), which is a Netflix rom-com movie. I came to know about this film because it is produced by one of my favourite producers McG who has earlier made films like Charlie's Angels, Charlie's Angels: Full Throttle and Terminator Salvation. The movie is a good treat for the teens and college-going class. The film begins with Jodi Kreyman (Ava Michelle), who due to her abnormal height is not able to involve in any sort of relationship with her college mates. Though her role is quite serious, there are moments with a lighter note too. Paris Berelic plays the role of Liz who is Jodi's best friend and serves as a source of constant motivation for her. Sabrina Carpenter plays the role of Jodi's sister and an aspiring model. Griffin Gluck plays the role of Dunkleman who is Jodi's childhood friend and is in love with her. The events of the film take a drastic turn when the second main protagonist, Stig Mohlin (Luke Eisner), a foreign exchange student enter Jodi's college. I would like to mention that the cast does not disappoint us but I still consider it to be a very ordinary project. The storyline too is very ordinary while the screenplay and direction are fine. The matter of the fact is that the movie holds you till the end and does not bore you. If I summarize in two lines, I would say, Tall Girl, is not a movie with depth. It has nothing new or fresh to bring to the genre. I would give this film an average rating of 6 stars and would advise that if you have free time this weekend then give this movie a one-time watch."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jesser299",
        "review_rating": "5",
        "review_title": "sweet but bland story",
        "review_detailed_main": "This is a movie best appreciated by adolescents. It's about the pains of feeling awkward as you grow up, and you don't have to be a tall girl to appreciate that message. It's a sweet story. Not a groundbreaking teen movie by any means, but a nice one."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ChristianMovieGeek",
        "review_rating": "7",
        "review_title": "Strong Cast Chemistry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "WaddoVisuals",
        "review_rating": "1",
        "review_title": "Tall Girl: A Film Not To Watch",
        "review_detailed_main": "\"Tall Girl\" falls short in addressing important themes like self-acceptance and body image. The film's execution lacks depth and authenticity, opting for simplistic messages that don't explore the complexities of these issues. Instead of offering meaningful insights, it relies on tired clichés, failing to deliver empowering moments.\n\nVisually, the film is unremarkable, with uninspiring cinematography that fails to capture the audience's attention. The low-budget production values further diminish the viewing experience.\n\nIn summary, \"Tall Girl\" is a forgettable teen rom-com that brings nothing new to the genre. Its predictable plot, shallow characters, and superficial treatment of important themes make it hard to connect with or find any redeeming qualities. It leaves no lasting impression and lacks a compelling and meaningful story."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "afoustanou",
        "review_rating": "1",
        "review_title": "trash",
        "review_detailed_main": "One of the most trash movies i've ever seen, and i watch a lot of trash movies. The script was written by an isolated 5 year old that probably never saw the world, and all the actors r trash. peace."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sldean131",
        "review_rating": "9",
        "review_title": "Simple Yet Relatable",
        "review_detailed_main": "I really enjoyed it and was sad to see so many negative reviews. No, it's not a deep intellectual commentary on modern day teenagers. I would compare it to YA romance. If that's not your thing, you'll probably find this movie too light and fluffy, but I personally like the \"love the skin you're in\" teen romance. So, for me, this film checked off all the right boxes and left me with all the feels.\n\nPs. I LOVED the ending. *warm, fuzzy feels*"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hildefledderman",
        "review_rating": "6",
        "review_title": "Tall?",
        "review_detailed_main": "She should come and live in the netherlands. Every dutch girl is around her size 😂"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "castorlongueville",
        "review_rating": "4",
        "review_title": "A fun satire comedy!",
        "review_detailed_main": "If you completely ignore that this is a movie, and you take a shot everytime they make a joke about Tall Gorls height. Then it's laughable at best and a palm to the face at worst. So if taken seriously as a teen drama, its -1/10. But as a (bad) comedy, it's at least 4/10."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mjbartko",
        "review_rating": "1",
        "review_title": "My 14-year-old daughter made me watch this as a form of torture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dugle99",
        "review_rating": "",
        "review_title": "This was not good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Moviebuff_Chennai",
        "review_rating": "7",
        "review_title": "Highschool rom com speaking American culture",
        "review_detailed_main": "Comedy Romance\n\nSimply good and liked it when watching.\n\nThe concept simply was clear and definetely it would be the culture in America. In India, we can find hell a lot of these kind of classrooms with similar plots..\n\nThats is different and this Tall Girl speaks about her personal feeling at the high school and people around her. The script had fun all over the play and sentiments as well.\n\nAll the characters were provided with good weightage and ending."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "chelseakowal-04111",
        "review_rating": "7",
        "review_title": "Predictable",
        "review_detailed_main": "Although it had a clear positive message this movie was predictable. The overall message was what made this movie. I enjoyed most of it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "linksfraulein",
        "review_rating": "1",
        "review_title": "Trauma, thy name is height...",
        "review_detailed_main": "Hey everyone, remember Precious? The harrowing tale of an obese, illiterate black girl growing up on the mean streets of 1980's Harlem? Raped by her father, beaten by her mother, and impregnated twice by the age of sixteen, one child being born with Down Syndrome? Oh yeah, AND her father gave her HIV to go with it?\n\nWell in Tall Girl we have - brace yourself - a girl who's tall. I know, I had trouble processing it too. Game-changing and not for the faint of heart, this brave new movie punches the most terrifying of subject matters: a girl who's taller than her peers. So if you found Precious an uneasy watch, buckle up; Tall Girl surpasses that territory and goes beyond. I mean, she's...TALL, guys! How could anyone face such a reprehensible burden? Sure, it works for supermodels, female athletes and Olympic medallists, but putting them aside, no-one could ever conceive what a traumatic life tall people lead. Kudos to this remarkable film for recognising that long-ignored problem through an uncomfortably candid lens.\n\nJodi's self-inflicted insecurity is something all too many giants suffer from, it's high time they were acknowledged. Just listen to the breath-taking way she reveals at the start of this movie, 'You think your life is hard? I'm a high school junior wearing size-13 trainers. MEN's size-13 trainers. Beat that.' Wow. Preach it, sister. Certainly puts things in perspective, doesn't it? I know the next time I watch Precious, I'll be looking at the titular outcast and thinking, \"Get a grip, girl. So you've been put through years of violent abuse by your own parents, we've all been there. Now the lead star of Tall Girl, on the other hand - talk about untapped. Her classmates keep asking her the lazy, uninspired question, 'How's the weather up there?' Now THAT'S drama! Real problems that people can relate to! Finally, someone out there gets it!\"\n\nGod, I hate my generation."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "junky-90089",
        "review_rating": "1",
        "review_title": "Maybe I'm not the target audience?",
        "review_detailed_main": "I was excited for this movie when it came out because I liked Ava on Dance Moms. I thought it would be great. But I hated this movie. I tried so hard to like it but any time I wasn't horrifically bored, I was cringing at the awkward writing. I don't think the script went through more than one draft. I had to break my watch time out over 2 days. I was really determined to give this movie a chance to redeem itself, which is why I continued it the next day. It just got worse though. I hated every second of it. I hated every character. After a certain point I gave up on redemption and watched to see how bad the ending would be. It was bad. I hated the ending.\n\nWe needed Jodi to go serve in a soup kitchen or volunteer at an animal shelter and realize why she is not the center of the universe. That's not what we got. Everyone involved with this production deserved better."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sarahalobaidi",
        "review_rating": "10",
        "review_title": "Relatable",
        "review_detailed_main": "I have always been the tall girl at school, even though when I think of it I'm not that tall but the majority of the girls in the school are below average in height. They have always gave me that sense that I'm too tall but I have now realized that they were insecure about their own height. Most of the things in this movie are true especially \"How's the weather up there\". It took me a couple of years to be confident about my height but now I am. I related so badly with this film. I love it! I hope it encourages other girls to be confident in their own body too."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kjartantumi",
        "review_rating": "1",
        "review_title": "TAll girl",
        "review_detailed_main": "It's cancer it's cringe and i hate the main character ........"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ginge_mickey",
        "review_rating": "4",
        "review_title": "Worth a watch but nothing groundbreaking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hannahhms",
        "review_rating": "1",
        "review_title": "Love a film that looks to shame and categories more people.",
        "review_detailed_main": "I was and never have been shamed or looked down on for my height, only complimented on it. If I were a teen watching this it would most likely trigger an insecurity that is highly unnecessary. If only producers thought twice about the messages they're sending out to a younger audience - oh and not to mention, of course it is a female shamed for her natural beauty."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "linneabergander",
        "review_rating": "2",
        "review_title": "It's just stupid",
        "review_detailed_main": "Why won't they have an actual Swede as an actor rather than American who barely knows anything about Sweden.\n\nAlso just the whole movie is just awkward and so on, definitely wouldn't recommend watching >=["
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "johnnyreinsch",
        "review_rating": "3",
        "review_title": "Hilarious!",
        "review_detailed_main": "I love the multiple scenes where the lead walks by other girls who are as tall or barely shorter than her. Also it's 6'2\"... also why does every main character get a prom speech? Nobody would have cared."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bondcassie",
        "review_rating": "10",
        "review_title": "I am very confused with the very negative reviews of this movie!",
        "review_detailed_main": "I am 6 foot tall woman. I grew to this height in 1 year at the age of 13. At 12 years old was not alone in my height but by 13 years old I was very much alone. There were no boys or girls in my high school who were as tall as me. I was not treated very well. If they weren't bulling me then they just avoided me as they saw potential issues with the other kids if they were seen with me. I was not a bad looking girl but I stooped trying to be smaller which didn't help my image. I wanted so much to be shorter. So to the women who have reviewed this movie so disparagingly and to the other who rated so low for other reasons I really don't understand you take. The movie was well acted, the script was good and the message was lovely. I have a 11 year old great niece who loved the movie and the message. I have seen much worse movies that have better reviews than this one so I really wonder at the way this movie has been disparaged. I for one identified with it. I wish I had gone to the prom and spoke up like she did. I wish I had had the guts to join the drama club at high school. I wanted to so much but just couldn't face it. I wondered what I would have been cast as? A boy? This would have been too hard for a 13 year old girl who just wanted to have boys interested in her. Yes I wasn't full of courage but I wasn't and that is sometimes how it is."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "vlatkamissx",
        "review_rating": "2",
        "review_title": "Suicide safeline",
        "review_detailed_main": "If you wanna kill yourself, but can't get yourself to do it... just watch this! It will push you over the edge."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bdpeterson-06310",
        "review_rating": "1",
        "review_title": "Shockingly lame premise",
        "review_detailed_main": "Tall Girl fails if for no other reason then the fact that being tall is not something anymore gets bullied for or is something to be self conscious about. Everyone likes tall kids in high school because they are good at sports. Whose dumb idea was this to make this movie?"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dayna-79308",
        "review_rating": "3",
        "review_title": "Nextflix invest in better movies",
        "review_detailed_main": "This movie is like every other bad teen movie Netflix keeps giving the green light to. The characters themselves were one dimensional and not likable except maybe the short boy that liked the main character. It has bad writing and is a waste to watch."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "walk_tall",
        "review_rating": "2",
        "review_title": "OMG",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amdewildt",
        "review_rating": "3",
        "review_title": "Get over yourself!!!",
        "review_detailed_main": "Being the same height as the girl in this movie, I kept thinking: Get over yourself!!! Or move to The Netherlands. I don't know what the average height in the US is, but this movie seems to be filmed in Lilliput and Jodi is Gulliver. The story of this movie isn't better or worse than so many other b-movies, but it has no credibility whatsoever if you make a girl that's only 6'1\"(and a half) look like she's a giant. And of all the girls and women I know who are the same height or even taller, NO ONE wears shoes in size 13."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "slytherinserpent",
        "review_rating": "8",
        "review_title": "Touching and cute",
        "review_detailed_main": "A really beautiful story, but some of the \"funny\" scenes are actually not so funny, some predictable moments, and the plot is just too fast-moving. My favorite characters are Dunkleman and Fareeda, I think they carry the whole movie on their backs, lol. Stig the exchange student is gorgeous but kinda dumb. As for Jodi the female lead, she's kinda relateable. Also, the ending is beautiful and gives a good message."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "Stupid movie.",
        "review_detailed_main": "Yeah I get it, being different can really suck. But here's the thing. The \"tall girl\" in this movie is not only just marginally taller than average. She's also pretty, intelligent and comes from a middle class family. Seriously what's the problem?\n\nI'll tell you what the problem is, her victim complex is the problem. In any other universe a girl like this could be the star of her girl's basketball or volleyball team. She'd have guys who are close to her height dogging her constantly. Hell she'd have average guys who couldn't get a date hitting on her because nobody else would. But no because she can't get a date in this bizarro universe this is the problem.\n\nAnd of course it ends with a message about body positivity and how everybody should love the body they're in. Nice message but it's totally wasted on this drivel."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "badgalriri",
        "review_rating": "1",
        "review_title": "SWEDISH REVIEW",
        "review_detailed_main": "Okay so i'm swedish, we aren't \"giants\" here, but the moment that made me turn this off was when the \"swedish\" exchange student had a GERMAN ACCENT. NETFLIX DID YOU VISIT THE WRONG COUNTRY FOR RESEARCH OR DID YOU JUST GOOGLE THE BLUE AND YELLOW FLAG AND THOUGHT \"HEY THIS'LL DO!\" ren skit. translate that"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dragonicefeather",
        "review_rating": "1",
        "review_title": "oh damn",
        "review_detailed_main": "'im a high school junior wearing size 13 nikes. MENS size 13 nikes. beat that'. idk about yall but i know middle school girls who are 6 ft 1 and wear big shoes. im a hs jr, i know senior girls who are 4 ft 11, and I know ones who are way over 6 ft 1 i thought this movie was a joke at first. a white blonde girl isnt gonna get bullied just for her height. try being a bisexual, transgender asian."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "critically_critical_critic",
        "review_rating": "1",
        "review_title": "When virtue signalling just... Fails.",
        "review_detailed_main": "Message of the movie was that tall girls aren't not freaks. Well, nobody was actually saying that, and the tall girls were not thinking that. But they are now. They also go out of their way to imply that short guys are unwanted. Not cool."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "marorose",
        "review_rating": "2",
        "review_title": "Not worth watching",
        "review_detailed_main": "This is the most ridiculous take on the \"outcast high schooler\" that has ever been made. This movie should not have been made. The dialogue is PAINFUL and there is zero chemistry between any of the characters. Basically, awkward as hell. Enjoy!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "rxw-82162",
        "review_rating": "8",
        "review_title": "Predictable but Cute",
        "review_detailed_main": "Written by a 65 (is the new 55) year old earthling. Cute little Netflixer, predicable when based on teasing kids/teens being insensitive to their peers. If there's something different about you, kids will gladly tease you about it. Which gave me a reason to drop a tear, because in real life, some kids can't cope."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sankaan",
        "review_rating": "1",
        "review_title": "So many wrongs.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "TributeAncestor",
        "review_rating": "1",
        "review_title": "Not that tall, but egoistic",
        "review_detailed_main": "First of all, it's not a comedy film. It didn't even try to make a joke. Secondly, the main heroine feels depressed because no one loves her, so she friendzoned the guy who actually loves her... Then Tall Girl showed, that all you need for love is make-up and the most beautiful boy in school is more important than friends. I'm not a feminist, but even for me this film seems so immoral."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Tall_Girl_H8r",
        "review_rating": "1",
        "review_title": "Literally the worst",
        "review_detailed_main": "I made this account just to write a bad review on this low, shallow, unrealistic movie. It filled me up with such disdain. The main character was uncharacteristically mean to her friends & overall just shallow. You know what, not even uncharacteristically; from the beginning to end she was just a poorly written character who I was not rooting for. God bless the actors with their poorly written scripts; the actors were one of the only shining parts of this movie. I would go on, but, there's no need to. The 1/10 stars should speak for itself. Me & my gf watched this movie ironically & even then it committed the worst movie sin of all: It was boring. It's not even good to watch ironically. Erroneous. That's the best word for it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cmurph-58307",
        "review_rating": "1",
        "review_title": "Unrealistic",
        "review_detailed_main": "This movie so bad and so unrealistic that it hurts, please tell me who gets bullied for being tall, like \"HAHA, You can reach the top shelf and I can't!!!!!!\". Honestly, if Netflix is going to make a movie for teens make it good."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "raul_rdv",
        "review_rating": "3",
        "review_title": "Practically Unwatchable",
        "review_detailed_main": "I honestly could not finish this movie. Got to the one hour and 40 minute mark and decided I had had enough. From the first two minutes you can tell the dialogue is going to be garbage. It felt so inorganic and stale. It was cringe inducing. The \"mean\" jokes towards Jody were painfully embarrassing. \"More like taller Swift,\" lol. Dear God, it didn't even attempt to be creative. What's even worse is the way people reacted to the joke. Like, \"Oh, good one Kimmy.\" Is this real? Is this a real film? I felt like I was watching a parody. Someone actually wrote this, and an entire cast and crew filmed it. THAT IS INSANE!\n\nThe editing was also unbearable. There were so many unnecessary, distracting cuts and glaring continuity errors. Some cuts literally felt like a film student's second attempt at Premiere.\n\nBut by far the movie's worst mistake, its worst sin is, it treats being tall-a universally desired physical trait-like some sort of mayor deformity. In the beginning I though the film was being a little sarcastic and self-aware of its premise, but no. It takes the issue pretty seriously. And the problem doesn't lie in the main character being insecure about her above average height. You can have a pretty good movie about an attractive, tall character who is just insecure and unsure of herself. The problem lies in the way everyone reacts to her height. It's just not realistic in the slightest. You have an attractive main character with the physical attributes of a model, and everyone around her acts like she's Godzilla. I'm sorry, I just didn't buy it.\n\nOne thing the movie did right was her parents. It makes perfect sense that Jody would be so insecure with such a knucklehead of a father. If the movie had gone that route and focused more on the theme of her dad's insecurities affecting her self esteem, I think we would have a much better movie. Problem is, the movie doesn't understand subtlety, so it's not just her parents and one or two jerks here and there that have a problem with her tallness; it's EVERYONE. And I know the actress that played Jody had a rough time because of her height, but come on. An entire high school acting like they've never seen someone above five feet-in the United States of America, no less-is a bit of a stretch.\n\nIn conclusion, I did not enjoy this movie. It was boring, the characters were flat, I didn't feel the slightest bit of sympathy for the main character, the guy she ends up with is a manipulative creep, and it's just a bad movie all around. It's not even the premise. It's the way it's executed."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "rebekahrox",
        "review_rating": "9",
        "review_title": "Well, I loved it. So there.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "elisabethpettersson",
        "review_rating": "2",
        "review_title": "That is not a Swede.",
        "review_detailed_main": "As a Swede, I'm once again blown away by how difficult it seems for you people to get hold of a real swedish person. There are more then ten million of us. But hey, that makes sense because a Swede would've never said yes to that. We're not that basic. Nor are we giants. We're hot though, I'll give you that. Seriously, if this (and other high school movies) is any indication of how American teenagers interact, you should take a long good look at how you raise your children over there. Hej då!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amosmccandless",
        "review_rating": "1",
        "review_title": "It sucks to be tall, and rich?",
        "review_detailed_main": "I'm not in the mood to write in full sentences for this review, so I'll stick with key words and phrases, which is all this film deserves (or contains).\n\nScript: hackneyed, not a good retelling of a classic storyline for a new generation (Pretty in Pink), majority of scenarios and character choices do not make sense\n\nDirection/Editing: typical Instagram style - bright colors, clean everything, failed attempts at height based slapstick\n\nActing: people dying on swords left and right to make a terrible script work - actors gotta eat somehow - but overall, it's hard to make crap look good\n\nOverall: not worth your time"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "narathip_87",
        "review_rating": "1",
        "review_title": "Tall Girl's familiar teen love story fails to reach new heights.",
        "review_detailed_main": "From a one-note mean girl stereotype to a complete disinterest in how social media shapes the lives of teens, Sam Wolfson's lackluster script fails to bring anything new or timely to the teen rom-com table."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "DarkEydDeviL",
        "review_rating": "2",
        "review_title": "It had potential",
        "review_detailed_main": "Everyone, only exceptions being her two best friends, taunt Jodi for her height all day every day. She's not the new girl or someone they haven't seen before so it's ridiculous she's treated like a freak of nature on a constant basis DAILY, even by her own family! I was expecting her to be closer to 7 feet tall under the circumstances but she's 6'1? Seriously?\n\nHer dad considered having her hormones suppressed while she was very young even though one of the side effects is infertility. That's too far which sets the pace of how ridiculous she's treated because of her height when it's not even that tall.\n\nThey seemed to go out of their way to cast short people because she's way taller than everyone, guys included, at only 6'1. They must not have any basketball teams at her school or her city/town for that matter.\n\nIt would have been more relatable or realistic if she was just the tallest girl, which is what I was expecting. Her shoe size and all that isn't that hard to accommodate these days because of internet shopping too. They made it seem impossible but it would have been more believable if her frustration was because she can only order from online and not off the rack but no. They implied she can't get anything anywhere since she wears a 13 in men's. My oldest wears a 15 and I could get him shoes even at Walmart so I'm confused lol\n\nHer friend loves her the way that she is and she overlooks that because he's shorter than her (and most people). How ironic is it that she judges him for his height when she hates that she is?\n\nThey miss the mark so many times and ways. It's frustrating because it had potential. Her families obsession with beauty and what THEY deem normal was gross and unnecessary. I cringed at most of what they said and did, ugh."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lisichichi",
        "review_rating": "1",
        "review_title": "Pretending",
        "review_detailed_main": "You could say that, with a height of 1.81m, i would be the targeted audience for this movie. But, here comes the big BUT.\n\nIn general i like the message this movie is trying to communicate. But the way it does this or TRIES to do this is horrible.\n\nThe whole story is failing to be believeable at all. Besides Jodie, there is not really a character that you like. Maybe her best friend, but that's really it. The story tries really hard to be thoughtfull and give everyone a good feeling, but it just didn't got to me. Felt like the movie was pretending to be something really deep when it wasn't even touching the surface of being a tall girl."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "akvilr2",
        "review_rating": "8",
        "review_title": "As a tall girl i related to it",
        "review_detailed_main": "Its a nice movie. I liked it. It was relatable because when I used to be in school I used to have aaall the same confidence problems. But in reality movie wasn't that amazing. GOOD BUT NOT AMAZING. And what the hell with Jodi's makeup and outfits? Just nono. And Griffin is sooo cute 😍"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "csratnam",
        "review_rating": "2",
        "review_title": "Felt bad about giving it 1 star",
        "review_detailed_main": "Truly cringe worthy. Was hoping for this years Sierra Burgess is a Loser but was disappointed. Movie wanders aimlessly for an hour and a half before reaching the predictable conclusion offering nothing new to the conversations around body positivity, bullying or self acceptance. Save yourself. Re-watch Sierra."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "katerinaroma",
        "review_rating": "1",
        "review_title": "What the f c u ...?????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sofakitwin",
        "review_rating": "1",
        "review_title": "Don't watch it",
        "review_detailed_main": "I am just curious why someone to read this scenario and to actually decide to produce the movie! Its so bad!!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lundin_linnea",
        "review_rating": "3",
        "review_title": "Worse than twilight",
        "review_detailed_main": "I heard so many bad things about this movie and decided to watch it. In my opinion, twilight is better."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Rastifan",
        "review_rating": "1",
        "review_title": "This is dumb.",
        "review_detailed_main": "This movie is about Jodie. She is a member of the most oppressed demographics today. Tall and attractive women. If anything, this movie is an insult to people with real issues. It is dumb and pointless. That's all there is to say about it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ExoticLikeRanchDressing",
        "review_rating": "10",
        "review_title": "Empowerment for us TALL women!",
        "review_detailed_main": "This movie had its few little faults, but it is SO powerful and inspirational especially when you have lived that life and have felt those struggles.\n\nIn a world where most people strive to be body positive I feel tall woman are always overlooked, so it was really wonderful to see it brought to life in such a feel good and real fashion. It was awkward and hard to watch at times, but that's REAL! That's LIFE!\n\n10/10 will watch again!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "VOIIIXI",
        "review_rating": "1",
        "review_title": "When are we gonna stop making spoiled children shows",
        "review_detailed_main": "Just stop. people have bigger problems. It's just annoying to watch these kinds of shows, imagine these kids actually encountering real life problems and not some spoiled teen drama stuff. This is why when spoiled privileged people don't have any real problems they'll look for any small thing, likely the case with feminists and cancerous \"girl empowering\" stuff."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mirkwoodaep",
        "review_rating": "5",
        "review_title": "Gives girls a wrong image",
        "review_detailed_main": "Seriously by putting high being a problem. What is this world. Seriously. STATE REAL PROBLEMS INSTEAD. Like climate change, food hunger or suicide static's. Id being tall actually a problem? NOO. Maybe guys don't find you attractive and so on. But it makes the veiw of a girl messed up. Why should a girls feel bad for being tall. LILE JOIN THE BASKET TEAM. Use ur unique body for something positive STAWP being so ungrateful for the world. And spend energy on real things."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lilbobhawk",
        "review_rating": "2",
        "review_title": "The opposite of its aim",
        "review_detailed_main": "This movie did not seem to achieve what it had aimed for. They made 6'1 seem weirdly tall, when in reality there are many people at that height. And are you telling me there was only one guy taller than her in the whole school? Where's the basketball team we see in every other high school movie?! It was obvious they wanted this exact person to play the role, because of her fame beforehand on \"Dance Moms\", knowing they would attract the fan base. Also, the other characters weren't written well, with the stereotypical best friend of a quiet girl and a boy who's madly in love with someone who doesn't even notice. The movie tried to make being taller a good thing, but it backfired terribly, achieving the opposite."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "possum-18733",
        "review_rating": "1",
        "review_title": "Just not very good",
        "review_detailed_main": "Idk how to explain it but it wasn't that good and was quite bad. I wouldn't recommend this"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Pensluvr",
        "review_rating": "4",
        "review_title": "Not pretty in pink",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "gjenevieve",
        "review_rating": "8",
        "review_title": "Ended properly",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "aliramaxwell",
        "review_rating": "4",
        "review_title": "Had a chance to stand out, but didnt.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "okilicious",
        "review_rating": "2",
        "review_title": "First World Problem",
        "review_detailed_main": "There is a similar movie in Japan about a tall girl called Lovely Complex and being tall in Asia for a girl is head-turning, so the story is pretty relistic.\n\nI don't think this is realistic in western countries, though."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "biancaolenjin",
        "review_rating": "4",
        "review_title": "The message was basically 'don't alienate me because I'm tall', yet the fact that this is a movie does just that.",
        "review_detailed_main": "You don't have to make a whole movie about how a girl is insecure about her height. It's like making a movie about a girl who's insecure about her big nose. Yes, maybe it's noticeable, but that's the worst it is, people don't care about you enough to give you a hard time about something you can't control.\n\nUgh, and her parents! You'd think they'd have got used to the idea that their daughter is tall by now but they still seem to bring it up a LOT. Further alienation, also unrealistic.\n\nI can understand how a tall girl might feel a bit insecure about her height, but please, people mostly don't care enough to bully you about it. The worst you'd get is someone looking in your general direction, thinking 'oh wow! She's quite tall!', and then going about their day. Honestly, her being insecure about her height is more due to her wildly insecure personality rather than her actual height."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cleopatre-64660",
        "review_rating": "2",
        "review_title": "She's not that tall! Swedish guys aren't that good looking either! Ridiculous and annoying movie",
        "review_detailed_main": "First of all, main character Jodi isn't extremely tall (187 cm) - I know a girl my age (16) who is 198 cm. And as this movie is taking place in the US; where the heck are all tall people? I mean there's a great diversity in the States. Second, tall people aren't getting bullied as much as short people, on the contrary! My friends who are under 160 cm get bullied and they are discriminated like not being able to work as a flight attendant etc; and as we all know short people are having more difficulties in general getting a good job etc etc - all top ranked CEO's are tall. Really weird that Jodi's sister is a beauty pageant being 152 cm - that's very very short and absolutely too short for a beauty contestant. So even though tall girls can get bullied when young it's nothing comparing to how short women get treated in their lives. Second, this \"swedish\" guy Stig (Stig and Ingvar aren't at all common today except for old men around 70) doesn't even speak swedish and his accent doesn't sound at all swedish, more like a weird german maybe. But I have to say that I almost laughed when Stig talked about not being tall or even good looking comparing to other swedish guys in general - if you come to Sweden with this idea you'll be very very disappointed!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "martyparty-69596",
        "review_rating": "5",
        "review_title": "Teen Romance Cliché",
        "review_detailed_main": "Interesting concept but this film falls flat due to its cringey dialogue, terrible acting and the terrible third act."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "coryparella-758-476473",
        "review_rating": "8",
        "review_title": "John Hughes Set The Bar High",
        "review_detailed_main": "The high concept. (pun intended) The story is engaging. The humor held my attention.\n\nThe reality is the audiences watching this film, Millennials, are so saturated with self evaluation that they are numb to Free Will. Laugh. Cry. Fart. Repeat.\n\nThe parents in John Hughes films were always real and invested in their kids, and we saw them parenting. We, as the audience, listened to them.\n\nIn Tall Girl, the parents are almost invisible and that's what hurts it.\n\nOn the upside: it's not the self - righteous Booksmart.\n\nI believed the story I saw and I laughed.\n\nBut the fact remains John Hughes was to the teen genre what John McTiernan was the Action film."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dazzylila",
        "review_rating": "2",
        "review_title": "Cringeeeeee",
        "review_detailed_main": "Sorry i cant even get thru till the end. Story feels straight up written from the 80s complete with all cringeyness except shes tall. Which probably doesnt affect anything if they exclude that factor even. A timid girl with outspoken best friend + hot mean girl + handsome boy bla bla boring."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "a-73103",
        "review_rating": "1",
        "review_title": "I don't recommend",
        "review_detailed_main": "First of all the character \"Stig\" was super stereotypical and totally unrealistic. Like when she is complaining about her shoe size. Some people have real problems and she is just like \"mEns SIzE 13 NikeS oH No\" this stole movie is really unrealistic and overall really dumb. I do not recommend at all"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "erinkay641",
        "review_rating": "1",
        "review_title": "I Can't Believe This Came Out in 2019",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "gehadmohamed-56086",
        "review_rating": "2",
        "review_title": "Not good at all",
        "review_detailed_main": "I just take like 2 hours watching a movie which has no point at all . The story is awful and somehow not realistic and the cast isn't that good. I've never regretted watching a movie, but I did regret watching this."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hpfmpyhhm",
        "review_rating": "1",
        "review_title": "Ridiculously boring and stupid",
        "review_detailed_main": "I refuse to believe that being 1.80/6'2 would make you stand out like that. It's not really the tall.\n\nAlso, I've never seen it heard of someone being as nasty as the \"antagonist\" of the story. Just because it's a movie cliche that people will do anything horrible to mess with you, doesn't mean it's realistic.\n\nThe worst thing for me was the payoff of the movie, that outfit was so ridiculously ugly, my god."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "loreleigfondren",
        "review_rating": "8",
        "review_title": "It's a good movie but it has some awkward moments",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "babydollfaff",
        "review_rating": "2",
        "review_title": "Most of the movie was a 6-7 but the end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "JoBloTheMovieCritic",
        "review_rating": "5",
        "review_title": "Tall Girl",
        "review_detailed_main": "5/10 - problematic and ridiculous in its plot (I mean to think that literally no one at the school is above 6' 1\" and that this girl is the \"most oppressed\" in the school), but it has a killer soundtrack and some kind of perfect moments (aka Fareeda's entrance set to \"Karaoke\")"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amatoa-62474",
        "review_rating": "1",
        "review_title": "Not good at all",
        "review_detailed_main": "I have a love hate relationship with coming of age movies and usually I either hate them or love them and this one was no different it didn't have any moments where I really cared about the characters problems and it wasn't funny at and unrealistic at it's finest like it took place in New Orleans and you're telling me in just supposed to believe that there were barely any black people also how was she the tallest in that school have you been to New Orleans there are some y'all men"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "agnescmail",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "As a tall girl who went through an amount of bullying during school I though this movie will be something I could relate to, unfortunately it turned out to be just piece of garbage. Terrible acting, writing, directing. The whole story is absolute rubbish and shallow. Don't waste your time."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kellymolloy-93762",
        "review_rating": "3",
        "review_title": "Tall Girl Reaches New Heights in my Disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "iizjfkt",
        "review_rating": "10",
        "review_title": "I'm not a 6 foot tall woman",
        "review_detailed_main": "I'm a 5'11\" dude, but that's not why I'm reviewing this. I didn't enjoy it because it empowered me, I enjoyed it cause it was hilarious and didn't make me depressed about the world. Usually I'm picky with my movies and stingy with ratings, but there are only so many \"masterpiece\" films I can watch that all tell me the world is a dark and disturbing place. I'm gonna make it a point to start watching feel good movies that are bad in the satisfying ways. This was like Max Keeble's Big Move, but for Gen Z. Cheers to the \"bad\" movies out there!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "wnfw",
        "review_rating": "2",
        "review_title": "Remake of Pretty in Pink, maybe?",
        "review_detailed_main": "Seems so much like the old school movie, so many of the characters seem to follow the same style of character with modern day twists."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "qianhui-68304",
        "review_rating": "3",
        "review_title": "Refrain from watching this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "christinolini",
        "review_rating": "1",
        "review_title": "Regressive",
        "review_detailed_main": "The worst thing that could happen to a woman is... big feet and being tall? Yikes.... Moral of the story: Girls and women can accept their hideously tall bodies and hideously enormous feet as long as they are validated by a male--the hot \"Swedish\" exchange student. Regressive. I didn't even make it through the first episode."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cclarke-56588",
        "review_rating": "1",
        "review_title": "Size 13 men's at 6'1?",
        "review_detailed_main": "I'm 6'1 and my shoe size is a ladies 10. When I first saw his trailer, I thought it would be funny. I hoped it would've reflected my childhood. But they made so unrealistic. Yes I was teased, but not like that. They could've done so much better."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "averyjack-40913",
        "review_rating": "3",
        "review_title": "cute, but not the right content for 2019",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tomgoblin-44620",
        "review_rating": "9",
        "review_title": "So many unfair and silly criticisms of this film. It's a winner!",
        "review_detailed_main": "I scanned all the reviews and it seemed like the negative ones were driven by:\n\nC-Sections were criticized (WHAT?) The Swedish character didn't sound perfectly Swedish (Who cares?) Or they were demanding someone to do John Hughes only better (?) It's Netflix so it sucks\n\nDo so many people have a single axe to grind that they ignore a good effort and one of the few movies on Netflix where people DON'T get killed???\n\nI'm just glad I watched it before looking at these baseless reviews. And by the way---why are so many reviews REPEATED over and over---WEIRD.\n\nI loved it. Anyone that wasn't in the most popular crowd in High School can probably relate. The Tall Girl is representative of all the non athletic, tubby, too short, freckled, somewhat pimply or just not socially hip kids. Which is to say the MAJORITY.\n\nThe movie is pretty straight forward. Not difficult to follow. I CAN'T say the same for the reviews!\n\nCompliments to the cast. I think they did a great job with a script that isn't John Hughes at his best but is moving and heartfelt.\n\nAre producers supposed to stop making teen films because they may not be as good as 'Breakfast Club'???\n\nIf you're softhearted, watch it. If you have kids that are in junior high, watch it with them. It will be meaningful for you both."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "emmariddle-52364",
        "review_rating": "2",
        "review_title": "Awful",
        "review_detailed_main": "This movie is so unrealistic and cheesy. This would never happen and she's not even tall. They obviously casted short men and used absurd camera angles to make her look tall. Genuinely hard to watch."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "chaosrachel-95190",
        "review_rating": "1",
        "review_title": "Cliche border-lining on unrealistic",
        "review_detailed_main": "I watched this with my 15 year old niece and even she though it was beyond tacky and distasteful. The whole concept of the movie is centered around basically bullying in schools but this is so overly dramatic to the point its distasteful. The script is awful."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "laura-27092",
        "review_rating": "1",
        "review_title": "The sum-up of all bad shows made by Netflix",
        "review_detailed_main": "I don't understand how these bad shows/movies even get the go-ahead to be produced. First of all 6' 1'' is not that tall, yet, everyone else seemed tiny compared to her; where was it filmed, midget ville? Second, where was the \"amazing and smart girl\" her friends talked about? All I saw was a moaning, slightly tall girl who moped around school unhappily for no particular reason. And the not-so-hot and definitely not-so-Swedish guy with the personality of a pencil who realises that his mean girlfriend is mean after all... A riveting plot by all accounts. This movie is a whole new level of bad, even for Netflix"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dgeets",
        "review_rating": "1",
        "review_title": "Canceling Netflix subscription",
        "review_detailed_main": "I'm cancelling my Netflix subscription, I mean how can they justify the increase by making movies like this.\n\nIt's getting even more worst for Netflix I'm failing to understand the content they are making now days. It's like taking your girlfriend to the movie in a lambo and dropping her back off in a Ford.\n\nThe movie it self was ok but not ok enough that I will say I want to watch it again. It was like watching a dog barking meow. Anyways that sums it up for me."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "yardenvanburen",
        "review_rating": "1",
        "review_title": "i am offended as a woman.",
        "review_detailed_main": "Honestly, i watch trashy teen films weekly, and this is one of the worst ones i have seen. and it was made in 2019? i mean? first, this movie features girls hating on girls, and i mean aren't we tired of this? second, stalker-y behavior is shown as the nice guy-friend-best suitor and this is seriously disturbing and concerning, teaching kids watching this that this is acceptable behavior."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "achimana_maria",
        "review_rating": "10",
        "review_title": "Just trying to understand...",
        "review_detailed_main": "I am just trying to understand why these reviews on films are not according to the genre and the age of the target audience...\n\nThis movie is great! I has everything a teenage or person feeling allienated should feel. It offers a solution for those feeling alone and out of place.\n\nThe characters are strong and very charismatic, the plot is surprising and the little details make the whole difference!\n\nDo watch this movie if you want to heal from feeling different!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kmeskel",
        "review_rating": "1",
        "review_title": "I watched it so you wouldn't have to.",
        "review_detailed_main": "This is the worst Netflix has to offer, worse than Kissing Booth even. The characters have no depth, the tall girl lacks personality, she's boring and whiny. The others keep calling her fun but we see none of that in the actual movie? The \"Swedish\" guy has a laughable accent, the \"mean girl\" is just a hollow shell that says kind of mean things sometimes. The dialogue is awkward and cringy. Don't get me started with that \"quirky\" crate thing that was supposed to turn into this \"cute\" stroke of genius moment at the very end. So predictable and just awful.\n\nNot only are the characters and acting terrible, the whole concept of this movie is idiotic, people don't get bullied for their height, that doesn't happen. I'm a very tall girl, always the tallest in class, taller than my older siblings, and I love it. Being tall is great, that shouldn't be a \"movie screen realisation\"."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jammyemma",
        "review_rating": "3",
        "review_title": "A not-very-good film with potentially dangerous messages for young women",
        "review_detailed_main": "The message of this film is that it doesn't matter what you look like - except it actually does, and you must have a makeover before anyone will notice/love you. I could have maybe forgiven that if it had actually been any good - but it's not very funny and the story is so unrealistic (similarly to the Swedish guy's accent). The one good thing about it is the older sister who gets the only good lines - but the fact that she's a beauty queen doesn't exactly break the feminist mould. There are much better teen flicks to watch on Netflix (The Kissing Booth, All The Boys I've Loved Before) so don't bother with this one."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "riddhimaakaritu",
        "review_rating": "5",
        "review_title": "Okayish.",
        "review_detailed_main": "Okay okay.\n\nThere's was no real struggle. She was 6 ft not 8."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ajhall-33107",
        "review_rating": "1",
        "review_title": "A good try, but a terrible movie",
        "review_detailed_main": "This was painful to watch. I mean, this movie preaches MALE VALIDATION which should not be preached! The fact that she needed the boys and everyone else to realise her is just a little sociopathical and she is such a horrible friend! And the make out scene is REALLY culty. Has anyone realised that she actually isn't that tall? They hired shorter actors, for example, Sabrina carpenter that plays Harper is actually 1.5m tall. Also they use low camera angles to make her look taller and higher camera angles to make everyone else look smaller. I admire that the actor Ava overcame her height issues and that is great but I think that making a cringey movie about it is a bit too much. The most generic American movie I have ever seen."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "olivewahh",
        "review_rating": "3",
        "review_title": "Jodi was the actual mean girl in this whole film",
        "review_detailed_main": "Usually I'm a huge fan of these teen romance films that Netflix pushes out, but this one was like a roller coaster of emotions and I'm still not even sure I liked it.\n\nJodi Kreyman (Ava Michelle) is the joke of the school because of her \"unusual\" large height. Feeling left out and just wanting to find someone she can connect with, in comes exchange student Stig Mohlin (Luke Eisner) who shares a similar height. Jodi who doesn't seem to have any other goals in the film, drops everything including her friends to try win over the handsome exchange student.\n\nI honestly don't know what the message was in this film... Like I get the simple message at the end, but it was done in such a poor form. Jodi ditched her only friends, and went out of her way to look good for a guy to notice her. Are we trying to teach kids that if school students are making fun of how you look, you should up your game with new clothes and makeup so people look at you in a more respectful way? The way Jodi treated her two friends was so bad. They always had her back and Jodi was so quick to turn away from them when she didn't like what was she hearing.\n\nThe ending is cute, but yeah the messages are so bipolar and all over the place."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "milotin-56416",
        "review_rating": "8",
        "review_title": "Simple and true",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ccharlotteh",
        "review_rating": "1",
        "review_title": "Oscar of predictability",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Croslink1",
        "review_rating": "4",
        "review_title": "What happened?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mira-nikolov",
        "review_rating": "3",
        "review_title": "Ending saved it",
        "review_detailed_main": "Tall girl is a story about a high school girl who struggles with her height and gets picked on everyday by students in school. I have heard that many people find this movie quite unrelatable but I can definitely see how a teenage girl would feel insecure about fitting in, especially in an environment like hers. It's a fast pacing movie. However, the script is as if it were written by a twelve-year old. The main characther constantly repeats how much of a freak she is in conversations that have nothing to do with this topic. Overall, I don't see a person above the age of 14 enjoying this. I would've given the movie a lower rating if it weren't for the ending, which I honestly thought was quite cute."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ritz0512",
        "review_rating": "1",
        "review_title": "Not a great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jvidos-06695",
        "review_rating": "5",
        "review_title": "I think the concept, plot, and overall film were okay, but it could have been done way better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "keithzolotar",
        "review_rating": "10",
        "review_title": "Lots of haters...",
        "review_detailed_main": "I thoroughly enjoyed this film. The casting was perfect. Tall lady, nerdy friend, jocks and cheerleaders. Bullying was strongly put to rest, with her BF playing the part of the cooler. Seems to me that this is just a display of how social media and prank calling works to help someone define themselves, rise above it, and become someone better than what morons think you've settled for.\n\nKudos to all actors in this film. I absolutely loved it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "flowrpwr",
        "review_rating": "2",
        "review_title": "So much to hate",
        "review_detailed_main": "I didn't think Tall Girl to be good, but it's so much worse than I imagined.\n\nI was expecting body positivity. But the main message of the movie is that if you hate yourself for long enough, you'll eventually settle for the manipulative prick who's actively trying to undermine your happiness because if he can't have you, no one will."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "mariaconnolly-04448",
        "review_rating": "3",
        "review_title": "Dear god that suit is bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "angielafferty",
        "review_rating": "4",
        "review_title": "Is this a parody?",
        "review_detailed_main": "Tween movie not the worst feels like a Nickelodeon movie It maybe be a higher star if you think of it of a parody or satire or that maybe \"tall\" is a metaphor for something else\n\nI little cliche Watch it if in mood for a wannabe Lizzie macguire type movie"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hastyt626",
        "review_rating": "5",
        "review_title": "Lines and plot too cliche",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "selson-07429",
        "review_rating": "2",
        "review_title": "Boring",
        "review_detailed_main": "What the heck. Better try next time Netflix. Bad acting and storyline is old."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "LoverOfFilmsAndMusic",
        "review_rating": "10",
        "review_title": "Beautiful cast & lovely film",
        "review_detailed_main": "Jack's love for Jodi.....are what dreams are made of. The bullies in this movie pissed me off. I don't like ignorant people. My FAVORITE part was when Jack explained his, \"bookbag\", oh how my tears fell away from my eyes. I tend to watch a lot of horror films because they're more realistic.....if I EVER find me a Jack though, he would be my entire galaxy"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tessann-02690",
        "review_rating": "3",
        "review_title": "Terrible swedish",
        "review_detailed_main": "Accent and speaking is really bad. And stig is a cute name for a boy but very unusual for a young boy. Even ingvar is an old man in sweden ;) But kreuger where is that swedish? It is a german name. Netflix needs to do things like this way better if i gonna like it. Its an ok movie. Booring sometimes."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lord_kenta",
        "review_rating": "5",
        "review_title": "Lousy swedes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "philipjw",
        "review_rating": "2",
        "review_title": "Growing pains...",
        "review_detailed_main": "As a 6'7\" male, this movie is just painful to watch. I understand this movie shines light on tall females, but tall males get the same treatment...some name calling, undersized seats...The name calling isn't as bad as portrayed though"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "zedzam",
        "review_rating": "1",
        "review_title": "What did I just witness",
        "review_detailed_main": "The writing made was so terrible I almost threw my laptop across the room. Completely defeats the purpose of POC inclusivity with the iconic quote, \"You think your life is hard? I'm a high school junior wearing size 13 Nikes. Men's size 13 Nikes. Beat that.\" Don't think I need to elaborate."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "solo47",
        "review_rating": "5",
        "review_title": "WTF",
        "review_detailed_main": "I thought it started off funny. But she explained the book and the dumbass walks away. The obnoxious kid and the Swede who cannot make a decision about the girls was so stupid. I had to fast forward the movie because the scenes were killing me."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "thechargersaredabombgg",
        "review_rating": "8",
        "review_title": "Surprisingly funny and cute",
        "review_detailed_main": "Obviously Netflix romcoms are not known for being good. But in all honesty, this one surprised me. Knowing people who struggle from being the \"tall girl\" it confronts real scenarios. I appreciate the moral of the story. Overall, the comedy was good and it had enough \"cute\" moments for me to give it a higher rating than normal."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "gabriellecarterd",
        "review_rating": "3",
        "review_title": "An okay movie but very cliche and predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "frogchik1196",
        "review_rating": "4",
        "review_title": "Cringe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Gothilite22",
        "review_rating": "1",
        "review_title": "this made me want to die",
        "review_detailed_main": "Dont watch this. No one ever, EVER, got bullied for being tall. What the is this."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "iGlad",
        "review_rating": "",
        "review_title": "I think it's about a girl",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "nomi_waters",
        "review_rating": "3",
        "review_title": "Ummmmmm",
        "review_detailed_main": "I've never known for a tall girl to get bullied for being tall but go off Netflix. This movie was ummm I really don't have words to say to describe besides ummm but I will admit the crate thing was cute but that's about all. It was a regular degular teen drama. The same ol cliches to be expected. Nothing new here folks just that the problem this time is main girl is too tall, instead of the usual she's a nerd. Meh."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "aarubaziz",
        "review_rating": "10",
        "review_title": "Young Love",
        "review_detailed_main": "This was such an adorable movie. I would show this to so many teens that are uncomfortable with their beautiful differences."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "angelshanen",
        "review_rating": "1",
        "review_title": "So predicatable",
        "review_detailed_main": "It was so freaking predictable and the guy doesn't even sound swede. My aunt married a swede and dude I can guarantee you the actor was so far from sounding like one."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sarawasserman-71340",
        "review_rating": "",
        "review_title": "He is not from Sweden",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ShaedaMoghaddam",
        "review_rating": "1",
        "review_title": "UGH!!! Really?!?!?",
        "review_detailed_main": "Disappointed since I had tall girl issues when younger but this was way to far fetched, horribly directed, edited and technically supposed to feel sorry for her but I don't. Netflix you need better scripts (with more character development) or better actors. Maybe if she was ethnic instead of privildged white girl might have felt slightly sorry for her. Being tall is not a curse or illness."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kristiscott111",
        "review_rating": "1",
        "review_title": "So awful",
        "review_detailed_main": "I like teen movies. I like seeing the underdog win. But oh my gosh this movie was so shallow & stupid I just can't even with this movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "boblasher-767-446033",
        "review_rating": "3",
        "review_title": "Could have been good",
        "review_detailed_main": "There was a lot in this film that could have made it really good, but just too many hackneyed story lines, Kind of a dull script, Predictable plot. The whole time I kept thinking how just a little \"punching-up\" of the script could have made a world of difference. Too many characters were just over the top silly including one of my all-time favorite's Steve Zahn. What a shame."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jonathanmichaelfell29",
        "review_rating": "1",
        "review_title": "So bad I feel inspired to go pick on tall people.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Sweetigal85",
        "review_rating": "10",
        "review_title": "Wonderful feel good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bzu",
        "review_rating": "2",
        "review_title": "John Hughes sad knock off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "brannocklindsey",
        "review_rating": "2",
        "review_title": "Very meh.",
        "review_detailed_main": "To be honest, no one is really like-able in this movie. Well, accept maybe the female best friend with the colorful hair. At least she is authentic and loyal.\n\nIt really is just a bad \"Pretty in Pink\" rip-off.\n\nTo be honest, none of the guys in this movie were good... and she really shouldn't have ended up with any of them.\n\nI feel like I wasted a couple of hours of my life even watching this. I wouldn't recommend it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "chriskafka",
        "review_rating": "2",
        "review_title": "Unfortunately the bad kind of teen comedy",
        "review_detailed_main": "It feels a lot like the dated teen comedies of the 80's that while they are classics are no longer relevant. This has a lot of harmful messages in it alongside good ones. As others have said, the message that comes across most is \"if at first she says no, keep trying.\" Which isn't right. No means no y'all."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "swordslicer",
        "review_rating": "1",
        "review_title": "Worst movie Ive seen in a while",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lukereid-64550",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Worst film I've ever watch, so predictable, bad writing, bad acting, all round bad film to be honest!!!!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amvtm",
        "review_rating": "8",
        "review_title": "Nice and wholesome",
        "review_detailed_main": "For the whole family\n\nSimple but loving and positive message.\n\nWe really enjoyed it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "himmmhk",
        "review_rating": "1",
        "review_title": "Are you kidding?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "florence_robitaille",
        "review_rating": "3",
        "review_title": "Lame",
        "review_detailed_main": "Just add this to the other lame cheesy netflix movies. 3 stars for the couple good jokes."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "francovelosov",
        "review_rating": "2",
        "review_title": "Horrible",
        "review_detailed_main": "Horrible, predictable, and very cliche, a copy of most American school movies, nothing new, the only thing different would be that the girl is tall than in a boring plot, predictable dialogues, very generic characters, many characters not contribute nothing to the plot, do not spend your time watching this movie"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "takumimitsui",
        "review_rating": "4",
        "review_title": "Crush since kids hmmm..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Brainscreens",
        "review_rating": "3",
        "review_title": "A clumsy, tacky and trying too hard movie.",
        "review_detailed_main": "I don't know why I watched it, its cheesiness was so obvious in the trailer yet I still got myself to watch it, it's so cringy and by the time they reached to the positive message they wanted to send I was already too annoyed to appreciate it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amofdayear",
        "review_rating": "10",
        "review_title": "Fantastic Message For My Children",
        "review_detailed_main": "I absolutely loved this movie and I watch a lot more movies than the average person. I have two younger kids a couple of years from high school and I truly hope they've learned the moral of this story. I thought the ending was one of my all time favorites."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tanlou",
        "review_rating": "1",
        "review_title": "Don't bother",
        "review_detailed_main": "The parental shaming, the fact she isn't that tall, the total lack of personality from the main character.....I didn't watch far enough to see the 'joke' about the caesarean scar....pleaded I turned it off when I did!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "rawbots",
        "review_rating": "1",
        "review_title": "Movie was written by a dunce",
        "review_detailed_main": "First off, I really don't know any guy that would reject a girl for being really tall, if he found her attractive in the first place. But this movie was riddled with annoying cliches that weren't the least bit funny. Zero stars."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Kajohns49",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "I was going to say that this movie is pretty bad, but it isn't, it is much worse, approaching downright awful. Part of the reason is that the theme of this movie had so many possibilities but the way they were handled was surface level stupid. Very disappointing. Also, are libraries now organizing their books by color now? The first scene is a tell for the entire movie; Style over substance."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cantstandpeople",
        "review_rating": "1",
        "review_title": "Just Trying to Lower the Rating",
        "review_detailed_main": "Anyone who thinks this is a good movie must either have the mind of a child, or have a lower-than-average IQ. Make-believe oppression, C-Section shaming, and giving both genders dangerous messages, and this movie has a 5.3/10 rating? Parents, stop giving your kids devices just so they will leave you alone lol."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "leobbiagi",
        "review_rating": "4",
        "review_title": "She goes to a school for midgets",
        "review_detailed_main": "She's only six one and everyone is a whole head shorter that her and she is treated like a social outcast. \"Man don't you hate those pretty, tall, Blonde, rich girls\" also the woman who wrote and directed this movie is 4'11''"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ryansteinke",
        "review_rating": "9",
        "review_title": "Unexpected",
        "review_detailed_main": "I liked this movie. Possibly because I used to have lots of tall friends. The dialogue between the characters and ending made me tear up a little. My fiance however, she cried. I'll admit, I'm a sucker for romantic comedies, with some real situations. I actually recommend this one for everyone, touched a lot of issues and how friendships and love withstand the test of time. Thanks Netflix. You recommended it and unexpectedly gave me a good one."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "michaeldarcangelo",
        "review_rating": "1",
        "review_title": "Worst Netflix",
        "review_detailed_main": "Welk thé cast seems to show promise but the entire movie is messy and unrealistic all of the all the characters feel one dimensional.Flicks has Michigan had a humongous flop in my opinion one of the worst Netflix adaptation teen movies I have seen except for maybe the package"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "pjinver",
        "review_rating": "2",
        "review_title": "Clichéd teen flic with toxic messages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "D-B-Colridge",
        "review_rating": "1",
        "review_title": "Negative stars would be better",
        "review_detailed_main": "This was mind rotting pap with no value. Making being tall out to be such a terrible social inhibitor is an appalling message to give to teenagers. I question what Netflix were aiming for with this movie.\n\nLet's make tall people feel even more awkward in social situations maybe??\n\nThis movie is offensive."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "robertojluna",
        "review_rating": "1",
        "review_title": "LAME!!!",
        "review_detailed_main": "Worst movie ive ever seen. Lame, low budget, bad acting, lame plot"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ilpo-surokivi",
        "review_rating": "4",
        "review_title": "Kinda liked it but not really...",
        "review_detailed_main": "What's wrong with the main character's parent are they dumb or something? The way the parents have been written...they aren't really malevolent but I'm going to say that they are below average on either IQ or EQ. Who wrote this script? Are the parents supposed to be a comedic relief or something or what? Their tall girl has issues and they invite the tell persons club. It's like being stabbed and then the paramedic twisting the knife in the wound. The parents are completely oblivious? \"They are just trying to help.\" Well, yeah, but I would question their intellect. They should probably take an IQ test."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "katalinhenezi",
        "review_rating": "9",
        "review_title": "Tall girl's fairytale",
        "review_detailed_main": "Stop hating this movie this much! As a tall woman, I loved it! I remember how hard it was being a tall teenager, when you only wanted to fit in, and be normal. And yes, it is realistic, and teens can be this shallow. The only thing, which is not realisitc, that every other boy wants to date you, but hey, tall girls also deserve their fairytale. It's just a teen movie, doesn't want to offend anyone, and dosen't want to save the world, just wants to remind the fellow tall girls to stand tall! :)"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "leasmith-25365",
        "review_rating": "1",
        "review_title": "Just.....don't watch it. Awful.",
        "review_detailed_main": "I don't know where to start on this, so much is awful it's like trying to figure out where to take your first bite out of a huge burger!\n\nLet's start with the height, no 6'1 even for a girl isn't tall, unless it's a school for dwarfs & somehow she got in.\n\nNo it's not relatable, I won't name anyone but saw a review which said people don't get this unless they are a tall girl, again no, she's 6'1! Not 7ft!\n\nThe writing really does give you a nasty taste in your mouth & is offensive to Sweden, the usual project of the overseas guy.\n\nThis movie is so let to pray on young teens hormones...avoid at all costs, cheap, nasty & just plain stupid."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dweber34",
        "review_rating": "5",
        "review_title": "Antiquated plot premise",
        "review_detailed_main": "Ava Cota does a nice job in her first lead role, making Jodi as written come to life. Her emotions rang true and her personality underwent no drastic changes despite a spectacularly unrealistic ending.\n\nAlso, I give the film makers credit for doing a high school movie sans jocks and cheerleaders. However, therein also lies a chunk of the false premise the script is built on: that tall girls in 2019 are outcasts.\n\nSince the advent of Title IX in the 1970s, as opportunities for girls to play sports increased and female students were drawn to taking part, height became a desired trait to many at any high school. Basketball -- Jodi does reference people calling her \"Lebron\" but doesn't seem to be on the Ruby Bridges High team -- volleyball, swimming, track and field all prize height at certain positions or events. As girls and boys grow up together watching each other in sports, there is nothing \"freakish\" about a 6-1 or 6-2 girl.\n\nMy late wife (high school class of '82) was 6-1, our daughter (class of '12) 6-feet even. Neither took any crap for their height. Both played basketball. but I think their acceptance came more from being part of a team which also featured other tall girls than the fact they were both pretty good.\n\nI realize not all girls, tall or short, play sports, but Jodi's one professed interest -- playing piano -- is said to be something she is suited for because of her wide hands. The current reduction -- I would never say elimination because people at schools all across the country are still bullied for many traits -- in harassment of tall girls is partially a product of many taking part in activities where their height is a plus. Tall girls who are \"ordinary students\" aren't automatically thought of as freaks if those who do play sports or model or whatever all else fields are now more open to tall women are not."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "brna-fdan456-596-258118",
        "review_rating": "3",
        "review_title": "overrated",
        "review_detailed_main": "All scenario was so undemanding. We need to stop making movies about stereotyping beauty and making more movies about social issues like racism, gender inequality etc."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jcerreta",
        "review_rating": "5",
        "review_title": "Yawn....",
        "review_detailed_main": "I loved this movie the FIRST time I saw it, when it was called \"Pretty in Pink\"....."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "c7flat13",
        "review_rating": "8",
        "review_title": "So cliche.",
        "review_detailed_main": "Just another teenybopper low budget rom-com. Actually... it's super cute with a lot to say. Well written with a good supporting cast. I'm a tall guy with a 6'+ sister. I remember her having similar problems and like many people have always had a fascination with especially tall women (taller than me anyway). This movie manages to address many subtle social issues in a gentle way. Tall Girl is an allegory much deeper than it's unsophisticated facade. The soundtrack is noteworthy as well."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "layaleimdb",
        "review_rating": "4",
        "review_title": "Not bad at all",
        "review_detailed_main": "This is an important message for insecure tall girls out there.\n\nWhen life grants you a unique and special trait, instead of fighting it, try and embrace it !\n\nPlus it holds a message about true friendships. We often meet people and get lost by their charm or whatever they have, that we forget how our closest ones are beautiful and know us even more than we do..."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kovicmarin",
        "review_rating": "2",
        "review_title": "Apparently this is struggling",
        "review_detailed_main": "You guys remember The Elephant Man? Well apparently he had it easy compared to The Tall Girl. No but seriously she is intelligent but never used her intelligence,no personality, she could be good in so many sports and modeling and her dating struggles are in no way comparable to short guys."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "dalba25",
        "review_rating": "2",
        "review_title": "Cliche and boring",
        "review_detailed_main": "Boring plot, boring script, boring teens, boring love triangle, boring ending."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "davidkaljevic",
        "review_rating": "4",
        "review_title": "Boring and nothing special",
        "review_detailed_main": "What would you expect from a movie that talks about problem of high school girl, i made myself watch this because tons of ads on youtube and everywhere else to install netflix and watch tAlL gIrL, i kinda forced myself to watch everything to see whats point of this movie and there is no point it just had 2-3 if you can name those plot twists and that is it, as a 6'6 male i can for sure say it's extremly unrealistic all actors used are like 5ft so it made her look like a scryscraper"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "monaimdb",
        "review_rating": "1",
        "review_title": "it was so boring i didn't finish watching it",
        "review_detailed_main": "It's just, bad. So bad. The movie is about a tall girl...and that's about it. Highly unrealistic too. Don't bother watching it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lowejnl",
        "review_rating": "9",
        "review_title": "Great movie except the outfit",
        "review_detailed_main": "I loved the movie but the outfit she wore to the homecoming dance wouldn't have been my first choice. Good movie though. Not sure why the stars are so low on here."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Helberth_Galarga",
        "review_rating": "1",
        "review_title": "Idiotic",
        "review_detailed_main": "I know this is a movie for kids, at least that's what I think it was written for based on the idiotic premise, but still it is unrealistic."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "soniy-72451",
        "review_rating": "2",
        "review_title": "How's the Weather Up There?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "weird-swede",
        "review_rating": "4",
        "review_title": "Stig and Ingvar?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "sarahsteensen",
        "review_rating": "4",
        "review_title": "Like other reviews, I find it unrealistic",
        "review_detailed_main": "As the same hight as the main character, I really found it unrealistic that everyone saw her like this REALLY tall, unormal girl. I don´t know if the cinematography made everyone else look smaller on purpose ´cause I have never experienced this in high school.\n\nFar from the best Netflix-produced high school film."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kwenchow",
        "review_rating": "5",
        "review_title": "Not intense, a bit weird and slow, but touching! Save by the character \"Jack\" in the film! Should watch it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "criste-montero",
        "review_rating": "9",
        "review_title": "Stop the HATE .",
        "review_detailed_main": "Im 172 cm tall girl ..and for many of u im not that tall . But in my school ive been always the tallest girl . And alot made fun of me ... i was taller than both girls and boys in school . I heared alot of offensive words that i remember till now .. i related to jodi so much even though im shorter than her .. im 25 years old and i cant wear high heels cuz i will be taller than everyone i know .. when u live in a community than most girls are 160 cm and guys into that while u r 170+ it is deffinitly weird ((I cried watching this movie when she got the heels gift and in the ending scene when she wore them and walked full of pride really was happy for her))... ofcourse when i turned 20 + yo it got better as men gets taller later on but i heared the how is the weather up there alot .. it really hurts ..but now im very confident and i cant imagine myself shorter than this . I just love being me though cant wear heels higher than 5 cm cuz i would look weird when im with friends or anyone BUT short girls wear heels to get taller so f#$k it anyway ..."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "wizard003",
        "review_rating": "3",
        "review_title": "Why is she called \"tall girl\"?",
        "review_detailed_main": "Stupid question... shelooks like 2 meters... Are all the other actors really that small? What would be a medium siece for women? Anway... i think overweight girls are much more likely to be bullied. Tall girls (an i'm talking about girls that are at least 1.90m are interessesting for men). Don't know... i live in germany and many boys are at least 1.90m... I really don't understand why she calles herself a freak..."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "supaing-67994",
        "review_rating": "1",
        "review_title": "should've believed the review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hillcheyenne",
        "review_rating": "1",
        "review_title": "This movie is probably more unrealistic then my hopes of passing my AP class",
        "review_detailed_main": "This movie sucks. This is probably the most unrealistic high school movie ever. Kids randomly breaking out into song during HSM was more realistic then a girl who is 6'1\" being made fun of. First of all I'm 5'11\" and I don't get crap for being this tall. I play volleyball and I'm the 5th tallest one on the team. My middle is 6'4\" and she is praised for being that tall. The story line sucks but the acting also sucks. The only reason the movie is trending is because it's a Netflix original and of course Netflix is gonna make their own movies trending. DO NOT WASTE YOUR TIME! Also they literally make her look like a giant. Everybody looks like 5'2\" next to her. The camera angles are super deceptive."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "allykerrisk",
        "review_rating": "4",
        "review_title": "NOT DA BEST",
        "review_detailed_main": "Not the greatest movie we've watched, and it has a very cliché story line. It's enjoyable for a one-time watch but no more. We thought there were some cute moments. Overall, it was an enjoyable movie to watch, but very predictable"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ethanwaldron",
        "review_rating": "1",
        "review_title": "REALLY HEIGHTIST SO DON'T WATCH IF YOU ARE A KID",
        "review_detailed_main": "Heightist DONT WATCH NEVER WATCH EXTREMELY HEIGHTEST SO IF YOU ARE A SNOWFLAKE OR UNDER 18"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "watcherofthemovingpicturebox",
        "review_rating": "8",
        "review_title": "Basically an Episode Story but better",
        "review_detailed_main": "So when I saw the description and trailer on Netflix, I was like, that sounds like an Episode story I read. Then I watched it I'm into those kind of stories, and it did basically have the same plot as that Episode story, with a few minor detail changes. But this movie was better. Music. Pretty people. Character development. Solid ending. And I loved, loved Jodi's outfit at the end."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tuanaanime",
        "review_rating": "1",
        "review_title": "Disturbing",
        "review_detailed_main": "The start of it made me wanna scream really. Just acting like it's the hardest thing in the world and the \"swedish\" actor who completely destroyed swedish. Watching it was painful."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "camdall-05004",
        "review_rating": "4",
        "review_title": "Ok just don't",
        "review_detailed_main": "The ending is so predictable."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "meaaditya",
        "review_rating": "3",
        "review_title": "Typical high-school drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "puppylvr-90722",
        "review_rating": "3",
        "review_title": "Unoriginal & predictable",
        "review_detailed_main": "Another retelling of the same old cheesy love story.. not much is original about this movie asides from the main character being tall.. everything is so predictable because it's been done a million times before.."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amitshmueli",
        "review_rating": "5",
        "review_title": "Bad movie",
        "review_detailed_main": "Bad movie I did not understand anything The terrible characters in the game are terrible and the plot is terrible This movie is just bad and I did not like it."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "youngdonattitude",
        "review_rating": "10",
        "review_title": "Beautiful Movie",
        "review_detailed_main": "It was a beautiful movie, w/ a beautiful message. People should watch the full movie before reviewing it. It was emotional, funny and romantic."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kentarjy",
        "review_rating": "4",
        "review_title": "Teenage Cliches",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "shputa",
        "review_rating": "4",
        "review_title": "Jack the funny guy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "smphmxqekq",
        "review_rating": "2",
        "review_title": "Genuinely Awful",
        "review_detailed_main": "Genuinely one of the worst films I have ever seen. Only redeeming factor is seeing the \"tall girl\" being made fun of and even that doesn't last long."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "evelinasimma",
        "review_rating": "2",
        "review_title": "A waste of time",
        "review_detailed_main": "I could predict the plot of this movie after watching like 15 min of it. Like, the only reason I kept watching was to find out if my prediction was correct or not. It was a waste of time and I was right about the plot. It sucked, the characters were plain and boring and people fell in love after talking like once. Also, what's up with the \"Swedish\" guy Stig who's so obviously not swedish I had to rewind just to figure out what language I heard when he spoke Swedish in a sentence. And don't get me started on his so called Swedish accent! Would it really be that hard to pick an actual Swedish actor to play the Swede in the movie? Or at least make the fake accent a little bit more believable? Or like, have the character come from another country?"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amirakbarnia",
        "review_rating": "1",
        "review_title": "not bad not good",
        "review_detailed_main": "Totally medium . Poor characterization poor storyline. Teen video suitable for leisure."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "vrserra",
        "review_rating": "10",
        "review_title": "Amazing!",
        "review_detailed_main": "This movie was so well done! Jodi was a perfect example of what it's like to be bullied for your outward appearance. It was a different perspective on bullying and how you should love someone for how they treat you and not just how they look. 💜🖤"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lilflo",
        "review_rating": "4",
        "review_title": "Average Girl",
        "review_detailed_main": "It's hard to judge this film as anything other than what it is; a sweet, cheesy teen movie to watch at a sleepover whilst eating a pint of Ben and Jerry's.\n\nWhen you judge it like that, it's a successful film."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "spiderdib",
        "review_rating": "3",
        "review_title": "Truly terrible",
        "review_detailed_main": "It was quite false, it did not give me feelings, it was not realistic, it happened very quickly and not in a good way and VERY predictable. The only good thing for me was the character of Dunkleman and his milk box, I would see it again just for him."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "carolxrivera",
        "review_rating": "3",
        "review_title": "Eh...",
        "review_detailed_main": "This was a movie that you turn on and do other things while it's playing. There wasn't much to the story besides the main character complaining about being tall and having \"stuggles\" as a woman with privilege. Its another Netflix movie with no substance."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "SS-Q1",
        "review_rating": "4",
        "review_title": "Not bad at directing, main plot is so inspired but screenplay is too weak & predictable..",
        "review_detailed_main": "As I said.. this film is good at directing althrough it's not perfect every scene but I can see that director works as good as she can and result looks not so that bad.\n\nThe only part that irritated me off about this film is \"screenplay\" that writen so weak, so predictable and cliche.. when I watched it I just feel like.. Oh c'mon people!! how many time that I have to watch this cliche sub-plot on teenage films?"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Jeremiah402",
        "review_rating": "3",
        "review_title": "Not Good",
        "review_detailed_main": "I'm 5'4 and I'm a size 9 going on a 10 and I'm not even that tall for a boy this show doesn't really make sense in my opinion"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "davidhogan-42165",
        "review_rating": "10",
        "review_title": "Wasn't to sure",
        "review_detailed_main": "I wasn't to sure about this film to start with, but being a 6'10 single man I can empathize with Jodi. Being tall you do get fed up with all the comments about your height, so a young woman would find it even harder. Glad she turned the negatives into a positive."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "penguoxo",
        "review_rating": "4",
        "review_title": "A tall list of reasons not to watch this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bdrawingnotebook",
        "review_rating": "1",
        "review_title": "Just what you would expect, a bland and cliche story that doesn't understand teenagers",
        "review_detailed_main": "This is such an awful movie it makes me want to cancel my Netflix subscription, it fails to understand teenagers, high school and the average Netflix user who would waste their time on this bs"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "nnom",
        "review_rating": "9",
        "review_title": "It's not a 9",
        "review_detailed_main": "I know...but this movie got a lot of hate it didn't deserve so I tried to balance it out. It's cute, it's funny, it hit some genuine notes and missed A LOT of others. There's at least a couple spots that might start a dialogue with your kids, if you're watching it with them. There's no new ground covered, BUT...it's not forgettable, has a VERY nice ending while only hitting a 7 on the cliche meter. Lead Ava Michelle does a pretty great job, I don't know how much work she's gonna get at her height, but I hope it's more than she's expecting. I've tried to sit through a lot of these types of movies...this one took no effort at all."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bangtansuglypotato",
        "review_rating": "10",
        "review_title": "Simply beautiful",
        "review_detailed_main": "Well i can't get why this movie is getting so much hate, i actually liked it, yeah it's true that it went so fast and it would be better with extra scenes about her having real fun, but it's still amazing, i enjoyed every second, not boring at all.. i like how they didn't show that handsome boy as a total ahole, but rather showed him as a teenage with flaws, i liked her sister being supportive and how she didn't hate her although she is all she dreams about, i liked her father making things worse when trying to cheer her up lol (that s what parents do, it's their way to show us that they care), and i like her male bestfriend for not making it too cheesy with her.. it's not a perfect movie but i choose to support it with a 10/10 since everyone else is giving low ratings, totally worth my time"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "amerz-72063",
        "review_rating": "8",
        "review_title": "Tall girl isn't bad",
        "review_detailed_main": "Wow I can't believe how people are Reacting to this movie! a good movie that teaches you to be proud of yourself Who you are and how you are the characters are lovable well all I have to say I was smiling the entire movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "crimson_knight_7",
        "review_rating": "8",
        "review_title": "Light hearted and enjoyable",
        "review_detailed_main": "First, I need to address the avalanche of snowflake reviews. Yes, I said \"snowflake\", because so many people are criticizing this film based on their own experiences during highschool. News flash! This movie isn't! About! You! It's about Jody's journey, her story, and her experiences with bullying. Maybe you weren't bullied because of your height, but that doesn't mean it never happened for someone else. The idea is this film is addressing bullying, period. Do the teenagers say stupid things at time like stuff about C-sections? Yes, but that's pretty realistic cause real teenagers say stupid insensitive stuff all the time. And as for the Swedish accent being terrible, who CARES?! That's your concern?! You can't enjoy a film because the accent isn't perfect?! Critical snowflakes lol.\n\nMovie review: personally, I enjoyed this movie a lot. Were there a lot of movies tropes? Sure. But I really enjoyed the relationship that had been developing between two of the leads. The music was modern and much of it was something you haven't heard before which is refreshing from the stereotypical highschool drama soundtrack. In the end, if you can manage to see this movie for what it has to offer and not make it all about you or your sensitivities, it's a fun, light hearted, and enjoyable movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "eigna09",
        "review_rating": "10",
        "review_title": "Beautiful Movie",
        "review_detailed_main": "It was a beautiful movie with a beautiful message, it even made me tear up a bit by the end. I feel like the people who found it offensive maybe have some issues they need to work on themselves? Who knows, but give it a try, it's worth it!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "annarayleen",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "It was good and I reamon to people and if people ask me I would say what movie I should watch on Netflix I say tall girl and people in the i know because of tv shows or other movies and if you wouldn't make funny of this movie or tall people I don't because I'm dad is tall but not that tall"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "cjaye",
        "review_rating": "9",
        "review_title": "Exactly what it was supposed to be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jewelmroman",
        "review_rating": "8",
        "review_title": "Seriously just watch the movie and enjoy!",
        "review_detailed_main": "People are literally pulling this movie apart like it's Good Will Hunting or Inception or something! Like for real... how pretentious do you have to be to be watching a movie such as this and be sitting there critiquing the accents?! Lol I am 29 and I am not tall but I totally empathized with the character, and as an adult, enjoyed all of the fun and clever humour. It was a great mix of deep enough and cheesy enough to be a really awesome show so don't listen to the reviews and just relax with some tea, chill out and watch it!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "vastrem",
        "review_rating": "10",
        "review_title": "Entertaining, wholesome, downright great movie!",
        "review_detailed_main": "It's amazing how people don't appreciate inspiring movies anymore. Everyone wants to see wretchedness, blood, and movies the leave you feeling dirty and hopeless. Well, this movie is the total opposite and I LOVED it! Teared up a few times, thought about my own life and realized that I should love myself just as I am. Felt super encouraged at the end. This was a really entertaining, wholesome, downright great movie! Please make more like this!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "hasanchdhr",
        "review_rating": "10",
        "review_title": "Ignore all these haters",
        "review_detailed_main": "I don't get why people criticizing this, it's a COMEDY movie. it's supposed to be fun, not based on real life of a tall girl. Just Enjoy and appreciate the efforts they put into making this."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jeremygerstner",
        "review_rating": "10",
        "review_title": "Best movie ever",
        "review_detailed_main": "Best movie ever. Love the storyline of this movie amazing!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "lovey-gangwar",
        "review_rating": "10",
        "review_title": "must watch",
        "review_detailed_main": "An amazing movie. a high school movie i actually liked"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ahmeterde-simsek",
        "review_rating": "10",
        "review_title": "Best 3. Comedy Movie on Netflix",
        "review_detailed_main": "Tall Girl surprisingly good movie. the acting is very successful. A successful scenario and a good message. especially I like Sabrina Carpenter. I Think She's a Star of Movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "colecyrus-15421",
        "review_rating": "9",
        "review_title": "parents, bffs, insecurities, and sisters",
        "review_detailed_main": "This movie will get u cryin especially if you're very emotional. it's relatable if u think about it deeper/your way, it's just like how teenagers actually is these days, not sure if it is how it is in every school, but. it's talking about how parents treats their child these days, about best friends, insecurities and even sisters. u NEED to watch this movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kratos_ram_ramsisjeribi",
        "review_rating": "9",
        "review_title": "Very good film",
        "review_detailed_main": "This film is showing how a young girl who has her particularities can take up challenges and make the right choices"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "kungfalco",
        "review_rating": "8",
        "review_title": "Deeper meaning, a movie for everyone",
        "review_detailed_main": "The message of this film requires a deeper understanding in how it feels to everyday go to school, and suffer from bullying.\n\nI have spent 6 of my years in hiding at school, and none stud up for me, not even I. The message that you do not have to change, they have to is so touching.\n\nIt's been some time since I last cried and couldn't stop. I would disagree with people how say that this is a kidsfilm. This is a film for children, parents and all people connect to places where are differents might be seen, but isn't that what makes us human. Our difference makes us human."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "wrenleung",
        "review_rating": "8",
        "review_title": "Not That Bad",
        "review_detailed_main": "It's not an Oscar-winning movie but it has plenty of funny and feel-good moments. Still, the ending was predictable. Also, tall girls are worshipped in beauty pageants. I'm surprised she didn't consider competing with her beauty queen sister, who, by the way, seemed to be the most likeable and authentic character in the movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Javagal1978-728-345470",
        "review_rating": "9",
        "review_title": "Nice, feel good movie",
        "review_detailed_main": "Okay, everyone who reviewed this badly. You guys are taking life way too seriously. I am sorry if anyone was hurt by a movie, but its just that. A MOVIE. It was sweet, funny, romantic. Was it unrealistic? A bit, but isn't that the appeal of romantic comedies? Yep. Also, I dunno if you remember being in school or maybe you were the kid who NEVER got bullied, but to those of us who were, this was our life. Also, who cares that the swedish guy wasn't swedish. Go take a nap and get your bottle. It's a cute movie and I think a lot of people would enjoy it if saw it for what it was."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Pride1990",
        "review_rating": "10",
        "review_title": "Its very good",
        "review_detailed_main": "Dont go on nagative reviews just go for it you will love it.."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "tixithewild",
        "review_rating": "8",
        "review_title": "Typical ending",
        "review_detailed_main": "Why in (mostly American movies) there has to be dramatic public speech ending? Can't the character just change and we se the benefits at the end without justification to everyone?!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "andrewpuerta-52189",
        "review_rating": "10",
        "review_title": "this is exactly what I wanted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "crystalcrazyxx",
        "review_rating": "8",
        "review_title": "Unrealistic at points but the message is great",
        "review_detailed_main": "All of the scenes wouldn't happen in real life, but the whole message to embrace your insecurities I think is possible and is hilighted well in this movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "ashleykeylor",
        "review_rating": "8",
        "review_title": "Really cute movie",
        "review_detailed_main": "I actually really liked this movie! You've got your typical mean girl/ bully stuff, but I really love the storyline and found it to be really entertaining, funny, and sweet. Loved the ending.\n\nFor parents: There is a part where some teens at an escape room kiss. Kind of like, hey let's sit down and take a break to make out for a sec, but it's cringy and over really quickly....just kissing, nothing else."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jazznsam-26235",
        "review_rating": "8",
        "review_title": "Good but super predictable",
        "review_detailed_main": "The entire movie was so predictable, you could basically guess what they are going to say next."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "shirakatzir",
        "review_rating": "10",
        "review_title": "Best movie ever",
        "review_detailed_main": "You guys, this is the funniest movie EVER! I watched it with my friend and we literally couldnt stop laughing This is hysterical Like, on another lever I will watch again and I def recommend it!!!!!!!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "bwmorgan",
        "review_rating": "10",
        "review_title": "Train Wreck which is why I couldn't stop watching",
        "review_detailed_main": "Horrible movie with terrible acting!!! That being said my wife (who is 6'5) and I laughed the entire time. Needless to say we were extremely entertained at the horrible dialogue and the cheesy character development!!!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "jamiedarlow-37510",
        "review_rating": "8",
        "review_title": "Underrated sweet tale with strong leads!",
        "review_detailed_main": "Jodi (Ava Michelle) is a teenage girl who has always had a difficult time at school. This is due to her being the tallest girl in her school and she is constantly discriminated against. After years of keeping her head low, this story captures her rise in confidence with the help of her two best friends Jack and Fareeda (Griffin Gluck and Anjelika Washington) and her sister Harper (Sabrina Carpenter) who show her just how beautiful she really is and how her insecurities will not define her. I really enjoyed this one from start to finish and this was mainly due to the fantastic performances from everyone involved. Michelle is a very strong central performer and she does a wonderful job in engaging the viewer from the very start in Jodi's story. Gluck is also brilliant as Jack who is madly in love with Jodi and the romance of this grows even better through the runtime. I was surprised to read so many negative reviews after catching this on Netflix; a lot of people found the approach of the film offensive or just extremely unfunny. I couldn't disagree more; I think it's a very honest film that handles its subject matter well while creating a good role model in its central character and portraying the abuse that comes from high school unsettlingly well. A big shout out to 'warthenee' and 'tallgirl-45656' who have stood up for Tall Girl on IMDB and related their own experiences to their emotional investment in the film. Lay back and enjoy!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "grakky",
        "review_rating": "10",
        "review_title": "Big fan",
        "review_detailed_main": "..for the underdogs in movies, I always gravitate to their side.\n\nThe acting is great, Jodi/Ava was awesome in this and everyone got just what they deserved :)"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Erik_Stone",
        "review_rating": "8",
        "review_title": "I found it to be a great dramedy even as a guy",
        "review_detailed_main": "I have dated a girl that was 6'1\" and I'm a couple inches shorter, so maybe I can just relate to the humor better than most.\n\nThe drama is awesome, too. Everything about it is quite good, except for one scene. I laughed, I cried, and I could relate. It's difficult to make a film that does better than that.\n\nIt would have been a 9, except for that one scene. It's still a great film."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "smbulsl",
        "review_rating": "10",
        "review_title": "My new favorite!!",
        "review_detailed_main": "This was such a great movie, i loved it, it was more than a romance movie it was so much more, sooo meaningful and inspiring, it has such a great message, such a great movie 🔥🔥"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "xbmcuser-69144",
        "review_rating": "10",
        "review_title": "Tall girl",
        "review_detailed_main": "This film is not as bad as a lot of the people are saying i enjoyed it giving 10 stars as I think the film deserves a higher score I have seen films rated higher that were worse than this film don't be put off watching this film."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "anaaannya",
        "review_rating": "9",
        "review_title": "Feel good",
        "review_detailed_main": "I've wanted to watch this movie ever since it came out, I was so excited and it did not disappoint me. I didn't just feel bad for Jodi but I was connected to the movie on an emotional level, it made me feel like I wasn't alone. I might not be a Tall Girl like Jodi but I have spent the last few months learning to love myself, accept myself as me, learn and grow with people who will love me for my heart. I am usually not a huge movie person, but this movie was so empowering and heartwarming that it suddenly became one of my favourite movies. After watching \"Tall Girl\" I fell asleep feeling so happy and lifted as if someone had just come to me and said \"It's gonna be ok. You'll get through it.\" I would recommend this movie to any girls between 12-25, who feel like they are not good enough, feel alone and want something to comfort them.\n\nHere's a quick summary of the plot: 16-year-old Jodi is insecure about her height as she is taller than all the boys at school. Jack likes Jodi and wants to go out with her but she refuses because she doesn't want to date someone shorter than her. When a tall and hot Swedish exchange student, Stig, joins the school, every girl wants him. He ends up dating the popular girl, Kimmy. Soon after, Jack finds out that his family is hosting Stig. These two things cause many complications for Jodi. WATCH THE MOVIE TO FIND OUT WHAT HAPPENS!!!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "btreakle",
        "review_rating": "8",
        "review_title": "Loved it",
        "review_detailed_main": "Huge Steve What's S the story about this unusually tall girl who self conscious about it but overcomes it fan and this was a pretty good movie."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "m0viel0ver69",
        "review_rating": "10",
        "review_title": "6'1\"/6'1\"",
        "review_detailed_main": "This movie was great! as an average height girl this showed the struggle that the \"tall girls\" of the world go through. the discrimination she faced brought tears to my eye, so sad and hurtful. I really liked the dad in this. trivia: he also is the dad in the hit classic \"Diary of a Wimpy Kid\"!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "pandawesome-93452",
        "review_rating": "10",
        "review_title": "Excellent film!",
        "review_detailed_main": "Excellent film. So well made! It was a dark and stormy night; I was huddled over a raging fire. Setting camp in the woods, when I stumbled across this movie via my intergalactic space shuttle. Suddenly, I knew it was the movie of my dreams. I grabbed my humuhumunukunukuapua'a (my pet fish) and pressed play. And boy was I in for treat! I sat through the whole thing, apart from momentarily getting up to chase a bear away for two hours. But the credits were fantastic. The font might I add, a masterpiece. Overall, a must watch, the fish and I (and the bear who decided to join) loved it!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "benplays-79777",
        "review_rating": "10",
        "review_title": "this movie is very tasty",
        "review_detailed_main": "The first time i experienced this piece of art was a few hours ago, it was very breath taking to see Dody with a J (the main charactor) bloom like a butterfly out of her cocoon through out this piece. i actually watched the whole thing... i did not vomit once :) all i have left to say is, this movie is better than fornite....go add me on fortnite btw. the cinematography was spectacular they did not drop the camera once i was VERY impressed. i personally relate to dody with a J the most....im 4'11\" and lifes hard. i like the short kid too wish i could date him. the bratty popular girl is so disrespectful i was so suprised a lamp didnt fall on her while she was j-walking. lastly, the tall swittserland boi needs a hair cut :( -luv xoxo yours truly."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "seangaura",
        "review_rating": "8",
        "review_title": "A Nice PG for the family or teens",
        "review_detailed_main": "I really dont get why people nit pick so much about this movie & it only gets a 5. We like wholesome PG movies suitable for the whole family without explicit content, which is hard to find. Is it completely spot on & realistic about everyting in real life ? Maybe not, but relax its just a movie. The main character Jodi & the boy that really like her are pretty genuine & nice. The girl is first portrayed as a plain Jane type but by the end her natural beauty & humility shows her very attractive. I thought the ending especially came together very nicely in an uplifting way with a very positive message coupled with the perfect song by Maggie Rogers, which I'd never heard before & which instantly became a favorite."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Nk_x09",
        "review_rating": "8",
        "review_title": "That ending though. Best ending I've ever seen!!",
        "review_detailed_main": "An 8 only for that ending alone. Just wow unreal. Loved it. The movie is ok as an evening watch and it's kinda different from others and will definitely make tall girls feel confident again."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "autumngill-55405",
        "review_rating": "10",
        "review_title": "Review on the movie \"Tall Girl\"",
        "review_detailed_main": "This is one of the best movies I have ever seen! The movie had everything such as romance, overcoming fears, standing up for herself, sadness, and heartbreak. Even though I have seen a TON of movies in my life this is far by one of the best ones I have ever seen!"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "siennatyson-23129",
        "review_rating": "10",
        "review_title": "Loved it you should watch it",
        "review_detailed_main": "Just as I expected it to be on Netflix.it is amazing to watch I speechless (surprise)"
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "edelgocotano",
        "review_rating": "8",
        "review_title": "Heartwarming, and an ending i didnt know i needed (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "helen_walker",
        "review_rating": "8",
        "review_title": "As a tall girl I love this",
        "review_detailed_main": "To those saying 6ft1 isn't that tall I'd love to know where you guys are from. I'm 6ft in the UK and have heard all the insults Jodi gets and more. I am an adult and I get random strangers come up to me and the street and in bars and make rude comments. I love her stand tall speech and the shoes Dunkel gets her. The only bit I found problematic was the milk crate, creepy and I didn't like the fact they clearly made him look like Duckie as much as possible..."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "gajaahhhhh",
        "review_rating": "9",
        "review_title": "believe for what truly of ourselves",
        "review_detailed_main": "Things get wrong if we start to be someone that other's expect to be. so i saw this movie have a best ending which Dunken just be him self and help this girl back to the truly of her after see how Stig just care about popularity, and see how Stig at the end regret about how it feels to be popular but lose the truly of who he likes. but, something keep in my mind is actually Dunken at first make Stig to still at that 'popularity track' and that's how Stig and Tall girl didn't goes well. overall, i like it when this movie present us that love story didn't need prince charm, we need more like Dunken."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "Skylight77",
        "review_rating": "8",
        "review_title": "Could have been better",
        "review_detailed_main": "Not a bad movie, good actors, good filming, but some things are cringy especially the end. The guy was manipulative and all. There are really good moments, I wish it has been like this all along."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "juliliprecious",
        "review_rating": "10",
        "review_title": "A very good film",
        "review_detailed_main": "I don't understand why there're a lot of bad rewiews. Personally I liked it. Well, maybe it's because when I'm watching film I'm trying to catch the feelings put in it rather than notice every detail here and there. And I caught it perfectly, even cried some times because I know what bullying is like in real life. So, if you're wondering whether to watch it or not, I suggest you to watch it. It's not that bad at all, believe me."
    },
    {
        "movie_id": "tt9252508",
        "movie_name": "Tall Girl",
        "movie_rating": "5.3",
        "review_username": "whatgoesaroundcomesaround-89415",
        "review_rating": "8",
        "review_title": "I prefer horror genre but this movie is so good it's worth the watch",
        "review_detailed_main": "Not my type of movie i prefer paranormal stuff. BUT, the odd movie that isn't my typical watch I decided to take a peak see how first 20 mins were cause there's nothing else on and I was glad I did cause Wow first off I decided to check it out cause of Steve Zahan who rarely makes movies anymore and then I got hooked from beginning to end. The girl Jodi is sweet, cute and funny she plays the perfect role not just for her height but because she's meant for this part it's like they wrote it just for her. Definitely worth a watch even if it isn't your type it's just that good. It leaves you wanting more."
    }
]