[
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "PennyForMyThoughts",
        "review_rating": "3",
        "review_title": "Doesn't make any sense",
        "review_detailed_main": "In an act of masochistic boredom I actually watched the entire two and a half hours of this film so I am not being hyperbolic when I say that almost every single scene in this movie did not make any sense."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vjmatinde",
        "review_rating": "3",
        "review_title": "Bad",
        "review_detailed_main": "The premise is great. Execution, terrible. They take too long for a simple story line. Just replay Extraction again."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jonathan-alex-ng",
        "review_rating": "3",
        "review_title": "Do yourself a favor and watch something else.",
        "review_detailed_main": "I think the plot or storyline is pretty decent. But the way it was executed was horrible. Changing of scenes felt abrupt with no flow ; found myself questioning who is who. A confusing, yet really slow movie that makes you question if you should continue watching.\n\nInteresting idea behind the plot, but what a shame."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ThomDerd",
        "review_rating": "2",
        "review_title": "Come on... this is such a waste of time.",
        "review_detailed_main": "Usually I write positive reviews but for this movie I specifically wanted to add a review so none else lose their time the way i did watching this. First of all the runtime... why do you take 2,5 hours to develop and conclude this story without actually developing the story itself and its characters..?! Directing...Olivier Megaton is actually a good director, but here he didn't pay too much attention in the editing or directing. Scenes are scattered and disconnected, with random parallel stories which do not deliver anything extra to the film. They just tire the viewer. The violence... is only used to provide \"action\" to the slow-burn and dull storyline. The story itself... the idea is not bad, the delivery and the stretch of the idea to make it a 2,5 hour long movie; yes that's very bad. Acting...here it is actually 50/50. Some moments are rewarding but not enough to save this film. Overall, I m rather upset that someone spent all this money to create such a time-consuming, violent and pointless movie. 2/10 , don't waste your time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bukowski-65951",
        "review_rating": "1",
        "review_title": "Unwatchably bad",
        "review_detailed_main": "Bad writing, bad filmmaking, bad acting, no chemistry. Boring, tiresome, slow.\n\nTruly the worst of Netflix.\n\n2.5 hours long! Oh my god.. I'm not sure if anyone will see the ending. I made it 58 mins in and had to shut it off, once I realized the action was as bad as every other part of the film.\n\nHow far will you make it!?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "saeedco",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "steve11235",
        "review_rating": "1",
        "review_title": "I feel a part of me died watching this",
        "review_detailed_main": "Watch paint dry, this could be the worse film on Netflix.\n\nNetflix films had been getting better, not sure why they are buying awful films that would have been in the bargin bucket in blockbusters in the day.\n\nThe film will probably get a cult following from being so bad."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "roufhyder",
        "review_rating": "2",
        "review_title": "Felt like Tommy Wiseau made this one too",
        "review_detailed_main": "The name is appealing however at a point I felt like that this was another movie produced, written, directed by our very own Tommy Wiseau."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "DaegT",
        "review_rating": "7",
        "review_title": "Good concept, mediocre overall",
        "review_detailed_main": "I do buy the concept of this story. Such an inspiring and original one. Yet the director should have elaborated it more. Now turned out it's not romantic, not heroic, not stunning and no twisted ending. Many plot holes and rough edges. Personally I would say it's not bad to kill your time on Saturday night with this movie. It's just.... I expected more of it.\n\nIconic concept can't really guarantee an iconic movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vipadham",
        "review_rating": "1",
        "review_title": "Very shameful",
        "review_detailed_main": "The worst movie i have ever seen. Shame on you Hollywood and Netflix. The title has been wasted on this movie"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Too long and boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "emailingvicky",
        "review_rating": "10",
        "review_title": "Read the Higher Reviews first",
        "review_detailed_main": "Skip all th 1's and 2's and read the Higher Reviews. There seems to be an unknown agenda to rate certain Netflix series low. So read the High reviews because I have absolutely no idea what was boring or slow in this movie. There wasn't a moment where something wasn't happening. I'm not saying it's a 10 but it's a solid movie with a storyline I haven't seen yet. It's as good as any other movie of its genre and I eternally fall asleep during movies and I didn't fall asleep and my ADD didn't make me itch to look at my phone. Hopefully this helps me anyone looking for just some Sunday night watching."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "classicsoncall",
        "review_rating": "7",
        "review_title": "\"So you want revenge. I want legacy\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "TurtleReviews",
        "review_rating": "2",
        "review_title": "Far to long for far to little",
        "review_detailed_main": "This film clocks in at around 2 and a half hours long and it simply can't keep the viewer invested that long, the characters are dull, the plot of the film doesn't Make much sense at all and the biggest name in the film is a minor character at best. If you like good action Heist films this will probably not satisfy you in anyway.\n\nIf you want a great heist movie with plenty of heart and decent acting go watch 'The Town' which is also on Netflix."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "doc-m-atef",
        "review_rating": "1",
        "review_title": "Intensely boring",
        "review_detailed_main": "The movie suffers from horrible acting, long unreal action scenes, a plethora of plot holes and has NOTHING to do with the stopping of the american crime\n\nI recommend not to watch with all my heart, those are 2 hours and a half you'll never get back!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "neil-454-635828",
        "review_rating": "4",
        "review_title": "So bad. Could have been good.",
        "review_detailed_main": "Decent story if it had been done right. Some ok parts.\n\nOverall, irritating acting. Boring characters. Tries to hard.\n\nNetflix pushing quantity over quality. Again."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "elliotjeory",
        "review_rating": "3",
        "review_title": "It didn't keep my interest",
        "review_detailed_main": "It sounds like an interesting concept but unfortunately it falls into the seen-it-all before category. Cliche scenes and nonsense dialogue. No likeable characters and the main one has a one expression face which I found irritating. It won't keep your attention and it's not worth the time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "janedoe5300",
        "review_rating": "5",
        "review_title": "Here's my review",
        "review_detailed_main": "Great?: No..\n\nDumb?: Pretty damn dumb\n\nUnpredictable?: oh yes\n\nIn a good way?: not really\n\nPlot holes?: craters more like it, you can't even imagine!\n\nConfusing?: incredibly\n\nBad acting?: horrible\n\nExcept for Michael Pitt?: Except for Michael Pitt of course\n\nFunny?: Michael Pitt is\n\nAnnoying?: Edgar Ramírez is..\n\nHow does he keep getting work by the way, I mean he's soooo bad?: he's kinda handsome, I guess?\n\nHe kinda looks like a bearded John Mayer doesn't he?: yeah maybe that's it.\n\nBad writing?: Well duh\n\nWait, Sharlto Copley is in it?: oh yeah, almost forgot, he doesn't get much to do\n\nIs his character at least an important part of the story?: No that's just it, not at all, there is absolutely no reason at all for him to be there!\n\nOverly long?: overly long!\n\nGratuitous sex scenes?: whadda you think?\n\nWill I enjoy myself if I expect nothing and completely turn my brain of?: I did!\n\nIs that a redeeming quality?: I guess not .."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mojo_visa",
        "review_rating": "1",
        "review_title": "Worst movie ever, waste of time",
        "review_detailed_main": "Caused a permanent eye sore. Bad writing and stupid plots. Doesn't qualify to be produced."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "curtismenne",
        "review_rating": "7",
        "review_title": "Decent action crime film adapted from graphic novel.",
        "review_detailed_main": "I am not entirely sure why there is such extreme negative criticism of this film. It is a well made film based on a graphic novel that is in a style of classic American crime and action films with a dystopia police state future. It reminds me of films like Shoot 'Em Up, Crank, Death Race, and Children of Men. It is great to see studios putting effort and budget into adapting non family friendly graphic novels.\n\nPeople really need to realize that giving such harsh reviews unnecessarily to films adapted from graphic novels will only discourage studios from adapting more comic books/graphic novels into film.\n\nAside from a few slow moments in the film it is actually a decent crime action film that's well shot, well acted, and you can tell they took it seriously. Also Michael Pitt was great in this film and feel he was the stand out actor in his role.\n\nI've read a lot of negative reviews based on police brutality and riots being in the film which is the dumbest excuse to give a film negative reviews. So you're telling me that the people who started making this film years ago were trying to make a film that was what, mocking our current state of the country?! Good movie, don't over think things and just enjoy a cheasy action movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "theblackforest",
        "review_rating": "2",
        "review_title": "Some actually got paid to make this!!",
        "review_detailed_main": "Who cares what happens to anybody in this film? No story, just a bunch of scenes where the stars say random lines to try and sound profound. How did anyone in good faith ever hand real money(not monopoly) to someone for making this utter drivel."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "waremaker",
        "review_rating": "8",
        "review_title": "This Movie is not for Kids, hence they shouldn't be reviewing this film.",
        "review_detailed_main": "I did enjoy watching this film. Edgar Ramirez did a great job and so are most of the cast. Not the best film out there but it sure is entertaining for fans of action flicks and the like. Now for the bad reviews, I understand that a lot of young kids has got easy access to Netflix nowadays especially during this time of the pandemic where everyone is usually at home 24/7. This movie is not for Kids, hence they shouldn't be reviewing this film. I gave it 8 stars for the fact that the kids who put out their reviews have underrated this film. Watching a movie while on your mobile phone at the same time doing facebook is not gonna let you enjoy watching this film or any other film for that matter."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sebcaron",
        "review_rating": "7",
        "review_title": "I have no clue why reviewers are rating it so low.",
        "review_detailed_main": "All is in the title. This is a typical american action movie, not the best out there but nothing justifies that people are rating it 1 or 2... It's an average 6-7 according to me. There is a lot of action and the story is quite good, plus that fear of some kind of \"big brother\" government is still an actual thing. There is no reason not to listen to that one if you're just based on bad reviews."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "erizzle22",
        "review_rating": "1",
        "review_title": "To long and a terrible ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "TwistedContent",
        "review_rating": "4",
        "review_title": "Way Too Long and Way Too Conventional",
        "review_detailed_main": "Netflix has blessed (or \"blessed\") us with yet another crime blockbuster, this time one directed by Olivier Megaton (\"Transporter 3\", \"Taken 2\", \"Colombiana\"), who's no stranger to action movies. The critical acclaim has never been real high for him, and, sadly, \"The Last Days of American Crime\" is within the same ballpark as all his movies before. Personally, this is my least favorite chapter in his filmography.\n\nIn a not-too-distant future, as they put it, U.S. government is a week away from activating a signal that will make it impossible for people to go against the law, any and all law. It will do so via brain rape, just try lifting a gun or shoplifting a snickers and you'll freeze and shake uncontrollably. You probably can hear the sarcasm and irony already, so yes, I did not enjoy this movie a lot. Besides that particular interesting and far-fetched idea, it's a highly conventional and thoroughly mildly frustrating crime flick romp, featuring plot and characters based off ancient blueprints. Some characters are no more than a mere sketch, like the one given to the guy I was excited to see the most, Sharlto Copley. His storyline went down the mill and down the hill. First half an hour is mostly pure and simple exposition, and the action doesn't even change gears until 70 minutes into already. There's all the usual romance and subplots, all of which end up just about where You expect them. The melodrama at play here really ticks all the most typical and overused boxes. Movie's real enemy, though, is its runtime. It is way too long for its own good, way too long and featuring way too little, clocking in at 2 hours and 20 minutes & that's not counting titles. A story of this depth and this quality usually deserves maybe a 100 minutes, maybe, and even then it still is what it is. At the very least, I was expecting a good heist factor. Everything leads up to it, only for me to understand that it's the wackiest, most unexciting heist movie ever. Frankly, the heist plot and even the crime-stopping-signal plot matter very little in the big picture of \"The Last Days of American Crime\". They say the graphic novel this movie's based on, is great and all. I don't know about that, but the adaptation certainly isn't great.\n\nThe Positives? Acting. No award material on the horizon, but decent portrayals of dry characters, with the highlight probably being Anna Brewster and Michael Pitt, though Pitt's character is not easy to like. Next positive would be big budget. Movie looks arguably good, though still, by all means, it's undoubtedly an uninspired blockbuster. Crisp, contrastive cinematography, sometimes overkilled in editing, we also got explosions, raging guns, crashes and whatnot. The typical drivel, it just happens to be well made here. And original score, soundtrack - also decent. For a big part, the movie is pretty macho, many male characters are like that, boys, and if there's one truth in this world, it's that boys will be boys. The original score, being rocky and bluesy, went hand in hand with that. As for the soundtrack, it reminded of \"Sucide Squad\", because it had good songs, but no good reason to use them whatsoever. \"The Last Days of American Crime\" ended with Depeche Mode's \"Personal Jesus\" - kind of a waste on a two-bit cliché ending like this one.\n\nIt's a movie of no originality, but it's not exactly bad at being a well made conventional crime thriller, I mean as conventional as it gets, despite its sci-fi-ish backdrop. It shoots itself in all the rest proverbial knees by making itself a 2 and a half hour experience, major mistake there. Regardless of the runtime, but even more because of it, I don't recommend watching this brick of a movie. My rating: 5/10."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hassanabab",
        "review_rating": "1",
        "review_title": "Wasting of my time",
        "review_detailed_main": "Nothing is professional with this movie. Don't make my same mistake of watching it"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ismailyal-73985",
        "review_rating": "1",
        "review_title": "Waste of Time",
        "review_detailed_main": "9000 Seconds wasted just like that and i wont get them back."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Horror_Flick_Fanatic",
        "review_rating": "1",
        "review_title": "Film so bad it makes anyone uncomfortable.",
        "review_detailed_main": "This film reeks. felt like they were going for something like \"Escape from New York\" (1981) and \"Escape from L.A.\" (1996) but it totally failed. Netflix should give it's subscribers a credit on their next bill for watching this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "enjozsef",
        "review_rating": "1",
        "review_title": "Dont waste your time",
        "review_detailed_main": "I cant tell nothing without spoiling, but anyway there is nothing to spoil. its a bad movie. hopefully netfilx will change, or the people of netfilx users will change. to an other chanel."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "menab94",
        "review_rating": "7",
        "review_title": "Dont let reviews fool you. A bit long but a fun watch.",
        "review_detailed_main": "I agree that the storyline may be streched out a bit thin and its no small commitment to put the amount of time you could dedicate to a classic from scorsese or tarantino, into a quarantine-induced watch of the action-flick netflix has to offer. But that doesnt mean the movie is garbage at all. The action sequences are convincing and fun (sometimes funny) with a great character build by michael pitt (natural born killers meets taxi driver) and a decent performance by ramirez when he does speak too much. The concept of the story is a bit far fetched but you learn to resonate with it as the world is unraveled. Car crashes alla michael bay-esque and a love tringle you're not sure what to make of complete the piece you probably watched already and are trying to convince yourself it wasnt that bad after all. Thanks for reading!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jakebrann",
        "review_rating": "2",
        "review_title": "Holy s#!+ this was horrible...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Good...",
        "review_detailed_main": "I liked it, good, but it doesn't have to be that long, a good script, plot and performances, action, ingenious, nothing sublime, but entertaining, good..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rachelparkerlu",
        "review_rating": "7",
        "review_title": "Not great but okay gritty action film",
        "review_detailed_main": "I disagree somewhat with all the bad reviews; this was not run-of-the-mill and actually had some interesting ideas behind it. The big flaw is that it is clearly too long - it should have lost 30 minutes or more and sure, some scenes are pretty badly done. Yet on the whole I thought it was an okay watch. I admit I did not quite follow all the ins-and-outs of the heist, but that didn't really matter. Neither did the occasional plot holes or inconstancies. They obviously went for a very gritty, bloody action film and it certainly is that.\n\nI was expecting the idea of the 'API', a transmission that affects the mind to prevent law-breaking to just be a McGuffin, but it turned out much more interesting than that. There are shades of 'Clockwork Orange' in some of the ramifications. And there's plenty in this film about the power and motivations of government agencies, which have a lot of resonance right now. I would also mention the excellent acting performance of Anna Brewster bringing more complexity to the girlfriend role than you' expect."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "plastpose",
        "review_rating": "2",
        "review_title": "A movie without logic",
        "review_detailed_main": "So this was a terrible way to spend a night. Had some good ideas, but gets really confusing and bad the longer you watch."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "robertmckaig",
        "review_rating": "1",
        "review_title": "Wow!",
        "review_detailed_main": "So bad that they should have the national suicide hotline number on a constant loop running across the bottom of the screen!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "redgex",
        "review_rating": "1",
        "review_title": "Managed to get to 80 minutes before switching off...",
        "review_detailed_main": "Like all the other reviewers here, this was so dire that I had to write a warning to anyone considering watching this. Please don't.\n\nAmazingly, I manage to get to 80 miinutes out of 140 minutes before I couldn't stand anymore. My brain was shouting at me to stop hurting it.\n\nBy far the worst of this movie is that it drags....out....wayyyyyy....tooooo.....long! Completely unecessary considering the scenes that do drag are unimportant to the storyline. The characters don't bond and the antagonist Brick shows no sign of proving to us that he is worth any consideration.\n\nReal shame as the concept could have been actually good if they'd used the two and half hours more appropriately instead of wasting our time with pointless and uninteresting scenes."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bjgeneser",
        "review_rating": "2",
        "review_title": "What",
        "review_detailed_main": "Honestly I have no idea what happened. This movie sucked so bad."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "andrea-ee2",
        "review_rating": "4",
        "review_title": "I'd rather watch Twitter",
        "review_detailed_main": "After watching the trailer, I decided to give this movie a chance considering the tone of the world right now (June/20). Right off the hop it looked interesting, but the acting was very dry. Myself and my friend got nearly an hour in and had no desire to watch the next 1.5 hours. The acting was so terrible that I looked up who the director was so that I could avoid all future movies."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kevintbk",
        "review_rating": "2",
        "review_title": "waste of time",
        "review_detailed_main": "I am SO sleepy when watching this movie, this is exactly so call \"waste ur time movie\"!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "SquiggleyDoo",
        "review_rating": "6",
        "review_title": "Not great, but still better than The Happening.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "williamsong-19226",
        "review_rating": "1",
        "review_title": "I tried, I really tried.",
        "review_detailed_main": "Tried really hard to watch it, just couldn't finish the film. Give it 30 minutes and anyone with a sane mind will tap out. It's just so slow and boring. Even if the film picks up later on, which I wouldn't know because I just couldn't finish it, it wouldn't be worth it for the torture you have to endure to get there."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "varantaz-69-918650",
        "review_rating": "",
        "review_title": "Don't read the other comments",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "george333111",
        "review_rating": "8",
        "review_title": "Generally Good",
        "review_detailed_main": "Its a good movie. I think most people criticize it very hardly cause it came out in 2020. Its an okay movie, good plot. Not such super wow plot twist but generally its an okay movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "crom-dubh",
        "review_rating": "7",
        "review_title": "Much better than the score and reviews giving it a \"1\" would have you believe",
        "review_detailed_main": "This film to me proves probably more than any other that you can't trust most IMDB reviews or score for Netflix titles. For some reason, a lot of people just have it out for them, I think. That's the only way I can think to explain such a rash of incredibly low scores and dismissive, useless non-reviews. You've got a ton of people just saying this is \"boring\", with no qualification, one person even saying it looks like something Tommy Wiseau would make. Seriously? Such gross hyperbole. It's really infantile.\n\nNow I'm not saying this is a masterpiece or anything. The writing has some issues. The narration (which is most just at very beginning and somewhat quickly disappears) is pretty bad, and had me thinking of the narration in Southland Tales (not a good point of comparison for any film). The protagonist is not particularly well developed, I feel. It would be one thing if he were either portrayed as being sympathetic or more of an anti-hero, but we're not really given enough of either to make him seem compelling. He's just a little flat, and I'm not sure whether to attribute it to Ramirez' performance or just the way the character is written. That said, I thought some of the other characters were entertaining, particularly Kevin (Michael Pitt), who kind of stole all the scenes he was in.\n\nThe biggest complaint I've seen of the film (although, again, few seem to actually want to talk about it like a grown-up) is that it's \"boring.\" The film is a bit long (around 2.5 hours), and yes, it is a lot of set-up for the payoff. But that isn't to say nothing happens during the set-up. There are several sub-plots that are important, and I think anyone just dismissing the film as \"boring\" is probably saying more about their lack of attention span than the film itself. If you're looking for a simple straight-up crime caper, this is probably not the film for you. This film has an interesting premise and some good world-building that necessarily takes a little time to establish. As iffy as the writing sometimes is (especially the dialog), overall this really is a somewhat involved story, which is one of the film's best aspects.\n\nCriticism that the film is poorly made (see above comment re: Wiseau) is amusing at best. Again, while I wouldn't say this is masterfully directed, it's at the very least competent. The action is usually compelling, and there are a lot of scenes that have a good build-up of suspense. I never felt like I was watching something amateurish. This more than anything kind of makes me wonder what the agenda is of the massive amount of people saying such things about the film. What is their point of comparison? It seems more likely that there is some reason external to the film for them to be targeting it. But that's all conjecture, and ultimately irrelevant. All I can is that I strongly disagree and urge people to give this a shot and decide for themselves. Don't be dissuaded by the nay-sayers and the ridiculously low score (currently 3.6, which is laughable). I'd say this is easily in the 5-7 range, probably somewhere in the middle. I'm tempted to give it an 8 or higher just to offset some of the obvious troll votes, but I am going to give it a 7 which is the high end of what I think is reasonable and accurate to my experience."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "alon-dar1",
        "review_rating": "5",
        "review_title": "good 30 minutes, awful 80 minutes",
        "review_detailed_main": "It's like 2 directors made this film, one tried to bore us to death for 90 minutes. and the other is full of energy and love of good action. Acting is terrible, wow, so terrible... specially the Ramirez guy with all his suffering faces and the chick, Anna. are those real actors? they actually get paid? the light in the tunnel is Michael Pitt, he is hillarious, i watched the whole shazung just to enjoy his performance."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ola-zylinska",
        "review_rating": "2",
        "review_title": "Not good at all :(",
        "review_detailed_main": "I honestly rarely consider watching any movie a waste of time, but it sure was this time round. It dragged forever, I wish I checked the rating before watching for once."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Wizard-8",
        "review_rating": "3",
        "review_title": "Good premise badly botched up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "suripat",
        "review_rating": "4",
        "review_title": "It was all going well until",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "buzzknutson",
        "review_rating": "1",
        "review_title": "This movie could have been something",
        "review_detailed_main": "The sad part about this movie is that the horrible acting is what makes it unwatchable. The premise itself isn't bad but as another review stated it has the feel of a movie produced by Tommy Wiseau."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dpbertrand-126-427929",
        "review_rating": "5",
        "review_title": "Entertained me",
        "review_detailed_main": "Honestly, not as bad as I expected. Maybe it was the 0 rotten score or 3.6 rating that made me have such a low expectation, but I was entertained.\n\nI will say a lot of what people say is pretty accurate. The acting wasn't awful, but it wasn't always good. The story was a bit all over the place and some characters that you thought would have a bigger impact, didn't. The chemistry between actors were poor with only glimpses of what could have been. The movie also takes itself too serious. A little more tongue and cheek type of fun would have made some of this easier to watch.\n\nFor what I thought was good, the action was alright. It reminded me of action from the 80's. A lot of people holding guns that can't aim, but still thought it was fun. It's kind of the same with the car chases and explosions, all over the top fun. Finally, I hated the villains in the movie, hated them. Why is this good? Because that means I couldn't wait to see them pay for being so annoying. Not saying they do, just saying they made me annoyed enough to make me mad. I always give credit to actors who bring out real emotion, and the real villains of the movie did that.\n\nAll in all, its a wasted opportunity. I love the template of the story. Unfortunately, it wasn't executed well. I think the 3.6 and zero rotten score is not fair, but than again its a matter of opinion. It personally caught my attention enough that I was curious what would happen at the end."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Getting away with it (?)",
        "review_detailed_main": "Or purge as long as you can. I think some may have taken a page or two of this, writing about Bill Gates wanting to put chips in us and all that. But conspiracy theories aside, the movie makes overall sense with trying to minimize crime. I am not famliar with the graphic novel this is based on, so I can't compare those things for you though.\n\nThe beginning kind of sets the mood. This is over the top. Still as over the top as that seems, there is a scene that is odd to say the least. Actually being shot close range, should be the end of the discussion. But it is not - this is something that may break the movie for you. It is quite ridiculous to say the least, but it is what it is. Technically the movie works, the actors do their best for the kind of schlock it is they are in. Overall this is more than decent - it may be a bit too long, but other than that: good set pieces, great action and stunts and a decent story to hold it all together"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "therskybznuiss",
        "review_rating": "2",
        "review_title": "A waste of resources, a slot on Netflix, a waste of money, a waste of my time",
        "review_detailed_main": "Trying way too hard to be 'badass' and edgy. It's like they were trying to take the noir-laden. Style over substance near future of author's like William Gibson or Altered Carbon, for example and cross it with something like Tarantino. It fails horibly.\n\nThis definitely could have been good. I feel like it's b-movie plot and setting had just enough style and that (maybe) the original concept or screenplay ould have been good enough but some network exec got his hands on this, owed some favors out to other power's in the production world and tacked on a bunch of unnecissary bs to appease the lowest common denominator in terms of audience. This didnt need to be a love story.\n\nIt just shouldnt have been made."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ritah-28580",
        "review_rating": "10",
        "review_title": "Not a bad movie",
        "review_detailed_main": "I actually loved the movie. Enjoyed it start to finish. Loved the characters especially Kevin Cash, my bf jokes that he could've played the joker"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jbrownvr6",
        "review_rating": "7",
        "review_title": "For the Dummies who don't understand this movie.",
        "review_detailed_main": "This movie serves one purpose and it does it well. Predictive Programming. The film shows you what your future is about to look like living under a One World Government under total lockdown. It will be a cashless society, with a social credit score. The government (soon to be World Government) will control your life just as depicted in this film.\n\nSo to the latent retard who can't make sense of this film... I just gave you the scoop. Now go educate yourself on these matters so you can understand what is coming next in real life. Hint: Movies and films tell you what's coming ahead of time... hence Predictive Programming.\n\nThe power that be believe in Karma or cosmic law. They must tell you their intentions ahead of time and if you do nothing to stop it... the blame falls solely on you! Because you were told is some fashion (book, movies, TV) but failed to make the connection, or heed the warning.\n\nYou've been told through numerous avenues that a NWO is coming, and for many years."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Yahya_Adada",
        "review_rating": "1",
        "review_title": "More Days of American Crime",
        "review_detailed_main": "I rarely rate a movie or a show with one, as there is always something worth 2 or 3 stars. But this movie deserve a punishment for wasting money, being stupid, non coherent, loud, and full of holes."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Adeeb-ghazal",
        "review_rating": "1",
        "review_title": "Don't even waist your time",
        "review_detailed_main": "Again don't even watch, this is waist of time waist of your time and time"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "urmas-kungla",
        "review_rating": "3",
        "review_title": "No spoilers available- I did not finish the movie",
        "review_detailed_main": "The idea of the sci-fi theme was quite intriguing but it wasn't played out well. At least the first 1/3 of the movie after which I quit. One of the lowest scores I've given to a movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "franconway",
        "review_rating": "1",
        "review_title": "Go to bed instead",
        "review_detailed_main": "This film was so bad it caused an argument between me and my partner over whether we go to bed after 30 minutes of absolute drivel or waste another 2 hours of our precious lives waiting for it to get better. It didn't."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "We all make bad choices",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "samet34023-132-406924",
        "review_rating": "1",
        "review_title": "So Bad",
        "review_detailed_main": "I forced myself to at least begin main event. I couldnt.."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "searchanddestroy-1",
        "review_rating": "6",
        "review_title": "Not bad but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "MadamWarden",
        "review_rating": "1",
        "review_title": "LAST THING YOU WANT TO WATCH",
        "review_detailed_main": "The movie is pedestrian, boring, choppy. The acting is bad, the script even worse and every scene drawn out beyond annoying.\n\nI lasted 30 minutes..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "chopra-shubham",
        "review_rating": "8",
        "review_title": "I liked it, whatever the reviews say",
        "review_detailed_main": "I can't believe all the negative reviews this movie has been getting. Yes, the plot is weak and first half seems stretched but the direction, and action is on point. Crazy Cash is amazing, action sequences are good, direction is good. I would recommend this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "scotrutherford",
        "review_rating": "7",
        "review_title": "Vastly Underrated",
        "review_detailed_main": "A slick dystopian film that makes you think. Compelling to watch. Were the bulk of the reviews political in motivation I wonder. Great anti-heroine played by. Anna Brewster."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kramerst",
        "review_rating": "1",
        "review_title": "Omg why so long",
        "review_detailed_main": "It's like The Jersey Shore meets The Fast and The Furious. It's a train crash you watch for 2.5 hrs because you just can't stop thinking to yourself why am I being so unproductive today...."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rochfordsimon",
        "review_rating": "2",
        "review_title": "Avoid. 1 hour too long. Mess of a movie.",
        "review_detailed_main": "Wanted to like this but it's so flawed and full of holes its insulting. Lots of money spent on it and great production values, but it's so deluted you need to turn it off for something with more substance.\n\nNo real psychology if story telling in it. The characters are so plastic moulded you can see their lininging. Don't waste your time if expecting a good crime movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "marmar-69780",
        "review_rating": "1",
        "review_title": "The Last Days of American Crime",
        "review_detailed_main": "Wow what a awful film this was,it is hard to choose which part of a film was the most horrible since it had a tone of them,acting was awful from everyone in cast,characters were so lifeless and boring that i hated myself for investing my time and mind on such atrocities ,story was also in mess the whole time,there isnt one scene that is solid or at least not headache causing,script and dialogue were horrible to listen during entire runtime,action was also awfully directed and filmed in a very disgusting and ugly way,Olivia Megaton proved once again that he is awful director without any redeeming quality in him or his style of filmmaking,honestly he should stop making this crap for our sakes"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "unnamed-32145",
        "review_rating": "1",
        "review_title": "Wasted two hours of my life",
        "review_detailed_main": "Reminded me on the \"In Time\" movie. Started with an interesting idea and then turning everything into weak, unbelievable mess. Feels like an even a much much cheaper version of it. Too long, too boring. Not much story development, nothing feeling believable. All major plot lines going into nowhere. Side stories with some potential are well introduced at first, then not developed, then getting intriguing, then suddenly torn into ashes. Time ticker is shown all the time like in \"24\" but the content seen on screen does not fit.\n\nAll in one, just too predictable, too conventional, too dull. The \"adult\" scenes cannot overplay it. Should have stopped watching after a half hour."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "florenciaactis23",
        "review_rating": "1",
        "review_title": "Wow this sucks really bad!",
        "review_detailed_main": "Apparently people in movie industry think viewers have brain damage and can enjoy any garbage they do, as long they put nice especial effects and cool clothing. The industry is so hollow and is getting worst and worst. It sickens me . Anyway, don't waist your precious time in this garbage"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rubenlambalgen",
        "review_rating": "1",
        "review_title": "WASN'T ABLE TO FINSH IT",
        "review_detailed_main": "U was literally not able to finish the movie.\n\nI left at the part where they to convince the guy to join a heist.\n\nI don't know how it ends all I know is that it was among the few movies that made me quit watching."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sithstalker-75789",
        "review_rating": "7",
        "review_title": "The user reviews confuse me???",
        "review_detailed_main": "This film is called the last days of American Crime.\n\nIt's definitely got an orwlellian nanny state feel to it.\n\nIt's got gun fights, explosions, car chases and enough action to satisfy even the hardened action junkie.\n\nThe actors all played their parts well. I honestly really enjoyed this film. Yeah it was a bit too long, I can see why the love interest seemed a bit too much for some but. It's called the last days of American crime and for me this film delivered.\n\nIt's got atmos sound which sounds awesome too give it a watch make up your own mind."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "party-50583",
        "review_rating": "3",
        "review_title": "Way too long and full of errors.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "abuckenham",
        "review_rating": "8",
        "review_title": "Not as bad as people make out.",
        "review_detailed_main": "Last night I decided to give the film a try. Yea I had seen that no one has given it a good review and that rotten tomatoes had even given it a infamous 0% score! All the same here we go. Oh and I will not give anything away from the film.\n\nFirst off it starts well. It still has that element of comic book to it. So that's a good start. The cast is......... ok. Anna Brewster who plays Shelby Dupree for me did steel the film. Every scene she is in she showed that she could do much better things. The rest of the cast I am sorry to say just could not match up to her. Was that down to their acting or the writing of the film? Not too sure.\n\nThe story just did not flow that well. It kind of stop started a lot. I feel if more time was put in to it then it would have run better.\n\nSo I guess it comes down to why I gave it 8 out of 10. A big part has to go to Anna Brewster. I can not wait to see what she does next. Another part is when time was taken on action scenes it was done well. It is mostly the parts in between. Is it a possible cult film? No. It will not win any critics around as well. For me I sat down having read so many bad reviews and found it was not that bad! I will watch it again at some point but in the mean time it was interesting film. Well done Miss Brewster."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "RipTail",
        "review_rating": "",
        "review_title": "Worst film on Netflix, probably for the entire year.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dave_nails",
        "review_rating": "7",
        "review_title": "Jumbled mess but not worth the ratings it is getting",
        "review_detailed_main": "Plot has a bit going on and often focuses on the wrong thing at the wrong time. Also a couple of characters in there that are underutilised but this isn't the worst flick going around. Too long, YES, but worth a watch on a hungover Sunday with your housemates... MAYBE"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "joey_k-74060",
        "review_rating": "4",
        "review_title": "Last time I'll watch this",
        "review_detailed_main": "Pros:\n\nBeautiful cinematography\n\nCons:\n\nMain actor is one-dimensional with one facial expression throughout the entire movie Logic and plot holes Boring, drags on too long for an action movie"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "henryturnbull-28770",
        "review_rating": "1",
        "review_title": "Worst film I have seen in years.",
        "review_detailed_main": "Don't waste two and half hours watching this like I did as you will never get that time back. It was a slow burner from the start that never even caught fire. This is my first ever review of a film on IMDb and for good reason; to warn people not to waste their time watching this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "megrimor",
        "review_rating": "1",
        "review_title": "I WILL CHOOSE SLEEP OVER THIS BORING MOVIE",
        "review_detailed_main": "Everything about this movie in its entirety is boring. And don't even waste the little time you have watching it. Go and watch something else."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "phillip-henry",
        "review_rating": "5",
        "review_title": "Far too long but was ok",
        "review_detailed_main": "This is a movie that should have been 1 1/2hrs long there's an hour of the movie that can be skipped without affects the storyline.\n\nSome of it makes no sense but it's an interesting concept just poorly executed It's not badly acted, actors can only manage to carry so much themselves, without the script and good editing most actors would look poor."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "pascual-953-520640",
        "review_rating": "3",
        "review_title": "Pale and dumb imitation of early Quentin Tarantino",
        "review_detailed_main": "This movie tries so hard to imitate the cool and hard hitting movies of the late nineties, especially in the style of Quentin Tarantino. The director has even tried his best to make the female lead character a carbon copy of Uma Thurman, down to the barefoot low angle shots that Tarantino are known for.\n\nBut sadly this movie is a failure. The story is so thin, the characters so unlikeable and it was just plain boring to watch. Probably one of the worst movies I've seen on Netflix in a while."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "adisbarakovic",
        "review_rating": "1",
        "review_title": "worst film ever",
        "review_detailed_main": "Worst film ever.\n\nWorst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever worst film ever."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "saptesh786",
        "review_rating": "7",
        "review_title": "for API and do not judge with low ratings!",
        "review_detailed_main": "Wonder to see such low ratings. This movie is worth for 6 and above. Though half part is not remarkable later half or 60 % is watchable and interesting. All this part is full of thrill, action and tension gives you lot of moments interesting to watch. End is little unexpected. Movie is showing dark crime, corrupt FBI, nasty mafia and above all a attraction of API. A future government weapon to attack on your brain to come down crime rate. However this portion is not well narrating. As me once time watchable for action and thriller lovers. Do not go with low ratings."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "filip-03897",
        "review_rating": "2",
        "review_title": "Its a crime this move was made",
        "review_detailed_main": "Manage to watch the whole move, but the last hour or so was more or less plain agony."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "wofat-88327",
        "review_rating": "8",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Tsetso_P",
        "review_rating": "",
        "review_title": "Five stars might be even high",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dennis_denio",
        "review_rating": "6",
        "review_title": "Too many critics",
        "review_detailed_main": "We are in the days of instant gratification, and viewers can't hold their attention without popping adderall. Good slow movie, I still enjoyed it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vassilisspl",
        "review_rating": "1",
        "review_title": "Big big NO!!",
        "review_detailed_main": "2.5 hours complete waste of my life.\n\nJust waited until the end, hoping that it would get eventually slightly better but NO!\n\nAwful script. Awful acting. Complete waste of the budget!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "gpedz",
        "review_rating": "3",
        "review_title": "Why didn't I read the reviews first! WHY!?",
        "review_detailed_main": "Terrible. Just terrible.\n\nStarts out alright but falls to pieces 1/2 way through. You hope that it might all come good in the end but....it just flops."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "britneyat",
        "review_rating": "1",
        "review_title": "My first time to make an account and express here my dislike about this movie",
        "review_detailed_main": "It has great budget for the after film- production, gun/ cars , explosion . However , the casts are worse than tv dramma actors. Story line is lacking. 2 hours , I have to pause and do other house cleanings to get my intrest back . It is extremely dull . Actors have never thought about how to carry the role. 👎👎👎don't watch. Have the actors not received full salary or somthing, that they lack the intrest too. The father is killed , so what? They do a rocket launder back? And what? The man is set fired? But not even hurted? Forget it ..the director should be black listed from producer please."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "malevuxi",
        "review_rating": "2",
        "review_title": "This movie is really, really bad",
        "review_detailed_main": "I watched the whole thing. Why? Well... Anyway, it's so weak on the plot that it should not even be on DVD. Every subplot is flimsy and insulting. It should be used as a \"How not to make an action movie\". Megaton must try again."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "aguynameddrew",
        "review_rating": "3",
        "review_title": "Good title, bad movie",
        "review_detailed_main": "Yet another movie that makes me wonder why exactly am i paying for a monthly Netflix subscription.\n\nIf i went to see this in a movie theatre i would have gone to get popcorn and never come back."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "chepitonica",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Without a doubt the worst movie I have ever scene. Don't your time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "benevsx",
        "review_rating": "",
        "review_title": "my first ever review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tvdefrancesco",
        "review_rating": "7",
        "review_title": "Not Bad Fresh New Idea",
        "review_detailed_main": "Felt I needed to add a review. This movie is nowhere near as bad as the reviews make it seem. Thought it was a good idea and definitely where our society is headed. 5G was originally created as a crowd control tool that emits a certain frequency that can stop people in their tracks. I thought it was cool how this movie took it one step further.\n\nSome of the characters were ridiculous and the acting was over the top, but the action was good. It was a fun movie. It's no John Wick, but definitely fun and full of action. Critics giving it a 15 is absurd."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "remidu",
        "review_rating": "1",
        "review_title": "Humongous amount of rubbish",
        "review_detailed_main": "Worse plot, worse story line, worse acting, worse waste of money (and my time!) 2 and a half hours of nonsense that any good producer/director could have turn into a good 90 minutes feature... What a shame! I really proves that rather than paying for a good script, Netflix spend their production money buying cheap ones, and then use the budget to pay a half well know actor/actress to sell it and attract dumb viewers... Thanks Netfluck (😉) for transforming an art (the 7th) into a product!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "djmike-63474",
        "review_rating": "8",
        "review_title": "Same movie?",
        "review_detailed_main": "OMG, did we watch the same movie? I watched this movie, came to the reviews all set to read praise about an action packed shootem up and........................bam. Most of the people seemed to hate what I thought was pretty good. I don't understand how someone bragging about how they turned it off after 58 minutes is entitled to such a strong opinion about something that is 149 minutes long. Well I liked it,will probably watch it again someday. Nuff Said Mike Out.\n\nWell here we go again. They won't accept my review because it's not 600 characters. So this is just a bunch of Superfluous filler so that they will accept my review. This has absolutely nothing to do with the film just to submit button. Let's try again."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "zbossvideo",
        "review_rating": "6",
        "review_title": "It's definitely bad...but I loved it",
        "review_detailed_main": "The whole movie we were asking \"What?\" \"Why?\" \"How did that happen?\" \"What happened to the....\" - continuity questions, logic questions. But we were having fun. You definitely have to suspend reality and disbelief for this one.\n\nIt is long. I won't put a judgement on that cuz I enjoyed it - but if you don't like it, like many people, it will probably be too long for you.\n\nThere's some scenes that I really liked - that I still think and talk about it days after the fact. Some are just plain weird.\n\nIf you're intoxicated, or high or something - you'll probably have a fun time with this movie. Just don't think too hard and you'll probably have a good time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "andrew-register1",
        "review_rating": "1",
        "review_title": "Don't waster your time",
        "review_detailed_main": "I have nothing new to add that hasn't been said in other reviews. The concept was decent and would have turned out great with better writing and a competent director. Given it had neither of these, here lies a waste of time and money."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Chrispearce2",
        "review_rating": "2",
        "review_title": "The other reviews were right",
        "review_detailed_main": "Not even worth a review. Simply don't bother. Quicker and less painful to read a review with spoilers but as no-one knows what's going on, that might be hard."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "papovicnikola",
        "review_rating": "1",
        "review_title": "Worst film ever.",
        "review_detailed_main": "Never paid atention to directors and producers so much, but I Will from now on, thanks to this fil... What ever this was. Maybe the crew should get together in real life and injure one another for making this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hotalex",
        "review_rating": "1",
        "review_title": "Long and boring. Pisses on your intelligence.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kevin-68286-98414",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "This movie consisted of my spending two hours that I will never be able to get back it is terrible"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "michaelwheeler-36661",
        "review_rating": "1",
        "review_title": "Crime against movie goers",
        "review_detailed_main": "A guy who is all sulk and beard kills a load of people. There's a voice-over who I think is introducing characters but they all get killed. 15 minutes in and I'm lost. The rest of the movie is dimly-lit shakey-cam of people pointing guns at each other. That's about 2 1/2 hours, and every single moment is a reason not to watch this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "wolfie-23088",
        "review_rating": "7",
        "review_title": "Good action movie",
        "review_detailed_main": "Definitely not 3stars. If you like tough guy, Commando, Wick like movies you will like this"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "asjseen",
        "review_rating": "1",
        "review_title": "It's one of those, \"well we just had a movie?\" movies",
        "review_detailed_main": "I thought that maybe I was looking away from the screen too often but after restarting this out of confusion 3 times(yes I said 3, Wait, got interrupted again and now I'm on the 5th run.) I finally just accepted it to be bad. All the lines were delivered slowly with unnecessary pauses after almost every line. There were sweeping shots of landscapes as edits that also either lasted too long or were too frequent. Any semblance of character development was tossed out the window. Soundtrack was awkward and so were the \"romantic bits\""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "liveit-28426",
        "review_rating": "8",
        "review_title": "Great acting! Great action!",
        "review_detailed_main": "Great acting and great action what more do you want?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mohamedahmedali44-727-99368",
        "review_rating": "6",
        "review_title": "So underrated!!!",
        "review_detailed_main": "The most underrated movie i have ever seen. 3/10 !!! WTF For the love of god its a heist movie and it's really have a story"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "eprusulis",
        "review_rating": "1",
        "review_title": "Could of been a great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "andysundarson",
        "review_rating": "1",
        "review_title": "Horribly bad movie",
        "review_detailed_main": "Movie's story line is OK but the screenplay is terrible. Too long for a bad movie. It was a mistake to watch this movie from start to finish. Had I read the reviews, I would have found something else to do."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sayedreeza",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "The worst from Netflix\n\nDon't watch even if you are free 24 hours"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Otte1",
        "review_rating": "3",
        "review_title": "Great action....absolutely nothing else",
        "review_detailed_main": "Pros: 1. Some very intense(sometimes long) action scenes\n\nCons: Everything else. 1. Logic...there are none, laws of physics, gravity, fire all broken. It makes Fast and Furious science believable 2. Plot...not sure, the movie is often reminding us what the plot is then it does something that supposedly the plot won't allow. 3. Direction...all over the place 4. Acting...main character when to Kristen Stewart/Kneau Reeves acting school...nuff said. 5.Ability to shoot...almost all action movies have terrible shooters, this one is one of the worst I've seen. Military/police trained and LITERALLY standing three feet away with automatic weapons and miss. 6. Security...almost all action movies have the bad security systems, this is one of the worst I've seen. My video doorbell was higher security then some scenes with billion dollar technology."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ChristianSHo1",
        "review_rating": "1",
        "review_title": "Had to turn it off",
        "review_detailed_main": "Just a horrible mess. the most boring, confusing and stupid film ive seen in a long time. Dont waste your time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "GimmeMoreGore",
        "review_rating": "1",
        "review_title": "I can barely make this review",
        "review_detailed_main": "I made it two minutes in. I really tried, sorry. It actually became physically painful. Considering a lawsuit."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mark-leyden-174-203270",
        "review_rating": "",
        "review_title": "Ignore reviews - awesome!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "essjayole",
        "review_rating": "6",
        "review_title": "It isn't that bad!",
        "review_detailed_main": "The collective low score probably reflects people's disappointment more than anything. A score born in scorn. I agree it was obtuse and could have been better but if you look through a man Arthouse lens. It's ok. The action is up there. High quality visuals. Beautiful people. It's worth a six just for its ability to steer you away from the banality that is 2020 right? I mean.. Joel Edgertons \"It comes at night\" gets over six and phew! What a stinker. Now there is a nothing film with a presumed yet unexplained apocalypse scenario, that runs from reason and intensity like its wearing Apollo's winged sneakers. I mean damn. This at least had badly executed premise. But a promising premise none the less."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "glen-52166",
        "review_rating": "2",
        "review_title": "Boring",
        "review_detailed_main": "Was intrigued by the synopsis. Sat down to watch it and was bored as hell. Made it through the whole 2.5 hrs in Hope's it picked up. This is one slow boring dry movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Hubeast",
        "review_rating": "9",
        "review_title": "I loved it",
        "review_detailed_main": "I don't get the hate I was entertained the entire time. Sure there are some plot holes but who cares."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sissy3006-179-640454",
        "review_rating": "6",
        "review_title": "Wicked",
        "review_detailed_main": "This was one wickly brutal movie, all for the money. As usual Michael Pitt was famously crazy. Not bad"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sprmarius-26890",
        "review_rating": "1",
        "review_title": "What a bust",
        "review_detailed_main": "I especially created an account for this movie just to rate that i lost 2 hours of my life time just watching a garbage. The main actor is a joke, the story is written by a 6 years old and i have only one question for the producers: why in the world will you spend so much money on something so lame?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hamburgerjason",
        "review_rating": "1",
        "review_title": "Bad movie",
        "review_detailed_main": "Boring and has no story. Netflix has to bring some better movies than this one"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rovex32",
        "review_rating": "2",
        "review_title": "Worse than SyFy movies",
        "review_detailed_main": "This was just horrible, Its even worse than those terrible movies SyFy show. You know the ones, often disaster movies that all have the same basic plot? Well they are better made, more interesting, better acted and better paced than this complete garbage."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "agent-spy-59317",
        "review_rating": "1",
        "review_title": "Horribly Executed",
        "review_detailed_main": "Fantastic idea for a movie! Horribly, horribly executed."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "emiliovillegas-38961",
        "review_rating": "1",
        "review_title": "I have never been so bored in my life",
        "review_detailed_main": "Couldn't get past the first hour. The story line makes no sense. You are waiting and waiting for the pieces to come together but they never do. I dont know what the director was trying to do here but he failed miserably. Such a shame and waste of resources."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "garynorton",
        "review_rating": "4",
        "review_title": "Poor crime comic book graphic novel adaption",
        "review_detailed_main": "Set in a future where the government are going to go live with a \"signal\" to prevent people committing crime in a seriously crime-ridden future, a trio of career criminals seek to carry out the ultimate heist under the shadow of the \"last days of American crime\".\n\nThe original comic Source material had a gritty visual style which has been lost along with its crime noir style to a tonally inconsistent and generically sterile product. Another issue are the three main leads: ; none of whom resemble any of their original incarnations. Putting aside those of us who might know what it's based on, Edgar Ramirez just looks glazed in boredom; Michael Pitt chews up scenery as an OTT spoilt son-of-crimelord-with-daddy-issues & Anna Brewster's femme fatale is sadly lacking any real sexual charisma which is needed for the part. Oliver Megatons direction is also far from enticing, which given some of his mediocre previous Efforts like Taken 2 & 3 and Transporter is hardly surprising. To add to the various issues, Sharlto Copley pops up every now and again as a dumb cop who would appear to have some intrinsic part to play in all this, but even his involvement left me thinking why did they have him in it at all? The big heist finale is also botched with little build up in tension or excitement - a crime which seems fairly easy to carry out and unbelievably executed. I quite like some of Netflix movie production output, but they have more than their fair share of crap product and sadly this is one of the latter."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "marco-030",
        "review_rating": "7",
        "review_title": "It's OK. Fun to watch.",
        "review_detailed_main": "It's ok. Story is a bit thin but the acting is fine, some good jokes, nice action and some surprisings."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "joeyford-55342",
        "review_rating": "3",
        "review_title": "Boring and WAY long - a perfect analogy of Netflix today",
        "review_detailed_main": "This movie was a waste of 2 1/2 hours. I am seeing a trend where these are getting air-time on Netflix. What happens is companies make these stinkers, they don't get a distribution deal so instead of going straight to DVD they sit on a shelf. Netflix is trying to pump up the number of movies they have available so they are funding anyone with a script and buying these old stinkers and putting them out on their platform. This move could have been better if an hour of talk was cut out. There were lots of speeches and conversations that were so silly the viewer laughed at the people made to say them. It is a European made movie about how bad violent America is in the future and Canada is the goal for all Americans to escape their life of crime. Some guys wanna steal money to make the trip. The FBI has come up with a mind control device that all Americans will wear and blah, blah, blah. It is a mess. The acting is fine and the nudity is fun but the script is a mess. Don't do it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "arreazagaby",
        "review_rating": "8",
        "review_title": "The only thing worth in the movie... Edgar!!!!",
        "review_detailed_main": "It's not the greatest action movie ever... I think my problem was with the editing, poorly manage! Not so great acting either... but the photography and Edgar can entertain you long enough!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "remyhearts",
        "review_rating": "6",
        "review_title": "Michael Pitt, watch for him and nothing else.",
        "review_detailed_main": "Micheal Pitt made this trainwreck of a movie watchable, he was funny, loving, tough, charismatic and his acting is so underrated in my opinion. He was the perfect actor for Funny Games and this movie is worth watching if you have the time and drive to laugh with Michael Pitt. He knew what he was doing. It doesn't hurt that he's a sexier version of Kurt Cobain either ."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "joshhernandez-62986",
        "review_rating": "1",
        "review_title": "Great movie if you need to waste a couple hours of your life!",
        "review_detailed_main": "Even after a night of heavy drinking and a terrible hangover, this movie made me want to keep killing my liver than keep watching. The actors are trash and one scene where father, son and sister argue is like seeing a group of 5 year olds having a screaming match. Just because you can make a movie doesn't mean you should!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "That_1_guy",
        "review_rating": "2",
        "review_title": "I don't get it...",
        "review_detailed_main": "Netflix says this is rated #5 in Canada today or something... well I'm from Canada and this is garbage...."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tommytomato-15522",
        "review_rating": "1",
        "review_title": "Truly terrible",
        "review_detailed_main": "This movie has to be the worse film of the year, the acting is awful and nothing makes sense it's all over the place, another pile of warm poop from Netflix, AVOID"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "samjgriffiths-71079",
        "review_rating": "1",
        "review_title": "10 mins in and I'm over it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tammykiggins",
        "review_rating": "1",
        "review_title": "Painful",
        "review_detailed_main": "After the first 20 minutes were incredibly hard to get through I knew the rest of the movie would just be terrible. I was right."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "adios-muerte",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Don't waste your time. The trailed and Netflix stump makes you think \"oh well it must be decent right?\"\n\nNo. It was so bad that I decided to help others by writing one of my first reviews here.\n\nUse the 2 and a half hours on something else."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jan-biebaut",
        "review_rating": "6",
        "review_title": "A cocktail of action, betrayal and movie noir love",
        "review_detailed_main": "Quite a nice exciting film. The story is classic even if there are twists that I did not expected. The acting was also pretty good. There are some scenes that are a little less believable, such as characters who with many gunshot wounds still perform heroic deeds, but that's the thing with action films. ."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "xpunisherx",
        "review_rating": "1",
        "review_title": "Couldn't finish",
        "review_detailed_main": "I was getting so bored and annoyed that I decided to look at the reviews. That's when I decided to just turn it off. It's so slow with bad acting and the main character is obnoxious."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "faer_kr",
        "review_rating": "9",
        "review_title": "Exacerbated violence",
        "review_detailed_main": "An intense action movie. Quality. Spectacular The action scenes are spectacularly accomplished. Performances at the level required. The entertaining turns so that you don't feel the two hours with twenty-nine minutes that it lasts. It's about an individual seeking revenge for his brother's death, and the way to do it is by teaming up with his former cellmate and girlfriend to dock. A simple view is a generic action story, the interesting thing is that it touches an ethical issue that is about releasing a signal that Inivides in the brain the trace of violence making it disappear, they remember that this premise and is touched on in \"The Clockwork Orange\" where the question stands out: Is this not against universal human rights? Safety pin The scenes of sex and violence are well managed. It is not for children, it handles exacerbated violence. The only bad thing is that it has two scenes that are not completely achieved and one of the characters after being shot after hours walking dancing as if nothing had happened."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "davidlumpkin",
        "review_rating": "6",
        "review_title": "Not as bad as other reviewers",
        "review_detailed_main": "I wonder if the other guys watched the entire movie. It's an action movie, good guys, bad guys. Good looking girls. Stupid dialogue. Just like any Marvel or DCU comic movie. Everybody expects The Seventh Seal or Body Heat. Those movies are few and far between. This movie is just a filler. My eyeballs did not fall out."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "craigmbriggs",
        "review_rating": "1",
        "review_title": "Interesting concept but a complete misfire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "armand-74815",
        "review_rating": "1",
        "review_title": "2 and a half hours of absolute nonsense.",
        "review_detailed_main": "Say no more. DO NOT WASTE YOUR TIME!!! This is pure and simple BS."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "cotta002-318-865119",
        "review_rating": "2",
        "review_title": "Confusing storyline",
        "review_detailed_main": "Set in not too distant future I thought ok will have a look but regrets I had a few! Story was confusing and elements in the movie were unbelievable. I know this was a make from a book so maybe reading first would have been better but for me this was not a keeper. I for one am glad it was the last days, turn the chip on please just make it stop."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "anvilkniveshh",
        "review_rating": "2",
        "review_title": "Omg worst movie ever",
        "review_detailed_main": "Just bad.. Everything.. Characters.. Actors.. Story totally boring... Netflix give me back the 2 hours of my life u stole me"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "buysomeflowers",
        "review_rating": "3",
        "review_title": "It could have been good",
        "review_detailed_main": "Good idea for a movie, now that writing about viruses is a tired theme. It gives us something new to worry about. It felt like all those scenes with Michael Pitt belonged to a much better movie. He is a brilliant actor but no human can save us from promising Netflix's catastrophes."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Andy_Aitken",
        "review_rating": "2",
        "review_title": "This could have been called \"T last days of good Netflix movies\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sjoblomgubben",
        "review_rating": "6",
        "review_title": "Actuality not that bad!",
        "review_detailed_main": "Liked the storyline but some action scenes where totally unrealistic! Apart from that and the fact that the movie was 45 min too long it was pretty good!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sonerayanlar",
        "review_rating": "3",
        "review_title": "Wtf netflix",
        "review_detailed_main": "No good no good at all. Still wanna watch? Suit yourselves."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "samh666",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "From beginning to end I loved it..... I know it is 2 hours 29 mins long but it is well worth it..... I know people are saying they could have done it in less time but I disagree I thought the more in depth with the characters was amazing 💖 highly recommended"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kenleongrmt",
        "review_rating": "6",
        "review_title": "Tempted to give this movie a 7",
        "review_detailed_main": "Come on, folks, it's a Netflix movie! It establishes an interesting time and place, semi-science fictional as it is. It's got the ingredients we all know and love for crime/heist movies, and it's got enough good actors to keep us invested in the events and caring enough what's going to happen to them.\n\nIt's a bloody action move, not high Renaissance theatre. With popcorn and a wish to sit back and put the brain on hold for an hour or two, this is EXACTLY what real action movie fans want once in a while."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "musth-0815",
        "review_rating": "1",
        "review_title": "Brain Fart",
        "review_detailed_main": "Not a single likeable character in the movie, way too long mediocre script and acting, boring and cliché-ridden. I feel violated.\n\nThe overall vibe of the movie (poor career criminals have it so tough) was sickening."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rriva-417-993719",
        "review_rating": "1",
        "review_title": "BAD",
        "review_detailed_main": "I agree, this movie should not have been released. It's as bad as bad can be."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "therealjaysmoke",
        "review_rating": "1",
        "review_title": "Stopped watching after the mini caravan scene",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "twanster-97655",
        "review_rating": "1",
        "review_title": "My opinion",
        "review_detailed_main": "I like edgar, he's a great actor but even he couldn't save this title. Alot of people panned this because of world events happening right now but even in good times this film is just rubbish. The plot is weak the finished product looks unfinished. The director must have slept thru the filming and the producer must have been absent aswell.. One can't help by wonder how films like this make it into production.. It should have been called \"That'll do\" because that's the general feeling this film gives off.. Like it was all made with a \"that'll do\" attitude. Netflix has lowered the bar on this one... The real crime is the running time... Maybe that's why the movie sucks so bad because everyone behind the cameras were asleep!\n\nIn short... You'll never be bored enough to enjoy this film. It's only good feature is edgar but even he can't save it. Definitely the worst film I've seen this year."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ascott-481-678549",
        "review_rating": "1",
        "review_title": "More blanks fired than after a Vasectomy",
        "review_detailed_main": "The Director obviously only issued blank rounds to the Police...5000+ rounds fired point blank at a truck and didn't even crack the windscreen 😆"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "cruise01",
        "review_rating": "5",
        "review_title": "Last days of crime is not last with its overlong run time and uninteresting story.",
        "review_detailed_main": "The Last Days of American Crime (2.5 out of 5 stars).\n\nThe Last Days of American Crime is a crime action thriller that may entertain with its mind numbing pointless gun shoot outs and gritty violence. But the story does take a back seat with uninteresting characters. And a concept that plays like a sci fi thriller. With the idea taking place in the future. Where law enforcement are planning to use a signal to stop people from committing crimes. That is where Brick (Edgar Ramirez) comes in. When he discovers his brother is dead in prison. He plans to get revenge by one last crime by robbing a money vault. With the help from Kelvin (Michael Pitt) and Shelby (Anna Brewster).\n\nThe plot is boring. There is a twist with a character. The characters are forgettable and uninteresting. Brick is a guy who wants to get revenge for his brother. Kelvin is a want to be gangster who wants to commit a big crime to impress his father. And Shelby who is Kelvins love interest has her own personal agenda. While, officer William (Sharlto Copley) had a rough past as a cop. Sharlto Copley's character is very undeveloped.\n\nThe film does have a decent amount of action to make this entertaining or its flashy direction. The film is over long for its running time. The first half was entertaining. When the heist is happening. It all comes crashing down a little too fast. Which makes it hard to keep interest in the movie.\n\nOverall, it was a pretty bad movie. The acting is dull. The characters are boring. The story and concept is messy and tedious."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kwenchow",
        "review_rating": "5",
        "review_title": "Surprisingly not bored! A bit slow at the middle, but overall quite intense! Should watch it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ramuimaho",
        "review_rating": "9",
        "review_title": "Underrated",
        "review_detailed_main": "I came here before watching it. Due to previous reviews, I almost not watched it. But I took a risk, guess what: it's a great movie by far. People who viewed here I think they are from other studios. 2:30hours but feels like normal movie of 1:30hours.\n\nGive it a try. You won't regret."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "brunoamserra",
        "review_rating": "2",
        "review_title": "another netflix flop",
        "review_detailed_main": "I'm a fan of Netflix. I'm a subscriber for a long time. But men..... you need to watch 10 originals to enjoy 1 or 2. This one is so, so bad... I watched...50min. And I suffered"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "irenerainbow",
        "review_rating": "1",
        "review_title": "Waste of time.",
        "review_detailed_main": "It was too long, too boring. And it was the worst time to release this movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Mrachromatic",
        "review_rating": "1",
        "review_title": "Just awful",
        "review_detailed_main": "The irony of this movie is that if the API,a signal which blocks any criminal act, were in fact real this movie would not exist as the act of writing the screenplay is a violation of several standing laws forbidding cruel and unusual punishment."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "egruber130",
        "review_rating": "3",
        "review_title": "Has the Virus Now Affected Movie Making?",
        "review_detailed_main": "Gave it the benefit of the doubt thinking it was supposed to be in graphic novel style. When in reality, the graphic novel description was merely a way to try to explain away a film of such poor quality. I was hoping for more from Michael Pitt's performance, which was decent, but it ended up being more of the cliche unstable bad guy routine. Absolutely astounding that this movie is nearly two and a half hours long."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "radhrh",
        "review_rating": "2",
        "review_title": "Supernaturally bad",
        "review_detailed_main": "This is what happens when comic book fanboys make movies."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "thebasedgod-63582",
        "review_rating": "2",
        "review_title": "A Microcosm of American Self-Hatred.",
        "review_detailed_main": "I do not understand the flurry of films coming out of the US which vilify and desecrate themselves so masochistically. This is a continuation in a trend and is generally made by poor filmmakers and young directors with an overt loathing of the world that is today. It is not to say that their views are wrong, simply that when utilising such films as a vehicle for their views, it is painfully overt and lacking any subtlety; in other words, they view the average consumer as on mental parity with a foetus. Everything is explained in this movie, irritatingly so when the plot itself is simplistic and can be summarised in the opening six minutes or so: America irredeemably bad - Canada unquestionably good. Government and order unquestionably bad - anarchy and disorder, revered and praised. It is an interesting concept certainly but is executed so poorly, so hamfistedly and so condescendingly of the audience that it is a painful, and laborious viewing. It attempts to be stylistic in periods, and is utterly soulless in doing so. The film lacks substance likewise. An interesting premise but that is all. Avoid."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "luis-pinto-1",
        "review_rating": "2",
        "review_title": "It's a shame money was spent doing this",
        "review_detailed_main": "I couldn't stand watching this movie after the 30 minute mark.. Seriously, Netflix needs to start moderating where the funds go and the quality achieve with them. Bad actors, bad story line, boring, bad editing, after 30 minutes I knew where this movie was going really really bad!\n\nSave your time!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "radicalstudios",
        "review_rating": "9",
        "review_title": "A Fantastic Pulp Noir with Great Acting",
        "review_detailed_main": "I had been waiting a long time for the film to come out and it played great. It's truly a character driven love story with some topical themes, great performances, cinematography and action scenes. I can see why the film may not be for everyone, but don't let the movie trolls scare you away from watching a very enjoyable Netflix film!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vivid7",
        "review_rating": "2",
        "review_title": "Worst action movie",
        "review_detailed_main": "Don't waste your time or do something else interesting when you're watching this movie. And the icing on the cake it last 2h30..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dick-fleischer",
        "review_rating": "1",
        "review_title": "Was this thing made for real?",
        "review_detailed_main": "Watched it with a group of friends and we had a hard time figuring out if this \"thing\" was made as a joke or as a serious thing. It felt like watching a SNL skit made by humorless people."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mianselby-32088",
        "review_rating": "1",
        "review_title": "Thank goodness it's the last days!",
        "review_detailed_main": "Never written a review before. Created an account just for this. My dad always tells me to check reviews and today I finally learnt my lesson. Questionable acting. So many plot holes there's not even a plot. My mum and I watched this tonight and the most entertaining part was reading all the reviews. My advice is watch the 30 second preview and save 2 hours of your life."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dhodgen",
        "review_rating": "1",
        "review_title": "Enough acting for 3 movies",
        "review_detailed_main": "What garbage. If they combined all the overacting they would have more than enough for 3 movies. I'm sure this must've been there aim cos a movie couldnt intentionally be this bad"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "paulONeil68",
        "review_rating": "1",
        "review_title": "Absolutely rubbish",
        "review_detailed_main": "OMG... what rubbish. 45 mins in and I'm crying for it to end. So to stop my suffering I turned it off.\n\nYou have a moody lead. A long hair muppet and a borderline personality disorder tart.\n\nTerrible dialogue, terrible visual, completely emotionless acting\n\nAnother Netflix failure."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "foolmetwice",
        "review_rating": "2",
        "review_title": "My expectations were already low and this movie exceeded them all.",
        "review_detailed_main": "An asinine, mean-spirited heist thriller with unlikable characters, brainless action sequences and even more brainless attempts at social commentary, The Last Days of American Crime does nothing to justify its bloated runtime or existence. Most of the actors look bored, Michael Pitt is the only actor trying to breathe life into this clunker and Sharlto Copley is pitifully underused."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "lenny_amsterdam",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": "Bad storyline, too long, waste of time watching it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dogma-53668",
        "review_rating": "9",
        "review_title": "Everybody's a critic but not a good critic",
        "review_detailed_main": "Never mind the critics who jumped on this the minute it came out it's a good crime drama pretty gritty based on a graphic novel. If the critics could do better why don't they. Good soundtrack it's got kind of a 70s crime drama vibe. Don't listen to the critics or to me actually see it for yourself. You decide, there's worse and I mean worse Netflix crime dramas out there."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hklawless",
        "review_rating": "2",
        "review_title": "Watch something else",
        "review_detailed_main": "Length would be fine with good writing, acting, directing and storyline that doesn't get lost and run around in a paper bag for a while wondering what to do next. Alas, none of those things happened. I can say with conviction that this director and location scout has never set foot in the place it ends the movie in. We laughed right out loud."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "skunksurffer",
        "review_rating": "1",
        "review_title": "Bad and Awkward",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "iwaynerooney",
        "review_rating": "2",
        "review_title": "The Daddy Scene",
        "review_detailed_main": "The film was plodding along finely for me but the moment they got to see Pitts Dad the film had such a The Room feel to it. The exposition by his dad that nobody in the scene had given cause for, the terrible dialogue and acting from all parties. This preceded a chase scene where it seems nobody has ever shot a gun before. I've never seen a fine film go so south so quickly before in my life and there was still like an hour and a half left at that point. Tragic."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "gvwln",
        "review_rating": "1",
        "review_title": "Diesel? Really?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "cavscoutwifeyeva",
        "review_rating": "1",
        "review_title": "Trainwreck",
        "review_detailed_main": "This movie has so many plot holes and makes absolutely zero sense whatsoever."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "zulkiflispgg",
        "review_rating": "2",
        "review_title": "The title of the movie deceived us",
        "review_detailed_main": "Firstly, when I saw the title on Netflix I was like Wow! Soon after screening for about 10 minutes, I stopped the movie. It's hurtful to continue watching. Too bad that the main lead actor could have gotten a better role or screenplay. If anyone can outdo my screening less then 10 minutes, you have more faith than myself. I'm watching 'The Town' for the 4th times!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "paddythompson-16935",
        "review_rating": "1",
        "review_title": "This isn't bad, it's the golden egg of bad.",
        "review_detailed_main": "Oh my. That's 2hrs and 20 minutes I won't get back. Netflix should be offering refunds for this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "andwaide",
        "review_rating": "8",
        "review_title": "Heist movie, what's not to like!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Pairic",
        "review_rating": "5",
        "review_title": "Confused SF/Noir",
        "review_detailed_main": "The Last Days of American Crime: A near future dystopian U.S., the government plans to broadcast a signal which will make crime impossible, attempted transgressions will result in a debilitating headache. (Don't ask it's not really explained.) Crime is rampant in the period leading up to the signal broadcast. bank robber Bricke (Edgar Ramirez) has messed up his chance to escape to Canada and his mob bosses have a hit out on him. He is approached by Kevin Cash (Michael Pitt) and Shelby Dupree (Anna Brewster), a consummate femme fatale, with a plan to pull off one last heist. A menage a trois develops as the film stumbles across sub-plots, unlikelihoods and non-sequiturs. Some really good fight scenes, shoot-outs and car-chases in the film but quite often they do not advance the narrative. Also gory and violent, some very disturbing scenes. There's a good film struggling to emerge from this morass but it would require a significant cut in the 149 minute running time. Directed by Olivier Megaton from a screenplay by Karl Gajdusek. 5/10. On Netflix"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "nezbitkn2",
        "review_rating": "5",
        "review_title": "Not great",
        "review_detailed_main": "I don't quite agree with the extreme poor reviews but I do admit the film could be better and maybe more timely. It's a long film for what it actually is but still it you get to know the characters and as the film unfolds you feel a connection to some. Not bad, not great."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "nicola-yang",
        "review_rating": "2",
        "review_title": "Hopeless",
        "review_detailed_main": "After the day I finished watching this movie, it's the last day of my crime. I feel my whole life restart again and never look back into the day I meet this movie. Yes, thank you for teaching me the lesson."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "oldretro",
        "review_rating": "1",
        "review_title": "This movie insult intelligence.",
        "review_detailed_main": "Everything in this move is so hard to watch my brain screaming to stop. Bad acting, followed by a really bad line story. Avoid it wherever you see it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "matt_hew",
        "review_rating": "1",
        "review_title": "2.5 / 25",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mberbae-57179",
        "review_rating": "2",
        "review_title": "Bad acting & fake blood",
        "review_detailed_main": "It was easy to see right from the start this was going to be a B movie. Plenty of bad acting by all and gallons of blood so fake even a 5 year old could spot it. Definitely not a feel good movie. Guys get shot at point blank in the chest but survive while others take a bullet from 100 yards and die instantly. Had to FF to get through it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "matze-23967",
        "review_rating": "1",
        "review_title": "You'll never get the time back",
        "review_detailed_main": "This is a waste of time. It tries to be everything that has been around and still fails badly in copying an old idea. It tries desperately to be a movie inspired by Lynch and Tarantino and doesn't come near."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kalimera54",
        "review_rating": "10",
        "review_title": "it is a nice flick",
        "review_detailed_main": "It gives you what a crime noir should do. i would say it was even short"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "senatejay",
        "review_rating": "5",
        "review_title": "Something to watch",
        "review_detailed_main": "When you have watched all there is to watch then you want to watch something to fall asleep to this is it. Just a B movie"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ludichrisallen",
        "review_rating": "2",
        "review_title": "Shockingly Bad",
        "review_detailed_main": "This movie isn't even \"so bad, it's good\". Sometimes a movie is such a train wreck that watching it is an entertaining endurance challenge. This is not such a movie. I feel like this movie got a green light based on the title and a one page pitch...and then the writer ran out of ideas. A story about the last possible crimes before a neurological device stops the entire country from acting on criminal impulses is a GREAT premise! How did this device get distributed? Who stands to gain from the end of crime? Why does Michael Pitt's character have such a jacked up relationship with his family? If people are going to murder their immediate family, the audience needs to know WHY. There are so many questions that go unanswered in this movie. In fact, there is not ONE plot device that makes sense. There is not ONE storyline that satisfies. There is not ONE character worth caring about.\n\nI'm offended that this movie was even made, it has the production value of a decent budget, yet it seems to have been written and directed by unimaginative middle schoolers. Middle schoolers with a VERY RICH PARENT.\n\nIf you're old enough to remember Pia Zadora's \"Butterfly,\" this movie is worse than that! Butterfly was a vanity project starring the talentless Zadora and financed by her crazy-rich, super-old husband. It featured father/daughter incest Story treated with inexplicably romantic gauze-over-the-lens soft focus. Until this, it was the worst movie I've ever seen. I'd watch that tripe again to avoid seeing this again...\n\n..So I have a couple of questions for the producers of this film. 1) Where did the money come from? 2) HOW did you get the very talented Michael Pitt to sell his soul for this dreck? Is he deep in debt? Was he blackmailed? 3) Why is it that in an industry where so many super talented women and minority writers and directors are struggling to get a break, this Megaton hack is still able to get financing? Please let this be his last picture. In addition to some of the worst directing this side of \"Showgirls,\" this director had the audacity to clock this trash in at 2.5 hours! Grotesquely self indulgent.\n\nYeah, no. Don't see this movie. Not even for fun."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Chris_Mac_25",
        "review_rating": "3",
        "review_title": "Had potential",
        "review_detailed_main": "I wanted this to be good, there aren't a lot of decent action flicks being made at the moment. But sadly the whole thing was just a mess of average acting and poorly executed action sequences. The worst is the car chase where Edgar Ramirez and the bad guys are shooting at each other from about 10m away and hitting nothing"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "chubarova",
        "review_rating": "5",
        "review_title": "Boring.",
        "review_detailed_main": "This film lasts 148 min (almost 2,5 hours). But all important things lasts 90 minutes maximum. What happenes in other time, I don't understand. Firstly, the plot irswlf is good but his realisation is not good. The struggle with mind-controlling system is not shown well. Secondly, the cast is good, but sometimes I don't believe them. So, it's pale film for one time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jakoboziefl",
        "review_rating": "1",
        "review_title": "Its a waste of time ....",
        "review_detailed_main": "Its super dry, way to long, no logic to be found.\n\nPoor me watched the whole thing, just to get a trash ending...\n\nTo everyone who actually reads the Ratings, please go ahead and report all of the 10 Stars for being bought."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hulix-459-652146",
        "review_rating": "1",
        "review_title": "Why? Just why?",
        "review_detailed_main": "HOW CAN SOMEBODY DO THIS TO US? WHAT IS THE PURPOSE OF SUCH A MOVIE? WHY WOULD SOMEBODY PRODUCE SOETHING AS BAD AS THIS?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jason-92862",
        "review_rating": "1",
        "review_title": "Reading the reviews is more interesting",
        "review_detailed_main": "I'm truly shocked that, at the time of writing, the IMDB rating was 3.6. How it's not 1 or 2 I'll never know.\n\nThis is one of the worst movies I've ever watched. The only reason I watched it to the end is because I had it playing on the second screen of my computer while working on the other.\n\nI looks like they had a reasonable budget and a reasonable concept, that was then let down by an extremely poor plot, script, and directing, and below par acting. Even post production looks like it was poorly done, with jarring cuts from one scene to the next.\n\nHalf of the scenes are basically irrelevant to the movie. They're not even used for character development. There's just no point to them.\n\nAvoid this like the plague."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "pieterluxman",
        "review_rating": "8",
        "review_title": "Underrated, good action movie, last 30 min not good",
        "review_detailed_main": "Why the bad reviews, this is an ok action movie. Acting is good. Action is very good. Not always realistic, but most action movies are unrealistic. Pacing was also good, except the movie was too long, the last 30 min was too much. Also the ending was disappointing.\n\nAnyway, I enjoyed the movie, just a little too long. At least not as bad as Mission Impossible Fallout, that movie was horrible, did not even finish it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mariusknoxville-728-300857",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Apparently all cars are now indestructible even for machine guns. Bad movie, boring movie..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mackiesander",
        "review_rating": "1",
        "review_title": "A real mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "martinfitzy",
        "review_rating": "2",
        "review_title": "Load of b@ll@x",
        "review_detailed_main": "Boring, slow\n\nAs another review said I didn't make it past an hour\n\nMaybe it got better but I doubt it\n\nAlso my 1st review as I felt strongly to warn others, don't waste your time. Buy I tin of paint and watch it dry"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dungeoned",
        "review_rating": "1",
        "review_title": "Worst and lamest movie of Netflix.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "klperkins07",
        "review_rating": "3",
        "review_title": "The biggest crime is the movie itself",
        "review_detailed_main": "Poorly acted. Decent action here and there. Bad editing and transitions. The music is weird at some points throughout the film. The film is supposed to take place in America, but almost none of the actors are American and it's very obvious that it wasn't shot in America. The lead and his brother are two different nationalities and have different accents. It's like the movie didn't even try. Horrible exposition and narration. It's like all anyone watches is the news so we can get bits of information here and there. The movie is well over two hours for Christ's sake. Not sure if the science is truly ever explained or if we're just supposed to accept that the government has the capability to stop all crime. Very little character development. I could barely hear the actors dialogue, but the action sequences were extremely loud. If you have time to kill and looking for something decently entertaining with no regards for plot, story, acting and character, then this movie is ok I guess."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dtlacey78",
        "review_rating": "1",
        "review_title": "Overly long feels even longer by the bad acting",
        "review_detailed_main": "I love a dystopian film & this had so much potential. I love the idea but The Last Days... has unfortunately been poorly executed. From the terrible acting to the clunky script & production. It could have an hour shaved off the run time with no real loss. Such a shame, was really looking forward to it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "khaled_qassem",
        "review_rating": "2",
        "review_title": "👎🏾",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jesuseduardo-83998",
        "review_rating": "10",
        "review_title": "Is not that bad. Some people is exaggerating",
        "review_detailed_main": "Honestly after reading all the reviews in here, I was a bit biased at the beginning on how bad the movie was going to be.. however after watching the whole thing I think many of the people are just over reacting and their low score was more about anger than everything else.. I guess people were hoping for something different.. it may not be a 10, but it definitely doesn't deserve a 1,2 or 3.. I don't thing it was that slow at the beginning.. I mean most of the Oscar's winning movies are really slow and loooong and people seem to enjoy it for some reason.. this one is more of an hybrid between the fast and the furious and that John wick movie.. right at the middle and end of the movie it gets faster if that's the issue.. if you think it's slow, just hang in there until the middle thing and it will get better.. some acting could be better and some plots could be better but it's definitely above average.."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bonami-22997",
        "review_rating": "1",
        "review_title": "One of those movies",
        "review_detailed_main": "This movies all action no plot. I quit after watching the first 20 minutes."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "alexhernandez-85228",
        "review_rating": "1",
        "review_title": "Oh man!!",
        "review_detailed_main": "If you want to watch possibly one of the worst movie I've ever seen. Honestly I am going to request Netflix blocks the label so I don't have to look back at the 60 minutes I wasted on it. I love the main actor in all of his other movies but dude this was bad!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "didier-orij",
        "review_rating": "2",
        "review_title": "Incredible bad",
        "review_detailed_main": "This is a 2,5 hour waste of your time. Netfix better not advertising this movie. Bad acting whole film."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jimjunior-98292",
        "review_rating": "1",
        "review_title": "Worst thing I've ever watched",
        "review_detailed_main": "I rarely hate on movies or down vote them or give a small rating but Jesus Christ what the hell was that... why would someone even release that for consumption Worst plot, poor acting and just overall pure garbage."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Th3M8sk3dCritic",
        "review_rating": "3",
        "review_title": "Last days of American mumbling",
        "review_detailed_main": "At 2 hours 30 minutes I probably spent another 15 minutes rewinding scenes as the cast mumbled lines. I'd have been better off watching it with subtitles. Not to repeat (but will) previous reviews it's far to long & although a good premise it's poorly executed. The only shining light for me was Michael Pitts unhinged character."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mwilson1976",
        "review_rating": "5",
        "review_title": "An ambitious movie that wastes its potential by turning into an action flick with little intelligence behind it.",
        "review_detailed_main": "Based on Rick Remender and Greg Tocchini's 2009 graphic novel of the same name, The Last Days of American Crime clocks in at a bottom numbing 148 minutes and will test your patience despite all the gory excesses that director Olivier Megaton and screenwriter Karl Gajdusek throw at the screen. The story focuses on career criminal Graham Bricke (Édgar Ramírez) as he struggles to get back in the game since the death of his brother Rory (Daniel Fox) in a robbery. Seeking revenge against those responsible for his brother's loss he teams up with fellow criminals Kevin Cash (Michael Pitt) and Shelby Dupree (Anna Brewster) to plan a huge heist, racing against the clock before a mysterious government-made signal threatens to put a stop to all crime for good. The movie was panned by critics who took exception to its violent content and depictions of police brutality in light of the George Floyd protests (during one brutal fight scene a police officer is shown choking someone). Sure, it has it's flaws, but it isn't as bad as the reviews make it out to be, despite the fact it tries too hard to be something it's not, and leaves viewers wondering about the central message. Rather than attempt to deliver on its intriguing premise (an America without crime, but different to other movies like The Purge), The Last Days of American Crime wastes its potential by turning into an action flick with little intelligence behind it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rumaynes",
        "review_rating": "2",
        "review_title": "2.5 hours of your life you will never get back",
        "review_detailed_main": "I'm an avid movie watcher and have sat through countless hours of boring movies, the two best things about this film was the trailer and the fact that it eventually finishes (after 2.5 long hours) it's so slow, mundane and drags out a interesting plot/storyline so much it makes a mockery of modern day film making.......poor watch"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "valortiz-79123",
        "review_rating": "10",
        "review_title": "This was hilarious.",
        "review_detailed_main": "This movie is exactly the type of movie my friends and I would sit around and make up as the most cliche driven, well acted, reminiscent of the 90's action hero movies we'd like to have come back to the screen. It's the movie playing in the movie \"The Last Action Hero\" that starred Arnold Schwarzenegger.\n\nSo lame you Internet people wouldn't get this style of movie. It has such a low rating bc people think they are Siskal and Ebert. I just read Ebert's review and you are all writing exactly the same review. No, that doesn't mean you are \"right\". It means you have no opinion whatsoever. Same old stuff I hear from critics about all movies. Well, I grew up enjoying watching movies. It used to be fun to watch over exaggerated representations of people. Movies are junk, it's entertainment. Why did everyone start watching movies as a way to understand life? Movies do not represent REAL LIFE. Movies are fake. They are supposed to not make sense. It's for fun. The rules of physics don't exist. Also... you know why you can't enjoy this movie.... B/c you take everything so LITERAL! The movie is being IRONIC. Learn how to spot these two words I just capitalized. .....I have to type paragraphs out as if I were addressing babies bc you all keep dwelling on dumb \"quickly punched in words\" that nobody thinks twice about, that people leave as their comments (half assed thought out comments). You have a problem if you are sitting here, voluntarily, reading words that \"hurt\" you. Anyways, back to literal and ironic, I know these are two very common words you Internet people always use incorrectly. Learn their meaning and you'll finally \"really\" wake up you dungeon gopher in grand makeup disguises, brainwashed backwards minority, as in a SMALL percentage, words have more than one meaning based on how the person uses them in a sentence. So if you never listen, you will never get a clue. And hence, you believe fake news😛😘🙂💗\n\nJust watch it and laugh.\n\nIt's like Face Off sorta. Like Those big 90's Nick Cage Action movies we all used to love."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "officerbigd691",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "It's a really long turd of a picture. Please do yourself a favor & do not waste 2.5hrs of your life on this. There are no spoilers as you won't care what happens, you just want it to be over. I'd liken it to the most boring person in existence telling you about a hobby..for 2.5 hrs. You don't really care, you don't want to be rude but your like look your nice but I gotta go!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "borbatr-1",
        "review_rating": "1",
        "review_title": "like, what?",
        "review_detailed_main": "Somewhat good actors, with a somewhat good idea, with an awful script, it's so bad it doesn't make sense. worst movie of the year for sure, hard to find a bad movie as long as this, i wonder how they had 2 and a half hours to cancel this thing, but even so they went with it, gloriously producing 150 minutes of pure garbage."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "lordMaroza",
        "review_rating": "2",
        "review_title": "Good thing this wasn't in the cinema...",
        "review_detailed_main": "I'm not sure what is worse... The storyline, the misleading title, or the acting... And all that in a 2h 30m package. Netflix should start applying strict rules on what they're buying. This is just awful."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "adim-72644",
        "review_rating": "5",
        "review_title": "Oh yeah",
        "review_detailed_main": "Great soundtrack but nothing more. I think it worth it more than 3 stars."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "michalradowski",
        "review_rating": "1",
        "review_title": "Horrible waist of time....",
        "review_detailed_main": "It is simple. If you love to waist more than 2 h of your life to watch a D class movie, you can watch this one... but remember - you have been warned !!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mprice78",
        "review_rating": "2",
        "review_title": "Might be worst Netflix original ever",
        "review_detailed_main": "I'm not even sure where to start with this mess of a movie. It was way too long, fairly predictable, was filled with bad acting and cliche dialogue. It was obvious the director and writers were trying really hard to make a slick, stylized movie, but it all came off really flat. None of the characters were at all likable, and very little real insight was given into them or their backgrounds, so they just came off very flat. Very little of the movie was actually about the proposed crime/heist, which would have been fine if the rest of the movie was interesting. One thing which really bothered me is some of the bad accents. Actors seem to slip in and out of various European accents throughout the movie without any in-movie explanation as to why this would be happening. I can only assume it's the result of actors from other countries doing their best american accents part of the time, and giving up at other times."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "fmatt-88980",
        "review_rating": "2",
        "review_title": "This Should be the Last Days of American Shame!",
        "review_detailed_main": "Some movies should not have been made by some directors and producers. This is one of them. Veering off completely from a good premise, this jumble of violence and disgusting characters is example #1 of how money and talent is wasted. I'm glad it was in my Netflix, because not a dime more of money or time should ever be spent on a film with no redeeming characters, storyline and an ending that took too long to happen with two characters who might as well remain nameless."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "serpabernardo",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Loved this movie, it is well acted, and is action packed."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ngyenice-1",
        "review_rating": "2",
        "review_title": "Why did they spend money on this?",
        "review_detailed_main": "They spend money and great deal of labor for this title which you cannot stand to watch more than 15 min. It is one of those movies that looks has promising story line; yet bad acting, boring lines, cliche shooting and just great waste of time, labor and money. I do not know were to put flicks in any genre not even b-movies as You might enjoy to watch."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "lee-00705",
        "review_rating": "3",
        "review_title": "This is criminal.",
        "review_detailed_main": "Tony Scott would've crushed this type of movie, hell Michael Bay could do this with one eye open. This movie feels,looks and sounds like it was made 20years ago. A film with a great premise shouldn't be this boring, can't sleep? Bang this on and you'll be catching Zzz in no time. The leads have no charisma and lack chemistry together. Don't know how much Netflix paid for this but they should ask for their cash back.\n\nRead the graphic novel instead."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "arileibovici",
        "review_rating": "3",
        "review_title": "Good Action but bad Actors / much to long",
        "review_detailed_main": "180 Minutes for what? Watch it and decide for your self if you like it. Cool Action Parts... but to stupid at all"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Xavier_Stone",
        "review_rating": "2",
        "review_title": "Just all around bad",
        "review_detailed_main": "There is a brain signal, API which will supposedly stop crime and some bank robbers are determined to still rob banks. A decent budget but poor acting makes it look like a high school project. The whole thing is just forced and makes little sense, lots of scenes are just there for no reason, and give no backstory or add to the plot or the characters motivations. Maybe Netflix should create a X2 play speed if they are going to continue to purchase these types of films. I lasted 44 mins before I had to start scrolling, watched a few more scenes and the ending. Not much of an effort. The low budget created lot of problems, from the police stations with 6 cops in them to the border crossing with 4 officers and highways without cars. After finishing this movie made me appreciated how tough it is to make a good movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "fersiaf",
        "review_rating": "1",
        "review_title": "Thought it was just me",
        "review_detailed_main": "About an hour of this movie I think the movie isnt making any sense. I thought maybe it is just me who failed to follow the storyline. Decided to continue watching still nothing making anything out if the movie so I skipped every ten seconds. Towards the end I was right. The movie doesnt have any clear plot. Is the movie about revenge, ami, people pro and against the ami i dont know. Bad movie I guess."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bluemohammad",
        "review_rating": "1",
        "review_title": "Wasting time",
        "review_detailed_main": "I have wasted two and half hours of my life watching this bad movie. So please don't do the same."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "raymondjpwhitford",
        "review_rating": "1",
        "review_title": "Can't say it's all bad..",
        "review_detailed_main": "Can't say it's all bad as I couldn't stay awake watching it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tonywongb",
        "review_rating": "10",
        "review_title": "Just try it out , maybe u like it",
        "review_detailed_main": "Its around 7//10 . just to balance the rate. ITs not that bad as 1/10 . ya the photography of it is really good . and story is ok . actually acting is fine . ya ending maybe not tat good .but pretty fine for me :D just Try it out , maybe u like it maybe not . I do like this mov"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mohdnader-81624",
        "review_rating": "1",
        "review_title": "The wasted thier time",
        "review_detailed_main": "8:30 min to list the workers whom working hard to populate this piece of sh! #@&-...\n\nI wondered how a director whom directed taken movies could directed this very bad film?\n\nDont wast to your time.."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hotbuns85",
        "review_rating": "1",
        "review_title": "Worst I've seen in a long time",
        "review_detailed_main": "I watched the whole movie simply because it showed great potential and I was hopeful it would get good eventually... but from the opening scene where the lines were so poorly delivered I couldn't understand a word they were saying I knew it wasn't the case.\n\nBy the end of the movie I still had no idea what happened, who the characters were, and frankly I really didn't care!\n\nI think ultimately I just watched to the end so I can definitively say it's one of the worst films I've ever seen"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "simelemontolomeo-56461",
        "review_rating": "4",
        "review_title": "Really Netflix?",
        "review_detailed_main": "The worst Netflix movie I ever watched. I can't believe Netflix cancel others shows to make this kind of movie. 250 minutes man!!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "nahas-marwan",
        "review_rating": "5",
        "review_title": "Average at best",
        "review_detailed_main": "It's not a good movie. Struggle just to finish it. The story is not well developed and the trailer is 10 times better than the actual movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Guanche48",
        "review_rating": "1",
        "review_title": "Just don't watch this movie...agree with all the bad reviews and rating.",
        "review_detailed_main": "I watch for 25 minutes!! Congratsss if you watch it for longer !!\n\nMaking this movie was just a waste of time and money ."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "heinigrunbaum-786-20424",
        "review_rating": "2",
        "review_title": "Kind of stupid movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "s3276169",
        "review_rating": "3",
        "review_title": "Whats the real crime?",
        "review_detailed_main": "Hollywood need to rethink its obsession with sleazy crime drama's. Case in question, \"The Last Days of American Crime\".\n\nWe would wish this title were, in fact, a truism. That reanimating \"Natural Born Killers\" from 1994 in one shape or other would come to an end. That sleazy, cheesy, overcooked crime drama's that, are, in fact, ugly and depressing, could be locked away and the proverbial key, never found.\n\nIts a shame this reeks as badly as it does of a tired, desperate, loss of inspiration, that characterises many contemporary US screenplays. The cast is excellent, with the likes of Sharlto Copley (who I feel we don't see enough of) and Michael Pitt, on offer.\n\nFailing to take advantage of such a wealth of acting talent is, in my view, the real crime here. Whilst the performance's are mostly excellent no amount of quality acting can fix a tale this unlikable and uninteresting.\n\n3/10."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "smmyj-07778",
        "review_rating": "10",
        "review_title": "Good wholesome entertainment",
        "review_detailed_main": "If you are looking for a political statement move along this picture has none, what a welcoming change!\n\nBoy meets girl. Boy blows some stuff up. Girl hacks big brother. They heist a truck load of cash.\n\nWhat's not to like?\n\n4 points extra to counter biased reviews."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "lopezpatricia-06139",
        "review_rating": "1",
        "review_title": "WE NEED TO TALK ABOUT KEVIN and all the other loathsome characters in this awful film",
        "review_detailed_main": "Kevin was the worst of a long line of crappy characters. The film was an hour too long. The story deviates so many unnecessary times from an implausible main story so that it's hard to keep track. The main story was stupid and full of holes. We were insulted that we lost 2h30min to this rubbish. Avoid as you would the covid virus."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "FreakingMovieFanatic",
        "review_rating": "3",
        "review_title": "But why??",
        "review_detailed_main": "Trailer looked cool. Who was in it seemed alright and the premise seemed winning.\n\nWell I'm here to save you 2hrs and 17min of your life. Do NOT waste your time on this atrocity. It's unfortunate because the API premise as fore mentioned was an intriguing concept, but instead we get a muddled story that has horrific edits from one scene to the next, acting is near over the top, and ridiculous amounts of violence. Michael Bay would have made this better. For real! The lead actor was boring to watch, and impossible to understand half the time. Michael Pitt brother of Brad was fun, was fun but ultimately annoying.\n\nPlease SKIP this movie!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vittorio-13",
        "review_rating": "4",
        "review_title": "This movie need better editing or better directing",
        "review_detailed_main": "Here is the problem I fell asleep so I put myself through it again in order to watch it. The movie could have been easily 45 minute or less the story drags on and yet there is no explanation. Why is USA in the hole there are in? The acting is ok but the direction and editing should have been better. It should have been a good movie. Good idea just poorly executed."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "DoctorDee",
        "review_rating": "2",
        "review_title": "Unbelievably bad",
        "review_detailed_main": "Unlikable characters in unlikely situations following unrealistic plot while unconvincingly spouting uninspiring dialogue.\n\nNo one expects an action movie to be high art, and I'm happy to forgive a multitude of sins for the thrill of 'splosions... but even by the limited standards of the genre this is lamentable."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jgviloria152",
        "review_rating": "1",
        "review_title": "given away is expensive",
        "review_detailed_main": "I didn't have the courage to see for more than 5 minutes"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tearitdownner",
        "review_rating": "1",
        "review_title": "Terrible acting..and tranniefest..yum",
        "review_detailed_main": "Crap waste of time...watch anything else!! Even paint drying"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "magicalrere",
        "review_rating": "2",
        "review_title": "I literally went through the trouble...",
        "review_detailed_main": "I literally went through the trouble of creating an IMBD account just to tell you how bad this movie was. I had to pause it at one point because i thought i was accidentally watching the Disaster artist. If you are looking for a cringe worthy Action you are going to have a great time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "zbyank-56930",
        "review_rating": "10",
        "review_title": "Beautiful acting! Great action movie!",
        "review_detailed_main": "Dude I really dont understand the hate towards this movie and the bad reviews. It's a good American action movie and the actors are professional. I loved it!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dr-jhouse",
        "review_rating": "1",
        "review_title": "The Last Days of Good Movies being made.",
        "review_detailed_main": "44:40 in that's all I could watch before my eyes rolled up in my head from pure boredom. I would like to know who coughs up the money for these productions? If you are giving free money away, may I please have some? I'll guarantee you some good content at the very least."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "SpacemanBob",
        "review_rating": "1",
        "review_title": "Oh Hell no",
        "review_detailed_main": "The best thing about this movie is the title. Now that I've watched it, that's even ruined."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "alejandrogiolito",
        "review_rating": "2",
        "review_title": "Bad Movie...",
        "review_detailed_main": "150 minutes of a bad script, bad acting and bad directing... I feel sorry for Edgar because he is such a talented guy! what a shame!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "samuelkoller",
        "review_rating": "1",
        "review_title": "Waste your time movie!",
        "review_detailed_main": "Sorry guys, it was really bad.. Not worth to watch"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "archidtxallycat",
        "review_rating": "1",
        "review_title": "Wow. A New Low for Netflix",
        "review_detailed_main": "What is this movie about? Who's in it? Why did they make it? Has Netflix just given up? These are all questions you'll ask yourself 10 minutes into this film, and the last scene will bring you no closer to answering any of them."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jivanov-1",
        "review_rating": "2",
        "review_title": "Disappointing",
        "review_detailed_main": "Nicely filmed but oddly weak everywhere it had the potential to shine. Got a week to pull this heist off? Let's not see each other for days at a time. And we should not really plan, just halfass it together in the last two days knowing that we'll just happen to have exactly what we need for equipment...\n\nMoney went into the filming and the FX, which is good, but it would have been better to have some thought going into it instead."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "draciron",
        "review_rating": "5",
        "review_title": "Lead actor destroyed a kind of escape from NY romp.",
        "review_detailed_main": "The premise is that a mind control signal is about to wipe out the ability to commit crime. All the normal action movie stereotypes except it didn't have an over the top villain. The rest of the plot is so weak as to not be worth mentioning. The action ALMOST gets there. It's not over the top and cartoonish, but never really quite gets there, but it's enough to be interesting.\n\nRamirez was SO bad it just crushed the movie. The script was pretty so so. Just a revamp of typical action movie with a nostalgic Escape from NY flavor. Most of the supporting actors/actresses were pretty good. Brewster in particular. She almost made a really horribly written role shine. If you believed anything in the movie it was her. The premise is kind of goofy, the plot is also, but not so over the top as to be inane like so many action movies are today. Ramirez was just so wooden with his lines. It was like they cast a voice mail prompt for the lead role. Overdub his lines and this would have been a fun waste of an hour or so. A chance to revisit the 80s crime dystopia movies. They really need to overdub Ramirez's lines and re-release this movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "koffice-979-41630",
        "review_rating": "10",
        "review_title": "Dark, nihilistic, and violent, best worst rated movie I've seen in a while? lmao",
        "review_detailed_main": "Dark, nihilistic, and violent, best worst rated movie I've seen in a while? lmao"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "colinfew",
        "review_rating": "3",
        "review_title": "Stupid start",
        "review_detailed_main": "So I got like 5 minutes into it and had to shut it off to check reviews. Dude gives this speech about going out of his way to find diesel fuel and drenches a dude in a tub with the gas. Then sticks a lit cigar in his mouth which causes a huge explosion. Pretty sure every single movie watcher ever is aware that a lit cigar will not ignite a pool of gas. It most certainly wouldn't spark up diesel. Right away I knew what this movie was going to be so I'm glad all the reviews told me to avoid."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "branny-417-190923",
        "review_rating": "1",
        "review_title": "What the trailer and leave it at that.",
        "review_detailed_main": "Watch the trailer for this. Think 'hey I might watch that' but then never get round to it. You'll never feel disappointed in your choice of movie"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "isroyes",
        "review_rating": "1",
        "review_title": "Canada, the land of the free?",
        "review_detailed_main": "This movie started losing me in the first five minutes when it offered the idea that those in America were hoping to escape Canada, of all places, so they could maintain their freedom. Still it was early and I still had misguided hope that it would get better. It did not. The movie is simply 2.5 hours of badly edited, poorly directed and mediocre acting that never really gets you where it wants to go. You almost want it to get better because its not a bad premise and it feels like just a little more effort could have made it a good movie, but it just never gets there. If you have about 2.5 hours that you would like to waste, feeling far worse at the end than when you started, this movie will do it for you."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "monifaroberts",
        "review_rating": "3",
        "review_title": "This is so bad... it's bad. Kinda inadvertently funny tho",
        "review_detailed_main": "I hated this movie, a lot. It's really bad. Like so bad. But it's so bad that continuing to watch it is kinda funny to see what C movir grioe they borrow from next. If there's D movir bingo, this movie will go dull card. So many things don't make sense and the acting is sooo bad. Like the worst actor in the movie is the best. We're on a pandemic and the democracy of the united states is crumbling because they can't honour their constitution, so if you're trying to zone out in order to get some sleep and avoid the travesty that is the state of the U.S. right now- you could use this movie for that. But I think this would be really good with Z movir bingo cards over zoom with some edibles and friends."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tylerk-92008",
        "review_rating": "1",
        "review_title": "Really Bad and not worth the watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "darabisam",
        "review_rating": "3",
        "review_title": "Started strong, finished stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sophie-13070-17771",
        "review_rating": "10",
        "review_title": "Loved it!",
        "review_detailed_main": "Waited for a long time for this film and it doesn't disappoint! Super strong performances and wicked action. Loved it! Highly recommend"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "stefanfalkefoto",
        "review_rating": "2",
        "review_title": "What a pity...",
        "review_detailed_main": "Starts pretty good, but gets worse with every next scene while the idea wasn't so bad"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "matthew-41243",
        "review_rating": "1",
        "review_title": "Deserves a Zero, one is too generous.",
        "review_detailed_main": "Awful film, everything about it is awful. Netflix please give us quality over quantity. You really have released some stinkers lately. No need for it you are just making people hate you."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "scottyding",
        "review_rating": "1",
        "review_title": "If I could give this 0, I would.",
        "review_detailed_main": "Everyone else says exactly what I would.\n\nPlot, acting, connectivity, reasoning all = 0 stars.\n\nSometimes I really dislike the fact that I insist on \"finishing things to completion\". This was one of them."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Mysterygeneration",
        "review_rating": "3",
        "review_title": "A Tedious and Disjointed Misfire",
        "review_detailed_main": "\"The Last Days of American Crime\" is only a plodding, poorly executed heist thriller that manages to squander what had been a truly intriguing premise. Directed by Olivier Megaton, it has huge problems because of its bloated runtime and sluggish pacing, dragging on an otherwise tight action-relayed narrative into a mess. The character development one dimensionally runs in a lack of depth. Then, the performances seemed uninspired and wooden from the performers. Social commentary in the movie is quite heavy-handed and scattered, while the violence and other explicit content seem absolutely gratuitous. All in all, \"The Last Days of American Crime\" is frustrating and forgettable since it does not engage or amuse its viewer at all; it disappoints and impresses very little."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "gianmarcoronconi",
        "review_rating": "4",
        "review_title": "No",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "michaelquinn1966",
        "review_rating": "1",
        "review_title": "So bad but not in a \"so bad its good way\"",
        "review_detailed_main": "I don't normally write reviews but after sitting through, 2.5 hrs (though must confess a fair bit on fast forward) of the most dire film making I have seen, I think I will make an exception...... I have never viewed such a poorly written, poorly acted, confusing and pointless film. There is not a single redeeming quality I can mention, that would make it even worth a cursory watch. Avoid at all costs unless you want to just suffer for 2.5 hrs"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "TdSmth5",
        "review_rating": "3",
        "review_title": "Megaton! strikes again",
        "review_detailed_main": "Were a couple of days away from the US launching API- the American Peace Initiative, where everyone will get a chip in the brain to subdue there violent and criminal impulses. When it takes effect, police will cease its operations and instead some guy in DC will monitor things. There are protests everywhere and people are fleeing or trying to flee to Canada.\n\nSome guy named Bricke takes his time to set some other guy on fire. There's some talk about Bricke's brother who was in jail and died there. Then he hooks up with a pretty girl in bar. Turns out pretty girl is Cash's girl. It's Cash who now approached Bricke with a proposal after telling him the the truth about how his brother died in jail. The idea is to rob billions from the local Federal Reserve just as API launches. Of course they will have to hack into it to give them a couple of minutes to escape. So we spend some days with these goofs as they live their ugly and violent lives. Cash is the estranged son of a mob family. They need some explosives from dad. So they visit him and some pointless violence ensues to get their hands on the explosives.\n\nBricke brings in some sidekick of his as health insurance. Pretty girl has a deal with the FBI because she has a sister and the FBI is taking her to Canada before API. Bricke has some more violent run-ins with the guy he set on fire in the intro and with the mob captains.\n\nAt last, half an hour before the movie is over, the heist begins. Things go nearly as planned but with plenty of bloody violence in between. Of course there is unnecessary and unlikely romance between pretty girl and Bricke.\n\nSo unfortunately, this movie is as bad as the rating here suggests. The concept is good, there are some ideas and good lines here and there, but it just doesn't work. The movie is too long, too ugly, too unnecessarily violent--and I'm not one to shy away from violent movies, but this is the definition of gratuitous violence. They try to give us some pointless background about a cop who will later confront pretty girl. Among all these nasty characters, who do you root for? No one. Pretty girl is a secondary character but you do end up rooting for her for a lack of a good lead character. Bricke doesn't say much of anything throughout the movie so who cares about him. Cash is more likeable but the over the top acting doesn't help. This movie then stumbles and drags aimlessly along for two hours instead of giving us some cool heist planning. The heist itself is of course alright, not even Megaton! Can botch a heist entirely. But there's no way around that Megaton! Can't direct his way out of a paperbag, at least not without Brisson holding his hand. Here they gave him the budget, the cast, the ideas and he still can't deliver. I assume the script isn't too bad because Gajdusek is fairly competent. The editor, a Megaton! Associate, on the other hand isn't. Had they trimmed this thing by an hour and toned down the silliness and the ugliness they could have had a good sci-fi action flick. Three stars for Anna Brewster, the lovely nudity, and some smart ideas."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "yankeedoo",
        "review_rating": "9",
        "review_title": "Ignore the idiots",
        "review_detailed_main": "Superb movie now I watch 8 movies a day and this even thou little too long was grt action the lot just refer diff ending myself"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "safakkahraman",
        "review_rating": "1",
        "review_title": "The Inventor of camera, regrets his invention",
        "review_detailed_main": "It feels like, the whole movie is here to fill the whole Netflix library."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "LordLobby",
        "review_rating": "1",
        "review_title": "Best part is Personal Jesus from DM",
        "review_detailed_main": "But you have to jump directly to the end credits to avoid watching the movie. Awful senseless story... waist of time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "lucian-leibovici",
        "review_rating": "1",
        "review_title": "Booring",
        "review_detailed_main": "Incredibly bad movie. Nothing make sense in this movie"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "m-prezioso",
        "review_rating": "4",
        "review_title": "Horrendous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "linamorenog",
        "review_rating": "5",
        "review_title": "Another poorly written Netflix production with good actors and a bad director.",
        "review_detailed_main": "I appreciate the plot of this movie was still somewhat unpredictable, and for that, I give it 5 stars, even if the structure or premise of most scenes was incongruous. This rating also reflects my sympathy for actors: Michael Pitt, Anna Brewster, and Edgar Ramirez, who's work I respect, not only here, but on other productions of far better quality than this one.\n\nThis movie has the same problem all Netflix action movies have: Good actors, on productions with bad storylines. Netflix has cornered the market of action movies, that have half baked scripts, and mediocre directors. They should seriously consider the immediate cessation of the production of films in this genre."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "wczktcfmz",
        "review_rating": "1",
        "review_title": "More Netflix crap",
        "review_detailed_main": "The very best thing about this movie is Anne Brewster's legs. Beyond that it's garbage. The incessant need for Netflix to try to inject garbage ideology into everything they do is just ridiculous. Terrible script, worse writing, bad acting, woefully inadequate directing and editing, utterly ridiculous mis casting. Apart from all that it's terrific. Well, no it's not. Not in any way. Seriously, the best thing in this film is Snne Brewster's legs. Not her appearance, face, body or acting. But her legs are fantastic and worthy of their own Oscar. Sadly her face and acting let them down. Don't bother with this movie at all. It's complete crap."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "EODGhost",
        "review_rating": "2",
        "review_title": "Worse than the Point Break remake",
        "review_detailed_main": "Wow, I thought Edgar Ramirez was terrible in the Point Break remake, he was even worse in this movie. Two movies equating to hot garbage, means it is time to find a new career, maybe selling solar panels.\n\nThis movie was unwatchable beyond 20 min. I figured it was either give up or suicide and I'm not ready to give up yet. I still have to trash Will Smith's new race baiting movie Emancipation. Another equally sh$t movie. Will and Edgar both need a good slapping after these two terrible movies. Two stars is being really generous. You get one extra star for the girl with the great fake boobies dancing on the car and for carrying a Chiappa Rino revolver."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rmarli17",
        "review_rating": "10",
        "review_title": "READ THE GRAPHIC NOVEL PEOPLE!",
        "review_detailed_main": "So many ignorant people simply don't know it's based on a comic book. Very well adapted and kept my interest every second."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tin-B",
        "review_rating": "3",
        "review_title": "Yawn",
        "review_detailed_main": "Lazy night, clicked to watch on Netflix, figured after a few minutes it wouldn't be great but at least a bit of action.. When I thought it should be over, I skipped forward 10 seconds a few times and realized WHAT? There's still 50 minutes left. Not enough story for 2 1/2 hours. It's not a problem with writing. Nor characters (other than they are all bad people). Nor the directing or effects. It's a problem with Editing. The editor forgot to edit. There is nothing on the editing room floor. And a lot belongs there."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "imap-05232",
        "review_rating": "1",
        "review_title": "Have a drink with friends instead",
        "review_detailed_main": "The most tedious, boring, incomprehensible, with one word: idiotic crap imaginable.\n\nNo plot, no individuals one can connect with, extreme violence.\n\nWho produce such movies, and who watch it? I made it to minute 30 and gave up.\n\nAvoid at all costs!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "comblitz",
        "review_rating": "5",
        "review_title": "I got mad at this movie",
        "review_detailed_main": "I was mad because it was waaaay too long. It was an ok story, but that's it. Seems like it could've been handled in a quick episode of black mirror, or at the very most, a 1hr 20minute movie. Michael Penn's acting was amazing as always but it was just too crazy of a movie to warrant the same amount of time as Godfather or Star Wars.\n\nNow, mad aside, the movie production was ok. It had a solid plot, production wasn't cheap and a story you could get behind. A rating of 3.7 (average at the time of this writing) is a little harsh. I can't help to believe if Bruce Willis or some other A list played the lead, it might be averaging 5 or 6. Still, I don't feel like I enjoyed this and would've liked to have my 2.5 hours back."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "madgeeza",
        "review_rating": "2",
        "review_title": "Too Long",
        "review_detailed_main": "Way too long, confusing plot and bad acting. 30mins I'll never get back."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "joaomarcelokuhn",
        "review_rating": "1",
        "review_title": "DON'T WATCH IT",
        "review_detailed_main": "Completely ridiculous!!!! Absolutely bad!!! In one hour I gave it up!!! Good for sleep only!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "spencerlim-17385",
        "review_rating": "2",
        "review_title": "Lousy movie in 2020",
        "review_detailed_main": "What's the purpose to waste time and money to make a terrible movie like this ?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hitzujaa",
        "review_rating": "2",
        "review_title": "Ouiiii!!! What was I watching? 😅",
        "review_detailed_main": "2 hours and about a half of visual torturing. Storytelling is very unclear and super boring. Why the police station is too dark. Did they forget to pay electric bill? And the sex scenes background music are too loud."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hunterfarrell-23814",
        "review_rating": "9",
        "review_title": "What are y'all tripping about? This movie was awesome",
        "review_detailed_main": "I personally loved the film. The main actors are great, know how to play their character well. I made this account right now just to leave this review. Find it hilarious that so many people bag on movies that are good. What else did you expect? This movie rocks, stop tripping people give honest feedback haha."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sandy-klf",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I can't believe it, we are in 2020 and they are still doing movies like that!! This movie doesn't have any meaning I wasted my time watching it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "umrebel",
        "review_rating": "4",
        "review_title": "A Sleeper movie... No, seriously. It put me to sleep many times.",
        "review_detailed_main": "For something with so much fighting, cursing, shouting, and copious amounts of mature level bloodshed, it was staggeringly boring. The underlying heist concept was a good once, but it just never could make the jump from good idea to good movie. Although I did make it to the end, I watched this in about 5 different sessions because it just couldn't keep me in the seat for longer than that. More than one of those sessions ended because I fell asleep. Do with that info what you will."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "abdrew4304",
        "review_rating": "1",
        "review_title": "Confusing and bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mjs2510",
        "review_rating": "1",
        "review_title": "Too bad for anything more than this oneliner review. Ouch.",
        "review_detailed_main": "Too bad for anything more than this oneliner review. Ouch."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Tollakz",
        "review_rating": "2",
        "review_title": "Just kinda meh",
        "review_detailed_main": "It isn't terrible, but not great. I realised halfway through the movie, it wasn't gonna get better, and turned it off. This wasn't my kinda movie afterall."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "damianencarnacion",
        "review_rating": "1",
        "review_title": "A SCAM!!!",
        "review_detailed_main": "Story and trailer has no relation to what the movie is about. The movie makes no sense at all. In the trailer the movie tells you about a signal that stop everybody for commit a crime. And then NOTHING!!! JUST A WASTE OF TIME!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "thamill-75589",
        "review_rating": "1",
        "review_title": "Acting can't get much worse.",
        "review_detailed_main": "Not an actor myself, but Jesus Christ this is terrible. Action sequences were subpar, storyline below average, but the acting takes the cake. All the actors tend to try too hard and end up falling flat on their faces. Not a single likable character."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "karina-k-kiss",
        "review_rating": "10",
        "review_title": "BEST FILM OF THE YEAR!!",
        "review_detailed_main": "I LOVED EVERY minute of it!!! The actors were absolutely great, I loved their chemistry as they tried to hide it/deny! The story was mind blowing with all its unforeseen twists and turns! I don't get it why this film has so many bad reviews! IT'S ABSOLUTELY GREAT!!!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dacano15",
        "review_rating": "1",
        "review_title": "I dare you to watch it",
        "review_detailed_main": "This is one of the worst movies I've ever watched. I have no idea what it's about and who the characters are. It's offensively awful."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sabinaj-25432",
        "review_rating": "3",
        "review_title": "Disappointed",
        "review_detailed_main": "A huge lot of mish mash. Don't waste your time. Too much going on. Mixture of Quentin Tarantino vibe with hardly a good focus on the actual robbery planning. A big disappointment."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "dchontzopoulos",
        "review_rating": "1",
        "review_title": "Total waste of time",
        "review_detailed_main": "I wonder how can one describe what worse than worst is... Not sure... However, if you want to visualize it, you need to watch this movie..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "fischergordon",
        "review_rating": "1",
        "review_title": "If your thinking of watching, DON'T!",
        "review_detailed_main": "It's awful, it's just an action movie with bad action scenes. Tell me why's it 2 hours? This movie is awful but at least it's long! If it was 1 hour it would be soo much better. There is no twists the action is un realistic and looks awful. The plot is even worse. Just don't watch it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jony-abuali",
        "review_rating": "1",
        "review_title": "Dont waste your time",
        "review_detailed_main": "The worst on netflix. Bad acting. Bad storyline. Stupid. Boring. Slow."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "pablo-colangelo",
        "review_rating": "4",
        "review_title": "Do not watch please",
        "review_detailed_main": "Please, go not watch. I repeat, do not waste your limited time on this planet."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bru-50491",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "I thought just from the tittle this was going to be great, I should've read the reviews before I watched it. Do not waste your time!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "yanbibiyan",
        "review_rating": "8",
        "review_title": "Worth it in the end",
        "review_detailed_main": "Granted its a little long and even I could see plenty of edit possibilities not to mention greater focus at certain points, but it still is a good film.\n\nThe ambition of the film means its not quite great and yet it is still very memorable.\n\nI watched it over 2 nights and thoroughly enjoyed it.\n\nGood concept but a difficult blend.\n\nIt's not blade runner but it is road runner -and when did anyone actually hate that."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "donpauliano",
        "review_rating": "4",
        "review_title": "Pretty Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "steve-morris1122",
        "review_rating": "2",
        "review_title": "Potential. BOTCHED.",
        "review_detailed_main": "The plot was actually kind of cool. The acting? Horrible. The action scenes? Like the didn't even hire a consultant. The love story? Cringe.\n\nMissed the mark on this, unfortunately. \"Trending\" on Netflix does not mean it's good..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "homers_evil_tv",
        "review_rating": "2",
        "review_title": "Good premise but..",
        "review_detailed_main": "Starts out as an interesting idea.\n\nQuickly deteriorates into a mediocre action thriller with many things that just don't make sense.\n\nAlso felt unnecessary long."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jmiguel77",
        "review_rating": "1",
        "review_title": "didn't make sense at all",
        "review_detailed_main": "And the fact that they used a loved song of mine at the end of the film just makes everything worst"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tp-40455",
        "review_rating": "2",
        "review_title": "Deceiving",
        "review_detailed_main": "Stupid and unrealistic action: typical American thrillers that insult our intelligence.\n\nThe story idea is good though, but the actions and fights are really deceiving."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kevin-07705",
        "review_rating": "1",
        "review_title": "What's going on? Who's that guy? What time is it?",
        "review_detailed_main": "I had to write my first review ever because this movie is just so bad. I hope that anyone else reads these reviews first before 'giving it a chance'. I managed to last an hour before checking the reviews... The only comforting thing is that I'm not an idiot and not alone! The characters are shallow, plot, writing directing, editing, acting, all horrible. It's 2.5 hours of non sensicial... Stuff... I cant even explains whats happening or why. I'm literally sitting here wondering how it's possible to still be on my tv for so long when nothing is actually happening!\n\nMy wife is now mad at me and wants our Sunday night back. Because of this stupid boring movie I now have to watch 90 day fiancé for the rest of the week as punishment for picking this. The worst part is that I'm actually looking forward to it! :(\n\nI think the movie is still on, I'm not sure. I'm starting to lose any concept of time. I have this looming feeling that I'm going to somehow be late for work. Wait it's still Sunday right? Ahhhhhh\n\nSave meeeeee."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "desertskies",
        "review_rating": "1",
        "review_title": "I watched for ten minutes.",
        "review_detailed_main": "Had to turn it off. Over acted and cliche driven. Others here explain well the problems of this movie, no need to repeat.\n\nFor the record, the title sounds like a Scorsese production. He could have done wonders with a title like that."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "luckymackypacky",
        "review_rating": "9",
        "review_title": "Not Afraid!",
        "review_detailed_main": "I may be the only person to actually like this film but that matters not to me. Yes, lots of shells are fired into to cars that wind up with no holes in them but that's a small price to pay. Viewers need to use their imaginations instead of having everything handed to them on a platter. The plot is a bit \"out there\" yet very interesting. It's filled with bad guys that you absolutely LOVE to HATE. Nobody gets out unscathed in some fashion or another. The fast pace distracts from the two and a half hour running time. The very best of this film, in my opinion, was the acting of Michael Carmen Pitt. He did a superb job as the demented son of a huge crime boss who is trying to make his own legacy. His portrayal reminded me of Jeffery Goines in \"12 Monkeys\". Totally on edge. Totally unpredictable. Totally nuts! See it for yourself. Critics screw up too!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vagarwal100",
        "review_rating": "1",
        "review_title": "Save yourself the grief",
        "review_detailed_main": "This movie is a disgrace to Netflix Films. It makes you think if Netflix just produces movie for the statistics as I highly doubt they will get viewers for such rubbish. Absolutely nonsensical story, absurd acting and direction."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "loscar-48354",
        "review_rating": "3",
        "review_title": "Literal rip of Den Of Thieves",
        "review_detailed_main": "I had to fast towards the boring and what felt to be pointless dialog to try and see some action which was also pointless lol"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "stellarxplosion",
        "review_rating": "5",
        "review_title": "5 stars for the music & Michael Pitt",
        "review_detailed_main": "Yes for me the music in movies is important, its usually bad these days so this was a nice treat. Also I really enjoy Michael Pitt as an actor, he played the messed up character perfectly. He has this edgy look that fit that role. Now I do agree on some things others said on here - not that the movie was too long bc that doesnt bother me as much - but it was rather confusing and the scenes were not fitting together most times. Also often way over the top and unrealistic to survive some parts of the story for the main male actor. The girl was geat too though, tough. Its an entertaining movie and people shouldnt be so damn harsh, there is way worse movies out there!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sbc-61818",
        "review_rating": "3",
        "review_title": "Not a whole lot of plot or character. Dystopia took over.",
        "review_detailed_main": "The Last Days of American Crime (2020) is almost a complete story. We have a dark dystopic crime ridden city in a country going to h__l because of crime so that gets one star. We have numerous bad guys trying to score one final heist before some Plot Magic is going to make crime except by the state impossible--Maybe. Then we introduce the femme fatale who just does not work for the story line and those doing her beck and call should know better. In the end there is a sunset, but who rides off into it is unrewarding. There are reviews galore giving this 1 & 2 and over 6 scores. Do not trust them. There is a long but kinda complete movie here. Minimal action and characters that behave, but sadly do not develop. I am putting this as a 3 stars as it just keeps going and going absent rewards to the reviewer. I can understand people like the setting and dystopia giving it one of two more stars. But, there was so much opportunity here to have a good movie and sadly it never made it to the final presentation. If you miss this one, you are not going to regret it much as there are few memorable moments or lines. Netflix is going to have to step up their game if this represents what they call dark dystopian Science Fiction. In many ways they would have had a better movie to kill everybody off at about the 80 minute mark as that would have been a better reward for my time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "wisdomwasp",
        "review_rating": "3",
        "review_title": "Great name, interesting concept, executed hilariously badly",
        "review_detailed_main": "The reviews are completely right. You don't need to read further. The film title is great. Really great. And it's an interesting concept and setup for a heist. But that's about where it ends, whoever has the genius idea to make this film go for 2 and a half hours rather than 90 had condemned the watchers of this film to boredom and yet not right going on.\n\nYou can tell this is based on a comic. The dialogue and interactions are stilted. This film helps weirdest romantic intro conversation that's laughably bad and unrealistic. It's actually funny\n\nThe acting is really bad across the board. Most are really trying but the direction and script doesn't help. Edgarr Ramirez either scowls or talks low. I swear I've seen this guy act well before.\n\nI struggled to get through more than a half an hour of this. Violence didn't help."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "badmflt",
        "review_rating": "1",
        "review_title": "DO NOT WATCH THIS",
        "review_detailed_main": "I like the premise and possibilities. I hadn't looked at any reviews on it, but thought it looks really interesting. Well, there's a very, VERY short list of movies I have simply turned off and walked away from, but this is being added to that list.\n\nWithin maybe 15 minutes, it becomes painful to watch. The acting goes straight down the toilet, and you will find yourself wincing at the screen wonder, \"What the actual hell is this?\"\n\nThe dialogue is some of the cheesiest crap you'll ever hear, and the acting is so forced and ridiculous. I struggle to think of a movie I've ever seen that was worse.\n\nThis clearly shows that Netflix doesn't even watch what they produce. Someone offered them a movie, they threw money at it, and then simply added it to their streaming service. They should be EMBARRASSED!!!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "christophecertelet",
        "review_rating": "1",
        "review_title": "DON'T WATCH!",
        "review_detailed_main": "Stop reading reviews and find something else to waste your time on!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "brimugo",
        "review_rating": "8",
        "review_title": "Clear Personal View",
        "review_detailed_main": "This film caught me to my best of interest. Itwas awell done movie won't say it was the perfect but it was a well done job. I suppose the main plot was ment to capture the idea of leaving of an un-ending twist of events which on my view turned out so perfectly. Base line.. I had no expectations as most had hence I got zero disappointments.\n\n8 fine stars."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "melmarshy",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "With the preview that Netflix was showing, the movie seemed to have a promise of an crime action with a twist. What a let down it was with its lengthy and boring storyline full of predictable twists. Please do yourself and skip over this one. It is over 2 hours of your life you cannot get back."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hectorreina",
        "review_rating": "1",
        "review_title": "Love Edgar but... It doesn't make sense. I couldn't relate to the characters, I like the idea of the film but I think the execution wasn't good. Is not a good film....",
        "review_detailed_main": "It doesn't make sense. I couldn't relate to the characters, I like the idea of the film but I think the execution wasn't good. Is not a good film...."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rick-19772",
        "review_rating": "1",
        "review_title": "The hint is in the title...",
        "review_detailed_main": "This film really should be the last American crime. The environmentally friendly thing to do with everything about this film is to refuse, there is nothing that can be reused or recycled. Nothing makes sense, the characters are as likeable as a fish milkshake, and it longer than a statistics lecture (no, really, it is! At 2.5 hours it really does go on and on and on and on and on and...). I stuck it out to the end only because I have a pact with myself never to start a film and not finish it. That is the same pact I have with myself about books - always finish them. Watching this to the end was as hard as trying to finish any book written by Peter Carey: You know your life is ebbing away and that you could save yourself, but you can't break the promise."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "m_yosri",
        "review_rating": "2",
        "review_title": "Too long, Too bad!",
        "review_detailed_main": "It's simply very long movie with very little filming! It's dull, illogic and doesn't make any sense.. too many loopholes.."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "smanuellawrence",
        "review_rating": "1",
        "review_title": "What???",
        "review_detailed_main": "Here's an advice. Fast forward to the end credits if you wish to listen to Depeche Mode's Personal Jesus. I just wasted 2 hours plus of my miserable life"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "zorrodg-316-238330",
        "review_rating": "3",
        "review_title": "As someone who LOVED the book...oof.",
        "review_detailed_main": "Netflix really botched this one. TLDOAC comic is a fantastic story, well-paced, action packed and filled with vividly realized characters.\n\nThe film tosses all that out the window in favor of bombastic shootouts where characters barely even get grazed, pointless subplots that pad the move to an unbearable length, and characters so one-note they'd be better suited in a Michael Bay blockbuster.\n\nAs a huge fan of the book, this felt like a slap in the face. What a waste of fantastic source material. Just read the comic instead. It's so much better than this joyless slog."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "joshbarton15",
        "review_rating": "4",
        "review_title": "Overindulgence leads to boredom unfortunately.",
        "review_detailed_main": "Some decent moments of action aside amidst a rather interesting concept, The Last Days of American Crime has no business being two and a half hours long. It really drags in places and certainly feels its runtime by the time it reaches its conclusion. Could have done with half hour to forty-five mintes being shaved off to make for a much more streamline film however, a film of this length in the hands of the director of the abysmal Taken sequels could have also ended up much worse than this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "andredejongh",
        "review_rating": "9",
        "review_title": "Based on a graphic novel, beautiful film: worth your while.",
        "review_detailed_main": "I was ready for the worst experience of my life, reading all the negative reviews. Ready to hit pause after like 15 minutes. But 35 minutes into the film I was still watching, still intrigued. And after one hour I was still waiting for the dull, bad parts to appear. How can people give this film such a low score? It's based on a graphic novel. Lots of action, lots of big characters and lots of beautiful camera shots. It is just a beautiful film, if you can say this about a film where's so much violence and blood. Beautifully produced, beautifully acted, beautifully directed. A beautiful story? Well it is not the typical Hollywood ending, perhaps people have a problem with this? That they are so much conditioned by Hollywood rules of telling a story? It is about the last days where crime is possible in America. About people who make a living out of crime and who are trying to protect their livelihood before their possibilities get taken away by society. The title says it all really. No more story is needed. Perhaps it is men who are giving this film a low score because men aren't the real survivors in this film."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "saisravankoda",
        "review_rating": "2",
        "review_title": "Illogical",
        "review_detailed_main": "Cliche scenes and mostly illogical concepts which we definitely know wouldn't work in real time. And most irritating part is when the lead actor survives and actually drives overnight after a shotgun wound fired from barely 2 feet. Even with any drug no one can do that dude, how did director even miss that part ?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "teegrier",
        "review_rating": "1",
        "review_title": "Worst movie in a long time",
        "review_detailed_main": "I mean absolute trash reminiscent of B movies from the 90's. Hate I wasted time watching it, save yourself the disappointment."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "carlits",
        "review_rating": "1",
        "review_title": "Worst film ever",
        "review_detailed_main": "Acting was terrible, story was stupid, what a waist of time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "marcioruioliveira",
        "review_rating": "3",
        "review_title": "Bad movie...",
        "review_detailed_main": "Is this movie from 2020 or from 1990? Dear god so bad in so many ways, sorry but waste of time..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "eroz-30487",
        "review_rating": "2",
        "review_title": "-3",
        "review_detailed_main": "Worst scenario. Nothing smart came out from it. Everything was so cheesy and easy They ruined a very good story Even my 10 years old son could write it better. Don't waste your time. Even the scenarists didn't use anytime why should you. Short version long movie no sense nothing special nothing smart don't waste of time."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "EspyRE",
        "review_rating": "1",
        "review_title": "I don't know what I watched",
        "review_detailed_main": "Plot has an idea there, but goes nowhere in the movie. So many flawed scenes that make no sense. Random sex and kissing. Back to more scenes that make you even more confused then before. Would not waste the 2 1/2 hrs watching this. Ending is also something else and makes no sense."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "eugeniodelcallejo",
        "review_rating": "1",
        "review_title": "The worst film ever seen",
        "review_detailed_main": "No story, no direction, no actors, no sense. Two and a half hours lost; the first Netflix's fail"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "michal-68",
        "review_rating": "9",
        "review_title": "Amazing movie",
        "review_detailed_main": "This is one of the movies you have to actually watch, not just stare at. Stylish, funny, well written and acted, with a comics-B-like vibe and a bunch of almost impossible to kill anti-heroes on a surreal backdrop of a state mind control being put in place.\n\nNot your average action flick, this is a piece of art to enjoy in its entirety. The scenes, the music, the camera all together create an amazing atmosphere.\n\nIt seems that it is not for everyone, obviously, but you will know in the first 10 minutes, just give it a try."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "propheticcypher",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bertler-1",
        "review_rating": "5",
        "review_title": "Why all that hate about this movie? strange...",
        "review_detailed_main": "\"The Last Days of American Crime\" is by far not a masterpiece but the amount of extremely bad reviews is surprising. With certainty the film is too long and boring in some scenes but it has some moments and there are worse action flicks these days..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "chipcud",
        "review_rating": "1",
        "review_title": "Fair Warning",
        "review_detailed_main": "I would rather drink spoiled milk than watch this. This can be the worst Netflix movie ever. For everyone out there, for your sake, do not watch this movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "remcoshtc",
        "review_rating": "2",
        "review_title": "What was it all about?",
        "review_detailed_main": "Ok I have to be honest I've turned it off after 15 bad minutes but I tried. I saw the plot and duration of the movie and thought: this will be something like the purge in a long nice story but nooooo....\n\nI did like the naked lady dancing in the car lol. But for the rest the acting, storyline, surroundings, behavior etc was just bad and I think this story needs another writer. Please try again because I do like the dark story and makes ffs a better backstory and beginning!!!!\n\nNow finishing my review it's hard because this is it for the movie. Ok imdb should increase the required characters for a review because bad movie people don't want to speak a lot about."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mhn-4",
        "review_rating": "3",
        "review_title": "Skip the first 80 minutes",
        "review_detailed_main": "And you have a rather lame action movie, but if you dont skip the first 80 minutes, you have a terribly boring and confusing movie. You choose. Might also want to skip this one."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "oliverc1msu",
        "review_rating": "1",
        "review_title": "Horrible. Just horrible.",
        "review_detailed_main": "Juvenile, unrealistic on so many basic levels. I hope it was written by a child because if it wasn't I feel really sorry for the rider."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "swaugh-49960",
        "review_rating": "4",
        "review_title": "Maybe, never again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "andystebbing",
        "review_rating": "10",
        "review_title": "Funny, Action, Not a 10 but way better than 4",
        "review_detailed_main": "We liked it. Not the best but definitely worth renting."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "markthomassintek",
        "review_rating": "4",
        "review_title": "I enjoyed watching it but I wouldn't recommend it.",
        "review_detailed_main": "REVIEW - THE LAST DAYS OFAMERICAN CRIME\n\nSet in the near future America has invented a mind controlling frequency called the API (American Peace Initiative).\n\nThe frequency stops people form committing crimes and as this film follows a group of criminals planning and pulling of one last huge crime.\n\nIn essence a very interesting and good concept with acting and action also excellent but.........\n\nNETFLIX has brought out a number of very good releases to their channel recently but unfortunately this isn't one of them, enjoyable but the story just doesn't make any logical sense and the characters are just repulsive grating you the watched at every opportunity, especially the silly love between the lead actor and actress, where did that come from?\n\nIn essence just a silly action (almost futuristic) gangster film with absolutely no substance and I use the word silly politely because I could very easily be more harsh.\n\nSo honestly watch this film for the action, the explosions, the shooting and the gore but don't concentrate on anything else because you will be sadly disappointed especially when 1 character gets covered with Diesel and doesn't burn and the same character later on gets shot in the stomach in point blank range and still survives!\n\nI know it's just a film but and maybe I'm being too picky but why create a 2-and-a-half-hour film to just waste your time will characters who just annoy you, a story that is just too silly for words and then ruined by ignoring the crime stopping signal (API) when it is convenient for the plot (truck driving at the end).\n\nI'm torn, honestly, I am, I enjoyed watching it but I wouldn't recommend it.\n\nRating 4 out of 10"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "godard65-2",
        "review_rating": "4",
        "review_title": "What the",
        "review_detailed_main": "Was about to watch this movie until I read the reviews and it's just totally awful. Still wasn't convinced by it, so I checked out the trailer and gosh it is really bad... so I'm not gonna waste my time on this. I only wondered why did Netflix even green light this. Don't they have better taste?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "giacomoluzi",
        "review_rating": "2",
        "review_title": "Waste of money",
        "review_detailed_main": "As many movies nowadays, good idea, very poor execution."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "harmenkampinga",
        "review_rating": "3",
        "review_title": "Weird movie",
        "review_detailed_main": "It's a weird movie... was expecting a lot more of it. But somehow it has a messy storyline. They want too much in the movie. So to my opinion you got a little bit of everything. The acting is poor. Some scenes are obvious not correct. Pfft... more than 2 hours waste of time almost..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "cjshull",
        "review_rating": "2",
        "review_title": "A disappointment",
        "review_detailed_main": "The premise is intriguing, a government-controlled crime solution. The execution on the other hand, is a special kind of bad. It has been years since I've encountered a movie where not only the story seems to fall apart, but I find myself watching the actors, concerned about if they will get their line right. The acting goes seemingly from bad to worse, completely ruining the atmosphere. A poor \"direct to tape\" movie that somehow got signed by Netflix."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "wbh-1",
        "review_rating": "1",
        "review_title": "Sparse, Dystopian and Noisy",
        "review_detailed_main": "Dreadful in almost every way except in its photography, this is yet another film in the endless stream of movies these days that have so much noise in them that even if you wanted to concentrate on the convoluted plot, you couldn't. Although I'm sure some viewers may refer to it as music, one cannot settle into the film's rhythm due to the fact that every scene is polluted by dyspeptic songs or synth symphonic syrup or ominous metal-tech droning of sound which is usually annoying enough but here it's laid in over everything--it drowns out the sound effects and, what would be inconceivable to any screenwriter, dwarfs almost every single line of dialogue. It makes me wonder if this is how people under the age of 30 live their lives: music of all kinds playing in their ears as they live their lives, swirling over their disjointed conversations with other human beings. For a film of this type and theme, perhaps the director should have had one more listen to the soundtrack of 'Blade Runner' and learned how to use music artistically. This film had me wondering if the directer owed money to the composer or sound design department and just let them fill the movie with all this racket after he had a boring movie on his hands when he had yet to play in the music track. This dreadful habit seems to be used in countless films today which have music droning ALL THE TIME throughout their running times. One other example of this ridiculous practice takes place in the otherwise splendid 'Impeachment' series of American Crime Story -- remarkable performances by the cast members are almost ruined by this relentless insipid droning sound calamity: imagine having great dialogue (which that show has) constantly drowned out in dramatic scenes. Such goes on in this film as well. All scenes which could have had subtlety in the performance and dynamic mastery from the cast (screams, mumbles, whispers) are obliterated by this relentless sonic invasion of one's brain. Add to this the running time of almost two and one half hours and I felt, after a single hour, what Noriega must have felt after having his stronghold blasted by non-stop Britney Spears tunes until he finally surrendered. The violence in the picture (useful to the plot but not necessary on the scale it is used here) and the film's total lack of silence had me ready to commit a violent act myself. All we can hope, if this bad habit continues in films, is that an audio track is made available for viewers to opt for that does not contain any music at all. And then we can silently plead that filmmakers will actually learn how music can artistically enhance -- and not overpower -- the story they are trying to tell. I certainly hope they do learn the difference because if they do not, it will certainly make it much easier for me to make it through the list of new films offered to us each year; each movie will get only 30 minutes of my time until I've had enough of the infernal cacophony going on."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "reborn-966-808248",
        "review_rating": "9",
        "review_title": "people are strange",
        "review_detailed_main": "Yes that comes up with me, people are strange. Because of the incredible bad reviews I hesitated long time to watch this movie. Till tonight, and I found it wonderful, yes very violent, but intense characters, very entertaining, incredible action supercool soundtrack. This movie is not for deep thinking, reflection about life such movies I like to, this movie is for entertainment and I loved it from beginning to end."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "surajvaishya",
        "review_rating": "1",
        "review_title": "Plot was diabolical",
        "review_detailed_main": "Completely pointless plot and pathetic acting. I gave up after 1.5 hours into the movie. Not sure why everyone on Netflix is watching this. Has everyone lost taste in good movies ? Are we so desperate to watch such sad movies with no direction and aimless story?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "nathanr25",
        "review_rating": "1",
        "review_title": "So bad, couldn't finish",
        "review_detailed_main": "I was going back and forth on what to rate it and I decided that If a movie is so boring and badly acted and directed that I couldn't finish it, it deserves a 1 star rating."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "danilomello20",
        "review_rating": "1",
        "review_title": "A waste of time.. and lot of it",
        "review_detailed_main": "The movie is total nonsense.. at 2h30 (give or take), it's an offense to allow someone to write this script.. how does crap like this gets made? Well.. at least the girl is cute"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "moatazsamy-52597",
        "review_rating": "1",
        "review_title": "Sucks",
        "review_detailed_main": "Such a waste of time , worst movie by Netflix.... so far"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mahdiriyaniel",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "walmsleybiz",
        "review_rating": "1",
        "review_title": "So effing bad",
        "review_detailed_main": "I want my 2 hours back. Would have better off watching a romcom. Ugh."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "satantwin",
        "review_rating": "2",
        "review_title": "Snooze Fest ...",
        "review_detailed_main": "Couldn't keep my eyes open after 50 mins through the film. Next day I tried to watch where I left it from and 10 mins later I am writing this. If it was just a hour long film it would be watchable. It's like someone was told that it had to be 2 hrs 29 mins long so the writer threw whatever came to his mind with no link to the plot. Characters, dialogues, story nothing makes sense. Action is so horrible that I had to rewind few scenes a couple of times just to make sure I saw what I saw."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "brightest-fairy",
        "review_rating": "8",
        "review_title": "I don't get the hate",
        "review_detailed_main": "Ok, this movie isn't a 8, but it definitely isn't a 1 o 2. I've seen far worst movies with thinner plots get 10s. Its a matter of taste. It has some interesting concepts to make you think, police brutality, big brother, etc. Blood, sex, cigarette smoke, it was ok. Nothing life changing. Times HAVE changed, this movie a few years back wouldn't be such a flop, but they probably made it before 2020, judge it like a movie, it obviously isn't pretending to be anything more than that"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "anthonywemyss",
        "review_rating": "2",
        "review_title": "Great title... Worst movie than the pandemic",
        "review_detailed_main": "Garbage, atrocious, why? And that's the good bits Is a better film on triple speed It doesn't make sense It's not even trying Why did you do this to me God?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sgroyle",
        "review_rating": "1",
        "review_title": "Stopped watching after first scene",
        "review_detailed_main": "The reason I stopped watching after the first scene was simply because it was so stupid. Soaking someone in diesel, \"because it burns slower\" and then (this is the really dumb part), putting a half-smoked cigar in their mouth and walking out. As any fool knows (except the director) a cigar will go out if you don't draw on it. So all the guy in the bathtub had to do was not draw on the cigar. Plus if you drop a burning cigar into diesel there's a very good chance the diesel will not ignite. Just dumb."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "robcanalesphoto",
        "review_rating": "2",
        "review_title": "Worst movie on Netflix?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "edwardeggers",
        "review_rating": "4",
        "review_title": "In need of major editing",
        "review_detailed_main": "Decent concept. Acting was decent. Plot wasn't bad. But it is way too long, and a lot of crap is shown that really doesn't matter."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "moviesbyt",
        "review_rating": "1",
        "review_title": "Disjointed violent mismash",
        "review_detailed_main": "As the say, the book must have been better. I certainly hope so. This disjointed dystopian film mashes La Case de Papel, Scarface, Powers, the Terminator and many others for meaningless setpieces of violence signifying nothing.\n\nThe premise of a pending electronic signal activation that prevents criminal thoughts and actions is great and could have been its own movie, but it is put into background scenery in favor of a convoluted and nonsensical heist plot.\n\nSharlto Copley seems to replay his Power-less role from the eponymous series but is completely under-utilized in a side plot about a policeman about to made jobless by the signal activation.\n\nSave 2.5 hours of your life and watch something else. This joins a list of 18 IMDB properties over the past 20 years that I rated a 1."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mahlatsepatrick",
        "review_rating": "1",
        "review_title": "This movie was almost fake to me, hard to watch.",
        "review_detailed_main": "Well the title of the movie is \"The Last Days of American Crime\" but 90% of the movie was shot in Johannesburg South Africa, Knowing inside and outside of the city made the movie extremely boring as it was not standing up to it's name, what happened to \"keeping it original\". Trying to put in American flags, car number plates from Michigan, using US currency in a foreign country, renaming the streets of Johannesburg, changing Sandton to Canada was all bad moves. I think this name was used to attract viewers. Or maybe it was budget issues. The movie was great but still fake."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "PurpleMotherLoad",
        "review_rating": "1",
        "review_title": "There are no last days...",
        "review_detailed_main": "What did he swallow exactly? 2.5 hours for???! perfect aim?! Oh well quarantine hour 800 billion."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "LynetteMarie",
        "review_rating": "10",
        "review_title": "NOT SURE WHAT'S UP WITH ALL THE NEGATIVE REVIEWS!!",
        "review_detailed_main": "Don't listen to the naysayers!! This was actually a great movie, and if you're not all about critiquing every little second to find something negative to say, you'll actually be able to follow along and enjoy it with absolutely no problem. Sit back and enjoy the ride for what it is!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "francoisdavoust",
        "review_rating": "2",
        "review_title": "Must better using double speed",
        "review_detailed_main": "At normal speed, 1 star I watched it at double speed, 2 stars\n\nDon't watch it. not because it's cheap, it's because it's bad.\n\nPeoples are idiots, the job is full of non sense and hazard, acting is most of the time bad.\n\nAs indicated by many people, don't waste your time on this. Read the comics"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "pitchie-45632",
        "review_rating": "1",
        "review_title": "Horrible Mess",
        "review_detailed_main": "An awful effort, that just falls apart within the first few scenes. Dreadful acting, poor set pieces and a running time that is arguably an hour too long - avoid."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "misstruama",
        "review_rating": "1",
        "review_title": "Who wrote this ?",
        "review_detailed_main": "I've never left a review but this movie was so bad ,I had too. First of all the casting simple does NOT work .The cringe introduction of the so called \"sexy irroestiable woman \" is when I shut off the movie .The casting didn't work for her character at all and felt almost like a joke .No offence to the actress but if you're going to claim a character to be desirable and \"change the energy in the room\"then cast an actress that has that aura to her .Also I love Edgar but his acting was abysmal to say the least. The pacing is also awful in the movie, the sci-fi that leads the story on isn't elaborated on enough and just feels thrown in and lazy."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mchapple-52317",
        "review_rating": "4",
        "review_title": "Not as bad as everyone is saying it is",
        "review_detailed_main": "Right - perhaps if you're looking for a quick action / bank robber fix, this film is too long, even though I can think of other films where the pacing is worse, it is over 2 hours. A lot of the characters seem 2 dimensional, but the characters suppress their feelings towards one another, all except from one character who you will see turned out to be the 'main character.' This means that it's not a great character study film if that is what you're into.\n\nThe reason this film was of any significance to me, however, was not the plot (which is sort of unique) but was the soundtrack, transforming this film from a dumb action movie with not enough action to a mystery thriller. If you wanna watch it, watch it, but you'll never know if it's good or not if you don't."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "denislazetic",
        "review_rating": "3",
        "review_title": "Want 2 hours of my life back",
        "review_detailed_main": "This movie is so bad, I literally made this acc, just to write that here. I've also unsubscribed from Netflix, delete my account, and wrote personal letter to Elon Musk asking him if there is one more place on his Mars mission. Only good thing is that even when you roll your eyes on cheap dialogue so hard that you lose consciousness for few minutes, you wont miss anything."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sashkopich",
        "review_rating": "1",
        "review_title": "I regret that I lost my time to watch this movie",
        "review_detailed_main": "Everything is this movie is awful.... from the story to the playing of the actors.... so boring and bad."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "lifehaule",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "Sometimes reviews are not right. I've enjoyed it and I liked it"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "onyxrecruitment",
        "review_rating": "1",
        "review_title": "So long, so bad",
        "review_detailed_main": "Who got paid to put this movie out. It's just a string of terribly acted scenes with little tying them together and a bunch of plot holes and unexplained things.\n\nDo not waste time on this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "rwgill-265-35881",
        "review_rating": "5",
        "review_title": "Wasn't THAT bad",
        "review_detailed_main": "Wasnt great, wasnt horrible either.. some ok action, story, visuals.. long.. i felt it long at around 1.5hrs.."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "junk-08680",
        "review_rating": "2",
        "review_title": "Its very bad",
        "review_detailed_main": "Came here to dogpile, it's a very bad movie. I watched the first 30 minutes and the last 15 and that was too much. It's the kind of movie that plays music the entire time to keep up the \"suspense\" but it really just grates on your ears and nerves. The rest has already been said by others who lost an hour or two of their lives so you dont have to."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "viskies",
        "review_rating": "2",
        "review_title": "Pointless movie going nowhere",
        "review_detailed_main": "It's got an interesting premise but completely squanders it through bizarre sequences, terrible acting and badly written lines.\n\nAt over two hours, its not worth the time and is very predictable at every turn. There is nothing original to offer and the motivation for characters is base and shallow. The bad acting is what finally caves the below par writing and dialogues.\n\nBetter watch the traffic out of the window rather than this snore-fest"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "alindsayal",
        "review_rating": "2",
        "review_title": "An Awful Film That is Way too long",
        "review_detailed_main": "This film hit Netflix today and I have had the chance to watch The Last Days Of American Crime and here is my review for it. The premise of the film sees a crew attempt to commit a heist just before a signal comes in to play to stop anybody from commiting a major crime.\n\nMain Character Edgar Ramirez plays the main character here and honestly I have never been a big fan of his, I just find him really boring to watch and this film is no different as he is such a boring lead character. There is nothing unique about him at all as a lead character and the film gives you no reason to care about him or why he is doing what he is doing so it leads you to become bored by him.\n\nSupporting Characters The great Sharlto Copley is in this film and when he is on the screen he is clearly the best actor here, I just don't really understand why he was here. His character plays no part in the plot really and it feels like a weird excuse to pad out the length by putting him in here. Anna Brewster plays Ramirez's love interest here and I mean she has the best motivations here, but they still don't work and I didn't care about their romance. There was just nothing there and no chemistry between the two performers to make it interesting or compelling. Michael Pitt plays there associate and he is that character who is just insane for being insane's sake, he has family issues but none of it is expanded enough for you to care and you really wonder why Ramirez's character even decides to work with him as it makes no sense.\n\nStory The premise of the film is pretty interesting but it is just executed so poorly, you don't care about the characters and the heist doesn't get the attention that it deserves so you aren't exactly clear why and what they are planning to do. There is a side plot with the police that isn't expanded at all and it feels like it is there for no real reason at all. The end of the film is crazy and tries to make you care about the characters but you just don't.\n\nScript The script is really boring here, the drama didn't connect with me or make me care about anything and there is literally no real humour making this a very sombre and frustrating experience.\n\nStyle The style of the film has some decent action scenes that are really over the top making them fun experiences, it is just there aren't enough of them. Plus the film is 2 and a half hours which is absurd, it drags on to a slow painful death, the film should have known what it was and aimed for 2 hours or even a little less instead of dragging on with one of the slowest paced movies you will see all year.\n\nOverall Overall, this is a really poor film, so boring and so slow. It just about avoids a 1 rating because of some fun action scenes and Sharlto Copley but it was close because I was so bored watching this film and recommend nobody waste over 2 hours of there day with it.\n\nRating - 2/10."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "alifim",
        "review_rating": "3",
        "review_title": "Wow, there is nothing to rate really.!",
        "review_detailed_main": "Tere is two good songs and a good looking actress, its the only thing i could rate giving it a 3 ;)) now really I could not believe such low quality movie is possible in 2020, who the hell fund such bs. Although the main idea could be interesting i the work and the funds would be given to real professionals."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "pontocrates",
        "review_rating": "2",
        "review_title": "WHAT IS GOING ON??!!",
        "review_detailed_main": "The premise of this film is really interesting but the delivery was just awful. So much of the dialogue is mumbled so you just can't follow it and the rest is just hackneyed action cliches - one after the other.\n\nThe laws of physics are regularly bent/ignored - not unusual for action movies but when they're applied differently to different characters just to get the clunking plot vehicles moving you just can't invest in it anymore.\n\nAvoid this film and save yourself two and a half hours of your life."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "TruView",
        "review_rating": "9",
        "review_title": "All Guns and Roses!",
        "review_detailed_main": "Not since the Matrix Trilogy has there been so near perfect a balance between the essentials of great movie-making: High stakes tension builders; The blossoming of human empathy ~ that perilous interplay of the love-hate dynamic that so often livens human interactions; and a meaningful plot leading the audience inexorably to some crucible of a showdown or a glorious grand finale.\n\nThe only real draw back to the film - and a very costly one at that - was in its opening salvo which should have gone to making a certain protagonist more preferable than others. Instead, this misfire went to making him and his cohorts appear just as unlikable and cutthroat as their contenders. Although if enough patience is given, the story sort of grows on you. Ultimately there are no good or bad guys, just overlapping objectives by very ruthless players."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tobiaslegenden",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": "Beneath the sky so wide and clear, I walk with you, my dear, my dear. Your hair, a flame in sunlight's grace, A beauty rare, no time can chase.\n\nWe stroll through paths where flowers bloom, With each step, hearts dispel gloom. The world is bright, your laughter rings, A melody on gentle wings.\n\nIn a cozy café, we find our seat, Two cups of warmth, the air is sweet. With every sip and whispered word, Our love, like coffee, gently stirred.\n\nA day so simple, yet so grand, Walking with you,. Your red hair, a sunset's hue, A walk, a coffee, a dream come true.\n\nAnd also. The lines in this movie are so bad they would be considered toxic for an adult movie..."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sirkeith7",
        "review_rating": "1",
        "review_title": "Dreadful.",
        "review_detailed_main": "Aborted viewing after half an hour, I think I percivered with it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hamed-taha",
        "review_rating": "2",
        "review_title": "Simply Bad Movie",
        "review_detailed_main": "I wasted my time watching it , I should have checked the reviews and trust it , it deserve 2/10"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "gabrielhabaeb",
        "review_rating": "1",
        "review_title": "Jesus, Mary and Joseph!",
        "review_detailed_main": "What a mess!? I've watched bad movies but Netflix achieve all records. WTF was that? The movie seems my friend Henrique. Crazy, Insane and freaked out!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "yoyogeorge",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Jack_C_",
        "review_rating": "2",
        "review_title": "Too bad to be funny",
        "review_detailed_main": "I was hoping for something hilariously bad like The Room, but this piece of do-do took itself too seriously to be entertaining. What was undoubtedly an awesome novel and fascinating premise was destroyed by film school flunky directors and writers.\n\nIt literally looks like it was made by a high school student given a $10 million budget. I am at half an hour through and have to stop before I lose all self respect."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "trashgang",
        "review_rating": "4",
        "review_title": "a few moments are okay but the first 90 minutes way too long",
        "review_detailed_main": "After a few brutal Netflix releases this was going to be the next thing and the trailer was giving away some nasty and bloody moments so off we go for another nasty Netflix.\n\nStarts really good and I thought, yes, it's going to be like Exctraction in your face brutal flick. Sadly after a few minutes into this film it drops below zero and in fact the first 90 minutes are way too long and even a bit boring. So 90 minutes of, let me say nothing.\n\nOnce this starts it's getting better but way too late to make it a good flick. Easy to say this is one to skip, too long, simple story, nothing to offer except a few moments.\n\nGore 1,5/5 Nudity 1/5 Effects 3/5 Story 2/5 Comedy 0/5"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "donumdei",
        "review_rating": "10",
        "review_title": "Reallyyyyyyy this was such a fun movie",
        "review_detailed_main": "Wow I honestly really enjoyed this movie. It was outrageous and exciting. Constant action and just awesome. Great movie don't take it seriously just watch it if youre in a mood for pre end of the world type heist movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "arq-portillo",
        "review_rating": "1",
        "review_title": "DONT WASTE YOUR TIME",
        "review_detailed_main": "The worts film in netflix, period. 2 and a half hour of pure garbage. Im mad watching this."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "danielhawkins-19522",
        "review_rating": "1",
        "review_title": "Nothing about this film makes sense.",
        "review_detailed_main": "Firstly the film fails to explain any of the societal context in a coherent way. It's set in some kind of dystopian future USA but it doesn't really say how or why this future occurred so the story was on an unsteady foundation from the start.\n\nNone of the characters back stories are fully explored and you are never really sure who they are, what their motives are and what they hope to achieve--people just seem to be passively going along with the plot for no real reason other than 'yay crime'. It feels like one of the early GTA games where the character runs around aimlessly doing whatever crime other people tell them to.\n\nBrick, the lead character lacks any real depth- he is supposed to be motivated by vengeance, although it's not quite clear how he will achieve this though the heist. However, he fails to really show any flicker of notable emotion during the entire 2.5 hour movie.\n\nThe film is so disjointed it really is impossible to follow and enjoy. It leaves you feeling of confused and frustrated.\n\nOverall the writing is just terrible and I would recommend watching any of the purge movies if you had a taste for a dystopian crime/horror of this nature on Netflix. (I'm not saying the purge is great, but it's better than this)."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "kevin-1224",
        "review_rating": "5",
        "review_title": "Not a bad movie, just buthurt reviewers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "K_Deloz",
        "review_rating": "3",
        "review_title": "#3 on Netflix? Why? How?",
        "review_detailed_main": "This is the song that never ends, oh ma' gosh! I'll give the actors credit, they did a really good job with what little they had to work with. Having said that, this was painful to watch. Between the plot holes, never-ending magazines, corrupt cops and unnecessary characters, I really wanted it end after about 30 minutes. There is so much filler content that was unnecessary. As my wife stated, it felt like it was a story written by a high school student. Decent acting, really interesting concept but weak writing and weak script."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "vhandoyo",
        "review_rating": "2",
        "review_title": "Unnecessarily Convoluted Action / Dystopian Flick",
        "review_detailed_main": "The story goes here and there, the scenes try so hard to be dark, gloomy and moody, then the performances are B-grade. It's a mediocre movie that takes itself too seriously."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "jcallen-47563",
        "review_rating": "1",
        "review_title": "Do not waste your time absolute crap!!!!!",
        "review_detailed_main": "Can't believe I wasted my time watching this! You can't be serious....."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "reischjustin",
        "review_rating": "4",
        "review_title": "Watchable, but maybe not enjoyable",
        "review_detailed_main": "I felt give or take no connection to the characters or storyline, and honestly it felt like most of them didn't either. The motives and plot drive devices were just bad. That being said, there's some entertaining moments sprinkled in, but not great."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "glenno-42453",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "I'm sure there are a lot of great graphic novels out there. So why is it that almost all of the movies they make from them suck so much?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "derpizzadieb",
        "review_rating": "3",
        "review_title": "Finished it with regret",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "fbmike",
        "review_rating": "1",
        "review_title": "Crapamundo Soup with a side order of gopher filet",
        "review_detailed_main": "Yeah well, would you eat it? Well evidently someone over at Hollywood thought so and hired some Netflix waiters to serve it. Netfilx signed on for the, \"let's make some crap\" show. Michael Pitt was trying so hard to be Al Pacino, I was expecting him to flash his gun and say, \"say hello to my little friend\". You know he wanted to do it. This movie gave you bonerless sex, violence up the ying but without the yang, acting on par with spanky and the gang, a story that some guy wrote while he was stocking the shelves at Walmart. What this movie really needed was a laugh track."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "couchpotato2k",
        "review_rating": "1",
        "review_title": "Painfully, Regrettably, Unnecessarily Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "abigaillodge",
        "review_rating": "1",
        "review_title": "ABSOLUTELY TERRIBLE",
        "review_detailed_main": "Complete and utter garbage. So boring, no chemistry, terrible acting, the movie makes no sense"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "bostockleigh-75918",
        "review_rating": "2",
        "review_title": "What a bore.",
        "review_detailed_main": "This is one of those movies that everyone involved (including those who watch it) simply wishes had never been made. Despite what appears to have been a sizeable budget, the script and screenplay offer no coherent story and no tension whatsoever. Each scene appears unconnected to the next, and it rambles on, something like this review, until by the end of the movie one has forgotten the premise offered at the beginning. I could have stated all this in one sentence. Embarrassing and nonsensical on every level. Some movies are SO bad they make you laugh - this one is just horrifically bad. Period."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "michael-280-201489",
        "review_rating": "2",
        "review_title": "Full of holes",
        "review_detailed_main": "Not sure if there are more plot holes than bullet holes, but it pretty close.\n\nCan't believe i actually watched this to the end, hoping for it to make sense (which it didn't).\n\nThis is almost two and a half hour of pure crap, and time of my life i just wasted."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "DrCCat",
        "review_rating": "1",
        "review_title": "If you value your sanity...pass",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "solipsist_in_a_cloud",
        "review_rating": "4",
        "review_title": "Could have been in line with The Purge",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "davidfsoliman",
        "review_rating": "1",
        "review_title": "Lost 2 hours from my life",
        "review_detailed_main": "I just lost 2 hours of my life watching that poor movie. The worst thing i had ever seen"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "t-d-t-m82",
        "review_rating": "3",
        "review_title": "Crime Cliche and CGI",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "pejman-44134",
        "review_rating": "2",
        "review_title": "What a mind numbing movie",
        "review_detailed_main": "Good title, hence the two stars. Terrible acting, fake relationships and horrible special effects. What waste of 2 and a half hours of my life. I really should give it a one star but I like to be generous since I like Netflix"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "majacelina",
        "review_rating": "1",
        "review_title": "What tf did I just watch?",
        "review_detailed_main": "I laughed hysterically the last hour of the movie because it was so unbelievably bad. Nothing made any sense. The characters and their relations were so badly written, I didn't feel one single emotion during this whole movie."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sallywoof",
        "review_rating": "1",
        "review_title": "Just WOW",
        "review_detailed_main": "I enjoyed \"Colombiana\" and I didn't think his \"Taken\" were that bad but Megaton's last product just cannot be defended. Way to go Netflix!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "sjampani",
        "review_rating": "1",
        "review_title": "Complete waste of time!",
        "review_detailed_main": "I haven't seen such a crappy action movie ever in my life!"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "trakesmith",
        "review_rating": "2",
        "review_title": "Absolute plop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "ggpanta",
        "review_rating": "5",
        "review_title": "Slow but entertaining",
        "review_detailed_main": "This movie needs an alternate cut, it is slow in a quite few places and it is not due to exposition. Other than that it's a run of the mill crime-action movie, easily watchable just for mindless fun."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mhisbulmalkarim",
        "review_rating": "2",
        "review_title": "The bad movie",
        "review_detailed_main": "The movie duration too long, the plot isn't clear, and 😒"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "hutch6072",
        "review_rating": "1",
        "review_title": "I'll be damned....",
        "review_detailed_main": "I wanted to like this, I can appreciate a b rate flick from time to time but hot damn if this thing isn't a dumpster fire to avoid at all costs. It has potential but damn it the story is as garbage as the acting. I don't want my time back i just want to save others from blowing theirs... Is just not worth it."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "southernwildd",
        "review_rating": "1",
        "review_title": "I thought it was a spoof/comedy",
        "review_detailed_main": "For twenty minutes we thought this movie was a spoof/comedy. It wasn't until we looked up the genre that we realized that this is supposed to be an action movie. I have never watched a cheesier movie. Cringe. 😱"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "guidopasanisi",
        "review_rating": "1",
        "review_title": "So bad, so so bad ...that maybe can be something...but it's not",
        "review_detailed_main": "Make your self a favor Go for a walk, watch something else, do something but not spend 2,5 hours for this Nobody will give you this time back It goes nowhere"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "amralikh",
        "review_rating": "1",
        "review_title": "Stop",
        "review_detailed_main": "Please Netflix Stop making movies You are so bad! I just wasted 2 hours of my life"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "gilesbattye",
        "review_rating": "3",
        "review_title": "Didn't make any sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "Prof68",
        "review_rating": "1",
        "review_title": "What the...?",
        "review_detailed_main": "I regularly contribute trivia and goofs for movies and tv shows on IMDB but, frankly, I was almost overwhelmed by the number of mistakes in this...whatever it is.\n\nPlotlines were introduced but never resolved. Character motivations were never remotely revealed or clear. My wife and I called it a reverse 'Purge'.\n\nAnd...let's not mention the fact that...was Edgar Ramirez supposed to be an Irish gangster? Really? Really?"
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "artswan-77642",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": "Horrible! Horrible! Horrible! Further proof that Netflix's 'algorithm' for finding new hit series and movies involves nothing more than throwing everything at the wall and seeing what sticks."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "cameronvasiliou",
        "review_rating": "1",
        "review_title": "Took forever",
        "review_detailed_main": "This movie was way too slow. The last hour is where the only good stuff is at. Can't take that actor as a serious badass. To me they tried to hard. Plot was lame and ending was garbage. They could have done so much better. Picked better cast, focused better on the story, but it was all over the place. The concept was there, good idea, but the acting was garbage. I feel like a this was rushed and hence why it got rated so low. I'll also rate this movie low. Nothing consistent in this story, don't see how it even made it to where it made it. I say if you absolutely have nothing to watch and real need something to pick apart. This be the film."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "soneagu",
        "review_rating": "3",
        "review_title": "This movie defies any logic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "fmansuri92-437-938894",
        "review_rating": "1",
        "review_title": "bad bad bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "garth-11341",
        "review_rating": "1",
        "review_title": "Where did that go so wrong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "johnnymurph",
        "review_rating": "2",
        "review_title": "Awful stuff",
        "review_detailed_main": "Terrible. I watched an hour and twenty minutes, hoping it would do something to encourage me to keep watching, at which point I realised that there was almost as long left as I'd already watched, and turn it off. The story is stupid (but not in a good way). The dialogue is awful. The acting is bad. There isn't a single character who's even slightly likeable. There is nothing positive to say about this film. The only thing I can say in its defence (and it's still not a positive point) is that most of the people involved haven't made many films before or haven't made a film in a while - probably with good reason - so that might excuse how bad it is to some extent (though the director has some okay stuff on his record - I can only assume he's been in jail for a few years and now he has money problems).\n\nIf there is one positive to take from this film, it's this: if this is the standard you have to reach, anyone who wants to make a film could make one. Don't lose hope. You too could make a terrible, terrible film and still have Netflix promote it so much that people will give it a go. I imagine some people even managed to sit through the whole thing. Not many, but probably some.\n\nDisclaimer: the last hour and ten minutes might be the finest piece of cinema ever committed to film. I didn't watch it, and I doubt I ever will, so I'll never know."
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "toulamyk",
        "review_rating": "",
        "review_title": "Why Netflix bought this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "tareqzakarea",
        "review_rating": "",
        "review_title": "Why is that most popular",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "richardtomlinson-27920",
        "review_rating": "",
        "review_title": "1st Ever Review - So, so, bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "slim-44",
        "review_rating": "",
        "review_title": "Ton of shooting and explosions couldn't cover the boredom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "mchannv",
        "review_rating": "",
        "review_title": "Interesting story line, bad execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1552211",
        "movie_name": "The Last Days of American Crime",
        "movie_rating": "3.8",
        "review_username": "eyeblips",
        "review_rating": "",
        "review_title": "what I have just seen?",
        "review_detailed_main": ""
    }
]