[
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "Taranarana",
        "review_rating": "1",
        "review_title": "Tatti Hain tatti.",
        "review_detailed_main": "So, I went with my colleague to watch this movie just for fun. And oh boy we had no fun. The script was cringworthy, the dialogues were illogical and everything was rubbish. surprisingly the newcomers gave good acting performance. I really love tiger Shroff but it's high time for him to look at scripts before signing. He is still in his baaghi mode. Don't watch this movie. Don't waste your money or time. It's tatti."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "CineRenaissance",
        "review_rating": "",
        "review_title": "Next Kalank from KJO! Tiger Shroff should be a stuntman at most.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "user_ok-29835",
        "review_rating": "1",
        "review_title": "Pure garbage",
        "review_detailed_main": "This movie is so bad, after half an hour I got up and left. There's half hour of my life I am never getting back. There is no acting, I don't know why would they even bother to make this kind of movies. I can't give this movie below 1 because there is no rating below 1."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "thakkarharsh93",
        "review_rating": "1",
        "review_title": "FLOP",
        "review_detailed_main": "Boring Movie.Worst acting by Tiger.KJO at his worst"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "monjurabid",
        "review_rating": "9",
        "review_title": "Good for Ananya & Tiger",
        "review_detailed_main": "I donno why but I loved this film. Though the reviews are mostly negatives, I enjoyed the movie thoroughly."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "souravslove",
        "review_rating": "7",
        "review_title": "Entertaining new generation movie",
        "review_detailed_main": "Entertaining new generation movie, light and Tiger Shroff really acted well.Ananya Pandey was like a cool breeze. I hate KJo movies , but liked this movie. You need to watch this movie as a college goer mind, can't watch it expecting to be like \"Sacred Games\"."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "gandhihardikr",
        "review_rating": "1",
        "review_title": "I wish there was an option for negative ratings",
        "review_detailed_main": "This movie is nothing but a good example for KJO, new female casts that people don't want movies without a good story and acting. People are now awaiting only with real stories or stories with some logical ideas and ofcourse with good actors. Nepotism don't work anymore...Actors and directors now make movie for their own fun, they barely care about the movie and it's story... Struggling actors although not famed are far more better than this movie's cast..."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "marjunmishra",
        "review_rating": "1",
        "review_title": "Stupidest.",
        "review_detailed_main": "The difference between genius and stupidity is that genius has its limits. This film does not have limits in it's stupidity."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "anchalverma-23512",
        "review_rating": "1",
        "review_title": "It's just a potty...",
        "review_detailed_main": "This movie was boring,senseless,humorless and this was overall biggest flop movie of 2019..."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "amrischaudhary",
        "review_rating": "9",
        "review_title": "Everything we need in movie",
        "review_detailed_main": "Nowadays everyone director make different classic movie and masala movies are now less in quantity . But it is great movie after all I like so much actiing of tiger and manav also shuti look bold. I watched it 4 times. I love tiger s acting"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "iaminul-42334",
        "review_rating": "7",
        "review_title": "Loved the girls.",
        "review_detailed_main": "I just saw the movie to see ananya. And I liked her so much in that movie. And yeah that movie was entertaining sometimes."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "YeTejaTejaKyaHai",
        "review_rating": "1",
        "review_title": "Tatti of the year",
        "review_detailed_main": "Please don't waste you time and money for this garbage..."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "aggdivya5",
        "review_rating": "1",
        "review_title": "SOTYISPOTY",
        "review_detailed_main": "Waste of money and time. Digusting plot and more disgusting acting."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sanjeevkochar",
        "review_rating": "1",
        "review_title": "ALL TIME DISASTER",
        "review_detailed_main": "Just ask the director what he wanna do, either he want to show a love triangle or a dancing competition like ABCD , a sports completion like chakde india, the poor director is so confused .,pls help anyone.. Don't go anywhere to see this natural disaster of movie...and wait..\n\nJust go once but only for Ananya"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "aayusingh-66024",
        "review_rating": "1",
        "review_title": "My 300 Rupees gone to waste.",
        "review_detailed_main": "Karan Johar has no idea what type of Movies should be made as these types of Movies are old fashioned and well known to the public for all these years. People wants to see Reality with new concept and logic. (which the Movie was lacking for) Tiger Shroff hasn't changed that much. He is still living in Baaghi mode. New heroines don't even know how to do acting in the movie. Poor direction, illogical dialogues, got nothing to do with College life, Worst screenplay, everything is worst actually. I just want My 300 rupees back."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "couponscheap",
        "review_rating": "8",
        "review_title": "Really fun movie to watch with friends",
        "review_detailed_main": "So a couple of my friends had come over and we were at a loss of ideas to pass time and while searching on prime video came across this title. We started watching the movie as a joke but eventually we all started enjoying it! We were obviously passing comments throughout the movie and really loved the way we could pass time. So seriously I wouldn't give it a low rating but a solid 8. Go for it if you also have friends who would add on to the movie flavour with hilarious comments XD"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mokhlesrahman",
        "review_rating": "6",
        "review_title": "One time watch",
        "review_detailed_main": "So I may be on the flip side here. But I'm not just gonna give a film low rating because everyone is giving it. Yes it's not a high concept movie but it's watchable. The film has some good comedy moments and the story well you know the story when u saw the trailer. You have to judge this movie from a different point of view. I've seen far worst films than this which has a good rating than this film ironically"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "ketgup83",
        "review_rating": "1",
        "review_title": "You need to have nerve of steel to watch this garbage",
        "review_detailed_main": "Movie Name - Student Of The Year 2 Genre - Romance / Drama Rating - Disgusting 0.5 /5\n\nSometimes I wonder whether few filmmakers prepares any script before making a film. Spending so much on location, songs and dance would not give the inception of a good film unless script is thoroughly worked upon.\n\nSOTY2 tells the story of 3 friends with the Kabaddi Inter School competition at the background - Rohan (Tiger Shroff) who joins the college for his girlfriend, Tara Sutaria. There is a spoilt brat, Ananya Panday, who thinks she can rule the college with her care-free attitude.\n\nDirector Puneet Malhotra (I Hate Luv Storys, Gori Tere Pyaar Mein) does not do justice to the area of direction at all. As the movie begins, you are greeted by glossy and candy floss environment of college (reminds you of Kuch Kuch Hota Hai and Student Of The Year 2012 ) with unnecessary insertion of songs. The main drama unfolds in the later reel which again is intolerable with screenplay written surely by a school kid. Art direction and Cinematography is excellent especially. Songs are poor. Dialogues are less-impacting. Performances are over-top. Tiger Shroff does his best but could not do much with the lame script. Glam dolls -Tara Sutaria and Ananya Panday are meant for making the film more attractive.\n\nOverall, a pathetic film in every sense."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "shashanktripathi-40467",
        "review_rating": "1",
        "review_title": "Only for Low IQ People",
        "review_detailed_main": "What more could you expect from a 5 IQ director Karan Johar, and The underdeveloped Brains of star kids. I just wish No one from Hollywood ever watches this movie, cuz it will create very bad reputation of Bollywood in the west."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "architmurali",
        "review_rating": "",
        "review_title": "Cringe source...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "parmarashish-12561",
        "review_rating": "9",
        "review_title": "Punit Malhotra should retire",
        "review_detailed_main": "Picture is awesome,only direction of Punit Malhotra is the worst. He ruined the whole picture."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "hamzakhan-61070",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "I made an account just to give this a 1 star, movie sucks. don't waste time and money on this piece of junk"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tanmaysk-02743",
        "review_rating": "1",
        "review_title": "Very low standard movie from Dharma",
        "review_detailed_main": "Sorrowfully, Dharma productions have witnessed a big change in its movie standard since last year. Soty2 is a complete copy of the first story and feels very boring and uncomfortable. We don't need such films but instead we look for some creative and diverse films from Dharma. Very disappointed!!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "surajmishra-50170",
        "review_rating": "1",
        "review_title": "No content in the movie.",
        "review_detailed_main": "I m big fan of Tigar shrof. But what I feel about him is that he is only working on in his dance and fighting skills. And about this movie, now everyone wants movie which has content and story. This movie is for children who are in between 8th-9th standard. If this movie would have released 5-6 years ago then it would have got good ratings ( not more that 5). Sorry Tigar, I do like you but this is my honest review."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "nafizrazanbab",
        "review_rating": "",
        "review_title": "Not too bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "bipinshuklabs",
        "review_rating": "8",
        "review_title": "Underrated!",
        "review_detailed_main": "It's not that much bad movie. If you liked first part then trust me you can enjoy this movie for a time."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "anil-cool",
        "review_rating": "7",
        "review_title": "Good movie 🍿",
        "review_detailed_main": "I was surprised to see all these negative comments. I watched the move over span of two days. I enjoyed the full package 📦.\n\nI believe all those comments were a negative campaign against KJR ( I am not a fan of K) but I can appreciate a decent entertainment."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "bibekbhattarai",
        "review_rating": "1",
        "review_title": "Waste of money and time.",
        "review_detailed_main": "You watch. Better to sleep at home. Worst movie presented in the worst possible way."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "prakhar-cool71",
        "review_rating": "1",
        "review_title": "WORST movie EVER",
        "review_detailed_main": "This movie is a complete waste of time, energy and money. It you have to, burn your money literally rather than watching this utter disaster of a movie. This movie is a disgrace for bollywood. Film makers needs to learn a hard lesson that we won't accept such horrible movies anymore."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sibaprasadsamantaray",
        "review_rating": "8",
        "review_title": "Good",
        "review_detailed_main": "Movie is awesome Luv it Ananya Pandey. Tiger shroff acting superb"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mahima088",
        "review_rating": "7",
        "review_title": "Its entertaining!",
        "review_detailed_main": "Its really disheartening to see people revolt so much against this movie. Its actually entertaining, Tiger and Ananya have acted really well. Even Tara Sutaria has done a good job. But Ananya Pandey is going to be one big star very soon! Sone scenes with Tiger and his friend gang are so hilarious that the entire hall was in splits! The songs are amazing!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mekaranvarma",
        "review_rating": "1",
        "review_title": "VERY BAD",
        "review_detailed_main": "Just watched SOTY2. Very very bad film. Coming from such big banner is utter surprise. How can such film be even made. Total disappointment. 1/10"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "manthan-18708",
        "review_rating": "1",
        "review_title": "SAY NO NO ....",
        "review_detailed_main": "Do not take a risk its just a fairytale story no reality or logic applied in it so ...a really big NOOOOOOO and ya its 0/10"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mannojs",
        "review_rating": "7",
        "review_title": "Please come back to reality",
        "review_detailed_main": "1 star for all actors, 1 star for all other support staff.\n\nBarely 5% shown is reality, rest all is fake. Using money and fancy life, to lure people will continue gifting failure for such productions. I feel sorry for actors who participate in such films."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "Surender_Yadav",
        "review_rating": "1",
        "review_title": "2.26 Hrs of complete nonsense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "Wanderer123",
        "review_rating": "1",
        "review_title": "I am angry with people who are complaining they wasted their money and time to this movie.",
        "review_detailed_main": "Everybody knew that this movie is total garbage. People who went in theatres to watch it are dumb fools. What did they expect?? I am angry to these fools because of whom garbage like this earns n continues to leave their legacy. Meine toh ye film nahi Dekhi. Or piracy me b nahi dekunga."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "SaanyaChopraDua",
        "review_rating": "1",
        "review_title": "Why did they have to make another Student movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sourishravi",
        "review_rating": "6",
        "review_title": "Student",
        "review_detailed_main": "Tiger Shorf was Lit! Both the heroins were cute enough to keep you engaged throughout the film! The climax kabaddi scene could have been better! I personally liked the film"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "nasreensltn",
        "review_rating": "1",
        "review_title": "The worst movie of the decade",
        "review_detailed_main": "Tiger shroff looks like a monkey jumping here and there. Two girls were kept to dance and skin show off. Do not waste your money on this."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "akshaypataole",
        "review_rating": "1",
        "review_title": "Soty2 is not bad. It is just too boring.",
        "review_detailed_main": "The trailer was bad, but still went for the movie because Tiger. Bad decision. Went with least expectations, just hoping for some entertainment, but the movie has very few moments. You can give it a miss."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mkumarpat",
        "review_rating": "10",
        "review_title": "Love romance,chance and competitive with mates.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "vishalkrishna-00553",
        "review_rating": "1",
        "review_title": "CANCER. DON'T WATCH THIS. SAPRE YOURSELF SOME HEADACHE.",
        "review_detailed_main": "One word : PATHETIC. storyline, acting, songs..this movie manages to disappoint in all the quotas. Don't even consider watching this in theatre. Better yet, don't watch at all. Save yourself from 2:30 hours long disastrous attempt of a movie. Expression of tiger shoroff needs an altogether seperate mention. Yes. That's how bad it is. For the first time, i enjoyed the ads more than the actual movie. Staring at the wall would've been a better experience i suppose. I spent the whole first interval distinguishing the two main actresses. And if any of your friends forces you to go and watch this crap of a movie in theatres, you really should think about getting new friends. That'll be all. Thank you. Have a nice day."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "nikhilgadge-87648",
        "review_rating": "1",
        "review_title": "TIGER SHROFF PLAYED TIGER SHROFF",
        "review_detailed_main": "You will see tiger shroff jumping like u saw in all his movies....TARA SUTRIYA is good but ananya disappointed"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "ankit_sh",
        "review_rating": "1",
        "review_title": "Shame on Bollywood. Shameless Producers & Writers",
        "review_detailed_main": "This kind of movies is a shame on bollywood industry. Old type of drama and things just going on and on. They produce this type of film because we as a indian audience are bunch of stupid monkey's for them. We should stop watching films like this even for one time than these stupid writers and producers will understand the logic of writing and taste of the audience."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "ashurvin",
        "review_rating": "1",
        "review_title": "Watch Kota Factory",
        "review_detailed_main": "The student life you showing in bollywood movie is not look like as you thought. Please, bollywood learn from Kota Factory Tv serial. They are real student of the year."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "agentxyz",
        "review_rating": "9",
        "review_title": "Negative reviews are just because of Hatred towards Nepotism",
        "review_detailed_main": "Honestly speaking, it wasn't a bad movie at all It was quite entertaining Infact The funny thing is I watched it out of curiosity of *why it's being hated so much* and I didn't even find it boring or illogical.\n\n** The same people hating this movie would have loved it if old actors worked in it!!! **\n\n> Good as a one time watch > Kinda motivational plot > A lot better in motivation than SOTY 1 tbh!!!\n\n> Chemistry between ananya & tiger was unnecessary and seemed exaggerated (would have been a better script if they ended up being friends) > Tbh I felt that ananya's acting was better than tiger & tara, first she was portraying a bully, later a friend, and most importantly a lonely girl.\n\n(I know it wasn't very great, i just said better)"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tiaradsouza-04772",
        "review_rating": "6",
        "review_title": "It is an Okay Film, Nothing Great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "divyamagarwal-29931",
        "review_rating": "1",
        "review_title": "Save your ticket money",
        "review_detailed_main": "Donate your ticket money instead of watching this .....aaaaarrrgh this is so much annoying on so many levels you might wanna leave the theatre before the end ,worst movie and even worst acting done by the lead .... It's really that bad save you money even if you are a millennial"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tahska",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "The only good thing about the movie is the eye candy Tara sutaria and she was the best actor among the cast."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "professionalcvu",
        "review_rating": "9",
        "review_title": "Movie is Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "hverma26",
        "review_rating": "6",
        "review_title": "One time watch",
        "review_detailed_main": "Nothing special in this one. Story is weak. Acting and music are average, Tiger does what he does best. The two new girls are there for only glamour. Overall, it's only one time watch. Go without any expectations. Maybe you'll like it."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "emeraldlucky",
        "review_rating": "1",
        "review_title": "When nepotism got its best",
        "review_detailed_main": "When a Karan Johar's movie announced most of the Bollywood movie fans become so excited and waiting impatiently until the release. However, in 2019, Karan Johar's movies became so boring to watch. After a huge flop 'Kalank', there is 'Student of the year 2', which is another flop. From the cast of the movie, the plot, the music, and everything are so boring to watch. The plot is a typical story we always heard of. There is nothing unique, different or interesting. The cast, especially, Tiger Shroff can dance well (we agree on that without a doubt) and he can do the stunts all right. But acting and emotions, he needs to work on that. (Sorry to his fans) Other characters couldn't make any impact on the movie either.\n\nAnd when Karan Johar selects cast for his movies he needs to think about it twice. He should think about the skills, not the parents/relatives of the actors or actresses.\n\nIf someone wants to watch the movie so badly, go ahead. If someone wishes to see a movie which is different and exciting, this is not a movie for you."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "clubmiles",
        "review_rating": "1",
        "review_title": "Karan Johar has lost it.",
        "review_detailed_main": "Probably the worst movie ever. Think it's time for Karan to do something else for a while.\n\nThis movie is pure garbage.\n\nThere is absolutely nothing special about this movie. Everything about this movie is garbage.\n\nTo Karan Johar who the hell have a ring in a kabbadi game? If you are going to do a movie about sport do it right."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rameshramin-98158",
        "review_rating": "1",
        "review_title": "It's not a movie, it's an advertisement for zandubalm..!",
        "review_detailed_main": "If you don't want to waste your time please don't watch it..!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "akbar-saleem",
        "review_rating": "6",
        "review_title": "What were you expecting?",
        "review_detailed_main": "I am not sure about the flak this movie finds itself sorrounded with? What were you expecting? Ripped bodies, branded clothes, flashy cars are supposed to be the order of the day when you walk into a cinema theatre showing KJo's production. Yes, the plot was cliched but that has never been Kjo's unique selling point anyway. It has been and still is glamor. I found the movie entertaining because because of the glamorous visuals. Perhaps the audience needs to temper their expectations with respect to logic in the story. KJo has never indicated that the movie will be a scientific breakthrough!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "zfk-53203",
        "review_rating": "1",
        "review_title": "Constipation of Bollywood's Nepotism : Biggest Mistakes to Avoid Student of the Year 2",
        "review_detailed_main": "Being Student of the Year 2 means your Student of the Year 2 movements are tough or happen less often than normal. Almost everyone goes through it at some point.\n\nAlthough it's not usually serious, you'll feel much better when your body is back on track.\n\nThe normal length of time between Student of the Year 2 movements varies widely from person to person. Some people have them three times a day. Others have them just a few times a week.\n\nGoing longer than 3 or more days without one, though, is usually too long. After 3 days, your Student of the Year 2 gets harder and more difficult to pass.\n\nWhat Are the Symptoms?\n\nYou may have:\n\nFew Student of the Year 2 movements Trouble having a Student of the Year 2 movement (straining to go) Hard or small stools A sense that everything didn't come out Belly bloating"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mannuskyhigh",
        "review_rating": "2",
        "review_title": "Recycled Trash",
        "review_detailed_main": "OK first things first, some reviewers have said that the people who have disliked the film are jealous of Tiger Shroff? seriously? To Tiger's Credit he has done his job well, he's great at dancing and so in fight sequences but is it enough to make a great film? NO ! Sorry We are not in 80's where people would flock in theaters just to watch Amitabh Bachchan bashing a couple of goons. Audiences are becoming smarter and looking for better content.\n\nAnd there's no content in SOTY2. This is a recycled version of the landmark bollywood film 'Jo Jeeta Wohi Sikander'. Just add some random songs, different situations or scenes but the film is more or less the same. The original SOTY was nothing great but Karan Johar knows the pulse of his audience. He knows how to get them in theaters. So he provided the right dose of entertainment, skin show and songs and people somewhat did like the first part.\n\nBut Punit Malhotra is no Karan Johar. He has missed the mark totally. OK I get it that they wanted to throw a fantasy world of students right in front of us which we can accept given if we are really entertained, but where is the content? The reason why Baaghi series work because Tiger does exactly what he's known for. He's loved as an action hero but sorry ! how can he play an action hero while playing a student? And even if he does, the situations are hilarious to believe.\n\nSecondly, both the girls are a waste. I don't understand about the appreciation Ananya Pandey is getting. All I could hear is the word 'duffer' from her mouth atleast 60-70 times in the film. She acts like a papa's princess which can be hardly called great acting. And for Tara Sutaria, oh boy! what were the writers thinking? The poor girl didn't even get a proper developed character so its hard to expect any great acting from her. She switches boyfriends in the film but is never really sure whom and what she wants.\n\nThe actor who leaves some what impression is Aditya Seal but then again even his character is riddled by cliches. Music is a Big Letdown. Not even a single song is worth remembering. Also the film drags in the portions between Tiger-Ananya-Tara. They just don't leave an Impact.\n\nOn the plus side, some scenes do make you laugh and they come mostly from Tiger's gang of friends. The scene at the pub in the first half and the second one when they ridicule Aditya Seal during the opening ceremony of The Dignity Cup. But they are very few and far in between.\n\nProblem of the film is predictability, the same story we must have seen so many times before which is why the audience has rejected this recycled piece of trash and rightfully so. And it's high time our producers should empower good writers who can deliver good stories and directors with better execution"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "virajbharadva",
        "review_rating": "1",
        "review_title": "Don't waste 145min on this film",
        "review_detailed_main": "It has no story, no direction and was only made to glorify tiger's martial arts!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mishraishan",
        "review_rating": "1",
        "review_title": "Paisa barbaaad bc",
        "review_detailed_main": "Watch it if you dont have grey matter. Utter disgrace and pathetic movie."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "deepakdst",
        "review_rating": "10",
        "review_title": "Romantic",
        "review_detailed_main": "Actually what I loved the most in this movie is \"I still think Ananya Panday is Shreya\". She has done a awesome acting. You get totally connected to her role when you watch this film. Else I don't know but this movie is Romantic."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "innocentsarmuel",
        "review_rating": "7",
        "review_title": "Nice and educational !!!",
        "review_detailed_main": "Tiger Shroff came back bigger and better this time, instead of being the superhero all the time, his character was cheated and suffered unrequited love... This movie mirrors the impact of change in environment in a once blissful relationship... Nice movie, splendid casts and well organized and relayed scenes"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "himanshuc-45262",
        "review_rating": "1",
        "review_title": "Please don't watch",
        "review_detailed_main": "Total waste of time. You will not even enjoy your free time if you decide to watch this movie. Beware!!! I would suggest if you see director's name as Karan Johar in any upcoming movie feel free to avoid that."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "ameliayaqub",
        "review_rating": "1",
        "review_title": "Everyone should be jailed (other than Will Smith)",
        "review_detailed_main": "The actual worst film I've ever seen and it begins in the first scene. The script and dialogues are both just as disturbing as each other. Additionally, the casting director should be fired as the two male leads both look as though they're on the wrong side of their 30s."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "ayonbhunia",
        "review_rating": "1",
        "review_title": "Seriously a Duffer !",
        "review_detailed_main": "Oh Man ! What a waste of time ! Pointless movie throughout! Worst acting tiger shroff,he should stick to his gymnastics only and leave acting ! The movie has nothing,nothing at all ! 0.5/5."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mysteriousguardofmagics",
        "review_rating": "1",
        "review_title": "Wait wat",
        "review_detailed_main": "Nvr seen movie but still its existence pains me\n\nWord's the only one who doesn't love a good time to get the latest flash player is required for video playback is unavailable right now because this video is not like"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "jimmy-anirudh",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Never seen anything worse then this. Acting from tiger the only good part rest is all just bad bad and bad"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sh-17244",
        "review_rating": "9",
        "review_title": "Osm movie there is fun action dance everything in this movie",
        "review_detailed_main": "Fun action comedy and dance everything is good in this movie"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "abdulshoeb-62928",
        "review_rating": "7",
        "review_title": "GOOD",
        "review_detailed_main": "Not bad at all as all are saying. Story is predictable but it is good to watch."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "arash-haroonshah",
        "review_rating": "1",
        "review_title": "Stop making stupid movies",
        "review_detailed_main": "Stop making stupid movies, it is a waste of time and your money. Stop using tiger Shroff's abs and athletism for movies"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "saketkumarlal",
        "review_rating": "1",
        "review_title": "waste of time",
        "review_detailed_main": "A complete illogical as expected. In the name of masala entertainment, this movie is a complete waste of time unless or until you have enough time to see tiger Shroff abs and dance moves."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "hardikthakkar69",
        "review_rating": "1",
        "review_title": "Don't waste your money in this type of movie.. Wasted!!",
        "review_detailed_main": "Don't waste your money in this type of movie.. Wasted!!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "Blueyedboy",
        "review_rating": "1",
        "review_title": "As expected.",
        "review_detailed_main": "No script, not good story telling, and worst is acting by stars. Tiger Shroff done even better in flying Jatt. Only plus point was dancing and kabbadi."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "deshmukhatharv",
        "review_rating": "8",
        "review_title": "Entertaining one",
        "review_detailed_main": "I dont know why people are giving so much hate to the movie beacuse the movie is entertaining and good for one time watch it is not as bad as other ppeoples are saying about it ananya pande is very good in her role and tara also acts well tiger shroff is doing the same as he does in all her movie but good to watch on screen"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "utdmangaal",
        "review_rating": "1",
        "review_title": "Nepotism rules!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "oazam",
        "review_rating": "3",
        "review_title": "Dear movie patron, your admission to this film has been rejected.",
        "review_detailed_main": "Dharma Productions is on the verge of having a streak of underwhelming films starting with Kalank and now this one. The prequel has that lightness and overwhelmingness depsite some flaws it had and now the SOTY team decided to go beyond their redemption by keeling a sequel for the audience.\n\nSo the story evolves around a middle class chap Rohan Mehra who scores a seat under the sports quota in Saint Theresa. Mridula a.k.a Mia is Rohan's childhood crush who is also a student there and Shreya, the most popular gal in the institution. Manav is the son of one of the trustees as well as Shreya's brother who has a cold shoulder with Rohan with the ambition of defeating him to become Student of the Year. How Rohan's ambitious dreams come true basically forms the backbone of the story.\n\nWhat was Punit Malhotra smoking before coming up with such a cocaphonous flick? The story was very predictable and too nepotistic because of what power and influence of one person can do to another person who doesn't have these traits. Dialogues were too \"dramabaazi\" meaning too 80's for such a delicate film.\n\nActing had some slight redemption but only for the newcomers.\n\nTiger Shroff acts basically like he is auditioning for a film for the first time just like his other films. Too much fighting and just seeing him kick ass and dance isn't going to make acting a redeeming quality.\n\nTara Sutaria was the only potential figure in the acting department because she had that natural glow of a college student and she was decent throughout the movie.\n\nAnanya Pandey was also decent and she didn't disappoint at all. She had that personality of a popular college girl with snobbiness which is something to look for in a popular gal.\n\nAditya Seal didn't do much besides bullying Rohan throughout the film and same like Tiger Shroff, same identities but opposite.\n\nSamir Soni, Gul Panag, and Ayesha Raza were fine as well but had short roles as they were educational figures.\n\nMusic was very average at best and no song stood out as such although Jawaani was a beautiful recreation but evrything else around was sub-par. Seems like Vishal and Shekhar overthought some things while composing.\n\nCinematography was well executed by Ravi K. Chandran who shot Dehradhun beautifully but transitionally, it was loose in terms of editing.\n\nOverall, too nepotistic and predictable\n\n2/5 - Grading Scale: F -53%"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "iimraann",
        "review_rating": "1",
        "review_title": "Objection to false disclaimer, in the movie.",
        "review_detailed_main": "At the very beginning there is the notice that 'no animals were harmed in the making of this film' but that is totally untrue. 'Tiger' was treated very bad during the entire length of the film. He was beaten a lot ... all the time. Though, thank God it never required any medical attention to be involved, even with the bones dislocated. He was made to jump around a lot, pretty unnecessarily. I don't think he was forced to dance unnecessarily, as he can be seen liking it. The best thing the filmmakers did was to keep him miles away from any study. As a student, apparently everyone wishes for such a year, though we are obviously fearful of repeating the class, but we are happy that these students can have it, due to such a well thought out script."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "ankush-hallan",
        "review_rating": "7",
        "review_title": "Not as bad as the ratings are given",
        "review_detailed_main": "Enjoyed the movie . Not the best but not as bad as the ratings here . Aditya Seal and Ananya Pandey were strong performances in the movie . Tiger and Tara did well ."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tonitinsood",
        "review_rating": "1",
        "review_title": "Yet another dispirited, cliched and formulaic movie from KJO",
        "review_detailed_main": "I went prepared, with low expectations, but came out disappointed. The trick is to go in blank and marvel at the lighting, the decor, the clothes and all the progress technology has made possible. SOTY2 is a new generation movie, a potpourri of characters, glamour, hot bodies and some sizzling dance and song sequences, without the needless story, lyrics or chemistry. There is little if any work done on the latter.\n\nThis movie is a grim reminder on the current spate in bollywood. When glamour, lineage and callousness prevails, substance and depth fall by the wayside.\n\nKJO revels in churning out movies as an industrial assembly line with little, if any changes. But this movie sticks out as a sore thumb, as the basic chemistry between characters appears missing."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "solankimihir-60958",
        "review_rating": "1",
        "review_title": "Modern version of jo jeeta wohi sikandar",
        "review_detailed_main": "This movie is the modern version of jo jeeta wohi sikandar nothing else. Better watch jo jeeta wohi sikandar at home instead of wasting money."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "srshuvo-11260",
        "review_rating": "1",
        "review_title": "1 word , it is 💩💩💩💩",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tjindal90",
        "review_rating": "9",
        "review_title": "don't believe on haters",
        "review_detailed_main": "I Don't know why people are hating this wonderful movie with a good story. If you are soty 1 lover you should go to watch this movie"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "suneelsharad",
        "review_rating": "7",
        "review_title": "Full of Entertainment and Masala",
        "review_detailed_main": "This is a fantastic movie, even better than part 1 and also a pleasant refresher of Jo Jeeta wohi sikander .Must watch for all age groups."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "saurabhyadav-130-41232",
        "review_rating": "1",
        "review_title": "BEST MOVIE EVER!!",
        "review_detailed_main": "No words, amazing movie. Must watch with family and friends. If possible please buy Platinum tickets for DC Extended. Hater's gonna hate 11/10."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "dubeyvbk",
        "review_rating": "1",
        "review_title": "I am crying (save money & time)",
        "review_detailed_main": "The rich as the evil ones - check.\n\nThe middle class as guileless, largely good and at worst, misled by the rich - check.\n\nLoneliness in an upper-class family contrasted with warmth in middle-class family and community life - check.\n\nGlamorous, perfectly made up girls in tiny clothes - check.\n\nEnviably slim female waistlines and legs perennially on display - check.\n\nBoys with muscular, perfectly sculpted bodies - check.\n\nMale biceps and abs perennially on display - check.\n\nBoys who obligingly take off their shirts for our benefit - check.\n\nBoys and girls who look doll-like in their physical flawlessness - check.\n\nSoul - none."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "soma-98013",
        "review_rating": "1",
        "review_title": "Another abomination produced by bollywood",
        "review_detailed_main": "After KALANK another KALANK has been produced by bollywood. This talent of movie making can only comes from karan johar. Every thing is bad about this movie. If you wanna save yourself a torture please refrain from watching this abomination."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "nandan-64272",
        "review_rating": "1",
        "review_title": "Bad very bad",
        "review_detailed_main": "After listening to all negative comments from my friends I still went for it, I am disappointed. A complete waste of time. How many times the public needs to tell Bollywood that we are bored of such movies!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "lillianreza",
        "review_rating": "1",
        "review_title": "Worst movie of the year",
        "review_detailed_main": "The year isn't over yet but KJO is in the lead with Kalank and now SOTY 2 for award of the worst produced movies of the year. There is no new content and the acting is diabolical. KJO is extremely formulaic and hoping to make a quick buck with these movies. He has no shame and is definitely a Kalank to his fathers name."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "margulanabutrlov",
        "review_rating": "8",
        "review_title": "STUDENT OF THE YEAR 2 REVIEW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "beevenkat",
        "review_rating": "2",
        "review_title": "whos the loser",
        "review_detailed_main": "Want to procure the prestigious title of #StudentOfTheYear2? Then u need to adhere to certain rules n regulations. 1-U should belong to the under privileged community. 2-U should be a good sportsman, kabaddi being ur forte. 3-U should take panga with the advantaged, rich stud who owns the school. 4-U should fall in love with his sister, doesnt matter if u already have a lover. 5-U should be a terrific dancer. If u fulfil these conditions, then u r the winner. So whos the loser? The common man who viewed this film. What did he lose? His money, his time, his energy, his sanity. Rating 1/5."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rishabh-43054",
        "review_rating": "2",
        "review_title": "Ouch!!!",
        "review_detailed_main": "Nothing but dharamatisation of the earlier dharmatised SOTY. The earlier movie was bearable owing to its soundtrack and the actors performances with Alia doing every bit to absorb the roles, this part was especially missing in this one. Verdict : Don't spend your hard earned money!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "trishnajaiswalgaya",
        "review_rating": "1",
        "review_title": "Waste of money and time",
        "review_detailed_main": "Waste of money and time,....... Try to save money by simply avoiding to watch... Kjo at his worst ...."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "navjot-07399",
        "review_rating": "1",
        "review_title": "One of the worst movies ever made",
        "review_detailed_main": "Left the teatre after first half. This movie was a torture for my brain. Why cannot bollywood make good movies with actors that can actually act?"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mrinalkalemk",
        "review_rating": "1",
        "review_title": "Rubbish movie",
        "review_detailed_main": "The movie has no plot. They just shot the movie, as if they didn't have a script. There is no role of the actresses. They are just cheerleaders fighting for a boy. The negative guy had a much better role than these two actresses. Tiger Shroff seemed in some kind of martial arts school rather than a normal college. Keep your brain at home if you are going to watch this movie."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "smitajoshi-77723",
        "review_rating": "1",
        "review_title": "Couldn't watch",
        "review_detailed_main": "Figured out in the 1st 10 minutes that it's going to be a bore. Probably would have done well 20 years back when audience didn't have much choice .. couldn't watch more than 1/2 hour ."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tigershroff-43794",
        "review_rating": "10",
        "review_title": "Nice one movie of 2019 my hero is tiger shroff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rishigujral",
        "review_rating": "1",
        "review_title": "THE WORST",
        "review_detailed_main": "Worst movie in the history of bollywood cinema. No story. No plot. No acting. Only fake glamour."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "meowwwsingh",
        "review_rating": "1",
        "review_title": "Request Not To Waste Your Money For This Garbage",
        "review_detailed_main": "If I could I would have given the rating in minus. Worst movie full of overacting and script writer wrote a crap. Go watch endgame again if you want to spend your money this weekend."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "amitit-190-558734",
        "review_rating": "1",
        "review_title": "Very bad movie.",
        "review_detailed_main": "I have watched this movie first day first show, as I am a big fan of tiger...but I have burnt my 250 rs...the worst ever movie of tiger...Ananya looks good...but movie is worst"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mashiukhi",
        "review_rating": "10",
        "review_title": "In my opinion",
        "review_detailed_main": "That's perfect 👌. It was so romantic,comedy with a good story This film had Two beautiful girls and attractive Indian dance."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "hardikprajapatitiger",
        "review_rating": "1",
        "review_title": "A big tatti!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "souraj-raha",
        "review_rating": "1",
        "review_title": "Not even worth 1 🌟",
        "review_detailed_main": "It's completely garbage wrapped in marble paper. Absolutely waste of money and resources.... pathetic story, awful acting, people shouldn't be allowed to make such crap.."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "wildlife-ptech",
        "review_rating": "4",
        "review_title": "Intermittently entertaining time waster",
        "review_detailed_main": "Rating\n\n4/10\n\nPart 2 in the SOTY series is an intermittently entertaining time waster. Script is absurd as expected. Shroff is athletic and agile but hardly shows any expressions. In fact the young cast mostly disappoints with the exception of Pandey in her debut feature."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "miahtitul",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "This movie was better then the First one but they could've made it better . I had fun time watching the movie . All the actors did a good job. I suggest you to watch the movie yourself I'm sure you will have a good time watching it"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sionabosefdpsm",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "shibucyprian",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "I do not know why people dislike this movie. This is really a good movie to watch."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "pranaypardeshi",
        "review_rating": "1",
        "review_title": "Waste",
        "review_detailed_main": "After watching this movie, i felt guilty for watching this movie. total tatti performance by strugglers."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "amaanamjad-31664",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Even though i did not see the movie its trash. Dont watch it, every thing that has to do with karan johar & Tiger sharoff is trash."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "jadvani12",
        "review_rating": "1",
        "review_title": "KaranJo & Shirish are competing for making worst movie of decade",
        "review_detailed_main": "It is rated 1 and there is nothing good to talk about this movie except One song from Arijit Singh. 1 point is only for that song.. Movie does not even deserve one star.."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "adityarajsinghgour",
        "review_rating": "5",
        "review_title": "Really bad direction",
        "review_detailed_main": "Very far from reality.\n\nWaste of time and money.\n\nDon't watch."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "3",
        "review_title": "Full dabba gull",
        "review_detailed_main": "No need to say that this is a trash. Gave 3 stars for some of tiger's fight sequences and styling of the movie.\n\nActual rating-👎"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "iSatchit",
        "review_rating": "3",
        "review_title": "Please avoid this crap",
        "review_detailed_main": "Anyone planning to see this please avoid....I repeat please avoid. One of the worst movie of the year. Has nothing which can pe appreciated."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "Hazel_T",
        "review_rating": "1",
        "review_title": "Pls trust all the critical reviews here!",
        "review_detailed_main": "Happy to meet the next generation , confused , all over the place, infedility and do every other extra curricular activity but be a student and study 😀! KJO this is your best in the worst category ! And yes no one needed to act, such a faltoo movie , everything seem to have come naturally. C'mon yaar, do well and spend money and time in producing quality and value to this world."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "krn-51055",
        "review_rating": "1",
        "review_title": "Should stop making movies like these",
        "review_detailed_main": "Cringe and illogical. Doesn't make any sense. Worst script"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "manojiskala",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "Worst,bad ,not good, waste if time and money Bad acting worst direction,bad screenplay"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mohithiphop",
        "review_rating": "1",
        "review_title": "Its a HEADACHE !! MOHIT DHAWAN REVIEWS",
        "review_detailed_main": "I am tired of watching the same old story again and again.I think Karan Johar should spend more money on finding good script writers rather than focussing on item songs and sets. Hands down one of the Worst movies of 2019 along with KALANK.\n\nMy Rating - 1/10 😢😢😢👎👎👎\n\nRegards Mohit Dhawan Reviews"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "zahabiyagheewala",
        "review_rating": "10",
        "review_title": "Entertainment",
        "review_detailed_main": "This moive is very nice and entertaining pls go watch it it's lovely 💕❤"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "PrakashNarayanan",
        "review_rating": "1",
        "review_title": "BORING",
        "review_detailed_main": "No soul. All the characters makes film utterly boring. Story is also too shallow and with no sense. Tiger is mocking audiences in the face. Very very bad 1/10"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "chillchamp",
        "review_rating": "5",
        "review_title": "Not good as expected",
        "review_detailed_main": "Tiger and Tara are not students Ananya is looking good as student Movie script is really crap Varun and Abhi and shaneya were really looking like students somehow\n\nOverall :: not worth to watch it on cinema"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "deshingamit11",
        "review_rating": "10",
        "review_title": "DON'T MIND THE DUMB PEOPLE WHO ARE GIVING 1 STAR",
        "review_detailed_main": "Honestly this movie is what it should be. It's a student* movie for God's sake. I really don't know wtf others were thinking how this movie should be. THIS MOVIE IS A MUST WATCH. It gives you school/college vibes. I'll recommend you all to watch it unless you want some mature stuff. Kindly read the word *Student* in the movie name and then give your views. :)"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "pbodakhe",
        "review_rating": "1",
        "review_title": "Bollywood nepotism",
        "review_detailed_main": "Worst movie all time no acting and even worst story. The movie only has dance and action. Over all the movie is very very worst"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "apabhishek-56901",
        "review_rating": "1",
        "review_title": "PLEASE REFUND MY MONEY",
        "review_detailed_main": "No story No acting.. The only positive of the film was Ananya Pandey 🌠"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "yaminiarora",
        "review_rating": "1",
        "review_title": "Can I give zero stars?",
        "review_detailed_main": "IMDb- feature request. Please add an option to give zero stars or take off stars from a movie's rating. The only good thing was will smith and but was too brief for me to consider any more stars, I wish he was there longer. Only actor I liked a little bit was Manav(the name of the character for the guy who played ananya's brother). All other leads are Meh! And I thought Kalank was Karan Johar's lowest point (lol)"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "fredrickhilarian",
        "review_rating": "1",
        "review_title": "Trash!",
        "review_detailed_main": "This movie is trash! Don't waste your time watching it!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mus-35663",
        "review_rating": "8",
        "review_title": "Entertaining movie.",
        "review_detailed_main": "Humor was good. Story was predictable but not boring. Overall a good entertaining movie."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "priyankadhikyawar",
        "review_rating": "2",
        "review_title": "This movie is a mess",
        "review_detailed_main": "Everything about this movie is so pointless newcomers didn't get the time to learn acting skills from their godfather and the star tiger Shroff has ruined his career by choosing this movie"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Folks in India hated this film. But if you're not Indian, will you hate it as well?",
        "review_detailed_main": "There are quite a few wonderful Indian films...so I know this movie-making powerhouse can make marvelous films that are every bit as good (or better) than the stuff coming out of Hollywood. So, why is it that despite the Indians making many marvelous films did Netflix purchase the rights to several recent Indian movies which are on IMDB's ignoble Bottom 100 List?! Who buys these movies? And, do they deliberately look for bad Indian films because they can purchase the rights for very little money?!\n\nI must admit right off that I never saw \"Student of the Year\". It has a below average but not terrible overall score of 5.3....not bad enough to appeal to me and my quest to see all 100 of the Bottom 100 List! But the film came out seven years earlier and the two movies aren't really related...so skipping the first is not a bad thing.\n\nOne of the things I noticed about the movie, and it wasn't the fault of the production crew but Netflix. The film is, of course, subtitled for English speaking folks...but NOT the songs! And, in most Indian movies, the songs are big and important production numbers that tell a lot about the plot. Boo Netflix for omitting these captions!! The sad part of all this is that the dance numbers in the film are amazing...even by Bollywood standards...a major plus for this film.\n\nRohan (Shroff) has dreams of winning some competition at school in order to be named 'Student of the Year'. Then, he hopes, to get the girl of his dreams. But there is competition...in particular rich guy Manav, who SEEMS like a really nice (and handsome) guy, seems poised to win. Can he manage to beat the seemingly unbeatable Manav and the rest of the students to win this coveted title? And, will this get him the love he hopes it will bring him?\n\nMany of the tropes in this film are familiar to Indian films. My favorite of these is the silly part where the woman appears...and suddenly a wind machine hits her and her hair blows...while NONE of the people around her has this happen. And, it did it twice. The first time, Rohan was dreaming and he saw her this way. The second, when she appeared for real in the movie. Another trope, and one I really hate, is that one of the characters is very stuck up and nasty...and changes by the end of the film. This was the case with Shreya. Another is the dopey looking sidekick for the hero...and in this case it's a short Sikh. And yet another is the slow motion...lots of slow motion. And, while these tropes are silly...they are common to many Indian films...so this cannot be why Indians hated this film. I think the real problem is that Rohan is a jerk...and that is NOT a trope anyone could enjoy. And, I found myself rooting against him...something the filmmakers did not intend to have happen. And, I also found myself rooting against pretty much everyone...again, I don't think the filmmakers intended this either!\n\nOverall, I did NOT hate this movie like the average Indian did. The production values are very high, the dancing is amazing and it's not that bad a film. Now I am not saying you should rush to see it...but you could do worse. Plus, so many films that never made IMDB's Bottom 100 are so much worse than this one. Bad in some ways, just not at all terrible.\n\nBy the way, for absolutely no reason,at about 53 minutes into the movie, Will Smith appears for a few seconds during a huge dance number. He looks like he has no idea why he's even there! I'd like to know more about this!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "VishnuprasadKmenon",
        "review_rating": "1",
        "review_title": "Worst of worst",
        "review_detailed_main": "No need to see this, the worst of worst movie, I don't watch till end, that much boring, waste a complete waste movie, why should they make this much bloody movie.."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "devikacaa",
        "review_rating": "3",
        "review_title": "BORING",
        "review_detailed_main": "TTER WASTE OF TIME . well what was I expecting, this movie had tiger sheroff in it so maybe some action but no ! waste of time and energy . had to fight with sleep so as to watch the whole movie."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sapanasep",
        "review_rating": "1",
        "review_title": "Great CV for freshers in bollywood entry, but pathetic movie",
        "review_detailed_main": "Student of the year 2 review :\n\nThis movie is nothing but the curriculum vitae of the freshers who are looking for a job in the film industry..\n\nTiger Shroff is marvellous and he is doing actions or dance in most of the frames and he does his job pretty well. Actresses have gotten dance sequences , romance sequences , emotional scenes , frowns, comedy .. basically they have shown they can pull of any scene.. and if you have seen Student of the year part 1, then you realise these girls are far better than Alia as a fresher..\n\nWith absolutely no story.. scenes are made up just to show games or dance sequences.. the young generation won't be disappointed with the movie.. ( basically target audience)\n\nI enjoyed Tiger Shroff's part only. He is such a talent. I hope one day he gets his due in Bollywood."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "manasmahanta",
        "review_rating": "1",
        "review_title": "Utter nonsense",
        "review_detailed_main": "Made Soty 1 look like a good movie which was waqt hamaara hai reloaded ."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tusharr-37967",
        "review_rating": "1",
        "review_title": "Bollywood movies standard are going down",
        "review_detailed_main": "What Bollywood think if they hire beautiful actresses without good story thier movie will get hit.Student of the Year part 1 is far better than this"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rushabh-89319",
        "review_rating": "5",
        "review_title": "Not that much bad as reviewed",
        "review_detailed_main": "Surely One time watch... Will not be bored... Enjoy"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "sakalaka-20264",
        "review_rating": "5",
        "review_title": "Dear Karan Johar",
        "review_detailed_main": "I saw this movie because of Tiger... I can't understand what types of brother & sister relationship between Shreya & Manav!!! They spoke only one time in this whole movei(surprise)... Karan Johar you could not use the characters correctly🙏🙏🙏"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rehmankhilji",
        "review_rating": "5",
        "review_title": "Jo Jeeta woh Sikandar inspired.",
        "review_detailed_main": "Yes the movie is better than part 1. In first edition everyone is rich, the poor are rich even and rich are super rich. But at least here they have shown a difference. Tiger shroff being from a middle class has not be shown wearing expensive stuff etc. But the movie was too inspired from Jo Jeeta Woh Sikandar, competition style and all. But then again it was better than part 1. From the first edition stars like Alia Bhatt and Varun Dhawan were born (Sidharth Malhotra was / is not even close to be an actor) and from this part it's Ananya Panday, simply wonderful and beautiful. Tara Sutaria, disappointing, need to take acting class, place some expression on her face, one look through out the movie. Tiger shroff being himself, Gul Panag should not been even place on the cast list."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "psjisback",
        "review_rating": "5",
        "review_title": "Good Mindless Entertainment",
        "review_detailed_main": "Pros - Songs Background music Tiger and Ananya Subtle comedy Blur boundaries of villain\n\nCons- Story and suspense during game could have been better."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "deepak-68297",
        "review_rating": "5",
        "review_title": "Nice Movie, don't compare with SOTY1",
        "review_detailed_main": "Superb sets nice music costumes , Tara Ananya Rock's, Tiger in fresh role, scrip story gud,"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "Little India Directory Review: Student of the Year 2 (3 Stars)",
        "review_detailed_main": "There's a special type of courage so far unknown to the movie-going public that will be required to bear this imaginative piece of mega nonsense by Punit Malhotra who tries and succeeds to stray away from logic and realism in Student of the Year 2 that it will be impossible to go back to mindful comedies in this franchise. There's no going back from this.\n\nIn an over-the-top setting where a bunch of high schools lock horns with each other for an inter-level sports competition pretentiously titled 'Dignity' where the best player from the winning school's team will be throned as the 'Student of the Year', director Malhotra's characters are the unabashed, self-proclaimed stars. He has Tiger Shroff as the typical boy next door with a lower middle-class background and a dream to fulfill the dream of his uptight and arrogant girlfriend (Tara Sutaria), all of which will give you a heartache. Another two of his dreams is to get that throne in the sports competition and get admitted to the college of every student's (reel + real) dream. A college where academics do not exist. And where instead exists people like the obviously arrogant incumbent Student of the Year (Aditya Seal) looking to hit a hatrick this time and an equally arrogant, daughter-of-the-trustee (Ananya Panday) who wears couture and who would barf at the idea of flying coach. While Seal's and Shroff's characters compete with their abs and looks, Panday's maverick presence makes up for unwanted idiocy. Each of these characters, along with a few essential supporting ones like Shroff's and Seal's on-screen friends, and faculty who never touch a book or a blackboard, throughout the 150-minute ecstasy-filled colouring competition further make this is a blunder of Himalayan proportions.\n\nThere's so much colour in Student of the Year 2, I thought I was looking at a fashion show from the future. Shroff's character, currently just managing to make his ends meet, uses DIY techniques to style his threads but in the next sequence they are as good as to be used in walking the ramp. Every single character - including the extras - wear fashionable clothes that had me sitting in the theater wearing PJs and a loose tee, making me want to approach the style partner and say hello. Unfortunately, the film quickly scrambles to show you ads for Subway and a chips brand (Too Yumm!), which is slightly irrelevant considering they are pushing fashion textiles for the most parts. So I lost track.\n\nShroff flexes, jumps, leaps, flies, and sometimes falls flat on his face in Student of the Year 2 and there ends his performance as this aspiring young man who does not look one bit his character. While Panday and Sutaria do qualify as kids, their performances are strained at best, failing to add the charm that was present in the lead actors of the 2012 prequel which had more panache, pizzazz, romance, and fun. Harsh Beniwal as the designated joker and Seal who puts up an attractive show as a villain at the age of 17 should have won the award if there is ever one that celebrates worthiness. The little humor and the hunger for passive vengeance that is brought out by these characters are the only saving grace in this otherwise slipshod treatment of exaggerated high school life that is 3-fold worse than anything you have seen of this type in Bollywood, including Farah Khan's Main Hoon Na! (2004). During the viewing, I did wonder why Malhotra and his chums did not take a look at international films. Maybe a scene at the detention center or a professor actually teaching a concept in the background would have made me hopeful instead of a frame showing students sitting in a packed class and other where two characters assemble at the principal's (Samir Soni in a 50% comic role) office so that they could add some family drama into the mix.\n\nBut what poses as the biggest threat for this musical comedy drama's success is its waferthin and illogical plotline. The turns that it takes - with the women taking sides, blabbering to show they are cool, unbelievable sports performances with Kabaddi looking like a wrestling match - Student of the Year 2 goes overboard in everything that it tries to showcase. And it probably takes great pride while accepting that they are into exaggeration. Unfortunately for the audience, it does not work; neither in entertaining not making us aspire to be like these overzealous, fake characters. There's so much going on in student of the Year 2, it becomes difficult to keep track, with plot arcs often defying logic or continuity. It slowly turns into an unbearable piece of content that you would immediately want turned off. Since you chose to view it on the big screen, the only solution is to walk out.\n\nWhether it is the physique that Shroff has maintained or that Malhotra failed to digitally edit (like they did in Aanand L Rai's awful Zero (2018)) or that none of the songs inspire fun are some of the other factors that make this experience not worth your money or time. The film throws challenges at you one after another, treating you like a kindergarten kid who will clap and jump at everything glitzy and noisy. It is for that reason that I do not recommend Student of the Year 2. If you really like high school romance films, try the prequel and then forget about the genre in Bollywood unless someone more talented and experienced people than Malhotra come on board. But that's an ironic statement. Both Malhotra and writer Arshad Sayed (who surprisingly also gave us the fantastic Dasvidaniya (2008)) are to be blamed for taking this idea from Karan Johar and dismantling it, butchering it into a product that looks tasty and good, but is poisonous if you consume it. We need to stop promoting this cannibalization of the industry.\n\nSometimes there has to be a little realism or logic or even a bit of genuine emotions in the proceedings to justify a fantasy so ridiculous as this, but I guess that is something you already knew. Student of the Year (2012) at least had a mention of academics. And 7 years later, even as education boards in India dole our 100/100 to their top students, a film comes with a tag of nepotism without a second of studies that should have been fittingly named \"Spoiled Brats of the Year\".\n\nSave for the 5-second performance of Will Smith that you may miss if you don't pay attention to the half a dozen opposite-of-glee songs in Student of the Year 2 and a few one-liner jokes by the breakout star Harsh Beniwal (whom I would like to see as the lead if they ever make Student of the Year 3), this one here will tickle your fantasies that are best left untickled. Do something better with you time if you don't want to go window cloth shopping. TN.\n\nOriginally appeared in the Little India Directory (Singapore)."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "shelkeprafulla",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "Tiger Shroff is really good in the movie. Don't know why people are giving only one star. I had already booked tickets 3 days back. So I gone though the reviews and thought that it will be a disaster. In reality, movie is not bad at all and is really entertaining. I will recommend people to watch it once."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tawsifamin",
        "review_rating": "5",
        "review_title": "Still better than the first one",
        "review_detailed_main": "Average movie. Definitely deserves 4/5 stars at least. 2 new comers acted very well. From my personal view it is better than Student Of The Year (2012)"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "as-20804",
        "review_rating": "5",
        "review_title": "Worth to watch",
        "review_detailed_main": "It was fun and entertaining movie.Strong dances and beautiful locations.Overall time pass movie"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "creatorankit",
        "review_rating": "1",
        "review_title": "not that bad",
        "review_detailed_main": "It was meant to be a popcorn-have fun kind of movie and it was,just don't hate because it had starkids.Tara can't act at all,Ananya still makes you feel for her,Tiger is good at what he does,Beniwal was funny as usual."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "jasmeetsingh-43413",
        "review_rating": "2",
        "review_title": "Didn't like the movie at all",
        "review_detailed_main": "Tiger Shroff is gud but script is poor. also new actresses Tara and ananya are poor. Punit Malhotra second film I watched after I hate luv story. And this is worse than that."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rajknlrajknl",
        "review_rating": "1",
        "review_title": "Ananya Panday",
        "review_detailed_main": "Movie is not that good but really enjoyed watching Ananya Panday. That's she who made me watch whole movie without getting bored."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mattvtm12",
        "review_rating": "9",
        "review_title": "Better than SOTY 1",
        "review_detailed_main": "I dont know why there are so many bad reviews. i just saw this movie today. i Agree there was no deep story in here. story was about a guy(Rohan - Hero) who had a goal to get his girlfriend so he joined her collage but they kicked him out because the rich guy doesnt like defeat. and Hero was betrayed by the girlfriend. so he went back to his old school to show who can be the student of the year. Obviously thats the title \"Student of the year\" he did everything he can in every academic activity to show he is the student of the year...so i dont know what other story is everyone expecting from the title \"student of the year\"\n\nin my opinion, its not a bad movie, a good entertainer. Love for the girl he chose at the end - didnt show much chemistry between them on the screen. TIger - compared to all his movies he acted much much better. looking back from Heropanti to this movie and baagi 2.....He came long way. i dont think its fair for you to put down someone who came this far. Both girls - did a fair acting. i dont think anyone did bad acting in this movie.,"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "SBcriticImdb",
        "review_rating": "1",
        "review_title": "STOP IT!! By far the most cringiest movie I have ever seen.",
        "review_detailed_main": "Tiger shroff acting 4.5 Tara Suraria acting 4.5 Ananya Pandey acting 2.5 Supporting cast acting 1.5\n\nDisgusted!!! Everything about this movie is so bad. This director should never be aloud to make another movie ever again. What was Karan Johar thinking producing this movie. The reason people relate him to nepotism is because of these situations. Supporting Tiger and Ananya because they are celebrities kids is what nepotism is about. Karan needs to start producing new actors/actresses who aren't already privileged. I've seen a lot of tiger shroff movies. He just doesn't have the lead actor persona. But becuase he is the son of Jackie shroff he gets and demands that respect which is also nepotism. In Hollywood you don't have that happening because actors are respected becuase of their talent. Tiger has given flop after flop and he's still doing lead roles because of this nepotism in Bollywood. It's not that Tiger doesn't have any talent. Tigers dancing and physique are amazing. He definitely worked hard on both and his talent as a dancer is one of the highest level in Bollywood. If he continues acting I think he should consider doing supporting roles. The casting was bad. But then again everything was bad.\n\nNot recommended!!!!!"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rinugp-70390",
        "review_rating": "1",
        "review_title": "Worst movie of the year 2",
        "review_detailed_main": "Please don't watch even if free...it's comedy scenes look like they are made for kids 10 year or less..I was searching who is the director to write some advice..and Karan Johar he is lost..."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "www-aktomer",
        "review_rating": "4",
        "review_title": "Waste of time",
        "review_detailed_main": "Not better then the first one, but atleast it has a story. Bad acting, unrealistic situations in the story, full of first-world problems. Better go and sleep at home than to waste your time and money at theater."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "princerex-34321",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Movie made me feel motivated. And Love You ananya."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "theayshamalik",
        "review_rating": "1",
        "review_title": "Really bad",
        "review_detailed_main": "Do yourself a favor: DO NOT watch this movie. Your eyes and ears will bleed of the amount of flop... This is the worst movie my family and I have EVER seen hahah. It is so bad that it almost becomes funny. It's a waste... Looks like something with a high production value. Such a waste of money and resources.\n\nJust to be more concrete:\nNo acting skills in sight\nReally unrealistic fighting scenes\nThe movie makes no freaking sense. There is no structure nor timeline. Words can't describe how bad this movie was. Hope I've helped you spare your time."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mukulrajkaushal",
        "review_rating": "1",
        "review_title": "Another embarrassing,dull and devoid of content movie from Bollywood",
        "review_detailed_main": "There is no reason to watch this movie. Full of overacting,cringworthy dialogues and monumental waste of crores of rupees spent on making this excrement. The REAL college students must be going ROFL after watching this movie. This movie has everything except the actual college life in India. What amuses me is that the lead actress in the film calls \"The Godfather\" as one of the most overrated film. Won't recommend it anytime."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "IPyaarCinema",
        "review_rating": "4",
        "review_title": "Forgettable Campus Romance",
        "review_detailed_main": "Director Punit Malhotra ensures that a lot of drama and action remain out of the classroom, with focus on sports, dance and romance, not that the new age campus kids will complain. However, the chemistry between Tiger and the two debutantes doesn't quite warm your heart. And while it comes seven years after SOTY, the writing doesn't seem to have come of age.\n\nTiger Shroff is good when it comes to dancing and action but a little less in terms of acting. Ananya does a good job as the rich and spoilt Shreya. Tara Sutaria who plays Rohan's girlfriend Mridula has a lukewarm personality, but Ananya , who is cast as mean girl Shreya, has an X factor that pushes its way past the layers of gloss in SOTY 2. Aditya Seal is great in the action department but has nothing much to contribute to the film."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "nikitaagarwal-20926",
        "review_rating": "10",
        "review_title": "Loved the movie..full of fantasy",
        "review_detailed_main": "Fantasy is fun. Reality we always see in real life. For entertainment fantasy is the best thing to keep mind light. KJ keep making movies."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "dilinikaushalya-52963",
        "review_rating": "1",
        "review_title": "OMG Cringe AF",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "mtamoor94",
        "review_rating": "1",
        "review_title": "kachray ko bhi zyaaaada vote miely gay!!!!",
        "review_detailed_main": "Just one word for this movie = worst of the worst movie ever made Don't even try to watch it."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "debudebabrata",
        "review_rating": "1",
        "review_title": "Bad Ending....Climax was wishy-washy.",
        "review_detailed_main": "Expected a better movie...But bad direction, acting, story made it a 1 rating."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "eldreddsouza",
        "review_rating": "1",
        "review_title": "The worst of the worst ever created.",
        "review_detailed_main": "I'm serious. Not joking when I say that this movie belongs in the trash. The final cut which would then be used to make copies for distribution really belonged in the trash can. And not just any. But in the wetland where no one would dare to go to salvage it. Or rather it be burnt by an intern there who just took up smoking because of the pressure created by the mental folks involved in making this garbage.\n\nThis is a nepo feast galore. Somehow, the lead who is an outsider happens to be worse than the former. The screenplay, story and direction doesn't help. They're all worse tier. I cannot express enough how much disgusting this film is. Really, the makers should've been banned for coming up with something like this and taking the audience for granted. I wish it had come out today. The audience would show them their place and where their movie belongs. In the trash."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "kmtbbqjgth",
        "review_rating": "1",
        "review_title": "Pathetic and boring to the core",
        "review_detailed_main": "Horrible movie. I can't fathom why they even bothered making it. It seems like the producer and director binge-watched Jo Jeeta Wohi Sikandar and a few other 90s college movies back-to-back, then thought it was a good idea to cast aged actors who look nothing like college students. The result is a disaster: an idiotic script filled with cringe-worthy dialogues, zero comedy, and painfully bad acting. The storyline is so weak and predictable that it feels like a waste of time.\n\nThe only silver lining in this mess was the song that played during the end credits, where Alia Bhatt and Tiger Shroff managed to create some chemistry with their dance moves. But even that couldn't salvage this wreck of a film. The performances were mediocre at best, and the poor script turned the whole experience into an ordeal. It's hard to believe this project ever got greenlit."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "omaimaamri",
        "review_rating": "10",
        "review_title": "Students",
        "review_detailed_main": "I Liked the story !! Actually i loved these cuties girls ! Their beginning is good"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "Abhayimdb",
        "review_rating": "9",
        "review_title": "Loved the film - Full Entertainment & Must watch",
        "review_detailed_main": "A complete different story and no connection to Part 1 of the student of the year.\n\nFull Paisa wasool and Entertainment just enjoyed this film.\n\nEveryone should watch this. It's awesome"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "yoyohoneysingh-81683",
        "review_rating": "10",
        "review_title": "Everyone in my home like it",
        "review_detailed_main": "It is an emotional movie for kids I like it because I have not seen student of the year"
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "rahimankingkhan",
        "review_rating": "10",
        "review_title": "TIGER SHROFF fans😎",
        "review_detailed_main": "Tiger shroff bro rocked with his dance and stunts as always he... I can't rate it even a bit lower as I am a die hard fan of Tiger shroff... But it worths for 5/10. Both Debut actress are poorest in acting... Don't criticize them as they are new to the industry... Do encourage the whole team, especially lovable and industrious Tiger shroff."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "taruviki",
        "review_rating": "9",
        "review_title": "Nice enjoyable movie",
        "review_detailed_main": "Not sure why all the hate .I found the movie very enjoyable .who cares if they are star kids or not ,they do as good a job as non star kids .anyway I liked the movie a lot .Ananya stole the show I think ."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "aliyah-16125",
        "review_rating": "10",
        "review_title": "Fantastic film",
        "review_detailed_main": "I watched this with friends expecting this to be terrible as all the reviews were bad and it had a low rating. After watching it, I was pleasantly surprised of how good the movie was. I enjoyed every second of it. The acting was really good, the visuals were stunning, the storyline was cliché but it was still good. The dancing was questionable at points but it doesn't take away from the overall effect this movie had. It gave off a good message to follow your own dreams rather than following someone else's and putting them first. Near the end, this realization made a huge difference as the outcome was magnificent. The action scenes were filled with thrill and action. The character Rohan had a very nice body and it was fun to stare at throughout the movie."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "vaibhav-patel12468",
        "review_rating": "8",
        "review_title": "Entertainment entertainment entertainment",
        "review_detailed_main": "Pure entertainer masala movie kjo style. I didn't get bored at any point in this movie except 2 songs otherwise it's a great fun."
    },
    {
        "movie_id": "tt7255568",
        "movie_name": "Student of the Year 2",
        "movie_rating": "2.2",
        "review_username": "tahmid-saad",
        "review_rating": "",
        "review_title": "I am looking for a 00 RATING!",
        "review_detailed_main": ""
    }
]