[
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "secondtake",
        "review_rating": "6",
        "review_title": "Not half bad and lots of small quirks that will make you smile",
        "review_detailed_main": "Doctor Dolittle (1998)\n\nI was surprised to see this movie got such a low rating—it's not so bad. Oh, for sure it's not so great, either. But Eddie Murphy alone makes it something worth watching (he's one of the few perfect-pitch comedians out there). And the story, a 1920 classic for children, is something of its own.\n\nWhat falls apart is the slightly pushy sentimentalism and the generally mediocre secondary cast. That might be enough to push it into mediocrity, for sure, but it's not meant to be a deep classic, and it plays with the story nicely.\n\nThat story is not just about a doctor (of the human type) who can hear animals talking. It's more about how society condemns hims and tries to help him with psycho-care. His bland wife (with the gorgeous eyes that get overplayed) is typical of his \"friends,\" all nice people with distractions and no time for the possibility that he might, in fact, hear animals talk.\n\nThe talking animals are of course great fun, from the rats to the tiger. This is the part of the movie that is meant to appeal across the board, and it does, including its good special effects. The feeling of family, not dysfunctional, is another bit of warmth, not to mention that the family is African American, a nice twist on the original story based on an English doctor.\n\nAnd though the movie was not liked by critics, it has made a third of a billion dollars, which speaks for itself. Not a masterpiece, and not even a classic, it still has wonderful aspects including a very wonderful basic concept."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "Not brilliant by all means, but a nice watch",
        "review_detailed_main": "I have seen a fair few comparisons to the 1967 film with Rex Harrison, now I saw the 1967 film as a kid and kind of liked it but it is something I need to re-watch. This film is basically a remake, minus the songs, and while it isn't brilliant and no masterpiece in any shape or form, it does have its good things. The film's plot is very slight, and the script has its weak spots while having some funny ones as well. And there is sometimes uneven pacing and direction. But it is nicely filmed, and the music is nice enough. The acting was also pretty good. Eddie Murphy does a serviceable job as John Dolittle, his role is not really like the ones he had in Beverly Hills Cop or Trading Places which also happens to two of his better movies, but he does well, and I will say he has been worse and he's been in worse films too. Kyla Pratt looks lovely and acts nicely as Maya, and Ossie Davis is good as well. The voice cast carry the picture as the animals who (along with the above average effects) steal the show. Consisting of the likes of Garry Shandling, John Leguizamo and Gilbert Gottfried they do great jobs, however Oliver Platt and Peter Boyle have little to do. Overall, a nice watch but nothing exceptional. 6/10 Bethany Cox"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "nice family movie",
        "review_detailed_main": "Dr. John Dolittle (Eddie Murphy) can talk to the animals. He used to talk to his dog as a kid, but his father forced him to stop and sent away his dog. He has denied his ability ever since, and is now a family man and a doctor. Then he starts hearing voices from animals.\n\nNorm MacDonald does a great voice as the dog. It would be better to have a buddy comedy with the dog. Eddie Murphy has good chemistry with him. The other outstanding voicework is Chris Rock who does the gerbil Rodney.\n\nIt's a generally a nice family movie with some crude humor. It works on that level. Just don't expect more. The potty humor may offend the parents, but there isn't anything to be concerned about."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "slightlymad22",
        "review_rating": "",
        "review_title": "Murphy Had Reinvented Himself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "Love the shellfish....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "minnow-6",
        "review_rating": "7",
        "review_title": "To his credit Murphy let's the animals have their say while he plays straight man to their lines",
        "review_detailed_main": "`Doctor Dolittle'. ***. (1998, USA, PG-13, 85 min. Directed by Betty Thomas with Edie Murphy, Ossie Davis, Oliver Platt, Richard Schiff, Kristen Wilson, Kyla Pratt). John Dolittle (Murphy) can talk to the animals and they can talk to him. At least he/they could when he was a kid. His dad thought he was nuts and though the use of an exorcist and some stern fatherly persuasion John looses or suppresses his talent/curse. When we next see John, he is Dr. Dolittle, M.D, happily married, father of two girls. He's a respected partner in a very successful medical practice and is about to become very rich. He and his partners are about to sell to an HMO. Everything seems to be going great until Dr. Dolittle almost gets into a car accident with a dog. A bump on his head brings back the voices. Is he going nuts, are life's stresses too much, or does Dr. John just need to find his inner child?\n\nThe rest is a rather silly man-gets-in-touch-with-soul type movie, except for the animals. They have all the good lines. There's the lascivious German shepherd that can't control himself even when he's pleading his reformation on the way to being clipped. The pigeon couple; she's a nag, he's a wimp. There are the quarreling rats, the neurotic terrier, the tiger, and of course Lucky, the dog Dr. Dolittle hit in the car accident. To his credit Murphy let's the animals have their say while he plays straight man to their lines. One other thing about Murphy's acting; Dr. Dolittle is not the least bit comfortable around animals. When Dr. Dolittle has to catch daughter Maya's (Pratt) guinea pig, he holds it in a folded pillow so he doesn't have to touch it. (Having similar feelings about pets, I was amused by Dr. Dolittle's behavior around animals.) What's funny about this is, apparently Murphy wasn't acting. But this all added up to a fun movie. I recommend it."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "m_madhu",
        "review_rating": "5",
        "review_title": "animals steal the show",
        "review_detailed_main": "eddie murphy is incredibly funny again. the animals are funnier still. infact the whole thing is so believable and has the magical quality that makes a kids' movie so endearign.\n\nso why the low rating? cos its so very crude!!! too crude for a kids & family movie. even when u laugh, u feel guilty about it, esp. when kids are around.\n\nheres a good story gone bad, sadly part 2 is worse. would have been a brilliant movie in the hands of disney.\n\nmaybe disney should be given the monopoly on kids' movies on a platter. or maybe along with dreamworks, theyve been real good too, so far :) 20th century fox should stick catering to adults.\n\nan average 5"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "6",
        "review_title": "\"Doctor Dolittle\" does a lot with Chris Rock",
        "review_detailed_main": "OK, so \"Doctor Dolittle\" is mostly stuff that would only appeal to little kids, but it is worth seeing (I've actually never seen the original version, which I heard was a pathetic excuse for a movie). Eddie Murphy is, in my opinion, trounced in the movie by Chris Rock as the out-of-control hamster. I almost wish that they could have had more scenes with both Eddie Murphy and Ossie Davis (yes, Ossie Davis went so far as to take a role in this movie).\n\nSo, this movie's nothing special, but pretty funny nonetheless. Also starring Oliver Platt, Peter Boyle, Richard Schiff, and the voices of Albert Brooks and Ellen DeGeneres (who would later co-star as the voices in \"Finding Nemo\")."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Philaura",
        "review_rating": "3",
        "review_title": "NOT!",
        "review_detailed_main": "I just did not enjoy this film. But then I loved Babe, a Pig in the City and have been spoiled by talking animal films that are exceptionally well done in every way. The animals were not likeable. They were all irritating especially Chris Rock's guinea pig, but then what could I expect, it's Chris Rock. I believe I smiled once or twice at a couple cute lines, but that's it."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Beta_Gallinger",
        "review_rating": "6",
        "review_title": "Not great, but personally, I found it funnier than I thought I would",
        "review_detailed_main": "This version of \"Doctor Dolittle\" came into stores back when I was twelve years old, which was when I first saw it. I think I liked it a lot at the time, and watched it again a few months later. After many years, I just decided to check it out again. Since I'm obviously not as easily amused as I was when I was twelve, and was aware that it generally wasn't considered that great, I didn't have very high expectations. Afterwards, however, I certainly can't say that I think it's as bad as some do.\n\nDuring his childhood, John Dolittle talks to animals. It seems that he can understand them, and they can understand him, but when his dad sees this, he thinks it's ridiculous. After John's dog is taken away, he is obviously not happy, and stops talking to animals for a long time. When he grows up, he becomes a physician, and has a wife and two daughters. It seems that Dr. Dolittle's communication with animals is long gone, but one night, after he nearly runs over a dog on the road, he hears it say something! Now, his childhood ability has come back, and soon, he finds many different types of creatures following him around! How will people be able to believe that he actually has this remarkable gift, and that it's not just a mental illness, as one would probably assume?!\n\nAs you would probably expect, this movie has its fair share of lame jokes (such as a rat farting), and like you've probably already heard, the movie would overall appeal more to kids than anyone else. However, certainly not all of the gags are lame. During my most recent viewing, I wouldn't have been surprised if I had kept a straight face through the entire thing, but that's not what happened. I found no huge laughs in the film, but there were several times when I smiled and snickered. I also found that the story gets suspenseful to some degree towards the end. Eddie Murphy's performance is also a highlight. Some of the voice-overs for the animals are silly, maybe the majority of them, but this isn't much of a problem.\n\nFor kids, this movie could be very funny, though it is somewhat crude at times, remember the PG-13 rating. So, I don't know how appropriate for kids it is (that's for parents to decide). For adults, and probably adolescents, this version of \"Doctor Dolittle\" is certainly nothing special. It could be mildly amusing, if you don't mind extreme silliness and crude toilet humour, but there's probably also a fair chance that you would find it absolutely revolting (I think some clearly have). Without a doubt, this movie is pretty cheesy, and skipping it wouldn't be a great loss for most people, but it's certainly not one that I advise everyone to avoid at all costs (though that would probably be a good idea for some people)."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Wuchakk",
        "review_rating": "5",
        "review_title": "Slightly above mediocre family flick with Eddie Murphy and talking critters",
        "review_detailed_main": "Released in 1998 and directed by Betty Thomas, \"Dr. Dolittle\" is a family comedy starring Eddie Murphy as a doctor in San Francisco who re-encounters a curious talent he had as a child, the ability to understand the speech of animals. Kristen Wilson plays his wife while Oliver Platt and Richard Schiff are on hand as his colleagues. Peter Boyle plays a businessman who wants to buy their practice.\n\nWith Eddie Murphy and talking animals, I expected \"Dr. Dolittle\" to be better than it is. It's okay; there are some fun moments, but it never rises above decent. Kids should like it though.\n\nThe film runs 85 minutes and was shot in San Francisco, Busch Gardens and San Bernardino National Forest, California.\n\nGRADE: C+ or B- (5.5/10)"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "UniqueParticle",
        "review_rating": "10",
        "review_title": "The ultimate feel-good film",
        "review_detailed_main": "One of my favorite kid movies from my childhood and still love it! It's hilarious, heartwarming, amusing lines, and solid plot. Eddie Murphy is gold like many of his roles! I absolutely love all the animals they're so endearing and funny. Doctor Dolittle is underrated too, I'm probably one of very few that is enlightened by this movie."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "CharltonBoy",
        "review_rating": "6",
        "review_title": "An average Kids film",
        "review_detailed_main": "This is really an everage run of the mill kids movie based losely on the the Doctor Dolittle film. Eddie Murphy plays the doctor who finds that he can comminicate with all animals.This leads to every type of animal coming to him for help for their medical problems. The Special affects are not very special but i'm sure a lot of kids would love this film. There are a few funny one liners that will go straight over childrens heads and that are quite funny but all in all this film is just plain OK. 6 out of 10."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "5",
        "review_title": "Funny and entertaining comedy about an eccentric doctor who talks to animals.",
        "review_detailed_main": "Loose non-musical adaptation of the 1967 movie has Eddie Murphy playing straight man to a group of furry friends voiced by the likes of Chris Rock, Albert Brooks, Reni Santoni , Jenne Elffman, John Leguizamo, Julie Kavner, Ellen DeGeneres, Brian Doyle-Murray and Garry Shanding. Here Murphy is reduced to reacting lamely and is upstaged throughout by the wisecracking critters. While fellow humans Dr Weller (Oliver Platt) and Calloway (Peter Boyle) are shallow villians to prop up a shaky story involving the corporate takeover of Dolittle's vet clinic. He doesn't just talk to the animals!.For thousands of year animals have been trying to tell us something, but their cries have fallen on deaf ears...until they found John Dolittle !. This Summer...The Doctor is In Learn to talk in 500 animal languages from a parrot who speaks 1000!.The most joyous entertainment for the whole family! You've never seen anything like it in your life!.\n\nAn enjoyable adventure about a botcher doctor, regaining his wit and courage as he makes friends, crosses adversaries and encounters wondrous creatures created by Jim Henson's Creature Shop. The marvelous and agreeable premise suffers, at times, from a poor and weak script. Children will find this flick very amusing thanks to Eddie Murphy 's stunning acting, a lot of beloved animals, colorful cinematography and sympathetic script. May pack a bit too much bathroom for some family tastes. Gastrointestinal, flatulence and other bodily functions dominate the humor and subplots involving Dolittle's daughter nearly undoes te charm, but it's a passable entertainment. No animals were harmed during the making of this film, but there was probably cruel and unusual treatment of the interns involving pooper-scoopers. Murphy's well accompanied by the always likeable Kyla Pratt who stars the sequels, Ossie Davis, Oliver Platt, Peter Boyle, Richard Schiff, Kristen Wilson, Jeffrey Tambor, Raven-Symoné , among others . Traditional values and great movie for families, resulting to be an exciting movie from beginning to end, this is an amazing feel nice film and I was hoping to see more like it. Direction by Betty Thomas(28 days , Troop Beverly Hills , Dr Dolittle , Alvin and the chipmunks the squeaksequel, I spy), is ordinary, fitting to comedy film. Rating 5/10 . Average but amusing.\n\nOther versions about Hugh Lofting's acclaimed tales were starred by Eddie Murphy, made in 1998 , 2001 and 2006, such as : ¨Dr Dolittle 2¨ by Steve Carr , the good doctor goes back, persuaded to save the forest from human developers. And ¨Dr Dolittle 3¨ with Kyla Pratt, Kristen Wilson, Walker Howard, John Amos. ¨Dr. Dolittle 4: Tail to the Chief¨ (2008) by Craig Shapiro with Kyla Pratt, Peter Coyote, Malcolm Stewart, Niall Matter. And recent ¨Dolittle¨ (2020) by Stephen Gaghan with Robert Downey, Antonio Banderas, Michael Sheen , Jim Broadbent, Jessie Buckley, Emma Thompson , Rami Malek. And the 1967 classic ¨Doctor Dolittle¨ by Richard Fleischer with Rex Harrison, Anthony Newley, Samantha Eggar, Peter Bull , Muriel Landers, Portia Nelson, William Dix and Richard Attemborough. Wholeheartedly recommend for a great family movie. Fun enough and great adventure for kids and adults. Doctor Dolittle is one of the most joyous entertainment for the whole family."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Amusing lines but weak plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "ccthemovieman-1",
        "review_rating": "1",
        "review_title": "Comedy Re-Makes Sure Have Gone Down The Dumper: Exhibit A",
        "review_detailed_main": "Here we go again: Hollywood \"modernizing\" a comedy by adding tons of sleaze to a nice story and a film that was first made 30 years prior to this. There is no excuse for all the inappropriate words and sexual innuendos that are in this \"family film.\" Give me a break! That fact that it's rated PG-13 ought to tell you something.\n\nComedy is about the only genre of film making that I think has gone way downhill since the classic era. It's like the stand-up comics: we've gone from clean, clever material to raunchy.\n\nThe fact that Eddie Murphy and (the voice of) Chris Rock play major roles kind of give you a hint of where this film goes morally. This is a famous kids story and I'm sure many parents took their children to see this film....and were totally embarrassed. If it was advertised as an adult movie: fine, I would have no problems with it. But that's not the case, and so it's a disgusting sham, typical of low-life Hollywood.\n\nIn addition to the onslaught of language (which includes Jesus's name in vain three times among the other offenses) and fecal matter/fart jokes, the film basically wasn't that funny to begin with It's also not a shock, either, when you discover that Betty Thomas directed this film. This is the same woman who the year before directed \"Private Parts,\" the story of shock jock Howard Stern.\n\nAs another reviewer aptly put it, \"Come back, Rex Harrison. All is forgiven!\""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "FiendishDramaturgy",
        "review_rating": "6",
        "review_title": "Mildly Silly Fun",
        "review_detailed_main": "While this is not an \"awesome\" movie, it IS entertaining and clean enough for the whole family. Eddie Murphy's declining career not withstanding, this is actually fun to watch. Although this work falls far from the Beverly Hills Cop tree, and does not quite match the quality of any of his pre-1995 films, it still holds some entertainment value, however mild it may be.\n\nIt is a modernized version, of course, of Rex Harrison's 1967 classic, but without the charm, the sophistication, or the talent. Unfortunately, while this remake is fun, it is only mildly so, and really quite silly in a wholly unimaginative kind of way. Frankly, the best bit was Norm MacDonald's \"Lucky\" voice part. Eddie Murphy's best post-1995 roles have been voice parts, in my opinion (Donkey & Mushu).\n\nThe young actresses who play Murphy's daughters are great in their own rights; Raven-Symone and Kyla Pratt, the latter of which continues on with this franchise long after the rest have bailed, creating a nice outlet for her own growing talents. Check them out.\n\nAll in all, this is fun, if only mildly so, and totally silly. The kids will love it.\n\nIt rates a 5.8/10 from...\n\nthe Fiend :."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "peacham",
        "review_rating": "1",
        "review_title": "WHY BOTHER? WATCH REX !",
        "review_detailed_main": "This movie was a total disgrace to Hugh Lofting and to Sir Rex Harrison's original portrayal. Where is Puddlby- on-Marsh? Where is England in the 1840s? And most of all, where is the charm. if murphy wanted to make this movie why call it dr. doolittle? this film is about as close to dr. doolittle as Hamlet is to Die Hard !"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "g-bodyl",
        "review_rating": "7",
        "review_title": "Good, but not great!",
        "review_detailed_main": "Dr.Dolittle is a nice family movie, but I would not recommend this to people expecting something hilarious like Big Daddy. Dr. Dolittle, played by Eddie Murphy, is a doctor who can hear the voices of animals. Eventually, he becomes a animal doctor and he must save a few animals. Overall, this film is not really funny, but it had a few laughs. The idea(or remake)of this film was great. The acting was good, but not great. Eddie Murphy was alright, but Chris Rock rocked as the guinea pig. There is no original music score, but there are a couple upbeat songs. The only reason I saw this film because I saw the sequel to the film before this. There were only a couple major disappointments, but not many. I rate this film a 7/10."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "gbheron",
        "review_rating": "5",
        "review_title": "Not Very Funny",
        "review_detailed_main": "In my opinion, \"Doctor Doolittle\" will fail to connect with most adults. Its humor is of the pre-adolescent potty variety, and the few jokes aimed at older viewers are not very funny. Although Eddie Murphy gives a good comedic performance, he is let down by the script and his fellow actors. \"Doctor Doolittle\" doesn't strike me as much of a kid's movie (although I did not view it with kids), and as for adults, there is much better in the genre such as \"There's Something About Mary\". This movie is caught betwixt and between kid and adult and should have satisfied neither. But it made tons of money so that just goes to show you what I know."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "7",
        "review_title": "Funny and Nearly Wholesome",
        "review_detailed_main": "Doctor Dolittle (Eddie Murphy) could talk to animals as a child. After being deemed crazy by his father and other adults, he effectively shut down his ability. Then one day, as an adult with a successful medical practice, he regained his ability to talk to animals. This \"ability\" was more like a nuisance as it only caused him again to look crazy.\n\nI thought the movie was refreshingly light and thereby enjoyable. There was no relationship drama and no petulant teenagers needing to be reformed. His daughter Charisse (Raven-Symone) was a bit of a wildcard, but it was nothing that dominated the plot, plus it was funny. Even with other things going on like a potential buyout from a wealthy company, and his family, it was still about the animals. We were treated to the voices of Chris Rock, Norm MacDonald, Chris Rock, Reni Santoni, John Leguizamo, Julie Kavner (Marge from The Simpsons), Garry Shandling, Ellen DeGeneres, and Gilbert Gottfried. They all contributed and they were all amusing."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "matija-trost",
        "review_rating": "2",
        "review_title": "A CHILDREN MOVIE...",
        "review_detailed_main": "...And that's why hard to rate.\n\nFrom the adult point of view (hmm, student point of view:)). i must say i fell nearly asleep here. Sure, there is some laughing scene (all the credit takes here Eddie), but that can't save the disney type of script and whole movie, that's why\n\n2 out of 10"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "aesgaard41",
        "review_rating": "8",
        "review_title": "He Talks With The Animals.....",
        "review_detailed_main": "I've always thought Eddie Murphy did comedy better than action, but now I have to add honesty and integrity to his repetoire. He does such a wonderful family film here that it's almost hard to believe he got his start on Saturday Night Live. The mere concept of talking with the animals is created quite believably in the film even though you have to consider the detail that would go into such a feat actually existing. Considering the sheer diversity of the animal kingdom and the limited scope of animals to rationalize, Murphy as Dolittle would have to have considerable telepathic and clairvoyant prowess as well the data-crunching power of a computer in order to decipher instantly the motivations and inclinations of two to three animals at one time as well as come up with the human equivalent of the animal's personality. The concept of animals conversing inter-species wise would have to involve some sort of Mother Earth Theory that all animals wild and domesticated are linked by a central innate consciousness. That said, this movie is quite enjoyable despite the theories and examination it entails. Actress Kristen Wilson as Murphy's wife is a very lovely presence to the movie and former child actress Raven-Symone is becoming a lovely young actress herself far removed from that annoyingly unbearable kid she played on The Cosby Show. The rest of the cast are second stringers to the animal cast whose voices are brought to life by the vocal talents of Norm MacDonald, Julie Kavner, John Leguizamo, Garry Shandling, Jenna Elfman, Gilbert Gottfried and sounding eerily like James Belushi, Albert Brooks. This is one wonderful movie that belongs in your video collection at home."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "OriginalMovieBuff21",
        "review_rating": "7",
        "review_title": "A Funny but yet corny film",
        "review_detailed_main": "Dr. Dolittle was funny. It made some jokes that really made me laugh but others I was like kind of confused from. There are corny little jokes though. Like Lucky the dog and those little mice or rats or whatever were kind of corny or just had corny lines. I did like them though, they were pretty funny. I actually liked the mice better in the second one. Eddie Murphy was good in it, not his best but was definitely worth starrring in it. I don't think anyone could've played his part any better than he could, well maybe Bill Murray could've been a Dr. Doliitle but I already liked those characters. The old sister that's in That's So Raven is very pretty. A good film to look at.\n\n7/10"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Mickey Knox",
        "review_rating": "4",
        "review_title": "only one reason",
        "review_detailed_main": "The movie is bad. Nothing special - just a \"kid\" movie with no serious thing in it. There is though one reason to watch this for: the animal talk. Some of them are so funny in what they say, you just can't stop laughing. So if you want to hear a dog in the dog pound saying \"I'm Keyser Soze\", or another animal saying \"You're a dead cat walking\", or many other funny one liners, see it. Cause there's no other good movie to watch it. Vote: 4 out of 10."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Fair Remake.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "emm",
        "review_rating": "3",
        "review_title": "Supposed-to-be lovable film offers no cure for flatulence.",
        "review_detailed_main": "Just what we need! Another remake of vintage Hollywood cinema, with Eddie Murphy miscast again in his second time around after THE NUTTY PROFESSOR (1996)! This shows why we're running out of special ideas in making a quality movie, ladies and gentlemen! It has some signs of hope for its likeable and delightful imagery of animals who can act and speak with humans. Things can only get more worse, unfortunately. Bathroom jokes and sexual references kill this piece of \"family\" funfare instantly. Even parents and children saw the trailer ad on The Family Channel, which was followed by utter angst and disgust in the movie theater. Sad to say this is the more progressive pre-millennium era, but enjoy it while it lasts 'cause things can only get worse with time. More went wrong with the all-new DR. DOLITTLE. It is absolutely plotless, feeling too flat. I also hate that irritating voice of Chris Rock!!! We need more talented voice-overs than a bunch of overpaid celebs who don't want to declare bankruptcy. I'll have to agree on my local newspaper giving this among the top five worst movies of 1998. Then again, the original version wasn't any good, either. Murphy's next project could be PATTON if he's not careful!"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "KLG23",
        "review_rating": "7",
        "review_title": "Family fun entertainment",
        "review_detailed_main": "Loved this when I was a child. Watched it again recently and still found myself laughing. Some excellent voice performances and a heart warming story. Good one for all the family to enjoy."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "5",
        "review_title": "Doctor Dolittle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Benjamin_Cox",
        "review_rating": "6",
        "review_title": "Hardly a classic but a decent effort - 61%",
        "review_detailed_main": "You can probably tell by the gap between release and review that I wasn't that bothered about seeing this. But seeing as I haven't watched anything for ages, I figured that a little light relief might not be such a bad thing. And like most of Eddie Murphy's back catalogue, \"light relief\" is exactly what was on the menu. While maybe not a patch on the original, it is a great family film that has plenty for kids of all ages to enjoy even if it does have its flaws.\n\nMurphy plays work-committed doctor John Dolittle, working in an inner-city practise and occasionally finding the time to spend with his wife (Kristen Wilson) and two daughters (Raven-Symoné and Kyla Pratt). But after nearly running a dog over, he is shocked to recall his forgotten childhood ability to talk and communicate with animals. And as word spreads around the animal kingdom, Dolittle struggles with his sanity as every cat, rat and horse in the area flock to him for medical advice. He also struggles to persuade his family and colleagues about his claims, just as his practise is about to merge in a big-money deal.\n\nMurphy, by now in the middle of the end of his career, doesn't need to try too hard but actually, he is surprisingly good as the increasingly demented doctor. Maybe because he doesn't have to slap on several thousand dollars worth of latex or play every character in the movie but \"Doctor Dolittle\" serves as a reminder that he can be an accomplished performer without going completely over the top like he does nowadays. However, Murphy is no match for the variety of animals acting alongside him and even though the animals actually talk through clever and discreet CG, the numerous voices and guest stars (Chris Rock, Ellen DeGeneres, Albert Brooks, Julie \"Marge Simpson\" Kavner and more) have all the best lines and make the movie genuinely entertaining. The humour is suitable for a family film - great for kids, mildly amusing for grown-ups - but it does take a while to get going and for some reason, the ending didn't feel particularly satisfying.\n\nWhat it lacks in songs, dance routines and Rex Harrision, it makes up for in characterisation and humour. \"Doctor Dolittle\" might not change the world but it is perfect family fare to slap on a slow Sunday afternoon when the weather prevents play outside and you're fed up of hearing them on their Playstations. The only problems I can think of is that it lacks the charm of the original, it could have made more of the premise and the whole thing isn't especially memorable, Murphy's performance aside. But at least he isn't anything like as annoying as he is these days and just like Steve Martin in \"Father Of The Bride\", this film acts almost as a tribute to a former comedian and actor before they decide to ruin their career with some shocking films. So if you're still recovering from the likes of \"Pluto Nash\" or \"Norbitt\" then I advise you to watch this because if anything else, this is an Eddie Murphy film that doesn't make you want to blow up Hollywood."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "coconutkungfu-30704",
        "review_rating": "2",
        "review_title": "A Bad Film",
        "review_detailed_main": "Eddie Murphy is a great actor but he has so many clunkers on his filmography unfortunately. This is another stinker that might struggle to even amuse children with less refined tastes. I suppose the effects were good for the time, yeah let's go with that so I have said at least something positive."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "The-Sarkologist",
        "review_rating": "7",
        "review_title": "Eddie Murphy talks to the Animals",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "manzoorulhassan",
        "review_rating": "1",
        "review_title": "Hated it",
        "review_detailed_main": "I have hated very, very few movies in my life - and this is one of them. It could have had something to do with the fact that I went to watch this while we were visiting Disney World and that I was just tired from walking all day.\n\nBut in any case, I found it to so boring that after about 30-40 minutes, I got up and left the theatre.\n\nmanzoor"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "iamshadab",
        "review_rating": "8",
        "review_title": "For the First time, A Hindi Dubbed Version takes over the English",
        "review_detailed_main": "First of all, Let me tell you I am writing this review for the Hindi Dubbed Version, so if you watch the English one, this review is of no use....\n\nMan, I never remembered laughing this much in a family Hollywood movie Dubbed in Hindi. In fact the Hindi version takes over the English one. Hats off to the Dubbing Artists, they gave the animal character's voices to different mimicry artist which brings a stupendously funny feeling for the movie..., So if you understand Hindi, then a must watch for the whole family, no explicit content or cheap jokes either, the artists that made the animals speak, the translators adding extra efforts to the dubbings brought it to life, my review, A Must Watch if you understand Hindi and knows Bollywood......"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "kairingler",
        "review_rating": "6",
        "review_title": "Dr. Murphy",
        "review_detailed_main": "Eddie Murphy was hilarious in this movie,, I like the little back-story where they show how he learned to talk to the animals when he was a little kid. all of the animal characters were just delightful. like the idea of the little camping trip and stuff for him to get away from it all and try to think things thru. he has to convince his family that he is not totally crazy, at first he doesn't wanna believe that he can actually talk to animals, and for the longest time he tries to deny it.. but as the film slowly progresses he has a special gift, and that he can help animals especially when they are sick and need medical attention.. this is a great movie from Walt Disney, and they seem to be getting better and better every time a new one comes out."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Cath-10",
        "review_rating": "1",
        "review_title": "Harmless stupid entertainment",
        "review_detailed_main": "This is definitely a stupid, bad-taste movie. Eddie Murphy stars in what is written like a sitcom. He is surrounded with his perfect family, full of good family values. If you're looking for politically correct entertainment, this movie is for you. But if you hate the idea of being the only one not to laugh at obscene gags in a movie-theater full of pop-corn addicts, just flee."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "stopped dead in its tracks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Kev-2000",
        "review_rating": "1",
        "review_title": "Vote for it...",
        "review_detailed_main": "Vote to make this the worst movie of all time, it deserves it. The only other movie that made me feel this way was years ago, \"Buckaroo Banzi\" or some such name. I guess this movie was to be aimed at children, but it's profanity and subject matter was too adult - too loud mouthed. Even the people who liked it hated parts of it, now what does that say? If zero were an option, I'd give it less than that..."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "inkblot11",
        "review_rating": "7",
        "review_title": "Do bring this nice film to your family, they will be liking what they see",
        "review_detailed_main": "Dr. John Dolittle (Eddie Murphy) is a gifted physician taking care of his human patients. He is so talented that offers of financial backing for he and his partners are coming in from unexpected sources. This is great news for John, his lovely wife and their two sweet daughters. However, when John was a boy, he could talk, truly, to his pet dog and spent time having long conversations with the canine. This made his father (Ossie Davis) so worried that he summoned the preacher to their house. There, the minister tried to call \"the devil\" out of John's body, an exercise that caused John's beloved dog to bite the holy man. When his father gave away the dog, John was heartbroken. No longer would he talk with animals. Yet, on a rainy night, Dr. John nearly hits a dog and brakes quickly, causing him to bump his head. Suddenly, John can hear what the animals around him are saying, much to his initial dismay. From rats to owls to tigers, animals are coming to ask for his help. With so much distraction, can he concentrate on his human medical treatments? This is a very nice family film, especially for those who adore animals. Murphy is great as the doctor and the rest of the cast is also nice, with Davis a pleasure to see and hear. Watch out, too, for Paul Giammati as the shrink summoned to examine John's mental health! The sets, costumes, and production are first rate. But, it is the lovable animals, and their human voices, that are the big stars. From the cute guinea pig to the lovable dog to the tipsy monkey, these critters are out to capture the hearts of the viewers. And, they succeed very, very well."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Sometimes cute, sometimes annoying",
        "review_detailed_main": "My friend and I rented this film, looking for some good cheesy fun. And we did get a few laughs, but some of the film just doesn't add up well. It's definiantly for the kids, for teens or adults, it doesn't work.\n\n5/10"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "reddiemurf81",
        "review_rating": "6",
        "review_title": "How can ya not love this?!?",
        "review_detailed_main": "Chris Rock as a rodent, Norm McDonald as a dog,, and Eddie Murphy as Dolittle,,, what more can you ask for? Sit back and laugh away :)\n\nGo watch it!"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "filipemanuelneto",
        "review_rating": "3",
        "review_title": "If you forget some good jokes, it's a pretty poor movie.",
        "review_detailed_main": "There are some movies that may have a poor history but make up for being fun and making us laugh. This is one of them. It tells the story of John Dolittle, a doctor who has been talking to animals since he was a child. But thanks to his parents' efforts, he has forgotten this gift as he grows up ... until suddenly, for no apparent reason, he begins to hear animals talk and is on the verge of a nervous breakdown over it.\n\nSound improbable? In fact, it is ... if I had such a gift, I certainly would not suddenly discover it after years and years without using it. The movie does not explain how Dolittle managed to go years without hearing animals and suddenly begin to hear them so clearly. It is a sudden and unbelievable change. However, the whole plot of the movie is weak. There is truly no story to tell ... what we have here is a basic script skeleton that only serves as the basis for a succession of jokes presented to us by Eddie Murphy and all the animals with whom he plays. The humor is based on dialogues, speech and situations involving animals, to the point that they become the real protagonists and Murphy loses relevance in the film. But trying to see this movie from the logical side means taking all the fun out of it. In fact, we enjoy the movie better if we tolerate the faults of the poor and poor script and simply get carried away by what we are seeing and enjoying the jokes.\n\nEddie Murphy, with this movie and others that followed, probably lived his golden age as an actor. He got money, fame, popularity, good deals ... but in fact he never shows value as an actor. Not because he doesn't have it - he showed it in other movies - but because he had so little to do in this movie! Murphy does little while he is Dolittle (curious!). Of the rest of the cast it is better not to speak. The voice actors (notably Norm MacDonald and Chris Rock) shone more brightly than the entire human cast.\n\nTechnically, the movie is quite regular. Not excellent and having very poor visual and sound effects. The soundtrack is virtually non-existent and even the opening and ending themes are uninteresting."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "MAXI-3",
        "review_rating": "6",
        "review_title": "entertaining",
        "review_detailed_main": "Thoroughly entertaining from start to finish.Superb effects-Eddie is great."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "MartianOctocretr5",
        "review_rating": "2",
        "review_title": "Animals talk...wish they had said something funny",
        "review_detailed_main": "Too bad neither the animals or Eddie Murphy had anything to say worth saying. this movie is just bland.\n\nChildren's movie? Well, if you're trying to get them to take a nap, then maybe. It's just 90 minutes of some eye-wrenchingly poor animal lip animation to quips that aren't funny. And the lip-sync'ing makes the old Godzilla films look brilliantly done by comparison. Meanwhile, Eddie \"Pluto Nash\" Murphy drones on with a suppressed understated delivery that is painful to experience. Apparently, he's trying to modify his old manic persona, but to what? In short, all the magic and wonder of the 1967 original version is lost in this re-imagining, or whatever it is. A town wants to bully some forest creatures and blame them for doing bad stuff. No, really. And Pluto Nash can psycho-babble with them. Things chain along with some stale jokes to a dull uninspired conclusion with no surprises.\n\nRent the '67 movie. Or some old Yogi Bear cartoons."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Wilson102",
        "review_rating": "9",
        "review_title": "Far better than given credit for....",
        "review_detailed_main": "The only thing that would make this movie a bit better would be if they would come out with an anniversary edition with ALL the scenes put back in. The release of this has cut out several songs and scenes which creates gaps in the story line. For those of us who grew up loving this movie, it is sad to see them cut it up. The original soundtrack keeps all the songs, \"Something In Your Smile\" which is when he realizes he loves Emma Fairfax, instead he awakens the next morning on the beach and off he goes. Terrible they cut it. Wish they would put out the anniversary edition UNCUT and with Deleted Scenes back in. Other than that, a timeless classic which does not get enough credit, specifically after Eddie Murphy ruined the overall charm of it."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Andrew-39",
        "review_rating": "7",
        "review_title": "Pleasant, funny and essentially harmless entertainment.",
        "review_detailed_main": "This is worth seeing whether or not you're a Murphy fan, partly because it's the first time I've seen him relinquish the centre of attention to anyone - or in this case, lots of animals. I am an Eddie Murphy fan - I think B.H.C. is a classic - but it is a welcome change to see him playing second fiddle. It's a measure of the quality of humour in this script that Eddie - though extremely funny - is matched and frequently eclipsed by the animals. Some of the things they get up to (partly with the help of computer graphics, it must be said) are truly amazing. Complaints? None really, except of course it's American so it gets cheesy at the end. Par for the course really. Overall, great fun."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "jasonhmurray888",
        "review_rating": "2",
        "review_title": "Don't bother with this film",
        "review_detailed_main": "Inexplicably both my son and I fell Asleep while watching this movie. I think it's simply the change in dynamics in movies since they made movies in the 90s. Too slow, poor dialogue. Static camera angles. Old movie's often just don't keep audiences engaged now that they're used to more fast paced action. Haven't watched the remake yet, but i bet it's a ton better"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Adaleide",
        "review_rating": "",
        "review_title": "I liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "This Film Needs A Script Doctor.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Mental09",
        "review_rating": "7",
        "review_title": "Pretty darn funny...",
        "review_detailed_main": "At least it's pretty darn funny if you don't expect to see a Eddie Murphy movie. All the animals make this movie, and especially Chris Rock as Rodney the Guinea-pig is hilarious!\n\nThe story is not very good, the acting is what you'd expect from this kind of cast, the jokes may be a bit old, but I still think this one scores. I don't think of it as a children's movie though, cause a lot of the humour really passes them by. Too much irony, I presume. (Kids are not very good at that) But they'll still love it. After all, there are a bunch of cute animals in it!\n\nAll in all, I have no problem recommending it to others, it's definitely worth seeing, and it provides more than enough laughs for the bucks. I saw it three times, YOU should at least see it once."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "studioAT",
        "review_rating": "2",
        "review_title": "And now...Eddie Murphy as Dr Dolittle",
        "review_detailed_main": "Eddie Murphy gives the old Dr Dolittle character a run out, in a film that was obviously successful enough to then launch a sequel and other straight to dvd sequels.\n\nIt's not great though unfortunately. If you like Murphy's brand of humour that you'll no doubt enjoy it, but for me the main problem (much like in the recent Robert D.J version) is that the people voicing the animals aren't funny. Or the script doesn't allow them to be.\n\nThe only saving grace for me is Oliver Platt, who is above this sort of piffle."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Hongwaree_Raitao",
        "review_rating": "7",
        "review_title": "Super fun",
        "review_detailed_main": "Great movie, the animals are hilarious. Great screenplay."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "ILuvPrincessDiaries2",
        "review_rating": "1",
        "review_title": "I can't believe they call that a kids show!",
        "review_detailed_main": "It was funny it was but it was also very crude humor and my family couldn't watch it because it was so filthy. Of course anything with Eddie Murphy in it has something bad in it. Eddie Murphy's favorite thing to do is to swear and I hate swearing. we didn't even watch half of it and we had to turn it off. This is why PG13 means what it is. I'm 14 and i still wouldn't watch it. My Parents wouldn't let me watch it. And my morals wouldn't let me watch it. They show a woman's naked butt and they swear like a sewer. All the jokes have to do with crap. This is NOT a kids show. i would NOT recommend this show to anyone. I do not see why they have to pervert everything."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Kamurai25",
        "review_rating": "7",
        "review_title": "Doctor Lots of Fun",
        "review_detailed_main": "Great watch, would watch again, and can recommend.\n\n(I might have watched this before, but I couldn't even remember Chris Tucker as the Guinea Pig, but I could remember the guy in the tophat (but nothing else) from the original 1967 movie)\n\nI'm honestly upset that I don't remember watching this before, the sheer probability seems like I would have.\n\nOf all the things that Disney did to Eddie Murphy over his (prison) exclusivity contract, this was clearly early enough that he was still having fun with it, and it really shows. When a master actor like Murphy is enjoying himself it is night and day.\n\nThe story is modernized and adapted beautifully. The story itself is well written and heart warming. That said, the movie leans into adult topics a lot more than you would think, at least more than I would expect the conservative Disney of today.\n\nThere are a slew of supporting voice actors, to include Norm MacDonald, that all work very well into their roles. The multi-threaded plots work well together, and Eddie Murphy slowing thinking he's gone insane is a lot fun."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "frahbeeni",
        "review_rating": "5",
        "review_title": "Entertaining at times....",
        "review_detailed_main": "A story with such potential is wasted on short discontinuous laughs which have no relation to the plot. The movie is entertaining at times but lacks the fibre to keep things together. The film is ideal for children and would amuse them for hours."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Mashmarriner",
        "review_rating": "8",
        "review_title": "Kids movies aren't like this anymore",
        "review_detailed_main": "Yea. This isn't the original story of Dolittle but it's worth a watch.\n\nI loved this as a kid. Never seen it since I was a kid. Now I've watched this with my kids after countless other newer kids movies. I never realised how much swearing and adult humour is in this movie.\n\nKids movies aren't like this anymore."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Tito-8",
        "review_rating": "7",
        "review_title": "Nothing great, but undemanding fun",
        "review_detailed_main": "Okay, so this is definitely no laugh riot, but I managed to like the film in spite of all the flaws. Eddie Murphy gives a good performance, the animals are generally amusing, and the film has enough heart to compensate for the thin script and laughless segments. I didn't expect to like this film at all, and although it isn't anything great or memorable, I would still call this a pleasant surprise."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "gcd70",
        "review_rating": "5",
        "review_title": "No singing, just talking animals this time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "For the Kids...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "benyg",
        "review_rating": "5",
        "review_title": "Could have been more",
        "review_detailed_main": "Dr Dolittle is an entertaining film which sets a good balance between focusing on the calamities of being able to talk to animals as well as the benefits.\n\nEven though the film is put together well I feel a lot more could have been done with the idea that his talent had to be kept away from those he knew. One of my favourite scenes in comedy is in 'Fierce Creatures' starring John Cleese when Rollo Lee (John Cleese) tries his best to cope with the animals in the park yet at the same time attempting to keep a decorum. Such a formula could have been used in Dr Dolittle film to great effect.\n\nDirected by Betty Thomas, this film depicts a man who can talk to animals but not in the light seen in British - theatre. Whichever is best I dare not say but nevertheless this is a good, light film which is guaranteed to get laughs out of children and maybe even adults too."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Allierubystein666",
        "review_rating": "6",
        "review_title": "Enjoyable family flick. Flawed, but fun",
        "review_detailed_main": "An entertaining endeavor, Dr. Dolittle is thankfully more good than bad, but does prove to be quite uneven at times. My biggest critique of this film is its tone. It often feels formulaic for sure, but what hurts most I feel is its almost lifeless atmosphere. If written not so forcibly a comedy, like it obviously should be, this film would honestly feel like a horror movie of Murphy's character going plain mad. There are also a handful of things that simply did not age well, and a stir of annoying repetitive dialogue that can just get in the way of the fun in this movie- obviously done to drag out the films short runtime. Yeah it's quite flawed, and messy, but it's inescapably fun to watch. Honestly this film just goes to show you it should be easy to have fun talking animals on screen, which makes it interesting how so many people in recent years continue to fail again and again. Murphy isn't anything special, but he also isn't over the top which is a nice breath of fresh air after just watching his painful performance in Imagine That. The voice cast is fun, even if they can be overdone at times, and I honestly always enjoyed hearing Norm MacDonald and Chris Rock on screen. The film can also be pretty heartfelt at times without it ever feeling corny or sentimental. It feels genuine and allows us to invest in the animal characters even despite their flaws. In the end, Dr. Dolittle is far from a perfect family film- and did eventually lead to spawn countless other Murphy family centered flops- but ultimately it's a fine and enjoyable film even despite its several issues.\n\nMy Rating: 5.9/10."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "johanleupen",
        "review_rating": "4",
        "review_title": "At first i thought that this was just a lame movie. I was right",
        "review_detailed_main": "At first i thought that it was just about Eddie Murphy talking to some stupid animals. I was right. Some people called this movie Eddie Murphy's comeback! Who are these people? Jesus if this is the best he can come up with he can just stay away. What was the story again? I was so annoyed by all the lame jokes i forgot. I should have walked out on this one."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "lib-4",
        "review_rating": "7",
        "review_title": "If we could relate- what they'd say",
        "review_detailed_main": "Despite some predictable jokes, this movie was actually entertaining- Chris Rock is wonderful as Rodney the guinea pig- who is neither Italian nor pork. Eddie Murphy blended well with the animals-- the rats were hilarious and the drunk circus monkey a hoot. I enjoyed the animation- the techies did a good job with this movie- Kind of mindless but good for laughs and I sure do wish I could talk to my cat Barney...I go to a comedy for laughs and go to serious movies like American X to think. this is good for laughs--"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "TheRetroCritic",
        "review_rating": "4",
        "review_title": "Underwhelming but harmless enough kids movie",
        "review_detailed_main": "A modern and rather loose take on the classic children's story, the Dr. Dolittle movie from 1998 sees Eddie Murphy's doctor slowly realize that either he can actually talk to animals or he is losing his mind entirely.\n\nThe film opens with a young John Dolittle discovering his talents before he is encouraged by his father to forget about all that, which he does well into adulthood. Now a successful doctor and surgeon in San Francisco, John is about to join his family on vacation when he bumps his head almost running over a dog and his abilities promptly return. Not knowing what to make of that, he struggles to come to terms with it all and panics trying to hide his secret from others until he can't. Meanwhile, John's colleagues are trying to set up a meeting with the owner of a medical company who has shown interest in purchasing John's practice. When a tiger from a circus shows signs of a possible neurological issue, John has to decide whether to step in and save its life, others be damned, or try to live a normal life.\n\nThere's not much more to this light-hearted comedy story-wise and, in fact, the tiger plot only really becomes relevant right at the end, with two thirds of the film dedicated to John Dolittle freaking out about his animal chats. Dr. Dolittle was a box-office hit, hot off the success of The Nutty Professor a couple of years earlier, and Eddie Murphy proved once again that he could single-handedly elevate material that, in lesser hands, might not have worked well at all. Unfortunately, Dr. Dolittle lacks the laughs that The Nutty Professor delivered and feels very slight in comparison. The animals, who are sometimes CG'ed, sometimes puppets, and voiced by the likes of Chris Rock, Norm MacDonald and Albert Brooks, get the bulk of the lines here but they're rarely funny.\n\nThe writing is the main problem with this movie which, not only lacks genuine laughs but fails to give Eddie Murphy anything to work with, though he definitely does his best to keep things entertaining at least. Not to mention that John Dolittle doesn't so much go on an adventure as he does whine and complain for an hour about what is obviously a very cool power to have. This routine gets tiresome fast and, even though the supporting cast is solid (Oliver Platt, Peter Boyle, Jeffrey Tambor, Paul Giamatti), they're only really there to fill time until the inevitable animal fart joke and keep the non-kids who are watching this from giving up on it completely.\n\nThis Dr. Dolittle is harmless enough and younger viewers will be reasonably entertained but this needed a stronger plot, perhaps one focused on the tiger at the circus, and a lot more laughs to make it worth sitting through because, as it stands, this is just not very good.\n\nDisappointing."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "D_I_Sammi",
        "review_rating": "7",
        "review_title": "Charming, Funny and Catchy",
        "review_detailed_main": "Talking animals rarely leads to an unfun time, and 'Doctor Dolittle' is no exception. The film is mad on delivery but keeps itself tame so its fair for the entire family.\n\nEddie Murphy is genuinely hilarious as hell, largely because he is the right actor to pull off talking to animals and be the butt of the jokes. Oliver Platt is the actor with the right frame of mind to compliment this also. Richard Schiff is also memorable as are all of the non human actors and actresses.\n\nThis movie works because it knows that its a comedy and plays itself like so instead of trying to twist the source material into something triggering. Unfortunately the opening scene is badly handled, and the film effectively has to restart itself."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Hans-56",
        "review_rating": "5",
        "review_title": "Another Murphy disaster",
        "review_detailed_main": "Murphy did make some good comedies. Apparently producers now think he's so expensive, they have to hold back on the rest of the budget just to pay THE MAN. I really wished they spend a few dollars more this time on a good scenario with real jokes instead of this ****. Rightout: there's nothing funny about this comedy."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "mriley84",
        "review_rating": "8",
        "review_title": "Like Betty!",
        "review_detailed_main": "During his childhood, John Dolittle talks to animals. It seems that he can understand them, and they can understand him, but when his dad sees this, he thinks it's ridiculous. After John's dog is taken away, he is obviously not happy, and stops talking to animals for a long time. When he grows up, he becomes a physician, and has a wife and two daughters. It seems that Dr. Dolittle's communication with animals is long gone, but one night, after he nearly runs over a dog on the road, he hears it say something! Now, his childhood ability has come back, and soon, he finds many different types of creatures following him around! How will people be able to believe that he actually has this remarkable gift, and that it's not just a mental illness, as one would probably assume?! As you would probably expect, this movie has its fair share of lame jokes (such as a rat farting), and like you've probably already heard, the movie would overall appeal more to kids than anyone else. However, certainly not all of the gags are lame. During my most recent viewing, I wouldn't have been surprised if I had kept a straight face through the entire thing, but that's not what happened. I found no huge laughs in the film, but there were several times when I smiled and snickered. I also found that the story gets suspenseful to some degree towards the end. Eddie Murphy's performance is also a highlight. Some of the voice-overs for the animals are silly, maybe the majority of them, but this isn't much of a problem."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Skip-32",
        "review_rating": "7",
        "review_title": "Funny. At times even hilarious. Good work on the a...",
        "review_detailed_main": "Funny. At times even hilarious. Good work on the animals as far as making them appear to talk.."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Pat-54",
        "review_rating": "5",
        "review_title": "I liked it - so sue me!",
        "review_detailed_main": "Being an animal lover, I enjoyed this film. I realized the script had holes in it, but it was fun nevertheless."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Dovetail",
        "review_rating": "",
        "review_title": "I'm glad I didn't take my grandson with me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "somf",
        "review_rating": "4",
        "review_title": "worse than I ever would have imagined.",
        "review_detailed_main": "Everyone involved with this project should be ashamed as to the result of their efforts. Oh. I laughed a coupe of times , but I laughed a couple of times during Schindler's list also. They really screwed up a good premise."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Thanos_Alfie",
        "review_rating": "6",
        "review_title": "Hilarious...",
        "review_detailed_main": "\"Doctor Dolittle\" is a Comedy - Family movie in which we watch a doctor starting to understand and communicate with animals. It is something new for him and he needs to deal with this and after to start doing something about it, to help the animals that really need his help.\n\nI liked this movie because it had a simple but interesting and funny plot consisted of many hilarious scenes. The direction which was made by Betty Thomas was good and the way she presented both her main characters and the plot of the movie was very good. The interpretation of Eddie Murphy who played as Dr. John Dolittle was very good and he made the difference in this movie. In addition to this, the voices of the animals were simply amazing and in combination with Eddie Murphy's interpretation created this beautiful result. Finally, I have to say that \"Doctor Dolittle\" is a funny movie and I highly recommend everyone to watch it because I am sure that you will laugh a lot."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "badman-2",
        "review_rating": "5",
        "review_title": "The movie did little for me",
        "review_detailed_main": "Understandably this movie was a box-office hit and why not with the post Nutty\n\nProfessor Murphy in the lead talking to a bunch of animals with Chris Rock leading the way. However, if the viewer is looking for an artistic reason why this film was made, forget about it. The movie didn't need to be made at all; the plot was farcical and the wise-cracking animals got old in a hurry. This movie was all about generating green. If you want to see a film about Dr. Dolittle, check out the original 1927 version or Rex Harrison's classic '60's version."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "rooboy84",
        "review_rating": "6",
        "review_title": "A great addition to the-animal movies!",
        "review_detailed_main": "Eddie Murphy can talk to the animals. A creative idea and Betty Thomas did a good job with this movie. Worth renting at least and the animals look cool, too. If you love animals it's a great movie to sit back and relax. Problem is-only 85 minutes. If it had been at least about 10 to 20 minutes longer if would have been a lot better.\n\n77%"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Animal-3",
        "review_rating": "5",
        "review_title": "Tried to work on too many levels and did not!",
        "review_detailed_main": "Lots great components that do not work:- Superb animation Adult humour gently hidden Moral undertone to plot Gentle reminders of importance of what you do not the amount you are paid that counts San Francisco looking as lovely as it is Good characterization of the talking animals!!!! However I didn't laugh and neither did my children. Perhaps Eddie was not the right central character (suggest John Lithgow)"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Craig JS",
        "review_rating": "6",
        "review_title": "Tiger Doo, is not Little.",
        "review_detailed_main": "I never really did like Dr Dolittle much as a kid as I preferred films that didn't break out into song every 10 minutes, like Star Wars. There was no singing in Star Wars. So it will come as no surprise that I wasn't really anticipating this film and was prepared to be bored to tears with a G-rated Eddie Murphy singing to kids. Imagine my surprise to find some witty dialog coming right out of the horse's mouth so to speak. Ahem.\n\nEddie Murphy plays Dr Dolittle a family man who seems a little wrapped in his work as a Doctor. So busy in fact that hasn't the time to stop and listen to the animals that all of a sudden decided that they would like to talk to him. Despite years of being silent. With in days Dolittle ditches the profitable people with Medical insurance in favor of pigeons and guinea pigs. His now talkative four legged and winged companions teach him how to be a better man, husband and father. Naturally a change of lifestyle and a better relationship with his family follows. All we need now is sort of dilemma and action in the 3rd act to seal the deal. Oh wait there it is save one Tiger from certain death. That was close nearly missed it in the moral preaching that saturates this film.\n\nThe Animals are a host of well knowns that steal scene after scene with impersonations and one liners. Apparently animals make up for their lack of civility lack of technology opposable thumbs with a good sense of humor. Chris Rock as the hamster (also G-Rated) is completely wasted here however had my neighbors hamster made this much noise. It wouldn't have been set upon by the vacuum cleaner.\n\nThe film is aimed at the children but there is enough here to keep the adults amused. Dr Dolittle has more that its share of slap stick and the toilet humor that cannot be avoided. Despite this its probably with the price of a rental."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "visionaryalien-86843",
        "review_rating": "1",
        "review_title": "Not a family movie",
        "review_detailed_main": "People! Really! This is not family friendly movie. The most obscene Dolittle movie, ever. Full stop."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "stirred_mind",
        "review_rating": "8",
        "review_title": "Great Fun.",
        "review_detailed_main": "Why do people dislike Doctor Dolittle? I love it! It is entertaining, hilarious and has great special effects. Doctor Dolittle is a must-see for 1998!\n\nJohn Dolittle (Eddie Murphy) had a gift that he could talk to animals when he was younger. When a dog called Lucky calls him 'Bone-head' one day, he remembers that special gift. Now he has a tiger to help, a family to look after, a guinea pig to rock with and an alcoholic monkey to cure.\n\nDoctor Dolittle is great. Look out for the voice of Chris Rock as he hilarious hamster!!\n\nMy rating : 10/10. GREAT FUN!"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "sipreana",
        "review_rating": "6",
        "review_title": "LOL for the first time in a long time",
        "review_detailed_main": "I laughed out loud for the first time in a long time. Especially the animal-lines were big fun. I liked the many references to other movies too. Eddy Murphy however needs a great deal of assistance in making a success of his movies lately. I'm still drawn to films featuring Eddie, but you can't be sure of a hit anymore."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Mehmet Karaca",
        "review_rating": "1",
        "review_title": "Your Children Will Love It, Will You?",
        "review_detailed_main": "I have a feeling that Dr. Dolittle was intended for an audience composed entirely of children. I think I would have had a better time if I sat at home and watched a sit-com. My favorite characters in the movie were the pet hamster and the two alley mice."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "YankeeJD",
        "review_rating": "",
        "review_title": "Genuinly Funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "AndyInThePieWithAlmonds",
        "review_rating": "2",
        "review_title": "What was it with that tiger?",
        "review_detailed_main": "Why oh why don't blockbuster movies simply stick to their selling point? Everyone in the cinema, young and old, was there to see talking animals make jokes, and whilst they did that we were all happy... And then, as with Lost In Space, came the two killer blows - plot and sentiment. Who really cared what happened to the tiger or whether Eddie Murphy made up with his daughter? Not me, that's for sure."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "3",
        "review_title": "Hopefully, this doc doesn't make house calls.",
        "review_detailed_main": "Here is another Eddie Murphy comedy that if you saw the trailers for it, you have seen all the best parts. This is also a movie that is more marketed to children than adults and that is another problem with it. It bogs down with a lot of sentimental rubbish as well...I don't know if it is just me, but I want to laugh when I go see a comedy, not have a message jammed down my throat. Though this one is probably good for families, the parents should be warned that they are in for a good joke here or there, but the rest of the time it is a bit stupid. Norm MacDonald is rather good as the voice of the dog and Chris Rock is recognizable as well, as for the rest of the voices who is to say who they are, no other actors with really distinct voices seem to be used. Some of the jokes may be a bit inappropriate for children, but they most likely will go over the child's head. For the most part this movie is a slow mover that just isn't all that funny for most adults. Seems like Eddie though is making a career off of this type of movie so more power to him."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "8",
        "review_title": "A childhood favourite of mine",
        "review_detailed_main": "Doctor Dolittle is a 1998 family comedy starring Eddie Murphy,Raven Symone,Kirstin Wilson and Oliver Platt.\n\nMurphy plays the title charcther Dr John Dolittle who isn't like many veterinarians as he can talk to animals,ever since he was a kid. Now as an adult he tries to ignore the animals talking to him,as he fears that he'll be known as a freak from his society.\n\nThings change however when he later befriends a dog named Lucky(the late Norm McDonald) who needs John to help a circus tiger(Albert Brooks).\n\nWill anyone believe him?\n\nOverall I always enjoyed this film having been a fan of Eddie Murphy since I was a kid and no matter what film he is in he always cracks me up like Jim Carrey and the late Robin Williams. If you love animals then this is for you.\n\nVery underrated film."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "taiaha",
        "review_rating": "1",
        "review_title": "A wretched experience....",
        "review_detailed_main": "This will probably appeal to those people who found Benny Hill hilarious and enjoy jokes about bodily functions and their associated noises. My 7 year old daughter lost interest after about 25 minutes and walked out --- enough said."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "mattkratz",
        "review_rating": "",
        "review_title": "you will believe an animal can talk!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "gdeangel",
        "review_rating": "3",
        "review_title": "Eddie Murphy carries the film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "AleaClint",
        "review_rating": "5",
        "review_title": "Oh, Eddie Murphy...",
        "review_detailed_main": "What were you thinking? I'll admit the 1998 remake was entertaining, the way \"Wings\" is at one o'clock in the morning when nothing else is on, but, like \"The Nutty Professor\" Murphy's kid-friendly remake looks like a crime against cinema when placed next to its source material. First off, this is a musical with a beautiful score by Leslie Bricusse (who wrote the songs for \"Willy Wonka\" and \"Stop the World, I Want To Get Off\" with longtime partner Anthony Newley, who stars in this film). Also, Rex Harrison WORKED to learn to talk to animals. It wasn't a magical power he was born with, the man studied! He doesn't need cheesy (if well-cast) celebrity voiceovers and computer-generated mouth-movement to convince us, either. So if you want your kids to settle for second best and, as a result, drag you to mediocre kiddy-fair after mediocre kiddy-fair (which, in the age of \"The Cat in the Hat\" is pretty bad) let 'em have Eddie Murphy. But if you want your kids to have taste and appreciate a quality piece of film-making, rent this film immediately. Even if you have no kids, buy it, rent it, whatever."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "samcracc",
        "review_rating": "10",
        "review_title": "Eddie Murphy is funny",
        "review_detailed_main": "I have seen this movie it was Hilarius and I love this movie. Lucky the dog is cute so does Rodney the Gennie pig. The tiger is very cool. Paul Rebuns (Pee Wee) The voice of the raccoon was interesting. My favorite part when Eddie Murphy as Dr. Dolittle leaves Rodney on the sand. Whats funny that the tiger was going to jump off the inside building. Whats sad that the tiger has sickness, double vision, and headaches. This story is about a Dr. who takes care of animals. In this part a lot of animals where in Dr. Dolittle. Hamilton Camp has a fantastic voice for the pig. Chris rocks voice of Rodney is Hilarius. You will love this movie Eddie Murphy is Hilarius as heck."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "SMLA11",
        "review_rating": "9",
        "review_title": "Highly underrated",
        "review_detailed_main": "This is a very underrated movie. The comedy was pretty good. This one is just too underrated by many people. Acting was good enough. Eddie is still good and I enjoyed him as Dr. Dolittle, a doctor who can talk to animals. The plot is Dr. Dolittle finds out he can talk to animals. When he tells people this, they think he's crazy. Soon enough he has to save a tiger in the zoo. The plot is a little dumb but overall I liked the movie.\n\nOverall the acting is good enough, the plot isn't that bad but it's not good, and this had enough laughs to pass by. Rating 7 out of 10."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Catherine_Grace_Zeh",
        "review_rating": "10",
        "review_title": "Excellent movie that's sure to tickle your funnybone",
        "review_detailed_main": "In my opinion, DOCTOR DOLITTLE is an excellent movie that's sure to tickle your funnybone. When John (Eddie Murphy) rediscovered his ability to talk to animals, I was really impressed. A lot of the time, when they talked, I laughed really hard. One of the parts was when Lucky (voice of Norm Macdonald) used the toilet and flushed it. There were lots of other parts that made me laugh, too. Before I wrap this up, I'd like to say that the performances were hilarious, the production design was outstanding, and the costume design was perfect. Now, in conclusion, if you are a fan of Eddie Murphy, I highly recommend this film! You're in for a lot of laughs, or your money back."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "claudonio",
        "review_rating": "10",
        "review_title": "One of Eddie Murphy's best",
        "review_detailed_main": "This is one of Eddie Murphy's best movies, it is entertaining,and suprisingly endearing. I think it is a vastly underappreciated film especially by critics. I reccomend this film for anybody who wants to be entertained and have a good time.***1/2"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "phyphor64",
        "review_rating": "10",
        "review_title": "Freaking HILARIOUS!",
        "review_detailed_main": "I don't know why this is rated so low, it's freaking hilarious! Not good for little kids because of the language, but still funny as hell!"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "lukem-52760",
        "review_rating": "8",
        "review_title": "GREAT HARMLESS FAMILY FUN, I HAVE NICE MEMORIES OF THIS FILM",
        "review_detailed_main": "I love Eddie Murphy, that's my first thing & i grew up watching him like i did lots of other favourite actors of mine & i adore his Nutty professor films & The Golden Child & Trading Places & his Beverley Hills Cop Trilogy & his 48 hours films & many more, the guy is a Comic genius & a movie legend, he's been making me laugh for years now!!!\n\nNow after his glory days of the 80's & abit into the 90's he started heading into more family friendly films & that was fine as he made some feelgood gems that are still loved today & as an adult with kids myself i appreciate his \"Family Films\" even more so.\n\nHis family flicks are The Nutty Professor 1&2, Dr. Dolittle 1&2, I Spy, Daddy Day Care, the Shrek films, Meet Dave, Norbit, The Haunted Mansion & the truly excellent Showtime.\n\nEddie Murphy has been a busy man his films were always hits at the Cinema especially his \"Kid Friendly\" films & one of his biggest hits was the first great fantastic Comedy \"Dr. Doolittle\" & i can see why, i loved this during the 90's & watched it over & over on video like i did the Great Nutty professor films, so i have nice memories & Nostalgia for Dr. Dolittle & remember watching it on video in my room alot.\n\nHere Murphy plays a Doctor who can hear Animals talk & it's a gift he had when he was little but lost contact with it until much later in his professional adult life when he accidentally nearly runs over a dog. It's a fun fantasy set-up for some hilarious scenes with a panicking Murphy & his trying to ignore it all, this is simply a harmless feelgood Comedy than anyone can enjoy, i always loved Eddie Murphy here in his role as the stressed out family man who is coming to terms with his Gift, it's very funny at times & has a genuinely nice & Happy feel to the whole film, it's a friendly feelgood flick that is entertaining & very re-watchable even as an adult!!!\n\nThere's lots of fun Animals & recognisable voices & there's that very 90's look & feel that i love as i grew up in the 90s.\n\nJust because we grow up it doesn't mean we have to leave behind the Happy fantasy worlds we used to visit often.\n\nIn an often dark & scary world it's nice to watch something sweet & fun."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "sexy_one",
        "review_rating": "10",
        "review_title": "Eddy Murphy is hilarious!",
        "review_detailed_main": "A great movie. Eddy Murphy (Doctor Dolittle) is awesome. The comedy of animals talking and almost driving Dr. Dolittle insane is great. The guinea pig, Rodney, also livens up the film with his cute, snide remarks. The movie's a real role model for the term \"Comedy!\""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Coxer99",
        "review_rating": "",
        "review_title": "Doctor Dolittle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Very exciting...",
        "review_detailed_main": "How cute, I've never watched it, I'm not interested in comedies, with little animals even less, but what a cute, grateful surprise, it even managed to move me in the final part of the tiger surgery, very exciting... Kristen Wilson, what a beautiful woman..."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "movies2u",
        "review_rating": "",
        "review_title": "A Fun Family Comedy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "GrantCAGE",
        "review_rating": "9",
        "review_title": "Fantastically Modern Animal Comedy!",
        "review_detailed_main": "This is a fantastic animal comedy! Eddie Murphy is superb as Dr. John Dolittle who re-gains his talent to hear animals talk. The animals in the cast are just fantastic and the dubbed voice-overs are spot on. The funniest for me was the funky guinea pig Rodney who has some great, heart-warming lines throughout the movie. The great thing about this movie is that it's not old fashined and over-the-top, it's fantastically modern and funky and throughly enjoyable. The effects in this movie are as fantastic animal effects as I've ever seen and the voice styles of each animal are just perfect. Overall this movie is a really enjoyable, fun and light-hearted flick that children and adults will both enjoy. Fantastic! LOL"
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Peter T. Movie",
        "review_rating": "",
        "review_title": "Fun to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Adriane",
        "review_rating": "8",
        "review_title": "Everybody leave this movie alone, it was funny!!!",
        "review_detailed_main": "This movie was good and I don't know why everybody said that it was so bad. It was way better than 2 of the worst movies of the year, Armageddon and Godzilla. Eddie Murphy is one of the funniest men today, and will always be. Loved the animal voices, especially Chris Rock, Jenna Elfman and Norm McDonald. Recommended for kids and adults, my eight year old sister loved it."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "smackg-82317",
        "review_rating": "8",
        "review_title": "Easy to see why this was a success",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "HotToastyRag",
        "review_rating": "8",
        "review_title": "Very cute modern take",
        "review_detailed_main": "My advice is to start with the Eddie Murphy version of Doctor Dolittle. If you've missed all seven movie versions of the classic books, start with 1998. It's very different than the 1967 classic, and if you start with that one, you don't stand a chance at enjoying the modern version. This one takes place in 1998 San Francisco, rather than 1850s England, and it's not a musical. Nor does Eddie Murphy travel the world in search of a rare pink seasnail. Instead of being a linguist who's mastered over 400 animal languages, all the animals communicate with him in English.\n\nBut it's very, very funny! The premise, though different than the original, is just as interesting. Eddie talked to his dog as a child, but learned to tamp down his talent when his father, Ossie Davis, shamed him. Decades later, with a wife and children of his own, he hears the voice of a dog who he almost crashed into on the road. He realizes his talent has resurfaced, and he struggles with accepting it. He can help animals, and because he's a medical doctor, he can even heal them. Just imagine how wonderful it would be if veterinarians could actually talk to their patients.\n\nA side plot involves the merger of Eddie's medical practice, with business partners Oliver Platt and Richard Schiff, to a larger conglomerate. Also, because Eddie tries to hide his dialogues, when he does occasionally get overheard talking to monkeys or rats, people think he's crazy! It's a very funny take on the original story that can be accessible to modern audiences, and with one added bonus: voice cameos. Tons of celebrities voice the different animals, and with no opening credits, you're left to guess who they are until the very end - it's great fun!\n\nDLM Warning: If you suffer from vertigo or dizzy spells, like my mom does, this movie might not be your friend. When Eddie Murphy drives with the guinea pig in the beginning of the movie, it shows the animal's POV for a few seconds. Also, when Lucky first gets taken into the vet's office, his POV is shown for a few seconds, and it will make you sick. In other words, \"Don't Look, Mom!\""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "amarak",
        "review_rating": "9",
        "review_title": "Guinea Pig steals the show",
        "review_detailed_main": "Eddie was in top form, \"but never work with animals\", because they steal the show....\n\nThe Guinea Pig and dog, get all the best lines. It is a laugh from start to finish. Please watch this film you will love it.\n\nA real \"feel good\" film."
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "kahless-2",
        "review_rating": "",
        "review_title": "Out With The Dogs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Evan-35",
        "review_rating": "",
        "review_title": "A dog urinated! That is funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "kurri_1999",
        "review_rating": "",
        "review_title": "Fifteen Years and Now This!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "TheNGBCh",
        "review_rating": "",
        "review_title": "What the hell do you think barking is?, an involuntary spasm!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Terri-5",
        "review_rating": "",
        "review_title": "Entertaining but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Coolguy-7",
        "review_rating": "",
        "review_title": "One of Eddie Murphy's greatest hits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "CDRBev",
        "review_rating": "",
        "review_title": "Give it a chance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "eman-3",
        "review_rating": "",
        "review_title": "Eddie plays a animal hating father who discovers that he has the powers to talk to the animals.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "alan-99",
        "review_rating": "",
        "review_title": "I really loved this movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "smla02",
        "review_rating": "",
        "review_title": "The 'doctor' is in",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "David, Film Freak",
        "review_rating": "",
        "review_title": "\"...Do a li'l dance, make a li'l love, get DOWN t'night!...\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "TornadoK",
        "review_rating": "",
        "review_title": "Funny and Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "no never",
        "review_rating": "",
        "review_title": "Eddie Ain't a Cruiser",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Trtlervr",
        "review_rating": "",
        "review_title": "This is a children's film?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "Pat-88",
        "review_rating": "",
        "review_title": "Weak Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118998",
        "movie_name": "Doctor Dolittle",
        "movie_rating": "5.4",
        "review_username": "iceegg22",
        "review_rating": "",
        "review_title": "funny",
        "review_detailed_main": ""
    }
]