[
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "EarthwormJimFan",
        "review_rating": "6",
        "review_title": "Harmless fun for a young audience.",
        "review_detailed_main": "I grew up watching the 80's version of the chipmunks, so when I first saw the trailer to this predictable but cute live-action update, I was somewhat happy. Although I knew that the humor would be targeted at a crowd under 10 years old, I still wanted to see it, especially since the 1980's animated film THE CHIPMUNK ADVENTURE is still one of my all-time favorite animated films.\n\nTHE PROS: Well I went and saw it, and my expectations were met. It was more for younger kids, but it was throughly enjoyable. It was good to hear the Chipmunks sing their classic Christmas song, there were plenty of funny (but not hilarious) moments, and the Chipmunks themselves were well-animated and undeniably adorable (particularly Theodore).\n\nTHE CONS: The story is predictable (although typical for most kid's films nowadays). Jason Lee is badly miscast as the Chipmunks' long-suffering songwriter and adopted father, David Seville. Also the \"romance\" between Dave and his neighbor is too clichéd. We don't need some sort of love story in every single film in my opinion.\n\nOverall, there is nothing brilliant about this film, but it's still fun. It ought to please young children and their parents.\n\nBOTTOM LINE: It's no Citizen Kane, but it's more fun than a Hula Hoop."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "LazySod",
        "review_rating": "6",
        "review_title": "Not too bad",
        "review_detailed_main": "Alvin and the chipmunks. I guess just about anyone that has ever watched television cartoons knows them. Right before their 50th birthday they make another appearance, this time on the cinema screen in a film that just like Garfield (2004) combines live actors and computer graphics. The story of the film is no new one: a guy becomes the more or less unwilling host to the chipmunks as their tree is demolished and together they roll from one adventure into the other.\n\nFor the rest there is not much to tell about this film. It is worked out well enough and most kids will enjoy it. I know the one I watched it with did. It isn't half bad for the adults either. Graphics have been done well enough and the actors work with it well enough to make a nicely working film. Storyline is rather straightforward and very predictable, but not really to the point of being irritating.\n\nAll in all, typical children's film that works out well enough for the younger audience and that doesn't put the parents to sleep right from the start 6 out of 10 chipmunks singing"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "laci-5",
        "review_rating": "5",
        "review_title": "I was expecting much worse",
        "review_detailed_main": "A CGI+ live action movie from the director of Garfield 2.? Also, once again a movie with a loser \"dad\" character and some very bad children (okay, they are chipmunks but behave just as children as they are kids) like Daddy Day Camp and others? Actually, the chipmunks make all the difference and save the movie. What does not work with Garfield (warm Hollywood-emotions and the animal as a fast rock star-type) works perfectly with the chipmunks. Also their animation is never off-setting as it quite often was with Garfield. And even after almost 50 years, it still makes you smile to hear them singing. When you watch the trailer you can see that poo-eating part which I see is in the movie just to bring in that type of audience - I think it is a bad idea as it makes others think twice before buying ticket for this movie which has only one fart joke and this poo joke of this type of \"humour\". Otherwise it is watchable and the animated characters are even lovable (Jason Lee is not so great in this). It was a fun travel back in the time when I watched them as a child. Not a big movie, also there are problems with the pacing but it's much better than expected."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "freakfire-1",
        "review_rating": "1",
        "review_title": "Painful Chipmunks",
        "review_detailed_main": "Sometimes things need to keep away from the 'big screen'. And this is one of those instances where cartoon is better as cartoon in 30 minute segments rather than a 90 minute CGI. Just like with the movie Garfield, the movie doesn't do anybody justice.\n\nI guess the creators thought it would be cute for the Chipmunks to sing lots of popular music numbers created within the last 10 years. But I found nothing amusing with the destruction of songs I knew. Nor did I really feel there was any character development between Dave and his love interest. And where were the Chipettes?\n\nThe plot was corny and unbelievable. Somehow for the Chipmunks to attain such success rather quickly is just Hollywood interpreting life in an highly unrealistic way. Not only that, but it felt too superficial and boring. I wish kids would watch something else than this waste of time. \"F\""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "katyzone",
        "review_rating": "7",
        "review_title": "Good Fun!",
        "review_detailed_main": "Gotta kid? Then you know all about this movie cause that is all you hear about. It is all I heard about for the last week and so I finally saw it with my cousin who is a mother to a 7 year old- she really wanted to see it first. So, let me say this: There will be no problem letting her 7 year old watch it.\n\nI kinda enjoyed it too seeing how I had to be dragged to it. But once there I was not bored and there seemed to be a crowd that apparently was expecting a treat of some kind as several appeared to be veterans of earlier showings who had then gone out and grabbed their posse to watch it again (only with them this time).\n\nNice way to spend a Saturday with the kids and grab a laugh or three. Anyway, I'll give it a thumbs up!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "dramaqueenc1023",
        "review_rating": "2",
        "review_title": "Surprisingly... bad.",
        "review_detailed_main": "I went into this movie with semi-high expectations after loving the cartoon series in my childhood, and this nearly wrecked that love for me. Jason Lee, David Seville in the film, is horrifying. I understand it can't be easy to act with CGI characters who aren't actually there, but I really found his performance atrocious, along with all the other non-animated characters. The chipmunks were adorable, yet sometimes blatantly obvious at moving the plot of the story along, and therefore did not tempt me to stay in the theater for longer than half an hour into the film. If you feel you must see this film, rent it, at the most. It is NOT worth eight bucks to see it in theaters, unless you'd like a good laugh at the horrible acting."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "intelearts",
        "review_rating": "6",
        "review_title": "Fast, Furry-ilicous, and Fun...",
        "review_detailed_main": "Alvin and the Chipmunks should keep an eight year old pretty happy.\n\nThe Chipmunks are, of course, adorable, and Jason Lee does his usual character with usual aplomb.\n\nThe effects are amazing: they really are there. The music was fun, and overall it is silly and funny enough to make even adults laugh.\n\nThe surprise is how charming it all is.\n\nWe weren't sold on the plot (evil record producer takes innocent Chipmunks and introduces them to a crushing schedule) but we loved the set-up scenes.\n\nDoesn't require any thought to enjoy and it is genuinely funny in places.\n\nEven adults won't be annoyed..."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Dragoneyed363",
        "review_rating": "4",
        "review_title": "Cute, but not cute enough",
        "review_detailed_main": "I certainly was not expecting a masterpiece when I was prepared to view Alvin and the Chipmunks, but I knew I was, at least hopefully, in store for a fun and enjoyable time. Now, having seen the film more than once, sometimes unwillingly I must admit, I would say that it is an okay movie for kids, but that is it, nothing more.\n\nIt follows the lovable story of Alvin, Theodore, and Simon, which has been around for quite a while, it is just less lovable as a big screen motion picture. When I started watching this movie, I immediately assumed it was going to be really good, because I do have to admit I kind of loved the old cartoons, what I saw of them at least, and was expecting that love to contribute to my viewing of the movie. I was actually sort of disappointed with what kind of film it turned out to be. Yes, of course kids would love this film and maybe some adults would like it, because it was a cute film, but, I would say it is definitely and never should be called great for the plain and simple fact that they tried way too hard at times with crappy jokes and humorless antics that the chipmunks I knew and loved from the TV series were a bit annoying.\n\nThere were a few laughs, well, chuckles really, and I certainly was intrigued by the story plot, but overall I think there were a lot of things that could be changed, like how at the start of the film no one seems to notice the chipmunks running across the building floor and hopping into the muffin basket. I mean, they are small but not that small, and plenty of other things I could tell as well, such as the humorless antics I mentioned earlier, in example, toilet humor, which is sad that that seems to be a big gimmick in children films today, but I would rather not have to make this a spoiler comment by continuing to express my likes and dislikes of the film in full detail to the point where everyone is drooling a little; I'm sure by this point you have either agreed or disagreed with everything I have said.\n\nWell, show this to your kids because they will laugh their butts off, but as for adults and teenagers I would say to expect the unexpected which could be anywhere from you liking this movie as the kiddie film it is, to thinking it was just okay and being mildly entertained, maybe even disappointed if you are a really big fan of the old cartoon series."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "dreyes1924",
        "review_rating": "7",
        "review_title": "Well let's put it this way...this film made me smile and i happen to walk again along memory lane :)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "davispittman",
        "review_rating": "1",
        "review_title": "A flop",
        "review_detailed_main": "This movie was such a complete bore! It wasn't humorous, cute or even mildly entertaining. No, instead it was annoying, poorly written, crude and stupid. Alvin and the chipmunks are supposed to be funny and cute, and someone needs to let this film in on that little secret. The acting was bad from lead Jason Lee, I feel like he didn't even try, which I can kinda understand, based on the material he was given to work with. If you wanna sit down with your young children to watch this, then they might enjoy it, young meaning like the 2-5 range, but anyone older is probably gonna be bored or annoyed. The chipmunks singing wasn't even that fun or entertaining either, once again, it was uninteresting and just downright bland. Sorry, but unfortunately the filmmakers behind Alvin and the chipmunks wasted the potential of what could've been an amusing film, instead they went for dumb and annoying and bland. Yep that basically sums it up for Alvin and the chipmunks, and dear god I haven't even seen the many sequels. Do we really need soo many chipmunk movies?? Do we? How about we give sequels to movies that actually deserve them. 1/10."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "simonparker1990",
        "review_rating": "8",
        "review_title": "Full of nostalgia, bound to make new fans as well!",
        "review_detailed_main": "When the box office figures for the US came in this weekend I was absolutely horrified! Sure I expected I Am Legend to do well, but the amount that Alvin and the Chipmunks got ($40+ million!) seemed absurd. Added to that the fact that it had earned more than Golden Compass did in its opening weekend just seemed ludicrous. The trailers I had seen seemed very mediocre and I wasn't looking forward to seeing it that much. So what a surprise, and a delightful one, to say how much I really enjoyed the movie. Sure its a kids movie through and through, and if you're not into talking animals then you will come out of this movie and criticise its plot, script and usual more adult things that critics criticise about. But if you go in willing to sit back and enjoy the movie you will realise there is a lot to enjoy. The three leads themselves, Alvin, Simon and Theodore if you've never seen the Chipmunks before, are all very likable and have some hilarious moments. The movie features consistent humour that ranges from fart jokes for kids, to some really subtle references, most notably one to Die Hard where for one moment I thought Alvin was going to complete his Yipee Kiyay moment and make the parents gasp in horror, he doesn't so don't get too excited. The script itself is pretty decent, there are the obligatory clunky sentimental bits, but generally the movie is consistent and full of laughs. It does outstay its welcome admittedly and feels that little bit too long, but these are mere quibbles as this is a movie that is bound to entertain many kids and adults alike, and the fact this did better than Golden Compass no longer frustrates me, as this is admittedly a much better movie than Golden Compass.\n\nThe three leads of the movies are CGI creations, they are also surprisingly voice by Justin Long (Alvin), Matthew Gray Gubler (Simon) and Jesse McCartney (Theodore), though you'd never know as obviously their voices have been morphed so they sound much more like the Chimpunks. Anyway their voices sound perfect, Theodore's being the most distinct and will make many audiences world wide sit their and go awww. Alvin is a great lead and has some brilliant moments. Simon is the most dull of the three but has some pretty funny moments as well. But its when the three start singing the movie just comes to life, the Chimpunks Christmas song definitely gave the older members of the audience to relish in, and their rendition of Funky Town is by far the highlight of the movie. The actual adult cast themselves are pretty decent. Jason Lee, from My Name is Earl, is a decent enough lead and at least does better than the adult actors in Garfield who seem almost asleep. When the sentimental stuff kicks in admittedly he does stumble a little bit, but generally Lee is on top form and definitely isn't always overshadowed by the chipmunks. David Cross does the traditional villain role pretty well, although he does start to irritate after a while and when he goes into pure evil mode later on in the film he just seems a bit silly. But by far the worst character in the movie has to be Claire, played by Cameron Richardson, she is out of place in this movie and the romance thing never plays off at all.\n\nWhere Alvin and the Chimpmunks succeeds where movies such as Garfield and Scooby Doo have failed is the fact it succeeds in the comedy department. Sure the movie has its nostalgia factor, but if it wasn't funny then the movie would be a disaster. Thankfully this is a very funny movie. The fart jokes are obviously aimed at kids, but thankfully there aren't that many of them, in fact when you compare this to something like Garfield you realise how well the scriptwriters have done keeping this to a minimum. Slapstick is obviously a big part but done very well and there are many set pieces that will please audiences. The songs as I have said are definitely the highlights and as I've said before the Funky Town rendition is just pitch perfect. There are many one liners to be found as well amongst amongst some of the clunkers that appear later on. The sentimental scenes also are not as horrific as some more recent family movies have been. In fact some of the scenes generally do warm your heart.\n\nOverall Alvin and the Chimpunks is a surprisingly good movie that is definitely something parents should take their kids to see this Christmas. While maybe not as good as Enchanted this is definitely better than Golden Compass, and kids will lap this up. So the obligatory sequel that will arrive seems perhaps a more joyful event then it seemed before I saw this movie. In fact a sequel now seems quite a decent idea."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jburtroald95",
        "review_rating": "7",
        "review_title": "Delightful if only viewed once, disgustingly dull if viewed multiple times.",
        "review_detailed_main": "A truly enchanting full-length live-action and computer-generated motion picture based on a 1960s cartoon series that is an all-ages comedic delight with a hidden message.\n\nIt all begins when three adorable little talking chipmunks Alvin, Simon and Theodore are happily storing food for the winter in a tree they've made their home. Suddenly their happy little house is cut down and put up in a work office building as a Christmas tree. There the threesome stumble across a music composer named Dave Seville (Jason Lee) who is forever struggling to impress his boss \u0096 Ian Hawkes (David Cross) who is a monster lurking beneath the surface \u0096 and achieve success.\n\nWhen Dave hears the chipmunks' marvellous singing abilities he agrees to let them live with him in his house. This action immediately sets off a chain of outrageously funny events as the mischievous trio turn Dave's life upside down.\n\nThis charming hour and a half of nicely-done entertainment will be highly enjoyed by young and old. However, for those intending to buy the DVD it may have lost its sparkle the second time round."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Give it credit, it's a kids movie",
        "review_detailed_main": "When I first saw the trailer to Alvin and the Chipmunks, I was horrified, I'm 22 years old, I grew up with the chipmunks cartoon in the 80's and 90's. But after thinking about it, the chipmunks have been around since the 50's, my generation's chipmunks were a new introduction to us as well as this movie is to the kids of 2007. So my boyfriend and I checked out Alvin and the Chipmunks tonite just to see what it was about and you know what? I think it was cute for what it was. There are flaws here and there about the film, but it was meant for the kids, you have to admit. But the voices and characters are cute and the story works. It's a new story to the chipmunk's tale and adventures.\n\nAlvin, Simon, and Theodore, three singing, talking, and dancing chipmunks have just got their home(a tree, naturally) torn down and they are taken into the city. They jump into a basket being carried by Dave, a failing song writer, and they go home with him. He first shoves them off, but after hearing their singing, he comes up with the idea to write songs for them and see where it goes. They are a success and everything seems to be going very well for them. But until the music business takes advantage of them and tears their family apart, they realize that Dave is really who they need.\n\nAlvin and the Chipmunks of course is not the movie of the year, but for a kid's movie, it was very cute. Judging from my generation of Alvin, Simon, and Theodore, yeah, it was strange seeing them through what this generation considers cute and fun was a bit silly to me. I wished that they would've focused more on the building of the relationship between Dave and the boys, but I guess that might leave room for a sequel. Now, if you're looking for Citizen Kane, don't see this movie, if you're just looking for innocent fun and a cute family flick, I think you might enjoy Alvin and the Chipmunks.\n\n5/10"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jkaplan67890",
        "review_rating": "1",
        "review_title": "it should be illegal to give this movie more than one star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ismaeelbuttib",
        "review_rating": "7",
        "review_title": "Alvin and a good movie",
        "review_detailed_main": "Very nostlagiv and good I love this and the other 3 movies"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "raypdaley182",
        "review_rating": "2",
        "review_title": "Just for the really young kids.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "MB-reviewer185",
        "review_rating": "6",
        "review_title": "Good enough",
        "review_detailed_main": "Not the best but it has funny scenes I remember.\n\nYou might like it and you might hate it, but it will be enjoyable."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "cschuft",
        "review_rating": "1",
        "review_title": "disappointing",
        "review_detailed_main": "I'm surprised to read all the positive comments on this movie. Even my 4 and 6 year old were bored. The chipmunks are cute...but the storyline is overly obvious. Not recommended for young ones with the least sophisticated tastes.\n\nWe did hear a few laughs from the audience while we were in attendance; but I wondered why.\n\nI don't admit to ever being a 'chipmunks' fan, but I expected to be entertained. It's not even an 'escapist' movie as far as I can tell. Simply a heavy handed view of 'success too young spoils'. We've seen more than enough of that with Britney Spears, et al, haven't we?\n\nDon't bother."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kingsambassador",
        "review_rating": "7",
        "review_title": "Can't get enough of the 'munks",
        "review_detailed_main": "A big surprise of this film is that it does nearly everything just right. Good story (just what is needed and nothing more), great casting, and a wealth of fun, catchy chipmunk tunes. \"Alvin and the Chipmunks\" engages adult audiences as well as the kids who just can't get enough of those squeaky voices.\n\nThe film separates itself from other kid movies through its 'intangibles'...simple things from the choice of Dave's home (with the clever address of '1958', the year which started it all) to the facetious opening scene with the three chipmunks \"angering a tree\" after they \"had a bad day\".\n\nJason Lee is an outstanding casting choice for Dave Seville, the original Chipmunks guardian/songwriter (and stage-persona of Ross Bagdasarian himself). As Dave, Lee keeps a plausible rapport with the chipmunks, reminiscent of Joel's rapport with the machine creatures of \"Mystery Science Theater 3000\", only with the added ability to warm to the chipmunks' charm as a reluctant father might.\n\n\"Chipmunks\" sticks to the ageless themes of the importance of heeding one's parents and of doing what's wise rather than just what feels good at the time. Dave and his Music Producer Ian Hawke (David Cross) both battle for the chipmunks' attention as symbols of good and bad, respectively.\n\nAnother big plus for the film are the chipmunks themselves. Alvin, Simon, and Theodore are given greater character distinction and development in this film than in any other Chipmunks production. The CGI art was balanced enough to convey their moods & expressions but without pervading too much of the rest of the real-world movie.\n\nThe only disappointments were the inevitable ABC (Annoying, Base, Cliché) kid-movie shticks (e.g., rear end/wedgie references, gas moments, etc.), of which the film has a few early infractions but nothing quite able to dispel the chipmunks' puerile charms or to send adults walking out with rolling eyes.\n\nOutweighing this are the fun, pathos, and music of a classic trio reborn. All in all, young and old alike will all come out wanting talking chipmunk friends of their own."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Horst_In_Translation",
        "review_rating": "4",
        "review_title": "Not much in favor of this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jaypugh",
        "review_rating": "8",
        "review_title": "Great family movie",
        "review_detailed_main": "I'm surprised at the disappointing reviews of this film. I can agree that Jason Lee wasn't the perfect person to play Dave but he still did a pretty good job. I mean, let's be honest here and admit that none of the acting is great in this movie. It isn't horrible but it isn't great either. The thing is that the acting is on par for 90% of kids films. Also, how much can we really expect when it is a story about 3 singing chipmunks? The delight of the film and what people (my family anyway) want to see is the chipmunks get down and boogie. This movie in my mind accomplished everything and more that it might have set out to accomplish. It is extremely funny at times and also has a few heart felt moments. The overall story was very good. There are some morals taught here and you don't always see that with these types of movies. If you are in for some slapstick chipmunk boogie and rock and roll then check this out. I can almost guarantee you that any kid under 12 will love it and it is still enjoyable for adults."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "alexandrajade",
        "review_rating": "6",
        "review_title": "An awful lot of fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "tavm",
        "review_rating": "5",
        "review_title": "Alvin and the Chipmunks was an okay live-action update on '50s cartoon characters",
        "review_detailed_main": "After a month of purposely deciding NOT to watch this movie, I finally decided to humor my friend and see this update on Ross Bagdasarian, Snr.'s, creations from fifty years ago. There were pretty funny scenes when they surprised Dave in the beginning and a hilarious one when their manager, Ian (David Cross), gave each of them a caffeinated iced drink to give them energy. Other than that, this was a mostly by-the-numbers story of the pressures of success and the toll it takes on your health. In fact, the climatic scene when the rodent music group is revealed to be lip-syncing to their own vocals (because of their now-hoarse voices) seems aimed at those who go for such acts like Britney Spears and Ashlee Simpson instead of real musicians who play genuine music (though I don't consider what David Seville-Jason Lee-had auditioned initially for Ian authentic either). It's obvious that Lee (\"My Name Is Earl\") and Cross (\"Arrested Development\") took these roles for a large paycheck though Lee, at least, grows on you after a while. The music performances of the Chipmunks themselves are variable depending on whether you like any of the songs they sing here or the way their voices completely dominate though I admit liking their performance of \"Only You\", \"Funkytown\", and, of course, \"The Chipmunk Song\", and even the updated version of \"Witch Doctor\" (though I prefer the original recordings). Not bad for a reboot though for my money, I think I'd love to see the original version for television from the '50s, \"The Alvin Show\". P.S. What a treat to see the original album covers of The Chipmunks over the years during the end credits."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "WHCernan",
        "review_rating": "2",
        "review_title": "Makes one wish for a train wreck.",
        "review_detailed_main": "You know the old saw about a train wreck? The one about how you can't look away? This movie isn't that good. The only reason you're still there is because you brought your kids and you can't leave them alone in the theater. You might catch a nap.\n\nTim Hill should never work in film again after delivering this awful piece of junk. He manages to take a decent comic actor in Jason Lee and turn him into a robotic, unsure actor in this production.\n\nI didn't have much hope for this movie in the first place, I admit. If it weren't basically the only family film I could take my son to around Christmas, my wife and I wouldn't have gone. God, I wish we could go back in time and stop ourselves. I leaned over to my wife about 10 minutes in to tell her what a stinker I thought it was, but she beat me to the punch.\n\nI'm not kidding. It's putrid. Only David Cross's terrific-as-usual work saves this review from being only 1 star.\n\nThe story is cloying, insulting and stupid, as might be expected for a movie in this genre (although the recent \"Curious George\" was blissfully intelligent and enjoyable). The acting is mostly poor. The decision to \"update\" the Chipmunks songs for today's audience was inadvisable at best and boneheaded at worst. It does not work.\n\nThe chipmunks of old were clever, mischievous and sly. These chipmunks are dumb, somewhat mean-spirited, obnoxious, and in a surprise, needy to the point of uselessness.\n\nEither as a retrospect, a tribute, or as a completely new production, this film totally fails. The final straw? My son couldn't wait to leave. Spend your money renting Curious George instead."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Woodland Creatures Do and Say the Darndest Things.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "helmutty",
        "review_rating": "6",
        "review_title": "Alvin and the chipmunks!",
        "review_detailed_main": "It is based on the cartoon about three singing chipmunks and it is not surprising that the director of Garfield 2 adapting the cartoon into a live-action movie. Basically, the CGI animation of the chipmunks are almost like the CGI animation of Garfield. There are quite a numerous of animals-talking movies like Scooby-Doo, Underdog and Garfield etc. And they never can fail in bringing the cuteness of them. The appeal of them. Kids would probably like the cuteness of them and even end up buying stuff animals of them. Not surprising.\n\nThe story is simple, it does remind me of the Garfield movies' plot. I then remember that the director did direct Garfield 2. I have to admit that the chipmunks are cute and that may draw kids/children to watch it. I do like some of their songs but hearing them sing got me a bit of headache. I am surprised that the cute singing of the chipmunks could match it. The director did a good job for that. Chipmunks are going to become real celebrities as children will buy the cute stuff toys and the soundtrack of the movie.\n\nOverall: It is a movie that kids/children and adults can enjoy. Depending on your taste of the chipmunks. The story may be simple but kids will like the appeal of the chipmunks. It does have some funny scenes, cute chipmunks and songs. That will probably be the appeal of this movie. Your choice. If you like cute animals talking in their squeaky voice, you will like this one. If you can't stand their squeaky voice, this will probably not be an interest to you."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "mysteryfan04",
        "review_rating": "1",
        "review_title": "Painful and Annoying Animals Dominate Horrible Family Film",
        "review_detailed_main": "Looking for phenomenal family entertainment? Then turn back. This reboot of the squeaky-voiced chipmunks just shows how annoying film making can get. The opening musical number is cute, but the film then turns into an immature and predictable film about the \"glory\" of the music industry. Jason Lee is not able to use his clever comic timing to save it. The chipmunks and Alvin simply do not have chemistry or the interesting characteristics needed to make a movie like this fun. Alvin and the Chipmunks is tasteless, childish, and intolerable. Children may want to kill for it; adults will want to kill it. Stay away from this exhausting exercise in family film!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Gar1195-1",
        "review_rating": "6",
        "review_title": "I thought it was okay.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "bellino-angelo2014",
        "review_rating": "1",
        "review_title": "Absolute garbage, worst than ''Baby Geniuses I and II'' and ''Son of the Mask'' put together",
        "review_detailed_main": "Yeah, the summary says it. This is one of the worst movies ever made, there is no doubt about it. Why this movie has an overall rating of 5,2 and it isn't in the Bottom 100 (along with the three sequels) is beyond me. And THIS is the type of movie I'll never show kids. And don't believe all the trolls that rate it 10!\n\nIt has dreadfullness written all over it, all the characters are obnoxious in the way you want to kill them and the music is just the sort of thing you'll likely cut your ears with scissors than hear it, and the jokes are the worst!\n\nAnd seriously, why Jason Lee? WHO ELSE TAUGHT THAT JASON LEE WAS FUNNY? If I was the director I would have contacted and forced Robin Williams, Jim Carrey, Adam Sandler and Will Ferrell instead of Jason Lee. He is everything but funny, as he lacks charisma and credibility, and all the other actors are all incapable of good acting!\n\nThe less I talk of the three chipmunks the better it is, they are so stupid and obnoxious at the same time, and the voice actors don't do nothing to make them likeable!\n\nThis movie is of the same league of SON OF THE MASK, BABY GENIUSES I and II, ED (the chimpanzee that plays baseball movie), SANTA CLAUSE CONQUERS THE MARTIANS, THE CONQUEROR (known as John Wayne's worst movie), MANOS THE HANDS OF FATE, JINGLE ALL THE WAY, EXORCIST II: THE ERETIC and HOWARD THE DUCK: every way you look at them, they are garbage and painful to look at!\n\nI'll rate this one because I hope many users will rate this piece of s**t one like me, and simply because IMDB doesn't allow the zero rating.\n\nAdvice: AVOID THIS MOVIE AT ALL COSTS, BELIEVE ALL THE HATERS, THIS MOVIE IS BAD. Instead let their kids watching something better like MRS. DOUBTFIRE or ACE VENTURA: PET DETECTIVE. They are funny and worth your time!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "frcate76",
        "review_rating": "7",
        "review_title": "Great movie day with my students",
        "review_detailed_main": "I'm a middle school teacher and went with my students to see \"Alvin and the Chipmunks\" during the week before we got out of school for the holiday vacation. I'm very thankful for an enjoyable family movie this time of the year, that is provides this much fun for both the students and the adults going with them. I grew up with Alvin and the Chipmunks and I felt like this movie was very well done. When you take a group of middle school students and have all positive response, that's not bad at all. I wouldn't mind sharing this movie with any company that I might have over the holiday and that's what I'm looking for, especially during the holidays. Very well done!\n\nWhile I might be interested in a movie with more of a plot if I were watching by myself, there are movies that I enjoy that are not appropriate for me to share with students. For one thing, 6th graders don't have the life experience to understand some of the movies that even my older students understand."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "bumblebritches57",
        "review_rating": "1",
        "review_title": "Jason Lee RUINED the movie, and it's sequels.",
        "review_detailed_main": "The movie was terrible, I LOVED Alvin and the Chipmunks when I was little, I even sang along constantly to their music, and I was excited to hear that a movie was coming out, but Jason Lee RUINED this movie, he's SO god damn grating it's literally unbearable to watch. his \"Alvinnnnnnnnnn!\" scream is terrible, his acting is terrible (Literally the worst I've ever seen, Megan Fox is light-years ahead of this douche-bag) the only good *anything* he's ever been in, was My Name is Earl, and that's because he's \"playing\" a white trash character, and given his acting chops, I wouldn't be surprised at all to find out he is actually white trash. there is nothing redeemable about his \"performance\" and the sad part is, the rest of the movie isn't too bad, not great, but I'd give the non Jason Lee parts a 5.5-6. Hopefully Universal will reboot this franchise and actually find a good male lead, and do away with all the cheesiness, and \"we're-gonna-pander-the-movie-to-three-year-olds-because-they- don't-know-what-a-decent-movie-is\"."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "aidantighe-74849",
        "review_rating": "10",
        "review_title": "absolute masterpiece",
        "review_detailed_main": "I had downsydrome and after watching this it cured my diabetes."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "rachelabourque",
        "review_rating": "7",
        "review_title": "Great Kids Movie",
        "review_detailed_main": "I brought my 8, 6 and 5 year old to this movie and they left entertained and happy! Although adults might loose interest after the initial introduction of Dave to the Chipmunks, the story was kept simple enough to keep the kids interest. There was some humor that all of us could share and appreciate. Given that the Chipmunks were not only talking Chipmunks, any parent of small children could appreciate Dave's trouble with them.\n\nThe use of popular music was wise and my 8 year old was excited to know the songs. We actually have bought the sound track for long car rides.\n\nI did loose interest about 3/4 of the way through and was hoping the story would wrap up. There were numerous missed opportunities for more adult comedy that could have been slipped in.\n\nOverall, cute kids movie and the adults got some chuckles out of it as well! Worth seeing for a Sunday matinée."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "therubixtheory",
        "review_rating": "4",
        "review_title": "Started off great, then became extremely annoying",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "indiedavid",
        "review_rating": "4",
        "review_title": "Could have been so much better",
        "review_detailed_main": "The writers missed so many opportunities and created so many plot holes.\n\nExample: When Dave retrieved his keyboard from the rain, I was eagerly anticipating the funny sounds that were going to come out of it. Nothing! Are you kidding me? A truly witty writer would have not only had a field day with that, but it would have eliminated the major problem of the entire audience wondering how a digital keyboard can become completely soaked but then work perfectly.\n\nThere were at least 10 other similar situations. Overall, small children will enjoy this, parents will endure it without too much complaining."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jimatsus",
        "review_rating": "",
        "review_title": "Not 1980s but 1950s",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "Harmeless and cute if unexceptional family fare",
        "review_detailed_main": "This review is coming from a fan of the 80s animated TV show and of the childhood favourite that is The Chipmunk Adventure. I wasn't wowed over by Alvin and the Chipmunks, but it was a cute and harmless film. Same goes for its recent sequel.\n\nStarting with the pros of Alvin and the Chipmunks, the production values are great. The photography and editing are decent enough, the locations are striking and the animation on the chipmunks is very good. The chipmunks themselves are adorable, especially Theodore, not only by their appearances which epitomises cuteness but also their voices which are not too irritating. The soundtrack is quite catchy as well, the film bounces along quite nicely, Hill's direction is satisfactory and there are a number of funny and cute moments even if these moments are never more than hilarious.\n\nHowever, it does have its shortcomings. The story is rather predictable, as it can be with these animated/live action adaptations, and there are some clichéd subplots and characters such as David's romance with his neighbour. Some of the script is weak with some of the jokes falling flat, and I do agree Jason Lee is miscast as David looking rather ill at ease.\n\nAll in all, cute and harmless entertainment but it is also unexceptional in the story especially. 6/10 Bethany Cox"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "partridgecj",
        "review_rating": "5",
        "review_title": "Jason Lee is no Dave",
        "review_detailed_main": "While this is a good film for the kids, it will leave adults that grew up with Alvin and the Chipmunks disappointed.\n\nAny number of other actors would have made a better Dave. Jason Lee does a respectable job, but was the low part for this film.\n\nThe CGI is very well done, but as with this type of film where they are trying to fill in the back story and tell a whole new story in an hour and a half, the plot is rather rushed, almost forced.\n\nIf you have finished your Christmas shopping and have a few extra dollars and have the extra time on your hands with nothing else to do, there are worse ways to spend your time."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "burakparlak",
        "review_rating": "7",
        "review_title": "Fun to Watch",
        "review_detailed_main": "It is fun to watch and you can enjoy while watching it. However, after the half part of the movie, you start to get bored because plot sucks after a point.\n\nAlvin and his small friends are better than human beings at acting in this movie.\n\nMovie could be better because it has potential."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ilikepuppies",
        "review_rating": "2",
        "review_title": "Kitchen Looks Good, but There's Garbage in the Fridge",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "FiendishDramaturgy",
        "review_rating": "7",
        "review_title": "Oh no! They're ... CUTE!!",
        "review_detailed_main": "This isn't a bad movie at all. The CGI is pretty nice, although one never needs to stop and ask one's self, \"Who trained those awesome chipmunks?\" it is still pretty good CG, all things considered.\n\nUnlike other children/family movies of late, this seems to have a plot, but no story. It progresses predictably and does not step one toe into the Land of the Unexpected, the Realm of Enchantment, or the World of Wonder. In fact, this work doesn't seem to know these places exist, but that doesn't seem to lessen the film in its own eyes.\n\nAlthough it does not take itself too seriously, it does take the chipmunks seriously and insists that we do, too. I'm still not sure that I am entirely comfortable with that, but I do know that I am enamored with those horrendous little no-necked fur-balls!\n\nOh no! They're ... CUTE!! ARG! And I'm sure I'll also see the (coughs) Squeakuel.\n\nAll in all? I didn't want to like this...I just couldn't help myself. *sighs*\n\nIt rates a 7.4/10 from...\n\nthe Fiend :."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "sddavis63",
        "review_rating": "4",
        "review_title": "After A Promising Start It Runs Out Of Steam",
        "review_detailed_main": "As cute and adorable as they are, the story of three singing chipmunks just doesn't seem to have enough meat to it to sustain it for an hour and a half. I thought that the first half hour or so of this movie was well worth watching. It was fun, it had a few laughs in it, it was full of energy. Then it somehow just lost that. I wouldn't even say it faded away, because it seemed quite abrupt to me. The fun was gone; the laughter disappeared. My daughter noticed it, too. She's 4 - she laughed uproariously several times in that first part of the movie, then her laughter stopped. Perhaps it took on too serious a tone - the evil movie producer working the chipmunks to death. Something happened, anyway, and it wasn't for the better.\n\nOf course, the movie is trying to tell the story of how the chipmunks (Alvin, Simon and Theodore) began. Everyone knows the Christmas song. Here we discover how they met Dave and got their start. The movie is updated to the present time, although their real origin is noted by Dave's street address of 1958, which was the year when the animated singing rodents were first created. Jason Lee did a pretty good job as Dave and the chipmunk voices were also pretty good. David Cross as the evil Ian irritated me to be blunt, and I couldn't figure out the point of the character of Claire, played by Cameron Richardson. She added little to the movie. It's a movie you can watch with the kids - it's probably a movie you'd only want to watch with the kids, in fact. It gets a 4/10 from me."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "the-movie-guy",
        "review_rating": "8",
        "review_title": "After 50 years Alvin still has it",
        "review_detailed_main": "(Synopsis) Three chipmunk brothers, Alvin, Simon, and Theodore are living their lives in the forest storing nuts away for the winter when one day their tree is cut down and carried off into the city to become a Christmas tree. They must find a new home and they end up at Dave's house. The only thing that makes them different is that they can talk and even sing. Dave Seville (Jason Lee) is a struggling song writer who has a great idea about making the chipmunks a new show act, singing his songs. The only thing is that you must remember is that they are chipmunks and they act like chipmunks by tearing up Dave's house and interrupting his love life. However, they also begin to bond as a family with Dave becoming like a Dad. The chipmunks become a big hit and superstars with cute voices and fancy dance moves. The record company executive Ian (David Cross) sees big money in his future and takes over the act and pushes Dave to the side. Dave must try to save his little family before they becomes a show biz disaster.\n\n(My Comment) I enjoyed this movie because it brought back good memories. I can't believe that their first song was recorded 50 years ago. They have that certain sound that just makes you smile when you hear them. You recognize their sound immediately. The animated characters of Alvin, Simon, and Theodore are lovable now as they were 50 years ago. I always liked it when Dave would scream the name of \"Aaaaalviiiiiiiinnnnnnnnnnn!!!\" and Alvin would say \"OooooK!!!\" Those two words just make you smile. Children of all ages can see this movie without any problem. I am sure that all the parents will like it, and I know your child will, because it is a fun movie. (20th Century Fox, Run Time 1:30, Rated PG) (8/10)"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "saarvardi",
        "review_rating": "7",
        "review_title": "Harmful, entertaining fluff for kids and for adults who've watched the show",
        "review_detailed_main": "I rented this last night and watched it with my wife. Although it's a kids film for all intents and purposes, it's still fun to watch - and some of the more subtle jokes struck a chord with us as well. Yes, the plot is tacky and predictable and David Cross overacted his \"evil\" role, but the overall experience left us smiling once the credits started to roll.\n\nSo... why did we like this? The answer is the result of several factors, the most important one being nostalgia. If you were a child in the 1980's, there was no way you could miss out on Alvin and the Chipmunks, the hit animated series. The real-life version succeeds in being very similar - both in substance and in style - to the nostalgic show. Furthermore, another major point that contributed to this film's success (in my opinion) are the Chipmunks themselves (Alvin, Simon and Theodor) that are cuter and more adorable than ever in their CGI versions. Kudos to the animation department on that one.\n\nAll in all, there are better and more successful family films out there, and Alvin and the Chipmunks is certainly far from being a deep and meaningful film that you'll want to cherish throughout the years. However, the good thing about it is - it never intended to become a classic. Instead, it sticks at what its good at being - harmful, entertaining fluff for kids and for adults who've watched the show.\n\nI gave it 7 out of 10."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kscollins-53296",
        "review_rating": "3",
        "review_title": "The cold hands of society ideals entrance me more than this movie",
        "review_detailed_main": "This movie made me consider immigrating to North Korea, just to be away from this atrocity. Even a one way trip to Mars is better. I'd rather give birth to a live elephant. I'd rather rip my fingernails off. I'd rather eat at Taco Bell. This movie is like how bile tastes. There's also nudity, and it is a one way track to sin. Our economy is plummeting and this is how the government repays us. The cold hands of capitalism have me in a vice I can not escape. One day the death of society with come for us all, in the form of horrendous high notes and outdated clichés. This movie is a dark abyss, and I'm tired to the lies."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "lisafordeay",
        "review_rating": "2",
        "review_title": "Cute yet one of the worst films I have ever seen",
        "review_detailed_main": "Where shall I start with this one well for starters if you've got kids who are 2 or 9 years of age then they will love this one but if you are a 19 or over my age then you will give it a miss and watch it once.\n\nThe film is about a struggling songwriter named Dave Seville(Underdog's Jason Lee)who has to come up with a new song. Of course he hasn't a clue what to write for the next track but three irritating chipmunks named Theodore(the cute fat one voiced by singer Jesse McCarthey),Simon(the geeky one with the glasses voiced by Micheal Gray)and finally the leader Alvin(voiced by Justin Long who mind you was great at the fast forward voice over for Alvin). All three of them help Dave with his songs and the manager for some record company wants to have the chipmunks for himself so that they will earn a living.\n\nThe whole film was so stupid and annoying yet some parts were funny. The three annoying chipmunks almost gave me a migraine as I wanted to turn off the TV but I said to myself right I am going to give it a chance.\n\nFor the film im giving it a 2 and for everything else 1/10.\n\nThis is strictly for kids who like cute talking animals."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "suebasko",
        "review_rating": "",
        "review_title": "Instant classic movie for stoners and tots",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "optimusprimo34",
        "review_rating": "7",
        "review_title": "i expected much worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "4",
        "review_title": "Alvin Sings a Terrible Tune.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "the amorphousmachine",
        "review_rating": "7",
        "review_title": "Very cute reintroduction of 'Alvin and the Chipmunks' to new audiences!",
        "review_detailed_main": "I grew up with the cute cartoon of 'Alvin and the Chipmunks', and I was pleasantly surprised to see a live-action version of this movie come out in 2008. Dave was far more mild-mannered in the 80s cartoon series from memory, but Jason Lee's hoarse but amicable version of Dave suited this movie. He held his own against the CGI chipmunks, and of course, who doesn't love Theodore? The live action version of this movie is like the cartoon- cute! It beats the embarrassingly bad Garfield movie, where Breckin Meyer just didn't hold his own to a CGI Garfield. I think 'Alvin and the Chipmunks' is on par with the 'Scooby Doo' movies, although Lee doesn't quite pull Lillard's great impression of Shaggy. However, Jason Lee is great as Dave, and he does the father figure thing so well, so I warmed up to his interactions with Alvin, Simon and Theodore.\n\nI had no idea who did the voice-work, because of obvious altercations, but Justin Long as Alvin is commendable. Matthew Gray Gubler and Jesse McCartney had Simon and Theodore's voices nailed respectively. David Cross also adds to this movie as scrupulous agent, Ian Hawke, who uses the chipmunks tirelessly for his own personal gain. Not quite a memorable villain, but he does well as the slimy producer guy, and has some funny lines.\n\nThe best thing about 'Alvin and the Chipmunks' is that it doesn't overdo the singing, and that works for me. It's a cute kid's film that will appeal to people who remember the show, but will also appeal to a younger generation.\n\n***½ out of *****!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "rorymacveigh",
        "review_rating": "3",
        "review_title": "Has some OK moments, but bears little to no relation on the original concept",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Putangpi3",
        "review_rating": "7",
        "review_title": "It was surprisingly good",
        "review_detailed_main": "Surprising as this may sound to most of you reading this, the movie was actually quite enjoyable, much to my surprise. I thought for sure I would be driven insane by those three abnormal voices, but I wasn't. Jason Lee performed pretty well, considering his 3 co-stars were computer generated. David Cross was hilarious in his part as \"Uncle Ian\" and had a few moments were I genuinely laughed out loud. The movie itself is pretty funny, I thought it would be a tacky movie aimed at the 5-10 year old age bracket, but after seeing it myself, I would place it in the any age bracket. As you can see these most common misconceptions that I share with most of you (Most probably) were proved wrong. If you have a bit of spare time, I suggest encourage you to go along and see it. I enjoyed it, and I would definitely watch it again. Full credit to Tim Hill for directing such a good movie, Two thumbs from me."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "moviesaccordingtodes",
        "review_rating": "3",
        "review_title": "Alvin and the Chipmunks should have been left as the cartoon.",
        "review_detailed_main": "I know that this is a kids movie but I am a dork and always go to see them. I normally love them because they are adorable and funny and I was so excited to see this one because I loved Alvin and the chipmunks as a kid but wow\u0085this movie sucked with a capital \"S\". I was bored out of my mind. The entire plot was ridiculous and the chipmunks weren't lovable at all. Normally you fall in love with Alvin's rebellious charm. Charmed, I was not. I have to be honest, I could not sit through this movie. I think I got up forty five minutes into it. It couldn't keep my attention, how is it supposed to keep the attention of a child? I was ready to poke my eyes out. It wasn't humorous at all. A total waste of time and money."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Madukp",
        "review_rating": "10",
        "review_title": "This is a very good animation effort",
        "review_detailed_main": "I don't know why people has rated this animation such low. By the way to my own opinion this is a great animation. I am giving 10/10 against all other votes to take this one least 0.01 up. The things I see in this animation,\n\nChipmunk's actions, so cute, so impressionable. The characteristic of each of the chipmunks has been created very carefully, and it is consistence through out the film. The story shows us the real business world behind the music world. The movie is very sensitive. This is a very good animation effort. Please study this film and take your own decision."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "robertallenandersonjr",
        "review_rating": "7",
        "review_title": "The best kids movie in along time",
        "review_detailed_main": "Alvin And The Chipmunks was a surprisingly very fun family movie to watch. I loved the chipmunks in this movie. They were very funny and made this whole movie. I didn't think that I would like this movie but I did for the most part. I liked it for what its worth. I didn't think it was any of my favorites, but if you want a fun kids movie this is it. I don't think that any other kids movie really compare to this one. It was pretty entertaining. It was pretty cute, and enjoyable. The acting played by Jason Lee who took care of the chipmunks was pretty good. It is not very easy to play a part where you have to talk to chipmunks. So I think that you have to give him credit for the most part. This movie didn't have any bad language or anything bad for children. It's the perfect family kids movie to see. The story was a little bit plain and boring. I thought the direction was very good. Some of the message were stating that you should do anything for family. When I left the theatres I said to myself I will rent that and see it more. Overall rent this movie and give it a chance it was pretty good. Their were very many scenes to laugh at. Have fun and enjoy this family movie."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jwilsoncritic",
        "review_rating": "4",
        "review_title": "Some things don't need to be made into movies",
        "review_detailed_main": "Alvin and the chipmunks are household names, and their animated TV series was a huge hit for years, entertaining children across the globe.\n\nIf it had stayed that way, there would be no issue. However, Hollywood's obsession with forcing well known franchises into the 90 minute films has struck again, with this feeling like a glorified, live action episode of the tv show, except this is three times as long.\n\nTo be fair, the special effects still hold up even now, and considering the $60,000,000 budget, that's not much of an achievement.\n\nIf you have young children, they'll probably be able to squeeze some joy out of this, but if you are over the age of 7, be prepared to turn the channel.."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "rorymacveigh-66661",
        "review_rating": "1",
        "review_title": "Oh dear...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "digitalmaleficus",
        "review_rating": "7",
        "review_title": "Good Movie, Sad Reality",
        "review_detailed_main": "I went into this movie expecting another ripoff of my past, ultimately destroying a franchise and all nostalgic ability. I am glad to say this is not one of those.\n\nOne thing I notice myself doing a lot is laughing. There's a lot of giggle moments and a few laugh out loud moments especially involving Theodore. Alvin plays just the same as I remember from my kid-dom days as being a furry version of Dennis the Menace. Simon however seems more like a semi smarter but not smart chipmunk how I remember him being more of a rodent Einstein. Perhaps thats just my own mis-perception. Which brings to mind Dave. I think he is not only the worst portrayed but also worst actor chosen for the role. This isn't Jason Lees fault as much the casting director, for he struggles to play the role, but is just totally wrong for it.\n\nThe movie does emphasize one major fact and thats how Hollywood pretty much destroys everything for a quick buck, which is kinda ironic considering the movie is a remake of an old franchise which personally would have been happy being left in the past for old time nostalgia.\n\nOverall the movie is a good adaptation of an old classic franchise which personally I loved watching and unexpectedly swooned at the beginning of the movie when they sing their Christmas Special original (for those of us who remember.) I especially recommend this for parents wishing to share their past with a modern present which will be enjoyed by the modern era of children.\n\nIm glad to see my expectations were far bested, by a job well done, despite its what seems like fatal flaws, down shadowed by excellent acting by all involved. Bravo!!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Allierubystein666",
        "review_rating": "5",
        "review_title": "They made 4 of these, 4!!",
        "review_detailed_main": "It's a rather standard family affair, and it starts out much better than how it finishes- but in the end Alvin and the Chipmunks proves to be an annoying and rather tiresome little family film that is also just about as forgettable as these films can come. Growing up on these movies as a kid, I tried my best to go in with an open mind, which proved to be surprisingly easy considering I remembered next to nothing about what was going on in this film- and after seeing it, I still don't quite understand what went on. The film is needless to say about talking CGI chipmunks for who whatever reason can talk and sing and begin a music career in the most generic rock biopic sort of fashion. It has its charming moments before all this occurs, but most of that lands in the so bad and campy its fun sort of feel, and nothing about this movie seems to screamed they really tried. The acting in this film is just atrocious at times, and i'm not surprised every single actor who appeared in this film had their careers flushed down the toilet afterwards. I hate to say it, but some of the songs do prove to be catchy, especially \"How We Roll\" and the film is pretty entertaining, even if it's painful to watch at times. In the end, Alvin and the Chipmunks is nothing i'd ever watch again, but I liked it better than I expected to. Its cheesy, formulaic, and mind-numbing but it does manage to have some charm to it from time to time. It won't be anything memorable or mind blowing, but it is a film about talking chipmunks so I guess what do you expect?\n\nMy Rating: 4.7/10."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "view_and_review",
        "review_rating": "6",
        "review_title": "Chipmunks destroy, rebuild, repeat",
        "review_detailed_main": "\"Alvin and the Chipmunks\" didn't translate well into a live action movie. This was an origin story of sorts. This movie tells of how Alvin (voiced by Justin Long), Simon (voiced by Matthew Gray Gubler), and Theodore (voiced by Jesse McCartney) came to meet Dave (Jason Lee), turn his life upside down, then subsequently change his life for the better.\n\nWhen the three chipmunks were taken in by Dave everything they did turned into a disaster, and that's what irked me. They destroyed his house, got him fired, and ruined a potential romantic reunification all within days of moving in with Dave. I was openly saying that I probably would've euthanised all of them. This same extreme scenario in a cartoon doesn't cause the same amount of grief for the viewer. In a cartoon the outlandish and the ludicrous are expected, so you roll with it. In one scene a place can look like a nuclear holocaust occurred and in the next scene everything can be right back in order with no problem. If the same thing happens in a live action movie it triggers a different response.\n\nThe saving grace of this film is how quickly Alvin, Simon, and Theodore end up being a lifeline for Dave who was a struggling songwriter. After first humiliating Dave by not performing upon request, they went on to resuscitate Dave's career. When the chipmunks performed his songs for music exec Ian (David Cross) all was right with the world. But when Ian wanted to milk the chipmunks for all they had with endless performances and commercials, Dave had to come to the rescue."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "myspiderungoliant",
        "review_rating": "4",
        "review_title": "Are singing hamsters a bad example for children?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "H_Spengler",
        "review_rating": "6",
        "review_title": "Decent & Safe for a young crowd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "siddhis00",
        "review_rating": "5",
        "review_title": "wow",
        "review_detailed_main": "The chipmunks are adorable, but does anyone know when this ridiculous ghetto phase is going to end? Directors need to stop ruining old songs. The 'Witch Doctor' song was fine the old way, not in ghetto style!!! If you liked the chipmunks from the 80's, don't watch this movie. To movie makers: Leave the good things alone!!! Jason Lee is a great actor, but I didn't see any similarity between him and the original Dave Seville. I'm sure kids will enjoy the chipmunks because they are pretty funny and the movie has it's good moments. But if you're looking for the REAL chipmunks, you'll enjoy The Chipmunks Adventure a lot better. It doesn't look like an Usher video."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "a-joel624",
        "review_rating": "9",
        "review_title": "Cant believe it was this good",
        "review_detailed_main": "OK, saw it 1st week it came out, then saw it over the winter break holy c*** was it good, i mean for a kid my age(15) i probably would have said OK this movie is a kiddie movie lets go see i am legend, NOPE!!!!! this movie was casted perfectly, and the chipmunks so cute!!!!, only thing was Jason lee do not get me wrong he was good, but only thing was is that he was not aggressive with Alvin, when i say that i mean the typical quote \"Alvin, Alvin, Alvin!!!!!!!!\" was not the best i have heard, then again he only said it once o well. Great movie, love the singing, By far beat I AM LEGEND only in my opioun. THank you Good night\n\n9 out of 10 mo-f******"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jake-584",
        "review_rating": "6",
        "review_title": "OK the first time",
        "review_detailed_main": "\"Alvin and the Chipmunks\" is the kind of movie that you love the first couple of times, but after that your opinion of it starts to go downhill.\n\nOne thing that stuck out after the first two times was Jason Lee's terrible acting. There are some iffy moments in the script, but they would have slid by easier had there been an even slightly qualified actor playing Dave. He was stiff, unconvincing, and almost ruins the movie. The chipmunks, fortunately, are humorous and cute enough to carry the movie. The songs are fantastic as well, and I will most likely buy the soundtrack.\n\nThe character Claire provides a unique love interest. She drops a few comments without breaking a sweat to Dave that left me going \"Oooh . . . burn.\"\n\nAlthough \"Alvin and the Chipmunks\" gets tiring to me after a while, it will be loved by children who have never seen a movie about talking chipmunks."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "brettchatz",
        "review_rating": "5",
        "review_title": "A huge disappointment for fans of this memorable series",
        "review_detailed_main": "There are films that inspire and there are miserable attempts of folly. Alvin and the Chipmunks falls into the latter category. Here was an 80's series that had it all: snappy beatz; great humour and fantastic stories. Take that perfect vision and translate it into a full-length feature film and your idea would look a little different than the gruel Tim Hill came up with. Perhaps he never saw the series? We have Dave, a lonely, bungling artist in a world that's hard on soft bachelors. One day he happens to meet a group of talking Chipmunks. It's that simple. These are no ordinary little animated characters however \u0096 they sing and they talk. So our intrepid musician writes their songs and gives them shelter. The Chipmunks are a huge hit \u0096 America loves them. But can Dave protect them from being exploited by ruthless, greedy men? I advise kids \u0096 and only very young kids \u0096 to see this with their parents. This is not a film worthy of being considered for adult or post-kindergarten entertainment."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "celina_sowadska91",
        "review_rating": "5",
        "review_title": "Great for younger audiences, however, it was torture for anyone over the age of 13.",
        "review_detailed_main": "I'll admit, the chipmunks were cute, and yes the visual effects, and voice manipulation was something to compliment, however, the main actor (Jason Lee), killed any hope (for me at least) of enjoying this movie to the fullest. He was just so hopelessly dull and one dimensional that after about 15 minutes, the cute factor of the chipmunks could no longer satiate my want of solid acting. However, you're hearing this from a 17 year old who went (on free will, I'll admit) to see it with a 9 year, who when I asked what she thought of the movie, said it was 'great!'. I went, just like the rest of moviegoers, due to a brilliant marketing campaign, that was greatly helped by the cuteness, and familiarity of 'Alvin and the Chipmunks' for the older audiences (maybe even the parents, who remember the cartoon version). Come on, who wouldn't want to see a parody of 'Bad Day', the most annoyingly over played song of last year? So I'm confounded as to what to rate this movie. Put simply, kids will love it, the parents might want to fall asleep, and call it day (they will however have to put on a smile when it finishes). I was sitting at the far right of the movie theatre, and thought to myself on several occasions how nice it was that I had a wall to rest my head on, so that I could go to sleep. Anyone's attention span that might get bored of chipmunks, I forewarn you, the acting will NOT be something to lean on; you will have to find the chipmunks amusing, sorry."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "tabuno",
        "review_rating": "7",
        "review_title": "A Nice Updated Version",
        "review_detailed_main": "6 April 2008. Alvin in the contemporary age, taking two of the original Alvin songs and seamlessly incorporating them into the update. This new adapted version from the television original maintains the faithfulness of the key elements of the Chimpmunks over time. Unfortunately the rather predictable, though decent plot, also fused the Chimpmunk characters, Alvin, Theodore, and Simon whose characters weren't quite as richly distinctive as they could have been. This animated movie was nicely accomplished with it technical effects and avoided all of the cheesy moments and instead actually promoted a more compelling humorous animated action. It had a good message and handled its subject matter with care and sensitivity. Seven out of Ten Stars."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kenjha",
        "review_rating": "5",
        "review_title": "Furrily Average",
        "review_detailed_main": "In this comedy, a songwriter down on his luck has the good fortune of meeting a trio of singing chipmunks. It is aimed at youngsters and those grownups who are amused by singing chipmunks. The film tries to be heartwarming but would have benefited from more laughs. The story is predictable and plays like a TV movie. Lee is likable if bland as the guy who adopts the furry creatures. The CGI-generated chipmunks are pretty good, although it's sometimes a little hard to understand what they are saying. Cross is a goofy villain. A similar theme is utilized in another recent film, \"Ratatouille,\" which is much better than this lame comedy."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ganeshkss97",
        "review_rating": "6",
        "review_title": "Cute",
        "review_detailed_main": "Alvin and the Chipmunks,is cute.\n\nI do not know why the critics have trashed this movie.\n\nYeah,I agree that the story is poor and even the screenplay is erratic but its still endeavoring fair.\n\nThe screenplay acts as a major villain.\n\nTim Hill does a good job.\n\nThe music is very good.\n\nPerformance wise-Jason Lee is excellent.David Cross is also good.The 3 Chipmunks rock.\n\nOverall Alvin and The Chipmunks could be watched on television."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Criticman12",
        "review_rating": "2",
        "review_title": "Hollywood these days...",
        "review_detailed_main": "When it comes to Hollywood adapting animated show's/Anime, people always ask, \"Why?\".\n\nOne of Hollywood's worst adaptations of a cartoon show is none other than the CGI-Animated/Live-action movie, \"Alvin and the Chipmunks\".\n\nThe story is about a guy named, Dave(played by Jason Lee), get's help from three chipmunks named, Alvin, Simon, and Theodore, because he's having trouble trying to make a good song.\n\nGood: I thought the acting was pretty good to be honest. Jason Lee does a decent job as Dave and the actor's who did the voices for Alvin, Simon, and Theodore, were pretty good.\n\nThe CGI Animation was also good. I also liked how they had some of the song's because I was a fan of the Chipmunks when I was little.\n\nBad: Everything else was boring. Even though I had a few chuckles here and there, I was bored. Also, why have David Cross as the bad guy? Why?\n\nThis film is strictly for kids and not for any fan of, \"Alvin and the Chipmunks\"."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jaroddfinch",
        "review_rating": "6",
        "review_title": "A funny family movie",
        "review_detailed_main": "I saw this when it first came out and I though it was funny Jason lee is a funny actor he plays in Kevin smith movies. And a lot of other movies too. He a good actor I like a lot of his movies. And what funny is that Justin long did the voice of Alvin lol so if you like family movies you should watch this one it's pretty good I seen like a lot lol."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "lukebohn",
        "review_rating": "3",
        "review_title": "Pure Hatred",
        "review_detailed_main": "If I was Dave, I would pop those annoying little rodents like buttons. They take over his house, constantly singing annoying songs, and basically making sure Dave dosen't succeed in any of his personal goals. I wish I could take their vocal cords and put em in a sealed vault so no one would have to listen to their constant jabbering which would eventually put me in a pre-psychotic mental state. Also, why is Ian even the villan? We would be doing worse than what he does. If you saw a talking chipmonk that dressed like Soulja Boy, would you not be a little frightened? And when it started singing, would you not be a little concerned? The nice thing to do would be steal their talent for money, THEY ARE CHIPMONKS! DOES NO ONE EVEN AWKNOWLEDGE THAT THESE CRITTERS CAN TALK. They all just laugh and dance and fall in love with the talking animals. The only animals where we wouldn't care if they talked would be dogs, birds, and maybe dolphins as long as they were nice. Movie is just unethical."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "o-15333-68548",
        "review_rating": "10",
        "review_title": "absolute classic",
        "review_detailed_main": "Absolutly lovley t was amazing and so good. I was at a loss for words when i finished it THE DRAMA THE STORY TELLING all brilliant. Loved every single little second . The chipmu ks are so cool theodore reminds me of bob the minion."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "guerillagorilla",
        "review_rating": "6",
        "review_title": "Low expectations + better than expected story = decent flick",
        "review_detailed_main": "Hybrid live-action + computer animated flicks have a quite spotty box office record. Tim Hill, the director of 2006's \"Garfield: Tale of Two Kitties\", knows this very well. That movie tanked domestically, just like the first \"Garfield\" did. The main culprit, of course, isn't the realistic looking blending of computer created characters in a live action world. It's downfall was a tepid, one-dimensional storyline pandering to only the pre-K audience.\n\nHopefully, Hill has learned his lesson going forth from \"Alvin and the Chipmunks\". What we have here is definitely no savior of the retro-saturated market of anthropomorphized rodentia movies (\"Ratatouille\" takes the gold for the most creative, fresh and cute rodent flick), but it's better than much of its competition.\n\nThe trio of symphonic singing chipmunks, having been displaced from their natural home in a tree in a far-away forest, find themselves in the big city, having been transported in their downed tree to the lobby of a megalomaniacal music company. Seems their home is now a fresh Christmas tree. Knowing their new digs aren't friendly to little forest creatures a fraction the size of the next largest life form, they find refuge in the muffin basket of one Dave Seville, having been rebuked by his friend-turned-multimillionaire music exec, Ian. The pairing of these octave-gifted munks with this lonely, bumbling musician provides the backbone of the movie's plot.\n\nIt's a relief to have been able to laugh along with the rest of the patronage, comprised mostly of pre-teens to freshly post-teens. Granted, I wasn't rolling in the aisles with them, a sign that I must be more critical (and yes, older) than they are. The innocent, brain-resting humor was impeded by a couple factors. Exactly how many potty & poop jokes do we need in a movie these days? By all accounts, we've been shown enough potty pranks to last us well beyond the current Writers Strike (and maybe until the 3d animation folks give the render farms a rest).\n\nThe cast of actors seems a bit wooden, too. True, it's hard to be especially convincing when they are putting on a show in front of a bunch of void space, but I couldn't help but wonder during the first 10 minutes if a giant pin-up of Jason Lee would have been more dimensional than Jason Lee himself. Due credit goes to him though, for putting in a decent performance this side of Jon (Vacant) Arbuckle. David Cross stole the show, though, for his delightfully weaselly turn as the music exec seeing too many $'s in the Chipmunks.\n\nOverall, I'm surprised by how pleased I was when the end credits rolled. If Hollywood has taught me anything with this genre of movies, it's best to go in with very low expectations and be surprised by the lack of suckage put before me.\n\n\"Alvin and the Chipmunks\" gets 6 of 10 stars."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "zhyarTheChosen",
        "review_rating": "4",
        "review_title": "Egh",
        "review_detailed_main": "What the hell this make zero sense simply do not watch this"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "oliviacoats",
        "review_rating": "3",
        "review_title": "WOULD NOT RECOMMEND",
        "review_detailed_main": "This movie shows chipmunks being irresponsible and trashing a nice guy's house who graciously offered his house as a shared living space. Would not recommend."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "peterw1210",
        "review_rating": "6",
        "review_title": "Simple Story, Executed Well",
        "review_detailed_main": "This story is simple, but it is executed very well. I thought Jason Lee did well as Dave and David Cross was tremendous as Ian. The story moves slow, but I feel as though the ending fell apart in a way, I think the ending of this film could've been much better and the story falls flat there.\n\nOverall, 6/10."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "conradcarlo_venzon-1",
        "review_rating": "2",
        "review_title": "-='Steaming pile of CHEAPmunks'=-",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "yeelir",
        "review_rating": "6",
        "review_title": "Film making at its prime better than the godfather",
        "review_detailed_main": "Alvin and the Chipmunks is one of the most well made movies of all I loved it. To start us off Alvin and the Chipmunks has amazing CGI, the chipmunks look amazingly and spectacularly realistic. Another thing is Jason Lees performance. Jason Lee should of won best actor for Alvin and the Chipmunks. Jason lee delivers an Oscar worthy, wonderful , and dramatic performance for Alvin and the Chipmunks. The filmmaking is also great. This well directed thriller should of been more successful in box office. Another thing that surprises me is that the film didn't win Best Picture in fact the film didn't even go nominated. The films screenplay and dialogue is also amazing it should of won an Oscar for the screenplay. I still can't get over the fact of how great this movie is. Alvin and the Chipmunks is incredibly well constructed and directed and all around a great nay PERFECT film that is most definitely Oscar worthy and even better than The Shawshank Redemption. Alvin and the Chipmunks should get 11/10 and an A+. (im an idiot0"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "veemon_emperor",
        "review_rating": "3",
        "review_title": "The best movie this holiday season!!!",
        "review_detailed_main": "I honestly thought this movie was going to be cheesy, even though I've liked Alvin and the Chipmunks for a LONG TIME! I was was very wrong. IT WAS GREAT!!! It has been the best movie I have seen since October! In my opinion, it's the movie everyone should see this holiday season! Enchanted (I thought anyway...)was awful, The Golden Compass was alright, but the ending was pretty crappy to His Dark Materials fans, and I Am Legend, well I haven't seen that yet (or National Treasures 2) but it looks alright.\n\nI'm not about to give anything away, but this movie is great for anyone, especially kids!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "michaelRokeefe",
        "review_rating": "7",
        "review_title": "Furry singing sensations. The Chipmunks!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jantoniou",
        "review_rating": "5",
        "review_title": "wispy-thin family fare",
        "review_detailed_main": "There's little of merit to extract out of this celluloid extension to the \"Alvin and the Chipmunks\" franchise except, perhaps, a few laughs here and there.\n\nJason Lee appears to have succumbed completely to the pull of the dollar by appearing as the fictionalization of the already fictional Chipmunks' songwriter, \"David Sevelle,\" simply called \"Dave\" in the movie.\n\nDown on his luck, \"Dave\" comes across the preternaturally gifted Chipmunks who are ousted from their forest abode and for whom he writes a song that becomes an instant hit - not unlike the original million-selling Chipmunks' hit in 1958.\n\nAny movie must have a conflict to be interesting and it comes in the form of another able comic that also seems to be trolling for a paycheck here, David Cross. Playing slimy record exec Ian, he seduces the Chipmunks into a fancy, happy-go-lucky lifestyle that caters to their every whim. Stick-in-the-mud Dave proferred upon the 'Munks a more conservative, put your money in the bank for a rainy day kind of anti-M.C. Hammer money management philosophy. The 'Munks will have none of it and instead go out a barn burning world tour courtesy of said slimy record exec looking to milk the Chipmunks for all their merchandising worth.\n\nLee appears nearly robotic in his scenes and reluctantly echoes David Sevelles of yore--\"Allllllvvvin!\" For a guy who used to be on the cutting edge of indie comedies, it feels like an awkward casting fit, but perhaps this is what his handlers in Scientology want.\n\nAll this said, the Chipmunks themselves deliver on some pretty good comedic moments. My kids loved them and even us adults got a few amiable yucks out of what is otherwise a bland family movie. I will give the filmmakers' credit for not making them too cutesy, but rather sufficiently anthropomorphic so that we can enjoy them without gagging on the gee aren't they cute chipmunks factor.\n\nThough Dave has a pretty love interest, they keep the family-un-fair double entendres and innuendos down to a bare minimum. You won't need to explain much to your children if they ask.\n\nWorth the investment to go a movie theatre? Probably not unless you get a good matinée special where they have popcorn and a coke for $5. Otherwise, the kids can enjoy it on DVD in maybe 3 months."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "georgiaredpathdick",
        "review_rating": "10",
        "review_title": "BEST MOVIE EVER",
        "review_detailed_main": "Honestly one of the best movies in the entire world. Such a goofy and radical feeling every time i watch, which is about 2-3 times a week. Literally gives me goosebumps and shivers down my spine. Literally 100,000,000/10."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "dmorrisbadger101",
        "review_rating": "7",
        "review_title": "Good Ending!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "nitinjain_nitin",
        "review_rating": "5",
        "review_title": "Hello",
        "review_detailed_main": "I would like to say that the movie is cute ... the chipmunks are lovable and adorable but I would not spend like 10 bucks to go and watch it on theater. The story is too unrealistic man. The kids will like it though because of the talking chipmunks. The one thing that I liked although is the editing part. The movie is perfect length. But seriously man it is something you cant digest. I mean movies are unrealistic but this one did not gave you a feeling that it could happen. I know there have been movies that have been like this one in the past but still its hard to digest. The end is specially good. Uncle Ian trying normal chipmunks to sing."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "andro-dolic",
        "review_rating": "4",
        "review_title": "I expected good movie but I saw big disappointment",
        "review_detailed_main": "I heard many thing about this movie but I have never thought that I will watch . I thought that it is some movie which doesn't make my day . And it is true no matter what I heard that it is good and cool . There are some parts when movie is really good but in many other parts is boring and classic childish story . With uninteresting plot it is going to be one more one boring adventure . It is reminding me on some other computerized movies(for example Garfield but it is very good movie) . There are some entertaining moments but it is standing on the place . There aren't some new tricks . It is reminding me on some old school movies or better on some practice on theme \"How to make some new old movie?\". I gave it 4 only because sometimes chipmunks are good and cool but they aren't completing some good movie . They are only making this boring movie a bit better . Now I can see that it is only one big disappointment . I didn't expect something like this ."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "lesleyharris30",
        "review_rating": "7",
        "review_title": "Great fun,much better than the god awful sequels,",
        "review_detailed_main": "Alvi And The Chipmunks is a great fun family film,with enjoyable characters and music,I enjoy this film even though it is not too well received,a lot of people think its an insult to the original Alvin And The Chipmunks but I feel its a good compliment to the original,although I do think that the sequels,The Squeakquel and Chipwrecked,are just horrible,I don't think the second one is that bad but the third is just a stupid storyline and they never stop singing.\n\nA song writer named Dave Seville has ran out of ideas and lost his job,but everything turns around when he meets three singing chipmunks named Alvin,Simon and Theodore."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ThunderKing6",
        "review_rating": "3",
        "review_title": "Chippunk'd",
        "review_detailed_main": "Anyone who was expecting a great movie was Chippunk'd.\n\nThis movie was a big disaster. Its too not good. Animated versions do not do well in live action.\n\nThe Chipmunks are very annoying in this. You root for the bad guys."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Family Entertainment",
        "review_detailed_main": "I wasn't that aware of the Chipmunks, but they do seem to have a following. And you can see their appeal to a younger (=kids) audience. They are cute and they can talk. What else do you need for a successful kids movie? Of course the story as it is, is not anything new or great or anything else.\n\nAs an adult you have to make sure, to try to think as little as possible. A world where Chipmunks exists (an adult world that is) wouldn't look anything like this kids version of it. But you can't blame the movie for that. It's our cynical (realistic?) view that might spoil it for us. Still not the best kids entertainment, it will occupy and satisfy every need the little ones have."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Beta_Gallinger",
        "review_rating": "4",
        "review_title": "A bland live action/CGI crossover adaptation of a hand drawn cartoon, like the 2004 \"Garfield\" movie",
        "review_detailed_main": "Alvin and the Chipmunks is a VERY famous cartoon musical trio. They were created decades before I was born, but I was 21 when this movie featuring the trio was released, and had been familiar with the anthropomorphic chipmunk characters for most of my life, having seen them in animated cartoons as a kid. The 2004 film adaptation of \"Garfield\" brought the hand drawn character to the CGI format and in a live action world, and this \"Alvin and the Chipmunks\" film does just that with these characters. I haven't seen the \"Garfield\" movie in several years, but can still remember its mediocrity, which means I wouldn't want to watch it again. After that, I was not desperate to see this later live action/CGI crossover when it first came out, and after finally seeing it over three years later, it's not too surprising to me how lacklustre it is.\n\nAlvin, Simon, and Theodore are three talking, singing chipmunks who live in a pine tree in a forest, but their lives change when this tree is cut down and taken to Los Angeles with them still in it! Dave Seville is a struggling songwriter in L.A. who is trying to get a song of his published. He presents his latest piece to Ian Hawke, Dave's former college roommate who is now a JETT Records executive, but sadly, he rejects the song. In the building where this happens, the Chipmunks' tree is put up and used as a Christmas tree. As Dave leaves, the Chipmunks jump into a basket he is carrying and are taken back to his house without him even knowing they're with him! When the struggling songwriter discovers them in his house, it isn't long before he puts them outside and refuses to let them back in. However, he is then surprised to hear the three of them sing, so he makes a deal with them. If they sing the songs he writes, he will provide them food and shelter. With the Chipmunks' talent, it looks like they could be the key to Dave's success, but they end up causing more trouble for him!\n\nWhat is probably this film's biggest problem is not a surprising one at all, and that problem is that the darn thing simply isn't very funny. I didn't watch the entire flick with a straight face, and there were very seldom times when I laughed just a little, such as Ian's reaction to Dave's new song near the beginning, but the vast majority of the gags failed to amuse me at all. The Chipmunks cause a lot of trouble for Dave, which is supposed to be good for laughs, but it isn't. There's one part showing Alvin putting what Dave thinks is a piece of chipmunk feces in his mouth to convince Dave that it's actually a raisin, and then spits it out when Dave is not looking! This is even worse than the chipmunk defecation scene in \"Enchanted\" (a film which came out around the same time as this \"Alvin and the Chipmunks\" adaptation and seems to be much more popular, but I honestly don't get what's so great about it), and it's making me queasy to talk about it! In addition to the major lack of funniness, the three main characters sing some familiar hit tunes, and generally cheesy ones if you ask me. Alvin and the Chipmunks certainly don't make these songs sound any better!\n\nEven though I didn't see this \"Alvin and the Chipmunks\" live action/CGI adaptation until over three years after I last watched the \"Garfield\" one, I can still compare them, and while both of them are bland, I would say that this one is slightly worse than the other. Both films are supposed to be comedies and severely lack laughs, but at least the \"Garfield\" movie doesn't have anything like the chipmunk excrement gag here! Well, I'm sure many would say these two movies are strictly for kids, and both of them were made years after my childhood ended, so maybe I'm being a little too harsh. I guess both films could have far more appeal to kids than adults, though 2007's \"Alvin and the Chipmunks\" may have more adult fans than 2004's \"Garfield\", so many could disagree with my opinion on it. Still, I most certainly don't suggest people watch this movie expecting it to be great entertainment for the whole family, nor should viewers expect it to be 100% clean. It spawned a sequel called \"Alvin and the Chipmunks: The Squeakquel\" in 2009, and you can be sure I intend to avoid that follow-up, just like I've continuously avoided \"Garfield: A Tail of Two Kitties\"."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Robert_duder",
        "review_rating": "7",
        "review_title": "An all new generation gets an all new update on something we ALL remember...and they think it's new!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "filmsploitation",
        "review_rating": "5",
        "review_title": "Not the worst film I have seen...",
        "review_detailed_main": "Phil's Quick Capsule Review: Inoffensive Kiddie flick that becomes not the worst film to watch when your stuck in hotel room in Egypt (as I was). Let's face it, it does what it says on the tin and if nothing else was worth watching for the always great Jason Lee.\n\nIMDb Rating: 5/10\n\nBest Bit: It was short!\n\nBuy, Rent or Borrow: Borrow\n\nIf you liked this try: Babe (8/10); Charlottes Web (7/10); Home Alone (6/10)\n\nPhil Hobden For more reviews like this check out:\n\nhttp://www.mod-life.net/modlife/index_ugly.htm"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "teraroxas",
        "review_rating": "10",
        "review_title": "Peak Cinema, Better than Shawshank Redemption.",
        "review_detailed_main": "As a 3 year old, I thought this movie was quite the perfect watch. It may not be every one's cup of breast milk but I really enjoyed Jason Lee's performance and our favorite critter's debut on the silver screen. If you need any recommendations, I'd beg you to have nap time BEFORE you watch this movie because my mommy couldn't keep me in bed all day. I can't stop myself from singing. Simon's performance wasn't the best but thankfully Theodore's acting was extremely top notch to make up for it. Overall, 10/10.\n\nIf you're an adult who rates this movie any lower, please remind yourself that this is a CHILDREN'S MOVIE and you're probably 60 years old."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "barca_AW",
        "review_rating": "7",
        "review_title": "Good and entertaining movie for kids at Christmas",
        "review_detailed_main": "I don't understand the bad ratings of that movie. Maybe i can explain it from the point of a kid, which really likes this movie. I am now an 18 year old Man who is very interested in movies, so when Alvin and the chipmunks came in the theaters i was about 10 years old. And for me and my brother it was an adventure to see that movie. People often forget that there are movies who only exist to entertain kids and not the critical eyes of film interested man who only likes good films for example bird man and so on. This is a movie for kids which is very entertaining and also brings back the wonderful feeling of Christmas in that time. It also learns much about money and friends. I can say that the message of this movie is to stay on the ground and with your family and that you should not go there where the money is. After that movie i became a big fan of the chipmunks. I was surprised that it was that good, my brother and i also always listened to the songs of them. And thats what it about in this movie, its not interesting mystical or something, it is a wonderful entertaining film for kids and the film also contains some good messages.\n\n(Sorry for my bad English, i am Austrian)"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Alvin and the Chipmunks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "movie_bloke",
        "review_rating": "6",
        "review_title": "Good to see a classic getting remade into something better.",
        "review_detailed_main": "I was excited to go & see this at the movies as its been one of my favourite childhood cartoons, couldn't have asked for much better than what i saw, it was good to see Jason Lee as Dave cause he brings up the the right characteristics. Theodore was the most lovable out of the three chipmunks. About the movie itself if your not already a previous fan of Alvin & The Chipmunks you will now be. It's a great family movie cause its got a nice light hearted sense of humour. It wasn't the funniest movie i've seen but still good. There are better family movies than this, but this was still worth a view. 6 / 10. David Cross done a good job as the bad guy."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "IonicBreezeMachine",
        "review_rating": "5",
        "review_title": "Probably the best possible mid '00s version of Alvin and the Chipmunks you could expect to get. Take that for what it's worth",
        "review_detailed_main": "In Los Angeles, Advertising executive and struggling songwriter David \"Dave\" Seville (Jason Lee) has once again had his songs rejected by Chief executive of Jett Records, Ian Hawke (David Cross), who claims his songs are awful and no one will sing them. Meanwhile chipmunk brothers Alvin (Justin Long), Simon (Matthew Gray Gubler), and Theodore (Jesse McCartney) end up in Los Angeles after their tree is chopped down and brought to Jett Records' lobby as a Christmas decoration. As Dave leaves Jett dejected, the chipmunks stowaway and end up in Dave's home. When Dave discovers the Chipmunks who reveal they can talk he initially wants nothing to do with them, but changes his mind when the chipmunks reveal they can sing. After initial hurdles in selling the concept to Hawke, the Chipmunks become overnight successes with their hit single \"Christmas Don't Be Late\" as the pop star lifestyle begins to wear them down with the Hawke all too eager to wring all he can from the Chipmunks.\n\nAlvin and the Chipmunks is the third incarnation of the franchise that began in 1958 created by Ross Bagdasarian. The series was a massive success in the 1960s before going into hibernation in the 70s due to Bagdassarian's death from a heart attack, and got a resurgence in popularity thanks to Ross Bagdasarian Jr. Reviving the franchise with A Chipmunk Christmas which in turn lead to the NBC Saturday Morning Sitcom that lasted for about 10 years. During the 90s when the NBC series ended, Universal attempted to revive the brand with a VHS release of The Chipmunk Adventure, as well as production of direct-to-video films Alvin and the Chipmunks Meet Frankenstein and Alvin and the Chipmunks Meet the Wolfman in the hopes of tapping into the exploding children's home video market of the time that gave life to many direct-to-video Disney films and Universal's own Land Before Time series. Along with this plan was a live-action adaptation of Alvin and the Chipmunks that would've been directed by none other than Robert Zemeckis after he'd finished with Contact. No information on this incarnation of the project has ever been disclosed, and Zemeckis apparently lost interest in the project and opted instead to film Cast Away and What Lies Beneath instead. Once Zemeckis lost interest so too did Universal and the brand languished under Universal's stewardship with Bagdasarian Jr. Even initially a lawsuit against the company for neglecting the brand and sinking a property that had yielded $4 million annually to a low of about $70,000 (ouch). Eventually Fox acquired the rights to The Chipmunks and made the film with Simpsons writer Jon Vitti and director Tim Hill, and despite a teaser trailer that prominently featured a scene where Alvin eats...\"something\", leading many to assume the film would be awful and bomb. Despite negative buzz, the film managed to score a strong #2 opening in Christmas 2007 and managed to gross $200 million in the United States alone and outgrossing larger budgeted films such as Enchanted, Golden Compass, and Fred Claus. Alvin and the Chipmunks didn't make the best impression with its teaser, but while I don't think the movie is good it's at least not awful.\n\nTo start off on a positive note, the effects used to bring the Chipmunks to life created by now defunct visual effects house Rhythm and Hues Studios are well done. While the Chipmunks don't look perfect, they do look much better than the models used in films like Bill Murray's Garfield movies, Scooby-Doo from those movies, or the model work in Cats & Dogs. While the Chipmunks don't translate seamlessly to live-action with the movie bending over itself pretty clumsily in trying to justify certain elements like why the chipmunks wear their signature outfits, why Simon wears glasses, or why they live with Dave, it does have some genuinely solid work integrating the CG elements with the live-action elements. The Chipmunks personalities are kept mostly intact, especially Theodore whose good natured simplistic innocence is well conveyed in both the model work as well as Jesse McCartney's delivery (who apparently is a fan of the franchise and watched the 80s series for reference). Simon while still identified as the \"smart one\" doesn't feel like he captures the same anchoring/voice of reason role he played in the show or previous films and he feels like he's a little too willing to go along with Alvin's shenanigans in this movie. Alvin I really wasn't a fan of in this movie, while Alvin was a trouble making schemer in the previous incarnations, he was also a caring character who was able to show he really cared about his brothers, Dave, or even random people such as A Chipmunk Christmas were he gives his prized harmonic to a sick child as a Christmas gift. Alvin in the 2007 film feels like he's written to be a chaos engine who's lacking in self awareness and I'm not a fan of these types of characters because it has the consequence of divorcing character from them. Jason Lee is hit and miss as Dave, on the one hand he occasionally has some solid work as a down to earth counterpoint to the Chipmunks, but on the other hand he's not all that adept in the more over the top scenes of slapstick or Dave's trademark \"Alvin!!!\" yell. David Cross on the other hand is really good as antagonist Ian Hawke who sells the sleazy record producer character very well and his delivery on certain lines alone makes them funny. There's also the added question of why we needed \"name\" actors to play the Chipmunks if they're just going to speed up their voices and render them unrecognizable.\n\nIn terms of plot, the movie feels like it's a very middle of the road sitcom. It has sitcom stakes, sitcom dilemmas, a sitcom plot, and while the original Chipmunks TV shows were more or less sitcoms (especially the 80s cartoon) when you put something into film format you're expected to up your game a little in scale and scope (such as The Simpsons movie). The 80s Chipmunk movie The Chipmunk Adventure may have been a very silly jewel smuggling plot, but it was also animated by ex-Disney staff and featured a globetrotting adventure with unique and memorable locales and characters, granted not always for the best (looking at you out of place parody of 1921's The Sheik) but still had clear ambition and effort even if it didn't strictly speaking work. I will say however that Jon Vitti does take this very standard rags to riches/price of fame plot and puts it to good use showing the behind the scenes misery of stardom and the exhaustive indifference of the music industry and there are some scenes that are sweet and kind of funny such as Dave getting Simon some glasses for his poor vision or Theodore sleeping in Dave's bed after he has a nightmare, but those moments are balanced out with some moments that land with a thud or exist solely for creating visual noise. As for the songs it'll be a case of either you like them or you don't, some of the renditions of Chipmunked songs sound perfectly fine, while others are more middling, though admittedly that may just speak to my general dislike of mid 2000s musical trends and how they're incorporated.\n\nAlvin and the Chipmunks was the best possible version of this franchise we were going to get given its time of release. The movie isn't great, but it's nowhere near as bad as we thought it was going to be from that awful teaser trailer. It's a movie that plays strictly to young children, whether it does so successfully is a matter of opinion but when you have movies more notorious attempts at children's entertainment I maintain you can do worse."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ravsten428",
        "review_rating": "7",
        "review_title": "The size of Theodore's Butt?",
        "review_detailed_main": "I am not a big fan of Hollywood making my favorite cartoon characters realistic looking. However Alvin and the Chipmunks is a delight.\n\nI had low expectations of this film when it first came out and I did not want to see it. I remember watching Alvin and the Chipmunks as a cartoon series in the 80's and also The Chipmunk Adventure and I didn't believe this would be nearly as good and would not be worth seeing.\n\nBoy was I wrong.\n\nThe film is cute and all the Chipmunks fit their respected personalities.\n\nThe Chipmunks may not be for everybody but I love them. I have seen the second film and the new one coming out looks very funny and I am looking forward to seeing it.\n\nAlvin and the Chipmunks will surely not disappoint."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "TheMysteriousReviewer",
        "review_rating": "4",
        "review_title": "A Weird Film, But Not In a Good Way",
        "review_detailed_main": "Really Fox? This is what you call this franchise worthy with four films? Even as a music fan myself, Alvin and the Chipmunks has came out a really weird movie. And I don't mean a good way, the kind where I sit through watching like, what am I even watching. The story is painfully predictable. The humor is mostly unpleasant. The characters get annoying. The editing makes the movie over the top hip. And the big problem I can find is this film serves no purpose. I get that, it's an origin of the chipmunks considering it's based on the cartoon series from the 80s, but there are better ways to make it work by telling a good story rather than being modern and trendy throughout. I know there's late 2000s kids that grew up with this and consider their childhood, so I guess I won't stop them. But even with that and for music fans such as myself, I can't really recommend this much. It's not really worth your time. If you want to watch music movies, there's quite plenty such as Almost Famous and School of Rock. I'll admit it's not the worst live action movie based on a cartoon, but this film is just uncomfortable."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "simplysoda_19f",
        "review_rating": "7",
        "review_title": "Get ready to get \"munk'd\"!",
        "review_detailed_main": "I loved this movie, it was very funny, had a great story and had everybody's favorite sons, Alvin, Simon and Theodore. I remember watching the Chipmunk cartoon when I was a kid, and loved it, it was great, had lot's of laughs, my favorite was Alvin.\n\nI always compared me and my sisters to the Chipmunks because we used to always have a lot of fun and we used to pretend we were in a band and were famous. Well, I never had a father like David Seville, but I always wanted one, and yes my father did yell at me just like Dave does with Alvin.\n\nI thought Jason Lee was perfect as David Seville, a lot of people didn't think he did an okay job, but I loved him. I liked the reference to My Name is Earl, I thought it was very funny.\n\nI always wondered how Dave hooked up with three chipmunks, and now I know. I thought it was great how the 4 hooked up, and I do remember watching the episode when Uncle Ian showed up, and I wasn't really a fan of him. It got worse when my parents had a boy and named him Ian, and he was always a trouble-maker, still is, lol.\n\nIt was a great movie, wasn't the best, but it was still a good movie to watch. My five yr. old nephew loves the chipmunks and he thought it was very funny, a lot of kids will like this one, but I think pretty much it's a movie the whole family can enjoy. I gave this movie 7 out of ten, because the CG chipmunks were really cute and enjoyable to watch and....well....like they say in their theme song, \"Were the Chipmunks, Alvin, Simon, Theodore...do, do, do, do, do do. Great movie!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "tommystans",
        "review_rating": "5",
        "review_title": "It tried",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Alvin and the Chipmunks",
        "review_detailed_main": "Or at least that's how the theme song of the cartoon series sounded like, dug out from my subconscious. For those, like me, who have grown up in the 80s watching television cartoons like Mask, Transformers, He-Man, there are those which are less action based, such as Peanuts, and of course, Alvin and the Chipmunks, featuring the trio of Alvin, the de-facto ringleader, Simon the smart one (hence the cliché glasses) and the greedy Theodore.\n\nWith cartoons from the past being remade into feature length movies, such as Scooby Doo and Garfield, yielding mixed box office results, what about these 3? To begin with, this is not quite like the cartoon series, in that the chipmunks are sized correctly, as with the other adaptations (no more handgun transforming to 50 foot robot), and curiously enough, they didn't need their body length clothes to hide their modesty, just a top coloured in the right way will do. And for Alvin, all is forgiven when the filmmakers finally remembered he sported a cap. Having effects wizardry helped to in bringing to life the trio of chipmunks, down to the last furry detail such as their hairdo.\n\nThose of us who have grown up with the series, will find multiple shades of story lines adapted from the cartoons all meshed into one here. It's a reworked origin story of sorts, so as to bring in a new legion of followers who haven't seen the series on television. Created by Ross Bagdasarian Sr almost 50 years ago, to have the characters translate to the big screen, bode well for its longevity, at least from the reaction I got from the kids, they are in love with the singing trio with all the clapping and the dancing along the aisle (yes!) each time they perform in their high pitched voices. I too was tempted to applaud, but that would be too geeky-like for those moments I became a kid again.\n\nJason Lee stars as Dave Seville, the \"father\" of our singing sensation, who finds it a little difficult in trying to warm up to the notion of being family with animals. Having started off the wrong foot, it provided ample opportunity for that iconic scream \"Aaaalviiiiinnnnnnn!!!\", as he finds himself out of a career and with 3 extra mouths to feed. But as rehashed scenes and storyline goes, the Chipmunks soon prove to be taking the USA by storm with their brand of oh-so-cute voices and slick dance moves, that they become superstars in their own right.\n\nYou'll know the drill from here, as dodgy music label producer Ian (David Cross) tries to undermine Dave to pry the cash-cows (heh) from the latter using despicable tactics, giving rise to being the sole adversary with the evil corporation type who's out to exploit and milk the chipmunks for what they're worth. Being a family friendly film, the theme of belonging and err, blood running thicker than water and profits, ring through, though I thought to toddlers, that might not actually matter, but to the parents bringing them to the theatre, then it's a reminder that children do appreciate being loved and having that pat on the back.\n\nJustin Long, Matthew Gray Gubler and Jesse McCartney provided the voices for our lovable chipmunks Alvin, Simon and Theodore respectively, though that didn't really matter in the final end product given that their voices had to be sped up to achieve that chipmunk effect. In fact, you and I could also be reading the lines, and applying the same technique to become chipmunks ourselves. And amongst the three, I dare say Theodore will win new fans in the very manja way it got portrayed. A key scene from the trailer had been reworked, so don't be surprised if you see that deviation - though for once, I thought the trailer version was better and closer to character.\n\nLike the movie says, \"they're talking chipmunks!\" so I feel that given the holiday season, and the tie-in with the movie to the season of good tidings, it may actually bode well for the film. There may be nothing truly new in the antics of the chipmunks, but they will probably still charm your socks off. So before you roll your eyes at yet another talking-animal film, give this one a chance, and I'm quite certain you'll be tapping your feet at the right moments too!\n\nSo hit it again, Alvin, Simon, Theodore! And watch those plush merchandise fly off the shelves in time for X'mas! Stay tuned during the end credit roll which showcased some of the album art from their musical albums of the past."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "uksims",
        "review_rating": "7",
        "review_title": "Heart Felt and Funny",
        "review_detailed_main": "I think this movie was had some funny moments in it (Don't ch wish your girlfriend was hot like me- LOL) and very funny. I saw it with my little sister the other day in cinema and we both thought it was great! PROS- The chipmunks were so cute and looked so real (Theodore was adorable)and the storyline was really good.There was a lot of Heart in this movie and some bits almost made me cry. The songs were great (especially Witch Doctor) Great acting as well.\n\nCONS- Jason Lee could have been better as Dave and I don't think there was need for a romance storyline.\n\nAll on all, The movie was great and if you are thinking of a movie that will be funny and heartwarming at the sametime- This is the movie to watch! Your kids will love it!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Spaceygirl",
        "review_rating": "5",
        "review_title": "Sweetly inoffensive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "OllieSuave-007",
        "review_rating": "5",
        "review_title": "Kind of adorable, but looses steam.",
        "review_detailed_main": "Just like the cartoon, this is an adorable movie about chipmunks Alvin, Simon and Theodore, who meets frustrated songwriter David Seville (Jason Lee). Together, they set out fame as singers, hoping to make a positive impact in their lives. However, the unscrupulous record executive, Ian Hawke (David Cross), wants to exploit the Chipmunks, directly breaking up the family in the process.\n\nThe movie does pick up the pace at first when the chipmunks first appear on screen and runs into Seville, ending up being his house mates. The chipmunks' singing were pretty fun to listen to; however, the story's pace looses steam somewhere in the middle, where the chipmunks lose their spunk and let the fame get the best of them. The story basically dragged on from there.\n\nThe voice actors who played the chipmunks did a fine job, but Jason Lee wasn't very good as Seville and clearly wasn't right for the role. I would have liked to see him show more emotion and surprised expressions when he first spots three singing chipmunks (it's not everyday you see three, tiny singing critters). Unfortunately, he showed a disinterest in the role and lacked substance overall.\n\nThis movie has its fun moments, mostly in the beginning, but not a terribly great movie overall. I'll watch this once, and then find something else to spend other Saturday nights with.\n\nGrade C-"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "sufyaanrashid95",
        "review_rating": "6",
        "review_title": "A Fun and Energetic Musical Comedy",
        "review_detailed_main": "Alvin and the Chipmunks is a musical comedy film based on the popular animated series of the same name. The film follows the adventures of three singing chipmunks - Alvin, Simon, and Theodore - as they are discovered by struggling songwriter Dave Seville, played by Jason Lee. The film is known for its catchy musical numbers, energetic performances, and hilarious humor.\n\nOne of the strengths of the film is its musical numbers. The chipmunks' renditions of classic songs like \"Bad Day\" and \"Funkytown\" are both entertaining and catchy, and the film's creators have done an excellent job of blending the chipmunks' voices with the music.\n\nThe performances are also a standout feature of the film. Jason Lee delivers a solid performance as Dave Seville, and the voice acting for the chipmunks, provided by Justin Long, Matthew Gray Gubler, and Jesse McCartney, is both energetic and charming.\n\nThe humor in the film is also enjoyable, with a mix of slapstick comedy and witty one-liners that will keep viewers of all ages entertained. The chipmunks' antics, in particular, are sure to elicit plenty of laughs.\n\nBut what sets Alvin and the Chipmunks apart from other family comedies is its heart. The film explores themes of family, friendship, and the importance of pursuing your dreams. The emotional payoff at the end of the film is satisfying and will leave viewers feeling uplifted.\n\nOverall, Alvin and the Chipmunks is a fun and energetic musical comedy that is enjoyable for viewers of all ages. Its catchy musical numbers, entertaining performances, and heartwarming message make it a standout in the world of family comedies. It's a great choice for families to watch together and a must-see for anyone who loves a good musical with plenty of laughs."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "worldsworstwryter",
        "review_rating": "5",
        "review_title": "Talking animals are sometimes cute and sometimes annoying.",
        "review_detailed_main": "When I was a little kid in Primary school, my entire class thought this was the funniest thing ever. I can see why kids would like it, a lot.\n\nAs a movie, it's fine. It never gets really awful, or really great either.\n\nI'm not really sure what to say about it other than it's an ok movie that kids will probably enjoy.\n\nOh, and the green one was pretty cute."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "alwayssmiilinu",
        "review_rating": "6",
        "review_title": "Fun Movie for Kids!!",
        "review_detailed_main": "I don't know why this movie has such a low rating!!! It's a KIDS MOVIE PEOPLE!!! It has fun music, NO VIOLENCE, and talking animals! The acting is for children as well, so is it a Grammy Award Winner, NO, but, still a fun and loving story! My son is 4.5yrs old and he absolutely loved it!! He was laughing, and jumping around, and totally thrilled about the movie! It doesn't have to have superheros, and violence to be a good enjoyable film for kids to be interested in! The chipmunks are fun, mischievous, and teach Dave a lesson he will not soon forget! :) Watch it with your kids and ENJOY!!! :) My son can't get enough! lol!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "mrm1175",
        "review_rating": "5",
        "review_title": "This movie forgot about the country album in the ending credit's!!",
        "review_detailed_main": "It gave credit to all other's. Rock, Rnb or pop album's.... but it forgot 1981's Urban Chipmunk . Which was awesome .. Mama don't let your baby grow up to be cowboy, CHIPMUNKS..... ALVINNNNN!!! After that this site has asked me to elaborate on my feeling's fine (it's my first post here so rookie mistake) I believe that the exclusion of that particular album was a attack country music in general. And at this point they want ten line's of text fine. It is only a movie about chipmunks with Jason Lee, who happen's to be a way better actor then what ever he was asked to do in this sub par for his standard movie. At this point it's pointless for me to ramble on about it . I tried for ten line's I think I have it ."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Sirus_the_Virus",
        "review_rating": "6",
        "review_title": "It isn't a total disaster.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "hollywoodhomer",
        "review_rating": "3",
        "review_title": "The poop-eating IS real!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "djackson-33",
        "review_rating": "9",
        "review_title": "Entertainment for all.",
        "review_detailed_main": "Forget the critics. This may not be greatest acting/script/etc but it is entertaining. I saw it at an 80% full session and the adults out-laughed the kids. I'm glad I went. Many small details for those like me who remember 1958. I have to admit that I like Jason Leee and he does a reasonable effort without being excessively silly. Ian played David Cross is a little over the top but this was acceptable to the adults and made it very easy for the youngest kids to understand. The animation of the Chipmunks was great, OK they did not look like real chipmunks but they did not look cartoonish like in Roger Rabbit. The story was reasonable and provided lots of laughs throughout which many 'A' grade comedies fail to do. In conclusion a 'B' grade family move which succeeds 100%'"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "dbborroughs",
        "review_rating": "7",
        "review_title": "Funny in a genuine funny unpretentious way",
        "review_detailed_main": "Alvin and his brothers crash the home of a frustrated musician named Dave and eventually find fame and fortune as singers. This is more a cartoon then the motion capture films of Robert Zemeckis. I mean that as a slap to Zemeckis who's animated creations (Beowulf, Polar Express) have less life than the all CGI Alvin and his brothers. Whats worse is this film with no pretensions and simply a desire to make one laugh is ten time the fun of most of the \"next big thing in movies\". Can you sense I liked this film? Can you sense that maybe, just maybe we have a mindless winner here? Aimed at kids the humor doesn't talk down to them. Oh sure the humor is childish and low brow but I laughed more times than I did at several recent \"good\" comedies (see Superbad). The music is quite good and the characters are appealing. I like how they play with the things we know about the characters for example how Dave writes the Christmas song we all know love and get sick of every year. There is a reason the film has been near the top of the box office since it opened, its funny, and not just for kids since lets face it there are only so many times Mom and Dad will drag the kids to see a bad movie repeatedly."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "strictly for kids",
        "review_detailed_main": "Dave Seville (Jason Lee) is a struggling artist and his music producer Ian Hawke (David Cross) rejects his latest song. Alvin, Simon, and Theodore are musical chipmunks. Their tree gets chopped down to be the Christmas tree in the record company. The chipmunks are accidentally taken to Dave's home. Dave discovers the talking chipmunks and their musical talents. Claire Wilson (Cameron Richardson) is his neighbor. Gail (Jane Lynch) is Dave's advertising boss.\n\nThis is strictly for kids. The parents who bring the kids will find little to no laughs. Did I laugh at the poop joke? Yes. I don't think I was paying attention to the movie. It was more of a shock than funny but I still laughed. One can make fun of Jason Lee doing it for the paycheck but who doesn't. It's not like he's winning an Oscar any time soon. The chipmunks are mostly harmless fun. The music is good initially especially as a Christmas song. Once it goes hip-hop, it gets annoying."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Mysterygeneration",
        "review_rating": "5",
        "review_title": "A musical film starring a pack of squirrels",
        "review_detailed_main": "The babyish sped-up voices of Alvin and the Chipmunks are all there is to them. Hearing Alvin, Simon, and Theodore do choruses of \"Bad Day\" and \"Funkytown\" is cutesy-funny-adorable. However, after the affable Dave secures them a record deal, a wicked businessman transforms them into robo-pop drones."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Falko_h1",
        "review_rating": "5",
        "review_title": "Nostalgic fun with a modern twist",
        "review_detailed_main": "\"Alvin and the Chipmunks,\" directed by Tim Hill, is a live-action/CGI hybrid film that brings the beloved animated chipmunks into the modern era. Released in 2007, the movie follows the mischievous trio-Alvin, Simon, and Theodore-who find themselves living with struggling songwriter Dave Seville, played by Jason Lee.\n\nThe film's charm lies in its blend of slapstick humor and catchy musical numbers, which pay homage to the original cartoon series while introducing the chipmunks to a new generation. The CGI characters are well-animated, capturing the distinct personalities of each chipmunk, with Justin Long, Matthew Gray Gubler, and Jesse McCartney providing lively voice performances.\n\nWhile the storyline is predictable and caters primarily to a younger audience, it offers enough nostalgic appeal and lighthearted fun to entertain families. Jason Lee delivers a solid performance as the exasperated yet caring Dave, balancing the chaotic antics of the chipmunks.\n\nOverall, \"Alvin and the Chipmunks\" is a fun, albeit formulaic, family movie. It may not break new ground, but it successfully combines humor and heart, making it an enjoyable watch for fans old and new."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "S_dot_M_dot",
        "review_rating": "5",
        "review_title": "Entertaining Enough",
        "review_detailed_main": "Alvin and the Chipmunks has a down on his luck Dave, Jason Lee, become a father figure and mentor for Alvin, voiced by Justin Long, Simon, voiced by Matthew Gray Gubler, and Theodor, voiced by Jesse McCartney, who happen to be talking, singing chipmunks. Wild antics ensue as they try to make it to the top of the pop chart.\n\nThe CGI to live action holds up pretty well in this one. It's ground breaking but does the job. It is entertaining enough to keep you around for the runtime and Ian, played by David Cross, is a great villain.\n\nThis is a basic plot line that is predictable and is for the kids. The kids love it though and that is all the really matters. Everyone involved got the job done and threw in a few adult jokes to keep the parents pleased."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "studioAT",
        "review_rating": "2",
        "review_title": "Alvin and the Chipmunks",
        "review_detailed_main": "Look, anything I say about this film doesn't really matter.\n\nThe cartoons continue, the franchise has gone on to produce multiple further films, so the fact that this film isn't very good is neither here nor there.\n\nIt's fine entertainment. It passes the time and services the book fine enough. Parents will have a giggle whilst watching it, and I'm sure kids who are the target audience will have a blast with it too.\n\nI think I laughed a couple of times, and that's something I suppose.\n\nIt's not aimed at me, I'm really not the target audience, and even when I was I would probably have deemed this too silly anyway."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "donnan-4",
        "review_rating": "10",
        "review_title": "great for all ages",
        "review_detailed_main": "I took my 4 year old grandson to see this movie and he laughed all the way through it. I don't know when I enjoyed a movie so much. The chipmunks were cute as can be, and so lovable. I also am a great fan of Jason Lee and never miss his \"Earl\" show. The songs brought back fond memories from when the chipmunks first were introduced to the world. This movie made them seem alive and just as mischievous as in all their past records. It is great to have characters that can be shared across generations. It was good to relax and watch a movie with no sex and violence and especially no vulgar language. What a great way to spend a Sunday afternoon. I can't wait for it to come out on video!!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Karlamon",
        "review_rating": "4",
        "review_title": "Not as cute or funny as I expected",
        "review_detailed_main": "Alvin and the Chipmunks is another of those CGI/live-action family films based on a cartoon. This film did look cute and appealing, but beyond that, it had little to offer for me.\n\nThe overall premise is about three singing chipmunks named Alvin (Justin Long), Simon (Matthew Gray Gubler) and Theodore (Jesse McCartney) who lose their tree home and are sent to Los Angeles, California. The three come upon a struggling songwriter named Dave (Jason Lee) who decides to hire them to sing his songs for him. It's cute at first but later becomes troublesome.\n\nSadly, I couldn't really stick my teeth into this kids flick. It was dull and too predictable mainly because of its dry humor. The gags primarily consist handfuls of toilet jokes and destructive mayhem. It isn't such a bad thing for a children's film, but these gags are clichéd and recycled from other family movies that have already overused these techniques (i.e. farting, making a mess, breaking stuff, getting somebody fired from work). These predictable jokes were used a lot by Alvin and co which bored me and made me find the trio very annoying and unlikeable.\n\nAlvin and the Chipmunks is not a disaster, but it's forgettable for grownups alike. I was 16 when I first watched this on TV so maybe I was a bit too old for this stuff. I wouldn't recommend this as your sort of movie if you're over the age of 11, but it's strictly aimed for kids so they will surely enjoy it more. If you have some, give this a rental to keep them busy. \"C-\""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Bored_Dragon",
        "review_rating": "5",
        "review_title": "Forgettable",
        "review_detailed_main": "Three talking squirrels leave their forest home and, by chance, end up in the home of a musician, where they start a musical career. But the life of rock stars is not exactly what they imagined it to be.\n\nJudging by my eight-year-old, the film is a complete hit for the youngest, but from my perspective, this is, although somewhat entertaining to watch and with a couple of witty jokes, a totally mediocre clichéd story translated into a barely mediocre film. I do not recommend it, except for prepubertal age.\n\n5/10"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jprizzotto",
        "review_rating": "5",
        "review_title": "not as bad as people say",
        "review_detailed_main": "\"Alvin and the Chimpmunks\" its a very entertaining movie and good movie at least for me,and yes,its based on a old cartoon with the same name as this movie, \"Alvin and the Chimpuunks\" altrough,i just give it a 7 because i hate hollywood's live action movies. But this movie is entertaining."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "RECB3",
        "review_rating": "1",
        "review_title": "Poor Film",
        "review_detailed_main": "I sort of understand what the crew were thinking and trying to do when they were creating this film but it did not exactly fully work. This film did not make any real sense at all and did not have any real direction at all. The storyline of this film was too awful and bad and basic and poor and simple and straightforward and weak. The cast selection could have been a whole lot better and stronger. They did not at all commit nor connect to the storyline nor to their respective characters. There was not any sign of real chemistry at all displayed throughout this entire film between the cast members."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "janetta_fambrough",
        "review_rating": "10",
        "review_title": "Good, Clean, Family fun",
        "review_detailed_main": "If you would like to see a good, clean, fun movie, that you don't have to cover your kids' eyes or ears to avoid \"over-education\" then I highly recommend this movie. I completely loved this movie!!! It was adorable and funny at the same time. I fell in love with Alvin, Simon, and Theodore, all over again after watching this movie. I watched the cartoon series all of the time when I was a kid and always felt they could do more with it. I am so glad they made this movie for the next generation so they can enjoy the chipmunks as much as my friends and I did growing up. Just one more suggestion, wait until it comes out on video to watch it. I'm sure it would be much more fun to watch sitting on the couch in pajamas than in a crowded movie theater."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "zach-69",
        "review_rating": "10",
        "review_title": "A must see for those who love talking Chipmunks!",
        "review_detailed_main": "I grew up watching and loving the Alvin and The Chipmunks animated series. Love their high squeaky voices, the mischief they always get into, and, of course who doesn't love to hear a chipmunk sing? Finally, after so many years, they hit the big screen! The film is awesome! The acting (voice acting that is) concerning the chipmunks, is pheonomenal! They sound just like they did back in the animated seris. I mean, they look SO real, that, I couldn't even tell if they were CGI!! Same thing with the flawlessly PERFECT Spider-Man franchise!! (Third time's a charm for Spidey.) But, anyway, the acting by whoever played David Seville, (the chipmunks adoptive human father) is great as well. The music is awesome in the movie! The soundtrack brings back childhood memories. Overall this is a great film. Go see it and go NUTS! (No, literally, go nuts!)"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "cannibalgrave",
        "review_rating": "10",
        "review_title": "I just LOVED IT!",
        "review_detailed_main": "Alvin and the Chipmunks is the movie that made my day! The Chipmunks are adorable, the acting is great, the voice is just AWESOME and I gotta say it... i've listened to the first song about 50 times (and I AM NOT kidding).\n\nThis movie is for ALL ages, i wanna show it to my grandparents as soon as possible because they love animals and all you can do is love Alvin, Simon and Teodore.\n\nJust imagine how it would be for us to see 3 chipmunks on a stage singing and dancing? Congratulations for this great movie and I hope part 2 will be released!\n\n10 of 10 and it's a \"MUST SEE\""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "bodoe5783-1",
        "review_rating": "10",
        "review_title": "excellent",
        "review_detailed_main": "this film is a delight. very well done, the acting is terrific. the actor who plays \"david seville\" looks a lot like the original \"david seville\". if you can't fall in love with all three chipmunks, especially theodore, you have no soul. the story line is excellent. the song \"witch doctor\" is modernized a bit, but not enough to ruin it's ever lasting charm. \"david seville sr.\" can look down with pride at how his legacy is being handled by \"david seville jr.\". hopefully, this film will be a great success, and result in a few more feature films on the adventures of these timeless characters.\n\ndefinitely a must see, and a DVD purchase, when released. great job one and all!!!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "beachhottie570",
        "review_rating": "10",
        "review_title": "what i thought",
        "review_detailed_main": "i love this movie! it was an awesome tale of the chipmunks. i took my brother and sister too see it. even tough they were too young to remember the old chipmunks cartoon on TV i wasn't. it was great and i recommend this to kids and adults. its funny and great. and it wont be a money waste. if you loved the old chipmunks cartoons you'll love the movie<333 10 out of 10 or 5 gold stars it was a cute remake of the talking chipmunks and Alvin Simon and theodore<3 there still in the business the only thing missing was the chipettes. but it was perfect the way it was and i wouldn't change it for the world<3 the movie was too good to be true a number one hit!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "alloycat",
        "review_rating": "10",
        "review_title": "Kick back and just enjoy, it's so worth it.",
        "review_detailed_main": "I can't find one bad thing to say about this movie. I grew up with the Chipmunks, and found the film to be funny, light-hearted, and a great re-vamping of some of my favorite characters. The music was masterfully chosen, and the actors very well cast.\n\nJason Lee fits quite well in the role of Dave Seville, and the voice cast for the boys was spectacular. I never would have guessed that the boys voices weren't done by Ross Jr.\n\nIf you grew up loving these guys, you'll love 'em more. If you have children who have never experienced the pure fun that Alvin, Simon, and Theodore can bring, this is a great introduction."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kmagee-71809",
        "review_rating": "8",
        "review_title": "Childhood classic",
        "review_detailed_main": "Childhood classic so I don't care what anyone says the rating it's got it lies!\n\nSuggest watching if you're a 90s or early 00s kid to remember your childhood cause that's what I did aha just put it on for background but wow did I love it all over again!\n\nKids love it too so that's a plus!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ryankca",
        "review_rating": "10",
        "review_title": "Underrated classic",
        "review_detailed_main": "I have seen this film when I was a little kid, and it was funny. It was my favorite."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "nazgaming",
        "review_rating": "10",
        "review_title": "CHILDHOOD",
        "review_detailed_main": "So many haters but this movie is elite amd still can watch it 1000000 times more."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kmg-thats-me",
        "review_rating": "10",
        "review_title": "Great entertainment, not sure what more people want.",
        "review_detailed_main": "I love this franchise! I think they have done a great job turning the chipmunks into a movie. Jason Lee makes a brilliant David his connection with the chipmunks is believable and nobody has a better voice for the trademark Alvin shout out. Animation is brilliant, script brilliant, all characters brilliant. Ignore all bad reviews some people are so difficult to please."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "lincolnarnold-48807",
        "review_rating": "10",
        "review_title": "best. movie. ever",
        "review_detailed_main": "I am 6 year and i love this movi 10 stars\n\ni give 10 stars becas they are like squirl but small and they are call chimp monk like monkey chimp ouu ouu ahh ahh"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "imjmontana",
        "review_rating": "10",
        "review_title": "Number one live action movie and childhood",
        "review_detailed_main": "This movie is my number one movie of all time this was my whole childhood I would give it a 100 I love that some cartoon characters get live action like yogi bear woody woodpecker Garfield Stuart little I want Theodore and Simon to be my brothers. I'm a huge fan and I would like to buy AATCM. I have so much plushies and I really like the tv show.it's funny the voice acting is really good. I love all the movies except the 2nd one movies can't be good as this one no difficulty this movie is my favorite movie of all time. AATCM is my whole childhood I love how they make old cartoons into live action all and all this movie is a 100."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jakoboreemders",
        "review_rating": "9",
        "review_title": "The most underrated movie on IMDB",
        "review_detailed_main": "A rating of 5,3 taking into consideration that most animated movie from those years that were less successfull, less well known, less entertaining, less classical, less original and less loved by the public have ratings of at least 7. I don't think people appreciate this classic enough, it was part of my childhood and is different from any movie I've ever seen.\n\nThe second movie is at the same level and has an even worse rating. The third and fourth movies are worse but still good in entertaining, I guess not enough people of my generation rated this movie for it to have even close to the rating it deserves."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "chloebetts",
        "review_rating": "8",
        "review_title": "Nostalgic",
        "review_detailed_main": "Such a classic. I think this is so iconic and literally everyone knows Alvin and the Chipmunksa."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "iamnotfake",
        "review_rating": "10",
        "review_title": "Good Movie",
        "review_detailed_main": "The film is about three chipmunks who can talk and I think it's very good movie. It is a funny movie, squirrels are amusing and clumsy. They messes always and it's fun to look on them. Dave as they live with is always angry and screaming Alvin when Alvin, Theodor and Simon have messed the house and I think it's funny. Now, it has also been a Alvin and the Chipmunks 2.There are good songs in both films but better songs in Alvin and the Chipmunks 2 I think. They are famous all over the world because they are good singers. They have smurf voice and that's right fun. The song I most remember from the first film, Bad Day.The film is for all ages, it's a family film. But I think there are more girls who are watching this movie. But the film is well more a child movie. But I think we older people make jokes in the movie better than what they do younger. It is fun to watch if you have the way several times. For when we make jokes better."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "erminahotmail",
        "review_rating": "8",
        "review_title": "singing squirrels",
        "review_detailed_main": "So let's continue the review of films based on cartoons now I'll do Alvin Superstar then This film is based on a cartoon from the 80s that was about you eco-motor squirrels called Alvin, Simon and Theodore who are fantastic students after in 2007 likeexample, they decided to create a Live Action film. However, unlike the cartoon, these are not ethomophic but are actually real squirrels, obviously they are much smaller than their animated counterpart. So this film was also hated by many people but for me it didn't I find it not bad at all I quite appreciated it because they are quite funny with squirrels Davis' character was done well an excellent Villain is Ian Hawke who wants to use the squirrels to become famous and then the CGI Sometimes it is done well and badly at the same time momentabout the squirrels and then you dub the squirrels or the one that looked like I lifted it blown out of wood from my mouth which was obviously very well done I always defend films based on cartoons however too many people really hated this guy I tell you that I recommend this filmsee it if you are a fan of Alvin Superstar, trust me, but to conclude I rate it 8-"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "gcdisneyboytyler",
        "review_rating": "9",
        "review_title": "Kids Movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "bradleygbeesley",
        "review_rating": "10",
        "review_title": "Phenominal",
        "review_detailed_main": "One of, if not the greatest movie I have ever seen. The characters are loveable, besides Simon, all my homies hate Simon. The storyline is fantastic, easy to follow, but also complex for some intellectual thought provoking reflection. I am also a big fan of Uncle Ian, one of the mot underrated characters not just in this movie, but in the entire franchise. He is very much the biggest side character, even though I consider him a main character. Simon, on the other hand, deserves to get deomoted to being a side character. My suggestion is to swap Uncle Ian and Simon. But overall a phenominal film, I have seen some bad reviews on this movie, and I cannot stand the blashphemy against Alvin and his shenanigans."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "tanksmiley",
        "review_rating": "10",
        "review_title": "Loved it, loved it, loved it",
        "review_detailed_main": "As a past viewer of Alvin and the Chipmunks, I can say that I was pretty skeptical of how this movie would turn out. Really, taking cartoons and turning them into real characters? How could that work? Well to say the least, they pulled it off. This movie was cute, entertaining, and funny. While it may have strayed a little from the originals, it still had that chipmunk flair that we know best. I am seventeen, and this movie was awesome. It had everyone in the theater, children, teenagers, and adults alike laughing the whole time. And when the credits rolled, there was applause, something I haven't heard at a movie theater in a long time. Even if you aren't a chipmunk fan, any kid will love it, and you probably will too. For me, this is definitely a 10 out of 10."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "ryanbryant",
        "review_rating": "9",
        "review_title": "It's actually really good!",
        "review_detailed_main": "I went into this movie expecting to see something close to GARFIELD (which was a terrible film), but ALVIN AND THE CHIPMUNKS is actually really good! I know. It sounds crazy. Especially coming from a 30 year old. I think Jason Lee is the weakest part of the film. He is funny in some scenes but lame in others. But David Cross is good in every scene he's in. And the movie as a whole is great. It's very funny. And surprisingly emotional. This one is going to go up there with recent comedies with great characters. The story is the perfect one for the remake of the 80s TV show I liked as a kid. It's the origin story about how this guy, David Seville (struggling songwriter, disorganized guy) came to adopt 3 singing chipmunks. David Cross is the music executive who keeps shooting Dave (and his crappy songs) down. Dave has just gotten out of a relationship with a cute girl (don't remember her name, but this plot was totally unnecessary -- the movie's biggest flaw is that it tries to jam in a romance between Dave and this girl, when the real romance of the movie is between Dave and the chipmunks). Dave realizes these talking chipmunks can sing, and that launches the career of the strangest music act ever seen to man. But I'll say it again, the movie is very, very funny. I recommend it to families and even to single people like me who enjoy comedies."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "WeAreLive",
        "review_rating": "10",
        "review_title": "My favourite child hood movie",
        "review_detailed_main": "I gotta say when I was really young Alvin and the chipmunks used to be my favourite live action movie and I used to enjoy it alot.\n\nI am presuming the hate is coming from people who grew up with the original alvin and the chipmunks.\n\nThe music was good, the movie was funny and cute.\n\nOverall good movie if you want to get intrested in Alvin and the chipmunks."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "mommyayla",
        "review_rating": "10",
        "review_title": "The Chipmunks are back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "disdressed12",
        "review_rating": "9",
        "review_title": "it's all about family",
        "review_detailed_main": "i loved this movie.it 's mostly live action,except tor the chipmunks.they are CG animated.if you're feeling down,this movie should pick up your spirits.i found it hysterically funny at times.i think adults will love it as much as kids.it's a movie appropriate for the whole family,in my mind.there's nothing offensive,that i could see.there also a message in the movie,though it's very subtle.or maybe it's not that subtle.i guess it depends on the person.really,family and doing the right thing are the most important things.at least that's what came across for me.beyond that,though, i found the movie a riot,and it's really sweet and touching.i highly recommend it.9/10"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jessica_christians",
        "review_rating": "10",
        "review_title": "one of the best movies I have ever seen!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "OlderSam",
        "review_rating": "10",
        "review_title": "5.7..? Absolutely UNFAIR",
        "review_detailed_main": "First, I watched this movie with my little kids, and then I watched it again alone. My god, it's one hell of a movie, I just can't believe how UNFAIR the voting is.... 5.7? Everything in this movie is just perfect, the animation of the chipmunks, the acting, the story, the joy, and most of all; the way some lines makes you LOL. OK, so far, the total gross of this movie is more than $ 250,000,000 only US and UK which means contradiction, 5.7 and making $ 250,000,000. Just can't get it. Jason Lee was very funny, I'm trying to think of some other actor who would have done better than him... I couldn't find any; he was the only actor for this character. David Cross was the only bad choice; I wish John Travolta had that role."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "musique33",
        "review_rating": "8",
        "review_title": "Take Your Kids, They'll Love It!",
        "review_detailed_main": "Took my munchkin to see Alvin & The Chipmunks today. Though Jason Lee is boring and David Cross is way over the top, the Chipmunks themselves are awesome. Alvin, voiced by Justin Long AKA the \"Mac\" guy is great! He wasn't as recognizable as Simon, voiced by Matthew Gray Gubler AKA Dr. Spencer Reed from Criminal Minds, who has most of the best lines in the movie. Rounding out the cast is teen popster Jesse McCartney as an adorable Theodore. For those who watched the cartoons as kids, this movie is great nostalgia and definitely how you would have imagined the Chipmunks come to life. The music is pretty cheese, but I still would recommend the movie for anyone who has young kids. The first two shows we attempted to go to sold out while we were in line, so we waited two hours just to see the movie, and weren't disappointed. I wouldn't say this is a must see in the theater, but I would definitely catch it again when it comes out on DVD. The movie attempted an underlying theme of the dangers of fame and it's effect on children, which I thought was interesting given all the child star dramas being played out in the media today. I think they meant it to be a subliminal gift wrapped warning for children to not try to grow up so fast and to listen to their parents because they know what's best for them. I don't know if any of that message will really sink in, but at least the kids will be entertained."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "katzinoire",
        "review_rating": "9",
        "review_title": "For The Love Of Family",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "alicelynn",
        "review_rating": "10",
        "review_title": "Adorable Chipmunks!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Apocalypse-21",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "japresley-2",
        "review_rating": "10",
        "review_title": "Alvin and the Chipmunks Brought Back Memories For Me",
        "review_detailed_main": "Hello There AATC Fans!!! 50 years ago when Mr. Ross Bagdasarian Sr. created three little chipmunks, he created a phenomenon. I was born in 1981, so I remember them back 20 years ago. He has done a remarkable and fantastic job in creating these little guys. Jason Lee's portrayal as Dave Seville was just outstanding!!! I've read a lot of comments about the crude jokes and the somewhat sad moments when Dave thought about giving up. Alvin, Simon and Theodore aren't all about crude humor, they're all about recreating a tone that was first heard of in 1958 and again in 1980. in 2007, they were introduced as icons and showed the world that after 50 to 20 years of being exiled, they are back, and better than ever. Parents, PLEASE TAKE YOUR CHILDREN TO SEE THIS WONDERFUL FAMILY FILM!!!! I've heard people say, they don't look the same, well I've got news for those people, in 1985, I was a little kid, always looked little even at 8 years old, now I'm 26, I don't look 8, but I still get people not believing me when I tell them I'm that old. The same goes for Alvin, Simon and Theodore, yes, they didn't look boyish, they looked like real chipmunks, but it's still them. Another complaint, is the Chipettes. They were not in this movie, and people were flipping out saying, \"Where's the Chipette's\"!!!! Well, just like I said about the Chipmunks, the Chipettes are still in a vault somewhere, somewhere in exile. But if us moviegoers can spend our money and see the Alvin and the Chipmunks movie over and over and buy it on DVD, then a sequel will be in the works and the Chipettes will return along with Alvin and the Chipmunks. Ross Bagdasarian Jr. and Janice Karman have done a brilliant job in bringing back those little guys. Mr. Bagdasarian Sr. would be proud of his son and would be thrilled to see all of us marvel at his 50 year creation. It's a must-see and must-have. It's a Christmas treat for all who enjoy laughter and entertainment. Enjoy The Movie and Enjoy The Holidays!!! THANK U!!!!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "falneeg",
        "review_rating": "9",
        "review_title": "goofs galore",
        "review_detailed_main": "It is Christmas time in Hollywood. Dave looks at the clock-it says 6:30, it is still very light outside. I don't know about Los Angeles, but where I live in California, it is dark by 5:00 pm. Other than that, (one of the very obvious goofs), it was a fun and cute movie. I was 5 when they began and I think I knew all the words to all the songs and re-enjoyed the show when my son was little some 27 yrs later. We need more of these feel good, fun and a lack of sexual content movies. Just because we are adults does not mean that is all we care to see when we lay down our $10.00 for a ticket. Not every adult going to see a \"G\" or \"PG\" movie has children in tow."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "barrys82",
        "review_rating": "8",
        "review_title": "Good family movie",
        "review_detailed_main": "Its a good movie, perfect for kids and for those who want to remember their childhood. Based on the 80's cartoon, the story's about three chipmunk brothers who went to live to a music composer with no luck, their lives will change drastically after they start living together. It has some moments that are very funny, some other aren't. The animation is good, not the greatest but good. The music is really good, they used some 80's classics that will make you remember. The cast is decent, Jason Lee in the role of David Seville was OK although it could be better, it was a performance lack of humor, a rare thing on him cause I think he is a great comedian. Cameron Richardson, The Female interest of Dave in the movie, what can I say, she is very beautiful but she doesn't show me that much of an acting. The best one of all the cast was David Cross in the role of Ian, a greedy music manager, was really hilarious. This is an enjoyable movie for the family."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "colby_schmidt7-2",
        "review_rating": "10",
        "review_title": "A Great Movie finally",
        "review_detailed_main": "hey OK first off i grew up watching the cartoon and when i heard about the movie i thought hey they'd probably ruin it well i went to the theater tonight and the movie was sold out i got the last ticket. got in there and boy was i shocked it was a great movie for any age group i'm 18 and i loved it!!!!!!!!!!!!!!!Its got a great story to it and its real funny at parts and the best part for parents is there is no swearing at all so take your kids to see this movie trust me you want be disappointed.Especially if your a fan of the old show and all the old music like i am lol well i'm gonna get off of here see ya'll later peace."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "inkblot11",
        "review_rating": "8",
        "review_title": "Chip, Chip, Hooray! The Chipmunks are adorable, families will love it",
        "review_detailed_main": "Dave (Jason Lee) is an advertising man who secretly longs to be a hit songwriter. He lives in a nice house nested in a beautiful little enclave near LA, with a pretty neighbor named Claire (Cameron Richardson). They once dated but Claire broke it off, feeling Dave was too immature. Meanwhile, three chipmunks have their arboreal abode cut down, with them in it, and shipped to a major recording studio as its Christmas tree. On the day the Dave comes to pitch his songs to the executive of Jett records, Ian (David Cross) and fails to win any approval, Dave picks up a muffin basket and heads home. Guess who is in that little basket? Yes, its Alvin, Simon and Theodore. Soon after, Dave is startled to find three little critters eating his cheese puffs and Lucky Charms. He throws them out in the rain. But, they cheerfully start singing at his window and Dave realizes that they may be the very singing group he needs to promote his songs! Sitting down at the piano, Dave plunks out a new Christmas tune, The Chipmunk Song, and soon Dave and the three darling animals are on their way to success. However, Dave makes the threesome go to bed early and do chores. When this gets annoying, A, S, and Th decide to move in with Ian, who has promised them \"no rules\". But, will the Chipmunks benefit from Ian's guidance? Not likely! Alvin and the Chipmunks is a darling new addition to the holiday movie repertoire. First, the cast is nice, with Jason Lee giving an adorable performance as the harried Dave Seville, and Cross doing a great job, also, as the misguided studio boss. Richardson has a smallish role, which is too bad, for she is lovely and sweet. It would have been nice if the director had put a more obvious romantic encounter (a few kisses?) between Dave and Claire into the picture. Oh, well. As for the chipmunks, they are a computer-generated joy, being very funny, very appealing and very clever. Kids will fall hard for this trio, in my opinion, and want another film somewhere in the future. Then, too, the look of the movie is wonderful, from the nice costumes to the lovely California setting (Dave's house and neighborhood are beautiful) to the art direction. The script, while not totally original, has plenty of fun and frolic. Of course, after the initial Christmas song, the chipmunks get more heavily into \"hip-hop\" style with a syncopated new version of the \"witch doctor\" song, among other tunes. But, that is a minor element in the overall plot development. Mostly, let us all thank the studios for this film with a big \"chip, chip hooray!\" It is a very enjoyable flick that will plaster big grins on the faces of most everyone in the viewing audience."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Movie_reaper",
        "review_rating": "8",
        "review_title": "Loved It",
        "review_detailed_main": "I was expecting a rather boring movie, however, I was pleasantly surprised. I don't know if I a am being influenced by my expectations, however, my reaction to the movie at the end was, \"That Was Great!\" I loved the movie, although I Never liked the cartoon, even as a child.\n\nI also had no problem with the pace of the movie, it all lined up just right for me and my family. At the very least, you will not be disappointed! It was a lot of fun and worth seeing! I'd see a sequel if they had it, but as far as the cartoon is concerned, not interested. My son said the height of the chipmunks relative to one another wasn't in accord with the cartoon."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "moldo_bmf",
        "review_rating": "8",
        "review_title": "Suitable for ages 4-99...",
        "review_detailed_main": "Any fan of Monopoly(c) or any other such games will be familiar with the title I have given the review. It was born out of my utterly pure and totally nonbelligerent desire to point out the fact that you don't have to be in your prime state of development in life to enjoy a movie such as this. Oscar material? Would never even consider it. Excellent? Not even close. Has more dents and scratches then a car freshly plucked out of a demolition derby? Not quite. Do you have to be a raving Alvin and the chipmunks fanatic, who has seen every single episode, can't have any more collectibles with them unless you create them yourself, would marry any one of them if given the chance, in order to enjoy the movie? Not by a long shot... I can't really find word to describe the movie from the myriad of terms that come to mind, save one... good. I suppose that breaks things down easily enough for everybody to understand. And by everybody I mean the entire range of haters, lovers neutrals, people who lost the last shred of their tiny little soul while still in their mother's womb, others who are just jealous that other people have fun when watching this movie, and a great number of other categories as well. I, for one, believe that the only thing that can stop anyone from enjoying this movie in the least measure is their own way of thinking. If you've outgrown the childhood that may or may not have been influenced by such phenomenons as cartoons, you'll probably find this movie stupid, silly or simply outrageous. But... and this is a big BUT ladies and gentlemen, if you still hold that little spark in your soul that switches off an annoying part of your brain that makes you analyze things, then you will most likely kick back, enjoy the movie and savor your popcorn, fizzy drink and/or the laughter of the 5 year old sitting next to you. And as you look at that little boy or girl's face flushed from all that laughter, you might actually find it somewhere in your more or less frozen soul to laugh yourself once every now and then. If your versatility in the domain of cinema is virtually limitless and unmatched, and you have nothing against a silly, heart-warming comedy now and then, check out Alvin and the chipmunks. You'll like it. If you fall into any other of the categories mentioned above, or simply prefer a brain-twisting, heart-wrenching movie, over other kinds of stuff Hollywood throws at your fragile little brain/retinas, then don't waste your money. Use it to end hunger in Africa... it's more productive that way."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "sharmainechan",
        "review_rating": "9",
        "review_title": "A show worth watching as a family.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "nickilancaster",
        "review_rating": "9",
        "review_title": "Fantastic",
        "review_detailed_main": "For anyone who was a fan you must go and see this film, it was so funny right from the start. Im 21 years old and i loved it! The story was good and the voices of the little chipmunks were so funny and cute, i just want one. If you want cheering up or are in the mood for a good old laugh, this is the film to see! I have seen it twice now and it just gets funnier each time. It really is worth a watch, there are so many laugh out loud moments and you will not be disappointed with this film. Anyone who watches it and doesn't like it must have something wrong with their sense of humour it was fantastic and so very funny. Very well done, a pleasure to watch and wasn't let down at all."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "asb-78749",
        "review_rating": "9",
        "review_title": "Alvin and the Chipmunks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "FSUgrad90",
        "review_rating": "8",
        "review_title": "Great movie!",
        "review_detailed_main": "great amazing it is the best Chipmunks movie so far i can not wait for the forth one this movie was funny you will like it a lot if you are looking for a movie that you will laugh on this is the perfect movie this movie is a sweet movie i never thought this movie was going too be this good but it was amazing this movie is one of a kind this is one funny movie for the whole family this is a enjoyable movie for the whole family i liked this movie a lot so will you you have never seen a movie like this before i laughed so hard it as a one of a kind movie you will like it too you have never seen a movie like this before do you know the Chipmunks or not because this movie is like a true story it is a enjoyable movie you will say wow after you see it if you see this movie you will know why i am saying this have a great day"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "MCMAYNERBERRY",
        "review_rating": "9",
        "review_title": "Cool Special Effects",
        "review_detailed_main": "Three chipmunks, Alvin, Simon and Theodore, watch as their home is chopped down by a Christmas tree company. With the boys still inside, the tree is shipped off to the lobby of the prestigious Jett Records, helmed by a slick and conniving record executive named Ian Hawk (David Cross), in downtown Los Angeles. Ian is a former college roommate of Dave Seville (Jason Lee), a down-on-his-luck musician and songwriter who has never given up hope for making a successful career out of his quirky musical sensibilities.\n\nWhen Dave goes to Jett Records to pitch Ian a new song, he is rudely booted out of the offices. Taking a basket of muffins as consolation, he wanders past the Christmas tree being installed in the lobby. The Chipmunks, smelling the tasty muffins, jump in the basket unbeknownst to Dave, who unwittingly carts them back to his apartment where the Chipmunks secretly install themselves quite comfortably.\n\nBefore you can say, \"Alvinnnnn!!!\" the 'Munks run amuck, turning their new digs into a disaster area. The boys' home-wrecking antics include storing toaster waffles under the carpet (put aside for the winter, the 'Munks explain), and leaving some mysterious dark, round objects strewn about (Simon insists they're...raisins). Shocked at what the boys have done to his apartment, Dave is even more astounded when he discovers that not only can these rodents talk, they can sing.\n\nDespite his misgivings about his new tenants, Dave seizes the opportunity to put together his songwriting skills with the 'Munks unique talents. Alvin And The Chimpmunks 9/10"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "odysseyinoregon",
        "review_rating": "10",
        "review_title": "Alvin and the Chipmunks: The Motion Picture",
        "review_detailed_main": "This movie has ever touched the Big Screen from my childhood and it became my American Idol version from the Alvin and the Chipmunks animated series. These Chipmunks remind me of from Disney's Chip \"N\" Dale isn't that similar. I really enjoy watching this movie. I got it for my 29th Birthday this month on DVD. These Chipmunks are so brilliant to watch on the CGI effects that they rock the whole concert tours. They are very small. First was \"The Chipmunk Adventure\" first came out from the animated motion picture from 1987. This movie became every Child's dream come true from the 80's. The Chipmunks are part of every Kids' Idol."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "noblesaidjusticemattox",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Best movie ever. This is the first of the trilogy. I hate Alvin and the Chipmunks: Road Chip. I only like Alvin and the Chipmunks, Alvin and the Chipmunks: The Squeakquel and Alvin and the Chipmunks: Chipwrecked."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "lankymania",
        "review_rating": "10",
        "review_title": "It's About Time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "BA_Harrison",
        "review_rating": "8",
        "review_title": "It's like David Essex's Stardust, but with chipmunks.",
        "review_detailed_main": "When their tree is cut down and taken to the lobby of a record company, three singing chipmunks, Alvin, Theodore and Simon, meet and team up with Dave, a likable down-on-his-luck song writer, to become a world-wide pop phenomenon. But with a manipulative record exec out to exploit the furry trio for every dollar he can make, will fame and fortune prove to be rodents undoing?\n\nI liked 'Alvin And The Chipmunks. On the surface, it's a feel-good family film with a well-meaning hero, cute CGI characters, and a boo-hiss baddie, but it's also a savage indictment of the world of pop music that takes some vicious swipes at the industry's exploitation of minors. Kids will love the silly antics of the cuddly rodent trio; adults should enjoy the lambasting of a business in which image and money are all that matters.\n\nJason Lee (from TV's My Name is Earl) is terrific as Dave, and does a convincing job interacting with his (non-existent) CGI counterparts, whilst stand-up comedian David Cross makes a great impression as slimy executive Ian Hawke. The talented rodents themselves are voiced by Justin Long, Matthew Gray Gubler and Jesse McCartney (although their voices are unrecognisable, having been altered drastically to sound like the famous fur-balls).\n\nThe humour varies from the most basic (fart jokes and slapstick) to the less obvious and more intelligent (one of the chipmunks inhales helium from a balloon, resulting in an extremely deep voice; Hawke gives the exhausted pop-stars the chipmunk equivalent of a line of coke: a cup of coffee topped with cream).\n\nAlvin And The Chipmunks is fine family fun from start to finish, which grown-ups should find themselves enjoying as much as their kids. 7.5 out of 10, rounded up to 8 for IMDb."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kda_h",
        "review_rating": "9",
        "review_title": "I liked the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Parkside1",
        "review_rating": "8",
        "review_title": "Good, harmless, fun",
        "review_detailed_main": "Expecting to catch up on some quality sleep whilst I took 3 seven-year olds to this movie, I came away pleasantly surprised and stayed awake throughout.\n\nThinking the sounds of chipmunks would drive me crazy, the voices were not overdone and constant and provided some amusing comments which did not pander to the young or the more knowledgeable adult - they were just well suited to the story.\n\nNothing offensive or upsetting in this movie. No lengthy explanations required afterwards to the children - what a great little movie to take your children to. Recommend to adults who think they cannot bear to see another animated flick!!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "kikiboo_8",
        "review_rating": "8",
        "review_title": "Adorable and hilarious",
        "review_detailed_main": "Why does this have such a low rating? Yet some idiotic movies have it way higher. It's adorable and super fun, definitely a good movie."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Ozzy2000",
        "review_rating": "10",
        "review_title": "Great family movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "beckham_d81",
        "review_rating": "10",
        "review_title": "This is a really great movie of this kind.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "gcdisneyboytyler",
        "review_rating": "9",
        "review_title": "For Kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "jokinoc-59294",
        "review_rating": "9",
        "review_title": "Chipmunks Life",
        "review_detailed_main": "A big fan of legendary films and chipmunk music, it all started at school age, but over time the zeal faded, but when I had a terrible hangover and accidentally saw films about Alvin, Simon and Theodore on TV, they seemed to have returned from the dead and forced me to review all the films of the series anew, I even watched the 2015 film, who was indifferent to me when he came out, but it would have been better not to watch, albeit with good music in the spirit of chipmunks.\n\nThe film is similar to everything in the world, the standard family theme, the history of show business - how bad it is, but it is so lamp-like, homely, funny, quotable with a downhole soundtrack. Jason Lee is wonderful in the role of Dave, because he is filled with charisma, humor and a textured facial expression, with age the position of the hero becomes more recognizable.\n\nIt's amazing how Ross Baghdasaryan managed to create a franchise about chipmunks, Karl, as much as 64 years ago, so I hope his characters are loved to this day."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "hamrock-14535",
        "review_rating": "10",
        "review_title": "This movie's so good Jason Lee",
        "review_detailed_main": "This movie's so good. I liked the parts where Alvin and the Chipmunks sang they're really good. Jason Lee is really pretty I'm glad they cast him in this movie. I also really like David Cross in this but he did too good a job-I HATED his character he did too good a job. Anyway I hope they release the Alvin and the Chipmunks soundtrack on vinyl so I can add it to my ever-growing record collection! I wish the IMDB forums still existed because I would love to hear what you guys' favorite AatC song is. I'm about to watch the next movie in the series and I know I am going to love it. I'll be back with another review (I already know it's going to be a 10 out of 10)!"
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "perbaby2",
        "review_rating": "8",
        "review_title": "Good for Kids",
        "review_detailed_main": "My boyfriend and I went to see this yesterday, because, let's face it- who doesn't love the Chipmunks? The movie was adorable and definitely good for kids. The one disappointing thing for me was the lack of their songs...the only one they kept was the Christmas Chipmunk song- if you don't count the remix of \"Witch Doctor\"(there was a Chipmunk Dace CD with it on there..but that version was closer to the original). And the ending could have been a little bit better/had more closure. It was a decent ending- don't get me wrong. But I think it could have done better...I know I was left thinking \"uh..is there more?\"\n\nOverall, great film, highly recommend for taking kids or kids at heart to see it."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "claudia_lampl5",
        "review_rating": "9",
        "review_title": "Brought back my love for the chipmunks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Densson",
        "review_rating": "8",
        "review_title": "A good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Catherine_Grace_Zeh",
        "review_rating": "9",
        "review_title": "An excellent, nostalgic piece of cinema that will entertain everyone even if the haven't seen the TV shows",
        "review_detailed_main": "ALVIN AND THE CHIPMUNKS, in my opinion, is an excellent, nostalgic piece of cinema that will entertain everyone even if the haven't seen the TV shows. If you ask me, the music was absolutely fantastic. Of all of the songs, I thought that \"The Chipmunk Song (Christmas Don't Be Late),\" \"Funkytown,\" and \"Witch Doctor\" were the best songs of all. I hated Ian (David Cross), though. The reason for this is that because he was pure evil! However, all of the mischief that occurred was funny. Before I wrap this up, I'd like to say that everyone involved did a good job. Now, in conclusion, if you haven't seen this excellent, nostalgic piece of cinema that will entertain everyone even if the haven't seen the TV shows, go rent it or buy it today. I guarantee you that you'll be thoroughly entertained."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Ilikemostmovies",
        "review_rating": "8",
        "review_title": "kids loved it",
        "review_detailed_main": "The kids loved it. It was a little difficult for me to sit through the entire movie but I wasn't there for me. The acting of Jason Lee and David Cross was difficult to watch but the chipmunks' acting was good. We saw the movie at a second run theater where they show movies just about to go onto DVD. After spending $50.00 on tickets and refreshments and two hours I can't get back, the kids asked if we could pick up the DVD on the way home. I could have saved $30.00 and could have done something that I wanted to do while they watched it on DVD. My kids have the DVD now and watch it all the time. Good for the kids, barely tolerable for the parent. I give it an eight as an average. The kids give it a 10, of course, and I give it a 2. The two is for the chipmunks. They are very cute. I find that the more annoying a show is, the more the kids like it. It's what happens as I get older."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "sfedulow",
        "review_rating": "8",
        "review_title": "Alvin and the Chipmunks - Blu-ray Review from Hollywoodinhidef.com",
        "review_detailed_main": "Reviewed by James Plath, Managing Editor of DVDTOWN.COM and Contributor to HollywoodinHiDef.com\n\nSynopsis\n\nOne name says it all, but who knew of Ross Bagdasarian, Sr. back in 1958, when \"The Chipmunk Song\" sold 4.5 million records in just seven weeks? Bagdasarian was better known as David Seville, and a high-tech tape recorder allowed him to do the voices for all three chipmunks as well as his own, and the musician's son revived the pop-novelty phenomenon in the Eighties, when it spawned an animated TV show. Now, this live-action and CGI film brings \"Alvin and the Chipmunks\" to a third generation. Forget what you've heard from cranky critics.\n\nThis is a great family film, entertaining for the youngsters and fun for parents, and not just because it's an \"origin\" story that incorporates snippets of the old familiar songs. Sure, it's a giggle to see how Alvin, Theodore, and Simon end up bagged in a Christmas tree that's erected in the lobby of Jett Records--where Seville just happens to have been tossed out by his old college roommate and Jett honcho, Ian (David Cross). But it's also a hoot seeing Jason Lee duplicate the wide-eyed enthusiasm from his TV character on \"My Name is Earl,\" only with chipmunks to interact with instead of a slow-on-the-uptake brother.\n\nThe plot is pretty standard. The chipmunks (voiced by Justin Long, Jesse McCartney and Matthew Gray Gubler) strike a deal with Dave to sing his songs in exchange for room and board, but then go with \"Uncle\" Ian after they're convinced Dave doesn't want the little troublemakers in his life anymore, only to have Ian turn into a regular Stromboli, working them until they're ragged (and until Dave can come to the rescue). Dave apparently has problems committing to a family, and so a side plot involves his ex- (Cameron Richardson). Though the Chipmunks go from Chip 'n' Dale clueless to hip-hop savvy faster that Alvin can get into trouble, how much logic do you want from a film that has talking and singing rodents? The CGI animation is excellent, the furballs are fun to watch, and there's only one poop joke and one fart gag, which is tame by today's standards. Kids will love it for the mischief, the singing, and the humor. And ultimately, the message (family first) is a good one.\n\nVideo Quality\n\nThink primary colors, and lots of them, along with strong black levels that provide a nice 3-dimensionality, and not just for the CGI chipmunks. \"Alvin and the Chipmunks\" was transferred to a 25-gig disc using the AVC/MPEG-4 codec and presented in 1.85:1 aspect ratio, and it looks great in 1080p High Definition. The picture has a nice polished plasticine look to it, with strong edge detail.\n\nAudio Quality\n\nI'm a PCM fan, and so to my ears, while this DTS HD 5.1 Master Lossless Audio does a fine job of delivering a clear soundtrack with a nice balance and spread across the front speakers, it doesn't seem to have that extra \"pop\" that PCM often delivers. The rear speakers get involved during the Chipmunks' shenanigans and music, and particularly with the hip-hop numbers they really come to life. You lose a little fullness with the Spanish and French Dolby Digital 5.1, but both are still very serviceable soundtracks.\n\nSubtitles are in English (CC), Spanish, Cantonese, Mandarin, and Korean.\n\nBonus Features\n\nFor a box-office hit, \"Alvin and the Chipmunks\" comes with only TWO features, not counting a handful of other trailers. That's not even one per \"munk.\" One of them gives us the history of David Seville and the Chipmunks, narrated by Bagdasarian, Jr.. It covers all the bases, and while it falls short of being what fans have come to think of as a full-blown documentary, with multiple talking heads, copious clips, and behind-the-scenes footage, it's still a nice feature. There are vintage stills, artwork from advertising and promotions, and a nice overall history. A second short feature on the music explains how Ali Dee and Co. didn't just want to make music for helium-voiced chipmunks; they wanted to make cool hip-hop and R&B tracks that would be worthy of a Top-10 song. It's interesting, but I would have liked to have had another feature on the CGI animation or a commentary track with Lee and the director. Why not?\n\nTru-Blu?\n\nIf you have a Blu-ray player and you have children, you already know that good HD titles for the whole family are tough to come by. Though there have been plenty of failures when it comes to live-action/CGI versions of a beloved cartoon classic, \"Alvin and the Chipmunks\" really does a nice job of appealing to nostalgic fans of the old music and cartoons, while also jazzing it up for a whole new crowd of admirers."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "stephenchase-63504",
        "review_rating": "10",
        "review_title": "The greatest movie based on a TV cartoon!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "alfoh-47744",
        "review_rating": "10",
        "review_title": "Work of Art!!!!!!!!!!!!!!!!!!",
        "review_detailed_main": "This movie is a masterpiece on all levels, it really made my taste buds feel all tingly and gooey., would recommend for anyone looking for something to... enjoy 😉."
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "snax7629",
        "review_rating": "9",
        "review_title": "Loved it (and I'm a teen)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "lacking in imagination",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "chieftawsmcool",
        "review_rating": "",
        "review_title": "T.V. Show: Good, Movie: ruined",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Phil_Chester",
        "review_rating": "",
        "review_title": "Lighthearted fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "shelltoontv",
        "review_rating": "",
        "review_title": "It's a Family Movie, yes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "bluesman-20",
        "review_rating": "",
        "review_title": "Theodore Simon Alvin Alvin....ALVIN!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Sethizer",
        "review_rating": "",
        "review_title": "The Perfect Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0952640",
        "movie_name": "Alvin and the Chipmunks",
        "movie_rating": "5.3",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "The CGI chipmunks aren't so bad.",
        "review_detailed_main": ""
    }
]