[
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "marsh876",
        "review_rating": "6",
        "review_title": "Good Fluff",
        "review_detailed_main": "Sometimes, when I come home tired from work and have a brewski and want to zone out, I feel like a total fluff movie. Richi Rich fills the bill. It moves along, something most movies don't. It's harmless and doesn't require any involvement on my part. The jokes are silly. I can miss some of it on a fridge run, come back to it, and still follow it. In fact, if I don't finish the movie, it doesn't seem to matter. However, it is charming, so I usually do.\n\nThe movie pokes fun at the super rich on a superficial level, but that's all right. I'll save the harshly critical movies for a different mood. There's some lovely views of the Biltmore estate. There's light ribbing of the corporate world. Oh dear, I'm falling asleep. I'll miss the end of the movie. Too many brewskies."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "shneur",
        "review_rating": "6",
        "review_title": "Not really all that bad...",
        "review_detailed_main": "This was Macaulay Culkin's first major flop, when he was finally un-cute enough that viewers noticed he couldn't act. Other than that, compared with other mindless, shallow, hopelessly far-fetched pseudo-adventures designed for either very small or very uncritical children, it's really not worse than one would expect. Well, the comic book on which it's based is not exactly Stan Lee either\u0085 From a pedagogical point of view, one must say that Richie takes control of his situation in the absence of his parents, makes decisions that are largely sensible and practical, and carries them out mostly without adult help. He combines emotional and rational qualities without violating his basic identity as a kid. To me, that's all good, and redeems the entertainment value of this movie for a young audience."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "5",
        "review_title": "Personally I thought this film was merely okay",
        "review_detailed_main": "I didn't absolutely hate Richie Rich, but for me it wasn't that great either. As usual, there were some good things, but some not so good things as well.\n\nTHE GOOD THINGS:\n\n1) Macaulay Culkin, personally I think he is better an actor than people give him credit for. He is one of the main reasons why I love the first two Home Alone movies so much. Here, he gives a very spirited lead performance, admittedly not as cute as he was when he was starring in underrated gems like Uncle Buck, but he shows once again what a talented actor he was.\n\n2) Jonathan Hyde as the butler comes very close to stealing the show, a very funny and sly performance. Also Edward Hermann and Christine Ebersole give humorous performances, while John Larroquette plays the villain of the piece more than adequately.\n\n3) The scenery is quite impressive, captured well by the breezy cinematography. The Biltmore estate was gorgeous.\n\n4) The soundtrack was decent, nice background music especially.\n\n5) I liked the moral the film taught; All the money in the world can't make you happy, thinking about it that is true.\n\nTHE NOT SO GOOD THINGS:\n\n1) While I liked the moral of the film, the story itself is predictable and somewhat contrived. it probably doesn't help you have seen it all before.\n\n2) The script is quite weak in general. Don't get me wrong there were some good spots like \"Oh my god I look like Michael Jackson!\" but the jokes are admittedly very silly and juvenile, and the scripting does fall in the danger of becoming clichéd.\n\n3) The pacing. Now I don't mind films that move fast. I do have more of a problem if the pacing is TOO fast, despite the feel good nature of the film, and its valiant attempt to rise above superficial material, the film feels a little too rushed, the ending particularly felt skimmed over.\n\n4) The characters feel rather stereotypical. Maybe that is an unfair complaint as it probably couldn't be avoided, but I couldn't help thinking yeah I recognise that type of character.\n\nOverall, definitely not a bad film, worth watching at least once, but I personally didn't find it that great. 5/10 Bethany Cox"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "liammurphy1",
        "review_rating": "",
        "review_title": "Money Can't buy happiness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "ironhorse_iv",
        "review_rating": "5",
        "review_title": "While, Richie Rich didn't struck it rich at the box office. It was still somewhat entertaining, even if some parts were indeed poorly made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "robb4964",
        "review_rating": "7",
        "review_title": "Why so harsh?",
        "review_detailed_main": "I gave this movie a 7 on a scale of 1-10 because I took into consideration it is a kids movie and should be judged as such. When this movie came out I was 13 and of course I enjoyed it much more then as opposed to now but having watched it as a child and as an adult I do remember how much I enjoyed the film as a kid. From the harsh grade of a 4.4 average I assume people where comparing this to complex movies with great plots. Kids should not be subjected to nothing but adult theme. So when you grade the movie remember what audience it was desighned for.As a child I would have gave this movie a 7. Would you drive a metro and act as if it should perform like a porsche?"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "cashimor",
        "review_rating": "4",
        "review_title": "Typical standard moralistic comedy. All ends (too) well.",
        "review_detailed_main": "I think there are many movies made like this, probably aimed at some idea what children would like, but which will educate them as well. Money is indeed not everything, but baseball isn't\n\neither. Most of the characters are too stereotyped to be funny. Too many movies of this kind have been made already, and I had at least hoped for some unique aspects. However, if this is the first of this kind you will see, you could be in for a great time."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Hollywood_Yoda",
        "review_rating": "7",
        "review_title": "Underrated Family Film",
        "review_detailed_main": "Based on the comic strip of Richie Rich, this is an underrated film starring McCauley Culkin in a non Home Alone film. The co-star cast is not so bad either with John Larroquette (Dan from Night Court), Edward Hermann (voice of the History Channel) and Jonathan Hyde (Van Pelt from Jumanji). Christine Ebersole as Mrs. Rich though, was a letdown.\n\nFor an early 90s family film, it can seem flunky by standards of 2018, but it was all in fun. What kid wouldn't want to live the life of Richie Rich, or have their very own McDonald's restaurant right inside their home?\n\nDefinitely a fun film to show kids, especially if you were a fan of the film growing up. Of course, the story wasn't the best, but what do you expect. However, it's still entertaining in its own right. The sequel, a Christmas foray, is another story!"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Chaff",
        "review_rating": "2",
        "review_title": "Too tame by half",
        "review_detailed_main": "Too much given to the gee-whiz, what-can-Richie-afford, this movie needed to be much more crazy and whimsical, to fly in the face of the opulence onscreen. Good supporting cast mostly wasted.\n\nThe sole unexpected moment of delight was finding out our villain would stop at nothing to capture the \"Rich family treasures\", consisting of bronzed baby shoes, portraits, and favored toys & mementos.\n\nTrip up our expectations once every few minutes, and let's talk.\n\nBy the way, how many other movie posters give away the ending?"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Atreyu_II",
        "review_rating": "6",
        "review_title": "1994: the beginning of the end and success of Macaulay Culkin's career",
        "review_detailed_main": "In 1994, Macaulay Culkin stared in 3 films: 'Richie Rich', 'The Pagemaster' and 'Getting even with dad', none of them particularly interesting. The movies themselves did poorly at cinemas and in critical terms.\n\nIn 1994, Macaulay Culkin was 13/14 years old. He was in his early adolescence, so he was growing. A difficult phase for him. Ridiculously, people began to ignore him because of that - either that or they simply thought his cuteness was disappearing and gave him little value for that. But he always proved to be a terrific actor. True, there were many, many great child actors but he was one of them for sure. Sure, his cuteness took him far, but it was his talent that made him a legend.\n\nAfter playing a completely different role in the 1993 film 'The Good Son' (where he played a psychopath that could very well disguise that nature thanks to his angelical looks, a wolf in sheep's clothe), he returned to the roles of 'good guys' in all of his 1994 films.\n\n'Richie Rich' is not much of a film, but perhaps it's a little more interesting than 'The Pagemaster'. It's not a bad movie, but it's a somewhat complex film for me to give a fair rating. It has good moments but also very stupid moments, particularly from the 2nd half on (in my opinion, where the movie is at its weakest).\n\nMacaulay Culkin plays the title character. Richie Rich is rich (like his name suggests), lives in a fancy mansion surrounded by comfort and luxury and can even count with a chauffeur that takes him in his majestic and elegant Rolls-Royce Silver Cloud whenever it's necessary. But Richie realizes that there is one thing that money can't buy: happiness. He feels the lack of friends and possibly bored with his tedious life. He just wants to be like the other kids.\n\nAbout the things I found funny in this film, a good example of that is the line «Oh my God, I look like Michael Jackson!» by Richie's mother. Come to think of it... that's not untrue - lol. I'm surprised they put this line in the film because Macaulay Culkin stars in it and considering the friendship he had with the eccentric singer... Other funny details are, for example, the cute dog that has dollar signs instead of spots and appropriately named Dollar, and the scene when Richie doesn't wanna wake up but stares at his personal trainer when he realizes what a beauty she is (she is portrayed by the supermodel Claudia Schiffer).\n\nMacaulay Culkin had everything to be a great name of the cinema. And he was, for a few years, mostly thanks to the success of the first two 'Home Alone' films. He was talented, charismatic and good-looking. Too bad he trashed his life later, but I believe he turned out to be like this because of his personal problems."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "not terrible",
        "review_detailed_main": "Richie Rich (Macaulay Culkin) is the most valuable possession of his billionaire parents (Edward Herrmann, Christine Ebersole). He has everything and loyal butler Herbert Cadbury (Jonathan Hyde). However he doesn't have regular friends of his own age. Professor Keenbean is the company scientist with his many inventions. Company executive Lawrence Van Dough (John Larroquette) opposes Mr. Rich's plan to give away a tool plant and spending on inventions. He also lust for whatever is hidden in the family vault. Richie makes friends with kids playing baseball at an industrial lot. Richie's parents are lost at sea when their plane is brought down by a bomb. Van Dough battles Richie who owns 51% share of the company.\n\nRichie Rich is a bad comic to make into a movie. I don't know what kind of problems Richie Rich has to overcome. It seems like a comic about a kid and his toys. The movie isn't cartoon fun. It does actually has some limited thrills. The characters are good for the most part. The mix of children's comic and real action don't always coexist easily. It's not that terrible but it doesn't really feel joyous."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "ccthemovieman-1",
        "review_rating": "8",
        "review_title": "Enjoyable Movie For Teens & Adults",
        "review_detailed_main": "This is definitely teen fare, but it's very entertaining which means adults would get a lot of laughs out of it. As with any comedy, some of the stuff is really stupid and some of it is really funny. Along the way, you get some of modern Hollywood's secular plugs and a few swear words that you wouldn't want your little ones to hear, but overall, I have little to criticize with this one.\n\nThere were a number of sight gags, things that made me laugh out loud, such as dollar signs instead of spots on the dog, the dress-ware of the little rich kid (Macauley Culkin), the eccentric characters - good and bad guys - are all fun to watch.\n\nI thought Jonathan Hyde, as the butler, stole the show."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "timoschott-07241",
        "review_rating": "7",
        "review_title": "Had a good laugh",
        "review_detailed_main": "I don't know why it has such a low rating. The movie does not want to be taken serious. So it is not serious. The movie is aimed at kids and that makes it great. I watched it in my early twenties and had a good evening watching the movie. Great for family's and kids."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "StevePulaski",
        "review_rating": "5",
        "review_title": "He has charisma; for everything else, there's Mastercard",
        "review_detailed_main": "Richie Rich stars the charismatic, easily-lovable Macaulay Culkin in a role that basically begged for him from the first day of pre-production. Unfortunately, nothing else begged much attention in terms of how Richie Rich conducts itself as a piece of family entertainment. Is it serviceable? Absolutely. Just prepare for a rather long and tedious ninety-four minutes. Kids will appreciate it, seeing their favorite hero from Home Alone getting into more hairy little circumstances, but the true victims, the parents, will likely be contemplating better things they could be doing with their time.\n\nMake no mistake; I was enjoying Richie Rich for about forty-five minutes on a simply, passable level. Then at the hour mark, I grew restless, and by the finale, I was shaking my head at the missed opportunity the film could've capitalized on. I'll come back to this later. The story is inspired from the comic-book character who made quite the name for himself in books and strips that I never found myself reading. He is played by Macaulay Culkin, who was born to Richard and Regina Rich (Edward Herrmann and Christine Ebersole), a couple worth a dollar over $70 billion thanks to their immensely successful Rich Industries. The three live in a house that appears to be sitting two full-size golf courses, and embrace their wealthy status in the way of philanthropy, and not personal narcissism.\n\nWhile Richie enjoys living a lavish life, traveling in helicopters, playing basketball in doors, and carrying thousand-dollar bills in his wallet, he greatly envies the lives of regular, middle-class children, who have very little priorities and can spend their days playing baseball in an open sandlot.\n\nWith this kind of setup, you'd think the film would be on the track of setting up a \"lonely rich boy\" sort of moral, emphasizing that all the money in the world can't buy true, wholesome companionship, right? Well, just as we're about to further dive into that, a pesky plot point involving corruption, attempted-murder, and industry takeover begins to plague the Rich family, and with rumor that his parents are dead after a nice pack of TNT was on their private plane, Richie assumes the role as the CEO of the company. But just as we're about to go further into that detail, we focus on one of Richard Rich's employees, who tried to murder the couple and their kid to take over Rich Industries for himself. Not if Richie and his loyal butler Herbert Cadbury (Jonathan Hyde) can help it, though.\n\nRight off the bat, we just passed up two solid directions this film could've taken instead of the contrived, foreseeable one it settled on. Yet if there's one thing that can't be overlooked about this film, it's the abundance of character-actors, who all do a capable job of doing what they can with what they have - especially Macaulay Culkin. Culkin's gifted, easy-going performance makes one sad that this was his last \"big\" film as a child actor, before landing roles in several under-performing independent films before fading into tabloid obscurity.\n\nCo-writer of Richie Rich Neil Tolkin worked on License to Drive, a potent, lively comedy about a teen and his two friends going out after hours in his grandfather's Cadillac even after failing his driver's test. After that, he settled for very little doing both Richie Rich and the atrocious Pauly Shore comedy Jury Duty a year later. When glancing through director Donald Petrie's filmography, it appears that he has made a career out of making spur-of-the-moment comedies that usually do fairly well at the box office before becoming safe-bets on cable. He has a formula and he should stick to it. It's just sort of upsetting that Richie Rich aspires to be functional, rather than successful.\n\nStarring: Macaulay Culkin, Edward Herrmann, Christine Ebersole, Jonathan Hyde, and John Larroquette. Directed by: Donald Petrie."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "famelovingboy68",
        "review_rating": "",
        "review_title": "Culkin's last movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "2",
        "review_title": "It has Macualay Culkin in it, of course I hated it.",
        "review_detailed_main": "Yes, I am not a member of his fan club and for the most part I hate nearly everything he was in. My favorite scene with him is the one in \"The Good Son\" involving the cliff. I had a nice laugh with that one. Here there is no such scene and the film might as well be called \"Home Alone 3: this time the kids rich!\" as it has almost the same premise. Granted the parents did not really leave him, but rather got into an airplane crash, but it is essentially the same as that brat is in this one too. So the story is the kid is lonely and tries to make friends, parents disappear after a plane crash, some dude is trying to get all the money for himself and there is no robot like there was in the original cartoon still trying to debate if that is a bad or good thing. All I know is that the film for the most part is cringe worthy, but as I have said I can not stand Macualay at all so I am going to tend to be against anything he is in. I did not like \"Uncle Buck\", \"Home Alone\" or any of the movies he has been in. Except for said scene, ah yes plunge to your death you spoiled sack of...ahem, the only reason I give this movie a two is that there was a joke in it that actually got me to laughing involving this laser or something blowing a chunk out of a stone statue. Other than that, barf."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "shermeent",
        "review_rating": "7",
        "review_title": "Fun for the family",
        "review_detailed_main": "Easy to watch and follow, quick-paced and likeable characters. It's a good show to watch with your younger kids."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "2",
        "review_title": "useless",
        "review_detailed_main": "I know, \"Richie Rich\" is supposed to be more about making friends than about wealth, but it doesn't work. The whole thing about the cabal trying to seize his money was merely an excuse for what was basically a glorification of money. I think that there's a reason that Macaulay Culkin disappeared after this movie (although that was already coming). There are some clever lines - namely the Michael Jackson comment - but there are plenty of good movies out there, so there's NO REASON to waste your time on this. Also starring John Larroquette, Edward Herrmann, Christine Ebersole and Jonathan Hyde; they probably don't wish to include this on their resumes."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "7",
        "review_title": "Meet a Wholesome Rich Family",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "bradleyadita",
        "review_rating": "4",
        "review_title": "\"Bad Year\" for a \"Cool Kid\"",
        "review_detailed_main": "While 1994 was a great year to be Green Day or The Offspring, this was not so for the young Macaulay Culkin and his fans. As a 14 year old playing the younger 12 year \"richest kid in the world\", Culkin and his management must have realized quickly that he could not stay a child actor forever. Richie Rich, therefore became Culkin's last major project until his return to film as a 23-year-old young adult in 2003's Party Monster.\n\nIn \"Rich\", no actor is in top form. The laughs were too few and too far between, especially for a family comedy. The post-Jurassic Park CGI \"robot bee\" may have even been a hindrance rather than a creative flourish. None of the characters were developed beyond the simple caricatures we'd expect and further stripped of comedic potential. By the time the antagonist breaks into the vault, anyone over the age of 17 probably knew what was inside; that is if they hadn't already stopped paying attention and fallen asleep.\n\nHad the film starred another adolescent lead, we may have been forgiving, but the overall quality of this venture paled in comparison with the Culkin we knew from Uncle Buck, the Home Alone pictures, My Girl, and even his brief appearance in Michael Jackson's 9 minute \"Black or White\" rampage. Being that it was filmed in and around the Chicagoland area, and that this reviewer is a sucker for anything local, this reviewer feels generous giving Richie Rich 4 out of 10 IMDb stars."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Rich kid",
        "review_detailed_main": "One may wonder if this was even acting, considering Kevin ... I'm sorry I mean Macauly Culkin, was on the top of his game. On a throne of sorts after the Home alone movies that made him. This was going to show a different side to him. I guess and he is rather likeable in this one. I assumed we would get an obnoxious rich kid, but the pressing matters lie elsewhere.\n\nSo he may be a bit (a lot?) spoiled, but he also knows right from wrong. Which I reckon has a lot to do with his personal servant. Political correctness aside, the movie can be fun. Just let its silliness run through you and all will be well. It also has not aged that badly I have to admit"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "Ri¢hie Ri¢h",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "reshania-naidoo",
        "review_rating": "9",
        "review_title": "Don't know why this scored so low!",
        "review_detailed_main": "Great movie, edited well and entertaining. Jonathan Hyde's acting is fantastic."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "thomasjohaan",
        "review_rating": "6",
        "review_title": "Illogical movie which is good for kids",
        "review_detailed_main": "Illogical movie but it is a fun watch . Recommended for kids till age of ten.The movie is not unique or special , it is like all the other movies. Not a must watch. I did not actually like the movie but as I told it will be loved by children . Zero percentage logical movie with a eighty percent enjoyment for kids"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Terryfan",
        "review_rating": "5",
        "review_title": "It has it moments",
        "review_detailed_main": "Ri¢hie Ri¢h I remember when there was a cartoon about the richest kid in the world.\n\nHere we get a live action motion picture. However the film looking back on it was basic at best.\n\nWhile it did have moments to make it worth watching it did however just feel like just another family comedy film.\n\nNow now I'm going to say I hate this movie but it wasn't a perfect either\n\nThe acting in the film just feels up and down but Jonathan Hyde's performance is where he shine and he more or less took the spotlight for his performance while the rest of the cast was up and down\n\nWhile I will also give points for trying to have a creative plot which if you are curious just watch the movie to get a better idea because for a family comedy it has plot twist.\n\nAlso some of the comedy here don't seem right and more or less hurts the film\n\nAgain I'm not saying its a fully bad movie it just one of those films that has it moments\n\nI give Ri¢hie Ri¢h a 5 out of 10"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "The Bastard_King",
        "review_rating": "",
        "review_title": "There's a reason it flopped... (Minimal Spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "joshmmmm",
        "review_rating": "5",
        "review_title": "Not one of his best",
        "review_detailed_main": "I love Culkin. He was great and this film is unfortunately not one of his best. But it still had some laughs here and there. But the Home Alone's are the must see over anything if you're going to watch Culkin."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "oscardomingueziiiod",
        "review_rating": "6",
        "review_title": "1998 is better than 1994 movie",
        "review_detailed_main": "This movie was enjoyable at first. I wasn't expecting this second film of Richie Rich. As the classic Christmas movie. Otherwise is a comedy classical orginal one. I must say the better movie RICHIE RICHIE CHRISTMAS WISH. The cast richie rich, professor Keenbean, Cadbury, dollar dollar the dog the originally cast. Eventhough from the character role professor keenbean I love his science invention there pretty cool . Cadbury character role a nice butler who became a bad twisted gangster. Dollar the dog character role amazing in a cool way. From rich I can't say anymore. In the conclusion good movie"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "willcundallreview",
        "review_rating": "3",
        "review_title": "Too flashy and unfunny",
        "review_detailed_main": "Richie Rich is a 1994 family comedy starring Macaulay Culkin and John Larroquette and is about a young rich kid who well, has a few problems. He's basically dirty rich and lives with his pretty nice parents who give him everything he wants, except he kind of wants to play with other kids from the street rather than the private school friends he has. The film is one of those one's you can imagine watching on a Sunday afternoon, and this can be enjoyed too but maybe it just isn't so clinical.\n\nThe comedy side of the movie is really kind of non existent, it tries it really does but by the end your kind of feeling disappointed. The story I'll give it is not boring, it has it's moments where you actually are maybe rooting for Richie and his fellow friends and butler(Jonathan Hyde), but in truth it's hard to like Culkin. Our main star in this is just too unbelievable and wastes any talent he has by being a dull main character, top that also with a poor script and you have Macaulay Culkin acting and sounding like some kind of badly built robot actor.\n\nDonald Petrie directs and he is pretty average really, doesn't do enough to make the story or actors better but also the general direction Is just well, not done well enough really. Now I'm not the biggest fan of these kind of comedies, in fact most I watch I don't expect much in terms of laughter, and here is another example. One thing I am trying to say though is that this didn't bore me strangely, I mean it is still a pretty bad movie but at times interesting.\n\nListen this is the kind of movie where at times it tries to flash it's crazy gadgets and cool rich persons items, but only really succeeds in making us the slightest bit interested in the ending. And on that point the end, actually not too bad but followed up just too poor a beginning and middle, Culkin also seems to get better but when he is sad, he just can't act at all!. Now don't watch this and expect to hate it, some could definitely enjoy it, some will hate, but always remember if this movie made you laugh because this movie labels itself as a comedy.\n\nAnd what about the other cast?, well not everyone is necessarily bad, Jonathan Hyde as the butler is pretty good and when he features the film can be a slight bit more interesting. John Larroquette as the scheming \"Van Dough\" is also not that bad, should have played into the jokes a bit more and maybe even have been a bit more in to what he is actually doing, kind of looks bored in this movie really.\n\nSo overall a movie I found to be well, just not good really, it isn't awful just not acceptable, the kind of movie only a few will like but at least there isn't only one person who likes it. If you like your family comedies you may enjoy it, Culkin has really grown up too much for Home Alone fans to come a knocking but still if your a big fan of his then sure, give this a go."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "richeysj",
        "review_rating": "6",
        "review_title": "How Long Were His Parents Lost At Sea?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "MovieFan983",
        "review_rating": "4",
        "review_title": "Mildy Entertaining",
        "review_detailed_main": "This movie was really ok, it was harmless, had nothing that you could be against. It was just kinda dumb, boring, and Macauly Culkin doesn't have much anymore in the way of appealment. Sure it worked in Home Alone and Home Alone 2, but it really doesn't here. So I give Richie Rich a 4 out of 10."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "stuartvernon",
        "review_rating": "7",
        "review_title": "An Enjoyable Kids Film",
        "review_detailed_main": "I remember my mam buying me this on VHS for Xmas. So I have always liked it.\n\nMaculy Culkin is quite good in this and he plays a rich kid who's parents are in a plane crash and he decides to get his own back on the bad guys\n\nThe bad guys are bad and the main bad guy is a slimeball. I love the butler and him in biker clothes is quite funny.\n\nWell worth a watch"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "gcd70",
        "review_rating": "5",
        "review_title": "Above average Richie bounces along",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "dockerykelli",
        "review_rating": "10",
        "review_title": "Such a wonderful family friendly film to enjoy!!!",
        "review_detailed_main": "Richie Rich is a terrific film to watch! It has love, laughter throughout the movie, silly antics, light dark moments. An overall great cast and storyline!!!! A+++ Film."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "alexpeychev",
        "review_rating": "6",
        "review_title": "Money Can't buy happiness",
        "review_detailed_main": "This movie - Macaulay Culkin's Last movie as a child is not his best but not his worst - that goes to the unfunny Ted Danson Action 'comedy' Getting even with dad which came out the same year- But it's pretty sickly sweet and you can see why it bombed at the Box Office. The plot concerns the richest boy in the world 'Richie Rich' Played by Culkin, But by this time he was at 14 looking too old to play the title role. He's the boy who has everything, wealthy parents lives in a big mansion has a butler (wonderfully played by Johnathan Hyde) - But he's very lonely, he has no friends. So one day he tries to join a group of inner city kids playing baseball but they don't want to know him. One of Richie's father's associates Lawrence van dough (John Larroquette) wants to get his hands on the company and the family's fortune, so he tries to kill mum and dad -Ritchie needs the other kids's help to save the company, his parents and his fortune aided by The butler.\n\nNot a bad movie it has a very good moral story (all the money in the world can't make you happy)- But strictlty for KIDS or easily amused adults."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Calicodreamin",
        "review_rating": "5",
        "review_title": "Rich kid movie",
        "review_detailed_main": "The whole movie is just about a rich kid being treated like a rich kid then people realizing he's actually a good kid too. It's very contrived and not very exciting or interesting. Some of the movie tech concepts are cool, and I love Cadbury the butler. But overall it's just a meh movie."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Coxer99",
        "review_rating": "",
        "review_title": "Richie Rich",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "ElMaruecan82",
        "review_rating": "5",
        "review_title": "Mansion Alone ...",
        "review_detailed_main": "Macaulay Culkin was one of the first major stars of my generation and I still remember that little lump in the throat when in 1995, I realized how much he changed since the \"Home Alone\" and \"My Girl\" days. Three years in kids' cuteness scale is quite an eternity. The heart wasn't in it and it showed... maybe Culkin was so blasé about being wealthy it wasn't a role that required much composition but writers should also be responsible for their incapability to find a right dosage between warmth, fun and thrills.\n\nAnd a potential for warmth there was, Mr. And Mrs. Rich played by the late Edward Herrmann and Christine Ebersole are perfectly cast as the loving parents so blinded by their undivided love for their son that they fail to see what is truly missing. That the parents were depicted as nice people, philanthropists, was a nice departure from the usual \"rich equals snobbish\" trope and it actually enhances Richie's crisis, it's not that he lacks love, but one he'd have earned.\n\nBeyond the jovial and oblivious parental façade, there's the obligatory butler: Cadbury played by Jonathan Hyde strangely resembling F. Murray Abraham. Cadbury is the hit-or-miss character, the adult and responsible figure that keep Richie's feet on the ground and has an awesome moment where he puts in his place a bodyguard (Chelsie Ross) after he grabbed Richie's arm 'for protection'. Ferguson would later team up with the Big Bad: Van Dough, the treacherous secretary played by John Larroquette. This is a man who's got all the money he'd need but no, he wants more because, you know, plot.\n\nAnyway, like a good villain borrowed from Scrooge McDuck adventures, Van Dough covets the family's secret vault that contains their most valuable treasure. Half the job is done with the villain and Larroquette is cunning enough, cruel enough, stupid enough to be a convincing Rated G Hans Gruber. Honorable mention to Michael McShane who plays a goofy mad scientist type and dishonorable mention to all the fat--eating jokes made at his expenses, and that goes for the fat kid, too.\n\nNow, while Donald Petrie (the director) clearly didn't exactly make a name, t's fair to say that as a comedy, \"Richie Rich\" isn't a total disaster and is occasionally capable to elicit a few sustained looks of amusement. Still, it's sadly ironic that a kid-oritened film isn't capable to understand children. I can say that because even in the mid-90s, some gags fell flat and the status of Rich's \"sandlot\" friend as your typical stock kid characters didn't fool us. In fact, the characterization of Richie's friends, or even Richie, is indicative of the film's main weakness: it was incapable to write kids.\n\nI don't know if the writers had children or were rich but their assumption of what rich and poorer kids be like is rather unflattering. According to the film, kids are superficial, intolerant or tribal and would hang out with the rich one just for the fun. Granted that one would be true but the instant rejection seems like one of these moments designed to make us feel sorry for Richie, but emotions aren't that easy to pull in an irrational context. That they haze him a little at first makes sense but refusing to see him again was too harsh to be believable. Nevertheless, within its clunky mechanisms, the plot goes toward the right direction. Kids ultimately come and have fun in his mansion, a rival for Michael jackson's \"Neverland\" and after that nice evening, Richie overhears that it was part of a 100-dollar deal.\n\nAnd this is where the film commits its worst mistake. Before that, Richie's wealth was treated like a gimmick with a few tired jokes about banal objects being made of gold, anyway nothing original when you saw a few John Landis flicks of the 80s, and many gags had good set-offs for weak pay-offs. Even Claudia Schiffer's cameo is embarrasingly dated now, not too mention a tad sexist. This humor didn't really allow Culkin to elevate his character and prevent the Razzie nomination he had coming. But the film was building something with the \"friends\" subplot, and when that afternoon ended on a sour note, it was the occasion to examine Richie's reaction. To whom would he direct his anger? Cadbury? The kids? His parents? Himself? We'd never know for this is immediately swept off by the news about the parent's crash accident and the incident is never mentioned again.\n\nThere are three writers in the credits (maybe more) and I suspect each one was in charge of one specific aspect: friends, action, wealth and only within a hackneyed formula could these tired tropes converge. Ultimately, the kids (except for the girl played by Stephi Lineburg) were only meant to form that Goonies-like team to fight the baddies, as if the delight of having friends could only be expressed in the context of an extravagant adventure. Sure Richie Rich is a comic-book character but if the point is to make him relatable, how about writing a credible adventure... can't money buy normality?\n\nSure the film is innocently silly and when you have bags of manure being catapulted or a weird romance between a butler and a mother (who doesn't care about endangering her own child) and a climactic nod to \"North by Northwest\", you might just enjoy the playful fun that at least takes your kids' away from smartphones and videogames. Sure, the computer effects are corny, and the CGI has aged worse than Culkin himself, but it's almost redeemed by one of the funniest exchanges ever, involving an answer to the question \"Where's the money?\".\n\nI guess that's what the producers kept asking in 1994 where audiences were busy watching \"The Lion King\", \"Forrest Gump\" or even \"The Flintstones\"... maybe Richie Rich was a poor subject to begin with, or maybe they overestimated the bankability of Culkin... quite an irony, isn't it?"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "The setup: The richest kid in the world, Richie Rich, has everything he wants, except companionship. While representing his father at a factory opening, he sees some kids playing baseball across the street. Richie wants to join in, but they don't want him around. When a plot to kill the Rich family is devised by Rich Industries' top executive, Laurence Van Dough, Richie must take over control of the company while searching for his lost parents with the help of some new friends.\n\nThe verdict: This is another level of family film. The depiction of upper class Americana is austere and straightforward, but the real centerpiece of the film is its acting and humor."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "drakeking1",
        "review_rating": "5",
        "review_title": "Fun for the Young and Young-at-Heart",
        "review_detailed_main": "\"Richie Rich\" is a delightful romp that delivers exactly what it promises: a fun, light-hearted adventure perfect for kids, with just enough adult-themed innuendoes to keep parents entertained. Starring Macaulay Culkin as the titular character, the film follows the world's richest kid as he navigates the ups and downs of his opulent life. While it's not the kind of movie you'd expect to sweep the awards circuit, \"Richie Rich\" excels in providing a charming and entertaining experience for its target audience. The film's whimsical gadgets and over-the-top scenarios are sure to captivate young viewers, while the clever nods to adult humor ensure that parents won't be left out of the fun. The performances, particularly by Culkin, are endearing and bring a sense of warmth to the otherwise extravagant setting. The supporting cast, including Edward Herrmann and Christine Ebersole as Richie's loving parents, add depth to the story, making it more than just a series of comedic set pieces. \"Richie Rich\" may not be a cinematic masterpiece, but it's a delightful family film that offers plenty of laughs and heartwarming moments. It's a perfect pick for a family movie night, where both kids and adults can find something to enjoy."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "dlmiley",
        "review_rating": "7",
        "review_title": "Entertaining family film",
        "review_detailed_main": "Stumbled upon this one on cable. It is a fun little movie that doesn't take itself too seriously. All of the cast are very good including Macaulay Culkin, Edward Hermann, Jonathan Hyde and especially John Larroquette as the villain. And Jonathan Hyde comes in second as Culkin's loyal and protective butler.\n\nDon't listen to the stuffy critics on this movie. The late, great Roger Ebert got it right by rating it 3 out of 4 stars. It is simply light entertainment for the entire family and should be taken that way. Not every movie needs to be in black and white, in French, nonsensical or boring to be great (sometimes that seems what critics want these days). Watch it with your kids or grandkids or even alone and you will end up with a smile on your face."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "stevenrossiter171",
        "review_rating": "5",
        "review_title": "Predictable but passable",
        "review_detailed_main": "A very standard average film, predictable in its story and passable in every other way, some humour and some dark tones. It felt a little like they didn't really know where to pitch it in the denouement\n\nIt's average. Just average."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "andrewmontano297",
        "review_rating": "7",
        "review_title": "The end of Macaulay culkin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "RECB3",
        "review_rating": "5",
        "review_title": "An Alright Film That Could Have Been Better",
        "review_detailed_main": "This is an alright enough film for all viewers to watch. This film could have been a whole lot better and stronger if the crew had added some extra effort and strength. There were some parts throughout this entire film that did not make any real sense at all. The storyline was simple and straightforward and did not have any real direction at all. The cast selection could have been a whole lot better and stronger. They did not exactly fully commit nor connect to the storyline nor to their respective characters. The chemistry that was displayed throughout this entire film could have been a whole lot better and stronger."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Catherine_Grace_Zeh",
        "review_rating": "9",
        "review_title": "One of the best Macaulay Culkin films I have ever seen!,",
        "review_detailed_main": "This is one of the best Macaulay Culkin films I have ever seen. Kudos to him and everyone involved! When this was first released, I had no idea that John Larroquette was in this. If you ask me, his performance as the devious, nefarious adviser Lawrence Van Dough was delightfully entertaining. In my opinion, that was what made this film a fun little romp worth seeing. Also, I really liked the inventions of the zany Professor Keenbean (Michael McShane). Even though I thought that everyone gave a good performance and Van Dough (John Larroquette) was a bad guy, I enjoyed this film very much. Despite the fact that I liked everyone, I hate to admit it, but he was my favorite character. Anyway, I wish everyone lots of luck in the future and look forward to their upcoming projects."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "eric262003",
        "review_rating": "7",
        "review_title": "Was More Fun Than I Thought",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Fair Family Fare. Not What I Would Call Rich Though.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Dasher111",
        "review_rating": "7",
        "review_title": "Solid family film that follows the comics",
        "review_detailed_main": "I was a Richie Rich fan as a kid, having read the comics and watched the animated series, so when this film came out I was obviously curious to see it. I think it is an entertaining family film that did a respectable job in adapting the source material on which it's based.\n\nCulkin was OK as Richie, cast more for his star power and blonde hair than anything else. He would have worked better in the role if he was a few years younger. Jonathan Hyde was superb as Cadbury and anchors the film. While I missed Irona and wished Reggie had a larger role (since he was a frequent enemy of Richie's in the comics and cartoon), they did give nods to such characters as Bascomb the chauffeur.\n\nThe plot drew its inspiration from many of the stories in the comics and cartoon: Richie on an adventure that typically involved saving his family and/or his family's wealth, using his wits and Professor Keenbean's gadgets.\n\nI haven't seen the direct-to-video sequel or the Netflix series, but I've showed this film to both of my children and they enjoyed it."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "MJB784",
        "review_rating": "6",
        "review_title": "In the middle of the movie, it kind of gets out of hand.",
        "review_detailed_main": "Based on the comic book character in Archie, a family with the last name Rich have a son and years later, the now grown up boy, Richie Rich had everything a boy could want except he didn't have what he wanted the most, which was friends. After meeting some friends, they have an adventure to save Richie's family. His parents have been kidnapped and together, they try to save his house, mostly from bad guys who are after the Rich Family Vault. Meanwhile, since he knows all the stuff and tools in the house, his friends and Richie try to go against the main villain that's behind all this before he ends up with the money that is altogether seventy billion dollars."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "CoolG91",
        "review_rating": "7",
        "review_title": "Great movie for kids",
        "review_detailed_main": "It's a very entertaining kids movie. I don't get all the negative reviews. It even has a nice message. It's supposed to be a comedy too, a kids comedy, meaning mildly funny, not laugh your ass out funny."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "porkkanakurkku",
        "review_rating": "10",
        "review_title": "Great fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "ecenuracikel",
        "review_rating": "9",
        "review_title": "Nice and Funny",
        "review_detailed_main": "I thought it was a very nice movie with a very nice theme. What is good is that there is no blood or anything in it so even smaller children can watch it. It was also very funny. I will never forget this movie."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "byson5186",
        "review_rating": "9",
        "review_title": "Timeless Kids Movie",
        "review_detailed_main": "I saw this movie yesterday On Demand. While watching it, I found it hard to believe as I'm sure most of you also find it hard to believe, that this movie is 20 years old. I have to say, it doesn't look that old even in today's perspective and has a good plot for kids about wanting friends. Whenever I watch this movie, it takes me back to when I watched this movie as a kid. I always find this movie, an entertaining movie to watch, if you're look for an entertaining appropriate kids movie. This one will keep you going as it's pretty fast paced. You'll be amazed at all Richie Rich has. One thing he has is from a memorable scene, the kid-a-pult. I wonder how they filmed that scene, and I wonder if such a thing exists, I mean what did they use in the movie? I can remember as a kid talking to my Dad about getting that thing. I guess I've written about everything I have to. I usually write longer reviews. Thanks for reading."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "starlet86",
        "review_rating": "10",
        "review_title": "a laughout",
        "review_detailed_main": "How could anyone not find this funny. Enjoyable characters like Cadbury, the guy who works in the lab, there is a great cast to play them(you also have to see Edward Herrman in Gilmore Girls). John Larroquete is also great as Van Dogh(did you also see him in 10th Kingdom?). The movie has a stupid plot but you'll be laughing too much to care."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "lordzedd-3",
        "review_rating": "8",
        "review_title": "Interesting adaptation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "pob-1947",
        "review_rating": "8",
        "review_title": "Entertaining family fare",
        "review_detailed_main": "This is entertaining and fun for the family to watch. I have watched it 3 times and enjoyed it each and every time. I base my ranking on entertainment value. If you would like to sit down, relax and enjoy some good clean fun, give Richie Rich a shot; you will not regret it."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "husnain_05",
        "review_rating": "10",
        "review_title": "A wicked movie.",
        "review_detailed_main": "I really enjoy watching Richie Rich and think most of Macauly Culkin's films like Home Alone,Home Alone 2, Richie Rich,Getting even with Dad,The Nutcracker,The Pagemaster,The good son,Black or white,Jacob's ladder and wish kid.Richie Rich is about a boy who is the richest kid in the world(Macauly Culkin)and a man who is jealous of Richie Rich and wants his house(John Larroquette)and sends Richies parents for work and Richie Rich has to safe himself and his house with the help of his butler(Jonathan Hyde),Professor Keenbean(Micheal Mcshane)and his friends. I have seen Richie Rich a lot of times and I never get bored of it."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "mosquitobite",
        "review_rating": "8",
        "review_title": "Why a flop ?my grandson who is 8 loves it",
        "review_detailed_main": "McCauley is good in this he doesn't OVER ACT i was grateful for that... maybe people miss that, we re so used to it. It's a good fun fam movie."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "anelisgheorghias-22147",
        "review_rating": "10",
        "review_title": "One of the best children movie",
        "review_detailed_main": "I think is one of the best children movies. I don't understand why people hate it so much. Is something that I haven't seen in so long: amazing parents, smart and respectful child and everyone lives!\n\nHerbert was my favorite character, he really care about Richie and love the family he works for.\n\nI understand sometimes there wasn't any logic and people couldn't actually do that in real life, but do kids movies have any logic in general? No, and I think that's what makes them more magical.\n\nI missed this kind of movies were they wanted to make something kids will enjoy, with nothing sinister or any deaths, they are teaching young people the true values and I think only that makes this one of my favorites.\n\nA perfect movie for children. It brings back so many good memories."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "bigpapapumpct",
        "review_rating": "10",
        "review_title": "This movie is great fun and endlessly entertaining!",
        "review_detailed_main": "The last time I'd seen this movie was sometime in the 90s. I remember back then I loved it and watched it all the time. It was just so good. Well, fast forward to today and it's been over 20 years since I've seen it so I decided it was time to check it out again, unsure of what to expect and how I would feel (but I wanted to see it for old times sake). Man, I loved it just as much as all those years ago. It's such a fun movie. Don't get me wrong, it's definitely goofy at times and there's more than a few eyerolling moments, but overall, it was just such a joy to revisit. Even sitting here now, I feel like watching it again, and it's only been a few days since I last watched it. I found it to be that good. I highly recommend checking it out. If Shout Factory ever releases it on bluray I'll pick it up Day 1.\n\nThe score by Alan Silvestri is fantastic. It's so, so, so good.\n\nThe guy that plays the villain does such a good job.\n\nCadbury and Keenbean are great too.\n\n10/10!"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "moviereview2002",
        "review_rating": "",
        "review_title": "Fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "ThunderKing6",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "Another movie with a token, which is a great movie.\n\nRR is a classic family movie. So much adventure, comedy and pure fun.\n\nSad that the home alone kid never grew instead he devolved."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "impressivesgirl-37857",
        "review_rating": "9",
        "review_title": "One of my favourite childhood movies",
        "review_detailed_main": "I don't get the hate about this movie - to me is one of my favourite lovable childhood stories about friendship. There is nothing not to love about it - it is just a group of kids and a lonely rich kid who has to take some responsibility quickly in their lives. Very light hearted - it is not something that will change your life of course, but I don't expect that from ila family movie anyways."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "tenaciouse422",
        "review_rating": "",
        "review_title": "Good family movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "jonieaglefeather",
        "review_rating": "10",
        "review_title": "Spontaneous",
        "review_detailed_main": "Outrage of potential and knock off of money spent well!!! Ways of life to ways of living at an extent you may not proclaim. Recommend for children and young adults."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "Hawks_Girl",
        "review_rating": "",
        "review_title": "What the bloody hell???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "davidkennedy-91087",
        "review_rating": "8",
        "review_title": "Charming 90's Relic",
        "review_detailed_main": "An entertaining comic book adaptation starring Macaulay Culkin in one of his last major roles as the richest kid on earth who has everything he could ever want except friends. It's cheesy, but funny enough for its run time."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "tranmf",
        "review_rating": "8",
        "review_title": "Family friendly good lesson",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "jakewilkinson12",
        "review_rating": "8",
        "review_title": "Love this film",
        "review_detailed_main": "To me this is a classic. Watched it as a child and loved it and still love it now.\n\nEasy going and fun film"
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "meydiana-65242",
        "review_rating": "10",
        "review_title": "Great movie for teen and adults.",
        "review_detailed_main": "Enjoyable Movie For Teens & Adults This is definitely teen fare, but it's very entertaining which means adults would get a lot of laughs out of it. As with any comedy, some of the stuff is really stupid and some of it is really funny. Along the way, you get some of modern Hollywood's secular plugs and a few swear words that you wouldn't want your little ones to hear, but overall, I have little to criticize with this one.\n\nThere were a number of sight gags, things that made me laugh out loud, such as dollar signs instead of spots on the dog, the dress-ware of the little rich kid (Macauley Culkin), the eccentric characters - good and bad guys - are all fun to watch.\n\nI thought Jonathan Hyde, as the butler, stole the show."
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "...Why, oh why do I like this movie? I don't really know.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110989",
        "movie_name": "Richie Rich",
        "movie_rating": "5.4",
        "review_username": "vivianla",
        "review_rating": "",
        "review_title": "Lonely Responsible Rich Kid",
        "review_detailed_main": ""
    }
]