[
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "kieranbattams",
        "review_rating": "4",
        "review_title": "what is it with horror movies and lost potential?!",
        "review_detailed_main": "Like, seriously. Here we have a film with a plot that genuinely sounds decent but the filmmakers are incapable of pulling off. Sound familiar? Well that is because this has happened already this year with The Forest.. but The other side of the Door manages to be even worse. Horror films used to be inventive and fun in a twisted way, but is that now impossible to pull off?!\n\nThe plot involves a woman who's son is killed in a terrible and tragic accident, she discovers she can communicate again with him through an ancient Indian temple, but is warned to never open the door. Of course, if you warn somebody in a cliché horror movie not to do something they are totally gonna do it and she does which brings all the spirits into the world of the living. It could have been done so well.. but i put emphasis on the COULD. First of all the son is evil now. Literally a line of dialogue is \"he is evil\". Now, correct me if I'm wrong but this was never explained.. ever. Are we supposed to just look at him and say \"yeah that makes sense considering he's dead\". There was no hint to this when he was alive and no back story.\n\nUnexplained things like this happened a lot in this film and it really bugged me. Nothing was ever scary, not even the jump scares made me jump, which is a bad sign to begin with. Not to mention i drifted off many times for a few seconds over the course of the film.. which should never happen if i am enjoying something. By that i mean i did not enjoy any of this film. The premise is great but the way it was executed just felt so wrong. So in the end, this film is just another cliché horror garbage fest that i will end up forgetting about by the end of the week probably. I really hope i get the horror i crave by the end of the year, 10 Cloverfield Lane is why i remain hopeful."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "tmdarby",
        "review_rating": "6",
        "review_title": "Pet Cemetery Is Now Open For Kids",
        "review_detailed_main": "It was a pretty good movie, nothing spectacular, but worth a watch. The acting was decent, and the atmosphere was pretty creepy. The story it self was very predictable, especially if you've read Pet Cemetery. Sarah Wayne Callies was terrific in it. I just didn't find the story very original.\n\nI liked that it was set in India and incorporated some of the Indian religions and customs.\n\nDon't expect anything ground breaking, but it's a good movie to watch if you like jump scares. All in all, it wasn't a bad way to spend and hour and a half."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "myignisrules",
        "review_rating": "5",
        "review_title": "Another clichéd horror movie",
        "review_detailed_main": "I'll be honest. I think if I hadn't seen this in cinema,with the lights off, the loud sound system and the big screen, I would've given it a lower score. If you saw The Forest earlier this year, you know what to expect from The Other Side of The Door.\n\nThe Good: I know a lot of peeps don't like her, but I think Sarah Wayne Callies has a great presence and a naturalness to her performances that I enjoy. She made for a believable mother, who had to make the kind of choice no parent should ever have to. Jeremy Sisto is another actor I like (remember him as the guy who got the arrows in his back in Wrong Turn?) and the kid actress, while average, didn't annoy me and actually appears in one of the better/scarier scenes in this movie. I also liked that the location was India and the evil/dark presence was part of their folklore. It was a little something new, that I hadn't really seen in North American films.\n\nThe Bad :Cliches, clichés, clichés! When for the love of Rice will they stop using the tired old tropes of : -Ghost with hollow eyes and stretched mouth (CGI of course) Look over there! Oops no, it's right next to you! (accompanied with loud ass noise) -Parent is completely absent from story for no reason, only to show up at the end. Sisto is VASTLY underused in this movie, to the point where I wondered if there was bad editing and he had scenes that were cut out. -Not following your own rules! (Burn stuff and ghost goes away, but wait, nope!) - Told not to do something or else. Does it anyway! -Witness the supernatural. Interact with the supernatural. Denies it exists.\n\nI could go on and on, but nobody likes to read these days so I'll just stop and say, wait for it on DVD and watch it to pass the time. The Other Side of the Door, may scare the average horror viewer, but it's tepid waters, for the hardcore lovers of the genre."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "jordanhuntgeneral",
        "review_rating": "",
        "review_title": "Its themes will linger with you much longer than any other supernatural horror this year.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Don't bother opening",
        "review_detailed_main": "Your time should be too precious to go through it (the door/the movie). Technically speaking the movie is ok, there is nothing to fault here. But if the inciting incident is so bad, it should make you feel physical pain, there is almost no saving grace. Especially because the story is cliche after cliche after cliche.\n\nNow I'm not about to bad mouth the actors (I quite like Jeremy Sisto in general anyway to do that), I'll just state that they didn't or rather couldn't help the matter either. And again, I wouldn't lay blame on them (other than chosing the project in the first place - but hey they needed the money and all that) - don't watch it if you're not a sucker for horror movies in general. And even if you are, there are so many really good ones out there ... or even decent ones that are better than this movie"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "quincytheodore",
        "review_rating": "7",
        "review_title": "The tale of horror beyond the border of cultures, told by an excellent cast.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "faridat-91789",
        "review_rating": "5",
        "review_title": "Meh",
        "review_detailed_main": "Since a good horror film like \"the others\" or \"shining\" apparently comes every decade or two, I've stopped having high expectations. I'm not sure what, but may be horror films can either be masterpieces or a failure. Or it's just that not much budget is put into them. Acting, premise and plot was decent. So I feel a little unfair when I'm gonna bring down so much good work just because of poor writing.\n\nThe beginning was appropriately paced fast enough, but it is then that you also realise the narration fails to develop the characters.\n\nPassed mid time, story begs for the resident of the house to question the sudden change in his house, and he doesn't. At that point I start skipping before I get bored.\n\nI watched this because another comment said it was worth a watch. Well, I'm recommending it is if you have some side activity, or if you easily get excited ."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "writeractor-979-344542",
        "review_rating": "7",
        "review_title": "Alright Horror Film, Not the Horror Movie of the Year, but not terrible",
        "review_detailed_main": "I saw this movie at 10:20AM on Saturday, in a completely big empty theater with my party of three (including myself). Now, when I saw the preview for the film, I was very intrigued. I wanted to know what happened, so I was shocked when one of my main movie theaters was playing it but then yet again, it's an indie theater. Now the whole set design of this film, was great. I thought it was something new to set it in India and it's a original idea. They actually payed respect to the culture. Now some of the jumpscares were annoying, but only some. They had great effects though for the 'gatekeeper', no CGI actual makeup. The performances were solid, the little girl wasn't atrocious, but she fitted her character well, nothing great, it's like she-just- acts-for-that-scene. Sarah Wayne Callies was much better than she needed to be, Jeremy Sisto was sort of just there, but he did well. The director tried to take this new approach to the film, which worked most of the time. It has old-classic scares like piano playing by itself, chairs moving, books falling, etc. Not really any new scares. This isn't the must see horror film of the year, but it's a solid watch with a very clever ending."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "timdazjef",
        "review_rating": "1",
        "review_title": "Shudderingly predictable horror nonsense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "hitchcockthelegend",
        "review_rating": "6",
        "review_title": "This is one Oliver who doesn't need an army.",
        "review_detailed_main": "Directed by Johannes Roberts and Roberts co-writes the screenplay with Ernest Riera. It stars Sarah Wayne Callies, Jeremy Sisto, Sofia Rosinsky and Suchitra Pillai.\n\nStill struggling to come to terms with the death of her young son, Maria (Callies) is told of an Indian ritual where she can say goodbye to her son one last time, under one condition. The condition is that the conversation will be on the other side of a door - a door which simply must not be opened...\n\nThere were far worse horror films than this released in 2016, that's not to say this should be a selling point for The Other Side of the Door, but it at least is effective in what it does. The problems really are that it's all very cliché ridden, but how many horror films do not have clichés anyway? This is one for those who are just after a few genuine scares, some creeping dread like atmosphere, and a nifty ending. It doesn't tread any new ground, and it comes off like the bastard child of Ringu and Pet Sematary, but sometimes a safe horror with clichés is all you need for a decent night in with the lights off. 6.5/10"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Tedious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "jonathanerk30",
        "review_rating": "8",
        "review_title": "Some great visual horror",
        "review_detailed_main": "It appears from the reviews that true horror fans appreciate this whereas people who are just looking at it from a story perspective grade it much lower. As a horror fan , and never heard of the film I was pleasantly surprised of how creepy and scary it was with some genuine disturbing moments that are lacking from many modern day horrors. I do not know why the score is so low so hopefully this will bolster it !"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Abbark",
        "review_rating": "7",
        "review_title": "Give it a chance before reading reviews",
        "review_detailed_main": "I love horror. These movies are a bit overdone,however I loved the casting. Sarah Wayne Callie's is one of my favorite actresses and Jeremy Sisto can always pull it off. This movie is predictable, however, I watched until the very end. I paused when doing something else! It definitely has some super creepy scenes. They did a great job at making this movie as realistic as possible when dealing with the genre. I ignored the reviews and ratings and rented this on demand. Looking back I would have waiting until Netflix or a non pay. Instead I wanted a good creep and I got it! This movie gets a B- from me and watch before you decide if it's a good or bad movie."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "paul-allaer",
        "review_rating": "5",
        "review_title": "Disappointing horror movie: \"You must not open the door!!\"",
        "review_detailed_main": "\"The Other Side of the Door\" (2016 release; 95 min.) brings the story of Maria and Michael. As the movie opens, we are informed that this is \"Mumbai, India\" and we see the couple having dinner and walking on the beach, On a whim, they decide to make Mumbai their home. We then go \"Six Years Later\", and Maria is having a nightmare, Soon we learn that the couple lost a young son (we learn how in a flashback) and the couple and their daughter are struggling in the aftermath. After Maria tries to commit suicide, the household maid Piki tells her about a mysterious temple in the woods far away, where Maria could meet her little boy one more time and say a final farewell. At this point we're not even 15 minutes into the movie, but to tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.\n\nCouple of comments: this is the latest horror movie from British director Johannes Roberts, who most recently gave us \"Storage 24\". Here Roberts goes the super-natural dimension, looking for the thin line between life and death. I must admit that I didn't know a whole lot about this movie going into it, and as it turns out, this was quite the disappointment for me. If shock effects akin to a bat flying out of a cave or toys in a bedroom starting to move are enough to make it a scary movie, then this will be right up your alley. Not to mention that there are several plot points that are utterly unbelievable, even accounting for the fact that this is a horror movie, where all belief is suspended. This is in stark contrast to how much better that other 'horror' movie which I saw recently, \"The Witch\", was compared to this. Sarah Wayne Collins (as Maria), best know for her work in \"The Walking Dead\", does the best she can with the material she is given and as always is easy on the eyes. But even she cannot overcome the fact that the movie lacks much character development, and as a result there is little to no emotional investment on the viewer's part. Early on in the movie, Piki tells her that when she is in the temple, whatever her little boy does, \"you must not open the door!!!\". Wanna take a guess what happens? One of the better aspects of the movie is actually the score, courtesy of Joseph Bishara, a noted composer in the horror movie genre (the \"Insidious\" franchise, the \"Conjuring\" franchise, etc.).\n\n\"The Other Side of the Door\" opened nationwide this weekend. The Friday evening screening where I saw this at here in Cincinnati was attended okay but not great. Couldn't help but notice that I saw 4 or 5 people leave midway through the film, and not returning. I made it to the end, but barely. A darn shame. I love a good horror movie, and surely this wasn't it, but by all means, if you have a chance to check out \"The Other Side of the Door\", be it in the theater, on VOD or eventually on DVD/Blu-ray, I'd encourage you to do so and draw your own conclusion."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "jimmehford",
        "review_rating": "1",
        "review_title": "wow",
        "review_detailed_main": "i didn't have any expectations for this movie but wow this was complete and utter garbage\n\nthere is absolutely nothing good about this movie\n\nthe scares are predictable and cheap the mother character is the worst the daughter has the worst actor the setting did nothing to establish the folklore or story the ending was stupid the decisions were stupid the characters are stupid\n\ni just don't know what to say other than just say that everything about this movie is bad\n\ni mean the mom was told to not open the door under any circumstances and what does she do? she just opens the cockadoodie door\n\ni genuinely hate this movie this is one of the worst movies I've ever seen"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "shobanchittuprolu",
        "review_rating": "7",
        "review_title": "The Other Side of the Door is decent horror which not only has great plot but also has decent execution which does not disappoint.",
        "review_detailed_main": "The Other Side of the Door (2016) : I expected a lot from 2016 horror movies because all of those trailers looked spooky and promising but when it comes for movie it is disappointing.Except The Conjuring 2,the others like The Boy,Forest etc..disappointed me.But I will agree that though they fail to impress,they have interesting plots.The Other Side of the Door also has interesting plot and even its trailer looked promising.How is it??\n\nPlot: Michael (Jeremy Sisto) and Maria (Sarah Wayne Callies) are Americans who settled in Mumbai.Their happy life gets upside down when their son Oliver dies in a tragic incident.Maria learns of a secret temple in a village where she can contact with her dead son through a door which connects to the other world.But she was warned that she should not open that door at any cost.But she disobeys it and opens the door which upsets the balance between life and death.What happens to Maria and her family???\n\nPlus Points: 1)Plot: Plot of The Other Side of the Door is interesting one.An American horror set in India and based on Indian rituals is truly a step for good plot.\n\n2)Performances: Performances are decent and Sarah Wayne definitely shines among them. She gave good performance as grief stricken mother who wants to bring her dead son back.\n\n3)Make Up: Make up work is awesome.The use of Aghoras and Indian religious characters like Mruthyu is good attempt.Even ghosts are done naturally by makeup without using any CGI which is needed to be appreciated.\n\n4)Climax: Movie's climax is good and twisty.\n\nMinus Points: 1)Limited Scary scenes: Out of all those scary scenes only the scene at temple succeeds.Other are clichéd and not that scary.\n\nSo The Other Side of the Door is decent horror which not only has great plot but also has decent execution which does not disappoint.\n\nMy rating 6.75/10"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "abhiunchained",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "This is my 1st time reviewing anything on IMDb. But I've decided to write so that no one else will waste their time behind this movie. I mean seriously this is one of the most non-sense horror movie I've ever seen. It is so typical and not worth it.\n\nCouple lives in India. Mommy driving SUV, it falls in river. Mommy only saves daughter. Mommy couldn't save son. Mommy feels bad about it. Mommy's Indian maid tells her that there is hidden temple in rural India where Mommy has to stay overnight behind closed door. Mommy can talk to son but Mommy must not open the door. In a typical manner, desperate Mommy yet opens the door. As it turns out, the son's evil spirit comes from \"dead\" to haunt sister and daddy. And, the stupid story goes on. This movie is so pathetic it made me puke. Please don't see it. I'm going to make sure not to watch movie made by this director ever again."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "nitzanhavoc",
        "review_rating": "7",
        "review_title": "Mainstream Horror done right! Not great, but definitely good, smart and fun!",
        "review_detailed_main": "It's been a few months since my last Horror film, and I must start off by saying I'm very glad I've chosen The Other Side of the Door to ease myself back into it! Despite what other raters and reviewers might say (as usual, NEVER trust IMDb ratings when it comes to Horror), the film is good, enjoyable and scary enough without being nightmare inducing (at least for experienced Horror fans).\n\nTrue, the story is a bit cliché, after all this is a Fox production, not an indie creative project. A family suffers a tragedy, and while trying to cope begins to experience a supernatural haunting. However, the story succeeds in being original and innovative enough in regards to the plot-line, especially during the transfer from past to present just after the exposition, and the frame concept of a door through which one could converse with a deceased loved one.\n\nThe acting is right on the spot, and is definitely one of the stronger features! Sarah Wayne Callies is excellent as Maria, the distraught mother trying to cope with the loss of her son, and later with the supernatural phenomenon tormenting her family. Her counterpart, Jeremy Sisto as Maria's husband Michael, is absolutely excellent! His portraying of the strong husband, trying to be an island of strength and normalcy in his wife's depression while quietly trying to cope with his loss himself, is impressive and simply profound. Only slightly less impressive is Suchitra Pillai as Piki, the nanny (and I do mean slightly, as she is excellent as well). As for Sofia Rosinsky as the daughter Lucy, I can see the obvious talent, but am not too happy with the instructions she obviously followed with her character. Often times characters are over dramatic, but Lucy felt under-dramatic, even if it meant portraying a more accurate seven year old's coping with the loss of her brother and the deterioration of her mother.\n\nAs for jump-scares, yes, there are a few, but anyone who's watched 5 Horror films in their lifetime could tell you that these were subtle, well planned and definitely not exaggerated. A few \"boo!\" moments don't spoil a Horror film for anyone who isn't looking for reasons to not enjoy (in my opinion of course). The soundtrack and cinematography were also right on the spot, adding a fine dimension of eeriness and uneasiness.\n\nNow, if jump-scares always lower a Horror film's level (even if just slightly) when I'm concerned, smart plot twists and endings definitely make it higher! The film ends with a very nice twist towards the ending, and with a very smart conclusion leaving many questions and \"what-ifs\". A direct sequel is probably ill advised, as these tend to butcher the franchise and have so far only been done right in Insidious: Part 2 (and even that film wasn't as good as the first). Still, I love finishing watching a Horror film with this feeling of \"oh no... oh no!!\".\n\nAll in all, as I've started by saying, a good film, fun to watch, scary and eerie in the right places, a great experience for both experience and new Horror fans. It's not a masterpiece, and might even be just \"good\" and not \"great\" (especially, in my opinion, because of too little screen time given to the first twist, not letting it settle before jumping to the 2nd one, although this may have been deliberate...) But it definitely deserves more than the terrible average rating it currently has. I don't understand you, IMDb, I truly don't. I would definitely recommend this film, had a great time watching it!"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Seth_Rogue_One",
        "review_rating": "3",
        "review_title": "The Other Side of the Bore",
        "review_detailed_main": "Being bored can have it's advantages, it might frustrate you of course but it can also inspire you to do things that aren't boring instead.\n\nPersonally I enjoy watching a good movie (something this is not), listening to some good music, going for walks or bike-rides, seeing new things and old things that are worth seeing more than once, playing chess etc etc.\n\nI'm just rambling on here as you can see but that's because as far as this movie goes there is very little to be said.\n\nIf you like horrors to be familiar, meaning have all the clichés that's humanly possible packed into one movie or if you've never seen a horror ever in your life then I suppose this is watchable.\n\nThe acting is uninspired and the scares are poorly executed and the pace is painfully slow.\n\nAnd the last scene is one of the dumbest I've seen in recent years, almost enough to lower the rating to a 2 but I'll be nice, they at least kind of sort of tried albeit not much."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "omendata",
        "review_rating": "7",
        "review_title": "Brimful Of Atmosphere",
        "review_detailed_main": "Watched this fully for the firs time tonight and I must say it is actually a real horror film as it genuinely has lots of atmos-fear and is actually quite scary!\n\nBeing set in India adds that fear of the foreign and it has some really good sfx makeup.\n\nSome people reviewing and giving it poor low scores are obviously not horror fans so each to their own - if you are a true horror fan this one will send shivers up and down your spine as it has some really rather creative effects and jump scares - Loved the ending too, true horror fans hate happy endings so for us, it is the cherry on the cake!\n\nIf you are looking for a scare then this is the one for you!"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "subxerogravity",
        "review_rating": "5",
        "review_title": "It was a good effort, but it really falls short.",
        "review_detailed_main": "I thought it was really stupid. I could not really get into it at all. It was like watching paint dry on the wall I was so bored.\n\nAll the clichés that are used in most Ghost stories to haunt us and to frighten us seem to fall short in The Other Side of the Door. I was not freaked out at all. The drama seems to get bumbled into laughable qualities.\n\nIt was cool that they went to (or the movie was set in) India, and they used what looks like an Indian ghost concept, and I will say that the last scene of the movie was very good. Not good enough to waste your time on.\n\nIf you seen the movie the Forest which came out a few weeks earlier, The Other side of the Door is set up in the same way with a good ghost story that's not as scary as you suspect, or frightening in a different way then what we are use to, but by comparison the Forest was a lot more interesting to sit through, while The Other Side of the Door is not worth it."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "km-daykin",
        "review_rating": "8",
        "review_title": "I've seen a lot worse",
        "review_detailed_main": "I've read a lot of bad reviews slating this movie, I get why. Don't go into this movie expecting a great horror movie, it's not really a horror. It is however a really good tragedy which is portrayed using a medium of creepy devices. If you leave this movie and all you have is 'lame jump scares', you're missing the point of the story. If you're considering watching this, do it, it's worth the 1 hour 35. Each of the actors does a pretty stand up job, the direction and photography went well, my only gripe would be the editing. The flow of the story looked like it wanted to be a horror movie, when it should have looked like a 'Del Toro'."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "juzer03",
        "review_rating": "6",
        "review_title": "Rating this 6 because it was actually scary!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "feel fake",
        "review_detailed_main": "Antique traders Maria (Sarah Wayne Callies) and Michael Harwood (Jeremy Sisto) are struggling after the death of their son Ollie. They live in India with their daughter Lucy. Maria is still haunted by the guilt from Ollie's death and tries to commit suicide. Her housekeeper Piki suggests a way to connect with her son for one last time at an abandoned temple where the line between life and death is blurred. She warns her not to open the door.\n\nThis is a missed opportunity of mixing western horror with Hindu mysticism. Despite the exotic location shoots, the Indian aspect feels hollow. Like the lead characters themselves, they are looking at it through western eyes. It feels fake. The house and the temple are obvious studio stages but there are touches that make it feel ever like the indoor sets that they are. Quite frankly, Maria could at least dress in local garb. It's detrimental to the establishing of mood. There is a functional ghost story here and it really gets compelling with the child on child possession. Sadly, that happens way too late to save this movie. It's the only part that has the potential of real scares. It's mostly wasted."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "iamtherobotman",
        "review_rating": "1",
        "review_title": "Not bad up until a point",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "InfinateANGELzPORTALz",
        "review_rating": "7",
        "review_title": "I've seen better&worse,I Do think its worth seeing since opinions differ!,:)....",
        "review_detailed_main": "I was entertained from the start,&on into the ending honestly;).Granted being w/this growing popularly seen mix of genres(ie-Drama,Thriller,&Horror),I was drawn to it in honesty due to enjoying my horror&sci-fi type of flicks.I have seen as mentioned before,better,&worse-if not terribly done flicks,LOL!But this wasn't bad,although I will say that once you've watched it,you may agree in my saying that I wished the film was more in depth w/some points,along w/that I thought it would Also add length that I wished it had,&did have the potential to,to also make it better all around,¬ quite rushed together,IMHO-In My Humble Opinion!\n\nIts of course started w/a couple who decides to stay abroad,&raise their newly beginning family,along w/his business gives him that freedom to.Hence where the story line of the movie,develops from w/this decision.As the movie progresses you see the locals abroad,&the family carry on,until disaster strikes them.Rendering the mother as expected,withdrawn more&more,even from her family who is there still.\n\nSo.Without giving away spoilers.As we all in fact have come to learn from studies,different yet find factual,& taught even in currently to keep in the know,& that even just about every country,along w/different locations throughout.\n\nThe mother learns of a legend,not far from where they live.Despite the situations,she doesn't want to pass the opportunity up,no matter what,Plus even knowing that if done wrong,the consequences are evil&dangerous.That said,Even in our own smaller townships,locals tend to know of,&even pass down the local stories,superstitions,or legends and so forth.Some vary from Evil &/or Bad,to Good or Fantasy-likenesses.But most are either hard to accomplish,have rules to follow&stick to,otherwise dire believes of consequences &/or even punishments will happen.\n\nIn the film there is so many parts they could have done more when it comes to history that's brought them to the present w/their local \"Legend\" that's still cautiously used,etc.In the movie,it leads you to where the mother pursues this legend.But,it goes awry as well.I admit that some things at this point of the flick Id expected,but it does continue on.Admittedly in the end it leads off to where you can maybe see the potential for a sequel maybe leaving off or looking also,into the legend...It wasn't a bad movie to me as I said,and think that its worth watching to see if you enjoyed its overall story line too!!!"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "brunovanael",
        "review_rating": "3",
        "review_title": "Jump scare grudge cemetery",
        "review_detailed_main": "A messy collection of many, many jump scares in a mediocre story (reminding me a little too much of pet cemetery), packed with horror clichés on an awful music score. The evil character was pretty scary but obviously inspired by the grudge."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Pairic",
        "review_rating": "7",
        "review_title": "Dark Ghosts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "TheRedDeath30",
        "review_rating": "5",
        "review_title": "Far from Original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "freshclean-66-318608",
        "review_rating": "6",
        "review_title": "This Really Could Have Been Better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "InDyingArms",
        "review_rating": "5",
        "review_title": "A solid 50/50. This is an extremely simple horror film that managed to succeed.",
        "review_detailed_main": "Maria and Micheal are currently mourning the loss of their son. With this being said, Maria is deeply impacted, leading her to do anything she possibly can to ever get anything from her son again. Their house maid, a local of the foreign country they live in tells her of an ancient temple of which contains a door with a thin line to the world of living, and dead. Only one rule. Don't open the door. Maria travels to the said temple, and, you guessed it. She opened the door. Thus all hell is unleashed, and now she must stop it.\n\nLet's start with the con's of this film. This film, first of all, had a very solid, tense, creepy atmosphere going for it. The cinematography really captured some unnerving shots that'll have you on the edge of your seat, expecting something to happen, when really nothing does. There are truly some scenes in this film; you have dark scenes, creepy, unsettling scenes that aren't even meant to be frightening, not to mention how the soundtrack really fits along with it. Again, I felt as if the cinematography really captured some simplistic scenes, how the camera slowly panned toward the creepy factor, overall succeeding for keeping the audience at high tension! As said before, the soundtrack really fits well with the film. There are scenes in this film to where it's literally as silent to where you could hear a pen drop, making it extremely unnerving, and unsettling, sending the audience to a white-knuckle ride. There's also some sound track to where nothing's happening to where it just set tones for the film, making it enjoyable instead of just bland, and uneventful in terms of scene sound. The acting in this film; moving on. It was really well, in my opinion. The actors really did well portraying a broken, sad, and lost couple of which are slowly recovering a tragic event. Something an actor can easily miss the mark on, and fail upon. The child actors, too, were quite good. Most movies they can get annoying, or boring, but the movie kept it at a smooth, solid execution, saving it. Overall the film had amazing atmosphere, great actors, cinematography, and succeeded in a creepiness! Again, something these horror movies easily miss. Now to the misses of this film, there's quite big ones. As said in the title.. this is an extremely simple film, and it is. It's just basic, there's no other words really to describe it as. Reason being is because the entire plot is just your normal, modern, theatrical horror film gimmick that's been used many, many times before, just portrayed in a different matter. You have your happy family with a dark past, the dark past comes back, a paranormal entity comes and causes mayhem, someone dies, and that's it! Now I'm sure everyone has seen a film like such a bit of times before. The film, when though closely is just a massive cliché that was saved by simplistic execution. The storyline is just something we've seen before, just in a more better format. The film also takes the cliché of the whole \"Foreign legend\" gimmick, to where there's a local legend of which the family / a character manages to anger. Again. It's been done, especially a bunch of times in your theatrical horror film releases. Next. The biggest blow for me. The pacing. Although this film was saved, again, by it's simplistic executions.. the pacing seemed atrocious, all over the place. One moment something happens for a brief moment.. Just when you think it'll rise.. it sets, and gets slow. Then the process continues as such a bunch of times through the film. It's pacing, though, overall ended up being just slow, and although it built small build up, it still came up flat, and again, slow. Finally. Another cliché this film took. Ever watched one of those films to where they become a bit desperate, and decide to just throw random \"scary\" crap at you? Yup. This film became a bit desperate it seems, as it just started throwing random things at the viewer's face, such as visions that aren't real and such.. because why not? Said visions did nothing for the film, or story, other than just giving a scare or two. Some scares even failed, falling flat and not even scaring the viewers, in fact, they could even come off as funny as the film tried, but failed at times.\n\nIn conclusion, this wasn't bad at all! It's a basic, typical horror movie that had great execution, which is honestly a pleasant surprise. Unfortunately this films rating, and enjoyable factor lowered, as it suffered major blows from typical problems, leading this film to just be clichéd, once, as said before, thought about closely. It had, however a creepy, solid, and effective atmosphere all around. The film also had great actors to back that up, making believable acts that come off more serious than silly. The costume design, as well. Such at the creature shown, and the paranormal entities served, and succeeded in the creepy factor, only boosting it more. But. As said a bunch before. It's just clichéd. The entire plot, storyline .. just clichéd. And to drag it lower the pacing was terrible wonky, setting the following of this film downward. But really. This wasn't a bad watch. I'd recommend this to provoke horror fans, but if you're not looking for clichés steer clear. This, without a doubt in my eyes is a solid 50/50 horror film."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Sleepin_Dragon",
        "review_rating": "8",
        "review_title": "Not your typical horror, suspense and tension.",
        "review_detailed_main": "Horror fans after shock scares, gore and sheer terror will find this a disappointment, it's a horror, but subtle in its delivery, it boasts a sinister plot, plays on fears, and delivers its scares with purpose.\n\nInstead of the typical British or American creaky house, we're transported to India, and its colours and sunshine, it certainly makes you see a horror film differently.\n\nIt's well acted, well produced, I don't know why, but I kept thinking of the Woman in Black, that kind of delivery. For the first forty minutes very little happens, we get back story, plot, but little action, it's more creepy then scary.\n\nNot for everyone, but I enjoyed it."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "kjjames81",
        "review_rating": "6",
        "review_title": "a great jump scare movie.",
        "review_detailed_main": "I went into this because of the one preview on the IMDb website. It sounded good so i managed to get my hands on a copy.\n\nGoing into this without any preconceptions was the best option for me, so the film starts off and for almost half of the movie there was no horror in the movie at all, thinking to myself that this movie was a mistake,but i stuck with it and i am glad i did.The acting was very good by all.\n\nThe second half of the movie came into play and boy was it better than the first half, not that the first half was bad. The horror took off, quite a lot of jump scare scenes, done well by the way. The story went better and better.\n\nOne note about the movie was that THE ENDING WAS BRILLIANT.\n\nSo go into this movie without any thought about how it's going to play out, watch it with an open mind and you will not be disappointed. Well worth a watch, i am glad i did."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "mshavzin",
        "review_rating": "2",
        "review_title": "Ever seen that Geico Commercial?",
        "review_detailed_main": "Well, here it is in movie form. Let me start out by saying there was absolutely NO REASON for this to be set in India. It is a simple retelling of Pet Cemetery, with FAUX Indian trappings. Yes, there are Aghori Sadhus, who do have dreadlocks, and eat dead people or some such. That is where the similarity ends. The Aghori have no temples with any doors that supposedly allow you to talk to the dead. They have some sort of postmortem rituals, that may even include necrophilia, but no doors, and no attempts at talking to the departed. NONE. The filming was not one in India. This is not based on any actual In Indian folklore. The majority of Indians are mainstream Hindu, who believe in reincarnation, so this is actually kind of the opposite of their beliefs. I find that to be very tacky. The film is badly done. Really boring, and the gatekeeper looks like Chief Keef. Awful, awful film. So bad, it is almost good. With the \"got it' right out of Army of Darkness, you might even crack a smile."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "HorrorOverEverything",
        "review_rating": "4",
        "review_title": "Nothing New Here",
        "review_detailed_main": "The first word that comes to my mind after watching Johannes Robert's new film \"The Other Side Of The Door\" is standard, this by the books horror movie never tries anything new and mostly piggy backs off of things more successful horror films have done.\n\nThe story is about a couple who loses one of their children in a tragic accident, unable to live with the loss of her child the mother Maria (Sarah Wayne Callies) seeks out a way to see her son one last time (I think we can all see where this is going). Maria conjures up the soul of her dead son and things start to go downhill from there. Sound familiar? Yeah this is basically a more paranormal version of Pet Semetary. Don't get me wrong, this is not nearly as good as Pet Sematary, it just has a lot of similarities.\n\nWell once all the haunting stuff gets going it is pretty cliché, things moving by themselves, other child starts acting odd, and *insert scary girl ghost with hair in front of her face*. I found it hard to really get into the film due to it just feeling like every other ghost movie that has come out in the past 15 years. It never tries anything new and seems to follow every ghost movie cliché down to the tee. There were a few things I liked about the film, Sarah Wayne Callies performance is pretty solid and showed that she can carry a film alright even if the film isn't very good, plus the film is set in India and I thought that was pretty cool.\n\n\"The Other Side Of The Door\" is pretty much every modern day ghost movie, if you enjoy those types of films and want to see more of the same then you will probably enjoy this film. However for me I was just kind of bored by it, everything the film does has been done better in different films.\n\n4/10"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "sinisachejim",
        "review_rating": "6",
        "review_title": "Decent horror story...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Alanjackd",
        "review_rating": "3",
        "review_title": "Chance missed",
        "review_detailed_main": "I do not think the director and writer really knew where they were going here and were unsure of what they wanted to make...started off as a half decent affair with a psychological silence running through it but just got sillier and sillier....nothing we have not seen a million times before...all was left in the end were the jumps but I think by then we all knew where they were coming from.\n\nOne or two good ideas ,,,like the car in water scene were very well handled ...but then the ridiculous scarefest began...\n\nthe cast were not too bad but did not have much to do really...the scenery of India was about the best visual aspect and I think the culture clash should and could have been a bit more employed.\n\nOn the whole ..if its pointless jumps you are after then this maybe your'e kind of thing but generally for anybody who actually watches movies rather than going to the theatre then maybe not.\n\nOverall 3 out of 10 ...a good opportunity missed."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Weirdling_Wolf",
        "review_rating": "7",
        "review_title": "An enjoyably shuddersome trip into the darker realms of a mother's grief.",
        "review_detailed_main": "Produced by Alexandre Aja and competently directed by Johannes Roberts, this rewardingly atmospheric supernatural shocker benefits greatly from its exotically far-flung Indian setting, and the malign mythology is frequently quite effectively rendered. 'The Other Side of the Door' is a viable update on the eternally plagiarised horror classic 'The Monkey's Paw', and, perhaps, having a similarly skewed vibe to Bob Clark's 70s doomy horror masterpiece 'Deathdream'. While it might also be argued that some of the shocks owe a stylistic debt to J-Horror, but, frankly, that's pretty much par for the course these days. Robust acting and plentiful demonic shenanigans make 'The Other Side of the Door' an enjoyably shuddersome trip into the darker realms of a mother's grief."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "robintomiku",
        "review_rating": "4",
        "review_title": "Two good jumpscares and that's it",
        "review_detailed_main": "It was really long and boring. The idea was good and it would make a nice horror movie if it was done a little bit different.\n\nI've expected it to be more scary. Like there were two scary jumpscares but that was it."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "worldwide-54051",
        "review_rating": "7",
        "review_title": "I enjoyed the movie, though it may not be for everyone.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "arunth",
        "review_rating": "1",
        "review_title": "Yet another stupid \"horror\" movie",
        "review_detailed_main": "The movie has a good thread but the director and the actors failed to develop it. One more thing about the movie is showcasing India, when will you Americans change your attitude towards India. Whenever you show India, it will be always the dirtiest slums, why can't you go to the modern cities and showcase it. Because you people are so jealous for our growing importance in the modern world and the development happening here. Even when you are showing houses it's all grayed out and withered. There are slums all around the world, but they are not the important part of that city, so at least try to understand that and behave like a grown up rather than acting like jealous country boy."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "jcm2871",
        "review_rating": "8",
        "review_title": "Reminded me of Pet Cemetery",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "Mummy will be mad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "dcarsonhagy",
        "review_rating": "4",
        "review_title": "A Really Bad Re-Imaging of Pet Semetary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "arnesoeren",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "tom-43722",
        "review_rating": "7",
        "review_title": "Scary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "stevendbeard",
        "review_rating": "5",
        "review_title": "So/So Horror Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "neil-476",
        "review_rating": "7",
        "review_title": "OK horror",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "sjarja",
        "review_rating": "3",
        "review_title": "not recommended",
        "review_detailed_main": "I liked the first - ahh... 10 minutes of the movie (pretty much the setup of the story) - once the story went into gear ... it became a predictable and boring mess.\n\nWhere to start... . As i said - the story is forgettable, because it is just the default horror story. Seen executed like that in countless films before.\n\nThe problem is not so much that the story is just so predictable and standard. The problem for me was the utterly unlikable protagonist(s). After just 10 minutes with the female lead - i was rooting for the monster to kill her - which is never a good sign for a horror movie. The protagonist knows two emotional states: wide eyed shocked, obliviously happy.\n\nAt the end of the day - the movie was just boring."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "LeonLouisRicci",
        "review_rating": "7",
        "review_title": "Somewhat Unique but Disappointingly All too Familiar at Times",
        "review_detailed_main": "When this Horror Show doesn't Fall Back on Jump Scares it is quite Effective and a Bit Different. The Setting in India makes for a Unique Backdrop, although the Mysticism could be Transposed to a Number of Cultures, if not the Details, and does have that Creepy, Otherworldly Patina.\n\nThere is a Good Cast Delivering Solid B-Movie Performances and the Director has a Touch of Sorts and this Familiar Tale of Portals, Afterlife, and a Mother's Grief is Presented Similar to others in the Genre but has Enough of its Own Slant to make this a Curiously Cranked Downbeat Display.\n\nSlightly Above Average it is Somewhat Underrated but is Held Back by some Predictability and is Slow to Start. Once things do Reincarnate it's Suspenseful and Horrific at times with Switching Alliances and a Few Supernatural Surprises.\n\nOverall, Worth a Watch for its Differentness but may Disappoint some Seasoned Horror Buffs with its Resort to Sameness Sometimes. It doesn't seem to have the Confidence of its Own Ability to Scare and Disturb without Relying on Regular Genre Tropes.\n\nNote\u0085Not really a rip-off of \"Pet Cemetery\"\u0085it \"Tips the Hat\"."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "cris-68",
        "review_rating": "3",
        "review_title": "Not enough plot or common sense in what could have been a good film.",
        "review_detailed_main": "My short review is - this is one to turn off your brain and watch. For a longer review, read on.\n\nFirstly, this is a pretty film in places. The locations were nice although the house, considering they were well off, distracted me a lot in that it was frankly quite tatty. Anyway... This is a film that really could have been something interesting, with leanings towards Indian culture, religion and mythology bringing something new to the table. Instead we are greeted by a selection of standard tropes from the ever common \"Is that something? No. Jumpscare!\", to the ignoring of wise advice; However it is not that which will infuriate the viewer if they have any intelligence.\n\nFirstly the advice that the grieving mother gets is one line - do not open the door. We all know what will happen and she opens the door; That is not surprising - what is surprising is a single woman from the USA travelling to rural India to find a deserted death temple in the middle of nowhere for a two day break, on her own. This is not wise travelling advice just about anywhere and would have made a way better movie exploring just that.\n\nIn addition to this, the film's commitment to having the characters being as mind-numbingly stupid as possible makes it a pain to watch. It is too easy for horror movies to be cliché filled and this is sadly no exception. Character motives are shallow. Reasons for withholding massively important information are non-existent. Background to the death temple and the ash covered custodians nil.\n\nThe acting is OK - it's nice that Newt from Aliens gets un-thawed from a cryochamber to appear in a movie again, however they are acting basically nonsense in a plot that is simplistic and trite. Watch it if there is nothing else on however do not say that I didn't warn you."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "nikkiinwanderlust",
        "review_rating": "9",
        "review_title": "Extremely Underrated",
        "review_detailed_main": "I am a HUGE horror film buff and this one is extremely underrated. Ignore the negative reviews and give this movie an honest try, it is better than most scary movies that have been released in the last ten years."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "fedor8",
        "review_rating": "",
        "review_title": "You can skip this one, along with the other 5,000 boring haunted house films.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "kannibalcorpsegrinder",
        "review_rating": "6",
        "review_title": "Decent enough but does have some flaws",
        "review_detailed_main": "After the death of their son, a couple living in Mumbai trying to cope learn a mystical way of bringing them back to communicate with them again only to find that something sinister is following them home and must find a way of stopping the spirits' influence on them.\n\nThis one wasn't that bad if an altogether decent supernatural affair. One of the few great parts about this one is the fact that it manages to get the conditions and practices of the ceremony into the story rather nicely. The way it details the instructions specifically, from the manner of how to get there and what to do when they arrive and in what precise order it must be carried out in order to work properly, these are all handled quite well and gives this the kind of set-up which brings the scenes in the temple itself their inherent creepiness. By going through the motions of retrieving the ashes, arriving and preparing the candles and the layout of the ceremonial trinkets that are prepared for the start of the ritual inside which is quite creepy and works due to these early set-ups as well as the details of the temple itself. Once it comes back to the rather impressive supernatural details later on, this one is even better with the series of rather chilling events showing the demonic spirit tormenting her and her family out in the slums of the city or the series of rather tense confrontations in their home which are rather fun and chilling from the accidental death in their backyard or the battle in the kitchen with the possessed individual. With so many of these scenes featuring the rather creepy and chilling looking designs of the spirits taken directly from Hindu folklore for their appearance, this makes for a much more shocking look that really helps this one, this one manages to really get some impressive elements here although it does have it's fair share of sizable flaws. The main one here is the fact that so much of what happens here doesn't have the slightest bit of interest here as it's just not that chilling or scary to go through the rather bland scenes of their marital problems or her physical condition which manifests itself following her return. There's way too much melodrama in this part which doesn't come off in the slightest bit interesting following the stellar opening half with the accident and the ceremony, so that dip really appears obvious with some really troubling and bland scenes that feature the wholly expected jump scares of shrieking ashen-faced specters only she can see that are just so expected and clichéd that they're not even that worthy of generating the jump. That becomes a recurring theme here where it tends to rely on this clichéd look and topic for the vast majority of it's scares and it really becomes old after awhile not only seeing the same type of scares but going through the motions again. Likewise, the other big problem area here is the fact that the ending is somewhat abrupt and just seems to end really without warning, stopping and just rolling credits which somewhat neuters the effects just shown beforehand. Otherwise, this one wasn't all too terrible overall.\n\nRated R: Violence, Language, children-in-jeopardy and implied animal violence."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "comps-784-38265",
        "review_rating": "4",
        "review_title": "Predictable horror of cliché's and glib storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "DogFilmCritic",
        "review_rating": "2",
        "review_title": "Jump scare nonsense",
        "review_detailed_main": "This movie felt very cheap and you can tell there was zero dedication attract the audience, the only intention was to cash a paycheck, cheap cgi everywhere and lame story telling. They move the story as fast as they can, so you don't get the feeling of what's going on nor you can relate to anyone in the movie, it's all about scaring you in your face with many jump scares as possible.\n\nThat's my problem with this movie, awful plot not attention to details unless you count the stuff tiger, they will show it to you as much as possible to what end...not sure, the horror elements feel so bland and monotonous, you lose interest very quick. The acting is passable, Jeremy Sisto did nothing in this movie, not his fault bad writing and directing.\n\nThis is not worth the watch skip this one, it's as lazy as it was uninteresting."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "fatmaasaafan",
        "review_rating": "7",
        "review_title": "If you want horror movie go for it",
        "review_detailed_main": "The movie is really good for a horror moive & the end of it makes me feel satisfied about the story anout the whole movie its showing you what happened behind that door so I loved how they drew as to the end 👏🏻👏🏻👏🏻"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "bkrauser-81-311064",
        "review_rating": "3",
        "review_title": "Humdrum, Bottom-of-the-Barrel, Snoozefest, Boring",
        "review_detailed_main": "Maria (Wayne Callies), the grieving mother of a young daughter (Rosinsky) and a deceased son (Creran) successfully conjures the soul of her dead child to say her final goodbye. While taking part in the ancient Indian ritual however, Maria makes a fatal mistake upsetting the balance between life and death. This is essentially the plot of The Other Side of the Door, a movie so beholden to cliché that it's a wonder they didn't leave the film even more wide- open for a sequel.\n\nPerhaps this movie is trying to say something about the folly of American exceptionalism. Maria and her erstwhile husband Michael (Sisto) make a go of living in a foreign country (India) with a frustrating lack of knowledge or respect for the ancient cultures around them. Maria especially shows her ignorance by never adopting the language, being dismissive of Piki (Pillai) their live-in maid and finding the languished poverty around her jarring, as if she seldomly sees it firsthand.\n\nPerhaps this film is trying to say something about the toll grief takes on loved ones. Maria internalizes the guilt she feels for allowing her son Oliver to die in a fatal accident. At the beginning of the film she is so inconsolable by her son's death that Piki naively suggests the hidden temple by her village that starts all this malarkey. That grief transforms itself into something evil that tests the fortitude of the bereaved family.\n\nPerhaps the point lies with the dual isolation Maria feels when cut off from the familiar in a country she knows little about, mixed with the isolation felt by severe depression. Yeah, that's it! The apparition and all the haunted-house theatrics are the result of pent up sadness and anxiety with the children simultaneously being the biggest victims of a mother's grief and the biggest cause of horror.\n\nOf course The Other Side of the Door can be about none of these things and I'm giving the film far too much credit. The fact is this film is barely serviceable. The direction is rudimentary, the characterization is uninspired and the story is cliché enough to shake a stick at. The movie depends on a slew of jump scares to keep the audience interested but provides very little tension to keep people invested. Callies generates just enough pathos to keep us caring about the character but everyone else falls neatly into little pre-made boxes: Rosinsky; the cute child in danger, Sisto; the guy who gets involved too late and only gets half the story, and Pillai; the victim who said I told you so.\n\nTurgid with the exploitative bits of every tried-and-true horror cliché, The Other Side of the Door is nothing new. It's the kind of film that can drive any movie aficionado into a real tizzy. It's boring; not bad, I can work with bad, no this film is just humdrum, bottom-of-the-barrel, snoozefest, boring."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Hellmant",
        "review_rating": "7",
        "review_title": "The type of movie that really would have scared me as a kid.",
        "review_detailed_main": "'THE OTHER SIDE OF THE DOOR': Three and a Half Stars (Out of Five)\n\nSupernatural horror flick about a traumatized mother, living in India, who experiments with an ancient ritual, in order to find closure with her deceased son, and something goes horrible wrong (of course). The film was directed by Johannes Roberts (who's previously helmed multiple other B-horror flicks) and it was written by Roberts and Ernest Riera (who's also now teaming with Roberts on his next film). It stars Sarah Wayne Callies (of 'THE WALKING DEAD' fame), Jeremy Sisto, Sofia Rosinsky, Logan Creran and Suchitra Pillai. The movie made a little bit of money at the Box Office, but it's also gotten mostly negative reviews from critics. I can definitely say it's a better B-horror flick than I was expecting it to be.\n\nMaria (Callies) was living happily, with her family (abroad in India), until her son, Oliver (Creran), died in a horrific car crash. Maria has been haunted by her inability to save him, ever since. She learns from her maid, Piki (Pillai), that there's an abandoned temple, where Maria can speak to her son, one last time. Piki explains that it is very important that Maria follows the rules of the ritual though, and never opens the door of the temple (to see Oliver). Maria (of course) fails to follow her warning.\n\nThe movie is somewhat clichéd, and full of some routine 'jump scare' gimmicks; but it's still a lot better made than I was expecting it to be. Callies is awesome in the lead; she's very convincing and her performance gives the film some much needed credibility. The car crash scene, where the son dies, is very hard to watch, and hauntingly memorable. The concept of the film is also pretty interesting, involving and creepy. It's the type of movie that really would have scared me as a kid. I was pretty satisfied with it.\n\nWatch our movie review show 'MOVIE TALK' at: https://youtu.be/bmrjYaOGPmk"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "moonlitnite83-1",
        "review_rating": "2",
        "review_title": "It could been better..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "FeastMode",
        "review_rating": "6",
        "review_title": "my notes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "GiraffeDoor",
        "review_rating": "4",
        "review_title": "Pet cematary without the atmosphere.",
        "review_detailed_main": "This movie is Pet Cemetary, only in a more exotic setting and more poltergeist than undead.\n\nIt dives right in without the tedious build up to the inevible dead kid. It doesn't do much to make me like the mother though. She's the kind that hates her Husand for being able to be asleep when she has the flashback-dream. It actually advances the plot nicely so it's the rare good use of dreams in this genre.\n\nVery cliched. The mystical local women, the warning \"don't open the door\" (I wonder if she will open it...)\n\nI appreciate that this movie could be scary if you had never seen a horror movie before. It's like a catalogue of things we've all seen before.\n\nNo an impressive movie. It tries to be poignant but just ends up being simpering because of lax charcterization."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "BignProud",
        "review_rating": "9",
        "review_title": "Very underrated horror, not scream bloody gore type",
        "review_detailed_main": "First of all, it is very difficult to make an adult scared, really scared in a movie when you are surrounded by other people ; just watch it home along and that would be the real rate .. and frankly I would not. Anyway, decided to change London has fallen to this one instead and what a surprise it was ! I can not say it is a masterpiece but it is very solid horror movie that - I am so surprised no one mentioned this before - so heavily reminds of Stephen King's Pet Cemetery. There is no stupid screams that make you jump because it is just loud or blood splashing all over the screen. No, what it does instead though is giving us an emotional insight into a family drama while creating an uneasy and disturbing atmosphere that grips your stomach till the very end."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "trashgang",
        "review_rating": "6",
        "review_title": "the overall CGI tears it down",
        "review_detailed_main": "The idea of making a horror in India looks promising because you can add culture and believe into the story. And they actually did but the problem I had with this flick wasn't the story itself.\n\nI had issues with the effects used and not being scary at all. In the beginning of the flick the first scary moment is done with CGI so for me it was clear that this wasn't going to be my thing. It isn't scary at all even as they put in a creature that reminded me of so many Asian horrors, the long haired crawling girl. As said, the story is rather okay with the temple and the occult being added towards the story. But overall it's except for the drowning all done CGI wise.\n\nThe last 10 minutes are the best part but again, for me the CGI used pushed away the scary part. It's not one for the real horror geeks but I can understand that teens will like it because it fits perfectly in the Anabelle's and Conjurings of this time being.\n\nGore 0/5 Nudity 0/5 Effects 2/5 Story 2/5 Comedy 0/5"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "danron1",
        "review_rating": "2",
        "review_title": "This horror trend has to stop",
        "review_detailed_main": "The movie is laughable.\n\nThe plot is so contrived and none of the characters are believable. The character development goes nowhere. The mother is also, besides hot, not a good actress. With the right manuscript I have seen both of the main actors do well but this is just not working. For me this became a comedy quite a short while into the movie. And not a very good one at that."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "paulclaassen",
        "review_rating": "5",
        "review_title": "Good, but its lacking something...",
        "review_detailed_main": "A good plot, but it somehow feels the film is missing crucial information. It would have been far more effective had they shown the accident scene, instead of just showing it in flash backs. Although the film is very atmospheric, there are very little scares. Some rather effective visual effects. A very good message is being conveyed here, though."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "leonmessyb",
        "review_rating": "7",
        "review_title": "REALLY SURPRISED BY THE NEGATIVE REVIEWS!!!",
        "review_detailed_main": "After reading so many negative reviews as well as some good ones, I really didn't know what to expect. I was honestly prepared for an awful film. I'm a massive horror movie fan, so takes a lot to impress me. I felt this movie had some good original elements to it and naturally some I've seen in other horror movies. It's got all you need from a successful horror movie: slow reveal of a back story, suspense, jumps, scene setting music and so on. I thought this movie was pretty good overall and I've definitely seen FAR WORSE. I even like how it ended. Not a masterpiece but definitely worth a watch in my opinion!"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "analwithlittlegirls",
        "review_rating": "2",
        "review_title": "Cliche's everywhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "qasimidris88",
        "review_rating": "6",
        "review_title": "Great Story. But could have been better...",
        "review_detailed_main": "I always wanted to watch this movie since the release of the trailer. Overall this movie is not that bad.\n\nDefinitely above average, story & characters were all good, only problem was that they could have added some more creativity in horror scenes.\n\nIt felt like a bit of a cheap movie when everything is happening in the house and around it. Its a decent horror movie with some good scary scenes and decent story. I would recommend anyone who is a fan of The Ring movies .... Overall its not a bad movie. All the characters locations and story was well made. Some of the scenes will make you jump."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "cbarrette-42802",
        "review_rating": "5",
        "review_title": "Good Movie, Slow to Start",
        "review_detailed_main": "I am a horror / slasher / possession movie fan. I liked the idea of this...but for me...it was a little slow to start. I like moves that start off right away.....it took a bit for the excitement to build. Good idea......knock off of Pet Sematary (Stephen King) different idea, but same idea at the same time. For this reason I only give it 5 stars. Spooky scenes that make you jump...good idea...just poorly directed. I think if the movie would have had more \"scary\" scenes and would have started out with the spooky parts earlier....it would have made for a better movie. The spooky parts were great....but there should have been more of them."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "cosmo_tiger",
        "review_rating": "7",
        "review_title": "Along with The Forest one of the better horror releases of the year. One that is definitely worth seeing.",
        "review_detailed_main": "\"What if I could bring your son back to you just one more time?\" Maria (Callies) is struggling with dealing with the loss of her young son. She has become distant from her family. When she is told of a way she can talk to him one last time she jumps at the chance. While talking to him she breaks the one rule she was told and unleashes something that threatens everyone. Horror movies in the last few years seem to be two types. Straight gore or found footage. It is rare for a \"normal\" horror movie to come out. This is one of those exceptions. There are some definite creepy aspects in this and those that have a hard time with possession type movies will be terrified watching this. This actually had a plot, suspense and enough terror elements to keep you watching and interested. That is hard to find in horror lately. If you are a horror fan I recommend this. Overall, along with The Forest one of the better horror releases of the year. One that is definitely worth seeing. I give this a B."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "RodrigAndrisan",
        "review_rating": "4",
        "review_title": "Reincarnation, The Jungle Book and a lot of bullshit",
        "review_detailed_main": "There seems to be a recipe that all creators of Horror respects. The film must contain: furniture that moves by its own forces, rotting corpses coming to life and talking ugly(possibly removing the tongue out from the mouth), dolls, teddy bears, tigers and other stuffed animals that make all sorts of mischief, doors that close by themselves, voices of the dead that are heard from the mouths of vivid but possessed characters, etc. I found most of these items in 3 Horror films seen in the same week: \"The Other Side of the Door\", \"The conjuring 2\" and \"Libido\" (1965). The story in this \"The Other Side of the Door\" is all predictable, it has the air of deja-vu, the actors they do what they can in these conditions and, overall, we loose 1h 36min. from our lives."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "politehere",
        "review_rating": "9",
        "review_title": "This is Not a 5+ Horror Movie",
        "review_detailed_main": "It is rare for horror movies to be this good, so I really don't understand what the low rating is for.The cinematography, acting, atmosphere and music score were perfect. They had tried to employ a lot of jump scares, but only two or three of them really got me. The Japanese type evil ghost, which was supposed to make us terrified and jump out of our seats, didn't really work for me. Either it's because my eyes were aching while watching this movie or it's because I found it to be distracting for its belonging to Japanese horror movies. The best jump scare scenes were those involving the boy himself. At least three or four scenes sent chills down my spine (I'm not talking about the jump scares). It's very rare for a horror movie to make me feel such real fear. The story itself was very decent and different. The ending came as a big surprise, too. I completely agree with one reviewer who said it would have been better if we knew more about the boy when he was still alive. The movie had room for improvement, but frankly speaking, this is one of the most well-executed horror movies of the past 5 years. This is not a 5+ horror movie. It's easily a 6+. Strongly recommended."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "sonekken",
        "review_rating": "6",
        "review_title": "It wasn't bad",
        "review_detailed_main": "I understand why a lot of people are disappointed with this movie, but for die-hard horror fans it's a good way to spend and evening after work, and relax. It's not gonna scare anyone, that's for sure. But the story is quite good! Try it. Enjoy it"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "richardwworkman",
        "review_rating": "5",
        "review_title": "Half decent..",
        "review_detailed_main": "..spiritual supernatural horror.\n\nSet in India this uses a mix of Hindu and folklore as a family struggle with the death of their child.\n\nIt's a good watch with some creepy moments but being based on such a deep family tragedy kind of weighs the story down a bit. There was room to explore the spirituality associated with the death gods but if just kind of stuck with the family thing which was a bit of a shame.\n\nA good popcorn movie. Watchable but not a classic."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "TdSmth5",
        "review_rating": "5",
        "review_title": "Lame J-horror in India",
        "review_detailed_main": "A family lives in India. A woman has nightmares and some issue she has to deal with. Later we learn that she was involved in a car accident with her two children. The car ended up in a river and she could only save her daughter. Eventually the woman decides to commit suicide but is saved in time. Seeing how messed up the woman is, the local housekeeper offers to help. She has a way the woman can talk one last time to her dead son. The woman agrees. This involves nothing less than digging up the boy's corpse, incinerating it, traveling to the country, walking through some woods, finding a desolate temple, throwing the ashes on the temple's stairs and then waiting for night. Of course all this comes with a warning--do not open the door, no matter what. You can tell where this is going. And of course, don't expect the mother to tell anyone else about all this, especially...her husband.\n\nThe mom finds some mummy in the basement of the temple--some 4-armed person. Sure enough later she hears noises and her son talks to her through the door. The kid wants to be let in, but the mother resits. But when she doesn't her his voice anymore, she opens the door, but there's nothing there. Except for some creepy ascetics the housekeeper has mentioned cover themselves in the ashes of the dead and \"feast on the dead,\" whatever that means.\n\nBack at home the mother is doing much better. But suddenly Khan appears to the daughter. Khan was the son's favorite toy with which he was buried, a tiger doll. Then the piano starts playing by itself as the daughter talks to no one. Of course it's the son, Oliver, who's back! He moves chairs and puts books in the mom's way so she will read to him. She isn't troubled by any of this. Until all the vegetation in and around the house dies. We've seen that before, around the temple. Then the family's fishes and birds die. The dog lives a little longer but not much as is the fate of all dogs in movies. Finally the 4-armed person thing starts crawling around in good J-horror fashion complete with those crackling noises.\n\nStill the mother isn't worried, it's up to the housekeeper to tell the dummy what's going on and what to do. Things get more complicated as Oliver gets meaner and the creature keeps appearing.\n\nThe Other Side of the Door has a great idea in a good setting in India and incorporating some local lore. But it could have been so much more. The whole affair is slow-going, with few thrills and little atmosphere. The filmmakers where too busy complying with Hollywood's political agenda, so we have a dead son, a father who isn't allowed get involved in anything, just the mother, the daughter and the female housekeeper. At least and surprisingly they didn't turn the mother into some superhero. The ending has a very cool twist. This movie could have been a truly scary horror movie."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "thesar-2",
        "review_rating": "6",
        "review_title": "Quick! Someone Call a Locksmith!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "dksfhkqc",
        "review_rating": "1",
        "review_title": "Really obvious how bad it would be",
        "review_detailed_main": "Just think about this for a second. A horror movie based on only getting to see your child again to say goodbye. Like let's torture myself after my child's death by s ring them again knowing darn well it's only for a moment and then they must go away again forever. Why, why would any rational human being do this to themselves. Guess what they wouldn't. This woman it just plain dumb. One rule don't open the door. Recently a musical Hades Town explored a similar idea. Only to ruin the whole musical at the end when the end was so close. This movie is only interesting if all you want to do is see how this dumb woman will be tortured for being stupid. That in and of itself makes he audience then that watches the entire movie some bunch a sadist sick psychos."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "paullevine-06620",
        "review_rating": "6",
        "review_title": "The Other side of the Door",
        "review_detailed_main": "I find it very funny so many disliked the film maybe because it has no real graphic horror or sexual content that most of the critiques seem to need to enjoy a simple ghost story. This may not be the best ghost story ever told but it has plenty of creepy & atmospheric moments & a great ending. To many horror buffs can't just enjoy a story without sex & graphic gore they aren't really fans of the genre & i fail to see why they are so surprised when she opens the door when told not to ,it's like to body under the sheet you dont want to look but but still you have to. This is not a bad film & the story though it's been told before like in Pet Cemetery love make people that are grieving do things they shouldn't do . I enjoyed the film from the perspective of ghost story's & though it may not be the best ghost tale ever told these comments of hate are as lame as can be."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "agostino-dallas",
        "review_rating": "5",
        "review_title": "I am still nostalgic about The Sixth Sense!!",
        "review_detailed_main": "I remember going to the movie theater to watch \"The Sixth Sense\" by M. Night Shyamalan. I was not expecting a lot, no bias since I had not read any review and I was the first among my friends and family to watch it, so really good to be total unaware in a movie like that. Looking back, it is unbelievable that just turned the calendar to 2017. 2017!!! So, The Sixth Sense is almost reaching \"the legal age\". It is actually 18 in my country! And absolutely I have not watched a better movie of this genre ever since. Some horror movies are actually gore. Others are so cliché it is not worthy watching 5 minutes.\n\nThis movie was so poorly made I can't understand that happens. It looks like some kid wrote it. They exaggerated in many of the scenes just pure nonsense and nothing adding up a good ghost story, it is even hard to rate this and be simple but I will try: \"It is a bad horror movie\". Just bad! Five is already a good rate for this. I am happy I saw it on TV and not in the theater."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Reno-Rangan",
        "review_rating": "6",
        "review_title": "When the balance was broken between the two worlds!",
        "review_detailed_main": "Considering this filmmaker from the B movies, this is not a bad one, probably it may remain as his best work for sometime. Definitely not a great horror film either, yet the rating it has received is a very low. The title says everything, but there are other things in the narration to get engaged with. Obviously a bit slow, and patches between the scenes should have been developed better. But overall film was slightly above average if you welcome a blend between two different cultures and themes.\n\nIt was the tale of a western couple who settled in Mumbai, but the film opens with their plan to start a family and later it moves to six years forward. Now they're grieving with their son's death, especially the mother with a guilty feeling. Then she comes to know a place to make a contact her dead son and to say proper goodbye. But what follows is the supernatural chaos in the house and finding a way to fix everything is the remaining film to reveal.\n\nThe concept was really wonderful, but the film was designed to be not scary or maybe those parts were just a cliché. You know those dead guys in the make-ups try to scare you stuffs. The story wise, it is refreshing, but should have been added more to it to make further interesting. It was just a 90 minute film, yet feel somewhat lengthy. Actors were decent, the locations were okay, the production was much better and the overall film was acceptable kind. Except easily predictable scenes, not bad for a casual watch.\n\n6/10"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "vladgeorgescu-92904",
        "review_rating": "3",
        "review_title": "Nonsensical and insulting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "dvnnvd",
        "review_rating": "9",
        "review_title": "Excellent",
        "review_detailed_main": "In my opinion this is up there with one of the best horror films so far this year. I genuinely enjoyed watching this and thought it was gripping throughout.\n\nIt has a few excellently timed jump scenes that work really well. The overall storyline is fantastic and intriguing, the film keeps you gripped throughout and the atmosphere throughout is great.\n\nI especially like how the film is set in India and so we get a whole new twist/view of the horror concept mixed with another culture.\n\nI've seen Sarah Wayne Callies in Prison Break before, but she was outstanding in this!\n\nI'm fairly critical of horror films these days (being a long time horror fan), but I can genuinely say I thought this was brilliant."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "Look mummy, Oliver came back......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "skinxni",
        "review_rating": "3",
        "review_title": "A mostly \"meh\" film full of predictability.",
        "review_detailed_main": "I didn't walk into this film expecting a masterpiece, although the trailer did have me anticipating *slightly* more creepiness than the overall outcome portrayed. Basically, there is nothing here than I haven't really seen before, and nothing quite so memorable that I would recommend it to anybody. It had space and potential to be a cool, well-researched, and atmospheric film, but I was left feeling bored and unimpressed. Two people even got up and left half-way through. TOSOTD is more or less a Pet Sematary type. (Even Pet Sematary seemed to have a bit more character development - and a much better child actor, haha). I didn't feel connected to or even that sympathetic for the characters in this film because there was so little trying in the area of developing them. Everybody felt kind of asleep in the film. I give this a 3/10 for the briefly shown makeup effects, more than anything. Mostly I was just fidgety waiting for something to catch me off guard, but in a film filled with purely jump scares, that's a bit impossible. I almost took after the couple who left - I just could not sit still! In comparison to the recent horror film \"The Forest,\" I suppose TOSOTD had a bit more going on in carrying out the plot, but it still wasn't much better. Not an impactful or impressive film in ways of writing or atmosphere. Another blah-Horror money maker that didn't seem to care about itself."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Stevieboy666",
        "review_rating": "5",
        "review_title": "Bringing your kids back from the dead is never a good idea",
        "review_detailed_main": "Nicely set in India an American family lose their young son in a freak motor accident. Riddled with guilt the mother is told she can speak to him one final time at an ancient Hindu temple, but that she mustn't open the door! Naturally she does. Pet Sematary springs to immediate mind, substituting an animal for a human. There are a few decent jump scares but, as is so typical of modern horror movies, these soon become cliche and quickly lose their power. The film also goes for a J-Horror look, needless. The shamans are very creepy. This is a decent watch, just neither remarkable or memorable."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "deloudelouvain",
        "review_rating": "6",
        "review_title": "I saw worse but also much better.",
        "review_detailed_main": "The Other Side Of The Door is watchable but it's not something that will wow you, or at least it didn't wow me nor my wife. For a horror it has some jump scares, which are rarely effective to me, and some decent creepy shots but nothing that will keep me up at night. It's one of those stories that has been done before so nothing really innovative. The main character is played by Sarah Wayne Callies, an actress that I mainly know from low rated movies like Into The Storm, and Pay The Ghost. Or The Walking Dead that is highly rated on here but that I really didn't like. I gave up on that show after three or four seasons as it became too ridiculous. She did a decent job though but it seems like she can only scores jobs in movies and shows of that quality. That said the movie is just good enough for a one time viewing. It's not horrible but it won't win any prizes either."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "lathe-of-heaven",
        "review_rating": "4",
        "review_title": "Ultimately ineffective story with a fairly predictable premise, but with some moderately creepy scenes... Blu-ray: Very Good A:9 V:9",
        "review_detailed_main": "'Excellent', my @ss...\n\nSorry, I couldn't help but riff just a bit on this inane and clearly disingenuous review summary that I just read here for this film. This movie is FAR from 'Excellent', I assure you...\n\nHowever, with that said, I do think that the film makers / director did try to create an effective Horror film. The look, lighting, and some of the visuals were okay. And, I felt that some of the ELEMENTS of the story and the film were good, but I just truly do not think that they were put together very well.\n\nAlso, at least in my lowly and wretched opinion, I honestly did NOT care for the acting very much, particularly with the lead actress. I read here in the reviews where some say that she is pretty good. Well, that may be, but in THIS film with the specific way that she came across, whether it was because of her performance or the way she was directed, but as far as I personally am concerned, she did absolutely NOTHING to make the story, character, or mood of the film more effective or believable. I guess, really, that the responsibility must honestly rest with the director since it is up to him to elicit the right performances and craft the end result in such a way in order to bring across effectively what the story is supposed to do.\n\nI didn't particularly care for the actress who portrayed the little girl either. Was it just me, or did she come across as much 'harder' and unnaturally older than she should have appeared for her age. To me, there was NOTHING of what you would consider a 'normal', innocent little girl about her what so ever. She said her lines like she was biting off steel or something. So, I felt her portrayal supposedly as a 'normal' little girl as anything but...\n\nI don't know... I mean, I only gave this film a '4' because I honestly didn't find it very effective. And, without giving anything away, especially the ending was really pretty bad. I don't mean the last minute or so with it's supposedly 'punchy' ending, I mean like the whole last act of about 15 minutes or so.\n\nI usually wouldn't bother to write a review about a film like this where I felt so ambivalent about it, but I think what kind of 'pricks' me (sorry, I just like saying that :) is that I genuinely felt that there MIGHT, just MIGHT have been a fairly decent movie in there somewhere, nothing orgasmically earth-shaking or anything, but I think that with the right editing and directorial choices and at least in my worthless opinion, DEFINITELY another lead actress, just MAYBE they MAY have been able to cough up, yes, a completely derivative and unoriginal story, but possibly at least a decently entertaining 'B' Horror film..."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "znamzastosamuporan",
        "review_rating": "7",
        "review_title": "It's decent",
        "review_detailed_main": "I would rate this one 8/10 if there was a better actress than Sarah Wayne Callies. She is completely unnatural and constantly overacting, like we already know from her previous movies and shows. Even when she doesn't speak a word, she \"shines\" that mediocre-acting-vibe. However, the movie itself is pretty nice. Nice storyline, nice jumpscares. I've expected some Ouija kind of movie, but it turned out to be something relatively unique. The ending, which I find very important in this genre, is very good in my opinion. Overall, I would recommend this movie to people who like watching a simple horror jumpscarish movie without much to think about later on."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "panna-68859",
        "review_rating": "2",
        "review_title": "boring.",
        "review_detailed_main": "I have realized that paranormal movies are either a hit or miss. Some can be really good and interesting while others are boring, unorginal and has poor writing. This one was clearly a miss which is quite sad because it did have the potential to be good but instead it failed miserably. The plot itself was not bad but the characters were so stupid. The female lead annoyed me so much like why are the FL's so dumb in some of these paranormal movies? Whoever says that this one was a good movie has clearly never seen actually decent horror movies. This could have been so much better if only the story was better developed and the female lead wasnt so dumb."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "simonebeg",
        "review_rating": "6",
        "review_title": "OK Horror Flick with 'postcolonial exotic' touch",
        "review_detailed_main": "I'm not going go over the whole synopsis again (for that purpose just check the storyline summary provided by IMDb above).\n\nAs a horror movie this performed fine. Not amazing, not super scary, not extraordinary, just... fine.\n\nThere is a whole bunch of jump scares which you can see coming a mile away (but then I always wonder if by now we're just so desensitized to them that we just can't enjoy them the same way anymore). There is a (of course fictitious) background lore to the story which makes a nice change to your everyday ouija board/satanism/demon routine in stories rooted in western locations. The design of the 'gatekeeper' is really cool in my opinion and big props to actually having a makeup team and actress play most of it rather than going all CGI on it (but don't get the wrong idea, they make up for it with a quite unnecessary CGI scare right in the beginning). The Aghori (the ash smeared Sadhus) here and there manage to create a quite creepy ambiance. The longing for a guilt ridden mother to see her lost child again is portrayed quite believably especially after we get to participate in the heart wrenching scene of how she lost her child. We also have a father who conveniently is present or absent/cares or doesn't care where his wife happens to be however it may serve the plot. And we have child actors who do an OK job. Not great. But OK.\n\nThat being said the Horror part of the movie is more than predictable to anyone who's even just a bit familiar with the genre.\n\nIf you are just looking for something lightweight to watch on a lazy night or if you just starting to watch Horror movies, it's entertaining enough. If you're looking for something fresh in Horror movies, not so much. So much for the general review.\n\nNow a little note from someone who's a foreigner living in Mumbai:\n\nEven if the lore about the temple and the gatekeeper is made up, there are quite interesting touches to the movie. For example the couple lives in the so called Rudyard Kipling's Bungalow (or the Dean's House) which was supposedly (but more likely not) Kipling's birth house. Quite surprised they got the permission to film there. And also nice touch that at the same time the dead boy's favourite book is the Jungle Book and his favourite toy Sher Khan the tiger. Really nice touch.\n\nHowever, as someone who lives here I found it quite sad that when this could have been a chance to do differently, Mumbai/India and the way the family was portrayed living there was executed along the same lazy old stereo types mostly present already in Kipling's times. We have the slums, the superstitious maid, narrow lanes, crowded trains, tiny food shacks, a maid that looks like she dresses for the 1800's (or as a congress politician) and well as already said a rich white couple living in a (in real life unaffordably expensive) colonial bungalow... Mumbai is a city of wonderful old architecture in the south and skyscrapers in the middle and north, of 5 star restaurants, mega malls and bustling modern urban life. Yes, of course there are a lot of slums, there are narrow lanes and cheap food places in plenty as well, but usually you wouldn't find any westerners there (unless they're participating in guided tours). They usually don't eat in small shacks but rather in Hardrock Cafe or Leopold's, and they usually live in rooms well equipped with ACs, TV and Internet. Also btw, public cremation is banned in Mumbai (i think it only still exists in Varanasi, but not quite sure) so also that wouldn't happen.\n\nI know this is way too much nitpicking over a meh-level Horror movie, but while being happy to recognize places of my current city, the whole setting still seemed a bit crooked and anachronic. It was Mumbai/India, but through the same old colonial glasses that should have been tossed for good at least 70 years ago."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "drystyx",
        "review_rating": "1",
        "review_title": "Most predictable movie ever",
        "review_detailed_main": "Johannes Roberts and Ernst Riero join the multitude of Hitler worshipers who get the green light from producers to make more of these predictable Hollywood horror movies.\n\nA lot of people pretend to miss the forest for the trees with these neo Nazi propaganda movies.\n\nThe \"trees\" is the dumb story of a woman who thinks that she can bring her dead son back to life.\n\nThe \"forest\" is that this is just another predictable 1970s style Nazi Hollywood movie that goes out of its way to preach that women are the fair sex, by way of killing any blond male and any dark female.\n\nThat's the only thing that Johannes Roberts preaches here, and it's not even subtle. Just predictable. You'll wonder why you sat through an entire movie for this same old story."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "dywork",
        "review_rating": "8",
        "review_title": "don't trust the bad reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Tulpa_Memnon",
        "review_rating": "7",
        "review_title": "Interesting comparisons.",
        "review_detailed_main": "It's odd, that so many comparisons are being drawn with Pet Cemetery and none with the premise of 'A Dark Song'. Effective but nothing startling."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "kjohn-77891",
        "review_rating": "5",
        "review_title": "Viewers miss the most important aspect of a movie, the ending.",
        "review_detailed_main": "What we have here is a very average horror movie that viewers would have seen time and time again but what I found with this movie that sets it apart from other ones that are very similar to it is that this film has an awesome ending.\n\nDo not read anything to do with this film and go into it not knowing go anything about it and you will be surprised by the ending.\n\nI must admit here that I have seen much better films like Eden Lake but with that movie the ending was dreadful and a total cop out for the viewers watching it.\n\nSo yes there are much better movies out there to watch but most have dreadful endings.\n\nDon't listen to the reviews give it a watch, you might be surprised."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "learnbrandy-31202",
        "review_rating": "1",
        "review_title": "Beyond annoying! (SPOILERS)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "marcushamm-92589",
        "review_rating": "3",
        "review_title": "Here we go again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "knvixen",
        "review_rating": "3",
        "review_title": "Let The Wrong One In",
        "review_detailed_main": "It was bearable up until she opened the door, then my review title occurred to me. With 83 prior reviews this may have been said before, but has anyone else noticed the obvious plagiarism of Hammer's 2009 Wake Wood? That, I loved. This falls into insulting stereotypes of Indian people and culture, along with innumerable cliched moments."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "cwfrauman-716-721058",
        "review_rating": "4",
        "review_title": "Lousy",
        "review_detailed_main": "This is the sort of movie that can be picked apart in more ways than this reviewer can muster the will to write about. About the only thing it has going for it are the special effects and they aren't really used to much effect. In this sense the trailer was completely misleading. Going in I was at least half-expecting it might be better than the rating on IMDb at the time, in large part because the special effects looked so cool. But they weren't, and this movie isn't, nor ever was, going to be any good. It's really too bad. The actors are well cast and the production value is top notch.\n\nSome of the dialogue falls flat, though. I would blame the acting but it's really the script that's the problem. It can seem at times like no thought was put into its construction. The same can also be said regarding the plot holes, which this movie is riddled with, and one wishes there could be a few scares seeing as this is supposed to be a horror film after all. Sadly, it was not to be.\n\nNothing this botched production does can make up for so many obvious flaws. The premise isn't even close to being original, too. It's like Pandora's box, and just like the mythos, it's slightly misogynistic. The three stars are for the performance, whereas one extra star was added because I like the setting which takes place in India.\n\nSeriously, though, don't bother watching this movie. You'll save yourself a big headache."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "disdressed12",
        "review_rating": "8",
        "review_title": "creepy,Gothic horror",
        "review_detailed_main": "once again we have a well done horror film,one that doesn't rely on blood and guts.instead it builds on suspense and tension.it's also very creative,in my opinion.i like the whole concept of the film,and found it very provocative.it really makes you think and poses a lot of questions.the acting is first rate all around,but I have to single out Suchitra Pillai who plays Piki.she exudes creepiness,in my opinion.i also like the ending.i hope they make a sequel.if they do,and they stick to the formula of this one,there's no reason why it can't be as good.but this is just my opinion.for me,The Other Side of the Door is a well deserved 8/10"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "peterp-450-298716",
        "review_rating": "5",
        "review_title": "Pet Semetary made in India.",
        "review_detailed_main": "\"What if I could bring your son back to you just one more time? What if I could give you the chance to say your final goodbye?\"\n\n\"The other side of the door\" is not really a bad movie. Technically speaking it really looks magnificent at certain moments. Moreover, India as location and the used ancient ritual sure made for a unique starting point. But ultimately it was only a collection of all sorts of previously used ideas. I thought it felt a bit outdated. That wouldn't be such a huge problem if there was a certain tension or creepiness. Unfortunately, this was also missing, making it once again a horror that never exceeded mediocrity.\n\nThe story reminded me of \"Pet Semetary\" with the loss of a child and the desire to bring it back to life again. In \"The Other Side of the door\" Michael (Jeremy Sisto) and Maria (Sarah Wayne Callies) decided in an impulsive moment to stay in Bombay and to found a family. Years later we see how they have settled there, living in an idyllic looking house somewhere in downtown Bombay and their lives being enriched by the presence of their daughter Lucy (Sofia Rosinsky) and the typical family dog Winston. However, it's not entirely rosy because of the tragedy that occurred in the past, with the death of their son Oliver (Logan Creran) as a result. Maria is tormented daily by guilt and grief. Fortunately, Piki (Suchitra Pillai) the housekeeper has a grandiose idea. The things needed to fulfill this idea are the ashes of the deceased child, an old dilapidated temple and a nightly sleepover there. This could bring relief to Maria's heavy psychological problem. But obviously there's a golden rule that shouldn't be violated. And of course it's clear that is definitely going to happen anyway.\n\nNow we're off to a kind of \"The Conjuring\" made in India. All kinds of objects suddenly start to move around and ghostly apparitions appear and reappear in the background. And for the umpteenth time we get a self-playing piano. And for God's sake, when is anybody going to pay attention to the warnings of the dog. First the phenomenon is the kindness itself. Afterwards it turns out to be fairly aggressive again. Nothing new either. And just like in \"Lights Out\", the solution to the problem is the relationship between the caring mother and the ghostly presence. Again so predictable. Throw in some primitive painted Indian folkloric figures, called the Aghori who practice rather peculiar rituals so they can communicate with spirits in the afterlife, and it's complete. Those Aghori are creepy individuals appearing out of nowhere and producing an annoying, mesmerizing sound. But they aren't as scary as Myrtu who suddenly begins to interfere with the whole affair. It's a creature from the underworld that looks terrifying enough. I think they've used the \"stop-motion\" technique for this one (also an obsolete special effect). For me this was probably the most positive part of the film.\n\nAll in all, it's just an old-fashioned ghost story that didn't take place in an American old mansion to my relief, but in dark India instead where the mystic about afterlife and primitive rituals are still alive among the elderly population. Clearly modern Western people shouldn't experiment with such rituals. It's nothing earth shattering, but it's not bad either. Though expect a few strategically placed jump scares and a thoughtful ending.\n\nMore reviews here : http://bit.ly/1KIdQMT"
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "lucyramsey-54479",
        "review_rating": "8",
        "review_title": "Actually bloody good!",
        "review_detailed_main": "Really enjoyed this, not so good watching alone! A film that makes you look over your shoulder quite a lot. Really good jump scares and a some really upsetting parts in the beginning. As a mother I think this will effect me for a while.\n\nGreat story with depth and intregue, the end gets a little silly but don't they all!\n\nYes its predictable and yes its been done before but that just makes it more jumpy\n\nGreat if you not one of these people that just watch a film and pick holes, just open up watch and enjoy.\n\nLoved it."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "hoxjennifer",
        "review_rating": "8",
        "review_title": "A tragedy",
        "review_detailed_main": "I agree with another review I read here - that this is more tragedy than horror. If you judge this as a horror movie, then yes, it's not that scary. It has the occasional jump scares here and there and the occasional creepy looking ghost/spirit woman but other than that, it's not scary. But it is tragic, and if you look at the story-line, it's very relatable.\n\nA mother loses her child in a car accident and blames herself for it. She learns of an ancient ritual to contact him, locking herself up in an old temple to do so. She is warned not to open the door at any time, no matter what she hears. But of course, in her desperation to see her lost son, she does open the door.\n\nThis is about coping with a loss and the consequences that come from playing with the other world. It's not a brand new and novel idea, but the way it is portrayed is quite convincing. It's in a beautiful backdrop of a remote part of India as well, which gives the film an ethereal kind of feeling.\n\n8/10, honestly for me."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "rls-479-435216",
        "review_rating": "8",
        "review_title": "The East Indian Grudge",
        "review_detailed_main": "Welcome to a new Avenue of spookiness with a story never told before on the big screen. An expose'of desperate measure, as a mother undergoes her search for closure. Our cinematic backdrop is the landscape of India, and our protagonist is a well know star from The Walking Dead series, Sarah Wayne Callies. This supernatural creep fest triggers an age old question of the afterlife and what steps do you undergo to reach heaven or hell. We are engaged by a haunting transition from life into death, carefully detailing the psychological depression of parenthood and a division of marriage who handle their grief in separate ways. Considerable terror tied into numerous shocks, the eerie aftertaste is an unsettling climax. As this is clearly a PG13 horror film, you will be satisfied if you do not expect the pure venom of fear."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "mrskasper",
        "review_rating": "8",
        "review_title": "Ignore Bad Reviews",
        "review_detailed_main": "This is one of my go to movies on a lazy day. I'm a huge horror fan, and was extremely surprised at how beyond decent this one is since I had never heard of it the first time watching. More than worth a watch, sad and creepy concept with great execution."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "dennyyeng",
        "review_rating": "10",
        "review_title": "A Great Movie - definitely underrated",
        "review_detailed_main": "Great acting, great script, great scenery. Really nicely done! I don't know why this movie is so underrated. As for me I was quite pleased with it and would recommend it to anyone."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "nicolemmenzies",
        "review_rating": "9",
        "review_title": "Cliche but slammin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "meydiana-65242",
        "review_rating": "10",
        "review_title": "Tragic Accident",
        "review_detailed_main": "The movie story is so spooky and I love it. The movie is great to watch, I'd recommended it."
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Too slow and not scary at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "degsi",
        "review_rating": "",
        "review_title": "Painfully slow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3702652",
        "movie_name": "The Other Side of the Door",
        "movie_rating": "5.3",
        "review_username": "TheMagpieManor",
        "review_rating": "",
        "review_title": "Not bad",
        "review_detailed_main": ""
    }
]