[
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "IAjhawk",
        "review_rating": "3",
        "review_title": "Worst Football Movie I have seen",
        "review_detailed_main": "The movie is just bad. It might have to be that I am an American, but thought it was just a showcase how England football failure in the world cup. The green screen when the actors who would play with the national team was super cheesy.\n\nThis movie doesn't even follow the first two except a few characters. The first two I would give a seven they were more center on the characters and soccer scenes were more entertaining. The movie should have been center on finishing up the loose ends of Santiago, but it wasn't. There is nothing much to say. If your an England football fan I would still stay clear of this movie. This movie actually made me mad when watching it that it didn't follow the previous Goal! films. The first movie was called Goal! The Dream begins, but the dream hasn't even concluded yet."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "bunty-chea",
        "review_rating": "3",
        "review_title": "Prime example of how to disappoint fans",
        "review_detailed_main": "I'm only rating 3 stars instead of 1 is because as a stand-alone movie, it's a b grade film. As an ending to a GREAT storyline, this one is truly disappointing, borderline RAGE at the producer and director.\n\nWow, that is all i can say. With in the first 5 minutes i was totally lost. My first thought was, who the hell are these two blokes (charlie and Liam character)? Since then, i sat angrily watching a story about two characters that did not belong in the story line. I mean why, why, why end the trilogy killing of the storyline and character that many fans fell in love with and related to? Seriously, where was the original story line? Where was Roz and the baby, Glen Foy and Gavin Harris? I can understand that they might not have the budget to star the likes of Anna Friel or Stephen Dillane again, but they could have just gotten new actor/actresses. NOT a totally new story.\n\nBottom Line, this movie will not only disappoint you, but if you watched the first two, will anger and leave you dissatisfied by the ending of what i thought to be a great trilogy."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "simoncordt",
        "review_rating": "3",
        "review_title": "Goal 3",
        "review_detailed_main": "Well if you are expecting a continuation from the 1st & 2nd film think again, The original exploits of Santiago Muniz have nothing to do with this new film.\n\nGoal 3 centres around 2 new players with Muniz just floating around in the background my sons and I can some up in one word what we felt after watching the film GUTTED.\n\nYou have been warned!\n\nThe film is still worth a watch it has actors from the like of The Football Factory but to name a few so from that point its OK but we really wanted to see how Muniz's life panned out for him but this simply does not happen."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "adityashah1989",
        "review_rating": "1",
        "review_title": "This movie ruined the Goal franchise!",
        "review_detailed_main": "There is not a doubt in my mind why this came straight to DVD. It was an absolute awful film. With the central character from the first two movies Santiago Munez (Kuno Becker) being given a guest entry. The story line was laughable. I am almost sure that there was no script, they just went along as they shot it. The two main characters were just plain unlikable. The CGI, or the blue screen to fit the actors in the matches was extremely bad and low budget.\n\nThere was hardly any football in the movie. It was more like the story about the love life of two footballers. There was no build up or character development. The lines and the acting was awful. Santiago Munez, the wonder kid, suddenly becomes an average mid-table club player.\n\nFinally, the ending, oh the ending, it was disgusting and worse. If any of you value your time and most importantly money then please do not watch this movie. And this is not a \"Goal\" movie. They just used the franchise name to sell some DVD's."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "shanaboxer",
        "review_rating": "1",
        "review_title": "What happened to the munez story ?",
        "review_detailed_main": "I went into this film thinking that it would carry on from the first 2 goal films and be about the story of the brilliant mexian footballer santiago munez reaching the ultimate dream of playing in the world cup. Unfortunately he played very little part in this film. Not even kicking a ball in the world cup. This is hard to understand considering the first two movies were about him. Overall I thought the script for this movie was terrible compared to the first two which I enjoyed. There were so many times in which the story here just did not relate to what was seen in the first two movies and you ended up asking yourself \" hold on what about munez wife or , who is he I have never seen him before etc etc\" and you never really get a full explanation to these questions. There are some parts which are completely absurd, for instance, adams gets a taxi to see an ex girlfriend, he goes to pay the taxi driver and the taxi drivers says no it alright mate its for free. Adams says great I'll sort you out for tickets to see england in the world cup after the knockout stage. This sounds a reasonable thing to do. However you see the taxi driver and his friends 1) get into the VIP areas of the world cup games, 2)invited to Braithwaite funeral, 3) invited to adams wedding. I mean come it was a free taxi ride for god sake and suddenly your best man at the wedding. All in all I found the story boring and had no relation to the first two movies. The writers for this movie should be ashamed that they strayed so far away from the munez story of the first two movies. So my advice is if you think goal 3 will be anything like the first two movies then you will be bitterly disappointed as I was. With a script this bad It is no wonder some of the actors who played big parts in Goal 1 and 2 did not sign up for Goal 3. Verdit ----> miss at all costs"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "samantha_dean",
        "review_rating": "1",
        "review_title": "Complete Rubbish",
        "review_detailed_main": "I'm glad I didn't see this at the cinema or I'd have had to ask for my money back!! What happened to the great story line in the first 2 films?? We watched this to find out what happened to Santi and his wife being pregnant but she wasn't even mentioned, the whole story was brushed under the carpet in one line!! And what was with the weird trashy porno film set??? Its like they took a load of random ideas and stuck them together (not very well either!!) Have you seen how bad it looks when they use the real World Cup footage and stick the actors in front? I will say one thing, it did have us laughing.. but not for the right reasons!!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "LoodoYaye",
        "review_rating": "1",
        "review_title": "Don't bother watching it!",
        "review_detailed_main": "I would really like to know why someone thought this film is worth shooting. The only watchable part of the movie are some real footages from 2006 world cup and that's about it. Acting is horrible, script is horrible, the CGI is ridiculous,... I sincerely hope that this director and writers will not get a chance to film another movie. Don't watch this crap, it has nothing to do with a \"Goal\" franchise except for Santiago Munez (Kuno Becker) who appears to have something more like a guest-star role. I reckon he had to be in there due to some legal stuff. Anyone who enjoyed this movie is either related to someone who's in it or is still a teenager. Probably both.\n\nTotal waste of time. Go for a walk instead."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "freefinger",
        "review_rating": "1",
        "review_title": "What a major disappointment..",
        "review_detailed_main": "Sorry but this was a major disappointment in terms of the quality of the first two movies. I'M not a fan of soccer and I have to say that the first two movies were great, maybe in the top 5 sport movies ever made. This one, major flop! It doesn't even tie in with the other ones. For a trilogy to end like this with characters we don't care about, with Munêz not even a major character here is just bad. I mean where's Harris? Where's Fry?, the two new characters here Adams and Braithwaite just pop out of nowhere. And the action is bad.. very bad... Not one scene where you could believe they where really out there playing for real. The first two movies, you actually wondered if they filmed the scenes during the freaking games since they seemed so real! I loved it! I was hoping for the same quality here, didn't get it at all. I'm guessing the money ran out or just a very bad Director in Morahan. Also I guess that Butchart was the real writer here because the story in Goal 3 is lame.. very lame. Jefferies either got rid of this one in a few hours or he's just that bad. There's no soccer issue other than the drinking oh wow.. If you loved the first two, then don't watch this one, you'll be greatly disappointed. They took the soul of the 1 and 2 out. Gave Munêz a backseat and got rid of the rest of the cast. Even his line that lets us know about his relationship was what can be called some of the worst writing ever! Bad choice. We wanted an end to the story arc. They gave us a shitty conclusion to what seemed like a great continuity. Too bad. 1 star.."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "rb1401",
        "review_rating": "1",
        "review_title": "So Bad - I had to Write About it!",
        "review_detailed_main": "After 12 years of viewing IMDb on a very regular basis, this movie is the one that has compelled me to make my first review. I've seen many wonderful films during this time but not one has meant as much as this one to me. This is an atrocious film. Full of stereotypical characters, boring plot, little integration between the actors and real football footage, which was a strength in earlier versions. Furthermore, it doesn't appear to fit in at all with the two earlier parts of this trilogy, as the main character, Santiago is relegated to a supporting role and none of the people around him from the earlier parts have survived. You have a completely pointless set of Geordie fans which I guess were introduced to try and inject some humour to the tired plot. The acting is pitiful, the script is criminal and it was almost so bad, I could have watched it all over again, just to laugh at the total ineptitude. I awarded this film 1 - a first for me and I consider I was being far too generous."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "mighten",
        "review_rating": "1",
        "review_title": "Awful Awful Awful",
        "review_detailed_main": "don't want to bore you and go into loads of detail but this was a poor excuse for a movie. There are definitely some plants on this page trying to boost the scores and writing false reviews - don't be duped. It was pathetic. I am angry at myself for spending the time to check it out as I liked the first two Goal movies. This one didn't make any sense!\n\nSantiago is a bit part player - instead we are treated to a stereotype character overload, the alcoholic, the sleazy agent, the scorned footballers WAG.\n\nI would not recommend watching this film."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "ilsevanbroekhoven",
        "review_rating": "",
        "review_title": "goal 4???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "djames-31",
        "review_rating": "10",
        "review_title": "Best football film I've ever seen!!!",
        "review_detailed_main": "This is easily the best football film that I've ever seen. Its pretty much non-stop, never gets boring and is really well written and filmed. The acting's really great too, much better than I expected! Especially Liam and Charlie's characters, they made it feel like proper football matches, like your right there on the pitch with Rooney, Gerrard and Beckham! Made me and my mate want to get out and have a kick about strait away! Its definitely a good one to watch with a few mates on a night in with a couple of pizzas too. Proper good action and really involving. There's some well fit girls in it as well!!! Honestly, what more could you want?!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "praveen77",
        "review_rating": "6",
        "review_title": "Disappointing...",
        "review_detailed_main": "I managed to watch Goal 3 yesterday. As a die-hard football fan, and the fact that I loved the first Goal, I felt I had to. However, in the end it was a disappointment.\n\nThis is not to say that the movie was too bad. It was just that, as a fan of the Goal franchise, the movie was a terrible let down. The star of the first two movies, Santiago (Kuno Becker) was reduced to just an extended cameo, and it looked like he has even put on a bit of weight. They very conveniently manage to get him injured in the first half of the film, so that he wouldn't be able to play the world cup. Big mistake. Santiago's is the journey the viewers rooted for. He played in the premiership and then went to Real Madrid. Everyone wanted to watch him play the world cu. But probably the film makers decided that following Mexico at the world cup wont be too exciting. Which is why they got two Englishmen to play the lead this time. They are Charlie Braithwaite and Adams, both who play for Real Madrid, and who are supposedly Santiago's best friends. Which is where the problems start with Goal 3. There is absolutely no continuity from the first two goal movies. These guys are supposed to be Santi's best friends, but where were they till now? What happened to Santi's personal life, with the wife and kid? Only a passing reference is made to this. While focus is spent on the personal lives of the two Englishmen. Another problem with the movie. While I did not like the second Goal too much, as I felt they forsaked a good football plot and tried to hide the flaws by bombarding the watchers with glitzy images of Real Madrid players and stadium, this one seemed to almost relegate the world cup to the background. The biggest problem with the film was probably this. The film crew seems to have just added the existing footage from the last world cup, and with the use of some not so good CGI, merge the actors on the foreground of matches.And Santi seemed to be only intent o supporting England, rather than beat any of Mexico's matches.\n\nAs I said earlier, not a very bad movie (even the relatively unknown actors do a decent job), but unfortunately, it virtually disowns the Goal franchise and Santiago."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "umutaydin_au",
        "review_rating": "1",
        "review_title": "Goal 1 (Great!!!) - Goal 2 (Good setup for a 3rd) - Goal 3 (Is this Goal 3?)",
        "review_detailed_main": "What can I say which hasn't been already said? I was expecting this to be the HAT-TRICK; but a pile of NON-SENSE came out of the HAT.\n\nThis was supposed to be the ROCKY of soccer movies. Even low budget isn't an excuse for what I had watched.\n\nThe story is already there... Why try to invent something which has nothing to do with what GOAL is/was about? The movie started with 7-8 user rating on IMDb, which I believe were production people votes, family etc...\n\nOne of the comments which really struck me was \"If you thought the movie sucked that bad...why don't you shell out the cash and make one better...if you can't afford it then keep your mouth shut...\"\n\nWe do it by buying the DVD and paying for theater tickets, but please understand that we feel sad and extremely disappointed when film makers sorta pocket our money with jokes like this movie.\n\nA similar experience I had was Rocky 5, but Sylvester Stallone was man enough to say sorry to the fans and actually accepted that the movie was bad; but than he made Rocky 6 (Rocky Balboa) which was an epic ending in my opinion.\n\nSo just like The Rocky Story was saved, Goal can be saved with a real 3rd installation. However it will require producers who love the movie as much as the fans love it. Not people trying to make a quick buck!\n\nPS: Before submitting, I had a long coffee break and re-read my comments just in case I may have been unfair because of my fresh disappointment. Unfortunately I still stand by my words."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "one-two-many",
        "review_rating": "1",
        "review_title": "Worst film I've seen in a long time",
        "review_detailed_main": "Terrible film. Had higher expectations from the first two, even though I didn't fancy the second one as much as the first one. It's never been about cinematic perfection when it comes to the Goal-movies, but this picture was truly horrific in all possible ways.\n\nThey even try to make a lad look like Sven-Göran Eriksson by putting on glasses... Please...\n\nAnd what about the German soft porn shoot in the beginning of the film? Or the boring mates traveling in their trailer across Europe, meeting up with blond Scandinavian girls showing off their tits? I really can't see whats even slightly okay about this picture. Perhaps the Swedish goals against England in World Cup 2006, and perhaps Leo Gregory is a fine actor (loved him in 'Stoned'), but I wouldn't recommend this film to anyone. Anyone at all. If you love the game of football, do yourself the favor by not getting involved with Goal III."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "andrewbrock524",
        "review_rating": "1",
        "review_title": "Completely Ruined the Entire \"Goal!\" Series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "jf-afonso",
        "review_rating": "1",
        "review_title": "A Crime...",
        "review_detailed_main": "Well, I'm a football (soccer) fan since I can remember. Therefore, when I saw Goal! and Goal II, I was pleasantly surprised because I thought those were two good films about my favourite sport.\n\nAnd then, came Goal3...\n\nWhat I loved about the first two films it was the way the filmmakers combined football as the sport and football as a way of life. I flinched every time Kuno Becker kicked a ball (sincerely, he could have trained more) but I liked his character enough to ignore that little thing and enjoy his epic rise to stardom. I really liked characters like Roz, Glen and Gavin Harris because they added depth to the life of the main character. Hell, even Raúl, Beckham, and co. did a good job.\n\nThe third film simply doesn't have any connections with its \"distant and far superior cousins\" besides one of the characters. That character was supposed to be the heart of the trilogy but in this last movie he's simply a sidekick to a myriad of new characters of whom I found myself not giving a flying f*ck (pardon me...). Football in this movie gets 15 minutes of screen time and the special effects made me think \"Wow, they really wanted this film to suck!\". Roz, Gavin, Glen, where were they? The life of Santiago Muñez, how many questions left unanswered?? Even real life footballers had no part in this, it was just footage from the matches of the world cup!\n\nOK, it has drama (more über-drama), that made me, to say the least, watch the film until the end, a few nice goals from WC2006 and Swedish girls partying. And... that's it...\n\nThis film was able to make death-murder-kill to the end of the series, destroying what was good and completely creating awful things. A crime to a series that if done right, could have made football fans all over the world pretty happy and a few euros/pounds/dollars/etc. short..."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "spmsilva",
        "review_rating": "1",
        "review_title": "Very Disappointing",
        "review_detailed_main": "I am a big fan of the GOAL movies and I have been looking forward to the final of the trilogy so much so that I had tried researching the date of the movie release in anticipation of the third and final Chapter of Santiago Munez's (Kuno Beker) football career\n\nMovie begins -\n\n10min later and in almost utter boredom I continue to watch intently waiting to see what happened to Munez....\n\n45min later still nothing and Munez was but a shadow.\n\n60min my wife and I are dying of boredom,\n\nThere is no story line of Santiago Munez except for a few lines that should you not have seen Goal 1 and 2 you would see him as an ordinary character.\n\nThe story was all about England and two players that we have never heard of from the Previous two GOAL movies.\n\nThe story line was pathetic the acting was rubbish and even the computer effects were so obvious that it looked fake I probably could have done better with a home camera and some expensive software to edit the clips.\n\nWhat really gets to me is that I had collected the first two in anticipation of completing the trilogy.\n\nI guess that will never happen as I honestly wouldn't call this \"Goal 3\"\n\nHonestly whoever wrote the story line lost the plot and really wasted my time and other people's money in this movie, if this movie had made the cinema I would have asked for my money back.\n\nPlease take this movie off the market and make a proper ending to the trilogy that it so much deserves, and with the original cast members that gave the original 2 Goal movies it's heart and soul"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "chucho_s",
        "review_rating": "1",
        "review_title": "Do Not Watch This Movie",
        "review_detailed_main": "I mean it, if you have any taste at all don't watch this movie, it's a huge disrespect to the other two movies and to the viewers.\n\nIf you were expecting to watch the very kind, very lovable Santiago Munez wearing the green Mexican shirt, playing the most important games of his life in a world cup, competing against stars like Beckham or Messi or Cristiano Ronaldo you are up for an enormous disappointment.\n\nHe's just a very secondary character, instead the movie is about two English players that have absolutely nothing to do with the other movies, nor with the hole Goal! story.\n\nAbove all this the technology used for the parts of actual football playing is awful, no wonder this movie wasn't even shown in theaters.\n\nI'm still waiting for the director and producers to explain what the hell were they thinking about."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "alex_kimo",
        "review_rating": "1",
        "review_title": "This movie Sucks",
        "review_detailed_main": "I just finished watching this film and i have to say way to give up at the end.\n\ni mean here is the set up, a film about an aspiring football player that gets a chance to play in Europe against his fathers wishes, then he finds himself with the internal struggle to deal with his personal life now that he has become a more famous player and to top it off he just met his mom who abandoned him when he was a kid....good so far? then he gets injured and we watch a whole film about two other guys and their lives, one of them dies the other one gets married and the character we followed for two movies apparently lost the love of his life and still plays...but nothing more than that is said.\n\nso the character is sidelined (pun intended) and the film was shot with a digital camera...nothing wrong with it, but it looks more like a soap opera than an actual film.\n\nyou can clearly see which scenes are done with a green screen (a lot of them) and which ones where clips from the actual games.\n\ni really cant say more about it except that it sucks"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "user-16734",
        "review_rating": "2",
        "review_title": "Waste of time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "dmccrac814",
        "review_rating": "",
        "review_title": "Worst sequel ever!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "ayaydin_mehmet",
        "review_rating": "10",
        "review_title": "I like Santiago Nunez",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "booboobooboo1234",
        "review_rating": "7",
        "review_title": "good film",
        "review_detailed_main": "what made this film good for me was the fact i was at the premiere with all the england football team including David Beckham which for me was the highlight of the film as he was sitting directly behind me. i was also there with Leo Gregory, Tamer Hassan, Anya(June) and the producer.This is why for me it was amazing. There was some good and funny parts of the film it was well acted and a good story line but some parts for me were a bit far-fetched and some things happened a bit suddenly with out warning but it had a good ending although quite predictable. But its definitely worth a watch even if football isn't something your particularly into. I watch a lot of films and did enjoy it although i didn't think i would."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "sassu_bv",
        "review_rating": "1",
        "review_title": "disappointed ...",
        "review_detailed_main": "I am very disappointed ... seems a low budget movie .... the Romanian country presentation is wrong (not a country of Gypsies and PROSTITUTES)... What next?? GOAL IV with prostitutes??? Awkward way how Santos is out of book (in a car accident in which he breaks his hand, not being able to participate in World Cup)!Embarrassing to have destroyed all the expectations of fans of a beautiful series.The film must be named, in my humble opinion, \"I love England\", that is dedicated entirely to this nation.This movie that left me empty inside!It's not about football! It's just an ordinary drama that has as background a World Championship! And clearly, does not deserve to wear the name \"Goal III\" . Shame, shame on you! And another thing ... learn to write correctly in Romanian language!! Shame on you!! very bad movie ... not recommend!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "vbluechick1",
        "review_rating": "1",
        "review_title": "this movie was terrible",
        "review_detailed_main": "what the? this was by far the worst movie i have ever seen. i own the first and just purchased the second. i wanted to buy the 3rd, and thank god its not out yet because i called around looking for it. i am glad i got to watch it on the computer for free and didn't waste my time and money. what a waste of film. i loved the first and second, but this one had absolutely nothing to do with the first or the second. i mean what happened? what where these directors thinking? Santiago came out in this movie for what 10 minutes? i am so disappointed. i hope they remake this 3rd one because this one was a piece of well you know what. i am so glad no money was spent on this movie because i would not buy it in a million years. if it was given to me, i would throw it in the trash."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "gfaduck",
        "review_rating": "2",
        "review_title": "Disappointed.",
        "review_detailed_main": "After watching Goal 1 & 2 and being quite impressed this film take a severe dive in comparison.\n\nWaiting to see how Munez would fare in the World Cup we are subjected to two unknown footballers playing on the fringe of the England squad.\n\nIt also lets us down with the cameo's and the filming. Whereas the first two had parts filmed at football grounds with real fans and real footballers providing the atmosphere this one has gone to a cheaper \"green screen\" option which just looks tacky.\n\nA massive let down from a pretty good trilogy. Do not bother watching as you can get more entertainment watching Sunday league football at your local park for free."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "titans_rulz",
        "review_rating": "1",
        "review_title": "Complete and Utter Crap!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "juju_been2000",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "marton_robi",
        "review_rating": "1",
        "review_title": "A 'Shite' Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "chieh87",
        "review_rating": "1",
        "review_title": "Awful Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "ckfball13",
        "review_rating": "1",
        "review_title": "Terrible 3rd movie in this trilogy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "DICK STEEL",
        "review_rating": "",
        "review_title": "A Nutshell Review: Goal! III",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "homerjay-4",
        "review_rating": "10",
        "review_title": "most underrated film ever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "Saka61",
        "review_rating": "6",
        "review_title": "Not that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "info-19767",
        "review_rating": "1",
        "review_title": "GOAL! 3 - My 12yo son said watching it was a waste of electricity.",
        "review_detailed_main": "This movie is almost unwatchable. When my son and I watched GOAL! , a couple of years ago, we both enjoyed it immensely, especially on the big cinema screen. When GOAL!2 was released straight to DVD I thought, what a shame. Still, it was a nice continuation of a wonderful story. We waited patiently for the much anticipated release of GOAL3. The title suggests it is the conclusion of a Trilogy. Logically it should follow on from the previous 2 films, using the same characters, themes and storyline. GOAL!3 is not a sequel and has almost nothing in common with GOAL!1 and GOAL!2. Perhaps the studio was legally bound to release GOAL!3, but I wish they hadn't. It is clear that it was poorly conceived, badly scripted, and the acting is unconvincing. The trilogy has a basic flaw right from the beginning. If Munez was Portuguese instead of Mexican the writers might have been able to create a plausible story for GOAL!3. Instead they had to fashion a pathetic story line using totally new characters, relegating Santiago Munez to a cameo role, all because England did not play Mexico in the 2006 World Cup. England did however play Portugal in a match that ended England's chances at the title. Was Gavin Harris supposed to somehow play against Santiago at the World Cup? Given that Santiago had the starring role in 1 and 2, should this not continue in GOAL!3? This movie was marketed as Santiago's World Cup debut, playing for Mexico. In fact, Santiago doesn't play ANY football in this movie. Rather conveniently he had a broken arm! Three pivotal characters are nowhere to be seen in GOAL3; Gavin Harris, Santiago's girl friend and his manager, Glen Foy. So it is up to two previously unseen characters, to carry this boring movie to a slow death. In fact one of the two new characters doesn't even make it that far. In the movie he dies, probably because the money ran out. This is a low budget movie with a weak script, aimless story, poor acting and the green screen (crowd background) effect is laughable. On close examination there are many mistakes in this film, however substituting the lead actor (Kuno Becker) with 2 unknowns and then not following any themes from the first 2 films is the biggest one. The script included a totally out of place speech which he (Kuno Becker) delivered at a wedding in the last scene. It's embarrassing to watch a good actor being destroyed by such a bad movie. If anyone should be angry with the result it is Kuno Becker. Don't waste your time or money on this film! I give it no stars at all."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "godofallodds",
        "review_rating": "2",
        "review_title": "The worst sports movie ever made",
        "review_detailed_main": "When i saw goal was truly moved by the movie and went out and kicked a few. When i saw goal 2 I gave up playing football When i saw goal 3 I will never watch another match again!\n\nReally what was the director thinking...They have literally desultory the series, one which had good potential and i am sure santi wont be acting in goal 4 (if there is one) The Movie is really bad (spellin mistake is intentional) and do your self a favor.. download it and delete it !\n\nA sports movie is made to inspire you, this one wants you to take a sleeping pill (it will help you if u re planning to watch this movie)\n\nMY RATING- Don't watch the movie until you insomniac"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "msn83235502",
        "review_rating": "1",
        "review_title": "worst goal movie compared to previous series",
        "review_detailed_main": "this movie is awful. the worst in GOAL series. i definitely could fell asleep while watching. there is more on the life story rather than football action.this movie is bored to watch if u want some actions and football.it is more towards boring talking scene. i kinda frustrated with this movie actually. the football match also not as real as it is on GOAL and GOAL II.u can clearly see it is fake and very less real football star featured in this movie unlike previous series. yes u can see beckham in this movie, but the shot is took from real football match, it is not like they hired beckham to take part in the movie. kinda disappointed."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "un1",
        "review_rating": "1",
        "review_title": "Worse Movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "Rossco00115",
        "review_rating": "1",
        "review_title": "Offside",
        "review_detailed_main": "This film is as bad as Newcastle Utd. Really is like! Even has fat boy Mike Ashley as himself in it and he has the choice words of 'f-off' in it then he is never seen again is this load of nonsense of a movie! I really do think that people involved at Newcastle Utd have put money into this film as it has Newcastle tops everywhere in it. Sure it wouldn't be like them to throw good money after bad mind you ha ha. All in all an hour of my life wasted as this was all I could stand cause I couldn't stands no more. The rest of the reviews on here about the main lad not being in it hardly are all true and for the headers who say it's good are clearly glue-bags. all in all a mess"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "mrwb77",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "The most disappointing film ever made totally ruined the trilogy awful beyond words I can't understand why they made it at all. Better to have no 3rd movie than this steaming pile. The plot and characters are barely recognisable from the first 2 films and it's full of stock footage from the 2006 world cup. Santi barley features and the old characters are not even mentioned.\n\nI can only hope they have another go at this film in the future with the proper characters and plot and this film is put firmly in the garbage where it belongs.\n\nDo not waste your money."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "ethanjjacobs",
        "review_rating": "1",
        "review_title": "Wtf was this?",
        "review_detailed_main": "I never really give 1 star because I think it's exaggerating how bad it is most of the time. But this is by far the worst movie I have ever seen. Munez gets injured from the start? There's no football from munez and it's just the actual World Cup. What was the point in this film. There was absolutely no need."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "pedopete-37355",
        "review_rating": "1",
        "review_title": "Just why?",
        "review_detailed_main": "The worst movie I have ever seen in my life, after they did the first two films so well no one expected this trash. Green screen effects look like they've been done by a 5 year old"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "emanuelfuentes_12",
        "review_rating": "",
        "review_title": "Patience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "jetstreammatt",
        "review_rating": "9",
        "review_title": "Not bad...but it doesn't deserve worst soccer/football movie ever..",
        "review_detailed_main": "This is one goes out to the supposed American \"IAjhawk\"..... Any soccer loving person would disagree..... If you thought the movie sucked that bad...why don't you shell out the cash and make one better...if you can't afford it then keep your mouth shut...\n\nGet it through your head..football in America is played with pigskins and football in Europe (as we know it soccer) is playing with soccer balls...\n\nAny Company willing to shell out money to show the influence of a story like this is worth supporting....\n\nNo one told you had to watch it.."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "elliotwebb03",
        "review_rating": "6",
        "review_title": "Better than i thought it would be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "amirabosch",
        "review_rating": "1",
        "review_title": "Awwful!!!!",
        "review_detailed_main": "I absolutely loved the first two movies..... I was so excited to find out what happened with Santi and Rozz that I couldn't wait to get this movie, Goal 3. To my BIGGEST disappointment this movie had NOTHING to do with Goal 1 nor 2. Whole other story, new character n well Santi was a sideline guest barely in the movie?????? never mind anyone else we knew. I pretty much fast fwd thru most of the movie cause it was boring n I couldn't believe what i was watching. I hope that they make a Goal 4 because ALL the fans have been left hanging for years trying to find out what happens to Santi. I can only imagine how many more yrs will it be before the next one comes out."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "xarfilis",
        "review_rating": "1",
        "review_title": "Beckham didn't lost the penalty in the semi final",
        "review_detailed_main": "Come on you guys...You're a bit rough!!! The whole movie was made to make us forget that David Beckham the superstar the only one etc etc etc lost a critical penalty and send the ball to another stadium...Probably back in England :P OK let's see.No Santiago,No Gavin,No Roz and No football...I think that this movie should be named Sex and the W.a.g.y for real.I think that this movie is more about socializing(movies,flirt,sex) than anything else.So it's decided a wonder kid ended in Totenham(I love Totenham but we should keep it real) and maybe if we come to directors place he becomes a coach with no friends and wife...Oh and a kid that we don't know if it was ever born"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "neuticles",
        "review_rating": "1",
        "review_title": "Words can't describe how bad this movie is.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "jonesmp",
        "review_rating": "1",
        "review_title": "This Movie was so bad it made me angry...",
        "review_detailed_main": "It seems like they changed writers about halfway through the movie and the new writers had a drug problem. Or they ran out of budget and had to finish the remaining scenes in an afternoon in the producer's house.\n\nThe movie starts out OK, but goes off a cliff about halfway through. Like a David Lynch flick without the hot girls getting naked.\n\nEveryone who was in this movie should be on the blacklist. I felt trapped as the movie took stupid turn after stupid turn. After seeing the first two goal movies, I was looking forward to seeing how the story ended. It seemed Kuno Becker's role was marginalized and most of the favorite characters were absent from the original. David Beckham makes another appearance, but it appeared he had to hold his nose throughout the filming."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "nedim-sahovic",
        "review_rating": "1",
        "review_title": "This is incredible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "sacredmonkey",
        "review_rating": "1",
        "review_title": "less than a disappointment, i want my money back",
        "review_detailed_main": "firstly the synopsis that is written on the back of the DVD cover says that our man Santiago Munez is going to battle it out against the two new characters in the world cup. This only ever happens in a mock advertisement at the beginning of the film which leads me to the next thing wrong with the film the VFX.\n\nwhat can i say the green screen i so unbelievably awful it make porn vfx look good.\n\nEssentially its the Santiago story arc continued through one of the new characters 'Adams', and Santiago has been made into a second rate character.\n\nthis film is more a incredibly major disappointment than a 1 star film. By itself as a film its maybe 2 stars"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "fdegiorgio",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "I did not like this one from the beginning. The actors look like they are from the 90's plus the story does not continue with the previous 2... whats the point of saying \"to be continued \" in goal 2... we never new if santi went back with his previous pregnant girlfriend either. So disappointed!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "Manihikki",
        "review_rating": "1",
        "review_title": "Still wondering what was that!",
        "review_detailed_main": "This has to be the worst film I have ever watched by a huge margin. There's moments.., lots of them in which you wonder wether they're trying to make you cry or maybe they're trying to make you laugh. Anyway the doubt will live up since nothing is funny nor emotional.\n\nThe script is as bad as it can get or even worse than that. Acting is ridiculous and if you are expecting to watch some nice pitch action, you better look somewhere else. You will get some scattered real matches highlights which you can see anytime on youtube and any moment the two main characters get into action, the look hilarious.\n\nIf you are looking for a drama-emotional movie, this is not for you. If your are looking for a early afternoon funny entertaning movie, this is not for you. And to make things worse, if you are a football geek looking for an at least fine football movie, this is absolutely not for you."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "pedz-pedronio",
        "review_rating": "1",
        "review_title": "this movie sucked!!",
        "review_detailed_main": "BOOOOOOO!!! this movie is f**k..Kuno Becker is just a guest in this movie!! to the director and writers what the hell are you thinking??!! nothing to do with goal 1 and 2..nonsense movie,DON'T WATCH GOAL 3!!! the original cast from goal 1 and 2 was not part of the movie,they featured all new actors and the story was nonsense. They should not produced this movie they only wasted some money or is there a budget for this movie because it su**ed!! if there s below 1 in the rating i will give click it..BOOOOOOOO!!! Fu**ing movie,idiot director and writers. Santi was nowhere to be found in this film, he did not even play a single game. He was injured just the beginning of the film."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "rodelio_diablo",
        "review_rating": "1",
        "review_title": "worst piece of trash EVER !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "belfast7",
        "review_rating": "1",
        "review_title": "That was bleeding awful!!!!",
        "review_detailed_main": "Goal 1 and 2 may not be as amazing as the greatest footballing film Victory (Escape to Victory in UK) but they clearly capture the passion of the sport. Although number 2 clearly emphasized a bit too much personal drama that detracted from the overall sporting aspect of the film, the football still seemed real. This film spent too much time on drama and the football was, well, great if you wanted to watch World Cup highlights. The Braithwaite and Adams goal looked like something a five year old drew up on an etch-a-sketch. My only hope is that someone at Milkshake reads this and makes a true and fitting conclusion to this franchise. Bring Santi back to UK to play some real football, close the loop with Roz, Let us know what happen to Gavin Harris even if he is \"shite\". Don't ruin a great run with a a flop like a England loss to Liechtenstein. Avoid this film if you want to preserve your love of this story. Goal -3 cancels out Goal 1+2 equaling 0. Try again and finish in the positives."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "agatagrundt",
        "review_rating": "1",
        "review_title": "What a waste of Money",
        "review_detailed_main": "Ohhhhhhh my Gawdddd, I cant believe that I wasted my money paying to reserve this movie so that I could get it in the mail as soon as it came out (Prob 1st buyer in Canada) I was so excited to see what the 3rd part of the movie would bring and was seriously disappointed. What happened to Santiago's fiancé? I do believe that she was pregnant at the end of Goal 2 and what? the writers just decided to drop that idea and go with the plot of the dramatic lives of two other footballers that had absolutely nothing to do with the first two movies Talk about a complete twist of events you can tell that there was not enough funding for this movie as there was for the first two Becker- if I were you I would be completely P-O'd not only for yourself but for the fans that loved Parts I and II and were seriously ripped off with III. Hopefully there will be a fourth part that can finally carry out the the first two and tell us all what actually happens with Munez's life and his ex fiancé/child."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "wedgewilson",
        "review_rating": "1",
        "review_title": "Offensive to the goal franchise",
        "review_detailed_main": "If you have spare time on your hands and you want to watch tv I advise you would be better off watching peppa pig than this nonsense I have never witnessed cgi in this shocking state , was looking forward to number 3 where we would see Santiago munez continue with his career but no \"Charlie Braithwaite and Liam Adams \" appear out of no where , gavin Harris was thrown in the bin for these two ppl we never heard of and I believe me and my friend saw Santiago In the film maybe 5-7 times, don't put him on the front cover as the main person of u won't even give him 5 mins of screen time, the actor was special to fans of the goal franchise and we end up watching two people we have never heard of be cut into actual FIFA WORLD CUP highlights on what appears to be a green screen a TikToker may use ? The ending will make you laugh , not they way you wNt"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "mikedbrown76",
        "review_rating": "1",
        "review_title": "really bad!",
        "review_detailed_main": "I watched this even after reading all the negative reviews thinking it couldn't be THAT bad. Well it is!! The main character of these movies is barely part of the plot. There is hardly any game play. I don't get how this movie was even made. Who with the movie production thought anyone would like this??"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "lou_zer1",
        "review_rating": "2",
        "review_title": "Bad filming, poor script and story, too tacky",
        "review_detailed_main": "This franchise has just gone down the crapper. I'm sorry, but Milkshake Productions did all they could to milk this Santiago storyline but it just gets worse and worse.\n\nEven though Goal 2 was really tacky and cheesy, it had big names and good soccer scenes and focused on Santiago Munoz. When you watch Goal 3 you're like \"WTF?!?\". It totally breaks away from Santiago and focuses on 2 other guys (who cares?). You're almost thinking that this Director did not even see the first 2 films.\n\nAnd they went really cheap on the special effects. You could easily tell that the soccer scenes with the 2 main characters for England were not authentic, and did not blend in well. They showed shots from England games w/ Beckham and you could easily tell there was differentiation. I figured they could probably salvage Goal 2 but this one really hit the crapper. It was so bad and offbeat from the 1st two that I had to constantly fast forward through scenes - too cheesy or didn't make sense, or horrible acting, or bad script.\n\nSo disappointing! Munoz breaks his arm and that's IT! Nothing for him but watching games with a cast?!? WTF? This movie should get a Razzberry for sure!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "runslowly2",
        "review_rating": "1",
        "review_title": "a step too far",
        "review_detailed_main": "in the previous goal it finishes by saying to continue as we were getting engaged with the story of Santiago. however this movie absolutely nothing to do with the story and is utter crap, the end to the brilliant story. and plus the the hottest girl gets with the ugliest man and she makes money so she isn't a dumb gold digger! there is so much wrong with this movie!\n\njust don't waste your time on watching this movie if you love the original goals then you will hate this, Roz isn't in it and Santiago has like 5 lines in the whole thing. waste of time and money if you ask me. and i spent more time wondering if this is a adult movie or football with the amount of sex in it. overall it was very poorly done, the actual game play is worse. they have attractive girls though but the acting is poor through out. no story line, it just seems to go where it wants when it wants"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "shaunbc",
        "review_rating": "1",
        "review_title": ".Pure Rubbish - My true rating would be negative 0...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "ntripunovski",
        "review_rating": "1",
        "review_title": "Goal 3...... The director should throw himself out of the window",
        "review_detailed_main": "I lost words... What a crap... SANTI is what I'm interested in... Not some other guys of whoom the better guy dies... This was another movie not the third part of Goal... First part was about Santi making his dream come true and start playing professional football in England in Newcastle, Second was signing for Real Madrid and THIRD part supposed to be about Mexico and Santi loosing the cup but signing for United and winning the CL... WHAT A DISASTER... And who are the other guys... And what about that porno type movie... And in Romania every family have a color TV. They are not people who need to go to there sister house to watch football... And if one player comes off the field (Joe Cole) instead of the star character (which was not SANTI)that same player can not be on the field again when Beckham scores the freekick against Ecuador.... All in ALL.... Don't WATCH THIS MOVIE IF YOU WANT TO LIVE HAPPILY WATCHING GOAL 1 AND 2"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "casper1005",
        "review_rating": "1",
        "review_title": "Probably the worst film I have ever seen..... no word of a lie!!!",
        "review_detailed_main": "I gave this film a 1 out of 10 and i really think that even this is being extremely generous.\n\nI hugely enjoyed Goal I and Goal II, more so Goal II. And have been excited for the third film ever since I saw Goal I.\n\nThere was a huge lack of professional players which they had in Goal II, and gave a poor attempt with lookalikes.\n\nThe film became mainly about Charlie and Liam, both of which we have never met before, and Santiago's part in the film was much too small. It also missed key characters such as Roz, Glenn Foy & Gavin Harris, and when Santi was asked about Roz he seemed to simply dismiss her with no mention of what happened between them.\n\nThis trilogy started being about Santi, and his love of football, and the twists along the way, in Goal III they have lost all sense of this and instead showed us things that fans of Goal, did not start watching this trilogy for.\n\nThe writer's especially should take most of the blame; but also the casting was shocking, as none of the new actors could ever pass for footballers!\n\nIn conclusion, a really poor way to end what was a fantastic beginning, I would have preferred this film was never made in truth."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "Marseille",
        "review_rating": "1",
        "review_title": "The reviews speak it all",
        "review_detailed_main": "In sum, this is one of the most overrated film here which scores a 3 out of 10. Just scroll down to read a few reviews you can find what an awful crap the director & producers have done. Low budget is never an excuse for bad work. Having seen Goal I & II, you would doubt whether these reviews could possibly be fair. While real-life big teams like Liverpool and Newcastle United participated in the making of the first two movies, this one simply goes for comic key. I would not discourage anyone, like others do, to take a look at it. Observing how bad a sequel could be made and released is not exactly a waste of time after all."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "corne-11",
        "review_rating": "1",
        "review_title": "I hope the do a real 3rd part , not this horrible movie!!!!",
        "review_detailed_main": "I think a one as punctuation to this movie is too much, I can put to this negative or a zero I do it.\n\nI loved the first and the second Goal! movies. I was expecting anxious the third part and it wasn't this movie... I hope they do a completely new goal 3 movie. I would like to know how the life of Santiago and Harris continues.... This movie is one of the worst movies I saw! ... I hope to be able to see the real trilogy someday... but deleting this mistake.\n\nFortunately I didn't see it on the Cinemas. If you liked the first two Goal movies you should not see this one, it is destroying the reputation of the other 2. It has not the quality of the production, a completely different story, etc., etc. ... I am very angry and disappointed!!!\n\nKuno Becker shouldn't have acted in this film, his presence on the movie makes you think that it is about Santiago... and it is a completely different story.\n\nIf I could ask them for the money back for the renting of the movie I will do it... Please don't see this movie... you deserve use your time in something more interesting."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "pennywoods",
        "review_rating": "1",
        "review_title": "Eclipse of the Goal episode",
        "review_detailed_main": "Being IMDb readers for years, I would not imagine my first ever report will be on this awful film. 4 years of Goal series, what a ridiculous finish! \"The Dream Begins\" was amazing; \"Living the Dream\" was not as good, but still fabulous; this \"Taking on the World\", we all now understood the producer is really trying to \"taking on the world\"! Where is the filming-sponsor from FIFA? (I understand Newcastle has no money as being regulated to Championship, but if Real Madrid can spend 10% of C9's transfer fee into this film, it will not be as bad as this disaster.) Where are Roz and Gavin? Why Santiago is fatten? Is it a sequela from being in Real Madrid like the old Ronaldo? Give me back the skin-headed wonder boy! Give me back the real GOAL!!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "dalby316",
        "review_rating": "1",
        "review_title": "When people ask you what the worst film you have ever seen is...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "andyutd97",
        "review_rating": "2",
        "review_title": "Save Your Money, Don't Buy It",
        "review_detailed_main": "The worst sequel I've ever seen.\n\nI read the 3rd book before the film and still didn't have a clue what was happening.\n\nMost of the cast have been cut and new characters aren't properly introduced.\n\nThe plot is painstakingly weak and the final film will lower you memories of the previous 2 great films.\n\nKuno Becker doesn't look like the same person yet he is the only recognisable member of the cast.\n\nTake my advice don't buy it buy the book"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "jcalderone13",
        "review_rating": "1",
        "review_title": "goal 3",
        "review_detailed_main": "why did they destroy this trilogy, it was goal that made me fall in love with football, and this movie literally made me throw up, it was terrible the worst movie ever made, id rather watch barney for 2 hrs straight. the trailer even sucked and who gives a rats a** about these other 2 guys, I'm glad he died in the movie .If I were Kuno Becker i would have not signed on to this movie, did he read the script what a sh***y movie. For me goal 2 was the end to this trilogy. I wouldn't even waste hard drive space for this piece of crap. they should call it \"crap 3\"\n\nPlease remake goal 3 please bring back the old cast please use the director from goal2 and the writer as well please\n\nremake Goal 3"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "azeemsheikh28",
        "review_rating": "3",
        "review_title": "The final installment whereby the kid who we saw come up through the ranks now gets injured and takes a back seat",
        "review_detailed_main": "England crash out of the World Cup on penalties, one of the players dies, and there's even some fetish vampires and midgets, for the kids.\n\nThey should have stayed with just the first 2 and Kuno Becker should have stayed with no hair, he looks hideous loll.\n\nStill a good movie for soccer fans, more story in this one than soccer action.\n\nI loved the first two but this one ugh this I HATED!\n\nThe movie is supposed to be about Santiago Munez (Kuno Becker) and what happened after the second one but this is just crap! I couldn't even finish watching it thats how bad it was.\n\nmisses the charm of the first 2 episodes...\n\nTo much green screen and a less interesting lead character makes Goal III a disappointing end of this soccer-trilogy"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "Radish4ever",
        "review_rating": "1",
        "review_title": "Dreadful - misses the goal by a mile.",
        "review_detailed_main": "Apart from a brief cameo from our hero from the previous two films - feels unconnected. GOAL was very good - GOAL 2 was a lot of fun - using footage of the game in which Arsenal BEAT Real Madrid to show them losing to that very team in the Champions league final was a great touch - and action star Rutger Hauer miscast as the Real Madrid manager is hilarious (was Bruce Willis unavailable?) a lot of fun. But GOAL 3 - YUK !! There was a gap between parts 2 and 3 of the Trilogy (and I use that term lightly), did they think footage of Mexico winning the word cup was a long shot? If they had held on longer though - they could have made the film with footage of Mexico winning a gold medal at the 2012 London Olympics instead? Anything but this rubbish.\n\n1 out of 10 - pointless film with character's you have difficulty relating too or even liking - Poor end to what could have been the best Football trilogy ever..Thanks to GOAL 3 - it misses its goal !!!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "mala-12",
        "review_rating": "1",
        "review_title": "even Newcastle United couldn't do anything this bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "lozzataylor1999",
        "review_rating": "1",
        "review_title": "May contain spoilers",
        "review_detailed_main": "I haven't seen the film but I've read the plot and it looks awful. There's no way I'll buy Goal 3 on DVD.\n\nAs a Newcastle fan, the first film was my favorite, the second one wasn't quite as good (I'm being biased however) but it was brilliant. However, after reading the plot for the third movie, it looks really bad. The film producers have completely changed everything and instead of taking part in football's biggest ever competition, Santiago sits out through injury. There's also no Gavin (who retired even though it was revealed in Goal 2 he became 29, which is too young to retire in my opinion), Roz (Goal 2 revealed she became pregnant) or Glen (who got sacked by Santi in Goal 2). The two main characters in the film are two English footballers (one of them sadly dies during the film) who no'one had ever heard of, also a bald man is used for Sven-Goran Eriksson (who appeared at a party in Goal). If I was to make it, I'd have group draws that would mean the possibility of Mexico playing Brazil in the final (but try to make it as similar as possible so they can continue to use real matches) as well as England beating Germany in the third place play- off after losing to Brazil in the semi-finals. In the final, I'd have Santi scoring a hat-trick to help Mexico come from 2-0 down to beat Brazil 3-2 and him becoming player of the tournament with Gavin doing similar to what Paolo Rossi did in the 1982 World Cup (apart from the fact he helped Italy win it) and struggle in the group games before scoring tons of goals in the knock-out stages to become joint top scorer with Santi (who'd win the golden boot with more assists). Before the tournament after the squads are picked, I'd have Santi visiting Roz in Newcastle for a few days before meeting up with the Mexican squad whilst Santi says \"RIP Dad\" after his winner in the final."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "malliachristopher",
        "review_rating": "1",
        "review_title": "Trilogy Ruined!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "tomak14",
        "review_rating": "1",
        "review_title": "Goal 1 and 2 great Goal 3 Terrible",
        "review_detailed_main": "As I started watching the film I was expecting to see the same sort of action as from the previous two films. Unfortunately right from the start I noticed that the use of very cheap 'Weather forecast' green screen instantly put me off and I was starting to worry that the film would be like that all the way through. The narrative of the film was very shallow and there was barely any character development. The main hero of the previous two films, Santi was just a second plan role and was overtaken by the characters of JJ Feil and Leo Gregory, two English players playing alongside our prime hero at Real Madrid (because that's realistic).Anyways they were the main focus of the narrative in this film but to be honest it was a very poorly thought of screenplay. First of all why would a football player or shall I say star as he was viewed, be asked to play any kind of role in a film especially one filmed somewhere in Romania by a low time director who clearly has no clue of what his doing. Well thats basically the input of Charlie (Leo Gregory) into the narrative other than him falling in love with on of the actresses in the film and proposing her after just two weeks. The second, more controversial character Liam (JJ Feilds) is an alcohol and sex addict, who finds out that one of his previous girlfriends has had his baby, which makes him reconsider his future. And finally the character of Santiago Munez (Kuno Becker). He was the main character in the previous two films, and for some ridiculous reason the best actor in the cast, the trademark of Goal films get a second plan role, Why I ask ?! It seems as though he is completely discarded from the film, as if he is needed no more. But as we have seen from so many great sequels, the main hero always stays the main hero (Indian Jones, Transformers, Rambo etc) and it is that character who brings the audience to the cinema. Maybe this is what the director thought 'Lets include Kuno's character in the film, people will come to see it because he was in the previous two'. And yeah, possibly but the inclusion of the two 'clowns' made the film boring and senseless, without any kind of resolution.\n\nIt is good that we see the lives of the football players outside the football pitch, but come on this is a film about football, so where is all the on field action, which was present in the films two predecessors. In my opinion Andrew Morahan (the director) concentrated too much on creating a more family friendly movie, and distanced its 'dreaming young boy' audience from it by creating this kind of narrative. But the Director was thinking well again. He used the trademark title and made sure he included some football scenes in it, or on the case of the DVD and in the trailer shall I say. Anyways this would be acceptable and appealing to the TA, possibly making the film a success.\n\nBut overall the film was an utter disappointment and I felt sorry for myself after watching it and wasting the 1.30h of my free time"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "potochanje",
        "review_rating": "1",
        "review_title": "Where is a judge?",
        "review_detailed_main": "It is such a crime calling this \"movie\" 3rd part of, well, nice movies if u like football. Story is so \"ill\", characters not so accurate, movie follows some World Cup with bad implements of characters on it. Than some so unimportant characters, I mean, not to go farther, really an mess of movie. I feel so sorry for guy acting Santiago Munez that needed to show up on this part. I mean, I hope he took some good money, because everything else will be so embarrassing. Putting that nice girl in it wont help u save this awful movie. Please, if someone is reading this reviews, such as I didn't, do not watch it at all. Imagine there are only 2 parts of movie called \"Goal\". Thx"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "omarsnk",
        "review_rating": "1",
        "review_title": "ABOMINATION",
        "review_detailed_main": "I AM AT A LOSS FOR WORDS HOW BAD THIS MOVIE WAS. I WATCHED IT YEARS AGO & IT STILL LEAVES A BAD TASTE IN MY MOUTH. NEVER AGAIN!!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "tnkham",
        "review_rating": "1",
        "review_title": "Red card for being awful!",
        "review_detailed_main": "Not so much a feature length film but an episode from a daytime soap opera. This film is terrible! The acting talent is almost as bad as the script, or lack of. Any sense of passion and feeling that the first two films evoked have been washed away for a quick turn around and profit by using the name of the franchise. The title character Santiago Muniz can barely even be considered to appear as a cameo. 96 horrendous minutes of stock footage from various football matches, mashed together with green screen actors trying their hardest to fake any form of talent and emotion."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "solano-82",
        "review_rating": "1",
        "review_title": "Wow and I thought that The Spirit was the worst movie for 2009!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "empirefan",
        "review_rating": "1",
        "review_title": "Avoid",
        "review_detailed_main": "Diabolical. Imagine Warner Brothers following Batman Begins & The Dark Knight with a film entitled Batman : Behind The Mask. They shoot on a minute budget, get Christian Bale in for half an hour to cameo, then shoot an entirely different plot, not about Batman, but featuring some other hero (let's call him Shiteman). It'll be awful, but because of the title it will still make loads of money for them. I consider the makers of this film guilty of the theft of my money and time, and the murder of Santiago Munez.\n\nIn all, the worst 90 minutes of my life since last season at Ewood Park."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "nicindyc",
        "review_rating": "1",
        "review_title": "Do not Watch!",
        "review_detailed_main": "I'll put it simple so I make sure everyone reads: Keep the story hanging like it is from Goal 2, make your own endings, because this sequel is going to ruin all the good times from the first one."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "roryw-1",
        "review_rating": "1",
        "review_title": "Why substitute Munez?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "golazo",
        "review_rating": "1",
        "review_title": "La Pelicula Goal 3 Que P2 Que Paso Con la Historia Que Todos Esperabamos",
        "review_detailed_main": "Began in earnest to have to subscribe to IMDb until CELL give my number to be able to say that this movie is a Basque seriously something I expected something better, it's like watching Rambo 1 Rambo 2 and then after that, it meets a couple of friends and breaks his hand and the role is to peel it and neither FART Ching, is a rocky 1 rocky 2 and one where it breaks and has to see her two Cuates make the ridiculous lack of professionalism that really Waiting for more. Your opinions? well I wrote this in Spanish this website will not take Spanish any ways goto my site to see the real comment about these movie which really SUCKS no question about it.\n\nhttp://www.zonadegol.com/golforum/tm.aspx?m=38"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "divit_king1",
        "review_rating": "3",
        "review_title": "Goal 3 was...different",
        "review_detailed_main": "Yes, the movie was pretty disappointing after seeing the first two, but I almost have to wonder if they had a new director for the third movie. If you watch the end of Goal 2, you can see that Rose is pregnant, and when I saw that June had a kid (and looked relatively similar), I feel as though they changed some things up. This is how I viewed the movie:\n\n1. Liam Adams is supposed to be Gavin Harris -The reason I say this is because at the end of Goal 2, Santiago asked for Gavin to get the start over himself, to give himself a shot at getting onto the world cup team. As you may recall, Gavin performed poorly at the start, but turned it on near the end, making his spot on the team \"questionable\". Liam is portrayed as an \"older\" footballer with a questionable future ahead of him. In Goal 2, there was a scene where Gavin is in the bathtub and Santiago walks in on him. He has cream on his face, because he was trying to get rid of his wrinkles (getting older). He mentioned that his contract was up at the end of the season, which Liam's was as well. When Liam found out that he (and Charlie) made the England squad, they were ecstatic, as would Gavin have been. Another clue to this is that they said that Liam was heading back to Newcastle where he (and Santiago) had been teammates before (sound familiar). The last connection is the drinking and partying personality. Both Liam and Gavin loved to drink and get the ladies. They mentioned at one point in Goal 3 that the reason Liam was so iffy was because of his lifestyle, similar to what he was told at Real Madrid in Goal 2.\n\n2. Liam's love story is actually supposed to be Santiago's -As stated before, if you look closely enough at Rose at the end of Goal 2 (when Santiago calls her), you can tell that she is pregnant. I think that is part of the reason why she is so hesitant to get back together with Santiago. Also, I remember Rose telling Santiago that she had \"daddy\" issues in the past with her father being in a band that had their fifteen minutes of fame. In Goal 3, June says that the reason she was so protective of her child was because either (1) she wanted her daughter's father to be present all the time, or (2) for him to never be there. This to me sounds very familiar to the Rose we all loved in the first two Goal movies.)--The only thing going against this theory is that when Santiago is talking to Charlie's fiancé in the press box, he mentions that loved once but messed it up.\n\nOverall, the movie was pretty poor, and it seemed as though there was in fact budget cuts or something that caused this movie to be sub par to the first two Goal movies. I personally think that there was a director or writer change that didn't do his homework (study the first two movies) before filming this, and just took it in an awkwardly different direction. The movie seemed to go in every direction, but as mentioned in some previous posts, at least there was the Charlie/Sophia love story that made some sense (the fact that no earlier plot made it confusing to understand).\n\nHopefully this clears some questions up about the movie, and feel free to reply and add other similarities that I forgot to mention."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "englandsoccerrules",
        "review_rating": "1",
        "review_title": "rubbish",
        "review_detailed_main": "why would they say \"to be continued\" at the end of Goal 2 if they weren't going to continue it? This movie is absolutely terrible, if they were going to change things so much they should have just made a spin-off movie, which in reality they did. However, this had an introduction of plenty of new characters whose story lines were boring at best. Santiago Munez is barely even in the movie, and he's the series title character. I absolutely loved the first two and I could not wait for this one. What a a complete and utter disappointment! I wish I had never sought this film out to watch and I just left it at the cliffhanger that was Goal II's ending..."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "alwaysfun123",
        "review_rating": "3",
        "review_title": "WHAT??? I waited two years in the USA to see this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "zappy91",
        "review_rating": "2",
        "review_title": "Bad mistakes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "davideisaura",
        "review_rating": "3",
        "review_title": "Don't watch it. This isn't a sequel to Goal 2; it's a spin off (ripoff?)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "mkaide",
        "review_rating": "1",
        "review_title": "Your time is your most valuable commodity, don't waste a second of it on this tripe.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "baileymufc",
        "review_rating": "3",
        "review_title": "Shock",
        "review_detailed_main": "I have t say that I watched the first 2 movies and I enjoyed both of them but I didn't think they were out of this world but at least it was watchable. After the second film I was hoping that they make a third film because the second film was unfinished all the stories with Santi and Roz gave me something to look forward to. Having watched the third film now I have to say I was shocked for many reasons: 1, Inclusion of two new characters who we have never heard of before 2, Awful CGI used in the film 3, The fact that we never see the likes of Gavin,Roz and Glen 4, Poor storyline 5, Seeing Santi only for couple of scenes If there is anyone on there way to a shop to buy this film than let me tell you that you are making the mistake of your life."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "sree-howlett",
        "review_rating": "1",
        "review_title": "Why ?",
        "review_detailed_main": "This movie destroyed what the first 2 movies had built. Except for Kuno, none of the original cast was in the movie. They were the important characters behind the story of this footballer. Why the main character Santiago (Kuno) was sidelined and the story followed the lives of two footballers who were introduced to us in this movie. It was the same writer who had written the previous films, wrote this unnecessary garbage of a film. After all that wait to see the storyline set at the world cup, the wait was not worth it. We will never find out if Santiago plays for England or Mexico or USA. We will never know if Santiago will get back to this love interest and their yet to be born child. We will never know if he will make his manager and well wisher proud (from the first two films played by Stephen Dillane as Glen Foy, an important character in the GOAL movie universe.) All Goal fans ARE disappointed ! We demand a proper ending for the series. Those of you planning to watch this movie, please don't. GOAL 1 and 2 are the only movies that follow a proper narrative. This one does not follow the storyline and doesn't even explain why ? (except for some cheap bits like Kuno just saying how he knows to be loved and didn't bother to care for his lover) DANG! How does that explain anything!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "p-hartman",
        "review_rating": "2",
        "review_title": "Believe the bad reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "caglar-arslaner",
        "review_rating": "4",
        "review_title": "Is that the 3rd Movie of Goal's Trilogy ?",
        "review_detailed_main": "When i first saw on the net that \"Goal III\" had released; i was really excited and immediately i wanted to watch it, and unfortunately i did so. I really wondered How Munez would react in the World Cup, but the movie including anything about Munez' World Cup Career and Munez is just 3rd or 4th main character in the movie.\n\nDuring first two Goal movie i was so much more excited than the 3rd one. First two Goal movie brought me good expectations but the 3rd one did not make me excited.\n\nAs a football movie, i can say \"what a disappointment!\" But as a romantic movie, \"could be watched\""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "lobo_rib",
        "review_rating": "3",
        "review_title": "worst piece of crap i ever seen",
        "review_detailed_main": "What happened to this sequel? I guess it can't be called a sequel 'cos it doesn't have anything to do with the previous ones! No storyline at all and the acting was horrible! The main character from the first 2 movies (Santiago Nunez) doesn't participate much in the story making him almost a figurine. What was in the directors minds to release this crap to the cinema? This movie shows disgrace after disgrace and a little bit of negativism from the characters, almost looking like a soap opera but with a very bad quality in the acting and the script! If you're a fan of Goal movies please do yourself a favour and don't watch this one! You will be extremely disappointed!"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "hammer_down",
        "review_rating": "1",
        "review_title": "Why did we leave the main characters?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "kagouk",
        "review_rating": "1",
        "review_title": "Absolute Rip-off",
        "review_detailed_main": "Fire the director, fire the writer. What a dose of Rubbish. Watched the first two they were fantastic, could not wait till this came out. How dare they come out with this rubbish, Santi is in it for about 15 minutes, its all about two England players. They cannot help themselves was surprised we never saw anything from 66 what a rip-off. They advertised on the cover gerrard beckham ronaldo's but they are only in it because it was clips from the 2006 world cup. I can only hope that someone can see what a mess was made of goal 3 and have a look at the other films and do it justice and rewrite the whole film again. I would love to know how it goes for Santi and his family and his career after all that was the purpose of the film. SHOULD HAVE NAMED THE FILM DEFLECTED GOAL"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "catalinho_steaua",
        "review_rating": "1",
        "review_title": "Disappointment",
        "review_detailed_main": "I don't understand why they left us like that...\n\nThe second part of the movie(goal 2) ends silly,an they left us believe that the story of Santiago Munez will continue not the other 2 guys,Charlie and Liam...\n\nHe didn't even re-conciliate with Roz and Glen... That's the biggest disappointment...\n\nI hope that will appear \"Goal 4\" to continue his story... And most of all,this story isn't based on football,but more on Liam's life and problems with his doter and his future wife...i know that England was eliminated by Portugal at that World Cup,but they could make an effort and make them win in the movie..."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "scott-cowley",
        "review_rating": "1",
        "review_title": "Worst ending to a trilogy",
        "review_detailed_main": "What even did I just watch? The first 2 movies were great! This one was trash"
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "TomCruiseFan99",
        "review_rating": "1",
        "review_title": "Atrocious!!! So much for the perfect football trilogy.",
        "review_detailed_main": "Avoid at all costs. The only connection to the previous stories are Santi being in this one for about... uhm, 5 minutes! Who exactly thought this would be a good idea??? Didn't Kuno Becker object to his character (Santi) being sidelined? The producers have tried to pull a fast one. He's featured on the cover but he's just a cameo appearance as the main crux of the story centres on 2 new characters that are supposed to be Real Madrid teammates of his, yet we've never encountered them before. Where's Roz? And Gavin Harris? And one of the main things that peeves me the *beep* off was the atrocious match footage featuring the worst digital effects since Ray Harryhausen's monster flicks of the 1950s. Couldn't they even find a proper soccer pitch and try using some actual extras for crowd scenes? Instead they have to uses real games and digitally insert the \"alleged\" actors into the footage. I've seen TV adverts with better quality.\n\nThis is NOT a fitting end to the story of Santiago Munez."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "Bigmansams88",
        "review_rating": "2",
        "review_title": "Was this about football???",
        "review_detailed_main": "Iv read some of the reviews and I agree with all. This movie almost has nothing to do about soccer(football) more about a love story. Yes it does have the world cup but you see more of Beckham play than you do the main stars. If you were expecting Santiago Munez going through issues then coming out on top in the end you have chosen the wrong movie for that. I loved the first two movies I'm a huge football fan but Kuno Becker (Santiago) plays so little of role (never see him touch a football) that its discussing to even call this the last movie of the trilogy. You expect at the least the star of the first two to have some kind of an impact on this movie but if you count up the speaking parts he has in this movie it comes out to be maybe around 10 minutes maybe less. From the first two movies this is 99% different. So if you couldn't tell I hate this movie and am very disappointed in this movie and only recommend this if you have some kind of stock in the publisher so you can get money out of it."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "wellsy-80618",
        "review_rating": "",
        "review_title": "Horrendous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "tak_215",
        "review_rating": "4",
        "review_title": "A great example of a pointless film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "andrelikez",
        "review_rating": "4",
        "review_title": "What's going on?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "jespadilla1",
        "review_rating": "4",
        "review_title": "Goal 3",
        "review_detailed_main": "I can not believe this movie.The first two movies were outrageous but the third one was a hardship. Where was Santiago, Harris and his wife. This Liam and the other one were terrible actors and Santiago was like an extra. I hope My Santiago could come back like on the first and second part as the main character with some real soccer movements again and real actors,too please. Maybe add some other real soccer players like Renaldo,Ronald vs Santiago and Harris. I mean what happened to Santiago's mom,little brother,girlfriend,Harris and manager. I hope there could be goal 4 to replace part 3. Kuno Becker(Santiago) your the best even though your not a real soccer player ,you make it real and thats why the first two movies were the best for your hard work.Now please come back as the main character. My 9 year old son plays soccer and got really inspired with goal 1 and 2. Its not about the real star soccer players, it's about the story,how Santiago began his dream as a soccer player and how he continues."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "This one grossed LESS than $7700 in theaters!",
        "review_detailed_main": "\"Goal! 3\" is a film about three soccer (football) players who you don't happen to like nor have any connection to them. They are planning on going to the World Cup when there is an accident and the most likeable of the three is injured so badly he cannot compete. So, the story then focuses on the other two jerks...and you most likely will find you just don't care.\n\nThe film is incredibly cynical. After all, it expects the viewer to stay engaged with a story where you don't like anyone and the sports action seems detached and uninteresting.\n\nBy the way, although this clearly is a terrible film (due almost exclusively to the writing), I cannot believe the reviews I saw giving it 10s and singing its praises. Unfortunately, I think many films have fake positive reviews...and perhaps they were paid for or made by members of the cast. This alone would explain why the reviews are for the most part, 1s and 2s or 10s...with little in between."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "risaldanish",
        "review_rating": "2",
        "review_title": "Utter disappointment",
        "review_detailed_main": "The whole reason why I watched this movie was to know what happened to his wife rose but her name isn't even mentioned in this whole film like she didn't even exist I'm giving this at 2 star course the emotional scenes kinda worked for me even though I don't understand the particular point why those scenes are in this movie and the acting was not that bad(new characters). If I am being honest this movie shouldn't even name as goal 3 it should have been something else I mean come. The main character of first two film is like he have a guest roll in this film I think they just used him to lure people into this film so that can sell more DVD i guess FYI: THIS NOT A CONTINUATION OF GOAL ONE OR TWO."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "nessworthy",
        "review_rating": "1",
        "review_title": "WITHOUT QUESTION THE WORST SEQUEL EVER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "rorymcnamara",
        "review_rating": "1",
        "review_title": "Better buy more Ronseal!",
        "review_detailed_main": "Genuinely the most wooden, stupid and pointless film I've ever seen. It's as though a GCSE drama student sent in a script and they decided to run with it."
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "florlemo",
        "review_rating": "",
        "review_title": "Boring...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "tangodave2005",
        "review_rating": "",
        "review_title": "I wish this movie was better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "wolfnhawktime",
        "review_rating": "",
        "review_title": "Compared to Goal 1 and 2 this one went down hill",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499487",
        "movie_name": "Goal! III",
        "movie_rating": "3.2",
        "review_username": "lucy-lucy94",
        "review_rating": "",
        "review_title": "Absolute Rubbish",
        "review_detailed_main": ""
    }
]