[
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "zabouke",
        "review_rating": "3",
        "review_title": "what the hell?",
        "review_detailed_main": "This is one of the most god-awful movies ever. Shaq better just stick to basketball. This movie took away apart of my life I will never have back. I will make fun of this movie until I die, and then some. It is so horrible it is not even funny. MST3000 would have a blast with this one."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "A perfect example of a movie that I loved as a child, hate as an adult...",
        "review_detailed_main": "Well, adolescent really(19). Like Howard the Duck, Kazaam was a movie I loved as a child but looking back on it I was shocked at how low my taste buds were as a kid. Granted, there are some funny moments specifically the ones with the flying toasts and the bicycle race. And it is not the worst movie of 1996, Ed and especially Bio Dome are worse. However, the special effects are really quite substandard, and the rest of the production values are of direct to video quality and shoddy ones at that. The story is predictable with only a few worthwhile scenes to favour, the sight gags suffer from poor comic timing and the script is childish and simplistic. The characters I really dislike here, the kid is annoying, the villain is one of the lamest I have seen in a long time while Shaquille O'Neal's Genie with his awful rapping(then again I dislike rap intensely, and that is the least problematic of his performance) grated on me fast. The acting doesn't fare much better either, while the direction is literally non-existent and the soundtrack is only tolerable if on mute. This is of course my opinion, disagree all you want, I guess I just didn't like it. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "Kazaam",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "tokyostreetkiller",
        "review_rating": "",
        "review_title": "Read my comment.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "netroach",
        "review_rating": "5",
        "review_title": "Come on, folks, it wasn't THAT bad...",
        "review_detailed_main": "Okay, Shaq can't act. But he doesn't need to; he's mostly there to be big and imposing. It's hardly a good movie, but it's an entertaining kidflick..."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Melllvar",
        "review_rating": "1",
        "review_title": "Please make it stop.",
        "review_detailed_main": "This is the worst film I have ever seen.I was watching this film with some friends and after 40 minutes we had enough. The plot was bad and there wasn't a single likeable character.I could get more entertainment watching static. I gave this movie a 1 only because the scale didn't go into negative numbers. Avoid this movie at all costs."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Asteri-Atypical",
        "review_rating": "1",
        "review_title": "Shaq should stay OUT of music and acting!!!",
        "review_detailed_main": "What a pathetic movie.\n\nI won't waste much time commenting about it. I'm still trying to get back the couple hours I wasted on it.\n\nLet me leave it simply with - Shaq has NO BUSINESS being an actor or singer. He is utterly without talent at both discplines. It's a crying shame that substantially more talented people waste away in community theatres and karaoke bars while Shaq uses his name as a basketball player to undeservedly get cast in movies and cut CDs.\n\nMuch of the failure of this movie was the pathetic no-talent that is Shaq."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "akalite_libra",
        "review_rating": "5",
        "review_title": "Once upon a time...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "iamnessie",
        "review_rating": "1",
        "review_title": "At least Shaq has rapping to fall back on...",
        "review_detailed_main": "i was given the book version of Kazaam for my 8th birthday, and people always say the book versions are always better than the movie, but this time they were wrong. At least with the movie it's over soon.\n\nThe acting in this is terrible, which i expected from a film with Shaq who plays a magical rapping genie that comes out of an old ghetto blaster (which there was probably a good reason he was trapped in there). The kid in the film that plays Max is whiny and a terrible actor. He's bullied by neighborhood kids, which i don't blame them because he's a little douche bag.\n\nThe story is just plain stupid and extremely cliché. About a boy who's father is always working and never around who finds a new friend who makes his life better and eventually helps him reconnect with his father.\n\nEven at 8 years old i thought this was a stupid idea. It's a surprise any of the people whom worked on this film had careers after wards because it's an embarrassment and should have never been made. i could ramble on even more about how this movie sucks, but you should already know just by reading the plot."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "clifford546",
        "review_rating": "1",
        "review_title": "If i was doped up this, movie would still be the worst movie ever.",
        "review_detailed_main": "If you are a fan of really bad movies, and you think there funny, you will the great acting of Shaq. First off putting pro players in movies hardly ever works. Shaq had to of been the worst actor i have ever seen next to Dennis Rodman who also made a few bad movies. Well any way this movie is also bad due to the hideous kid. I would give this a zero but that is impossible."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "ckmec-1",
        "review_rating": "5",
        "review_title": "Eh...",
        "review_detailed_main": "Now everybody knows Shaq should stick to basketball. This movie wasn't as horrific as pointed out but I've seen better. A 5,000 year old, rapping, seven-foot genie trapped in a boom box is suddenly awakened by a 12 year old New York boy with nothing better to do. He grants the kid three wishes (all which are not that great) and through it all, a friendship develops. Shaq--or Kazaam-- is discovered at a nightclub, becomes a temporary success, while somehow Max is unhappy with his life. His father is involved in selling bootleg tapes and is involved in some kind of scheme with Malik, the Middle Eastern owner of the club. Max's final wish is for his daddy to have a second-chance. The wish is granted, Shaq is released from that stupid boom box, becomes free, and runs off with Asia-Moon (some woman in the club)."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Hu-Flug-Dung",
        "review_rating": "10",
        "review_title": "This movie changed my life.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Floated2",
        "review_rating": "6",
        "review_title": "it wasn't that bad",
        "review_detailed_main": "Kazaam is an alright movie and isn't that bad. It doesn't deserve to be rated so low and in the bottom 100. It was decent. The movie starts out a little shaky but it gets better. The acting in the movie is kinda bad and the plots are very predictable but it was still okay. I'll admit that Shaq's acting is bad and he should stick to rapping and the NBA, the other characters acting weren't that awful.\n\nThe movie has a nice fell to it while watching, the scenes and designs are cool. One of my favorite parts in the movie is when Max is talking to Kazaam and Kazaam tells him that he has 3 wishes, so Max wishes that it would rain burgers and fries. That part was funny and cool. I also liked the ending in the movie.\n\nId recommend this movie"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "cmkj-27983",
        "review_rating": "2",
        "review_title": "Shaq is no Sinbad!",
        "review_detailed_main": "The original cut of this movie was better when it was called Shazam and starred Sinbad! When they recut it to include Shaq, the continuity of the film evaporated. And to think they ruined a perfectly good movie all because Sinbad told a joke about Producer Scott Kroopf in his standup set!\n\nLittle did Sinbad know that Mr. Kroopf was at the Laugh Factory that night. Immediately, he pulled distribution of Shazam and reshot the movie with Shaq. To save on expenses, the scenes got longer and included a lot more filler - a far cry from quippy, fast-paced Sinbad version. It's a shame the whole conspiracy occurred just as the world wide web became more widely accessed, or else the studio would have had a harder time recalling the thousands of copies of Shazaam that were shipped to video stores."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "nathan-moore",
        "review_rating": "",
        "review_title": "Shaq stars as a rapping genie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "frequentlyrandom",
        "review_rating": "5",
        "review_title": "What could we expect?",
        "review_detailed_main": "Ok, the best thing to do going into this film is to not expect anything from it. I just found it channel surfing a few months back (late May 2003). I remember hearing about it years ago when they first came up with the \"movie.\" But I found it incredibly corny. But in a good way. Shaq plays himself pretty much, a big joker. And who would expect much acting prowess from a man who calls himself \"Shaqdiesel.\"\n\nAnywhoo, as long as you acknowledge that this is going to be a horrible movie, bereft of anything worthy of even seeing a movie, t'is a good way to let your brain turn to jello, like, say, after studing for finals or writing a 10 page paper in 3 hours ;-).\n\n---P.R."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "filmboy-16",
        "review_rating": "1",
        "review_title": "To make \"Kazaam\" you need...",
        "review_detailed_main": "1. Paper-thin plot that has been done before 2. A rapping genie cum-basketball player 3. A very, and I mean very infuriating bratty kid. 4. 3 stupid wishes 5.Product placement (then again, what movie doesn't have this) 6.crummy script. 7. Shaquille O Neal rapping. Stir together and you have Kazaam....... What a poor movie!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "R0SK0",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "This is quite possibly the worst movie of all time. It stars Shaquille O'Neil and is about a rapping genie. Apparently someone out there thought that this was a good idea and got suckered into dishing out cash to produce this wonderful masterpiece. The movie gets 1 out of 10."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "TheNewCritic",
        "review_rating": "1",
        "review_title": "If you see this film..... You're as stupid as me",
        "review_detailed_main": "So I'm aware that this film was released a fair while ago, but I've only just seen it; and not out of free will. I can some up this film in 1 word.... Shaq, the only \"actor\" who is more robotic than the Terminator. And really thats all that needs to be said, it's a stupid stupid movie that barely makes any sense, it's so uninteresting that I could feel myself getting stupider as I watched. If you see a copy of this film DESTROY IT, and then maybe one day the world will be ridden of this raping of cinema known as Kazaam\n\n1/10 (and the only reason it scored that high is that i'm not allowed to give it a zero)"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Quinoa1984",
        "review_rating": "1",
        "review_title": "Shaq's egomania OOZES off of this movie; a notorious bad kids movie, and not as campy as one would wish",
        "review_detailed_main": "Yes, Kazaam is one of those horribly bad movies that almost reminds one of everything that is wrong with not just kids movies, but with humanity. Here we have Shaq as a rapping genie- yes, a RAPPING genie- where he does everything from making bad puns to dressing in ridiculous outfits, all ending in him in a Christ-like pose with lots of light surrounding him. So, yeah, expect really cheesy bits, including the first wish being a lot of junk food falling down from the sky (and, regrettably, not knocking out the two main characters, particularly the kid). What might not be expected is that a film with a kid and Shaquille O'Neill would be so incredibly schmaltzy! The main plot of the film involves this kid, played in that all-too-typical and annoying-kid fashion by the great-grandson of Frank Capra (where in which the kid is yelling out his dialog angrily), who comes upon a genie who's been trapped in a boom-box. Then \"hiarity ensues\" as the kid makes the Shaq-genie his quasi-slave as he waits on his last two wishes as he tries to make amends with his shady-gang-type absentee father.\n\nThis really sappy, contrived son and father story would be bad enough, as there are certain lines that have been uttered in a million other movies (i.e. the \"two chances in life\" speech from father to son). But it's Shaquille O'Neill who is both the reason to watch the film (ironically), and the obvious sinking crux of it all. His plot line involves him, when not getting the over-talky treatment from Capra, to rap within the dialog and also start off his blossoming recording career. On top of this, he also kicks ass and takes names with the main bad guys who want him back in the boom-box. So is there a camp factor to the movie? Up to a point, but this is even squashed by all of the mushy scenes and 'heart-felt' moments that have really no business with the rest of the material. One might ask if the people making the movie, who were obviously doing it at the behest of the popularity of a BASKETBALL player who wanted to go on the Michael Jordan acting bandwagon, if it would be anywhere near decently entertaining or convincing. I'd hope that they too knew they were just getting paid. But I'd hope even more that they felt at least a little guilty afterwords for feeding the Shaq-machine.\n\nSo, if you want to have a fun night of Shaq as genie-turned-rapper-turned-wisecracker, all the more fun to you. Hell, it might even be interesting to have a Shaq movie night with this and his other critically acclaimed effort Steel. But if you're hoping to keep a few brain cells, stay away from what is very likely the worst flick of 1996, and a candidate among many others for worst of the 90's."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "A 7 foot tall man is following a kid around the city offering him treats and wishes... see? We're already at problem #1 with this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "MovieAddict2016",
        "review_rating": "1",
        "review_title": "Awful...Pathetic... Well, At Least It Wasn't Disappointing!",
        "review_detailed_main": "Shaq. Francis Capra. What's the worst that can happen when you join together a horrible basketball player and actor, and one of the worst child actors of the 90's? Before you can say \"kazaam,\" you get \"Kazaam,\" a film that goes to show why such crucial elements as, say, actors and dialogue are important to a story.\n\nThe screenplay is just plain bad, and the acting is even worse. The directing style is...well, I don't know, but it was really, really bad. And then, the film has the mandatory emotionally-controlling segments that have nothing whatsoever to do with the already pointless plot, like the whole divorced father piece. Priceless. Priceless as in so awful it has no price.\n\nCut to the chase, and my sypnosis is this: DO NOT SEE THIS MOVIE!\n\n1/5 stars -\n\nJohn Ulmer"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "xilasero",
        "review_rating": "10",
        "review_title": "WTF, man?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "rdoubleoc",
        "review_rating": "6",
        "review_title": "Deserves more credit.",
        "review_detailed_main": "The movie and plot is dumb, but the concept is a fun idea (who doesn't like genies?). It could have been a much more entertaining movie, however."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "JudasXIV",
        "review_rating": "1",
        "review_title": "counter-vote countered",
        "review_detailed_main": "I'm only giving this movie a 1 because I think that this one deserves such a low rating not based only on Shaq's bad performance (either on the set or on the court or on the album). Just taking a look at the camera work, sfx and other performances and letting yourself be entertained is not a just cause to give this movie a 10 let alone a 7. If it weren't for the 10 being a counter-vote I would've given it a 0."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "ChoneFiggins",
        "review_rating": "",
        "review_title": "KAZAAM *1/2 OF ****",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "thedungeonboss",
        "review_rating": "1",
        "review_title": "Shaq, please for the love of God, just stick to missing free-throws",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "JosephPezzuto",
        "review_rating": "3",
        "review_title": "Reel Look: Kazaam",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "srobi280",
        "review_rating": "2",
        "review_title": "Wham bam thank you Kazaam",
        "review_detailed_main": "There was a genie played by Shaq His name was Kazaam, and he was whack His rhymes were corny, this lines were bad some stupid kid cryin over his stupid dad bad actin, bad casting, bad special effects whats next? this movie sucks Prolly didn't make 20 bucks he lives in a boombox not a lamp hurts like a cramp like a wet food stamp...\n\nYeah, you get it, a stupid rhyming genie who can't act, in a stupid movie with horrible special effects. Oh, and its confusing as hell. I'm not even gonna go on. Let's just say, it belongs in the \"its so bad, its funny\" category. Watch it once with your buddies and get a good laugh. But don't expect anything spectacular."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "aeowen-03398",
        "review_rating": "1",
        "review_title": "One of the most...",
        "review_detailed_main": "...absolute worst movies I have seen ever!\n\nIt was me and my ec-wife's turn to babysit her sister's three kids and thought a movie and pizza would be great. We didn't have much of a choice because the kids wanted to see this stupid and idiotic farce.\n\nI mean, come on Shaq! A rapping genie? Did youbnit make enough of a salary in the NBA to even do this script? It made no sense, had no real plot or storyline, but of course there's that lingo that rappers share, which I don't want to understand or care to. By the movie was over, we so ready to leave and pass on the pizza. It was that dumb of a movie that should have stayed on the cutting room floor.\n\n20+ years later, I'm still astounded with Shaq, his educational level (from what I understand he was given an \"honorary\" PhD...but why? Can he not find a career other than advertising for Icy-Hot and the General car insurance? I guess that's what a fine educamation does for you other than just being handed a certificate of completion. SMH.\n\nAvoid this movie. It's definitely one to totally forget and get your money back. That awful."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Heresy",
        "review_rating": "1",
        "review_title": "Ugh...",
        "review_detailed_main": "Unfortunately my nephews wanted to watch this and I got stuck watching it with them. It is horrible...scratch that, horrible doesn't do it justice; even my nephews (age 5&7) got quickly bored with it (fortunately they let me stop it 3/4 through and put in Babe.) Shaq has officially found something he does worse than shoot free-throws (act AND choose scripts.)"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "clifford546",
        "review_rating": "1",
        "review_title": "If i was doped up this, movie would still be the worst movie ever.",
        "review_detailed_main": "If you are a fan of really bad movies, and you think there funny, you will the great acting of Shaq. First off putting pro players in movies hardly ever works. Shaq had to of been the worst actor i have ever seen next to Dennis Rodman who also made a few bad movies. Well any way this movie is also bad due to the hideous kid."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Well, at least it's not as bad as contracting Ebola.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "imartindale",
        "review_rating": "10",
        "review_title": "One of the many hidden gems",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "edhuds0n",
        "review_rating": "7",
        "review_title": "Once again, I was misled by others' negative revues...",
        "review_detailed_main": "Based on the opinions of some (not all) of the other reviewers, I expected this movie to be horrible. I was quite pleasantly surprised that -- while Shaq will probably never win a Golden Globe award -- it was a very entertaining and heart-warming story.\n\nUnlike some others, I had no trouble watching it to the end, and I was not sorry that I had allocated that portion of my lifespan to viewing it.\n\nIn short, the movie was about a 5,000-year-old genie stuck in a boom box who befriends the lonely 12-year-old boy who finds him and whose only (real) wish is for his parents to get back together.\n\nIf you take it for the light-hearted comedy for which it was intended and not expect \"classic cinema\", then IMO, it is well worth a look.\n\nI give it 6 out of 10."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "brianmimdb",
        "review_rating": "1",
        "review_title": "If you watch this, expect a strong feeling of loss and regret",
        "review_detailed_main": "This movie deserves no rating, and it's not for the reasons you'd think. It is a complete failure, but mostly because it got past common sense, Hollywood budgets, and directing standards.\n\nAll because I believe Shaq threw enormous piles of money at it, and no one wanted to tell him this was the worst possible movie idea.\n\nAlso take note that Shaq raises his eyebrows every other word he speaks.\n\nSome moments are only mildly painful, while others are clench your teeth, eye-squinting travesties. Most notably, the rap battle between the boy and Shaq, where they repeat \"We ain't men, we genie.\"\n\n* Scowling at a piece of toast. * A boom box that shoots a shower of sparks * A grown man showering in front of a child * A rapping genie, that despite boasting his lyrical skills, always starts every rhyme with \"I am Kazaam\" * More than an hour of your life wasted\n\nThese are what you have to look forward to in watching this.\n\nI'm troubled that anyone thought this would make money, or legitimize Shaq's rapping career in the minds of children.\n\nIf you have a choice between sitting in gridlock traffic for 9 hours, 10 straight hours of oral surgery or watching Kazaam, Kazaam wins by a slight margin. There's no more positive endorsement I can give."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "gphillips7",
        "review_rating": "",
        "review_title": "All hail Shaq.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "metalrage666",
        "review_rating": "1",
        "review_title": "Couldn't even make it all the way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "snowboardchicky04",
        "review_rating": "3",
        "review_title": "Wow this is simply the best movie ever.......................umm OK no for real it sucks",
        "review_detailed_main": "OK so after watching this invigorating movie and wasting an hour and so many minutes off my life here is the basic summary: Genie comes out of ghetto boom box, gives this kid with shaggy hair 3 wishes, the kid wastes his wishes on i forget what, shaq sucks at rapping, and i guess thats it.\n\nSo mainly I laughed, I cried......but mainly I laughed at the shear comedy that came from the wonderful acting skills of an nba player/rapper and boy with shaggy hair.\n\nI highly recommend this movie for college kids sitting around drinking some beers with their close friends and are in serious need of a good laugh.\n\nI'm going to give it a 3 out of 10 only b/c the movie is based off of 3 magical wishes.\n\nIf I had 3 wishes one would be to erase this horrible movie and for everyone to pretend like Hollywood didn't waste money on making this."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Criticman12",
        "review_rating": "2",
        "review_title": "Why would someone make a film with Shaq as a Genie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Edvis-1997",
        "review_rating": "2",
        "review_title": "2",
        "review_detailed_main": "Oh God. When you're retired from basketball or from Sumo( I don't know he looks pretty fat) and then you're trying to become superstar actor. Just cringe, please never do this again you just can't. You're the worst actor and sport commentator so please keep your 1% of smartness for yourself."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "ShancyShance",
        "review_rating": "2",
        "review_title": "Yawn...",
        "review_detailed_main": "It has been a few years since I saw this movie, but awful movies tend to stay in my mind.\n\nThis is proof of the fact that athletes should stick with what they are good at: sports. Athletes were not intended to act. Shaq's hideous performance in this movie is proof."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "leoxatzian",
        "review_rating": "2",
        "review_title": "This is one movie everyone would wish to disappear.",
        "review_detailed_main": "Shaq might be a legendary basketball player, but this movies is by no means a slam dunk. The plot might be by the numbers, but the film's real problem is the soul-less performances given by the cast, the deeply un-funny comedy and the compilation of yelling non-sence that the movie refers to as rap music."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "barbifrsh",
        "review_rating": "10",
        "review_title": "2 Stars? Come ON!!",
        "review_detailed_main": "To any kid who grew up in the 90s this movie was excellent! I show it to my students now that I am a teacher and they love it still. It's a kids movie for goodness sake. The story is good, it is entertaining and funny so for a kids movie it's dang great! People giving this low ratings either didn't grow up in the 90s, had a really sucky childhood, or are just hating on the greatness that is Kazaam!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "doomedmac",
        "review_rating": "7",
        "review_title": "Very fun, but also meaningful",
        "review_detailed_main": "I liked this movie a lot. It's really stupid in a lot of ways, but it does a lot of things right and very well. It's fun, but also meaningful."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "FeastMode",
        "review_rating": "1",
        "review_title": "how is this a thing?",
        "review_detailed_main": "I watched this movie when it came out, i was 11. decided to watch it again after stuckmann made a hilariocity about it. so much of this movie shocked me. unfortunately it didn't make me laugh that much, more just strong feelings of disbelief that this exists. hilariocity scale 5/10 (about 2 viewings, 6/24/2020)"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "NoTZ",
        "review_rating": "",
        "review_title": "This moved me.. to the next theater",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "BlackCat725",
        "review_rating": "2",
        "review_title": "I just couldn't look away",
        "review_detailed_main": "The only reason I DVRd this movie was because 1. I live in Cleveland and Shaq plays basketball for us now and 2. I've always heard how awful it was. The movie did not disappoint. The best parts were Shaq's outfits. The worst parts were, well, just about everything else. My 12 year old son and I just squirmed and couldn't look at the screen when Shaq started rapping and we kept wondering why Max didn't wish for Kazzam to fix that front tooth of his! But for all it's terribleness we just couldn't stop watching it, the story sucked you in, like a black hole or quicksand or a tar pit, it was hypnotic. But it was worth it for the laughs and just to say that we actually watched \"Kazzam\"."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "drdave",
        "review_rating": "1",
        "review_title": "This movie EARNED its place on the worst 100 list.",
        "review_detailed_main": "This movie proves that Shaq is better at making free-throws(ha!) than acting. Combine that with a poor story and cheesy visuals and you have a definite bottom dweller. Zero stars."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "dj_puddin11",
        "review_rating": "1",
        "review_title": "The Worst Movie Ever.",
        "review_detailed_main": "This movie is so, so, so horrible, that it makes angels lose their wings. Shaq had tried to make other crossover efforts, like his work in Shaq-Fu for the NES and his plethora of unbearable rap albums, and later, the epic serving of horrible film-making that is Steel.\n\nThere's not a single good thing to be said about this movie. I saw it a bunch of times when I was very young, but I must've been an idiot then, because this movie takes all that is enjoyable about films and tears it apart. It's fun to mock. I saw it on the Disney Channel a while back and spent a few minutes doing that. Although, once the thrill of mocking it is done, you still become overwhelmed by its terribleness.\n\nIf you see it on TV, try this: consider, as your watching the film, removing from it all the scenes in which Shaq uses his magical genie powers. If you do that, it becomes like a film about a pedophile chasing a kid and rapping to seduce him. That's kinda funny, and disturbing.\n\nA horrible example of film. Do not, unless looking to mock it, see this movie."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Make This Crap Disappear.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "RunningFromSatan",
        "review_rating": "1",
        "review_title": "Thank you, Conan!",
        "review_detailed_main": "I will have to admit that I would NEVER have seen this movie if it weren't for Conan O'Brien. I think he is secretly in love with this movie, and not in a good way. If there's anything to take a stab at Shaq in *any* way, he just shows a clip or 2 from this movie on his show. So, I went out and rented this movie (with about 10 others to disguise it) to make fun of it, and I had a laugh-a-minute riot! How many times did you just want Kazaam to die a horrible death when he started rapping? And the writing was atrocious -- do **NOT** show this movie to little kids! You will put them at risk for brain damage with lines like: \"Francais? I love it 'beaucoup, beaucoup, beaucoup'!\" and \"You smell like a hippopotamus butt.\" Many others follow, as well. And the ending was horribly melodramatic -- I will not spoil it so you can see it for yourself. Overall, I would like to thank Conan O'Brien for discovering this horrible movie that every family can enjoy...making fun of.\n\nP.S. I think Touchstone Pictures is so embarrassed for putting out a piece of trash like this, I don't even think that Conan needed to have these clips furnished by the studio for his show. 0.5/10"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "TheGOLDENWALRUS",
        "review_rating": "2",
        "review_title": "this movie was so funny though!",
        "review_detailed_main": "This movie was terrible, it's obvious but it was so funny! Come on, Shaq rapping! It's obvious that the acting was so bad but it is funny to watch. What's the point of picking on the movie with bad directing and bad editing. For this case two bads do equal a right. In fact, for this movie, 80 bads equal a right! I hope Shaq does more stupid movies thinking its not stupid. I hope he does a movie with Kobe Bryant where they are like warriors going to war with each other. Now that would be funny.\n\nSo all of you picking this movie apart, it doesn't take a genius to know that movie really sucked. It sucked so bad that it was funny and that is worth a look. Really it deserves a 1 but it made me laugh by how horrifying it was.\n\nJust for the record: Directing a 2, editing a 3, acting a 1, plot a 2, message a 4."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "worldsworstwryter",
        "review_rating": "2",
        "review_title": "I wish to have not watched this trash.",
        "review_detailed_main": "So you have a gigantic, crazily dressed, flamboyant rapping genie, and you instead choose to focus on some clichéd family drama nonsense that we've seen so many times that it's painful.\n\nSeriously, I was so unbelievably disappointed by this. I thought I was in for a fun and silly friendship between a kid and his wacky genie. I expected it to be awful, but surely with that premise, it'd at least be fun, right?\n\nNo.\n\nThere needed to be way more of Kazaam in the movie to give it more goofy fun. The movie is like 20% fun nonsense, and 80% an angry kid having a tantrum and being horrible to everyone around him.\n\nLike always, it's not the fault of the child actor themselves, but honestly whoever wrote the kid character has provided me with reason no. 1379421 why I never want to have children.\n\nIf I had the genie myself, I'd wish to be able to reach through time and throttle the guy that wrote the kid character to be this way."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "BlueSkies765",
        "review_rating": "10",
        "review_title": "Nostalgia overload",
        "review_detailed_main": "The critics were way too rough on this one. I loved Kazaam as a kid and when I recently rewatched it I can see why.\n\nA kids perspective is different from an adult. A kid got a lot of imagination and a good sense of fun. So while this movie is corny and silly from an adults perspective these were exactly the things I loved as a kid.\n\nA giant rapping genie, a fun friendship, family, the struggle of a kid growing up in the city and a ridiculous music business villain. I had a blast watching this movie over and over again. 90s kids know the truth about Kazaam!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "erminahotmail",
        "review_rating": "7",
        "review_title": "much better than steel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "\"I am an Idiot for starring in this movie\" - Kazaam",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "morocca8985",
        "review_rating": "",
        "review_title": "Kazaam! Kapow! Kawham! Kazaam steals hearts of Americans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "arielsiere",
        "review_rating": "2",
        "review_title": "The shameless copy of Aladdin but wrong",
        "review_detailed_main": "Well,well,well if it isn't one of Disney's worst movies from 1996 because it is nothing but a copy of Aladdin (1992) just like The Wild (2006) being a copy of Madagascar which is way better than this, this movie ended on the awful movies wiki from miraheze for the bad voice acting from the character named Shaquille O'Neal (Max), unfair ending, misleading title, bad rapping and one of Disney's worst movies along with The Wild (2006), Underdog (2007), Mars Needs Moms, Strange Magic, Mulan (2020) and Artemis Fowl, if you want to watch a better movie from 1996 go watch The Hunchback Of Notre Dame and Aladdin And The King Of Thieves because those are better examples of two good Disney movies, forget this copy, The Return Of Jafar also sucks and so does Belle's Magical World."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Polonius85",
        "review_rating": "1",
        "review_title": "Hated this movie before anyone told me that I was supposed to",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "StinkerCritics - T &amp; L",
        "review_rating": "1",
        "review_title": "Another Slam Dud for Shaq!",
        "review_detailed_main": "We would really like to give this movie a full, detailed review, but unfortunately we periodically left the room for no reason at all just to get away from this brutal disgrace of a movie. First of all, this movie appeared to have a large budget, yet the director clearly forgot to address Max's snaggle tooth. With all the special effects in this movie, they could've at least made this kid look like he kept a dentist appointment. Now, let's move on to the major flaw of this movie--Shaq. It appears that this guy can do it all--play basketball, rap, and act. However, these last two things are severely lacking. His raps consist of such memorable lines as, \"I'll be the cream for your coffee,\" \"I'll green eggs and ham it,\" and \"fresh out the box like a premature burial.\" This rap song was awful....it was right up there with his breakthrough flops \"I'm Outstanding\" and \"Biological Didn't Bother.\" Possibly the worst scene of the movie was the recycled after-school special speech by the soon-to-be step-father, Travis. We cringed when we heard Travis reassure Max that he would not take the place of his father. There were a lot of unnecessary scenes with Max's father that we left the room for. However, when we returned we caught the tail-end of some poorly acted \"bad-guy\" scenes. This movie was plagued with weak walk-on parts, such as 'Da Brat and Spinderella. We found it very preposterous how Shaq became a pop music icon after \"rapping\" one stinkin' song in a dingy club. We also found the recycled \"school is cool\" message to be extremely played. In particular where Shaq plays Max's tutor (a job that seemed extremely far-fetched for Shaq). In this movie, Shaq claims that he is more intelligent than a Harvard grad. Once again, this is just stupid. In reality, Shaq has the equivalent of a 5th grade education, as evidenced by his stammering as he struggles through the cue cards. Overall, this movie is unbearable and painful to watch. Shaq should really look into other hobbies in the off-season, and Francis Capra should receive dental assistance before even thinking about going to another audition."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "The One",
        "review_rating": "1",
        "review_title": "Yes, it is that bad",
        "review_detailed_main": "This film was utterly crap. I had to do a school project on it (for art), only because ONE kid in our class wasn't allowed to see M rated movies. I regrettably chose a scene from the movie to focus on - one of the totally not-fight-scenes. Poor acting all round, as usual the kid outshines Shaq......only just. And Shaq is VERY poor indeed. I really can't understand what was going through my (usually really good) teacher's head when he got out that video...."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "silentbo",
        "review_rating": "1",
        "review_title": "tell shaq to stick to his day job",
        "review_detailed_main": "Would someone tell shaq to stick to what he is good at basketball. This movie was not even entertaining on a stupid level. In this movie shaq plays a genie who lives in a boom box is that not orginal a genie in a boom box instead of a lamp. He is supposed to help a little boy played by the equally annoying francais cappra. This movie had the most flimsy storyline since water world, the acting was awful and I think that anyone who likes this flim would be afraid to admit it."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "sias-programming",
        "review_rating": "1",
        "review_title": "Retarded",
        "review_detailed_main": "What was the point of this movie? What was the plot? I do not know. Shaq can't act, people don't know how to direct, and I am Kazaam! A genie who raps? Come on. Maybe Eminem or Linkin Park will be in a movie like this. I remember I watched this just to kill time. It didn't really interest me. I just remember thinking, \"Who put Shaq in this movie???\" The whole story seemed stupid too. It made no sense whatsoever. I guess an unrealized moral of this movie is that you can find anything in the ghetto and anything can happen. I can't comment much more because this movie is so terrible there's nothing worth commenting about. I \"wish\" this movie would go away."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "DrMongol",
        "review_rating": "9",
        "review_title": "I feel enlightened after watching this movie (in the good way, not the naked after a party way).",
        "review_detailed_main": "I remember watching this film as a semi-retarded adolescent and not enjoying it due to the vague underlying themes that flew over my head at such a young age. However, last week, passing this movie in the Blockbuster Mega-Discount bin, I decided to re-watch it and see if my opinion has changed.\n\n(I tried to keep this review as spoiler free as possible, without losing some of the movie's flair. I feel I have succeeded) I must say, spending that 2.50$ plus tax was the greatest decision of my pitiful and shameful life. In the 5 days I have had the VHS, I have watched this film at least 15 times, I unfortunately lost track after blacking out naked on my carpet on the 2nd day. This movie goes down in history as one of the 5 greatest drama sequels of all time, and If I had to put a rating on it's comedy factor, I would give it 4 thumbs way up. I found myself laughing throughout the entire film, calling my friends and family to repeat jokes I had heard. The casting in this film is absolutely excellent, with Shaq leading the performance like a Frenchman in a yogurt factory. The story revolves around a genie named Shaq, and a small Italian boy named Max. Upon finding a magic stereo player, Max discovers a small black genie living inside, and offers to give him a place to sleep and eat for a week. Ironically, this is where the theme of pedophilia comes into play, with multiple scenes of Max and Shaq showering together and close up shots of them smiling. I hate to repeat myself, but as a child, I understood nothing about this subject. However, as a fleshy man, I see it in a new and blinding light.\n\nThere are several moments throughout the play where the development of the characters and storyline drag, but the rest of the film certainly make up for it. The end is griping, and keeps me on the edge of my seat every time I watch it. At the same time, I cry when the credits roll and long to see Shaq's black face one more time (of course, I will rewind the movie at this point and watch it over again).\n\nOn a final note, this movie is almost perfect in every aspect. This is the epitome of what a Hollywood blockbuster should be. The casting is amazing, the special effects are mind-blowingly realistic and stunning, the fully orchestrated soundtrack fits the mood perfectly and amplifies the experience. If I were to put a grade on this, I would have to give it a 9/10, losing a point because of the slight nudity (i'm not the biggest fan, but I won't say no!). But, this is not a movie to be rated, it is a movie to be bought, watched, and enjoyed. Do yourself a big favor and buy this movie, your taste buds will thank you."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "madtza",
        "review_rating": "7",
        "review_title": "Simple nostalgic watching with your young ones",
        "review_detailed_main": "Watched this with my 13yr old son and he actually stayed up throughout the whole thing and enjoyed it. We laughed at the corny scenes but it was still a fun bonding session.\n\nI played it for him because he didn't believe Shaq made movies. Sure it didn't age well(subjective) but I went with the nostalgic factor more than anything. Having my boy there was a bonus.\n\nThe movie is nothing special from kid movies of that era. I also enjoyed movies like The 3 Little Ninjas when I was a young, which seem ridiculous today but I'm not hating up on them because they worked for that time. Way worse movies you could compare it with. Watch it for the fun of it, it's really not that bad."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "mwcanadian-99023",
        "review_rating": "3",
        "review_title": "Rapping Genie Shaq?? Try free throws",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Ross1223",
        "review_rating": "",
        "review_title": "number two all time greatest movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "FlashCallahan",
        "review_rating": "3",
        "review_title": "Pimp my Genie.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "chris-397",
        "review_rating": "1",
        "review_title": "good film-bad film",
        "review_detailed_main": "Let's play a game of good film-bad film. Mad Max was a good film, water world was a bad film. Goldeneye was a good film, view to a kill was a bad film. Kazaam is the bad film version of 'Bernard and the Genie' (1992). Look at the plot: Loser finds genie. Genie helps loser. Genie likes 20th century life. Lenny Henry makes a much better genie than Shaq, though. I can't believe the casting for this film. Shaq should learn that sportsmen don't make actors. Just look at Frank Bruno. And what is it with Francis Capra? I had to kick the telly over every time he came on, he is that annoying. Who else thinks it's ironic that 'Capra' is latin for goat. Well, Francis and Shaq can be proud of this one. Like Frank Bruno can be proud of his acting. As far as films go, this one smells 'like a hippopotamus butt'. And we're talking one smelly hippo. Guys, take it from me, you don't want to put this one at the top of the old curriculum vitae. Well that's all I've got time for. I have to be back at the lab by six..."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "smartalan",
        "review_rating": "5",
        "review_title": "Look at what the movie is!",
        "review_detailed_main": "This was really a charming average movie designed more for kids than adults, but you can enjoy it if your with your 10 year old and enjoy a fantasy. The basic premise is as obvious as the title with Shaquille O'Neal playing the title role and you didn't need to really be an Oscar winner for the role. Besides, anything with Francis Capra can't be all bad, just look at his work on Veronica Mars! Capra was a really cute kid and I found my own son could relate to him as he came across warm and accessible. As For O'Neal, this is a similar role as he played in Steel. If you saw one movie, you saw his style in the other. There is a reason Basketball pay him so much and he'll follow yo that career with one in Law Enforcement, but if you need a big friendly guy for a fantasy movie, he will be your ticket!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "jamjohnx3",
        "review_rating": "2",
        "review_title": "As terrible as you think it is",
        "review_detailed_main": "The good thing about watching movies years after they come out is that you can form a nuanced opinion without the influence of the cultural reception at the time. Watching Kazaam taught me that there's nothing nuanced about how terrible this movie is. You heard it was bad. I heard it was bad. We can now agree that there's nothing clouding our judgment.\n\nThis movie reeks of the decade it was made in. Physically-incapable-of-acting basketball star Shaq is the title character, a genie that lives in a boombox. The protagonist of the movie is Max, a bratty kid that finds Kazaam in an abandoned building. We're supposed to sympathize with Max because he's bullied, but he's such a little jerk that it's actually cathartic to watch him get bullied. Kazaam and Max make an unlikely pair, not just because a 7 foot tall black man follows a little white boy around New York like a lost puppy, but also because Kazaam wants to go through the three wishes to gain his freedom (and hopefully get far, far away from this kid), and Max, in a completely realistic and tightly written portrayal of the selfish child that he is, decides that he doesn't want to use any of the magic wishes his genie is begging him to make.\n\nThe \"plot\" of the film revolves around Max learning that his mother lied to him all these years and that his father actually lives in the city, so he goes off to see his father for the first time in however many years (Kazaam is along for the ride). He's crushed to find out that his dad is a total sleazebag (like father like son) music executive and eventually it's up to Kazaam to use his miraculous powers not to end poverty, war or world hunger but to mend this broken white family. There's another sleazebag that figures out Kazaam is a genie and plots to steal him out from under Max.\n\nIf you found Shaq's non-acting to be distressing, prepare yourself for the trauma that is his rapping. This movie fails in just about every conceivable way. A story about a kid and his genie should be pretty straightforward but somehow, most of the characters are unlikable, the plot is dull and predictable, and I'll sound like a broken record if I keep talking about the acting. Space Jam, this is not."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Wish it Away",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "The_Gardening_Bros",
        "review_rating": "4",
        "review_title": "It's bad but gets better at the end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "yankcrime15",
        "review_rating": "2",
        "review_title": "Some Lamps Should Be Permanently Sealed",
        "review_detailed_main": "This isn't as much of a film as it is a giant promotional campaign by Touchstone Pictures to market the NBA's worst free thrower with his extraordinary height. Not only is this obviously forever trapped in a time capsule set to 1996, but everything in this film is done so bad that it's completely laughable.\n\nIf I had a handful of cardboard cutouts, they would be far more dimensional than any of the people that acted in this film. It's obvious that Shaq not only fails at free throws, rapping and being a video game character, but his acting is absolutely dreadful. He's a \"rapping\" (actually a RHYMING) genie that moved into a boombox and is summoned when a boy named Max (played by a young Francis Capra) stumbles upon him after being chased by bullies. Throughout the movie, Shaq becomes a subject of slavery as Max owns him until his three wishes are granted. That's pretty much the whole plot, unless you're actually going to include a meaningless subplot about \"finding the true father\".\n\nIt doesn't get any better from there. Shaq demonstrates his mad rapping skills by appearing at a night club where he becomes a selected guest. Guess how fast Theodor Geisel was spinning in his grave when he brought forth the detestable line of \"Let's green egg and ham it!\" Probably around the same speed that would also be brought forth by those two live action adaptations that shall not be named.\n\nThen there's some phenomenal acting. I'm talking about the magical french toast. That performance was far more convincing than anything you could expect Shaq to give us. Too bad this film killed its career.\n\nSpeaking of career killers, ever noticed what happened to Paul Michael Glaser after he directed this film? It's a long story.\n\nGranted, it's not one of THE worst things I have ever seen, but it's very close. Kazaam is proof that pitching a non actor as a main character usually does not give satisfactory results. With all this time wasted in the production of this film, I bet Shaq could have gotten some more practice at free throws. The most shocking thing about this? Shaq actually got ANOTHER lead role a year later, but that's a whole different story subject."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "benjamin-bywater",
        "review_rating": "10",
        "review_title": "People who hate on this must just hate life :D",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "a-twetman",
        "review_rating": "2",
        "review_title": "The 90's were not funny, they were stupid.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "pseudo-4",
        "review_rating": "",
        "review_title": "Watching Shaquille O'Neill act is as bad as having every hair on my body pulled out one by one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "clint-cole",
        "review_rating": "2",
        "review_title": "Why didn't I give this a rating of 1?!? Answer:",
        "review_detailed_main": "It didn't cause physical pain. If I take prescription medication after a movie, it gets a '1'. A good example is the outer space sequences in '2001:a space Odyssey'. The repetitive forced breathing made me pass out.\n\n'Kazaam' is nothing short of annoying. A rapping genie in a boom box discovered by a spoiled little kid. You know the kind of kid you see in the grocery store giving their parent hell because they want a candy bar. Imagine a movie jam packed with that. If I had gotten a boom box when I was a kid I would be appreciative, much less a genie inside.\n\nI fell asleep during 2 attempts to watch this movie. Honestly I didn't make a third attempt, so I have no idea how it ends, but then again I don't CARE."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "sublimeak",
        "review_rating": "8",
        "review_title": "Teacher Review",
        "review_detailed_main": "I watched this movie with my class, and most of my students enjoyed it. Some even said it was a 10/10. Some of my students thought this was a remake of Aladdin. I thought this was an extremely underrated movie. Shaq did a good job acting, and there isn't another movie that is like it. Most of my students approved of this movie greatly. They liked the rapping!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "lindzeyhh",
        "review_rating": "10",
        "review_title": "Who...dare... to rate ME?! (1 star?)",
        "review_detailed_main": "Twenty years later this movie is still a great movie!! I thought eh, what the heck... let's watch this cinematic adventure of Shaq as a genie after such a long time. It's true, EXTREMELY CORNY. But, isn't that what 90s nostalgia is all about? The junkfood scene, the Shaq in the \"magical\" shower scene...and of course... the coveted cassette... the WE GENIE rap. Ahhh...brings me back to a time of fruit by the foot, frotopia drinks and N64. If you're looking for a spectacular plot, a moving speech, tears.... you may want to look elsewhere. HOWEVER. If you are wanting a brief adventure back to 96' with a little chuckle here and there, enjoy KAZAAM! I am forcing my kids to watch this movie repeatedly until they admit it really is an awesome movie...."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "riftin-99737",
        "review_rating": "10",
        "review_title": "An astounding, ground-breaking movie",
        "review_detailed_main": "This movie is very underrated, with betrayal, love, hardships, a gold script with 0 errors and an Oscar worthy performance from Shaq, this movie is very underrated. Had incredible special effects and blood effects, honestly this movie is unbeatable. Now my opponent is the type to stall to wait for the buzzer to go off so he doesn't have to explain anything and he is a liar and cannot be trusted and is not fit to be elected as president of North Korea. Mr. Trump what is your response to this? Well twitter bios I love them, LOVE them. And my bio? The best, UNbeatable. Unlike crooked Hillarys bio, full of lies, no truth, sad. Mrs. Clinton, what is your response to Trump? Saturday morning jumped out of bed And put on my best suit Got in my car and raced like a jet All the way to you Knocked on your door with heart in my hand To ask you a question 'Cause I know that you're an old-fashioned man, yeah\n\nCan I have your daughter for the rest of my life? Say yes, say yes 'cause I need to know You say I'll never get your blessing 'til the day I die Tough luck, my friend, but the answer is 'No'\n\nWhy you gotta be so rude? Don't you know I'm human too? Why you gotta be so rude? I'm gonna marry her anyway\n\nMarry that girl Marry her anyway Marry that girl Yeah, no matter what you say Marry that girl And we'll be a family Why you gotta be so Rude\n\nI hate to do this, you leave no choice Can't live without her Love me or hate me we will be boys Standing at that altar Or we will run away To another galaxy, you know You know she's in love with me She will go anywhere I go\n\nCan I have your daughter for the rest of my life? Say yes, say yes 'cause I need to know You say I'll never get your blessing 'til the day I die Tough luck, my friend, 'cause the answer's still 'No\"\n\nWhy you gotta be so rude? Don't you know I'm human too? Why you gotta be so rude? I'm gonna marry her anyway\n\nMarry that girl Marry her anyway Marry that girl No matter what you say Marry that girl And we'll be a family Why you gotta be so Rude Rude\n\nCan I have your daughter for the rest of my life? Say yes, say yes 'cause I need to know You say, I'll never get your blessing 'til the day I die Tough luck, my friend, but 'No' still means 'No'!\n\nWhy you gotta be so rude? Don't you know I'm human too? Why you gotta be so rude? I'm gonna marry her anyway\n\nMarry that girl Marry her anyway Marry that girl No matter what you say Marry that girl And we'll be a family Why you gotta be so Rude Why you gotta be so Rude Why you gotta be so rude?"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "joshledbetter-870-150363",
        "review_rating": "10",
        "review_title": "Kazaam is a National Treasure!!!",
        "review_detailed_main": "Kazaam is one of the best movies ever made. I hat insult to such an amazing movie that people give it such a bad rating. Shaq as a rapping Genie literally what more could you ask for. What a masterpiece they don't make movies like this anymore. This movie is as 90s as it gets. Shaq gives an Oscar worthy performance. One of the best movies of all time. Watch this you won't be disappointed in this National Treasure of a movie!!!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "geo2002",
        "review_rating": "10",
        "review_title": "best movie",
        "review_detailed_main": "I need to so some research in order to find out what film topped this on the Oscar list, but regardless a tragedy has occurred. Most likely the best performance of Shaq's career, this film changed the way I looked at life. You cannot give up on your dreams. Especially if you have a giant African-American wizard at your side. If I had to describe this movie in one word it would be \"revolutionary\". The character that portrayed Max will surely go on to bigger and better things unless he decides directing is a better career move. I think the greatest compliment this movie could be given is that it is the Aladdin of live action movies without as good of script.\n\nthanks, George"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "boonplook",
        "review_rating": "10",
        "review_title": "wowwwwwwww",
        "review_detailed_main": "this has got to be the greatest film of all time. Shaq should have won an Oscar for his great acting. The musical score is the best i ever heard in modern cinema. I will be trying to find the DVD movie of this next weekend..i would gladly pay 99.00 bucks to own it on DVD. what i like even most about the film is the attention to detail..even the boombox..awesome..i want to own it. I only wish this movie was five hours long...or at least make at least five sequels..with shaq singing and rapping in all films..what an awesome movie. The wishes he makes in the film were the correct ones. It had a very emotional ending. I think about this movie every day. I believe half the audience in the theatre cried with emotion also. I have been meaning to comment on this film a long time ago..but was filled with too much emotion even to this day to come to grips in writing a review for such a gripping wonderful masterpiece in American cinema."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "canadian_daryl",
        "review_rating": "10",
        "review_title": "yo gangsta kid meets gangsta genie, with gangsta results!!!",
        "review_detailed_main": "Possibly the best movie ever made this is the gangsta version of Aladdin. No blue genie trash! This is gangsta all the way!!! I watched it and I was like yo this is seriously gangsta. Yo ya gotta catch this move, Shaq is the best actor/actress ever or at least the most gangsta!!! The boom box scene freaked me out and is not suitable for younger audiences. Yo but this man, this was g...g...a...ngsta. I Love You Shaq!!!!!!!!!!!!!!! U my main bro see ya in the hood. Whoever disses this movie is an un-gangster weirdo who I assume smells funky. Yo me and my sizzles were like yo this movie gansta. I was like I gotta write to Shaq make a sequel bro!!! I call it Kabaam, or Jumanji I haven't decided either one is gansta. I also came up with a really gansta rap: Yo Yo Yo im a gangster, My name Kazaam, Shazaam, Babaam yo yo yo gansta."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "deadeyeaim-671-117306",
        "review_rating": "10",
        "review_title": "A forgotten classic.",
        "review_detailed_main": "Now, most people who vote this movie as being \"bad\" probably had the powerful symbolism go over their heads, not that that would be to hard to accomplish. I would suggest everyone rewatch this movie closer and you will see what I mean.\n\nThis movie may be one of the most powerful commentary on the horror of gang violence and illegal sex trades in America I have ever seen.\n\nWatch the movie with that in mind and Shaqs performance will blow you away.\n\n10/10\n\nI would suggest that this American classic be in every moviegoers collection."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Holy Raining M&Ms and Candy Bars! It's Kazaam!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "lilqtpersian",
        "review_rating": "8",
        "review_title": "Very Enjoyable",
        "review_detailed_main": "OK, i'll admit that this movie is defiantly not going to be the idealistic fun, thrilling, and adventurous movie that adults these days like to see, but it is absolutely wonderful for children. It is a great family movie to watch. I loved this movie when i was young and i would still watch it today if i saw it on T.V. I love the plot, the humors and the actors in this movie. It is very entertaining for young kids and will keep them interested in the t.v. screen. I recommend watching this movie with your kids for a great family bonding time. It is cute and meaningful and might teach your children a thing or two. If your children are 10 or younger, they will definitely like it."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Anjellike1",
        "review_rating": "9",
        "review_title": "Am I the only one who thought this was actually a good movie?",
        "review_detailed_main": "First off, I will not sit here and say that the movie was perfect. However, I feel like everybody did great in their roles for their character portrayals. Personally, giving the overall movie a rating of 2.6 is a little harsh, don't ya think? It wasn't that bad, but then again I tend to enjoy ALL movies and I only know of a few that was a waste of film! It all depends on the viewer and their perspective of things. Im an artist so naturally I'm a little more open minded when it comes to judging things, but honestly, what did you TRULY expect from this movie? What would YOU have done differently? This is a general question. For me, once you can answer that, then you'll see how ridiculous panning this movie is.lol ^_^"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "thorgnash",
        "review_rating": "10",
        "review_title": "This movie is crunchy. That's a good thing.",
        "review_detailed_main": "This movie is classic. You need to see it. Max makes all the wishes you would make if you didn't believe that shack could be a genie. Anyway it has great one liners and shack is great in it. Max also grows up to be Warehouse Hood Leader in crank. Max also asks for like 15 wishes that shack cannot grant. He can give him junk food to the ceiling though. I'm not allowed to spell shack the traditional way it is spelled. wait I'm not allowed to put spiteful remarks? remember when shack did that caramel crunch commercial? it is pretty much an hour and a half of that. that still means that I really like it. well all and all it was a great movie that I saw right when it went straight to video. shaq is really tall and i look foreword to still owning this DVD. Hey I can say Shaq! I'm i mean h'm going to tell everyone!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "taroche",
        "review_rating": "10",
        "review_title": "Great family movie, deserved of criticle acclaim!",
        "review_detailed_main": "**** y'all haters, i put a lot into this performance and i was massively pleased with the outcome. I wish they had Max as a black kid just to make it seem more true to life but otherwise this was a great movie! Filming it was fun and when i showed it to my cousins they thought it was great, considering how much effort went into the production of this film and having you film 'connoisseurs' hating on it. You can all suck my fat one. For all of you out there who appreciated this film and voted 7 or above out of 10 for i want to thank you.\n\nShaq out!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Meifumado",
        "review_rating": "10",
        "review_title": "Boom Shaka Laka, Kazaam Scores!",
        "review_detailed_main": "Kazaam is a winning combination of a coming-of-age story, and a slapstick comedy, with pulse-pounding basketball scenes. Never before has the ghetto been portrayed with such realism, and shaquille O'neal's fearless performance is worthy of the recent oscar buzz. I make one suggestion to all of you, WISH that you can get tickets to see this masterpiece of the cinema."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "wedge1027",
        "review_rating": "10",
        "review_title": "Movies is GREAT!!!!!",
        "review_detailed_main": "This movie had one of the best plots by FAR! the way the movie starts with the young boy getting the crap beatin out of him then finding this magic genie BOOMBOOK!, WAS GREAT!!! i do not know who has come up with this but its remarkable! almost as good as Fear and Loathing In Las Vegas but it close up there on my list!! Also the acting and rapping my Shaq was Awesome i've never seen something so great i practically cried my eyes out when they busted in to that sweet hot lil funky number!! well, thats about all i can remember of this great movie! hope u go out and rent to you can enjoy this very well done movie KAZAAM! P.S. The ending really got me i almost cried but i held back, god bless and enjoy the film!"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "bird2431",
        "review_rating": "9",
        "review_title": "A rapping genie... played by Shaq... what could be better??",
        "review_detailed_main": "A rapping genie... played by Shaq... what could be better?? I honestly love this movie and watch it every time it graces the TV screen! It may not be the best movie ever made (it isn't by far), but it is very enjoyable to watch. Shaq did have a few rap records that many enjoyed. This movie is a lot about his rapping and the catchy rhymes make it all worth-while. I recommend it to any Shaq fan who is up for a laugh. It is also a great movie for little kids as it actually does teach a lesson. I thought Shaq did alright acting. He had another role in an even better film by the name of Blue Chips starring Nick Nolte. His role was rather limited but all in all some decent acting from an athlete."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Randyconrad",
        "review_rating": "10",
        "review_title": "Extraordinary acting, fantastic musical score and superb direction. This movie is a classic.",
        "review_detailed_main": "This movie has gotten a bad wrap over the years, but in reality, it maybe one of the best of our generation. I remember watching this movie over and over and over and over again as a child and enjoying it more than any of those cookie cutter Disney movies.\n\nWe have become so jaded and left our youth behind if we say this movie is terrible. Think about it; the acting was definitely above par for such a film, the direction was great, and the musical score was beautiful. It was subtle enough that I could hardly notice it but left me tapping my feet noticeably from the for the entire film.\n\nI love this film, always have and most certainly always will. It might not be The Godfather and it might not be Titanic but it is definitely not one of the 100 worst movies of all time. To place this piece of work there is dishonest and over all wrong! Enjoy this fantastic family movie."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "fountasalexander",
        "review_rating": "10",
        "review_title": "I named my kid Kazaam after this",
        "review_detailed_main": "Shaq is the goat bro the story was so good atleast 100/10?\n\nIdk how the plot was so interesting, the cast was just beautiful, shaq as the wisdomic genie was so poetic. Loved it so much I dedicated my whole life to this movie and named my child Kazaam."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "pauline_hellevig",
        "review_rating": "10",
        "review_title": "What's up with all of the hate here?",
        "review_detailed_main": "I am 25 years old, and I just watched this entire movie for the first time in my life, and honestly, I found this movie to be very fun.\n\nWhat do movies have to be like in order to be good then?"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "ThunderKing6",
        "review_rating": "10",
        "review_title": "Shaqaam",
        "review_detailed_main": "Shaq O'neil was selected in the 1992 NBA Draft by the Orlando Magics. From the University of LSU (Louisiana). After of only 3 years he was placed in movies like Steel, Kaazam etc.\n\nHe was a better actor than Micky and Lebro. I'm just puzzled to why he had such a short notable acting career, then again he did play 15+ seasons in the NBA so he never really quit acting... Anyways...\n\nKazaam was one of those bad, corny movies that was so awful that it worked. It's not the best movie and it sure ain't a legendary movie but if you are bored and tired after working your slave job then watching Kazaam can make you feel relaxed."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "tacarav112",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "Absolutely loved this movie as a kid. Watched recently with my husband due to him never watching it. He enjoyed it as well. Shaq really got into this role and delivered a great performance! Don't understand the bad reviews at all."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "RhymesWithBlinvy",
        "review_rating": "10",
        "review_title": "shaq rules",
        "review_detailed_main": "I believe this movie may be the best movie I've ever seen, it kicks the crap out of other movies like American beauty!!!!!!!!!!!!!! I love Shaq and this movie 2. Shaq is the best actor ever and the little punk didn't suck that bad. God I hate that kid. Too bad he wasn't a miscarriage. I can't believe the little retard got paid for this. Furthermore I believe that this movie has exemplary acting and I believe the plot was well ahead of it's time and it took my breath away. I would recommend that anyone who dislikes this movie should slap themselves for being such an ignorant dilettante. For all of you who gave this movie bad reviews fore shame."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "Mun",
        "review_rating": "10",
        "review_title": "Counter-vote!",
        "review_detailed_main": "I'm only giving this one a 10 because I don't think that this one deserves such a low rating based only on Shaq's bad performance.(either on the set or on the court) Just take a look at the great camera work, superb sfx and other performances and let yourself be entertained. If it weren't for the 10 being a counter-vote I would've given it a 7."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "danawoj",
        "review_rating": "",
        "review_title": "This is what happens when bad meets worse.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "saraht-12449",
        "review_rating": "10",
        "review_title": "Awesome movie for adults and kids",
        "review_detailed_main": "I am in shock at all the negative reviews! It's a great family movie that I've loved since I was a kid. Don't get why people are being so harsh on a kid movie smh."
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "switch44",
        "review_rating": "",
        "review_title": "my fav movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "brinap-69415",
        "review_rating": "10",
        "review_title": "kazaam for real",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "casuspy",
        "review_rating": "",
        "review_title": "Best Canadian movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "samboo-19887",
        "review_rating": "10",
        "review_title": "Don't listen to the bad ratings",
        "review_detailed_main": "This movie was a classic when I was younger, it's still just as good. As an adult, you see it differently,but, it brings back good memories. Nowadays, if you give this a bad rating, you're just an uptight prick adult. Lebrons movie \"space Jam\" was terrible and people still have it good reviews. Grow up, Peter Pan....... Actually, don't. 😜😜"
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "justinvice-17779",
        "review_rating": "8",
        "review_title": "What a movie this one is",
        "review_detailed_main": "One day i was sitting on a coach dreaming about being a 12 year old kid. Until i found this movie easerhead. It showed me what fatherhood was like. When Mr. Henry Spencer saw his child for the first time i cried. Some of my friends watched this movie with aww when i should six sense. They really like bruce willis. Bruce willis was dead the whole time. *sorry for spoiling*. Bruce willis was also very good in die hard. That movie gets a 7/10 because the title does not make sense cause he survives and does not as the title says die hard. Or maybe it does because the villains do die hard so i guess in that way its really up to to viwer interpretation on weather the title makes sense, so ill leave that up to you to explore. Now back to kazam. The moment i heard shaqs complex line delivery using the technique known as \"yelling every single line\" i knew this movie was a masterpiece. What did his movie teach me? Well, my father wasnt a very prominent part of my life, so shaq really served as sort of a father figure to me. This movie taught me that its ok to not have a dad, as long as theres someone like rap god b-ballin genie shaq to fill that role. \"I am kazam\""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "zavacky",
        "review_rating": "",
        "review_title": "Awful......!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "PinkBubbles",
        "review_rating": "",
        "review_title": "Just plain trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "pillowspam",
        "review_rating": "",
        "review_title": "Shaq is God!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "PinkBubbles",
        "review_rating": "",
        "review_title": "Stinks like a bag of burning doggie stuff...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "me-2667",
        "review_rating": "",
        "review_title": "I think this predates Rooten Tomatoes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "It's about as good as 'Shaq Fu'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "awpangle",
        "review_rating": "",
        "review_title": "WARNING: Parents don't subject your kids to this kind of CRAP",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "steve-575",
        "review_rating": "",
        "review_title": "If you sat through this pointless piece of garbage, you can sit through anything!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0116756",
        "movie_name": "Kazaam",
        "movie_rating": "3.1",
        "review_username": "lita11475",
        "review_rating": "",
        "review_title": "Whee hee, what fun!",
        "review_detailed_main": ""
    }
]