[
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ganeshkss97",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "Ghajini is an entertainer.\n\nIt has loads of action,comedy,drama and romance which makes it a family packed entertainer.\n\nThe story is good.\n\nScreenplay is penned very well.\n\nBut the problem is that the movie is long,it could have been trimmed 15-20 minutes and the movie even gets violent at times,which could have been shortened.\n\nDirection by A.R Murugadass is excellent.\n\nThe music is very good.\n\nPerformance wise-Aamir Khan is menacing.He is superb.Newcomer Asin is very good.Jiah Khan is perfect.Pradeep Rawat is first rate.\n\nOverall Ghajini is an entertainer."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Ghajini",
        "review_detailed_main": "The tattoos on the body, the Polaroid snaps, the notes scattered around the house, and the smoking gun evidence? Short term memory loss, happening every 15 minutes. If this doesn't seem like Christopher Nolan's masterpiece Memento, then I don't know what does. Written and directed by A.R. Murugadoss, I don't see much of a nod of acknowledgement to Nolan's work, and in almost all literature, it only falls back on the fact that this is a Hindi remake of Murugadoss' own Tamil movie of the same name Ghajini, produced in 2005 (Nolan's was in 2000), which joins the ranks of films having their titles named after the chief villain.\n\nIn any case this isn't the first time that we see very obvious similarities in premise and characters being adopted for Bollywood's own productions, and the shot-in-Singapore Krrish comes to mind as well, as they had the entire setting of John Woo's Paycheck incorporated into that film. But of course in any version some merits could be found, but I believe some form of acknowledgement would be in order, other than, in this case, a quick flash of a very wordy disclaimer about Ghajini being gleaned from various short stories and material (and another paragraph which I missed given the fine print, and short duration on screen, but I'm pretty sure no mention of Memento).\n\nWell, there are some reasons why I chose to watch this. First up, the music's by A.R. Rahman, and for all the good publicity he's getting for his work on Danny Boyle's Slumdog Millionaire, I just had to experience yet another piece of his musical magic on a film, besides one that I've watched much earlier this year in Jodhaa Akbar. One just cannot imagine how his musical talent will be put to good use in a film which looks and feels like Memento, and this being the next best thing. \"Guzarish\" is a track used in the trailer, and it is currently my new ear worm.\n\nAnother reason is of course, Aamir Khan. Yet another prolific actor with a penchant for perfection, it was interesting to see how his take on the protagonist's short term memory loss, would rival that of Guy Pearce's. I'm embarrassed to say I've only seen him in action in Lagaan, so this would be yet another opportunity to witness his ability which can be measured against a benchmark. But don't expect the same though, because Pearce's version was more of a thinking man who questions and second guesses himself, while Khan's version was in two parts to serve the story, one as a raging hulk monster who tears through his opponents with savage violence fueled by anger and hatred, coupled with the hurt he experienced and recalled (Hulk producers take note, in case Edward Norton decides against any more sequels, look in the direction of Aamir Khan), while the other as mild-mannered Sanjay Singhania, CEO of a telecommunications company in Mumbai.\n\nYes, Bollywood's version naturally comes with built-in song and dance, which for once I would have thought looked quite out of place in the movie, if not for A.R. Rahman's score and music. While half of the movie might be seen as a copy of Memento's premise and character, the other half served more to allow the audience to share the pain with Sanjay. Nolan's version had you experience the frustrating condition of the syndrome through its narrative presentation, but this one junks the reverse chronology, and plays it out flat and builds a rich back story for Sanjay, so much so that you'll root for him as he goes on his rampage of revenge. You'll find yourself entrenched in the romance between Sanjay and his lady love Kalpana (the stunning Asin, who reprises her role from the 2005 version as well), who's a model awaiting her big break, and a girl with a genuinely good heart. The plot never fails to give her numerous moments to showcase her good nature, and it's no surprise why anyone would not fall in love with her instantly. Factor in plenty of lovey-dovey moments of comedy and pursuit (under the guise of a different identity, like Shah Rukh Khan's Rab Ne Bana Di Jodi) which makes it perfect for a date movie, but with hindsight that you know this love is doomed from the moment it began, which actually makes it quite sad to watch the events unfold since you know what will eventually happen to her.\n\nGhajini doesn't adopt or try to adopt those very cerebral mind-f* moments from Memento, but as I mentioned plays it out more like a straight forward action thriller, with a handful of inevitable moments of watching our protagonist get taken advantaged of because of his condition. No other structural styles are used besides flashbacks, where the purpose of two characters in the movie are to read the diary of events so that it could be translated visually onto the screen. However you'll still be kept in the dark for some time as to why the designated thugs of Ghajini (Pradeep Rawat) would want to exact their mettle onto Sanjay and Kalpana, and you'll be held in suspense for almost 2 hours before the reasons get shown.\n\nI can only imagine the flak that this film might receive because of having to adapt, and not properly acknowledge perhaps that it's not original material, save for the romantic spin on it. But if you would look past those ramifications and treat this like a re-imagining of Memento in more straight-forward terms, that this would still serve as an entertaining thriller done Bollywood style."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jbragadeesh",
        "review_rating": "7",
        "review_title": "Excellent - Aamir proves it again!!!",
        "review_detailed_main": "It is very pleasant to see, in the past decade, the Indian movies has raised themselves in standards. Ghajini definitely is one of the toughest project that Aamir khan would have done, there is no doubt in that. It is not always easy to remake a hit version and alter the storyline here and there and still come out good. It is only possible through the best men in the industry. And Aamir is THE best. ARRahman - WOW!!! He made the Kaise mujhe song echo in all the audience's heart as they leave the theater. Its like \"Every night in my dreams\" song from titanic. Soul touching performance from the music Guru!! Overall, this movie has to be watched for its storyline, humor, sentiment, twists. Overall Ghajini is a great entertainment-packed. Go! watch it today!!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "siyam_hossen",
        "review_rating": "9",
        "review_title": "All in all",
        "review_detailed_main": "An exuberantly excessive and unreasonably entertaining mash-up of musical-comedy romance, action-Variety movie mayhem and psycho-thriller suspense."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rohitrakshan",
        "review_rating": "10",
        "review_title": "Ghajini is A Must Watch One.",
        "review_detailed_main": "Ghajini is a Film of Revenge, Love and Action. Executed Brilliantly By The Director AR Muragadoss. Screen Play & Cinematography is at Top Notch, We can't say flaws about it. Coming To The Oscar Winner AR Rahman who have penned an Beautiful Composition Which is aptly needed for the Film. His songs Guzarish, Kaise Mujhe, Behka are looping our ears even after the film ends...\n\nComing To Performance of Lead Actors.\n\nMr. Perfectionist Aamir Khan Nailed the Role Sanjai Singhania. A Person who Loss the memory for each 15 mins, And Searching the Murderers of his loving lady. He Perfectly Shaped into character well. And as a Business Tycoon in several scenes, He displays his charmness convincingly.\n\nAsin, The Leading Lady Who made her Bollywood Debut , Respiring her character In Ghajini 2005 Tamil Film. Is Fabulous as Kalpana. She Played her role very well and the impact of the character is strong even we leave the theatre.\n\nJiah Khan as a Medical Student does her pretty good as Supportive to Sanjay. The Villain ' Ghajini ' that is Pradeep Rawat is a Great Performer as Brutal Killer.\n\nOverall Ghajini is a Clear Cut Blockbuster All the Way...."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "leenabr",
        "review_rating": "7",
        "review_title": "Good but not great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sanddragon939",
        "review_rating": "10",
        "review_title": "An unforgettable cinematic experience",
        "review_detailed_main": "A lot of critics have condemned this film as being a mere remake of the highly acclaimed and popular Hollywood film 'Memento'. While there is no doubt that this film is at the very least loosely inspired from Memento, to call it a complete rip-off would not only be a stretch of the imagination demanded greater suspension of disbelief than that required for viewing either movie, but would also be unfair to the effort Murgadoss and the rest of the team have put into developing this epic for an Indian audience. Rather, it would be best to view this film as a separate entity, something not quite at the standards of Hollywood's best but certainly above the usual clichéd Bollywood fare.\n\nGhajini tells the story of a man called Sanjay Singhania (Aamir Khan), who suffers from a condition called Anterograde amnesia, which prevents him from forming new memories, as a result of which he is unable to remember anything for more than around 15 minutes. This condition was caused by the brain damage he suffered when hit on the head by an iron rod, during a violent attack on him which also resulted in the death of his lover, Kalpana (Asin). Haunted night and day by fragmented memories of the incident, he is driven to near-madness with rage and embarks on a quest to avenge the death of his love, by hunting down the gang behind the attack-his ultimate targets being a Mob lord about whom he knows nothing save for a single name-'Ghajini'. In order to compensate for his short term memory loss, he uses a system of notes, Polaroid photographs and tattoos on his body to remind himself of the facts he has gathered during his quest and the progress he has made. Along the way, he encounters a medical student named Sunita (Jiah Khan) who is intrigued by his condition and wishes to study him and thus ends up being dragged into his violent life. The story of Sanjay's violent quest alternates with extended flashback sequences of his happy pre-amnesiac past as a savvy corporate honcho and tells the tale of his romance with lively ad model Kalpana and the circumstances which led up to the incident that caused her death and his memory loss. Ultimately, the film comes full circle in an awe-inspiring climax when past and present collide to bring a fulfilling end to the story.\n\nAamir Khan proves his versatility as an actor yet again, playing not one, not two but three roles in this film. As Sanjay Singhania, the savvy corporate honcho, he is polite, yet has a brisk and efficient air to him (a lot like his real life self). As 'Sachin', a struggling actor romancing Kalpana he plays the shy and unassuming everyman, albeit one replete with both confidence and sincerity. And finally, most notably, he plays the post-amnesiac Sanjay, an almost insane inhuman monster, a killing machine consumed by rage and bloodlust, haunted by shattered memories and yet lost, confused and disoriented whenever his periodic memory loss kicks in. Perhaps one of the best scenes in the film is one early on where, waking up at home, Sanjay wanders through his house clueless, having no idea where he is, until he reaches a mirror on which is written a note which tells him to remove his T-shirt whereupon he sees the tattoos that remind him of his lover's death and his quest to avenge her and cause him to be suddenly overpowered by rage and a desire for vengeance-a transition which we observe several times over the course of the film. Asin does a pretty good job as the bubbly and vivacious Kalpana, making her a likable character who's brutal murder does create the impact on the audience's mind which makes us truly sympathise with Sanjay's quest. Jiah Khan does okay as the medical student who gets dragged into Sanjay's quest for revenge while Pradeep Rawat may come across as an over-the-top clichéd bad guy in his role as the titular 'Ghajini'-but it works well for the story, believe it or not.\n\nThis film is actually two films in that the darker 'present day sequences' of Sanjay's orgies of violence seem to belong to an entirely different genre from the lighter comedic flashback sequences, though the shattering of Sanjay's happy past life makes us understand the driving force behind his present day violence. The style of music, dialogue and even settings for both sets of sequences is drastically different as a result-where on one hand you have fancy office blocks, garden parties and the beach side, on the other hand you have seedy back lanes and darkened parking lots.\n\nOn the whole despite a few ridiculous plot holes, Ghajini is definitely one of the most entertaining, if not one of the best, films of Bollywood in recent years."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "carjjun",
        "review_rating": "7",
        "review_title": "Great movie..great acting!",
        "review_detailed_main": "Well, this movie is a change to the typical bollywood movie..which is a reason why I liked it so much.\n\nGhajini is a remake to the tamil movie with the same title starring Suriya which in turn was inspired by an English movie Memento. But I think personally Aamir Khan was excellent in this movie especially with his facial expressions as he doesn't have much dialogue but makes the most out of it.\n\nThe Director(Muragadoss) has done a decent job and the heroine(Asin) acted pretty well like in the tamil one basically. Jiah Khan surprisingly acted well according to me but some people i know didn't like her being casted so opinions differ on her character.\n\nThe music director is A.R.Rahman..need i say more ?!\n\nAs far as the story of the movie its pretty much the same as the tamil one except for the climax which was really the black spot in the tamil Ghajini but in this one its well thought out and most importantly directed and acted out well!\n\nThe movie is based on a man(Aamir) who has short term memory loss and searching for the killer of his lover(Asin) called Ghajini.\n\nI don't want to give out anything else about the movie as it would spoil the experience.Go watch the movie...you'll like it!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "arnab_das",
        "review_rating": "9",
        "review_title": "Do Not Miss This One!",
        "review_detailed_main": "After a long and tedious wait Ghajini arrived. There was a lot of skepticism about it being a direct rip of its Tamil counterpart as well as Memento. However when one enters the movie theatre, those factors are hardly on one's mind. And any thought of all those things indeed vanished from my head the moment the movie started.\n\nGhajini is one of the best thrillers to have come out of the Bollywood stable in recent years. And to top it all, it has a nice dose of humour as well. Aamir Khan once again proves that he's not just the best in business, but he's the one leading the way for Bollywood to make better movies. Indeed as many users have mentioned the villain Ghajini does not look menacing enough. But lets face it, gone are the days when villains used to be called Mogambo. And gone are the days when villains used to have a scar faced appearance. The new age villain is what Ghajini is.\n\nThe acting is superb to say the least. (Although Jiah Khan really spoils the party. She's better at romancing a senior citizen than playing such characters.) Asin is absolutely brilliant and leaves a lasting impression. She makes you feel the depth and the pain of the \"Kalpana was killed\" tattoo. And finally, Aamir Khan. Well, what more can one say about this man who has changed the landscape of Bollywood movies. Once again he delivers a power packed performance, I could almost feel his emotions within me!\n\nWatch this movie for its complexity and its simplicity. The complex character of Sanjay and the beautiful and cute Kalpana makes this movie one of the best movies of 2008. What an amazing way of making the year so special!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "lastliberal",
        "review_rating": "7",
        "review_title": "Before I kill you, I'll show you exactly how I killed your Kalpana.",
        "review_detailed_main": "First, the music is by A.R. Rahman, and this genius who also did Slumdog Millionaire really made this film entertaining. Thee film will be familiar to a lot of viewers, as it is a loose remake of Momento. One can hardly imagine how Rahman's music would fit, but it does because it is also a love story. How did they do that? The rich Sanjay 'Sanju' Singhania pretends to be an average Joe named Sachin. Aamir Khan was great in the dual role, and I can imagine that throngs of girls, and not a few gay men will be enchanted with him as he is shirtless in the part of the movie where he is seeking his girlfriend's killer (Pradeep Singh Rawat).\n\nThe girlfriend is Kalpana (Asin). She is fantastic and definitely will keep your interest through the long three hours of this film. She does one too many good deeds and it cost her her life.\n\nIt is fascinating in the end when Ghajini catches up with him. The steps he took to \"erase\" his memory. But, it didn't do any good.\n\nReally good combination of thriller, revenge, and love story as only Bollywood can do it."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "luna_the_cat-1",
        "review_rating": "10",
        "review_title": "Wow",
        "review_detailed_main": "This may be the most entertaining thing I have ever seen in a theater. It is apparently loosely based (via another movie) on Christopher Nolan's \"Memento\", and while I enjoyed that, this is far, far more fun to watch.\n\nFrankly, I feel like people always give away too much plot in these IMDb reviews, so all I will say is that this movie involves memory, love and some almost superhuman fight scenes.\n\nI couldn't help but have the feeling that if Hitchcock was directing movies today, they'd be like this. This is pretty much our very own \"Rear Window\" in terms of being so completely entertaining while also being amazingly well made."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Puroo",
        "review_rating": "6",
        "review_title": "I liked it until I learnt it's a remake... of a remake!",
        "review_detailed_main": "My sister was a huge fan of Aamir Khan as a kid. This is the reason why we would watch all his films. So when Ghajini came we all watched it. I learnt a lot about filmmaking because of this film - unreliable and non linear storytelling, suspense, romantic thriller, non-conventional action etc. This is the reason why I wouldn't completely trash this film like I do to other remakes. Memento is pretty cool and Christopher Nolan is my favourite director after Zack Snyder, so no disrespect to him.\n\nThe story and concept are stolen, so I won't judge this film on that. The acting and songs are absolutely dope. The cinematography, however, is pathetic. As a kid I really liked this film and felt like an adult for understanding it. I found it very annoying when someone said that Aamir Khan's name was Ghajini in this film. I think it's a huge lesson about naming your film after the bad guy.\n\nI think I would have been better off not knowing this film is a remake, because that ruined the mood for me. All those scenes where he put guns and wallet in labelled drawers: all that interesting stuff just went down the drain. It's sad that this is the first Bollywood film to gross a billion rupees. It pretty much summed up what Bollywood will become in the upcoming years."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "stupidshark",
        "review_rating": "5",
        "review_title": "Cinderella meets Memento",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "heggere",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "First of all.... GREAT MOVIE!!! I just wanted to say a couple things, clarify a few more things...\n\nFirst Half: For those who have seen the Tamil version, the first half is very very predictable. The only change I could see was Amir instead of Surya. The scenes, the jokes, the locations, everything is the same. It was hilarious in parts, just like the Tamil version.\n\nSecond Half: Similar, but the ending is very very different. After seeing the first half, I was predicting the next scene in my head and watching it come to life. Half through the Second Half, I was not able to predict too much as it deviated from the Tamil version quite a bit.\n\nConclusion: For those who have seen the Tamil version, please keep an open mind as the last half hour or so is different and quite interesting. For those who haven't seen the Tamil version, what the heck are you waiting for??"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rahilkhan1231",
        "review_rating": "10",
        "review_title": "A Must See Aamir Khan Movie ....!",
        "review_detailed_main": "After a dull period of bollywood movies, Ghajini can be described in just one word, AMAZING ! Right from the word GO, this movie keeps you on the edge of your seat . Everything from the Script, The Direction,The Action and The music to the Performances Win your heart ! The action scenes are well captured and the choreography is a job well done by Ahmed Khan. Though it is 3 hrs long not once you end up feeling bored . Moreover, the telling of the movie is done well wit back and forth time travelling... Of the performances, Aamir towers above the rest wit his 'short term memory loss' , Asin matches head to head wit aamir for a debutant and jiah proves that she is not just a damsel . The villain though could have been Better . But the real question left to be answered is Ghajini worth the hype ? Indeed it is my friends... All in all a great movie wit all the ingredients required to make a movie A BLOCKBUSTER ..... A must see...!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "amitoengg",
        "review_rating": "6",
        "review_title": "Does not live the hype",
        "review_detailed_main": "Well watched the movie in the premiere\n\nFrankly it didn't quite lived up the expectation. Aamir is good as usual. Jiah is awefull. Real surprise performance was from newcomer called \"Kaplana\" in movie. She acted very well.\n\nTouted as an action movie, i found the the romance part more appealing than the action.\n\nAnother downside was , I had watched momento earlier and many plots were direct adaption from there.\n\nIn all 6/10. Not even close to Taare Zamien pe .. But definitely one of the better movies of 2008"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ajopaul01",
        "review_rating": "8",
        "review_title": "Aamir roars in Ghajini.",
        "review_detailed_main": "Ghajini is an out an out action thriller set at the backdrop of romance and revenge drama. Its almost a frame 2 frame remake of Tamil hit Ghajini, which was originally inspired by Memento. Since I loved both the versions. It was difficult to expect anything newer or better from the Hindi version. So the verdict would mostly revolve around \"did the makers ensure the benchmarks are met\". Its a definite 'A' for being able to meet the gigantic expectations. No, the director has not disappointed you.\n\nThe high points are the few thrills that are part of the narrative, the edge of the seat kinds.\n\nWhile avoiding comparisons, Aamir is done a terrific job playing a confused and furious person in search of the killer of girl friend. His corporate getup was styled differently and looks convincing. I can already sense, the style being a rave shortly in the corporate dressing. His toned up body looks fab, and justifies few of the over the top fights.\n\nAsin has won my heart again, din't think she would be able to do so, repeating the feat she did 2 years ago. In few of the reels she literally stole the movie from Aamir. The climax is different and is better picturised.\n\nOverall when you leave the theatre you do feel if you missed something.. I can only sum up the following could be why i felt so..\n\n1. I knew the story and could predict the dialogues in advance. 2. The length was a mild problem 3. The action sequences looked dated in parts, one blow and 4 on the ground. 4. The originals were too good to repeat it.\n\nOh I wished, I had the bliss of not having watched the originals, to take a fresh look at it.\n\nFor the humongous effort of the team, go watch it if you are hungry for masalas beyond cakes and wine this holiday season.."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "modistreet",
        "review_rating": "6",
        "review_title": "A Good Movie that could have been Great",
        "review_detailed_main": "I am a big fan of Aamir Khan and his detail oriented approach towards every project he undertakes. It's with this expectation I went to see the movie. For the most part it matched my expectations. However, there were a couple of aspects in the movie which disappointed me. This is a revenge motivated movie, so action plays a very important role. Here's where the quality drops. The main villain was wrong for the part, he's been playing henchman for so long, you just can't upgrade him to the main villain's role in such a big budget movie. Second, he is such a big don in the crime world but not one of his men carries a gun. Do you buy this?; especially in the day and age where every foot soldier in a crime syndicate carries an automatic/AK47, just to gain respect. All these guys have, are broken metal pipes. Come to think if there was a gang war these guys wouldn't last a day. Aamir Khan's 8 pack abs was impressive but his fighting style and ability left much to be desired. His fighting style reminded you of \"Jo Jeeta Wohi Sikander\". One would expect with age and experience this perfectionist would have perfected the art of hand to hand combat. The plot, acting is still quite good but as far as action goes, the word \"limited\" comes to mind."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "yourz_sanju",
        "review_rating": "9",
        "review_title": "Ghajini will be praised after watching it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "akbarnali",
        "review_rating": "7",
        "review_title": "Another Innovatory Vehicle from Aamir Khan. Well, Almost.",
        "review_detailed_main": "The Bollywood remake of the Tamil blockbuster \"Ghajini\" retains both the title and leading lady (Bollywood debutante Asin) from the original. Still, you might wonder, What exactly does \"Ghajini\" mean? Literally, I haven't a clue. But after watching this three-hour celluloid saga, it seems to signify a torturous desire for love, justice, and revenge all at once. The latest attempt by Aamir Khan to prove himself more cerebral than the Bollywood standard, \"Ghajini\" emerges at the intersection of \"The Hulk\" and \"Sholay\", right around the corner from \"Memento\" and \"Army.\" But it is its own picture, one that hearkens back to the Bollywood revenge dramas of the 1980s. Dharamendra must surely be strutting proudly somewhere.\n\nThe story of \"Ghajini\" will be familiar to anyone who's ever seen a Sunny Deol or Sylvester Stallone film \u0096 or if you've read a Marvel comic in the last 75 years. Sanjay Singhania (Aamir Khan) is a debonair cell phone tycoon who falls for a struggling model named Kalpana (Asin). But Kalpana isn't content leading a life in front of the camera independent of altruism \u0096 she helps the handicapped into museums, escorts blind old men to bus stops, and even disrupts the trafficking of young girls whose internal organs are forcibly removed and sold by a gang of villains headed by a depraved monster named . . . Ghajini.\n\nGhajini cannot tolerate being challenged or thwarted, so he and his goons murder Kalpana in front of Sanjay (who is curiously left alive in an episode depicting the very worst of human nature). By the time Sanjay recovers, he is suffering from retrograde amnesia, a form of short-term memory loss wherein the patient cannot remember anything longer than 15 minutes. Clearly, avenging his beloved's murder will not be easy.\n\nEnter senior medical student Sunita (Jiah Khan) whose fascination with retrograde amnesia gets the best of her. Soon, she has inserted herself into the cat-and-mouse game and her life is at stake. She puts into play many of the most critical plot twists, though at considerable peril to her own safety. Curiosity killed the cat; it just might kill a few medical students, too, in \"Ghajini.\" There isn't anything particularly surprising or innovative about \"Ghajini\" (as \"Lagaan\" and \"Rang De Basanti\" certainly were \u0096 and memorably so). You shouldn't be surprised by how it ends. It is distinguished purely by the performances of its main players, especially Aamir Khan as a tortured avenger whose biggest obstacle is himself. He is part forsaken lover, part Sanjeev Kumar in \"Sholay\" and Sridevi in \"Army\", and part Hulk superhero whose physical strength and tolerance for pain is beyond the limits of human biology. It would be easy to dismiss his indifference to physical pain as requisite Bollywood disbelief suspension, but then, that's exactly the point: after witnessing Kalpana's murder, Sanjay is no longer human; he is reduced to a series of synapses punctuated with animal lust for violence and domination. There are more than a few scenes in the film where his behavior is more reminiscent of a caged bull than an amnesia patient. This isn't Aamir's best work, but he deserves credit for going where he hasn't ventured before.\n\nJiah Khan impresses as an earnest but foolhardy character; she is the lynchpin throughout much of the film, serving as both the character who puts the story into action and acts as the link between Ghajini and Sanjay. Mercifully, she is not cast as Sanjay's latent love interest. Curiously, she is given a staged dance number at a critical point in the film, something the film could certainly do without. Come to think of it, all of the film's musical sequences (fine compositions though they are) should be rightly deleted. They are well-placed, but essentially distracting from the narrative.\n\nThe film's most interesting yet most conventional characterization (as played by Asin) very nearly steals the show from Aamir Khan; maybe it's something about debuting with Aamir Khan (or maybe it's the fact that this is her second go at the role) but Asin very clearly reminds one of that other actress who debuted with Aamir Khan. I wouldn't go so far as to say that Asin seems to have graduated from the Juhi Chawla School of Acting, but the semblance is definitely there: the hyper vivacity, the bubbly cheeriness, the cutie pie with a healthy dose of sarcasm the hero is only too happy to suffer (romantically). The idealized Kalpana will remind you of many gummy sprite roles of the past: a big hearted, well-intentioned impish beauty with a big mouth. Think Juhi Chawla in One Two Ka Four (or Kajol In K3G). . . or Juhi Chawla in Ishq . . . or Juhi Chawla in Bol Radha Bol. You get the point. But the real point is that a star is born: Asin is here to stay."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "daksands",
        "review_rating": "10",
        "review_title": "brilliant",
        "review_detailed_main": "well...everyone has the right to their own opinion....but in my own i feel ghajini has heart..it is on of those movies which take you down to reality and touch every human emotional chord in your body...LOVE is what it talks about and how it drives a person so mad when he loses it...i think there is a person inside us who wishes he could play the role aamir did ....but we are scared of doing that...i think aam ir has done a fabulous job and my final judgment is...people who love crying and don't feel ashamed to let their emotional side touch them..its worth a watch..well you should deffo watch it...people who are heartless the main comment wud suit u....that is that aamir cant act no more...well guess what he can and and only passionate and emotional ppl who have loved once in their lives can understand that...5 out of 5...cheers..."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "yonkers20",
        "review_rating": "6",
        "review_title": "Aamir, not that perfect",
        "review_detailed_main": "Logically speaking by the time a person suferring from \" anterograde amnesia\" with a 15 minute memory, trying to recollect things would not be able to. By the time he reads,sees photos, shouts, his 15 minute is up and he will have to start again and then again.\n\nAamir has worked hard on this movie, no doubt.He is one person in bollywood who takes the pain to get into the character unlike others who just changes hair colour and think they are in character.\n\nHe knew he had to come up with a brilliant marketing plan that being his sculptured body.For his next movie he is going to get rid of his 8 packs.Brilliant!!!!.\n\nI think 80% of the budget was spent on Aamir's food and his trainer. They should have spent more on the script. Because you have lot of things to tell doesn't mean the movie should be 3+ hours long. The songs were unnecessary and did not add to the story.The script does not allow you to be on the edge of the seat.Too many things thrown in between.\n\nYou never feel any chill when the villain shows up.Not sure why there are no cops in the movie(except of the one who came under the bus), how does he go scot free when comes to the building house and kills Kalpana. No eyewitnesses? Songs not very good but the background score was excellent. Action scenes are OK. Asin did a good job, comic timing is good. Jiah was mis casted.\n\nThis movie is a one time watch only for Aamir.By the way I don't think any corporate honchos would dress like Sanjay S. The songs where Aamir is seen in many roles is just to plume himself."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mukund_rebel",
        "review_rating": "2",
        "review_title": "Nolan got a new tattoo on his chest \"Murugadoss killed Memento!!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "tommyphilip2000",
        "review_rating": "10",
        "review_title": "This Movie Rocks",
        "review_detailed_main": "Aamir Khan is truly mad and goes at them with his entire anger....\n\nAll the recent records in the bollywood industry have been broken by this one man....\n\nGhajini is a masterpiece.....the recent release like RNBDJ and the rest don't stand a chance at this movie...It is already the highest grosser ever in the history of Bollywood...I am an SRK fan but after seeing this I have decided to change my mind....Aamir has proved that what SRK and Akshay can do.he can do it better...SRK's OSO needed the entire the entire industry to make it a hit but....this has broken the week's record collection of OSO in just 4 days...[:O]..so no more arguing needed here Aamir Khan is the god..."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rsa5387",
        "review_rating": "8",
        "review_title": "Expect The Expected",
        "review_detailed_main": "An 'Indianised' Memento, Ghajini is a masala pot-boiler revenge film that is low on distinctiveness, instead relying on vibrant cinematography, over-the-top action sequences, and superlative performances by Aamir Khan and Asin to deliver the goods. Not surprisingly, Ghajini is another tour-de-force turn by Aamir Khan, as he effectively takes to the skin of his character, exuding the laundry list of human emotion, and even bordering on animal-like in his revenge-driven state. Elsewhere, Asin infuses the right-amount of over-the-top histrionics, charm, and girl-power to make her character appealing and ultimately the emotional center-point of the film. The rest of the cast is barely adequate, with the so-called medical student, police inspector, and the main villain verging on the comedic with their clichéd, wooden performances. But, it didn't really matter. The main characters were crafted with such integrity and likability that by the end, I can honestly admit I was on the verge of tears. In the end, Ghajini was a somewhat unremarkable film that was lifted by its high-emotional quotient and some outstanding compositions by A.R. Rahman (Guzarish, Kaise Mujhe), the screeching background score aside. Worth watching once."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "springsunnywinter",
        "review_rating": "7",
        "review_title": "Aamir Khan's worst movie to date",
        "review_detailed_main": "The only Aamir Khan release this year is a remake of a south Indian film of the same name which is similar to Hollywood film Memento. A thriller that revolves around Sanjay (Aamir Khan) with a short-term memory trying to catch some killers. Memento is one of the most unique and intriguing thrillers of all time that you immediately want to see again and it is one of my most favourite films. Ghajini is just an inspiration but not exactly a remake and anyway remakes don't bother me so I just seen it as how entertaining it is and it is also an Aamir Khan film and he is one of the best actors in India.\n\nGhajini was absolutely rubbish, awful and I never realised that how long 3 hours can be. The movie just does not get to the point and Sanjay's back story was dragged so badly that I just can not explain. The new girl Asin can't act at all. There wasn't any drama, romance, action, thrills and any masala for a Bollywood movie and Aamir Khan couldn't even save this turkey. The budget is a lot higher than Memento which is about 40 crore ($11 million) while Memento was $5 million and I just don't know that where all that money went probably to Aamir for doing this pile of trash. The music is really good composed by the legendary A R Rehman and the best songs are Gurarish & Aye Bachchu but the songs are forced into the film and they jump out unexpectedly. If I haven't seen Memento before then I still would've not liked it. Bollywood really need to learn to be more original. Anyway the director of this movie can't even copy well then never mind coming up with something original."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "pratikf",
        "review_rating": "9",
        "review_title": "Excellent!",
        "review_detailed_main": "Ghajini... where to start. This movie has kept me on my seat for almost the entire 3 hours, and left me with wanting to watch it once more. The direction, screenplay, acting and music everything was truly amazing. A very well co-ordinated movie.\n\nSome might look at this movie as a 'Dark Comedy'. It truly is... This movie reminds of Momento and Kill Bill (both great super-hits).\n\nPros: - Very well known, and super-hit story (from Tollywood). NOTE: Even though concept is same as in Momento, the story is very different. Plus I liked the Bollywood flavor, since it introduces a love-story aspect.\n\n\n\n\n\nCons: - Well, the one thing I didn't like is the length of the movie. There were one or two places where I felt like the scene was unnecessary and the movie could have been shortened.\n\nNevertheless, I might just go watch this movie again. In fact this movie has inspired me to watch Momemto again. This movie is not for everyone, and the only reason is too much violence. But I can guarantee that anyone who is tolerant to violence, and looking for a new story (and hasn't seen the Tollywood version) will definitely love this movie.\n\n9 on 10 from me. Best movie of 2008 (and 2009 for me)."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "indyamayflower",
        "review_rating": "",
        "review_title": "Ghajini - a rare heartwarming Romance laced with violence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "virindra",
        "review_rating": "6",
        "review_title": "Aamir Khan the King of Bollywood?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "charismaticgaurav",
        "review_rating": "10",
        "review_title": "Ghulam Returns!",
        "review_detailed_main": "Watch it for Aamir. Movie ain bout action... its bout Aamir's intensity...\n\nIt's gripping, it's got a good flow. Just when you find yourself being carried away with the moment, it justifiably changes.\n\nThe reason why I gave it a 9 rating instead of 10 is only for the sake of neutrality... action scenes are a bit dramatized. Although it defies my statement of watchin it for Aamir, yet thats the only flaw for \"me\" in the movie.\n\nThe movie doesn really need a long feedback... for Bollywood followers, Aamir - \"naam hee kaafi hai\".\n\nAamir speaking 5 mins in a 160 mins movie def'ly made W.O.R.T.H it!\n\n~ Hrithik Fan! (lol)"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "gaurishkohli",
        "review_rating": "7",
        "review_title": "Substandard version of Momento",
        "review_detailed_main": "Well nobody can doubt the cinematic brilliance of Christopher Nolans Momento, but Ghajni is able to put forward a decent version of Momento omitting the structure of the original piece. But most of the plot still resembles of Momento"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "tayyebus",
        "review_rating": "10",
        "review_title": "Blockbuster of the Year",
        "review_detailed_main": "The wait is finally over! An Aamir Khan film is nothing short of an event. The supremely talented actor acts in one film a year and no two films are ever identical in terms of plot line. No wonder then that you await an Aamir starer with bated breath. the Hindi adaptation live up to the humongous expectations? The hype is unmatched and you expect no less than a present-day masterpiece. Running time almost 3 hours? Not at all! There's so much happening in every scene and the screenplay is so gripping that you don't feel the need to look at the auditorium ceiling or at your watch at brief intervals. You aren't restless. As moviegoers, we've watched countless good versus evil fares over the years and although GHAJINI belongs to the same family, not once does it take the beaten track. The story has been told differently and most importantly, the story offers so many twists-n-turns that you just can't guess what would unfold next. Director A.R. Murugadoss tells this one differently. It starts off with what happens in the past, comes to the present-day, goes back in time again and returns to the contemporary again. This is a breathless, exciting story, heart-breaking and exhilarating at the same time.\n\nOn the whole, GHAJINI is a winner all the way. The film will set new records and has the merits to emerge one of the biggest Hits of all times. The weekend business should be historic, the Week 1 business should be unparalleled, the lifetime gross should be amongst the biggest of all times. In short, GHAJINI has 'Blockbuster'\n\nCancel whatever you're doing today and go watch GHAJINI instead."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "wildlife-ptech",
        "review_rating": "6",
        "review_title": "Watchable ultra violent remake of Memento",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sourishnet2005",
        "review_rating": "9",
        "review_title": "A SOLID bollywood masala movie !!!!",
        "review_detailed_main": "Carry a pack of pop corn and cans of cold drink and enjoy this film with friends ,it has everything , starting from action , humour , sympathy , thrill , romance , revenge and what not and not to mention Aamir was the captain of all these departments . Out of so many positive things the most important thing is the actress Asin , never saw an actress so expressive and ,not to mention, so beautiful . Asin and Aamir was enough to make the film a HIT.\n\nAamir's hard work on his body paid off , he really transformed himself from a teacher in taare zameen par to a Hulk in this film\n\nThe picturisation and the music was excellent\n\nAction scenes were well shot and quite enjoyable seeing the villains fly but was astonished to see the villains had no guns during their fight .\n\nThough the idea was from Hollywood blockbuster 'Memento' but the film had no similarity with it but yet enjoyable\n\nIn a nutshell its a its a Solid Hollywood idea Bollywood masala film\n\nI am giving Ghajini 9/10"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "kaustubh-2",
        "review_rating": "10",
        "review_title": "One of the best Hindi movies of 2008",
        "review_detailed_main": "Ghajini is perhaps one of the best Hindi movies of 2008. Like Taare Zameen Par last year, Aamir Khan does something special in the second-last week of the year. And Ghajini belongs almost entirely to him. He makes you relate to his character. If it wasn't for Asin, the movie would've been all about Aamir Khan. She is probably the find of 2008. You cannot even compare her to Deepika Padukone or Anushka Sharma, both of whom had equally hyped launches. The movie packs in almost everything in those 3 odd hours, without compromising on content. The music, by A. R. Rahman, is consistent with his reputation, and doesn't take anything away from the movie or the performances. But, the star of the movie is Aamir Khan, and if there's one reason to watch the movie, it has to be his performance."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "amensto",
        "review_rating": "",
        "review_title": "Rubbish mockery of Hollywood movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sashank_kini-1",
        "review_rating": "7",
        "review_title": "Really good B-grade blockbuster!",
        "review_detailed_main": "Recently, I had seen the reviews of Ghajini by Rajeev Masand on CNN-IBN where he told that Ghajini was a full fledged b-grade entertainment. I'd have to agree with him on the fact that Ghajini looks and feels completely B-grade. Yet, it manages to succeed in bringing life to the story and its characters. Its not a copy of Memento completely; in fact, I do not think that it would have succeeded if it was a copy of Memento as it would have been disliked by the audience for its plot. The director tweaked the plot a bit so that it would be indianized.\n\nGhajini has really good performances by the lead pair, Aamir and Asin. Asin, in fact is really funny and deserves the accolades and awards that she is getting. Aamir has worked on his body a lot ( His body transformation keeps coming of Tatasky) I think that he should have been at least nominated for best actor even though Hrithik deserves the award.\n\nThe bad performance comes from Jiah Khan, who doesn't seem to dominate her scenes and can be forgotten easily. The villain too was okay.\n\nWhat the film lacks in is the special effects. The action scenes are hilarious as Aamir bashes one even before you realize that that he has bashed five before. They are poorly shot and typical South Indian type.\n\nThe film is not violent at all. I've seen many other movies that are brutal compared to this. There are many loopholes in the movie that are glaring and clearly noticeable. The pace of second half of the film slows down and gets a bit boring towards the end. Also the script could have improved a bit. The songs were good but forgettable, except for probably Guzarish. Also, the song, Lattu seems completely out of place.\n\nOverall, a really good film which is flawed in some ways. 7 out of 10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "namashi_1",
        "review_rating": "8",
        "review_title": "Ghajini, A winner all the way!",
        "review_detailed_main": "Short-term memory loss, violence, songs and witty dialogue sum up as 'Ghajini'. A R Murugadoss's 'Ghajini' is escapist cinema at its best. A winner all the way in that category. A Power-packed entertainer, with fantastic action, loads of violence, beautiful music score and first-rate performances!\n\nWhat else to we need? Ghajini rocks. I was gripped from start to end while watching this revenge-saga. The film proved to be a Blockbuster Hit at the box office worldwide, and yes it deserved every bit of it. Bravo!\n\nLets Go With The Pluses First: Fantastic action sequences. Peter Hein and Stun Siva deserve an ovation for their extraordinary work. Beautiful music score by Oscar-Winner A R Rahman. Excellent performances. Aamir Khan is fantastic from start to end, his performance makes Ghajini a treat all the way. Asin is superstar material. Jiah Khan is relegated to the backseat, nevertheless she's good. Pradeep Rawat shines as the conniving villain.\n\nMinuses: The film could've been trimmed by around about 10-15 minutes.\n\nOn the whole 'Ghajini' is a through entertainer. Go for it. Two Thumbs Up!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "kaustubh-rajnish",
        "review_rating": "6",
        "review_title": "More Tollywood than Hollywood",
        "review_detailed_main": "Ghajini (Critics 3/5 , Viewers 4/5)\n\nGhajini is the Tandoori pizza, Mcaloo tikki which Indianisation tends to do to all things western.\n\nPicking up the premise from the 2000 cult Memento, Ghajini's director A.R. Murugadoss soups it up with copious amounts of violence (lot more than the original had), a cute love story and serves ultimately a well-executed and hard-core Chopsuey revenge flick.\n\nAamir khan plays Sanjay Singhania, once a cell phone tycoon now a psychopath looking to eliminate his fiancé's killer. His is a tormented soul and battered brain so much so that he suffers form short-term memory loss. He cant remember anything and forgets everything within ten minutes of it happening. But he does remind himself of one thing which is that \"Kalpana was killed\" and he needs to avenge it.\n\nThus he takes photographs of the people and places he requires for ready reference and tattoos clues on his body which will lead him to the killer, some unknown Ghajini. The film has flashbacks of what might have happened but they too don't reveal all. At the same time every time the breezy romantic flashback comes on, the viewer gets a sense of unease that things will go horribly wrong any moment.\n\nThe film runs on Aamir Khan, the undisputed king of all Bollywood. With a super toned body, which he showcases more than Salman would have in all his films put together, Aamir khan plays both the suave tycoon and the angry psychopath to perfection. Any other actor snarling like a dog and actually salivating would have looked laughable but Aamir looks menacing and yup pretty scary.\n\nHe is super angry and he doles out his justice in furious wrath. Of course it's not all bang bang. The film has enough of pointless song and dance sequences (some of them good), a very pretty and fresh Asin as the love interest and some fairly funny moments of mistaken identity. At the same time the action of some characters defy logic at most times but then you should not have been expecting logic in the first place.\n\nAs a matter of fact if by any chance you go in expecting a Memento then be prepared to be heavily disappointed, except the premise there is nothing common. It is not even a murder mystery or even remotely philosophical which Memento had undertones of.\n\nTo be precise the movie looks more like a remake of the Tamil version with pastel color videos and jump cut editing with swooshing sound effects. Not to mention the drama and overly done up sets. Very Tollywood indeed.\n\nBut in the end it's all in all, good fun to watch with some pretty crisp action sequences (which are also surprisingly violent by Indian Standards) and some thrilling edge seaters.\n\nEven the bad guys though nothing exceptional are unintentionally funny.\n\nHighly Recommended to fans of Southie cinema, Aamir khan fans and the masses who are bound to whistle every time Aamir khan bashes a bad guys head into the wall. Another year, another film and another hit for Aamir Khan. He sure is unstoppable."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "cruzer11",
        "review_rating": "9",
        "review_title": "Awesome- must watch",
        "review_detailed_main": "Ghajini is an awesome movie experience. After ages I have seen a Bollywood movie so involving and intense. Aamir Khan has taken acting to a different level altogether ! The only similarity with the original English movie Memento is the concept of short-term memory loss and using Polaroids & tattoos to remember stuff. Ghajini is modified to suit Indian tastes- blends a romantic story beautifully with the action. I recommend everyone to go and have a blast. This movie is going to raise the bar in acting- all those so called superstars who take the audience for granted should go and understand what true acting is all abt. Hats off to Aamir- he is simply fantastic !! Asin too does her role beautifully - couldn't have asked for a better debut!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sant2050",
        "review_rating": "7",
        "review_title": "Ghajini - It's grand",
        "review_detailed_main": "Ghajini - the name is catchy. Here is the plot in brief: Aamir Khan as Sanjay runs a successful company 'Air Voice', a mobile connectivity provider. An upcoming actress, lovely Kalpana announces to the world the super influential Sanjay is her boyfriend bending to certain circumstances. Her fortunes change, so do that of Sanjay. Captivated by her kindheartedness and trueness, he indeed becomes her betrothed. Her intuitive helpful nature leads to her murder and the beating Sanjay too receives in the episode to his short term memory loss which renders him incapable of remembering anything beyond 15 minutes. His hunting down of the killer forms the rest of the story.\n\nThe making of the love between Sanjay and Kalpana is cute and a delightful watch. Sanjay's coping up with the handicap of fleeting memory by the tattoos all over his body, an ever-accompanying camera, a slew of notes is all mystic and the viewer is readily sucked into his curious ways of life. The hulk-like figure Aamir sports will catch many admiring eyes as well.\n\n\"Memento\" from which Ghajini borrows, borrows so only in principle. \"Memento\", which was more about managing the incessant memory loss is converted into a love story and the display of superman like powers of Sanjay, the focus nowhere on the medical condition.\n\nClearly, far from being a path-breaking film, Ghajini is still a reasonable watch keeping in tune with the Bollywood sensibilities."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "goldenpalms_2006",
        "review_rating": "9",
        "review_title": "Aamir's Back with a Bang",
        "review_detailed_main": "I've just seen the first day first show of Ghajini n boy o boy. Its been a long time the we've actually seen him working for a movie which is a complete Indian Masala movie.This man has always given us variety ever since he has started acting.\n\nNo doubt why they call him a perfectionist. Undoubtedly he is the best amongst all the Khan's. No comparison.\n\nComing back to the movie I'll not disclose many things about it. Performance wise Aamir was fantastic as usual and rest of cast was OK.\n\nGo watch it guys this is not as disappointing as \"Rab Ne\".\n\nAamir you are the best."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "planktonrules",
        "review_rating": "7",
        "review_title": "A remake of a remake of \"Memento\"",
        "review_detailed_main": "\"Ghajini\" is an Indian film remake of Christopher Nolan's \"Memento\"...though there are MANY changes in the remakes. Yes, there are two Indian films called \"Ghajini\"...the original Tamil film and the Hindi remake. I have not seen the Tamil language film but have seen \"Memento\". It is interesting that the same director made both Indian movies, but the stars of each are different as well as most of the cast.\n\nSanjay (Aamir Khan) is a man with a most unusual injury. Someone has smashed him over the head with a blunt object and now he has antegrade amnesia and can only remember new information for about 15 minutes before it's completely forgotten. He can remember everything before the attack. So, like the protagonist in \"Memento\", he spends the movie investigating who did this to him and leaves himself notes, takes photos, or tattoos notes on himself in order to remember his progress on the case. One, in particular, tells him to 'find Gajini'...whoever that is. At the same time, someone is looking for him...perhaps to finish the job, perhaps to make sure he never remembers the attack....or perhaps something else.\n\nWhen you see the film, you likely will notice how much Aamir Khan bulked up for this role (and for several macho roles since). He obviously spend a ton of time in the gym! At the same time, you can also see that the film had a very impressive budget for an Indian movie...with excellent production values and a real sense of style. And, like many Indian films, it comes with some big production numbers...song and dance numbers that might seem odd to those not acquainted with films from this country.\n\nAlthough I liked the film, a good question is do I prefer it or \"Memento\". Well, I slightly prefer \"Memento\" because it lacks the backstory and kooky relationship you find in \"Ghajini\". This is because it keeps the focus more on the hero and his plight...whereas at times, \"Ghajini\" feels as if it's two different movies. Still, it is well worth seeing."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "puneet-bhatia-in",
        "review_rating": "5",
        "review_title": "Over-hyped Masala Flick",
        "review_detailed_main": "Ghajini only goes on to show what hype can do for a movie.\n\nThe movie may well be on its way to become one of the biggest grosser in Bollywood. But at best, it matches up to an above-average Sunny Deol flick. Had the movie not featured Aamir Khan it would not have been nowhere close to what it is now.\n\nBollywood has had a history where many a venture has sunk despite hype but what worked for Ghajini was a sustained and immaculately planned publicity campaign. That it was Aamir's sole movie in the whole year, and was coming a whole year after his poignant Taare Zameen Par, already had the nation in good anticipation. This combined with the publicity given to Aamir's (over-hyped) physique and supposed eight-pack took the hype to newer altitudes. The marketing team also made sure the bulked-up Aamir was visible in malls and public places. Days before the release, one could see the once-considered reticent Aamir giving interviews on every possible show on every possible channel. Newspapers and websites were flooded with Aamir's 13 month rigorous training to get his look. Also, to engage a larger segment of the audience, romantic promos augmented the initial action-oriented posters.\n\nThe end result of it all had to be a bumper opening for Ghajini. Needless to say, all this wouldn't have worked so well for another actor; but Aamir's hysteria is unparalleled and his fan following spans all sections of gender, class and religion. The loose ends of Shahrukh's \"Rab Ne Bana Di Jodi\" also proved beneficial for this film and the \"thinking\" audience thronged the halls to see if Aamir had fared better. For the rest, who weren't really the star's fans, they went anyways to see what all the hype was all about! So how did I find it? The film is loud and the background score louder. This morning I concurred with my colleague who told me that he left the hall with a heavy head after watching this film. Even the overall music, barring a song or two, is forgettable and below-average by Rahman's standards. Majority of the songs stand out of the story and merely extend the length of the film.\n\nIf action happens to be your genre of choice, you will enjoy the punches and villains being banged on walls and windows. If not, then you'd be sitting at the wrong place for those parts of the movie. What however holds your attention is the narrative; the director manages to engage you through the entire film. When the gore goes heavy, a romantic flashback alters the tone and pace of the movie. In this regard, the editing is slick and crisp. So even if the film could put some of you to sleep, it won't give you the opportunity to yawn! In terms of performances, Asin wows with her refreshing act. She lights up the screen and (due apologies to Aamir's fans) steals the thunder from right under the actor's nose. It's a pity she didn't get her due with the superstar taking most of the credit. You wait for her to come on screen; be it simple acts of helping people around her or faking up her romance with the business tycoon \u0096 she portrays the character of affable Kalpana with élan. In fact, it is the flashback sequences in which she appears, that were most enjoyable.\n\nIt is surprising that Aamir, known for choosing his films very selectively, opted for this South Indian remake. Even though his character is central to the film, he doesn't have too many dialogues. As a guy suffering from short term memory loss, he shows his frustration to a degree but doesn't have much else to do than beat up anyone and everyone coming in his way. Perhaps, the director could have focused more on the confusion and tribulations he faced due to his problem. As the business tycoon in flashbacks, his witty act makes you laugh. But in one of the scenes when giving interviews to international media, he didn't sound convincing as a magnate. All in all, his performance was satisfactory in the context of the film. He didn't break any new ground with this, as some people claim. As for achieving the macho look, I don't think with the support available these days it is such a Herculean task for an actor known for his sincerity and perfectionism.\n\nAs the bad guy Ghajini, Pradeep Rawat disappointed; he tried hard to mouth Haryanvi dialogues but was neither effective nor convincing. Perhaps, the movie would have been elevated to another level had the villainy act been more polished.\n\nThe cinematography by Ravi K. Chandran was par excellence. And be it the exotic locales of the Guzarish song or dark shots of the climax sequence, he has shot them all brilliantly. The action sequences have a South Indian influence even though some of them are executed well.\n\nGhajini, as a one time watch, was entertaining even for someone like me not particularly into action movies or Aamir Khan. But the cult status to which it has been elevated is definitely not justified. It is a clearly over-hyped and has garnered undue credit than what it is worth. I'm sure people had higher expectations from Aamir but for fear of being sounding different, no one wants to admit that."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "www-anjali",
        "review_rating": "8",
        "review_title": "Gripping!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "class_mass",
        "review_rating": "9",
        "review_title": "showcasing of the true love - the base of true love is good qualities of a person and equal interaction of its kind.",
        "review_detailed_main": "It was a great experience while watching the film. The film can fall in three main categories such as romance, action and thriller as it is a thriller that has some great action sequences followed by endearing love story. The love story is very unique and I can't recall that any film in the past have presented with such an excellent love story. This is exemplifying of great love and makes the viewer to be fall in love for the characters. It is very hard to find such kind of people in today's materialistic and professional world as shown in the film. Both the characters have all good qualities such as honesty, simplicity, innocence, sacrifice and above all true feeling for each other and all these are without even a single cuddle or say shown as that. The action sequence followed by this kind of love story makes it justifiable which has been also shot nicely to give right impact to the film.\n\nIt is very obvious that the demise of this kind of lovable person can make worst effect on another person's mental condition as hero's condition becomes in the film after heroine's murder. That's why the revenge is justified and becomes prevailing as shown in the film which has been presented nicely with some great action sequences with very good screenplay.\n\nOverall it is an excellent film."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "polisovil",
        "review_rating": "7",
        "review_title": "The wait is finally over!",
        "review_detailed_main": "The wait is finally over! An Aamir Khan film is nothing short of an event. The supremely talented actor acts in one film a year and no two films are ever identical in terms of plot line.\n\nGhajini, the Tamil version, has been a massive hit and so was its dubbed Telugu version. Will the Hindi adaptation live up to the humongous expectations? The hype is unmatched and you expect no less than a present-day masterpiece.\n\nGhajini is a revenge saga, one ingredient that has been the staple diet of Hindi films since time immemorial. It is a powerful film. It has the power to sweep you off your feet from the word 'go'. It has a riveting story, which has been told with flourish by director A.R. Murugadoss. And, of course, it has a knockout performance by Aamir Khan.\n\nThe flaws? Running time almost 3 hours? Not at all! There's so much happening in every scene and the screenplay is so gripping that you don't feel the need to look at the auditorium ceiling or at your watch at brief intervals. You aren't restless. As moviegoers, we've watched countless good versus evil fares over the years and although Ghajini belongs to the same family, not once does it take the beaten track. The story has been told differently and most importantly, the story offers so many twists-n-turns that you just can't guess what would unfold next.\n\nIs it violent? It is, at times, but the violence here is justified. In fact, every time the protagonist bashes up the evil-doers, you clap and root for him. The climax is jaw-dropping \u0097 dissimilar from the original, but it's an out of the world experience nonetheless.\n\nTo sum up, Ghajini is commercial Hindi cinema at its best. The film has 'Hit' written all over it. Let me put it this way: Cancel whatever you're doing today and go watch Ghajini instead.\n\nAamir Khan is suffering from acute short-term memory loss set off by the violent murder of his girlfriend Asin. He's got to work around this handicap, but with methodical and meticulous determination. Aamir etches a path of clues that lead him on his road.\n\nTo aid him in his quest, he carries around a sheaf of Polaroids and when he is really sure of a piece of information, he has it tattooed on his body, which stands in for the damaged part of his mind. His indelibly marked torso is the repository of his grief, his rage and his reason to go on living. Any more revelation would do gross injustice to the film and to its viewer.\n\nFirst things first! Ghajini is not Memento. There're minor similarities, but Ghajini takes a completely different route to tell its story. Director A R Murugadoss tells this one differently. It starts off with what happens in the past, comes to the present-day, goes back in time again and returns to the contemporary again. This is a breathless, exciting story, heart-breaking and exhilarating at the same time.\n\nHindi movies have often depicted people suffering from amnesia/memory loss, but Ghajini is poles apart because the protagonist recalls events only for 15 minutes. The story is its USP, without a doubt. But what adds sheen and glory to the story is Aamir's portrayal of a man suffering from short-term memory loss.\n\nAamir hardly speaks. In fact, the leading lady Asin speaks more than Aamir in the film. But Aamir speaks volumes with his eyes, he conveys whatever has to be conveyed through his body language, he says it all with his facial expressions and that only makes Ghajini a memorable, never-seen-before experience.\n\nDirector A.R. Murugadoss deserves brownie points for not just coming up with an interesting story, but also presenting it refreshingly differently. The storyteller balances the light moments and the ones demanding intensity with expertise. There's dumb in every sequence. Even if the director has to depict violence, he doesn't resort to blood-n-gore or knives-swords-pistols for effect.\n\nA R Rahman's music is top notch. At least three numbers have the unmistakable stamp of a genius \u0097 'Guzarish', 'Behka' and 'Kaise Mujhe'. Ravi Chandran's cinematography is stunning. The film bears a stylish look all through. The action sequences are brilliantly executed. The Hindi moviegoers haven't seen such scenes ever.\n\nAamir delivers his career-best performance. In the first place, it requires courage and maturity to name the film after the villain. Knowing how egoistic our stars are, something like this is next to impossible in Hindi films.\n\nA lot has been said and written about the Ghajini look \u0097 Aamir's hairstyle and his dream physique. As far as his acting is concerned, he's natural as the tycoon, but like a wounded, ferocious tiger when he goes on an avenging spree. Without doubt, it's a concentrated, layered performance. He acts with his entire being. His body movement, the details of his performance, everything rings true. He is both vulnerable and hard. The pain in his face when he can't remember, is palpable. It's not only the plot that carries Ghajini. It's also the mood and the expression on Aamir's face that makes Ghajini a treat.\n\nAsin is fabulous. To share the screen space with an actor of the stature of Aamir Khan and yet remain in your memory even after the show has ended is no cakewalk. She looks fresh and photogenic and acts her part brilliantly. Pradeep Rawat, the villain, is first-rate.\n\nOn the whole, Ghajini is a winner all the way. The film will set new records and has the merits to emerge one of the biggest hits of all times. The weekend business should be historic, the Week 1 business should be unparalleled, the lifetime gross should be amongst the biggest of all times. In short, Ghajini has 'Blockbuster' written all over it."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rajatdahiyax",
        "review_rating": "10",
        "review_title": "Even after 15 minutes i still remember that movie was par AWESOME!!!",
        "review_detailed_main": "Ghajini is a 2008 Indian action psychological thriller film written and directed by A. R. Murugadoss and produced by Tagore Madhu and Madhu Mantena. The soundtrack and score is by A. R. Rahman. It is a remake of Murugadoss's own 2005 Tamil film Ghajini starring Surya Sivakumar in the lead role.It stars Aamir Khan, Asin and Jiah Khan in lead roles while Pradeep Rawat and Riyaz Khan essay supporting roles. The film was inspired by Christopher Nolan's Memento.\n\nThe film explores the life of a rich businessman who develops anterograde amnesia following a violent encounter in which his love interest, model Kalpana, was killed. He tries to avenge the killing with the aid of Polaroid Instant camera photographs and permanent tattoos on his body\n\nGhajini is currently the seventh highest grossing Bollywood film according to worldwide gross collections."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "TuFNuT",
        "review_rating": "6",
        "review_title": "Plays To The Galleries..",
        "review_detailed_main": "Its one of the most hyped movies in Bollywood history and over the past eight months we've heard and seen it all \u0096 the hair cut, the jokes about the Aamir-ferocious-look, Aamir's guide to get the 8-Pack abs and the brilliant marketing campaign in build up to the release, which will make for a fascinating case study to be studied by marketing students at the country's premier B-Schools. But talking about the core product itself i.e. the movie \u0096 Ghajini, one has questions. Is it yet another cinematic masterpiece coming from the Aamir Khan school of cinema? Does it live up to the tremendous hype? Is it the best movie of the year? Unfortunately, as is often the case with over- hyped extravaganzas the answer to all these three questions is NO. But is it a bad movie? Certainly not! That this will be liked by the movie goers by and large and that it will be a blockbuster is a foregone conclusion.\n\nFirst up, let's set the record straight. Ghajini is a remake of a South Indian movie of the same name which itself is inspired (the favorite word for Indian film-makers when they blatantly copy foreign material) from Christopher Nolan's masterpiece \u0096 Memento (2000). Therefore, you can't credit it with any points for originality. But director Murgadoss's 'Ghajini' is NOT a scene by scene copy of Memento. And how could it ever be? The film makers realize (or assume) that the average Indian movie goer is too unintelligent to grasp an intriguing, non linear type of storytelling with a twist in the end that would leave him dumb founded. Hence, to rake in the moolah, the film makers turn Ghajini into mishmash of Memento and Masala cinema of the 70's and to add icing on the cake \u0096 action straight from the Rajnikanth School of Martial Arts. Now that is what makes for entertainment for the masses!\n\nGhajini's 'Indianised' storyline has all the three hallmarks of a blockbuster, the 3Rs \u0096 Romance, Revenge and the Righteous ending. It has a back and forth style of storytelling which doesn't warrant a crossword solving approach by the viewer. Sixty percent into the run time and the viewer knows what it will culminate into!\n\nThe romance element in the movie is endearing with newcomer Asin doing a great job of playing the chirpy girl next door and Aamir as the ambitious business tycoon mesmerized by her earthy ways. We break into romantic ballads courtesy dream sequences (The tracks, Guzarish and Kaise Mujhe will go down as A.R. Rehman's best works). The romance blossoms, but the inevitable tragedy strikes and a revenge seeking animal is born.\n\nThe build up to the climax is great as the screenplay engages the emotions of the viewer making him feel the grief and pain of the terrible tragedy of the protagonist's girl friend brutally murdered in front of his own eyes. You expect one-helluva ending, something like the ending of 'Unforgiven' in which Clint Eastwood left you awe-struck. But Ghajini's climax is laughable! Aamir Khan gets possessed by Rajnikanth. Dhoom-dhaam-dhishum, bodies fly in the air at the touch of a finger! Mission Accomplished! From start to finish, Ghajini is dominated by the one and only, Aamir 'Ferocious' Khan. It is the sort of role only a few can do justice to and performance wise it won't be an understatement to say that even the toughest of men in Hindi cinema like Dharam Paaji (in his prime) or Sunny Deol couldn't play the revenge seeking Sanjay Singhania any better than Aamir Khan! Yes, as always he successfully re-invents himself and hats off to that! But you can't help but wonder what was his motive in selecting this role? Maybe because, its a tailor made role to get the whistles from the 'front rows' and an attempt to establish himself as the biggest undisputed superstar of Hindi Film Industry.\n\nAll the dissection done, Ghajini is an entertaining and riveting affair, a onetime watch but nothing beyond that. One expects an Aamir Khan flick to be an intelligent affair and the film-makers (Aamir included) uses this image to masquerade Ghajini as a different, creative and intelligent piece of work which it is certainly not. Ghajini is conveniently contrived and has half a dozen plot holes which if given attention to insult your basic intelligence! Why the pretense? Why not sell it as a no-brainer-masala pot-boiler in the first place?"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sakithdulnim",
        "review_rating": "10",
        "review_title": "Best Hindi movie ever",
        "review_detailed_main": "Even this movie is the same as the Tamil one it's better because of its actor's performance, lovely songs and the storyline. Highly recommended!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "vicky-bahl",
        "review_rating": "7",
        "review_title": "Don't expect a memento out of this, but you can expect a surprise!",
        "review_detailed_main": "So, you saw all the amazing trailers of Ghajini on TV and you are all set to watch this Bollywood remake of Memento (one of my all time favorites). If you know what Memento was all abut, you have seen and appreciated it, then please stay away from this violent, musical, south- Indian flavored version of the masterpiece.\n\nBut, if you are someone who loves Aamir khan, and you really want to know that how can a teacher from Taare Zameen Par, can transform into a 6-pack, muscular, all flying piece of Jason Statham kind action hero, go and watch Ghajini. Ghajini takes you for a ride of a lifetime, but it is nowhere near what Memento was. It feels more commercial script and too full of violence. It could have been a bit more intense, not just bodies flying here and there. It has all the characteristics of a good bollywood masala movie, but it is NOT a masterpiece, NOT a Taare Zameen Par or Lagaan or Swades. It is more of a Mohra (old days masala violence) kind-of movie, which takes you and your friends for a joyride, and you can enjoy it with pop-corns and a cola. Sit-back, relax, appreciate, and forget. That's what 'commercial bollywood' is all about.\n\n7/10 - mostly for Aamir's acting (somewhat over'acting too)"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "aashishramandahal",
        "review_rating": "10",
        "review_title": "simply a great story telling ..",
        "review_detailed_main": "Its a emotional roller-coaster. It makes you smile , make you fall in love with character, you hate the things that folds before them ... in overall sense you will love this unique film of that period . I personally started writing diary after watching this movie. It was this movie of aamir khan , i started believing his choice of movie and his performance ."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "kunalkhandwala",
        "review_rating": "7",
        "review_title": "Aamir Khan's powerful act",
        "review_detailed_main": "One cannot emulate Christopher Nolan's Memento. Even the dream of it is far fetched. While South India attempted the first version and called it 'Ghajini', A.R. Murugadoss decides to have a Bollywood version of Ghajini but not Memento! This was the biggest drawback of Aamir Khan enacted Ghajini which still shattered box office records and won over the masses. Ghajini, though enacted to perfection by Aamir Khan with some intense and gruesome action, looks too South Indianish in most parts and could've done so much better with a touch of class by a Bollywood director.\n\nThe first half deals with Sanjay (Aamir Khan)'s past prior to 'the incident' that changed his life and nervous system. A wealthy business tycoon, falling in love with an upcoming model Kalpana (Asin) brings a few laughs and charming moments as the story builds up to the incident that changes Sanjay's life forever. Ghajini is the man who took his love and memory away from his life and Sanjay's daily routine involves the relentless hunt for his faceless nemesis. Just like we saw in Memento, Sanjay uses tattoos, photographs and notes to relate to people and places everyday since his memory lasts for only 15 mins. Thereafter, he has to rely upon his memorabilia to make sense of life around him. All that Sanjay remembers are vague scenes of the incident and an agonizing pain that rips through him, reminding him of his loss which turns the restless loner into an uncontrollable monster. The film's action scenes are often too violent and incredulous, as one would expect from a Tollywood adapted flick.\n\nThe director's best touch is the depiction of the incident that changed everything in the flashback. The film is so intense at that point that it would set your heart pounding loud enough for you to hear. Few other scenes have been well depicted in concept and craft but its pace is easily broken by the unnecessary songs that are among A.R. Rehman's worst creations, barring the superb melody of Guzaarish which stands out like a rose in the desert of cacti. Had the first half involved less of the love story and music, Ghajini would have been a lot better and succinct. Murugadoss cannot be as gifted as Christopher Nolan and therefore, Ghajini cannot bear the beauty and intricacy of Memento. It has been made for entertaining the masses in true Tollywood/Bollywood style and by the looks of it, has succeeded to a great extent.\n\nAamir Khan is the sole reason to watch Ghajini. His dedication to his role, professionalism and hard work to get into a body builder's shape are conspicuous in every scene of the movie. Even if you head to the theatres just to watch him, it's a trip worth taking down that memory loss lane."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "incredible-rahul",
        "review_rating": "4",
        "review_title": "a loose, over-rated and over hyped flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "andosonniamath",
        "review_rating": "10",
        "review_title": "Best movie I ever saw",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Rifat_Rock_Don",
        "review_rating": "10",
        "review_title": "A High Level Masterpiece Bollywood Movie of all time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "CriticRoshan",
        "review_rating": "7",
        "review_title": "Glass half empty or glass half full",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ctoitech",
        "review_rating": "9",
        "review_title": "A good action love story after lots of year",
        "review_detailed_main": "Just think about the action films that have been released these years. Just fighting and fighting without a story backbone. Nut Aamir the perfectionist made Ghajini way away from those junks. Ghajini which is a remake of Tamil hit Ghajin by Surya and Asin had a good story unlike recent Bollywood movies. just think a film like Singh is Kingh is Blockbuster for the year. But Ghajini would bring back the best movie time. I gave a 9/10 for the movie for the fact that Jiya Khan didn't make the impact that was done by Nayan Tara in the same role in Tamil. Change in the climax of Hindi version is excellent compared to Bad climax of Tamil Ghajini. A R Rahmans music did play a good role in the movie. In Tamil Ghajini all the songs are of same beats and passion. But ARR made all songs in the movie unique.Asin had proved that she is the next Shreedevi but better than ShreeDevi.She proved that she suited for all language once again."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "malove-6",
        "review_rating": "6",
        "review_title": "ghajni",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rontii",
        "review_rating": "9",
        "review_title": "Better than the original",
        "review_detailed_main": "\"Ghajini\" is the most awaited movie of Amir khan so far,and Mr.Perfectionist did not let that expectation down. I saw the Tamil version before watching the Hindi version,so the story was pretty known to me. The one thing for which I went to the was Amir's acting.And I am very very much satisfied with it.Although the movie is inspired from Christopher Nolan's classic \"MEMENTO\",but the storyline is much more inclined to a typical masala movie.Asin looked very beautiful,Jiah Khan although has to improve her facial expression.Pradeep Rawat has done a good job.A.R.Rahman's background score was superb.Direction is good.But one thing...the main thing...\"Amir Khan\".The change of facial expression,action scenes,the scream for revenge...superb.Go for Ghajini,for amir's acting,for A.R.Rahman's music,for the action scenes."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ridzadi",
        "review_rating": "6",
        "review_title": "Over-hyped!",
        "review_detailed_main": "Surprised with my vote?\n\nWell, I guess all the hype killed Ghajini's potential. Hats off to Aamir Khan and Asin to save the day, Jiah Khan is total crap and the villain is somewhat okayish.. I'm a hardcore fan of Aamir Khan so you'd know my level of anticipation.\n\nAll round the movie there are these little details (which actually wouldn't matter) but they just don't logically fit in..\n\nAsin has delivered a brilliant performance and so has Aamir. But all in all, despite the \"dragging\" of a few scenes, I'd recommend this movie as a \"sit at home and watch\" piece of work.\n\nI now refrain myself from watching the Tamil version just in case I'm provoked to reduce my rating."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "visa151",
        "review_rating": "10",
        "review_title": "A wonderful Aamir's gift",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "MsClashKingYT",
        "review_rating": "7",
        "review_title": "COPY!",
        "review_detailed_main": "Great Film apart from the part that it copied Christopher Nolan Memento"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Peter_Young",
        "review_rating": "3",
        "review_title": "Stupid, unnecessary remake with dreadful \"acting\" by Aamir Khan",
        "review_detailed_main": "I am still in shock after hearing Aamir Khan criticising Memento. He criticises a film a remake of which he is going to star in??? And then I decided to watch this film. And what's new? My first reaction is: why was this film made? Scene to scene copy of Memento. And even then again, it was already remade into an Indian film in the past, so why then was that needed?\n\nAamir Khan hams throughout and his acting is pretension at its worst. It's not the young actor I used to like, whose simplicity covered the entire screen. He is now someone who pretends to be a good actor, who pretends to portray himself as someone who takes a role seriously, but in the end, his acting generates into annoying hype. No intensity, no skills, nothing. And BTW, he is not at all that fit. If I were the director I'd rather cast John Abraham or Hrithik Roshan, who could make full justice to this role in terms of physical appearance and general credibility.\n\nAsin is nice; overacts in some scenes, but does have some charm. She's not a great actress, but she is an actress without a doubt. Giah Khan is average.\n\nIt's sad that this film was such a big hit. Indian mass audiences generally like to watch films which are melodramatic and overdone or just mediocre films which show a fake world. Ironically, Raja Hindustani (a cheap film without any vivid storyline) was one of those films.\n\nIt's sad because, while many of the films deserve the money they earn (take Sholay, Dilwale Dulhania), many are just terrible disasters that seem to appeal to all those who prefer to see a different, plastic world, and that's how many small-great films are simply and shamelessly left out.\n\nI'm not against any film as long as it is entertaining, exciting, interesting and well-made. But I am against films that are just not needed, that are pretentious, that are made to fool people, to insult their intelligence by pretending a film is of a high standard; and above all, films that were made just to publicise the leading actor. Ghajini is one of those films that apply to all these descriptions."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "vishnumohanc",
        "review_rating": "9",
        "review_title": "A good film worth watching for.....................",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "bharat_als",
        "review_rating": "10",
        "review_title": "Great second half..!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "bob_bear",
        "review_rating": "",
        "review_title": "Worth watching for Aamir alone...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sinncross",
        "review_rating": "7",
        "review_title": "A faltering tale of revenge...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shashank-jain-16",
        "review_rating": "10",
        "review_title": "An all time best Bollywood masala film",
        "review_detailed_main": "GHAJINI demonstrates how strong film-making can enhance and elevate an already solid concept.\n\nGHAJINI is a revenge saga, having the power to sweep you off your feet from the word 'go'. It has a riveting story, which has been told with flourish by director A.R. Murugadoss. And, of course, it has a knockout performance by Aamir Khan. If at all there's a shred of doubt whether Aamir is The Best in the business, all you've got to do is check out GHAJINI.\n\nThere's so much happening in every scene and the screenplay is so gripping that you don't feel the need to look at the auditorium ceiling or at your watch at brief intervals. You aren't restless. As moviegoers, we've watched countless good versus evil fares over the years and although GHAJINI belongs to the same family, not once does it take the beaten track. The story has been told differently and most importantly, the story offers so many twists-n-turns that you just can't guess what would unfold next. The climax is jaw-dropping -- dissimilar from the original, but it's an out of the world experience nonetheless.\n\nTo sum up, GHAJINI is commercial Hindi cinema at its best. The film has 'Hit' written all over it. Let me put it this way: Cancel whatever you're doing today and go watch GHAJINI instead."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "thakazhi2002",
        "review_rating": "6",
        "review_title": "A technically good but a typical Bollywood Masala Action Thriller",
        "review_detailed_main": "Today I went out to catch the much hyped Ghajini, which is a remake of a Tamil movie with the same name, with some of my friends. Had some expectations from Aamir since I have the experience of Lagaan, Dil Chahta hai,Rang De Basanti and Taree Zameen Par with me.\n\nNo doubt, Aamir can act well, specially the devilish stuff so convincingly. But the weak script, wrongly chosen cast (Some of them) ,the action sequence and the length did the damage. In his real screen avatar as business baron Sanjay Singhania, I saw a very unconvincing Aamir. But he delivered the Sanjay 'Revenge' Singhania part very decently.\n\nAs Kalpana, Asin did her best.. but the 'loud' acting and the extra gestures we see in the Tamil movies were there in her acting. But a good start for a girl, who is trying her hand in Bollywood.\n\nIt was like a Tamil movie with Aamir in the lead when you see the action scenes. The typical Tamil (read south Indian) action sequences in which the hero just bash the baddies with no mercy and throwing them around..and no matter how many they are..15,25,50.....\n\nBut on the technical front, this movie works at big time. The Cinematography and the sleek editing, some of the well directed scenes,lighting and the music score. But the background score lacks the quality at times when it comes to the darker side of the movie.\n\nIf you are going the see an Aamir Khan movie, this is not what you are looking for. But you can just tolerate him in the movie and the first half is entertaining too. Its the second half which makes you think why you are here inside the theater.\n\nBut this movie will work for its well planned marketing (read hype). And the second reason is Aamir because everybody will go there to watch what he is doing this time!\n\nGuys you can wait until aamir release its DVD (Buy a VCD I suggest)"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "yeleswarapu-pavan",
        "review_rating": "8",
        "review_title": "Wholesome entertainer..........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "karthickgopal",
        "review_rating": "6",
        "review_title": "Good watch if you have no preconceived expectations by matching Hollywood.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shoaib_qureshi47",
        "review_rating": "10",
        "review_title": "Ghajini Rocks----- Aamir proves it again!!",
        "review_detailed_main": "Well well well!! First of all it is not copy of Memento!!!! The films love story is awesome!! Aamir khans expressions and acting is simply outstanding!! Asin has done a great job!! In all it is an typical mas ala movie!! with nice action!! The film soul is the story between Aamir and Asin!! Its sweet....\n\nAamir proves no one can catch him......\n\nThere is no dull moment in 3hrs!!\n\nIt keeps yo on the edge of your seat!!\n\nmy Rating 10/10!!\n\nGo for it!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "saxena_ashes",
        "review_rating": "6",
        "review_title": "Ghajini the Fighter",
        "review_detailed_main": "Having seen the first 20 minutes, I had adamantly argued with a friend that Ghajini was exactly Memento. Polaroid pictures with names on them, tattooed mirrored text on a well-built body, the same underlying revenge plot, all remind you of Memento. I was quite wrong though. Memento was a much intelligently made movie with an unknown actor (Guy Pearce) as the protagonist, still reaching #27 on IMDb's all time top 250. Ghajini, on the other hand, terribly depicts an Indian masala replete with action, romance, drama, dream song sequences, and stars the best Indian actor. There can be no comparison between Christopher Nolan's masterpiece and A R Murugadoss's Ghajini. Even Aamir Khan did not understand Memento as he mentions on his blog, and you might want to keep your brains at home while watching Ghajini.\n\nA business tycoon (who rolls up already shorter-than-half sleeves of his shirts in his business meetings) cannot register fresh memories after an incident that killed his romantic partner. He manages his memory through tattoos, notes, pictures and reminders. Finding Ghajini out and killing him is the ultimate goal of his life. The story now follows two parallel plots, the present, and the flashback through an over-stretched diary- reading session, where AK introduces the reader to his associates and romantic adventures a la Tom Riddle from Harry Potter, and there ensues a normal romance-revenge drama. Once you survive through, the although predictable end is sort of likable.\n\nAamir Khan, no doubt, worked (out) a lot for the film. The concept of anterograde amnesia is very fresh and novel for Indian cinema. But alas, there it ends. Murugadoss forgot to pay attention to the other pieces. So while the movie is a blockbuster, looking at things other than AK's abs would reveal tons of plot loopholes, a dragging narrative, repetitive jokes, and pathetic acting by almost everybody else. Despite his new-found muscles, the short and stocky Aamir incredulously thrashes equally well-built men a foot taller than him.\n\nJiah Khan couldn't even act properly to drink water. Kalpana was satiatingly cheeky and moronically funny and a huge fan of Mother Teresa, but Asin did some justice to the role. Pradeep Rawat definitely did much better as Sultan in Sarfarosh and as Ashwatthama in B R Chopra's Mahabharata than as Ghajini where he looks a South Indian unsuccessfully faking a thick Haryanwi accent. The other nobodies looked acting schools aspirants. ARR's music too was a let down. I liked only Kaise Mujhe Tum Mil Gayin, the others have silly lyrics and catchy beats.\n\nThe clone has heavy undertones of the Tamil version. The extras, the accents, the ambiance. Anyone would have better watched the original instead. Another big blunder was the nomenclature. The Tamil movie is about a concept 'Ghajini' from Mahmud of Ghazni, who invaded India 17 times till he succeeded; but the history link has been screwed up by naming the villain so.\n\nThe length of the film is a full three hours. Had I edited it, I'd have retained the first half an hour, the last half hour, and extracted another half from the middle two hours. Ghajini, which could have been an seat-gripping psychological thriller, ended up being a predictable romantic revenge drama, which had to have a stupid epilogue. Aamir Khan is the only good thing; the movie failed to live up to my expectations, and would fetch only 6 out of my scale of 10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Movi3DO",
        "review_rating": "3",
        "review_title": "Comparing this to Nolan's Memento is an insult",
        "review_detailed_main": "Hmm so it's inspired from Memento huh.\n\nThis is the first Bollywood movie that I have ever watched, so even though I'm about to trash on this movie, this is not my opinion on Bollywood movies as a whole.\n\nSo the premise is this guy had retrograde amnesia, so he only retained new memory for 15 minutes. Even though the characters in the movie kept repeating this premise, the movie didn't really hold up this interval. In one of the scenes, where another character explained things to him, I was so confused because that should have taken more than 15 minutes, which meant explaining everything to him was pointless.\n\nThe story was also tonically inconsistent. Unlike Memento, which made audiences slowly piecing everything together, this movie showed flashbacks that explained the whole movie. However, the flashback and the present felt like watching two different movies: the former is a musical romance comedy, while the latter is a serious thriller. Sadly the romcom took the bulk of the runtime and overshadowed the thriller, where the premise was important.\n\nThe romcom just felt weird and laughable. Right in the first flashback, I was taken to a music video that showed our main protagonist as a horny playboy that would hard simp on his crush. And there were 2 or 3 more that kept becoming hornier.\n\nCharacters were also unrealistic. The main protagonist was an angry steroidal revenger in the present and a horny womanizer. The female lead was hecka double-faced. She was super nice and also a liar. I wouldn't like her character and have some fun with the movie if she wasn't so attractive.\n\nAh the action scenes were fake. They covered it up with fast and erratic editing that didn't help at all. The editing, overall, made everything in the movie so excessively dramatic.\n\nOverall, it's hard to take this movie seriously. I can only sit through 3 hours of this because of the hot actress and I watched with my buddy. 3/10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "amadaslamrai",
        "review_rating": "10",
        "review_title": "A True BlockBuster Movie",
        "review_detailed_main": "Ghajini is one of the best films of Bollywood and one of the great films of Bollywood of all time\n\nThe movie has got every thing romance,comedy and a quite thrilling and one of the rare and best action movies of Bollywood. The acting is superb especially of Aamir Khan and Asin in this highest grossing film of bollywood of all time.\n\nMovies music is one of the finest and top class of all the time.A.R Rehman has done a brilliant job especially in Guzarish and Kaisey Mujhey.Movie is a must watch for any audience.\n\nTaran adarsh a critic has give Ghajini the rating of 4.5/5\n\nAll most 95% of the people who have watched the film have liked it.Like always there are people who hate it too and give ghajini the most worst comments but these are those people who don't like Aamir khan. I would say the movie is a must and basically the movie has the elements that would be attracted by the audiences which are pan Pakistan, Indian\n\nIn short the movie is a true deserving and Blockbuster hit."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "trigger_jam",
        "review_rating": "8",
        "review_title": "Ghajini is good",
        "review_detailed_main": "Ghajini is an out-&-out action movie. Therefore, although it is unconventional it follows some of the roles that fix it into the action movie category. If you're going to analyze this movie from outside that, then you may so choose to do so but that would be criticizing a fresh water fish for dying in the ocean. No matter that. It isn't a perfect action movie but it has several moments of near perfection. Aamir Khan's performance brings about most of those moments. His work on his body certainly makes the action sequences more believable. But the violence and action isn't unjustified and for that we have an equally balanced portion of the story dedicated to the establishment of Asin's character, Kalpana. She aptly balances Aamir's rage and justifies his almost inhuman desire for vengeance. Ghajini did not exceed my expectations but it didn't disappoint them either. It did very well as an action movie which is all it is trying to be. Nothing more, nothing less. Thank you for reading."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "A Solid, Hard-hitting, Violent but Gripping Thriller",
        "review_detailed_main": "If its Aamir, then it has to be big and something first of its own kind. It's really commendable how Aamir has emerged as an icon synonym with quality and success in the last decade. There is a huge gigantic difference in his initial movies and the current world famous epics namely, 'Lagaan' & 'Taare Zameen Par'. His latest offering \"Ghajini\" is also as expected based on a novel theme, which is a first in Hindi Cinema.\n\nI called it a first as in the opening few minutes only you are introduced to a disturbed hero who is a hardcore killer. He is shown brutally killing a person and just after his cruel Kill-act he goes still and stands wondering why the person lying on the floor is killed and who killed him. Certainly the Indian (Hindi) viewers have never witnessed this kind of sequence before, so the audiences are simply awestruck looking at the proceedings on the screen. And with a rock solid performance by Aamir, the film starts impressing you as it moves ahead.\n\n\"Ghajini\" is said to be a remake of a South Movie with a similar name, but I was a little disappointed as I found it all inspired and quite similar to the Original English Flick, \"Memento\". Though it's not entirely a lift but no doubt certain sequences got their inspiration from the original and there should be no denial to that. The basic plot is surely inspired with some Indian elements and sentiments added to the recipe. In fact I was expecting Aamir to declare this himself with dignity and honesty but he chose to take the other way instead.\n\nThe movie is a well crafted product technically and holds you tight in the first half hour. But as the love angle of Aamir and Asin is introduced, movie becomes light and usual. The songs in this part work as a drawback and could have been avoided. The grip returns whenever the evil persona of Aamir is on the screen and that is the strongest merit of the movie. Looking at Aamir, you can feel that he has gone deep inside the character and is truly living the role with all his efforts. That's why he is called a perfectionist. It is purely due to Aamir's passionate performance that \"Ghajini\" becomes a worth watching flick.\n\n\"Ghajini\" is simply a revenge thriller with the hero killing the villain and his associates. The turning point is that the hero has a short term memory loss problem due to his head injury caused by the villain. Interestingly, he can only remember the last 15 minutes of his life and has to be reminded again of his friends and enemies. He is a millionaire owner of a cell phone company but poses to be a simple man in front of his love Asin. Asin looks fresh and provides the required emotional depth to the screenplay. Unfortunately she is killed by the villain \"Ghajini\" in front of Aamir and in the incident he also gets a serious head injury leading to the memory loss. A college student, played confidently by Jia Khan, helps him in his revenge, knowing his mental condition.\n\nApart from the lead characters, all the supporting cast entertains in the right dosage but the choice of villain could have been better as he was not able to generate the right amount of terror on the screen. His language and way of rendering the dialogues also were not that impactful. I remember how intensely the villain was introduced in the movie \"Gardish\" featuring Jackie Shroff. Something of that sort was needed here.\n\nMusically I found only two songs equivalent to the name of A. R. Rahman. Rest all songs were not enjoyable at all. Moreover in my opinion such an intense movie should be a songless one, because songs work more as an obstacle in the otherwise tense and gripping screenplay. Another strong point of the movie is its background music and sound effects which add another dimension to the thrilling sequences.\n\nThis time there are some flaws in this Aamir movie which was hard to digest because Aamir is known for his detailed work on every element of the script.\n\nFirstly, why and how Aamir simply vanishes from a moving bus when the Inspector was chasing him? Secondly, why the movie has been titled with the name of its villain \"Ghajini\" and why there is no explanation given for this particular name or title chosen. Thirdly, how Aamir manages to escape the Law after making so many killings? He is not caught even when many know that he was the killer. Was this possible because he was a rich person having private planes and a huge status in the society.\n\nIf you can just ignore these flaws and want to watch an intense, gripping, violent and hard hitting revenge thriller then \"Ghajini\" will not disappoint you. You may have seen umpteen revenge thrillers before but \"Ghajini\" has certain new elements which will keep you glued to your seats. The first one is no doubt the amazing body work done by Aamir and second is the truthful dedication with which he enacts his part in the movie. He simply looks engrossed in the movie from head to toe and that makes the performance superlative than all others in the business.\n\nMost of the film-makers make movies to please the viewers and earn money but Aamir is more interested in amazing his viewers and enjoys making movies to satisfy his inner urge. That's what gives him a cutting edge over and above his contemporaries.\n\nSumming up, \"Ghajini\" is not a regular stuff for all and some may love to dislike it. But there is only one thing you will remember after watching it and that is \"Aamir Khan\" and his love for the craft. Period."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "m-alioner",
        "review_rating": "9",
        "review_title": "Do not Watch this movie If you want to live happily",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Aamir punches the lights out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "honshu5",
        "review_rating": "7",
        "review_title": "Ho Hum...",
        "review_detailed_main": "I tried to avoid writing a review for Ghajini because: 1. i love Aamir Khan's work, in general & in the movie 2. i hated the movie because i was expecting a remake of Memento\n\nHowever, i got a chance to watch it again. The first time i watched it, i was bored to death, waiting for the love story to move on & the real movie to keep continuing. I was really expecting a remake of Memento & desperately wanted the movie to proceed in the same manner, for whatever reasons.\n\nWe were a large group of friends who went to see the movie. After the movie, we were divided into 2 parts: those who had seen Memento were bored & disappointed, those who hadn't had enjoyed the movie thoroughly.\n\nBut, this time when i saw the movie, I actually liked it! & not because its an Amir Khan starer, but because the movie does form a good plot / script, with acceptable performances & great photography!\n\nThe movie was well (re) written, addressing the Indian viewers. The story begins at a point towards the end (& not AT the end), and a flashback is smoothly inserted halfway into the movie!\n\nAlthough a large part of actors suffer from bad acting, especially the irritating & downright stupid Jiah Khan (i wanted to kick her at times!) and also the police inspector who seems to have an agenda of his own, coupled with tasteless & immature acting.\n\nThe roles played by Asin, Amir & the villain ( i don't know his name) were quite passable (though not great), but it wove together a story that was very radical & quite watchable for general viewers. I remember we went for a paid preview & the cinema was half empty. But the next day onwards, the tickets were selling in black (i heard that word after quite a few years!)!!!\n\nAlthough this movie is nowhere near RDB or TZP, its a choice work from a dedicated actor. I wouldn't know if the director was capable enough to handle such a movie, or whether the scriptwriter got confused while translating the Tamil version to the Bollywood one, but a lot of the movie still played to South Indian movie style tunes, something that doesn't work at all in Bollywood.\n\nSome action sequences were stupid & some actors equally dead-faced!\n\nI think the only thing that holds the movie is : THE STORY!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "MovieInspector",
        "review_rating": "10",
        "review_title": "Aamir 'mr perfectionist' Khan does it again. Newcomer Asin is great too.",
        "review_detailed_main": "Credit must be given to the director, A.R Murugadoss, and the production team for their part in making this a great film. It is actually an unforgettable film, with a hard-hitting performance by Aamir Khan as someone who suffers from Amnesia following a particular incident. He has shown why he is the best actor in bollywood.Newcomer Asin has also done a great job in the female lead; I expect her to have a great career after making a great start with this. The screenplay,music and cinematography are all good. The action is great. The music is also great. The best two songs are 'Guzaarish' and 'Aye Bachchu'.\n\nVerdict: unmissable. I give it 10/10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shariq_forever",
        "review_rating": "6",
        "review_title": "Good action film but great Asin",
        "review_detailed_main": "I give 7.5/10 to the whole movie. Aamir Khan as usual 10/10, Music score 6.5/10, Photography 5/10, Editing and Direction 8/10, Story 5.5/10, And ASIN 10/10. Yes Asin is brilliant in this film she acted so natural, she is extremely beautiful and sweet heart. She should be the next queen of Hindi cinema. I even got angry and cried when she was dying so naturally. Her acting is brilliant. She was the only entertainer of the film, I mean who makes you laugh. Action sequences are very thrilling and many will see without taking a breath. Overall it is a revenge thriller so many may not like it but Aamir khan has done his job perfectly. Every action lover must watch this movie."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ankit4189",
        "review_rating": "8",
        "review_title": "Blockbuster written all over it",
        "review_detailed_main": "Easily the most awaited movie of the year... and it does not disappoint you.Truly you get back to the Hindi cinema of 1990s having action,romance,thrill just everything.It is not a complete copy of Memento but a masala version of that.With a villain Ghajini, played ferociously by Pradeep Singh Rawat, is the kind of villain who wears thick gold chains and rings on every finger.Amir is as usual brilliant in both the executive as well as the monster 8-pack look.The surprise package is Asin who is so charming and even overshadows Amir in some sequences.Action sequences are excellent, bollywood has never seen such action.My advice would be to watch this movies as soon as possible, though a long movie 3 hours of length but one never feels bored..This movie has crossed all limits of marketing and is getting the best release of all times but truly it deserves all the attention it is getting......and Amir u r the BEST!!!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "anirudhdatta",
        "review_rating": "7",
        "review_title": "Good... Worth a Watch... But the movie has its negatives",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mayankgates",
        "review_rating": "1",
        "review_title": "Not Upto Its Hype",
        "review_detailed_main": "There are already many reviews of Ghajini even before its release. All who follows bollywood forums knows that there is a fight between Aamir and SRK fans and since Rab Ne has become such a hit Aamir fans are having hard time swallowing it. That's why you are seeing lots of great reviews of Ghajini for past 4 days.\n\nLuckily I am neither Aamir or SRK fan. I just came back watching Ghajini and I will say its a big disappointment. I don't need to tell about the story because everyone knows about it.\n\nFilm has a good first part mostly because of Asin, She has done a remarkable job only bright thing about this film. Where Aamir has you know worked more on his 8 Pack Abs and nothing more. He did not put much effort as he usually does. Result after the death of Asin films gets boring its more action, senseless action. If you are trying to get over 26/11 don't watch this movie as everything you watched on Television about 26/11 will come flashing in front of your eyes. Any way another weak link about the movie is Giya Khan, She just can't act. Director has tried to fix all these problems with more and more action which is impressive if you don't watch Hollywood Movies but If you have watched some good Hollywood Action Movies, you will find Ghajini's action ordinary.\n\nThis film is remake of a tamil movie with same name but when you watch the movie you'll find that it has taken lots of scenes from successful Hollywood Movies as well like Hulk and many more. Its not a movie but Hindi verison of trailers of many Hollywood Movies.\n\nOnly watch it if you are Aamir Khan's fan or you like action movies otherwise skip this movie. It has nothing what we use to see in Aamir's movies."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "abhishekkr2-1",
        "review_rating": "8",
        "review_title": "Too much of a \"mood jump\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rups-shri",
        "review_rating": "9",
        "review_title": "Another superb movie",
        "review_detailed_main": "Great movie!!!...Full of thrills... Excellent acting by Amir.\n\nThough this movie is a remake of a south-Indian 'Ghajini' and though the story is taken from a Hollywood movie, this movie keeps you glued to your seat for almost three hours. Songs were really not required in this movie.\n\nAsin's acting is not up to the mark, but you don't want to see her when Amir is acting. Amir really did well to get into the character. To gain eight pack abs in the age of 43 is really challenging and Amir did it very well.\n\nIn short, Another Hit for Amir!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Angelus2",
        "review_rating": "",
        "review_title": "The song 'Guzarish' was the only decent thing about Ghajini",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "psarjun",
        "review_rating": "6",
        "review_title": "Too Much of TAMIL STYLE",
        "review_detailed_main": "Be it Action Scene, Romantic Scene, and the Song Sequences .. One can easily taste the style of Tamil Movies in it. That Doesn't matter for a Remake, this movie is a Remake of Gajini (Tamil) and Not Momento (Since Momento is already remade to Tamil as Gajini, and the Tamil UNIT is behind this movie also). Suriya's Gajini was a Huge Hit all around South India, Thanks to Beautiful Songs and Charming Suriya. And What Happened to Ghajini in Hindi? Its also very Stylish, have ONE Catching Song, 6 to 10 Pack Aamir Khan etc etc.. Result is a Super HIT again. But when I watch the Tamil Version now, I feel as if Tamil version have something more than the Hindi, except the Climax, as the Hindi Climax is Far better than the Former. The Main Department where Tamil Score is Suriya's Screen Presents and Songs."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "vaibhav_bhandeo",
        "review_rating": "9",
        "review_title": "Watch It For Amir Khan - Hysterical Performance",
        "review_detailed_main": "Atrocity is not bound to a sick mind but it can be for avenge of the purest part of you which is love. How could a person with a stature of our protagonist can became so brutely insane that he literally butchers people who come in the way of his path of revenge but most importantly of all is the answer to question for justification of this gruesome act. The mind bobbling find-and-kill tail of a nerve wracking, high pulsating and ferocious sequence of violence embedded with adorable sequence of serene soft romantic moments makes Ghajani the most talked about movie even before it was released and surely the movie live up to the hype and hysteria which was created earlier.\n\nInspired by a Hollywood cracker \"Momento\" not even a single sequence in this movie falls anywhere down to the era created by the earlier blockbuster. In totality it actually put Ghajani on top thanks to the animosity and ferocity displayed by ace actor Amir Khan . He has created a cult for society by playing Sanjay Singhnia and surely it will wipe off all the earlier images he built. I am sure the gray shaded role he has played in this movie will become the most liked gray shaded role performed in recent times. He is a gem and just polishing the shine further with every single movie is he making, absolutely impacable.\n\nThe story line is also altered from it's original tamil version (Of course from it's Hollywood version as well) and for good only. There are actually two parallel stories which run through first half and the pace on which it runs really gives you a feeling of saturating enjoyment well within the halfway. Second half starts having a rendezvous with Ghajani and the closing bell will left you dumbstruck with the raw action and the intensity Amir has displayed in his pursuit of Ghajini, highly spirited performance. The only flaw one could derive from Ghajani is the role of Ghajani himself and the motive on which the lead actress gets killed, it should have been more convincing or in other words the grandeur performance of Amir Khan will underrate anything underlying.\n\nFrom the performance point of view Amir is a standout. The intensity, the build-for-kill attitude, the raw wrath and agony which was required for his character; he did full justice to that. I don't think anyone in Bollywood could have taken up the role and would have done even half of the delusion Amir did. Asin is surely going to make a great mark with this movie, she was outstanding in her role and her charm of caring a girl-next-door look is going to knock many hearts and doors to get opened going forward. She is going long way in Bollywood for sure, her presence would ease of the tensions and would give you a chance to blissfully smile and adore the couple (Asin-Amir). Although she need to work on the intensity part especially in the last scene of hers' where she wasn't convincing while getting killed or may be Amir set the bar so high that no one could reach to his mark and would leave you to comment.\n\nBackground score and music are apt to the situations and would definitely give you a breather which will be a must while things around get highly intense as the movie progresses, direction and especially the raw action sequences of the movie are outstanding. It gives you a feeling that it's a genuine storyline not a Bond story where flying bullets never hit the target as long as it's Bond who is facing them. Our hero in the movie is vulnerable and he makes mistakes often. Needless to say not his fault, he can only retain memory for 15 minutes. Although the theme is copied from elsewhere but the projection is brilliant and surely this will be the best movie for the year from Bollywood."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Restarted a Trend of South Remakes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "saadmehmud",
        "review_rating": "10",
        "review_title": "Amazing job by the Ace Khan",
        "review_detailed_main": "I would have to say that the movie was stretched a little bit but as usual Aamir Khan has stunned all of his fans. Aamir khan is the only actor is Bollywood that actually plays the character with perfection. He has worked out naturally for over a year to gain the looks he showed off in the movie. Some people will definitely vote against him as this is natural. Overall this movie is one of the biggest movies in Bollywood and is definitely worth watching it in theaters. The songs were not all that good but they will eventually grow on you as all A.R Rahman's songs do. This movie is a must watch and you need to watch it with an open mind as it is not like any SRK chick flick or any other typical Bollywood movie. This movie is unique with unique characters."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "anandkunwar95",
        "review_rating": "6",
        "review_title": "One Time Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "aag_wafa",
        "review_rating": "10",
        "review_title": "Aamir is the king",
        "review_detailed_main": "I was waiting for this film for months and this film have shown what I wanted. the movie is good but the performance of Mr. Perfectionist was outstanding. He really proved this time too. Asin was amazing too, but Aamir really worked hard this time and the movie is really not too miss. The action sequences are fine and its the first Bollywood movie with solid action.I am a big fan of him and I think he is the finest actor. This movie also has some nice songs and some beautiful scenes. Aamir got a wonderful body which will be a memorable body in history of Bollywood. He really brought changes to himself from the blockbuster movie Taare Zameen Par to his next blockbuster Ghajini.\n\nI think this is the biggest hit of 2008 and it really is a hit.\n\nI give 9 on 10 the performance of Mr. Perfectionist is worth even more, he is the real king , brilliant movie"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sunnyinsa93",
        "review_rating": "7",
        "review_title": "complete entertainer movie Ghajini",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "swagger902",
        "review_rating": "1",
        "review_title": "Represents what is wrong with bollywood",
        "review_detailed_main": "Ghajini represents everything that is wrong and sick about \"bollywood\" (even this name makes me feel sick and gives away what \"bollywood\" is all about i.e. very very poor copy of Hollywood). It can't get rid of what it thinks is necessary to make a \"good\" movie. Non-sense comedy sequences, self-proclaimed best action (unnecessary of course), \"songs\" (there is no need to say anything about songs in a bollywood movie), and above all steal a brilliant story without the faintest hint of honest acknowledgment and then trash it in such a way that you can be bastard enough to claim it your original story. Murugadoss represents a classic case of Ctrl+c and Ctrl+v (copy and vomit).\n\nOn the other hand, Memento (2000) is all about what is so great and lovable about Hollywood and Nolan in particular (I know he is British). It is not about thinking out of the box but it is believing that there is no box. It's about learning to remove any constraints and so allowing your style and imagination to take you where you need to go, to push the boundaries (this is from JJ Connolly).\n\nFor the review I would recommend the article by Kathy Gibson from Access Bollywood (http://accessbollywood.net/2009/01/01/movie-review-ghajini-2008/). I think she has done more justice to both Memento and Ghajini than I could."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shapath_guha",
        "review_rating": "9",
        "review_title": "Best Bollywood Action Movie",
        "review_detailed_main": "Though the story is strongly influenced by a Tamil and English movie, anyone can say that \"Ghajini\" is one of the best action movies made in Bollywood. Amir Khan is as usual superb and the action scenes are great! These scenes actually matched with his new 8-pack body. The fighting scenes seems very realistic to me because of his huge muscular body. There can be more fighting scenes in the film to make it more interesting and I believe the director can actually increase the suspense a little bit more.\n\nOn the other hand Asin seems to be a natural actress. Her acting is energetic, realistic, enjoyable and she completely ROCKS!!! Her acting in this movie is so great that she might even turn out to be the best new actress of Bollywood in 2008!\"Ghajini\" would might be an incomplete project without Asin in it!!!!!\n\nI am not actually comparing \"Ghajini\" with the English movie \"Memento\" or with the Tamil one. This whole review is based on what I feel like after watching Ghajini only.\n\nPeople can watch Ghajini to see Asin and her fabulous acting, Amir Khan's action and his new 8-pack superb body!!!!! Overall Ghajini rocks!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "nkhlsrf",
        "review_rating": "9",
        "review_title": "Ghajini..'the blockbuster'...",
        "review_detailed_main": "Ghajini defines bollywood.\n\nYes, its like an 80's bolly entertainer with a run time of more than 3 hours..all the dishum-dishum fight sequence ...and over the top villains..but that doesn't stop it from entertaining you to the core.\n\nAamir is brilliant...he simply rapes every other bolly actor apart with his performance.. looking like a hulk personification, he delivers yet another amazing performance..and you just cant take your eyes off when he's on screen. simply put...its just unfair to have an aamir khan in the industry..totally IMBA..\n\nAsin is the sexy south bombshell and u'll fall in love with her..just as u did with genelia..while jiah khan performs her part exceptionally well.\n\nMan o man..after decades u finally have a defining bolly villain again...with a kick ass name..he ain't close to those mogambos but manages his own.\n\nThe background score is awesome...after all its Rahman..what do u expect? the songs which stand out have to be 'kaise mujhe' and 'behka'...even 'guzarish' has a nice tune to it.\n\nFinally..ghajini ain't a memento rip off...they just hire certain parts from the movie along with a bit of the storyline...and if u hoping for a rehashed memento...then be disappointed cause you cant even think of comparing it to memento....this ones an out and out commercial entertainer.\n\nYou cant go in expecting yet another Taare Zameen Par..there are tons of loopholes but just like the lead, you forget them in the next 15 mins.:P\n\nIts aamir at its best and bollywood redefined after all those socially aware and trying to be different movies which end being nothing more than their tag line.\n\nKick ass"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "musanifwriters",
        "review_rating": "7",
        "review_title": "GANJAY ka badla Ganjini",
        "review_detailed_main": "Ghajini is a masala pot-boiler revenge film that is low on distinctiveness, instead relying on vibrant cinematography, over-the-top action sequences, and superlative performances by Aamir Khan and Asin to deliver the goods. Not surprisingly, Ghajini is another tour-de-force turn by Aamir Khan, as he effectively takes to the skin of his character, exuding the laundry list of human emotion, and even bordering on animal-like in his revenge-driven state. Elsewhere, Asin infuses the right-amount of over-the-top histrionics, charm, and girl-power to make her character appealing and ultimately the emotional center-point of the film. The rest of the cast is barely adequate, with the so-called medical student, police inspector, and the main villain verging on the comedic with their clichéd, wooden performances. But, it didn't really matter. The main characters were crafted with such integrity and likability that by the end, I can honestly admit I was on the verge of tears. In the end, Ghajini was a somewhat unremarkable film that was lifted by its high-emotional quotient and some outstanding compositions by A. R. Rahman (Guzarish, Kaise Mujhe), the screeching background score aside."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dreamyblue96",
        "review_rating": "10",
        "review_title": "The best movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "fabiha_rahman",
        "review_rating": "7",
        "review_title": "An okay film, better than the other Bollywood disasters",
        "review_detailed_main": "Ghajini was simply okay. I was not blown away. The story was okay, predictable nonetheless but I liked the romantic aspect of the movie. The chemistry between Asin and Aamir is superb. Aamir's body is AMAZING, but his acting was weak.\n\nI enjoyed the first part of the movie however, the second part was simply SENSELESS KILLING! The part about a guy losing his memory every 15 minutes was intrigueing but not enough to sustain the feel of the whole story.\n\nAfter some time, it simply got boring! Bollywood, you need to churn out some new, fresh stories that won't put its viewers to sleep. I have to admit, the story was better than Shahrukh's last hit.\n\nIt was sad, but soo predictable, at least the ending.\n\nAamir, I think I like him again, never did, but now I do, so he definitely does look better.\n\nYou should watch it at the theatres, and then leave during the second part."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ranjiths02",
        "review_rating": "9",
        "review_title": "Best among the best",
        "review_detailed_main": "The one of the most anticipated movie of this year is finally out, I was waiting for this day for past 2 year as the movie was delayed because of many facts,and the disappointing fact I could not even get near to the theatre for the first few days as the was running in packed houses. Now let us come to the movie, the movie which is a remake of a tamil movie also titled Ghajini and which is again inspired from the English flick Memento(2001). It's a standard revenge film given a fresh twist with a dash of Christopher Nolan's critically acclaimed Memento. Like that film, the protagonist here, Sanjay Singhania played by Aamir Khan, is hit on the head and suffers from short-term memory loss. He cannot remember anything for more than 15 minutes.\n\nSo, he tattoos his body with instructions: the most important one being that his girlfriend Kalpana was murdered, and he must find the murderer and kill him. The film is riddled with logical loopholes but Murugadoss, who also wrote it, doesn't give you enough time to think about them.\n\nSo, you never ask how Sanjay, the fabulously wealthy owner of a cellphone company, conducts a lengthy romance with Kalpana, played by debutant Asin, pretending to be an ordinary man? Or why Ghajini, a master-thug and expert killer, doesn't have a gun when he needs it the most?\n\nInstead, you are caught up in the mystery of how a superbly stylish businessman becomes a killing machine who routinely cracks necks and in his introduction scene, plunges a broken tap into a man's stomach. Ghajini isn't for the faint-hearted. The violence is gory and elemental. The climax is pure man-on-man combat with lots of crunching bones.\n\nOn the whole it is a great movie and I think everyone will just love it, even though you don't like the movie well \"forget\" about getting back your money."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "JarvisIndian",
        "review_rating": "6",
        "review_title": "Rip Ghajini, next remake inception also",
        "review_detailed_main": "These guys don't have mind of their own . Copying masterpieces like memento and Nolans work is not childs play. Pls first watch original movie in Hollywood."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rex874",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "by, KARAN for Aamir - The Ace Khan, ORKUT Community\n\nThe wait is finally over! An Aamir Khan film is nothing short of an event. The supremely talented actor acts in one film a year and no two films are ever identical in terms of plot line. No wonder then that you await an Aamir starer with bated breath.\n\nGHAJINI, the Tamil version, has been a massive hit and so was its dubbed Telugu version. Will the Hindi adaptation live up to the expectations? The hype is unmatched and you expect no less than a present-day masterpiece.\n\nNow the good news: GHAJINI demonstrates how strong film-making can enhance and elevate an already solid concept.\n\nGHAJINI is a revenge saga, one ingredient that has been the staple diet of Hindi films since time immemorial. It is a powerful film. It has the power to sweep you off your feet from the word GO. It has a riveting story, which has been told with flourish by director A.R. Murugadoss. And, of course, it has a knockout performance by Aamir Khan. If at all there's a shred of doubt whether Aamir is The Best in the business, all you've got to do is check out GHAJINI.\n\nFlaws any? Running time almost 3 hours? Not at all! There's so much happening in every scene and the screenplay is so gripping that you don't feel the need to look at the auditorium ceiling or at your watch at brief intervals. You aren't restless. As moviegoers, we've watched countless good versus evil fares over the years and although GHAJINI belongs to the same family, not once does it take the beaten track. The story has been told differently and most importantly, the story offers so many twists-n-turns that you just can't guess what would unfold next."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jbvsmo",
        "review_rating": "7",
        "review_title": "It could have been great",
        "review_detailed_main": "If you tone down the lame bollywood dancing and terrible fight scenes, this film would be awesome. The way the background story is presented is quite interesting and of course this is heavily influenced by Memento with a dash of other american films in the mix."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "darshak-parmar",
        "review_rating": "1",
        "review_title": "Stay away from this !",
        "review_detailed_main": "It felt like i was witnessing a rape. A brutal rape of one of the most brilliant story written ever. Jonathan Nolan & Christopher Nolan might commit suicide after watching this one. Usually, Amir khan's movies haven't disappointed viewers that much and that's why, in spite of chilling winter, I had chose to watch this movie on first day anyhow. But after bearing the torture of horrible sound effects and people bouncing on screen, when you walk out of hall at 3:30 in midnight; only thing one can think is Amir Khan is the biggest idiot available in bollywood.\n\nThere's an understanding and intelligence used when you copy a movie. This movie lacks both. I don't know if the plot was carefully used in the original copy of south Indian remake but who cares. Local movies are allowed to copy stuff but, when you are doing something what has got international eyes on it and it's one of the most awaited project so far; I felt pity for it as it turns out to be a real disaster. If Mr. Perfectionist really believes in perfection, he shouldn't have signed for this film at all. May be, he was too busy in publicizing this movie that he forgot to watch it at least once before sending it to public.\n\nOriginal Memento movie talks about Leonard Shelby who has (need not mention, he is suffering from anterograde amnesia) decided to hunt down the killer of his wife and has ended up in an infinite loop of killing spree. (well, that's my conclusion after watching Memento for numerous times years back, anyway. I am not gonna reveal the suspense here). But the movie isn't that simple as it sounds in last few lines. Ambiguity, reverse chronology, paranoia, suspicion, uncertainty, confusion, and betrayal everything has fallen in the same place that makes the movie most complicated and a perfect psychological thriller ever. Leonards's self narration makes you look at things from his perspective and therefore, story leaves the truth upto the viewers with tons of possibilities which only a patient with such condition can feel. A unique way of screenplay with no flaws in the plot, had made the movie a perfect masterpiece to have in collection.\n\nOn the other hand, Amir Khan's version of the movie is far far away from keeping the viewers in such state where you can even remotely enjoy the thriller. Unlike the original, where every character unfolds one by one, this movie clutters the cinema screen with crowd and of course EIGHT pack abs of Amir Khan. The concept of anterograde amnesia is stupidly slammed. A huge time is wasted on action and songs and of course romance. Nobody will understand why there is so much need of romance in a thriller film. Photography, specially in action sequence, puts entire south Indian cinema on screen.\n\nMoreover, there are certain sequences which are hard to digest even for the dumbest viewer. eg, Female constable, who discovers that some local mafias are approaching to kill Sanjay's wife Kalpana; she calls Kalpana to warn her instead of calling local police station to send some help. At least constables should know that we are paying taxes to use police in this kind of situations !!! Police didn't even investigate after attack on Sanjay and his girlfriends murder. The way Sanjay finds his to-be girlfriend Kalpana, is too much to accept unless it happens in Sharukh Khan movie :D And god knows how Sanjay finds out the mafia who killed his wife is Ghajini and has tracked him down to hunt. To cut short, Ghajini is exaggerated revenge masala movie with amplified amount of romance and action.\n\nTalking about acting; well, Amir's anger, shouts and punches makes him look like Rajnikanth or Kamal Hasan or SOMETHING like that. Jiah Khan has got nothing much to do in the movie and though (or may be that's why) she has done much better compared to her movie Nishabd. Overall story doesn't give much space to stay under the suspense till the end as the story has been modified a lot in order to balance between romance and action so that it can be made understandable by Indian viewers. In one line, south Indian Ghajini was pathetic implementation of original memento, and Amir Khan's Ghajini is the literal translation of the south Indian Ghajini. Those who are die hard fan of original memento and those who do not want to ruin Amir Khan's image in your mind, stay away from this movie."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "abhi_vega00",
        "review_rating": "10",
        "review_title": "awesome action flick......",
        "review_detailed_main": "its the best action flick of bollywood i have seen...in recent times.. and i cannot remember any better bollywood action movie. firstly its completely aamir khan movie.. performs well in first half....and an extraordinary performance in second half where he looks confused.yet concentrated ... n his eyes speaks more than him. this is his finest performance..till date.... his body is awesome...n quit apt for the action required ..except for one or two scenes{which looks like south Indian stuff} rest action is pure class... asin does give a powerful performance n acts really well n she is just too good looking..jiya khan has also delivered a good performance.. rest actors have also performed well....\n\nthough movie is long n needs editing{like cut the song aye bachhu n latto} but because of the action going on u don't have time to consider anything else..\n\nmusic is also great n background score is perfect as per the scene...guzarish..best one...behka..great one with awesome use of saxophone...n kaise mujhe...again a great song... in short its a must see movie...."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "BiswajitSince2005",
        "review_rating": "10",
        "review_title": "Short Term Memory Loss",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "arunjosetf",
        "review_rating": "7",
        "review_title": "Good for first time viewers!!!",
        "review_detailed_main": "This was one movie that I was waiting for very eagerly! And I cannot say that I am very happy to see it, as it was not really moving after seeing the Tamil version more than once.\n\nThe highlight of the movie is the romance between Aamir and Asin, and it was really good. Even though I was able to guess the next shot, the screenplay and dialogue is so good that you can watch that portion multiple times.\n\nBut, I cannot say the same for other parts of the movie. 3 hours is too much of a duration, I would say. They could have reduced a bit more action and given it as a sweet and short romantic thriller. I think, it was around 20 minutes a bit too long.\n\nBut, this could also be because of the fact that I have seen the movie before.\n\nAs Aamir said, the surprise package of the movie is Asin. I did not think that she will do so well with her Hindi diction. But, I think she fared well, but then I am no guru on that too. But, audience will love her for her character is one of the most lovable characters that one can see on screen. Don't miss it!\n\nSo, the verdict is if you have not seen the Tamil version yet, don't miss it. If yes, then be prepared to get bored at times!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "neeraj-dba",
        "review_rating": "8",
        "review_title": "worthful watch",
        "review_detailed_main": "It's an excellent movie. Except some logical and character issues, director has done a great job.\n\nAll junior artists belong to South India, due to which at some moments, it seems that you are watching a bug Tamil movie. I find Pradeep Rawat (Ghajini) as weakest character in movie. In first half of the movie, he speaks pure Hindi, while later he speaks Haryanivi. Some logical questions like, Police don't recognize Sanjay Singhania, even don't try to ask from Building reception (while Jiah Khan) asked his flat number from Security guard only.\n\nActress Asin has done superb performance. Despite of 3:04 Hrs long show, Director has done great job to bound the viewers. Songs are b'ful and suits the situation.\n\nI give 8/10 for good job by A.R. Murugadoss(Writer/Director), Ravi K. Chandran(Cinematography), Amir Khan (Actor), Asin (Actress), A.R.Rehman (Music Director) .... arranged in decreasing order of performance."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Nice and now a days Aamir Khan is terrorist activities boycott Aamir Khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "If Aamir does Not Win Best Actor for this then the Awards are a disgrace",
        "review_detailed_main": "Brilliant, Amazing, Fantastic, Terrific are some of the words i will use to describe this film. I've seen Memento in cinema and found it very good and i thought Ghajini which is a remake wont be better. I was wrong about that, Comparing Ghajini with Memento is like comparing Godfather with The Da vinci code. Ghajini is different and way better then Memento. This film deserves to win Best Film, Best actor, Best actress and best villain. The newcomer Asin who plays a stupid character in the film does a superb performance. I normally hate actresses when they act immature like Kareena Kapoor in many films or even Rani (my favorite) in Bichoo. Asin is a professional. When i saw the villain of thus film, i thought why did they cast this nobody, but once again i was wrong, the villain was great. Aamir Khan worked very hard for this film and he gave a tremendous performance. This is among the Best Aamir Khan movies in his career. Must see.\n\nIf Anybody did not like this film, its maybe because you have bad taste."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "amit_talpade",
        "review_rating": "6",
        "review_title": "Good Film, If you can overlook many glitches",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shafiqesmat",
        "review_rating": "10",
        "review_title": "Thank u to the director and all the member of the movie",
        "review_detailed_main": "I have never seen the greatest movie like that.It is the greatest movie and i am telling that it must be consider as the movie of the year and it must take as many awards as the people and the elder give i really thank to the director, writer producer and all the member of this movie and especially to Mr. Amir Khan for the great acting. That is all what i think and i am sure that what i am thinking the other will think when the watch the greatest and movie of the year Ghajini. It is the great movie but if the girl should not have died that was better and once again thanks to the director, writer producer and all the member of the movie. I really like the movie and also my friend does. Your fan Shafiqesmat"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "chetannaik-10846",
        "review_rating": "7",
        "review_title": "Much interesting than Memento.",
        "review_detailed_main": "Although it's a Hindi 'kinda' remake of Memento, its much more interesting and fast, sans the dirty language of Memento. If you haven't watched it yet go watch it now."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jaskunwar993",
        "review_rating": "5",
        "review_title": "Aamir Khan was good. Ghajini, was disappointing",
        "review_detailed_main": "Well, Kudos to Aamir Khan for a brilliant performance. Asin was okay-okay for starters, and there is no other performance worth seeing. The action was mind-blowing, the humour subtle but good, the songs alright, the idea (though copied) quite good, but, all-in-all, it left me disappointed.\n\nNot because it's a bad movie. It's not. It's a very nice watch. It's just that it didn't bring out the magic that an Aamir Khan movie should have. It still had loopholes, like... well, let me not spoil it.\n\nThe movie starts off in a medical college where Sanjay Singhania (Aamir Khan ) is being discussed (he suffers from short-term memory loss). Then we are suddenly taken to Sanjay in his deadly appearance and shown the kind of violence that is expected out of Ghajini. The the story moves on and twice, through 2005 and 2006 diaries of Sanjay, we are taken into flashbacks of a very interesting love story of Sanjay and Kalpana (Asin). Then the story moves on and then, a newbie will realize that Sanjay is looking for some Ghajini for revenge for killing Kalpana.\n\nVery interesting story, but a disgraceful climax where you'll be laughing because... well, some Bollywood-rigidity like the Hero never dies.\n\nEven though it's still humorous to see Aamir smash the hell out of four crooks and then suddenly look at them and wonder who the hell these four people are and why they are dead, it is Memento (the Hollywood movie, the origin of all Ghajini's) that still stands out.\n\nNot worth the first day first show, but worth a watch still. Watch it for Aamir's performance and some mind-blowing action.\n\n5/10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "pmoni",
        "review_rating": "8",
        "review_title": "For all who think Ghajini is a copy of Memento ___",
        "review_detailed_main": "GHAJINI tends to be more like a love story where the main character seeks revenge of his beloveds murder.He had been hit on his head by the goons with a metal pipe and the his memory sector gets all messed up. I bet he must have seen a movie called Memento where in a similar situation the hero tattooed things on his body to remember things. And our hero somehow manages to remember this and uses similar technique and finds the murderer and kills him. Where as MEMENTO, to my opinion is not a story of guy with a top floor damaged and can not remember a thing, but of a hare brained cop, who gets a humanitarian urge to help this guy. With a screwed up idea he cooks up plot to make the 'goldfish memory' to think that he is avenging himself and thing get real messed up. Amir Khan with his eight packs does a real convincing job of the gruesome killings. Yes there are quite some sappy sentimental moments without which Indian viewer wont be appeased . Over all this is another good movie from Amir Khan and worth seeing."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jeetrana",
        "review_rating": "9",
        "review_title": "Watched this with Katrina Kaif. Excellent Film.",
        "review_detailed_main": "I was pleasantly surprised to find Katrina Kaif with her family in the queue right behind me in this popular central London theatre on a Saturday evening in the last week of December.\n\nThe film was excellent. Katrina seemed to have anecdotes on a number of scenes/locations. She was sitting in the row in front me and was chatting (gossiping) with her sisters and mom every few minutes especially when the trailer of Chandni Chowk to China came up.\n\nHer sisters are not as hot as her though....\n\nShe is gorgeous to say the least. She was also with this English guy who sat next to her and was calling her 'sweetheart' (Salman....you have competition~?). They went out together in the intermission too. He maybe family though....\n\nWell impressed with the film. Ran for 3 weeks in this theatre house-full.\n\nGoes to show that script does matter.....Good music and Asin is stunning. Aamir rocks as usual...what a bankable Indian legend!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "drjohnson723",
        "review_rating": "7",
        "review_title": "About as good as a remake of Memento could be",
        "review_detailed_main": "This film was cleverly put together, and better than I could have expected. As usual, Aamir Khan delivers a stellar performance and is easily the best part of this movie. Additionally, I appreciated that it didn't go the route of copying Memento verbatim. Where Memento started by characterizing the main character's actions as righteous and then called that into question more and more until the ending leaves you wondering whether you ought to have been rooting for him to begin with, Ghajini begins by showing the main character as more than morally questionable, and only brings you over to his side as the plot unfolds. This results I'm a significantly more likeable protagonist. Also, while there may be many who disagree on this point, Aamir Khan is far and away a better actor than Guy Pierce.\n\nThat said, the film is not without its problems. Firstly, the editing and sfx can be quite intrusive, especially toward the beginning of the film. The frequent jump cuts and overly pronounced zoom-ins call to mind the low budget style of editing from the early 2000s in the likes of the Saw movies. Secondly, the flashback portions feel thoroughly tone-deaf to the rest of the film. Granted, they serve their purpose well, but they feel so removed from the \"present-day\" action that I might as well have been watching two different movies.\n\nAll that said, while the film is a bit of a mixed bag, and Aamir Khan has definitely been in better, the film did work, and I found myself thoroughly enjoying it by the second half. If you told me that someone decided to remake Memento with no other context, I'd assume the result would be utter trash. Having not seen the Tamil film upon which this movie is directly based, I can't speak to its quality. But 2008 Ghajini is thoroughly worth the watch if you can get past the flaws I mentioned above."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rkravikumarrm",
        "review_rating": "8",
        "review_title": "original version is much better then that",
        "review_detailed_main": "The original Tamil version of Ghajini was inspired by the American film Memento, which itself was adapted from the short story Memento Mori. The film stars Guy Pearce as Leonard Shelby, a former insurance fraud investigator searching for the man he believes raped and killed his wife during a burglary. Leonard suffers from interrogate amnesia, which he contracted from severe head trauma during the attack on his wife. Certain concepts like writing notes behind instant Polaroid photographs and tattooing facts on his body were inspired by the film. According to Aamir Khan, \"Ghajini is not a remake or even slightly inspired by Memento, but it's a remake of the Tamil film, Ghajini"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dahiyaharbir",
        "review_rating": "6",
        "review_title": "FULL COPY!!!",
        "review_detailed_main": "I didn't expected this from Aamir khan. This movie is full copy of Movie - MOMENTO."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dalak_2182",
        "review_rating": "9",
        "review_title": "A Great Watch",
        "review_detailed_main": "Forget those negative reviews(If you have read one here or in TV or in newspaper), this is a perfect entertainer. This movie truly does not have any social message like RDB or TZP. But this thriller will keep you glued to the screen till the end. Aamir had never been so angry(as he appears to be). There are light & beautiful moments also which add to the spice. Acting is great(as expected) from Aamir. Asin was a surprise to me in this movie, a very natural actor. There are two drawbacks of the movie(as I felt). First,the movie could have been cut short by half an hour.Secondly, there were two songs which doesn't fit the pace of the movie(and they are the first & last song of the movie). But this movie brings back more romanticism from Aamir which was certainly missing from the previous two movies. Guzarish track was shot in an excellent location. Thanks AR Rehman for Guzarish, Behka and Kaise Mujhe. Truly a great watch. Thanks to Aamir as he developed such a wonderful body. He gets half naked within 10 mins of the movie.It definitely gave us a WOW feeling. There was a scene shot in hospital where initially he appears to be clueless then he burst out a little later. The transformation was excellent. Thanks Aamir for taking such a different subject(and avoiding Utopian concepts like wife not recognising husband after a make over). Waiting for 3 Idiots."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Retreat",
        "review_rating": "6",
        "review_title": "A Pretty Big Surprise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "muditmonfils",
        "review_rating": "9",
        "review_title": "Get punching !",
        "review_detailed_main": "We all know the quality of movies that Aamir Khan usually appears in. His movies can be compared to different flavors, some are very sweet some salty and so on! I don't think any bollywood actor has the guts to appear in so many different roles mish-mashed in the variety of flavors.\n\nGhajini is one of the different flavors of movies which are in existence today. Aamir Khan is back on the stage with this and that too with a bang! We rarely ever watch Aamir Khan appearing in films like these. He is not associated with violence as such. After a successful stint with relatively \"peace loving\" movies such as Lagaan, Fanaa, Dil Chahta Hai, Tare Zameen Par, Rang De Basanti and so on this package is a \"punch loving\" one. Though it's not a hardcore action movie with gun trotting hero killing gun trotting villains (which is what we are now accustomed to watching in bollywood) but the strength of your fist and muscles. Bang them and punch them! This movie has action but for a specific reason. And yes Aamir delivers it with utmost natural elegance!\n\nGhajini is about a successful business man Sanjay Singhania who is suffering from short term memory loss after he was struck on the head by our villain Ghajini. But how? That part should be left for you to see as this isn't a straight-forward narration but often goes back to flash backs which slowly and slowly unveils the story of the movie. Ghajini is the person behind the killing of Sanjay's fiancée (Asin) and he must take revenge from him. With names & telephone numbers tattooed on his body, a camera with a 15 minute reminder (after 15 minutes he forgets what he was doing) and photos to remember the name of the people he meets and his apartment walls plastered with placards \"REVENGE\", \"KILL GHAJINI\" and a map of I guess Mumbai he is all set to defeat his occasional memory lapses he is all set to teach a brutal lesson to the dude who killed his fiancée. Will he be successful? Find it out\u0085\n\nAamir Khan has given his best performance yet in this movie, equaling that with Tare Zameen Par. The acting standard is awesome. His dialog delivery and the way he balances a particular scene with realistic emotions is something which is difficult to find with other actors. Jiah Khan was cool too. Though her dialogs sounded a tad weak in many scenes. Pradeep Rawat displayed a perfect villain. He's violent, crude & heartless, but many a times I found his \"haryanvi\" accent in the movie senseless especially as the character is an industrialist based in Mumbai. The show stealer of the movie was Asin Thottumkal. Excellent acting. Best female actor ever seen! Superb expressions, great acting, humor everything! Definitely looking forward to watching more of her films.\n\nNow, coming to some music. Kaise Mujhe was the best track in the movie followed by Behka and then Guzarish. Lattoo was time pass sort of stuff. Aye Bachchu was humorous. The sound effects were really enthralling with some nice reverb and panning. Overall, it was quite satisfying stuff from A.R Rahman\n\nThis movie has one of the most brutal violence bollywood has ever seen much like the South Indian action movies. Seriously speaking don't watch this movie if you are plying for some entertainment. Though the movie is comic in large chunks, ultimately it's a tragedy. The violence, the intensity, the emotional quotient everything will leave a deep print on you once you leave the theater. This movie is damn serious stuff. The villain is heartless and kills his enemies mercilessly. Please don't get fooled by the U/A certificate given by our Indian censor board. It has enough emotional, heartless & physical violence to make an adult burn out and cry. The reaction of the audience in the movie theater was very emotional and I could see people around me crying at many scenes. The direction of the movie is awesome.\n\nAfter watching the movie all I can say is that if you want to get charged up for the next year this is the best power supply. Watch it and you won't regret this 3 hour long power punch but be careful don't bring in the kids with you otherwise they will get nightmares!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sakuruv",
        "review_rating": "7",
        "review_title": "Indian memento",
        "review_detailed_main": "Indian adaptation of Christopher Nolan's memento. The film starts of with the actor Suriya(Ghajini) having temporary memory loss. Actress Nayantara's role is redundant in the film. Asin was good as the lead actress in the film. The ending kinda gets janky. Overall of this film rating 7/10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "CrisPat",
        "review_rating": "5",
        "review_title": "an excessively long hotchpotch of romcom and crime",
        "review_detailed_main": "It is hard to keep a viewer entertained for 3 hours even when you have a gripping story told at a fast pace. That is not Ghajini's case, so I did grow restless as the film moved on.\n\nHalf the film is a light-hearted love story which is fully developed and can stand on its own. The other half is about revenge, murder and destruction inflicted by a physically super-human hero. The film tries to be everything for everyone. In the end though, you cannot like both halves, one of them will not be your type.\n\nThe idea of the film is the same as Chris Nolan's Memento, but only developed superficially, to interlace with the love and the revenge stories. Whereas in Memento you are meticulously brought to understand the development of the hero's path to revenge, in this film you have no idea how does the hero come from the point of losing his memory to the inception of his revenge quest.\n\nThat being said, the film has merits, and save for the fallacies of the plot highlighted above it is a story reasonably well told. But not for 3 hours and not in comparison with films on the same topic more solidly done (and I'm thinking of Memento here)."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "MuviFan73",
        "review_rating": "8",
        "review_title": "Positive ending let it gain an additional point over Hollywood story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sksathwik",
        "review_rating": "8",
        "review_title": "Ghajini=Indian Memento",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ashish-sigdel",
        "review_rating": "7",
        "review_title": "A good effort!",
        "review_detailed_main": "Well, i'm a fan of Amir Khan's. He has so far given great performances in every movies and even has done a good job in acting. ghajini, as we all know is a remake of the Tamil hit by the same name. everything in the movie is cool, however, at times when i was watchin it in the theatre, i got distracted. that's probably because this movie is a complete masala movie, exactly opposite to what we expect from Amir Khan. However, the way he's expressed himself in the movie is good. I won't write what happens in the movie, but onething is sure, from looks to his acting skills, Amir has made use of everything to the best. yet, the movie is not that appealing and i was really sad when i saw Aamir shedding clothes for the song/dance sequences and the number of songs in the movie also has decreased the charm. regardless, i would recommend you watch this without any expectation from aamir. Individually, all the actors are brilliant, and the story is a kind of cliché and that hurts the most!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "raghavramaiah-1",
        "review_rating": "8",
        "review_title": "Ghajini - A Worth Watch",
        "review_detailed_main": "Ghajini, a perfect remake complimenting the Tamil version of the same living up to the expectation of everyone. Ghajini is a movie with emotions, suspense, revenge and adventure. Its a script where in every bit is meticulously done. The casting is one thing which is pretty debatable here. But all the actors deliver the goods with all the necessary ingredients with respect to every character. This movie's script is again kind off influenced by the English flick Memento. Its just a influence and nothing else. Aamir Khan doesn't need any special introduction, he's the Movie. An out of the world performance yet again. Aamir Khan plays the role of a Business Tycoon Sanjay Singhania, Chairman of a Big telecom company who falls in love with a small time upcoming model Kalpana played by the south Indian actress Asin who was also a part of the Tamil flick of Ghajini. Some uncalled unpleasant circumstances leads to the death of Kalpana and resulting in Sanjay becoming a victim of amnesia- a short term memory disease, who cannot remember things beyond 15 Min's. Yet making him a kill machine on a rampage to kill his girl friend's murderer. During the way to his finding the murderer he comes across a Medical student Sunita played by Jia Khan who adds some spice and suspense to the script. Jia Khan does justice to the role by her simple honest acting. The performance of Ghajini - the murderer played by Pradeep Rawat is commendable making this movie perfect with respect to the acting department. Asin's acting is exceptional and her bollywood entry is going to be remembered.\n\nDirector Murgadoss doesn't disappoint anyone at the end of the day making Ghajini a worth watch, though the fights and few other scenes depict some peculiar south Indian flavor raising a few eye brows. The music by A.R.Rahman is OK-OK! Not generating the usual Rahman effect. Guzarish being the most hummable.\n\nOverall Ghajini is a good entertainer with a running time of 3 hrs 3 Min's.\n\nI would go with 8 out of 10 for Murgadoss's Ghajini making it a kind off must watch for all Aamir Khan fanatics."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "bladefd",
        "review_rating": "7",
        "review_title": "Flashback well done, 'Memento'-inspired portion a mess",
        "review_detailed_main": "'Ghajini' is an Indian Bollywood film inspired by Christoper Nolan's film 'Memento.' Aamir Khan is my favorite Indian actor, and I think his acting is always excellent. This film, however, was disappointing. A company CEO, Sanjay, played by Khan, falls in love with an advertising film actress, Kalpana, played by actress Asin Thottumkal. Kalpana doesn't know Sanjay is a business tycoon, and Sanjay plays along. When Sanjay is ready to reveal his identity, Kalpana is murdered. Sanjay is beaten with a metal rod into acquiring short-term amnesia, where he can't remember longer than 15 minutes at a time. Then he seeks revenge with his memory lapses.\n\nThe good: Leads Khan and Thottumkal's acting. The flashback was well done. Two songs were excellent.\n\nThe bad: Below-average acting by everyone outside of the two lead actors. Everything inspired by Memento is messy. I have no problem using ideas already done by others but in an Indian setting/style/variations (with 'inspired by ___' byline), as long as they are not poorly executed. 'Ghajini' had the potential to be much better. First, I would blame poor editing and poor writing. In fact, I would edit out the whole Memento portion of the movie. The flashback should stand alone as a romantic comedy with a tragic ending and revenge. The Memento portion adds an extra thriller dimension, but it makes the movie worse and drawn out. It's essentially two movies in one between the present story and flashback. The movie would have better, faster pacing and be more enjoyable with good editing slashing hour and 15 minutes.\n\nWould I recommend this? No. Only if you are an Aamir Khan fan. If the amnesia portion interests you, watch Memento. If the romantic comedy with a tragic ending interests you, there are other films just as good (from both Hollywood and Bollywood)."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "taseer-7336",
        "review_rating": "10",
        "review_title": "Ghajini film is awesome film ever",
        "review_detailed_main": "This was my 1st film...... that i liked it sooo much"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "anaghapradeepanu",
        "review_rating": "7",
        "review_title": "A movie with all the elements",
        "review_detailed_main": "Ghajini(Hindi) if not completely, did manage to do justice to the original Tamil Movie. The movie marked the beginning of the 100-crore club in Bollywood. It also marked the debut of Asin and she has performed extremely well in the movie. The movie has every element be it romance,comedy,tragedy or action. Aamir Khan plays the role of a rich businessman who falls in love with Kalpana(Asin),a struggling model. For the rest of the story you must watch the movie, I don't wish to give you a spoiler here. I have now started finding better movies through www.flickstree.com. It not only suggests great movies to watch, it also tells where you can watch the movie online.. Highly recommended"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "nitin-sen",
        "review_rating": "10",
        "review_title": "Aamir does what NO ONE ELSE could've done... Brilliant",
        "review_detailed_main": "All I want to say is that its Aamir & story telling at its best..\n\nTheir something happening in every scene of the movie and you don't get bored or look at your watch, script is strong. Performances are strong too, Aamir is just outstanding, Asin is not too far, she looks great & performance is at par.\n\nAamir did brought the crowds back with this movie after 26/11.\n\nAny one who thinks its not worth it needs some air for their brains!\n\nSomeone posted here saying something like Aamir is not that perfect...hmmmmm, let me see, I am sure he must be a SRK fan! if yes, then its \"perfectly\" alright!! I would suggest him eating Mentos so that his \"dimaag ki batti jal jayegi\" and he would understand that Aamir is arguably the best actor that we have in India...come on..."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "timesquare66",
        "review_rating": "7",
        "review_title": "movie is nice to watch for amir..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rahul-iitd",
        "review_rating": "5",
        "review_title": "Disappointing Storyline - One time watch movie",
        "review_detailed_main": "An over-hyped and spiced up movie with very poor script and storyline. I am a great fan of Amir Khan (the lead actor, and he has performed well) and watched the first-day first show of this movie, and I must say I am very much disappointed by the movie. The movie lost its impression just after half an hour, and thereafter kept on bleeding till end.\n\nIt is inspired from English movie \"Memento\" (which was the greatest movie of its time and still counted as among the best). However, the plot of the movie is very plain, simple and dry. Every single thing was very much predictable. Please don't carry any expectations like that of Memento, as Ghajini is not even 10% of it.\n\nThere are a number of logical glitches in the movie (which weren't there in Memento of course). It appeared that Amir Khar remembered a lot than he should have (as claimed by the tag-line of movie). And the movie constantly kept on losing its focus from the main issue in hand - short term memory. Rather it focused more on the love affair and the past life of the central characters. The action sequences were also very boring and sleep-inducing. Even simple things are shown in completely unrealistic manner - an MD of a big company sending his personal staff for putting up just one Hoarding on a building.\n\nOverall, i think the movie completely ruined a great concept; direction was very poor and storyline was completely flat; Keep your brains at home before watching!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shivknt_u",
        "review_rating": "9",
        "review_title": "Best of 2008",
        "review_detailed_main": "Finally i have seen the movie. I watched it out with lot of curiosity, as always Aamir khan lived up to my expectations once again. I watched the south Indian version of Ghajini, but felt like making a lot changes to it. Though Aamir's ghajini is a remake, those changes which i wished to make in the previous one made this movie better. It was an ultimate feeling watching the movie. I give full credit to script of the movie which makes the movie interesting to watch. I enjoyed a lot watching Aamir khan in a different role. I have read a few comments in this forum about making a comparison to Momento, for all those people i would like to say one thing. May be it is an adaptation of Momento or what ever the film u mention, its completely unfair to compare with them, as u people have to understand that Indian public's taste of narrating a story is a lot more different from the Hollywood. So, i kindly request not to compare any Indian movie with a Hollywood one. There are a lot of Hollywood movies which are remakes and yet successful. Finally Aamir rocks and so is ghajini"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "divay_pbz",
        "review_rating": "8",
        "review_title": "an out of the league year ender",
        "review_detailed_main": "First of all i was blown of by the hardcore action i saw in this movie......for years i have been waiting for an Hindi movie which would present action in such a raw form and at last ghajini arrived.....\n\naamir khan is as usual deep into his characters skin but one unusual thing about him in the movie is his 8-pack body. aamir khan as a business tycoon shows how to act but at the same time not to act too loudly. on the other hand the main lead asin portrays the bubbly type character kalpana with great charm. the fact that she has done movies in the south has helped her tremendously in matching with aamir khan. jiah khan has also showed her true potential in a small but a very pivotal role.\n\nThe story of the film is quite pacey and it has the viewers hooked all the time. Ghajini is an out of the league film which i am sure will break some or the other records."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ichiragpatel",
        "review_rating": "7",
        "review_title": "Not Upto that much level of Original Ghajini",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "nikhilkishoremails",
        "review_rating": "10",
        "review_title": "For the heart from the heart!",
        "review_detailed_main": "This is the best bollywood movie made till date. The pain and the emotions you feel while watching this masterpiece is unparallel. Aamir Khan is the best actor in the world and Asin is the most cutest girl on the planet. Music will touch your soul incase you have one. Greatest movie of all time. Salute AR Murugadoss."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "6",
        "review_title": "Overall an entertaining cinema",
        "review_detailed_main": "If you can watch this movie not by judging anything then this is an entertaining movie to watch. The whole movie is made by extracting a little thing from Christopher Nolan's epic movie memento. Cinematography and music of the movie was very very good."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "akwiseworld",
        "review_rating": "10",
        "review_title": "Mind-Bending Masterpiece!",
        "review_detailed_main": "\"Ghajini\" (2008) is a gripping, emotional rollercoaster that will leave you breathless! Aamir Khan's powerful performance as Sanjay Singhania, a man struggling with short-term memory loss, is unforgettable.\n\nWith stunning action sequences, soul-stirring music, and a poignant love story, this movie is a masterclass in storytelling. Asin's charming debut and Jiah Khan's impactful supporting role add depth to this thriller.\n\nDirector A. R. Murugadoss's clever plot twists and clever use of tattoos as memory aids make this film an edge-of-your-seat experience.\n\n*Highlights:* Aamir Khan's intense performance, Asin's debut, memorable music, and clever plot.\n\n*A Must-Watch for:* Fans of psychological thrillers, action enthusiasts, and those who love emotional dramas."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "maverik12",
        "review_rating": "6",
        "review_title": "Indian Version of Memento",
        "review_detailed_main": "For those of us living in the States or are followers of Hollywood movies, this movie is a exact copy of Chris Nolan's Memento. Yes the same guy who made \"the Dark Knight\". The only new element is added is the love story. Having said that I am a big fan of Aamir Khan. I was little disappointed that he chose to make a copy Hollywood movie, because he is the only one in Bollywood industry who comes up with something new like \"Lagaan\" or \"Sarfarosh\" etc..but as movie wise I was entertained and he did an excellent job. Only reason I am giving this movie a six is because its not original. I have to take few points for that. If it was an original I would have given a even better rating. I know not a lot of things are original these days in Bollywood but I expected better from Aamir."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "9",
        "review_title": "Ghajini' is a film that ought to be seen for the sheer novelty of its theme.",
        "review_detailed_main": "Realism is something you shouldn't expect from 'Ghajini'. It's a full-on masala film that is stylishly shot and has above average music by A R Rahman . It's a film that needs to be enjoyed with mouthful of cola and fistful of popcorn I enjoyed watching Ghajini does live up to the hype it has generated and is a must watch for Aamir Khan fans and also for débutant Asin andthe latest addition to talented filmmakers of Bollywood, director A.R.Murugadoss.The film is a perfect masala film, a revenge thriller, agenre which was very popular in the 80s. But what sets the film apartfrom a typical pot boiler is the way the screenplay has beenstructured, oscillating between flashbacks and present time. There is also a good balance of romance, suspense, action and comedy. Plus the biggest asset – Aamir Khan! The story has two major flashbacks, but unlike many films where flashbacks do nothing for the film itself, this one actually aids in building the character and adding intensity to them.Murugados's direction is terrific and the master story teller that he is, he just doesn't give the audience a moment to think even in 180 minutes running time film. Technically it definitely stands amongst the best films of 2008. Superb editing (Anthony), excellent camera-work (Ravi K Chandran) and amazing sound design (Resul) take the film to an altogether different level. The action by Peter Hains and Stunt Shiva keeps you on the edge of your seat. But some action sequences have turned out a bit too gory and not meant for the faint hearted. But with Aamir giving his everything all out in them they end up being a treat to watch. A.R. Rahman's melodies are a treat to watch on screen having been excellently picturised. Also, none of the songs hamper the proceedings."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "behnamboogi",
        "review_rating": "6",
        "review_title": "It was beautiful",
        "review_detailed_main": "Since the film was made, it did not have many sidelines, but it has attracted all the attention. The actors of the film are almost experiencing their first Bollywood work and all of them are among the famous actors of Telugu and Tamil cinema!\n\nThe script and story are wonderful, as if nothing is missing! Which made Amir Khan, sensitive to movies and scripts, to have no doubt in his choice!\n\nAR Rahman, a composer known as Bollywood, has shown another side, his song Ghazari was named one of the best songs of the year!\n\n183 minutes is not a short time for a movie, but Gajini has so much tension and charm that the audience can endure the movie for up to 300 minutes and even sit down to watch the movie again and again, because the movie meets the expectations of the audience."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rdx86",
        "review_rating": "5",
        "review_title": "Memento lovers stay away!",
        "review_detailed_main": "OK, straight off the bat...if you loved Memento, then you'll probably hate Ghajini.\n\nMemento was a complex movie with a brilliant storyline, amazing acting, very stylish editing and an excellent twist. The very fact that the movie was told in bits and pieces, confuses you and puts you exactly in the shoes of its protagonist who suffers from short-term memory loss.\n\nWith Ghajini, you can throw all of that out of the window. What you instead have is a typical Hindi movie with a paper thin plot, numerous plot holes, terrible supporting cast, but some decent acting from Aamir Khan.\n\nAs you may know, the story revolves around the character of Aamir Khan, who suffers from short-term memory loss and is trying to figure out who murdered his girlfriend by leaving himself clues, in the form of Polaroid photos and tattoos on his body.\n\nThe movie starts out terribly with minimal explanation about Aamir's condition and jumping straight into the action. Things do get better in the middle when we dwell upon Aamir's past, which has some genuinely funny moments along with numerous corny filmy moments as well (well...its a Hindi movie, so we must learn to get over these things).\n\nThis would bring us to the lead actress in this movie...Asin. She's super hot, super cute...maybe a tad irritating at times and maybe not the best actress in the world...but who gives a flying rat's ass?! She's probably the sole reason why I even decided to sit it out through this torturous film! After her part was over, it pretty much boiled down to more terrible acting from the supporting cast, more excessively stupid-and-trying-to-be-cool editing, further evidence that the plot was really crappy, repetitive background score and song and dance routines at awkward moments.\n\nDon't get me wrong...the songs in Ghajini are good (maybe not Rahman's best work), but the sound and music otherwise sucks. It really gets on your nerves after a few hundred iterations. Even more irritating is probably the constant swooshing sound that you hear every time the bastards at editing tried to add funky jump cuts into every single scene of the movie.\n\nIf you're planning to watch this movie, make sure you haven't watched Memento already. If you have watched Memento and found it too confusing to follow...then good for you, you'll probably not mind Ghajini.\n\nYou can read my review here too: http://psychedelicsoul.blogspot.com/2008/12/ghajini-review.html"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "criticalshubham",
        "review_rating": "10",
        "review_title": "10 stars for a lifetime scar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "bcnkor",
        "review_rating": "10",
        "review_title": "Best Aamir Khan Performance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "megha6582",
        "review_rating": "7",
        "review_title": "A good attempt",
        "review_detailed_main": "First things first....lets not be ridiculous and begin by comparing Memento to Ghajini. That was an English movie and this one is a Hindi movie. Ghajhini quite obviously has been made to cater to the taste of the Indian audience. Whether or not the director A.R Murugados has acknowledged Christopher Nolan's masterpiece doesn't really mean much to the regular movie-goer. It makes more sense to compare the Tamil movie to the Hindi one since both have been directed by the same person. On the whole I would say that the Hindi Ghajini is better than the Tamil one. The main reason is the last half hour which was pathetic in the Tamil version, and even though the Hindi one could have been shortened much more, it still is a marked improvement. The rest of the scenes are a frame to frame duplicate so nothing much to comment about there. I did however miss the chemistry between the lead pair though. There was a lot more chemistry between Surya and Asin when compared to Aamir and Asin. Coming to the performances, Aamir Khan has done a wonderful job as usual. He must have struggled to acquire that body at his age and he looks good. The very lovely Asin is competent in her Hindi debut. Although her character is a bit too goody-two shoes kind, she manages to win over the audience. Not much can be said about Jia Khan. She needs to take more acting classes & desperately put on weight to avoid the risk of being mistaken for a stick! The sound track by AR Rehman is good although I expected a bit more from the musical maestro. The only complaint I have from the movie is the negative character - 'Mr Ghajini'. The director should have cast someone else for that role. When a movie has revenge as its theme, you need to see a villain who can evoke extreme feelings of hatred within the audience.\n\nIn a nutshell, Ghajini is a movie that has been shot well, has some good performances and a great background score. Watch it for Aamir Khan. However, the movie is violent so leave the kids and faint-hearted at home!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "kalyanisriram",
        "review_rating": "8",
        "review_title": "A complete masala movie.",
        "review_detailed_main": "It has action, comedy, drama and melodrama, song, dance, thrill, romance. The film is a complete package. Asin nailed in her Bollywood debut. Execution could have been better. An additional point for music alone."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rohitdjoshi",
        "review_rating": "7",
        "review_title": "good movie with some flaws",
        "review_detailed_main": "first things first being the copy of memento people are expecting a lot from this movie....and i was with the first 10-15 minutes into the movie itself....cant believe perfectionist like aamir can approve the amateurish display of actin by jiah khan and the fighting scene which is the first scene of Aamir lacks all the logic,i mean he was fighting with her camera in his pocket,after all the dhishum dhishum the camera was intact,it was hilarious but the good things started soon after with good bit of acting by of course Aamir and the debutant in the boolywood \"kalpana\" ghajini have some brilliant fighting scenes which aamir pulled off even more brilliantly,Aamir is truly awesome in some of the intense scenes songs of the movies are disappointing,i never expected this kind of trash from A R Rehman at last i want to say the movie could have been better but its one time watch anyways"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "danieljames-dj",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "The movie is really amazing, romance is very sweet. Very touching movie as well. I didn't like the dark side much - like killing people."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "manoj-ransing",
        "review_rating": "6",
        "review_title": "Much better than current Bollywood movies",
        "review_detailed_main": "I have seen Memento. I have not seen the Tamil and Telugu versions of this movie.\n\nShort term memory loss. In the movie Memento the concept was used intelligently. The audience can feel the difficulties of the person going through this disability. Memento is like solving a puzzle. While watching it we have to try to make connections between the previous scene and current scene. It is without any doubt a masterpiece in motion movies.\n\nGhajini, though is mentioned as a story of a man with the this disease is more of a revenge story. The main character mimics to a psychic killer who has lost his love, than a person who is suffering from short term memory. A simple advice is not to go for this movie keeping memento in mind.\n\nThe movie is certainly above average than the current bollywood movies. You can watch it till it end. First half is simply beautiful and heart lightning. It puts a simple fun story of a girl (Kalpana played by Asin) who tells everyone that she is girlfriend of a famous business tycoon. The actual fun begins when this business tycoon (Sanjay Singhania played by Amir Khan) itself becomes part of her lies. This love story continues after some time but again in flash back. It is this story which makes us smile and make the movie pretty.\n\nThe other half is exactly opposite of this and is extremely violent. Sanjay who is now having short term memory loss, searching for guy named Ghajini to kill him and to revenge the murder of Kalpana. This part is over dramatized. A typical villain, who carries with him half dozens of goons, and a typical Indian (more of south Indian) hero who easily picks up and throws a guy of double his weight. In fact the last action sequence kills the entire mood of the movie. When the audience is hoping some twist to happen, this elongated action scene doesn't stop at all. Also the very end of this scene goes in typical bollywood fashion, and audience make ridiculous faces. It is the end and climax which has gone totally wrong and had killed the movie.\n\nI feel the overall movie is just a revenge story, and short term memory concept is not used very wisely. Only in two scenes audience can feel the pain of the person going through this trauma. Even if the main character would have been normal it would not have made much difference. It is the love story and songs which comes in as flash back makes more impact than the revenge and short term memory concept.\n\nAll the actors have done good. Amir as usual at his best (though I will not say award winning performance). His blank expressions has given more edge to his role. Asin, whom I have only seen in songs did the role naturally. She is fresh, good looking and make a hell of good impression. She is very talented without any doubt. Jiah Khan do not have much role. Same goes with her acting and expressions. Instead of her, if the director could have just put her photo with lips moving, it could not have made anything better. The villain has done his part nicely. No -ve points for him. He even succeed in making our blood boil.\n\nJust some points which could have made movie better.\n\n1) Why the movie is named after the villain? Doesn't make much sense at the end.\n\n2) Jiah khans character could have given some more scope and a different actress could have been used. Jiah is too amateur to be actress. (Can certainly be used in item songs though.) 3) More stress could have given on the short term memory loss concept than the action and love story.\n\n4) Some guns could have been used in the last action sequence. Amir doing so much of action with bare hands is not comfortable.\n\n5) The inspector at the beginning - This role could have been used more wisely, or could have been removed at all. As current version, this role just looks like a filler.\n\n6) The very last scene could have been shortened.\n\n7) The scene at the end where Amir gets injured and rise again could have been removed. Some other twist could have been introduced here.\n\n8) The flash back could have been cut into more pieces. That would have made good combination of emotions.\n\n9) Amir is shirt less in songs but not in the end action. Something that should be thought of as a director.\n\n10) Finally let the audience feel the pain of short term memory loss. This is the reason why Memento is a reverse movie. Something like some scene at the beginning making sense at the end. The full journey of the Sanjay for finding Ghajini could have been interesting.\n\nOverall, it is much better movie than the current bollywood movie, with good acting and songs. But please do not watch with Memento in mind."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "athulkhan",
        "review_rating": "10",
        "review_title": "Once again, Aamir Khan graces screens with a masterful performance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "wolfhuntsvalue",
        "review_rating": "2",
        "review_title": "Disappointed - Aamir looses credibility",
        "review_detailed_main": "Our family has always been an avid fan of Amir for over a decade. He earned it until Ghajini...\n\nStart with the script..very loose, full of holes and very convenient. Classic case of confused writer forced to write 180 pages to fulfill Indian audiences appetite for 3 hours.\n\nCharacters were single dimensional. Aamir went over the top on several occasion. Newcomer actress did a wonderful job but is forgettable.\n\nGhajini proves the fact that even actors/producers like Aamir are so reluctant to break out and risk challenging human intellect. One has to watch Memento to realize how poorly Ghajiji comes in exploring human mind's dilemma. If Memento stimulated audience's intellect to a scale of 10, Ghajini comes at 2..\n\nAt the end of the day, what sounded like a promising picture ended up following the same old Hindi, sing and dance, malasa flick.\n\nThis, probably was the las Aamir flick that we'd watch in theater."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "taseer-7336",
        "review_rating": "10",
        "review_title": "superb movie ever in the history",
        "review_detailed_main": "I love this film..... this film has made a another level in thr indian cinema....at a high postion.."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "tambe",
        "review_rating": "10",
        "review_title": "Ghajini",
        "review_detailed_main": "Everyone said that this movie was too violent. I thought why should I waste my time? But finally took a chance, mind you I was wrong, Ghajini was indeed a great movie. Inspite of the violence the story made sense.\n\nKalpana was so helpful and nice that I didn't want her to die. She was the one who brought the movie to the top. She looked stunning in the song 'aye bachchu' which compelled me to see the song again in Youtube.\n\nAamir Khan was like a ferocious lion when he fought, while Ghajini didn't look that scary as a villain should look. In the fighting scene at the end Sanjay had super human powers which made the scene look contrived. It decreased the realisticness of the movie.\n\nI learnt a lot from this movie, example getting organizing in spite of mental problems and making a goal in your life for what you live.The movie conveys a lot of feelings which if you know you will start crying. It's a very interesting and a bit scary movie according to me. But, don't miss it!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "just-theo",
        "review_rating": "10",
        "review_title": "Unfair criticism",
        "review_detailed_main": "Unlike all people who believe Tamil Ghajini is better,i disagree as the Hindi version is basically same (scene to scene) but there are various improvements such as the fight scenes,endings and fixed holes(who is ghajini? & why doesn't anyone on the street recognise sanjay singhania?) in plot.\n\nI have seen all three movies(Memento,ghajini)and think its unfair to say it to compare ghajini as a total copy of memento(both are one of my favorite films).Ghajini is obviously a copy with all the polaroids and tattoos but the main part of film is the love story which memento is completely devoid of .Memento lacks emotion even though it has a brilliant storyline.\n\nThe Hindi ghajini has far better climax than the tamil one with surya's acrobatic kicks & lifts replaced by aamir's slick one-step punches.The only down point of Hindi ghajini is the songs even though they are good but cant compare with the tamil hits (suttum vizhi beats guzarish any day).It is an all n all entertainer unlike memento. Refreshing to see Aamir to do action."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "vikas-gupta84",
        "review_rating": "5",
        "review_title": "Disappointed",
        "review_detailed_main": "I was told by a friend of mine that movie is amazing, but after seeing the title i was disappointed and i think i wasted my 4hrs(including ma travel time). Movie is slow, doesn't have any story........direction is poor ....... screenplay is OK........... i think with no story still acting of aamir could have been used effectively, but it doesn't even does that........ there is no punch, though there are build ups but they shatter at your footsteps. Zia khan is wasted.... and yeah there are technical glitches......... Even the main villain doesn't scares any one.......\n\nDon't waste your money to go and see this flick in a theatre."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jjose04",
        "review_rating": "1",
        "review_title": "do not waste your time or money!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "saadziakhan",
        "review_rating": "1",
        "review_title": "unbelievably Worse!!",
        "review_detailed_main": "NB:I have been a Great Great Memento fan since the time of its release and watched that movie a dozen times and Love it..For all those people who haven't seen \"Memento\" please don't compare it to \"ghajini\".This \"Ghajini\" is nothing like it nor could ever be.\"Memento\" was a true masterpiece.\n\nAfter having said that...now I was forced to give 1/10 as there was no lower rating.It doesn't deserve 1/100 or 1/1000.I would have rated higher if Aamir was not in it. I just can't believe he took the movie.Still wonder.. may be he was threatened or something.After projects like \"rang de basanti\" and \"taare zameen per\" how could you ever do such a CRAP??\n\nTo sum up Aamir's ripped body,lots of shouting,Aamir kicks on ground...living bodies fly in the air.The most cheesy acting heroin in the history of Bollywood ,lame jokes,complete mockery of medical students and profession and the most hideous and unforgivable crime ever..they mocked \"Memento\".Why on earth did they do that??? I don't usually write reviews on the movies but this one made me mad.I wanted people to know how bad it is.I just don't believe how this movie got recognition from masses.Even the starting titles part is cheated form \"Fight Club\"\n\nBollywood wake up!!!There are people who love and respect Hollywood classics.Don't mock them with senseless load of crap. this movie gets 3/10 for action, 5/10 for music and a true \"ZERO/10\" when whole movie is watched in a single sitting. The movie is so unbelievably worse you actually have to watch to make yourself believe. Regards Dr.Saad Khan"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "staindoutside",
        "review_rating": "4",
        "review_title": "Its just a waste of time",
        "review_detailed_main": "well i watched this movie just because of Aamir Khan and well there was no other reason to do so, after watching this movie there were only two things in my mind 1. what made Aamir Khan do this movie ? 2. was it just the muscular skin show he wanted to show us on screen for 3 damn hours\n\nOK so now let me get to the real review of the movie\n\nDirection : well Murgados should better stay in south and make such non sense cinema and which will be as big hit as his 2005 version of Ghajini and the crowd is going crazy for this one also.\n\nActing : Asin did her job perfectly well she is a new addition of good performers in Bollywood, where woman lack talent to such and extent that they are only used in movies like Katrina Kaif.\n\nAamir, the perfectionist has gone so lower than his level that i thought it as one more Aap Mujhe Achay Lagnay Lage of Hritik, and at times i just thought that he is always in short rolled sleeves in office to make a fashion statement ? reminded of sunny deol in all of his movies ! Mr. Designer wake up its high time !\n\nwell in short if you want to see Aamirs new body this Ghajini is just made for that other than that it lacks soul, screenplay is lacking everything, direction is pathetic, and only one song is picturised good which is Behka, other than A.R Rahman is wasted here completely.\n\nVillain of the movie just make no sense who is he what is he doing and why is he doing that when he is owner of a Pharmaceutical company ?\n\n3 hours just wasted simply waste of money and above all when world is going through all the violence and hatred one should prefer watching lighter cinema, i was a huge fan of Aamir Khan but even it came to me as surprise that guy who gave us Lagaan, 1947 Earth, Mangal Pandey, Rang De Basanti and above all Taare Zameen Par.\n\nit may shatter box office records and all but all in all its just waste of time."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mokshjuneja",
        "review_rating": "2",
        "review_title": "Ghajini - disappointing",
        "review_detailed_main": "Ghajini might as well qualify for a complete masala movie with action, revenge, drama, romance and very other element that a masala movie qualifies.\n\nAamir having quirky lines, Aamir having a combination of a look from Fanaa as well as the Dil Chahta Hai. More than Asin or Jiah Khan's belly button flashing - you had Aamir Khan's flat stomach (not exactly 6 to 8 abs) being flashed more in all types of camera angles. I believe one song was particularly made for the flashing Aamir Khan's belly button.\n\nAye Bachchoo one of the songs in the movie where you have Asin being introduced in stylishly dressed in a Manish Malohtra attire had the sequences of Michael Jackson videos - just to name a few, \"In the closet\"; \"All I want to say is that, they don't really care about us\"; that face changing in \"black or White\". Honestly either I have been exposed to many entertainment options and have been observing to intently to realize that you are being inspired. In another song - Bahkha, you have six Aamir Khan's wooing Asin. As if one was not good enough, then of course Johnny Depp did the same thing in the last of the trilogy of Pirates of the Caribbean - At World's End.\n\nJust to highlight the story, without any spoilers in it, Sanjay Singhania played by Aamir Khan, is a rich businessman who owns a cellular phone company named Air Voice. Kalpana played by Asin Thottumkal, an advertisement model goes around telling her advertisement crew that she is the love interest of Sanjay, in spite of her having never met him and also goes to the extent of giving an sheer conincidence an interview with a very local newspaper called Mayapuri about her relationship Sanjay.\n\nSanjay happens to hear about this through the media and wants to settle scores with her.(Here, i love the part when they are trying to sell the sensational news item on a television commercial, also highlighting that if you buy the latest Mayapuri for the gossip, you will also get two packets of pav bhaji masala.)\n\nJiah Khan comes quiet later in the story but upfront in the movie. First it was Amitabh Bachchan and now it is Aamir Khan, will she be lucky enough to be part any other Shahrukh Khan movie... let's see?\n\nOnce the love angle is happening, Kalpana saves a group of girls who being part of a flesh trade racket, for which the goons are after her...in between somewhere, Sanjay out his memory and can with hold it for memories for 15 minutes and then you have a new Aamir Khan or Sanjay in case of Ghajini, again. Gold fish could porbably be better at it, that reminds me, let's me try and list some top of mind amnesia based movies -\n\n* Finding Nemo (hilarious, can keep watching everyday, Dory was cute), * 50 First Dates (Romantic Comedy, once it OK, Adam Sandler was good, so was Drew Barrymore), * then you have the Bourne series - Identity, Supremacy and Ultimatum (action oriented, all of them worth once, Supremacy also features Goa), * Memento (Aamir said don't compare), * Ghajini (what can i say, please continue reading...)\n\nMy other problem in the movie is that the songs at a drop of a hat, which were completely unwanted, unrequired, unstorylike. If you have already seen Taare Zameen Par, the songs were to completely make your heart bleed and reach out and connect with the character. Damn, another comparison. I probably was unable to fathom was that was the director trying to make an action? thriller? romantic? animated? Oh yes, he has really used the animation (not cartoon types) also in the movie, it did leave the monotony of the storyline, like the starting credits was just decent, but then it got boring. Another animation where you have a private jet flying over dark clouds, which I just cannot remember the movie. Then you have unnecessary and over doing use of jerky camera moments. Dripping of water sound was constantly being used throughout the movie detonating probably nothing. The movie scenes had really dramatic long pauses between Aamir Khan and Asin, where i was trying to peep into my neighbors Nokia camera phone to know what time it was?\n\nThe villain was not at all menacing enough and took the protagonist and his illness too much for granted, which was completely uncalled for. He reminded me of Goga Kapoor. Coming to the action sequences, it was more dramatic, than action. Plus the movie should not have extended to 180 minutes could have been finished in around two and half hours.\n\nI am so glad i didn't get the Ghajini haircut done, at first it was like it is the only other movie releasing of Aamir Khan, so should get the hair cut done, then i saw a group of street children begging at a signal with having the same hair cut. Thumbs Down to the idea of the hair cut. Then , i saw how Aamir Khan was promoting the movie, by giving the hair cut to one and all, then i go for it again, then i had to watch the movie, for sure it i love my hair, so no Ghajini hair cut. The good part of the movie watching experience was that i could hear hooting and clapping when movie started, Aamir Khan makes an entry in a multiplex. My rating to the movie is one and half stars!! Since i was hoping for much more and there was much more desired in the movie and much more desired in Aamir Khan, especially with better movies than this."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "saba2115",
        "review_rating": "5",
        "review_title": "A complete waste",
        "review_detailed_main": "I have always held AK in high esteem and have lauded all his recent successes. I went as far as spending a big sum of money to buy tickets for a special screening of his most recent film, the much talked about Ghajini.\n\nI think it's awful.\n\nI like AK, his body is a marvel and worth staring at; his talent is unquestioned but what the heck is he doing in this movie? Forget the fact that people who watch movies a lot know that this is a copy of a great Hollywood flick. It's happened before and no one complains much.\n\nThe fact is we are left wondering--what is the point of this movie? There is some bad acting (the actor playing the police officer is awful and so is the so called \"Ghajini\"). The story line is held together loosely and has several loopholes.\n\nThe song and dance routine really hurts , man!! And, it's time to accept that the South Indian method of cinematics is completely different from the rest of the world. The sensibilities are different so this movie just doesn't work.\n\n\"Kalpana\" is good but not Jia Khan.\n\nPoor Amir! I wish him the best and hope his next venture is a huge success to make up for this one."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "srehal",
        "review_rating": "2",
        "review_title": "What a Disappointment!!!",
        "review_detailed_main": "I wonder why Bollywood is obsessed with a multiple genre in 1 movie package.They can't seem to stay focused. The concept of Ghajini had so much potential, yet by adding a little comedy here, a little tacky romance there, and a few other genres, it seems to lose focus. There are a few powerful scenes that showed promise, but it lacks direction and focus. I question Aamir khan's rationale for taking this role, since he is such a talented and intelligent actor. Nevertheless, sadly to say, I know bollywood lovers love these multiple-genre-packed movies, so it will do well at the box office. Furthermore, it doesn't help that bollywood persistently copies Hollywood blockbusters (mimics danny the dog and memento), however with great failure..."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "aragornstrider",
        "review_rating": "1",
        "review_title": "Tormento - A story of steroid overdose",
        "review_detailed_main": "Some may say this movie is based on \"Memento\", if it really is then Ghajini should have been named \"Tormento\" for it was nothing short of a tormenting experience. Memento was a very good movie and apart from the sickness of the protagonist there is not much like memento in this one. In fact, Ghajini is a typical pot boiler, extremely loud, badly directed and acted South Indian revenge caper. Worse still the background music is ear numbing and mostly out of place and the soundtrack barring a couple of songs just added to the agony. This coming from the same guy who scored a triumphant music for \"Slumdog Millionaire\" is rather disappointing.\n\nApart from Aamir Khan's dedication to his craft and his advertisement of \"what steroids can do to the muscles of 40+ year old body\" there is nothing much to talk about this movie. I couldn't finish watching it. Good luck to the ones who plan to!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "vikrantjindal21",
        "review_rating": "3",
        "review_title": "South Indian masala...",
        "review_detailed_main": "Strange, Confused, Gory... Thats what Ghajini is. You can easily recognize it if you have ever seen a Tamil/Telugu movie. I wonder why did Amir Khan even sign such a script. The movie starts with a decent note, shows us a troubled man. Then his past is portrayed beautifully. Asin, the female lead carries the story on her shoulders. Her presence is full of liveliness, which is the sole saving grace of the movie. But when the movie returns back to present, it becomes boring and devoid of emotion. Though Amir tries his best, he is only able to show Sanjay's emotions, but that does not instill life in a dead storyline. And the climax is so flat that one just gets irritated.\n\nBackground score is pathetic. So is editing. The songs are forcefully put but beautifully shot. Jiah Khan character is again a big flop. Not much scope there. The villain is a big fool (total South Indian style). Asin deserves a huge round of applause. She is perfect in the movie, and the only reason why you sit till the end of movie.\n\nAll in all, Ghajini is all hype, and zero material. Indian film-makers should understand that when they are copying a classic like Memento, they should at least try to be true to the original. Though the idea of less flashbacks was good, but the film was broken apart into two halves. While the romantic part strikes a chord with the audience, the gory part just falls flat...\n\nThe film also shows Amir's desperation in front of SRK. And poroves why SRK is the Bollywood Baadshah, and not Amir. Rab Ne Bana Di Jodi is way better than Ghajini.\n\nNot worth a watch !!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "gocam20",
        "review_rating": "1",
        "review_title": "Amir's waterloo?",
        "review_detailed_main": "How did this picture ever got made, even more astonishing is that how did Amir Khan agree to act? I am so stunned by the awfulness of this movie that my hands have frozen, I just cant understand what were they thinking? Its amazingly bad doesn't even deserve a review.\n\nAll i can say is that the lead actress goes home with some credit to her name. Technical this movie is severely flawed with special emphasize on the editing. A R Rehman's music is surprisingly flat. If you want to take one thing positive out of this film then it is Amir khan's dedication to his role for which he trained for more then 10 months."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ranjit-radhakrishnan",
        "review_rating": "1",
        "review_title": "Short Term Memory Loss",
        "review_detailed_main": "Short Term Memory Loss Please!!! I wish I could incur this somehow. And I guess I didn't focus too much on the end-credits to notice the designers name, but what an attempt to make Aamir look gay (and not in the verb sense, and also not in the metro-sexual sense either). Female Actresses; guess I give them too mich credit by addressing them as actresses. They were nothing more than well made up dolls, that could not deliver a line of dialogue. Indian Cinema has always been focused on masses, and I always held Aamir in too much respect to think he would do this either. This is an an 80s pot boiler and not for the 21st century.\n\nAlso I am surprised most people loving this movie. This is exactly what destroys Indian cinema."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "priyasdipu",
        "review_rating": "3",
        "review_title": "Memory loss drama falls flat",
        "review_detailed_main": "Sanjay Singhania (Aamir Khan), the owner of company Air voice falls love in with a girl named Kalpana(Asin) who is a budding model. All these time the girl doesn't know that his prince a rich guy. The love story takes twists when our own hero goes to London for some company work and returns to find his girl trapped in her own house by some gang men trying to kill her. He tries to save her, but the perpetrators injure Sanjay badly hitting his head with a rod and thereafter they kill Kalpana. Sanjay loses his memory and behaves like a violent psycho thereafter. He keeps note of all things in his diary and taking pictures of every places and person he meets. Thus he sets out for his journey of revenge for love. There is hardly any unpredictable in the script in spite of this memory loss drama which isn't used to good taste. The backbone of the script is same old boring Bollywood movies of 1990's. Though the screenplay is manageable, the script hasn't enough punch to grip into the seat. In final scenes, our Sanjay will put NEO of Matrix into shame. He kills hundreds of enemies with the sway of one stroke of his arm. Even five to six robust policemen are unable to tame him in some scenes. In some scenes he acts like a wild, hungry & irritated beast (gorilla) frustrated inside the bars.\n\nIn the acting department, Aamir Khan has done his job strictly OK. He has done some great workouts for his physique but as I have told he looks like a hungry mammoth gorilla in some shots. The bald look suits well for the role. The actress was a charm. She has an on screen presence which clicks well with her role. Jiah Khan Sucks, she needs to do a lot of homework before showing herself in front of camera. The villain looks too old and lazy. He may be having those spine chilling looks for South Indian Movies, but here they could have made some wise & better replacements.\n\nThe movie in bits and pieces looks like a well made product appealing only to rural India but I hardly doubt the metro and multiplex goers will hardly find anything interesting. I will tell you the various reasons. The heroic entry of the actor and the dramatic fighting sequences. The unnecessary loud jarring background scores. The slow motion and fast motion effects for the thrill in the fighting scenes are really overused in the movie.\n\nFirst of all let's be clear that there is no comparison of Ghajiini with any other commercial movie but apart from this also, the movie has badly let down our expectations. I will remember this one as dark mark in the impeccable record of Aamir Khan. I wont be surprised if this one is a let down for Aamir's fans esp after a wonderful movie \"Taare Zameen Par\" this one is straight into the ground. For more reviews like this visit me at incubation360.com"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mehraankur2001",
        "review_rating": "2",
        "review_title": "ghajini- over-hyped to the every extent",
        "review_detailed_main": "i had really great expectations from this movie Ghajini because of the actor Aamir Khan. his movies are made after a lot of research... but this i dunno what happened to him and his research. this movie is really badly made and badly written. cant imagine the dialogues are written by piyush mishra. the story is based on the same concept as memento. but this one is no way near it. ghajini is badly directed, written and has bad acting. none of the actresses have left a mark. they have done nothing great at all. aamir himself doesn't impress with his acting. the other actors are also pathetic. the songs and action sequences are typical rajnikant sequences."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "punksareforever",
        "review_rating": "2",
        "review_title": "A deeep Fallll for Amir",
        "review_detailed_main": "I am extremely disappointed with everything that Ghajni has including its time frame. Now there is clearly a difference between Best Movie and Best Selling Movie. Ghaji is a best seller mainly because of promotions that amir did for it and his 8 pack abs thing. Perhaps Murgudoss should either stick to making south movies or if he has to enter bollywood rather than direction thnink about selling tea or idlis or whatever. Most of the \"so called\" great bollywood directors Subhas Ghai, Karan Johar, Chorpa etc are a bunch of BIGGEST loser to walk on planet earth. Movies like Wednesday,amir etc are prime example of excellent movie making. I think actors like aamir who has put in year of hard work to have a build JUST for this movie should have chosen this project with some small time but good director. My rating 2."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "futurekanak",
        "review_rating": "1",
        "review_title": "Waste Of Time n Money",
        "review_detailed_main": "Well i had a very good expectation from this movie but after watching it i was having a headache.....\n\nAamir khan s acting is the only good thing in the movie...\n\nrest the story is the same old....a guy fighting for her girl.... revenge...\n\nn no mystery....\n\nall in all if u all have the guts to bare a movie which is dragged for 3 hrs n 30 minutes give it a shot...but a total disappointment....\n\nI hope Aamir khan does not end up in all these movie s again.......he acts really well and deserve s to do better roles...not like these with loose stories..."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "die_Heuchler",
        "review_rating": "5",
        "review_title": "Way too Southern",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sebs-15532",
        "review_rating": "1",
        "review_title": "Remake of another copycat Movie",
        "review_detailed_main": "The Tamil version shamelessly copied from the movie Memento, and Bollywood remade it again. Christopher Nolan should sue the f@#! Out of them!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "vampire_darren13",
        "review_rating": "1",
        "review_title": "worst copy ever made!!",
        "review_detailed_main": "i was quite a fan of aamir khan. But since i saw ghajini, he ruined the image i had made up for him. I thought he choses story well, he thinks of the plot, he works with professionals who can handle the theme they are dealing with. BUT...after viewing this movie today, i was just shocked by the awful (in every aspect) movie ever played by a so called Best actor of bollywood. This movie is said to be inspired from Nolan's Memento.....WHAT!!!!???? It is a disgrace....how can someone be inspired so badly that he determines to make the movie so bad. Nothing is original.. All same old story where actor wins at last type movie. I didn't expect Aamir to play such worthless, poor cinema..\n\nDo not Remember to watch it!!!! Just forget that it was ever made.\n\n*/5 out of ********** DISGRACE!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sachinpise",
        "review_rating": "5",
        "review_title": "Just OK.",
        "review_detailed_main": "We watched the third show in UAE. Well, sadly, the movie gets you lost between two different themes. One is romantic comedy when Asin is present and another one is real Ghajini where there is lot of good action and violence. Overall the movie was good but lot of unnecessary stuff in it. Most importantly, 15 minutes memory loss, was forgotten by director from time to time. Every time the camera beeps, he is supposed to forget what happened in last 15 min. But in many scenes he continues from past 15 min.\n\nOverall I was disappointed by Aamir Khan for such story. He did act well and Asin looked good with him. It was in fact, their love story from flash back was worth watching. Villain was big time gunda with so many people working for him, but in last scenes, the entire gang of the Villain had forgotten their guns which could have solved their problem of Aamir easily, that too in their own area."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "uddalak-banerjee",
        "review_rating": "1",
        "review_title": "huge disappointment from someone of stature of Aamir ..",
        "review_detailed_main": "i liked Aamir Khans Laagaan and TaareZameenPar but Ghajini(2008) turned out to be one of the biggest disappointments since we were waiting from something special from Aamir on 25th December ,the Christmas day. But as the movie turned out to be one of the oldest old masala movie churned out to the audience by mixing copied portions from various old movies trying to vaguely portray a original script. A shame for a man of stature of Aamir khan specially after he churned out a film of the caliber of TaareZameenPar(2007) which had both a positive message as well as a forward step for Indian cinema. But i am sorry to say that after witnessing Ghajini(2008) i am shocked to say that starting from beginning to the end the film totally fails to impress even after the amount of promotion put behind it.Even the last Ghajini(2006) enacted by Tamil superstar Surya was way ahead and the worst part is that it completely tarnishes the image of Bollywood .So friends it is absolutely a no watch movie specially for children because of high amount of mindless impossible action shown which sadly undoes the good effect of taare zameen par.so it is 1/10 from me for the mindless action and the backward step taken by Indian cinema.."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sanchit_31",
        "review_rating": "3",
        "review_title": "Cannot believe aamir did it!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "thefreaks",
        "review_rating": "3",
        "review_title": "Compared with Memento or not,Ghajini is waste!",
        "review_detailed_main": "I had huge expectations from Ghajini considerings it's an Amir khan movie n it's 'inspired' from cult classic 'Memento'...\n\nBut watching this movie on a first day first show was total waste of precious money and time.\n\nAt 3 hour plus length,Ghajini literally drags and is enormously boring. Why d hell did they have to insert an over the top love story into what should have been a 'full action revenge movie' or something like that?The love-story simply doesn't connect and eats up almost 100minutes of time!\n\nMany plot holes...like what was police doing when Ghajini simply kills a Woman and a lady constable knows about his plan to kill her??Aren't they supposed to arrest or question at least someone?\n\nWhy was that inspector's character(Mohit Ahalawat I think) in the movie??Just to Read Sanjay's(Amir khan) diary??\n\nWhy did those funny gangsters of Ghajini have no guns at all??\n\nWhy did the characters of Sanjay's doctor,lawyer,manager etc. not do anything to help his take revenge or at least try to calm him down?\n\nHow can a business tycoon just disappear for 2-3 years and his company still earn millions?? (The manager tells him to come back to the office or house).\n\nAnd how can the face of such a successful and debonair business tycoon be unknown to everyone??Not only after the killings but also before the whole murder thing!!\n\nThe only good thing about Ghajini is it's action and violence which though is over the top and unbelievable at times,it's the only well executed stuff in the whole movie.\n\nAmir said he found 'memento' overly complicated.Naturally I'd say,because he was busy making a remake of a Tamil movie with more style and no substance.\n\nCompared to Memento,Ghajini is utter trash. Even if not compared,it is a boring,unoriginal,over the top and again BORING effort. It's sad to see Amir khan wasting a good concept like that.\n\nDon't waste your time or money on this one.Especially if you've watched 'Memento' and/or don't like on screen violence."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rafik_kuwahish",
        "review_rating": "1",
        "review_title": "Sharukh is 100 time better then Aamir .",
        "review_detailed_main": "Aamir was a excellent actor but the script is being stoled by another Tamil film.According to me the user rate was 0/10.How did this picture ever got made, even more astonishing is that how did Amir Khan agree to act? I am so stunned by the awfulness of this movie that my hands have frozen, I just cant understand what were they thinking? Its amazingly bad doesn't even deserve a review.\n\nAll i can say is that the lead actress goes home with some credit to her name. Technical this movie is severely flawed with special emphasize on the editing. A R Rehman's music is surprisingly flat. If you want to take one thing positive out of this film then it is Amir khan's dedication to his role for which he trained for more then 10 months."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ekomurlu",
        "review_rating": "4",
        "review_title": "Same to memento",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "turgayayhan",
        "review_rating": "3",
        "review_title": "I don't like",
        "review_detailed_main": "It was the film I did not like the most in the Aamir Khan films I watched until now. It does not go beyond boring with unnecessary long periods. It was wanted to be likened to \"Memento\". There's also a light \"Amelie\" quote. It would be a movie that would have been worth it if it did not exist."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "shajjo123",
        "review_rating": "2",
        "review_title": "After Memento, Bollywood should keep its hands off Prestige!!",
        "review_detailed_main": "First of all, I cant help being biased. Being an ardent fan of Memento for such a long time, its hard for me to digest a Bollywood style Memento. On top of that a guy from suffering amnesia goes on to get 8-pack body which is impossible without a personal trainer. When did he get the time to go to the gym? How did he remember his appointments and directions to the gym? Who was the trainer? All this and more will not be answered in Ghajini. Also please note that Guy Pearce had a body of a worn out slipper in Memento. He looked fatigued and that added to his character. Here Aamir seems to be enjoying the healthiest possible diet though rest of his life is in tatters, apparently. Anyway lets mover away from Memento. Ghajini in fairness starts off well, i.e. first 20mins. But then comes the mandatory song and dance routine for next one hour. Here we come to know that Amir met the girl, song, fell in love, song, married, more songs etc. Around interval girl's character comes to it logical end and this is where film tries to get back to its roots for first twenty minutes, i.e Memento. Unfortunately this is exactly where the problem starts. Memento was not a film for masses even in UK or USA. In fact in USA they had to release a special version where the film does not work backwards. Ghajini, though does not work at all, neither back nor front. Post interval it turns into a gory revenge flick that looks straight out of 80's bollywood Amitabh-mas(a)laa stuff. This is where Aamir's versatility kicks in. One minute he is traumatised amnesiac, next minute Aamir all of a sudden turns into Oldboy (a classic!!) and then stretches himself to Sunny Deol a la Gaddar. The scene I am referring to is the one where Amir pulls out a tap from ground and rams it in the head of a goon. In the next shot we see blood dripping out of the tap. It might sound gory cringy and violent, which it is, but while watching the film it makes you chuckle unintentionally. Going further into details of the storyline will probably give away a lot, although there is not much to go into post interval. The awkwardness in the first twenty minutes or so arouses interest. Post interval its just plain awkward. So if you watch it, with Memento running at the back of your head, its just about OK, if you are generous. If you watch it without prior knowledge of Memento, even then its just about average. I just hope that Bollywood's love affair with Chris Nolan finishes right here. Prestige is a gem that he directed and I have a gut feeling somebody in the good old bollywood would probably be casting an eye on that. Worse scenario, what if Shah RK and Aamir star in as Hugh Jackman and Christian Bale. NAAAAAhhhhh.... Let Ghajini be the end of that."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "neermahajan",
        "review_rating": "3",
        "review_title": "Hackneyed plots, love story, songs & moments of suspense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "saumya14588",
        "review_rating": "5",
        "review_title": "Aamir not at his best...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rohan_cool_dude",
        "review_rating": "5",
        "review_title": "A typical Bollywood what was made in 90's but not today",
        "review_detailed_main": "Hi i am Rohan , a very big fan of aamir Khan and a supporter of the kind of movies he does RDb, to mangal pandey and taare zameen par with many others, This movie is a very typically bollywood movie which was like supposedly made in 90 and it feels lot of stuff seems like u see those dubbed Tamil movies you can see directors is from south India which you could easily make out as north Indian. the hints are all over the place from the effects.\n\nFirstly movie is very violent, aamir has acted very well, even the Actress is good but Jiah khan's English is accent is very typical in beginning, i don't why she is trying to have that accent for no reason, The movie is OK but its not what you expect from Aamir Khan. usually his movies have theme which we in bollywood are not used too and his experimentation is amazing but this time not so good.\n\nThis is the kind of Movie may be you expect Salman Khan or may be Shah Rukh khan with his typically bollywood movie would do but not aamir. As a Fan i am surprised that why did aamir picked this movie. I am very big fan of aamir and it hurts me to write anything bad about him, but i am disappointed with his choice. You could watch the movie once if you like but if you skip also its not best of Aamir, you should go to see the movie when you wanna see how hard aamir has worked on his body."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sorwar-ahmed",
        "review_rating": "5",
        "review_title": "The good, the bad and the ridiculous",
        "review_detailed_main": "I saw the trailer for the movie and a review on TV, showing Aamir's new physic and bit of the storyline. I knew straight away that the film was a copy of Christopher Nolan's, excellent movie called, 'Memento'. I like Aamir Khan movies because not only is he a good actor (Lagaan, Dil Chahtha Hain, Rang De Basanti), but an excellent director too (Taare Zameen Par).\n\nI was surprised that he would sign a film which is a copy, but I reserved my judgement until I saw the film because normally his films are refreshing.\n\nThe Good: Although Aamir Khan is 40+ he was still able to work out and display a great physic, giving me hope I can too get fit with a lot of hard work as I'm only 29. Asin (Kalpana) was a breath of fresh air, her character seemed so natural even I fell in love with her and her comic timing was fabulous.\n\nThe Bad: The story was a bad imitation from a well known movie, it works perfectly with Christopher Nolans Memento, but I just couldn't get interested, unrealistic circumstances spoil ed the movie. Ghahini tries to incorporate a love story and thriller into one and I don't think there was enough time to build either one. The script was horrible and should have been torched.\n\nThe ridiculous: Jia Khan's acting was very annoying, I just wished the Director could have found a way to get her killed. The action sequences was awful, the very reason I have stopped watching Sunny Deol movies, I don't care how strong Aamir looks, he just cannot a throw a bigger and heavier man the way he did in this movie.\n\nI would only watch this movie for Aamir and Asin, other than that avoid it if it just for the story. 5/10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "harpisteva",
        "review_rating": "5",
        "review_title": "Why was this movie made?",
        "review_detailed_main": "I watched Ghajini expecting that it would be an awesome movie with a powerful message or even storyline. But it was a story that had many loose ends. Some of the angles were not believable towards the characters of the movie. The story has been done before, I believe Sunil Shetty and Karishma Kapoor did a similar movie where Karishma gets killed and Shetty is after the killer. I guess because this movie was so hyped and so the expectations are so high towards Amir Khan and his work, that if they aren't met the audience gets disappointed. But I don't understand why he made this movie. I felt the two leads didn't have chemistry and another actress closer to Amir's age should have played opposite him. I am just so tired of these older characters coming with actresses that aren't close to their age. I believe Fanaa was great only because of Kajol and Amir Khan. But back to the movie, at the beginning I felt I was watching a horror or slasher film, with all the elements of pictures that said \"Done\" and \"Over\", it was really comical at times when you see the immature handling of the situation of the main character. I never saw Memento but after watching this movie, I watched the Tamil version. And when I saw that the Hindi film is the EXACT copy of the Hindi version, I asked myself again why this movie was made. It is the same actors, except a hand few and Amir Khan. Therefore, Asin is no debuting actress, she is saying the same lines and acting the same way but just in Hindi! I feel that for Amir Khan to do a movie where the actors are playing the same role in another film is just absurd. Why couldn't they just dub the Tamil movie in Hindi? Life is Beautiful is a great film but they just dubbed the movie in English. As actors and actresses, why would you want to do the same movie twice. Even the director's reasons are questionable. The Tamil version, I felt was better and okay that it didn't really needed to be remade or retold. I feel the two leads in the Tamil film had chemistry. The Tamil film had a better camera work and more of a cinematic appeal. I liked the ending compared to the Hindi version where it just reminds me of \"Titanic\" and Amir is staring into space. It just shows that Bollywood is just into making remakes and copying other films from any direction. They just remake it in a more modern, commercial and mainstream way which requires the audience to not use their intelligence."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "m-amitava",
        "review_rating": "5",
        "review_title": "Ghajini : Not Aamir Khan......definitely not !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rar155",
        "review_rating": "1",
        "review_title": "Movie Sucks",
        "review_detailed_main": "GHAJINI is simply one of the worst copies ever made in bollywood.\n\n15 minutes into the movie and you start realizing that this is just a big headache.\n\nThe plot of the movie has been stolen from Christopher Nolan's Memento, which is one of the greatest movies of all time, however, the director of this movie tries to add extra punches, which make the movie boring and lengthy.\n\nAamir is OK, but Jiah Khan really sucks.\n\nSo, I would say that I have wasted 3 precious hours of my life watching this awful movie."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mohan_i",
        "review_rating": "2",
        "review_title": "unconvincing, indigestible tripe...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mustafa-ali-jani",
        "review_rating": "2",
        "review_title": "cheap version of memento!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "loga2604",
        "review_rating": "1",
        "review_title": "Absolute Rubbish",
        "review_detailed_main": "A lot of peeps here are calling out on others who compare this movie with Memento saying it's an unfair comparison and that this one is more fun to watch because it's Bollywood and the story's changed a little.\n\nNo.\n\nIf you judge movies you have to apply the same standard across the board. It is disappointing to see so many Bollywood movies in the top movies' list which do not deserve to be there at all. Three idiots, Lagaan, Vishwaroopam are all great movies but if you think they are comparable with other Hollywood classics, I'm sorry but you're deluded. Other Indian movies by Mani Ratnam, Satyajit Ray deserve more recognition in this respect.\n\nI really hate it when Bollywood films fail to acknowledge where they get their inspiration from if the main premise of a plot is blatantly copied from elsewhere (be it from other States in India or overseas). A movie should give recognition where it's due. To do otherwise is intellectual theft."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rasperino",
        "review_rating": "1",
        "review_title": "Ghajini is the exact copy of an English movie MEMENTO",
        "review_detailed_main": "Ghajini is the exact copy of an English movie \"MEMENTO\" by the Director Christopher Nolan. Amir Khan and movie director AR Murugadoss...they both don't deserve any credit at all. Bollywood guys only knows how to copy good western movies and how to fool the innocent viewers by claiming that it's their own creation and work. Huh!\n\nIn MEMENTO, Leonard Shelby (Guy Pearce) suffers from amnesia: he can remember only the last two or three minutes of his life. It complicates his existence very much, especially because Lenny's mission is to revenge for his wife (Jorja Fox) who was raped and murdered by a John J. Lenny remembers it through the tattoo on his body. Every day he writes notes, takes Polaroid photos and makes tattoos, so it takes him only to look at himself in the mirror to rebuild the vital details. Lenny is obsessed with thoughts of vengeance. And there are manipulators who are intent on taking advantage of the disabled and inconsolable man."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jonn_en",
        "review_rating": "3",
        "review_title": "Ghajini: Rajini or Gadar 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dipsonlyu",
        "review_rating": "1",
        "review_title": "WOW!!!! Wat a movie (Pun Intended)",
        "review_detailed_main": "Wow Aamir Khan's die hard Fans.....Way to go. I think only those guys will give it good rating who are die hard fans of AK.I was a decent enough fan of AK,not anymore. And AK fan club, how can u even say that ghajini and memento are two completely different films.U guys are impossible.Watever there was in memento was exactly same in ghajini.Extracting a memento script and filling up the spaces with a romantic story makes a movie different???great!Aamir khan's worst performance....shouting throughout the movie(Except for the romantic scenes).Even Guy Ritchie(Who's not as dashing and smart looking as AK) delivered a top notch performance.AK can't even put in a performance like that in dream(Sorry AK fans). The only good thing in the movie was Asin(reminds one of Hema Malini in SHOLAY). So, If u are an Aamir Khan fan.....U wud like any crap served by him.\n\nAND if u r a genuine movie fan..........The movie is not meant for genuine guys like u. (*** And for the last time stop saying that it is entirely different from ghajini***). A COMPLETE RIPOFF OF MEMENTO."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "HateNonSense",
        "review_rating": "5",
        "review_title": "Over Hyped, Unrealistic and Illogical",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dhoom_hritik",
        "review_rating": "1",
        "review_title": "Ghajini is a worst copy of a classic Hollywood movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "harshvardhan_hv",
        "review_rating": "4",
        "review_title": "OK movie, leaving apart the c-grade action scenes, movie fails to impress",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "aakashravs",
        "review_rating": "3",
        "review_title": "Very Disappointing!!!100%BollyWOOD!!!",
        "review_detailed_main": "After watching memento 2 years back, i was certain no movies could ever have an ending and Backward-Sequencing scenes and create such a beautiful piece of Motion picture. Memento had a budget of USD 5 million (i.e Rs.20 Crores) ,Aamir Khan was paid roughly Rs.25+Crores for the movie!! The Big QUESTION IS....FOR WHAT? The Casting is hopeless. None of them suited their roles,the romance is boring,moreover it doesn't fit into the kinda plot its being dealt with. Maybe the Indian audiences thoroughly enjoyed the film,but why don't people ask themselves what he's gonna do after he gets revenge!!!??? He gets his revenge(Every Bollywood flick ends the same way), but this time he wouldn't even remember ti so what was the use?? I was very disappointed when people called Ghajini, \"a film based on the English flick Memento\". All my high hopes on Aamir were shattered. Aamir didn't fit into the role!period.The old Aamir from 'Lagaan','RDB',PLEASE COME BACK!!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dream-isx",
        "review_rating": "5",
        "review_title": "Disappointing",
        "review_detailed_main": "After watching the promos for this movie, I was really excited. I quickly bought tickets just waiting to watch on what Aamir Khan had offer in this loosely inspired version of one on of my favourite Hollywood movie Memento.\n\nAamir Khan turned out to be the biggest disappointment to me. He's no way the 'Mr. Perfectionist' after this movie. He acts like a robot, killing 30-35 people while walking down the road and actually getting away from it. I can't believe AAMIR 'The Perfectionist' KHAN actually chose this script.\n\nAsin gives an excellent performance in Ghajini. She was the only person who kept this movie alive.\n\nJiah Khan doesn't have much to deliver as she is a very small part of it.\n\nA.R. Rahman's score is easily not his best but he does do a fine job.\n\nFinally A.R. Murugadoss - the director. Many people in this movie will the direction very similar to the Tamil direction. The direction is above average but the script is horrible(then what's the point?).\n\nGhajini has so many flaws that it gets pretty irritating after a while.\n\nThe audience may enjoy this movie as plain entertainment. But this is gonna be no favourite of a critic.\n\nGhajini - 5/10"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rahulparmar_07",
        "review_rating": "5",
        "review_title": "average movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sherlockholmes99",
        "review_rating": "1",
        "review_title": "Shame",
        "review_detailed_main": "Shame on Bollywood Remaking South Indian films and taking all the credits Better watch the orginal version with the help of subtitles way better than this."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "buddhadeb_09",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "paipradz",
        "review_rating": "2",
        "review_title": "Gajini - Just a remake",
        "review_detailed_main": "Except for the music and some good performance by Asin there is nothing in this movie that is really worth watching. After so much of publicity by Aamir from shaving peoples head to having a his plastic model at all the theaters and due to Christmas holidays this movie is doing well. I have watched both Hindi and the tamil version of gajini and I feel that the tamil version is far better entertaining and well picturised of the two. Aamirs styling in this movie is also not upto the mark. In one of the scenes he wears a short sleeve shirt and a jacket which no corporate executive would ever wear. It just looked like he was trying to show of the new body he has gained. Overall I feel that this movie should have been dubbed in Hindi like roja instead of a remake. Amir is a gr8 actor and like all his previous movies but this movie is not upto the mark.."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "sriram-rajan",
        "review_rating": "1",
        "review_title": "Poor and disappointing",
        "review_detailed_main": "Aamir Khan is alright but the director does not do any justice to him.\n\nAsin is really a sin on this movie. OK at times and irritating during others Jia Khan is unnoticeable.\n\nSongs are just randomly strewn and not good.\n\nMovie is just too long. Typical, steal the idea from Mememto but thrown in enough masala & the occasional international location to make it a commercial bollywood flick.\n\nIt's a Hindi movie but has a very over-acting South Indian touch which again is coming from the director A nice story was wasted with the usual bollywood drama and horrible direction."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mailtokannan",
        "review_rating": "1",
        "review_title": "Copy of a Copy can't deserve any vote!!!",
        "review_detailed_main": "Any movie that is a copy of a copy doesn't deserve any score (since there isn't 0, i had to rate 1).\n\nInstead there should have been a lawsuit!!!\n\nComeon, Get original! or don't in here!!!\n\nAdding some love and comedy to a \"Original\" isn't good enough to score a 5 or 6.\n\nOf course the 1 is for amir khan!!! no no no no, not for the 6 pack!!!\n\nIts for his hardwork in marketing this movie!!\n\nAt least this helped Asin get into bollywood.\n\nAnd she got the best new face award and sallu has her in the next flick!!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "xohayb",
        "review_rating": "1",
        "review_title": "Huge disappointment!",
        "review_detailed_main": "Since the time i heard this was a rip-off of Memento, I was reluctant to watch this movie. But i still wanted to see it as it was Aamir Khan and this guy has given us such big hits that now the anticipation surrounding his movies is mind-blowing.\n\nBefore i give the actual review, i must say aamir Khan has worked hard on his body and that year's hard work can actually be seen! The movie was atrocious. I haven't seen the Tamil version but i have seen Memento and if they were actually going to lift it from there, they should have respected it by keeping some flow. The plot is all over the place. The flashbacks inculcate a stupid romantic saga that does not make any sense at all. Action sequences are too much for a bollywood movie, these only suit Tamil movies where guys like Rajnikant can catch bullets and throw them back and yet get a round of applause from the audience.\n\nI only like two songs, actually love them. Kaise Mujhey and Guzarish. rest of the songs AR Rahman has let us down, once more, after the below average Yuvraaj score.\n\nI notice people are comparing Rab ne Bana Di Jodi and this one..On the story and overall message these cannot be compared as they are two different movies. On acting, maybe yes. Both SHahrukh and Aamir have acted well but as regards direction, music, and overall feel, Rab Ne is much better than Ghajini. Ghajini's plot is all over the place. Its a pure masala movie and it disappoints because Aamir Khan is there; the person who made us think..We want the old Aamir back please! Go watch it if u like mindless action and want to admire aamir khan's body. Otherwise YouTube his ''body in the making'' get some tips and just watch the movie when it comes on TV,. Its not even worth buying a DVD!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "santhosh-10290",
        "review_rating": "5",
        "review_title": "Ghajini (2008)",
        "review_detailed_main": "The movie was not so good. The Tamil version of Ghajini was so excellent. But Ghajini in hindi version is not so good. AAmir Khan acted well in the movie. But the movie is so boring."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Pratik112",
        "review_rating": "5",
        "review_title": "Just An Average Film That Is Worth Watching Once",
        "review_detailed_main": "One would normally accept an unusual movie from Aamir \"Mr Perfectionist\" Khan and what can be said except that this has a bit of everything \u0096 what's normal about that? Nothing. But the concept is good, even though it is a copy from another movie, from South India which was released in 2005.\n\nSanjay Singhania, a rich businessman suffers from temporary memory loss for fifteen minutes every now and then and is not able to remember anything about his past and therefore takes photographs by using Polaroid camera and makes notes on who he meets and what he has done. This due to an injury he has received in the past. The whole story, however, is unravelled by an investigative Police officer, who gets killed in accident.\n\nStarring Aamir Khan and introducing Asin, who is from South, the movie also stars Jiah Khan, Riyaz Khan and Mohit Ahlawat. The music score is given by A.R. Rehman The introduction of Asin from South India, can be considered a fresh as she is able to do justice to her role and with the exception of this and music by A.R. Rehman and one or two songs as well as cinematography, action sequences, nothing much can be said about this. I would certainly expected more from a film that has \"Mr Perfectionist\" but unfortunately it is not the case this time around and more so after watching him in \"Rang De Basanti,\" his directorial debut \"Tare Zameen Par\" and launching his nephew's career with \"Jaane Tu Yah Jaane Na.\"\n\nEven though this was a disappointment after all the hype that it has received due to the marketing technique to grab the attention, it is just an average movie and is worth watching once. But be aware as it does contain a lot of violence and may not be appropriate to view with children."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "abhijeet-kaushal",
        "review_rating": "1",
        "review_title": "worst movie of aamir khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mohan59",
        "review_rating": "5",
        "review_title": "Inconsistent pace meets splendid cinematography",
        "review_detailed_main": "This movie was pretty much hyped even before a scene was shot, I reckon. Partly because of the lead actor. But, I was intrigued at Aamir Khan's decision to star in a movie that is adapted from a Hollywood flick. I always had this impression that he did things in his own way and even though I had seen the Tamil version, which deserves a lot of credit in its own right, I didn't think that Aamir would be swayed to remake the film in Hindi.\n\nI watched this movie after more than a month had passed since its release. I won't try to compare with the Tamil or English versions, nor will I give a detailed review of the movie. I will only attempt to describe those points which I felt were good or bad in the movie.\n\nThe story is a no-brainer. There is a protagonist, an antagonist masquerading as a wolf-in-sheep's-clothing, 2 ladies (if you can consider Jiah Khan's character as a lady, I thought she resembled a doped-out \"escort\") and little else. The pace is erratic, quick in some parts and lethargic in others. The cinematography is simply fabulous and very clever, managing to capture Aamir Khan's character such that he appears larger-than-life, despite his smaller frame and bulky physique. I also felt a certain connection with the HQ of the business empire owned by the lead actor (located in ITPB, Bangalore): I worked there for about a year. The music is average, with only Kaise Mujhe and Guzarish impressing from the soundtrack and the background score passes muster.\n\nComing to performances, I found all the people on the good side pretty wooden. Yes, even Aamir Khan was, I felt, not that impressive. Either he tried too much to bring out the stark contrast between the love-struck business magnate and the vengeful assassin or this role is not up his alley. Despite being the focal point of the story, I thought Asin overacted in certain sequences, but, this being her Bollywood debut, I guess I shouldn't be so uncharitable. Jiah Khan neither looked like a student nor tried to act like one. The only sequence where she is aptly cast is in the song that appears in the college celebration, pouting lips and swaying hips with remarkable ease. The only impressive performer for me is Pradeep Rawat. He backs his menacing fangs with savage atrocity and should have been given more screen time than what he got. This movie deserves his name as the title, just for his terrific acting alone. Some people may not agree with me, but I felt he did a commendable job.\n\nConsidering all this, I would give this movie a rating of 5/10."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ssst419",
        "review_rating": "3",
        "review_title": "Wow/Yuk ! Depends......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "geentapangan",
        "review_rating": "1",
        "review_title": "memento",
        "review_detailed_main": "The idea is somewhat copied from memento. i like amir khan movies but somehow disappointed to see that they have the same plot as memento movie"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "nsahaya",
        "review_rating": "5",
        "review_title": "A B+ film from an A + actor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "Aj_Cheema",
        "review_rating": "4",
        "review_title": "This Movie Sucks!",
        "review_detailed_main": "Having seen Memento a while back, and liked it a lot, i was drawn into this movie because the \"buzz\" had it that Amir khan was releasing his latest 'project', and it was inspired by memento, and was going to be \"BIG\". I was rather enthused by the idea of a non-chronological, thought-provoking, and tight Hindi movie. Well, what to say? This movie was a complete fiasco! The action was over-the-top, Anterograde Amnesia was grossly misrepresented/depicted, the song and dance sequences were rather annoying, and the whole revenge plot was so overdone, that it was rather comical in a painful sort of way. The length was atrocious, the boy-girl thing was rather trite, and the numerous product placements, and attempts at humour, and social commentary were anachronistic and pathetic; thereby rendering this one of the worst movie-going experiences of my life. My problem is not with the 'unrealistic' elements, but with the hamming, the intransigently illogical plot, the hap-hazard and reprehensibly dumb way in which it was edited, and with the impunity with which this mess was promoted, lapped-up and hyped by the media, and was let loose upon the cine-goers without even the slightest of warnings, that they were going to get their minds f****d for the next THREE frigging HOURS! How do these people get away with insulting their audiences intelligence like this?"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "keshavashukla",
        "review_rating": "5",
        "review_title": "short term memory loss takes revenge",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "thmay-84650",
        "review_rating": "3",
        "review_title": "Worst Remake ever made",
        "review_detailed_main": "Better you go and watch Christopher Nolan's Memento. This movie is the third class remake of Memento."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ssvikas",
        "review_rating": "4",
        "review_title": "Southern Masala overdose with Bollywood Tadka!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "bharatmisr",
        "review_rating": "5",
        "review_title": "A complete mish-mash of plagiarism, action and romance",
        "review_detailed_main": "The highly anticipated, mega budget 'Ghajini', first of all, proves to be very surprising. No one might have ever seen Aamir in an image even near to which he is seen in this film. The 3 hour-plus movie is full of violent and senseless goon-bashing, which has a trademark south Indian look, apart from a couple of flashbacks, which narrate an exhaustingly long romantic tale. The plot is simple, and anyone expecting a twist would be utterly disappointed. Clearly inspired by Hollywood cult classic 'Memento', Ghajini fails to hit the bull's eye. It can neither attain a cult status, nor can it be remembered as a psychological thriller. Director A.R. Murugadoss seems to have taken the unique and innovative part of the plot from 'Memento', such as the concepts of short-term memory loss, Polaroid images, and tattoo printing, and adding the rather stale and tried and tested part, that is the romance angle, and the sheer violence. The movie uses the flashback form of telling its story, which I personally like very much. But even the flashbacks stretch on for too long, and become highly predictable and boring after a certain limit. Apart from this, the plot has major loopholes, which have been tried to cover up by swift camera movements, and a fast moving storyline. Songs have been badly placed, and don't lubricate the flow of the plot. Only Kaise Mujhe and Gujarish are songs worth listening. Others, sadly, fall short of songs of A.R Rehman's standard. Logical errors in the storyline is one thing which you must be accustomed to, if you are planning to watch this film. If you leave out that little snag, then you might even be able to enjoy the film. As for the acting department, Asin acts decently and gives a promising debut. She has a bright future, a far as her career in Bollywood is concerned. Aamir has his usual charm as the rich businessman Sanjay Singhania. But he disappoints in the later, transformed avatar, and acts as if he not only has short-term memory loss, but also paranoia and anger related mental problems. This I say because he has been shown shrieking with anger, and pain (or both!) without any evident reason, for about hundreds of times throughout the length of the film. Nevertheless, the way he has carved his body to perfection is appreciable. Aamir's fine cut body is one of the only plus points of the film. Maybe its not an error in Aamir's acting, but in the director's way of portraying his character on the screen. As for Jiah Khan, though she has a pivotal role in the plot, she is forgettable and fails to leave an impression on the audience's mind. All-in-all, watch 'Ghajini' if you have 3 hours nothing else to do, and if you prefer brainless fighting and south-Indian flicks. Its also recommended for die-hard fans of Aamir Khan."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "hsm2310",
        "review_rating": "5",
        "review_title": "Below Average",
        "review_detailed_main": "Not going to write much about this movie because there is not much to write about this over-hyped,highly flawed and dumb movie.For all those who call it a good entertaining movie, there are hundreds of better entertaining movies with lesser flaws. I had seen Memento three years back and I instantaneously fell in love with that movie.Since the concept of this movie was \"inspired\" from Memento, comparisons were bound to be made and I can safely conclude that Ghajini stands nowhere near Memento.In fact, was this movie a romantic flick with Amir and Asin I might have liked it.Their chemistry was one of the very few positives that I could find in Ghajini.Of course, Rahman was magical but you cant expect him to write the scenes too! I like Amir as an actor and have seen him perform much better.So even his acting could not lift my spirits.I would not want to see Mr. Perfectionist in a movie where you cant admire him because you cant stop laughing at the weaknesses of the movie.Asin did well in her first Hindi movie.And last but not the least Pradeep Rawat(Ghajini) who was known for his smaller roles till now could be the next popular lead villain in Bollywood.\n\nWatch it only if you don't want to be someone who missed a movie that grossed over 200 crores!!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "djmmithology",
        "review_rating": "2",
        "review_title": "How Memento got raped",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "ecyorl",
        "review_rating": "3",
        "review_title": "Unmemorable Memento",
        "review_detailed_main": "Aamir Khan is one of my favorite Indian stars and I usually love his movies. Not this one though! Three hours of my life I will never get back. The music is very good, the dancing is great, Aamir looks incredible and his acting is intense but those are pretty much the only positives I have for this movie. If you have seen the previews, you have seen the best of this film.It is a poor version of \"Memento\" with only the memory loss as a similarity. The movie begins as an drama and we, along with the beautiful medical student in the film, are curious about Sanjay and his story but abruptly, through the trite device of a journal, we are transported to a totally different movie: a goofy romantic comedy with an incredibly irritating leading lady, Asin, playing Kalpana. How did this woman win a award? Is there an award for \"Way Over the Top\"?) The movie goes back and forth between a very violent story and a romance between Sanjay a clueless ditz. In both the previews and the movie, we know that it is her death that Sanjay is out to avenge. When we finally find out the event that led the ditz to her death, it's so improbable, even within the framework of the film, that it's mind boggling. On the bright side, Kalpana was gone from the film...finally! I hope Aamir's next film will be better. It almost has to be."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "onacrashcourse",
        "review_rating": "1",
        "review_title": "Are you kidding me !!!!!!!!!!!!!",
        "review_detailed_main": "Can it get worse than this. Whatever happened to Aamir. First of all, i cannot understand how it became such a monstrous hit. Is the Indian audience so naive!!!! The storyline is pathetic. Wait !! there is no story. The acting, especially Asin's is just too over the top. Jiah Khan, well, she is a waste of time. And kudos to the director. How can he make such an insanely stupid film twice !!!!!!!! the only saving grace is Aamir but even he can't pull this one off.\n\nThats not all. The best part is that TOI gave this movie a 4 out of 5 rating. And i am pretty sure that this year it will sweep all the awards. If movies are judged only on the basis of their box office success, then what is the point of having the award functions. They don't award the best movies , they award the most successful movies(Kaho na pyar hai being another such case).\n\nThe reason I am worried about all this is becoz if actors like aamir start doing such movies and, worse still, if suc h movies start succeeding, this is the type of rubbish that will keep getting made becoz we know how Indian filmmakers like to be \"inspired\" by successful movies.\n\nAnyways, anyone who hasn't seen this please don't !!!!!!! Its probably the worst movie I have ever seen and only the second movie in which I actually fell asleep."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "zenode",
        "review_rating": "4",
        "review_title": "Forget Everything ! Remember Nothing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "mailsunny-1",
        "review_rating": "4",
        "review_title": "Worst Aamir movie ever",
        "review_detailed_main": "I am so disappointed by this movie. I was so enthusiastic to watch this movie but to my dismay it turned out to be a B grade Hindi Movie. I was surprised and am still not able to realize how Aamir could do such kind of a movie. He is known for his dynamism and his choice in doing films that reflect his intellect. Unfortunately it looked like another Sunny Deol Movie. If the movie has been inspired from the Hollywood movie Memento then I think Aamir and the Director of the movie have literally satirized the whole concept. Some scenes are really funny and fail to deliver the seriousness. There was no thrill and absolutely no suspense. Even the love story between Asin and Aamir felt incomplete and one sided. The movie was a disaster."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "cool-bhargava",
        "review_rating": "5",
        "review_title": "Memento inspired.....really?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "jeethjohnp",
        "review_rating": "5",
        "review_title": "A needless remake.",
        "review_detailed_main": "Ghajini... The remake of the tamil version which goes by the same name. The story: A guy out on a rampage to avenge his girlfriend's death. The twist: The guy suffers from short-term memory loss. The guy is enacted by Aamir Khan...but he didn't go for the perfection that most of the media bark about in this movie. Maybe he tried for perfection, but it was not right up there you know....you know what I am talking about...he doesn't come close to what Suriya did in the tamil version. All Aamir has done very well in this film is to show the charatcers angst to perfection. The female lead was donned by Asin in both the versions. Well, again .. I can't help comparing her two performances. Her enactment of a bubbly character was the best in the tamil version. Music...only a few songs were able to capture my attention..rest all passe...and some a rip-off( so typical of A R Rahman )...again the tamil version scores... All I have been talking abt the cons...now pros..... Jiah Khan....her character was very well etched by the director and the script-writer. The tamil version had Nayanthara. The action scenes were all very well done.... and lastly...the climax of the film fits the story like a blanket in this version....\n\nSo..in all the major departments..the tamil version scores. I hate this movie for just one reason...The love angle is the pillar of this movie..and the Hindi version completely ruined it...This movie looks like it was made to just make money... If quality was Murgadoss's agenda...he should have released a director's cut home video for the tamil version....\n\nAll said and done...I would still like to appreciate Murgadoss...for taking inspiration from \"memento\" and making a film that suited the Indian Audience......Thanks for that....\n\nAnd always watch a film in its original version to get its raw feel...."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "rchakarv",
        "review_rating": "3",
        "review_title": "Very disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "chilam_cigrat",
        "review_rating": "1",
        "review_title": "A complete Waste of time..",
        "review_detailed_main": "Well..i give this movie a 1/10..its not that i didn't watch it,i watched every single bit of it,and,i am so sorry to say that i was ashamed that it was an Aamir khan movie..i expected so much..and then this long runtime!awful..i knew right from the start that the bad guy is gonna die in the end,but i had to be tortured till 3 hours to see him die!and then all of a sudden,aamir's scar disappears in the end of the movie!!!Why did they give him the scar if they wanted to take it away?! this movie was being advertised as a great movie but alas,It simply wasn't upto the mark i like all the actors in this movie and i don't have a problem with anyone's acting,i am just disappointed as this awful display of screenplay,direction etc..This is a great idea(Well,copied anyway,from A classic movie Memento) Bottomline,awful,terrible and disappointing..didn't expect this kind of a boring movie from aamir..People reading these comments,please just think for a moment,i always watch movies to enjoy myself,not to get tortured and bored and be angry at the end of the movie!NOT RECOMMENDED!Watch Memento instead,Or watch ANY other movie but this!"
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "dblue-007",
        "review_rating": "1",
        "review_title": "been cheap, going cheaper, the cheapest!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "swhusain1985",
        "review_rating": "1",
        "review_title": "NUTSHELL REVIEW, might contains spoilers",
        "review_detailed_main": "First thing first, this is ma first review on any website. Another thing is that I am a huge Amir khan fan. But sadly after seeing this movie and listening to amir khan comment, he had lost respect. What these bunch of loosers had done.. they hijacked the main plot of Hollywood classical movie Memento and land them in their errorful script of movie. I mean to say how they can do this, they are making the people fool. OK i agree that a person who hadn't seen MEMENTO can appreciate Ghajini (Though i strongly think even though the movie is totally crap) but for the person who had got a beautiful experience of watching Memento can never recommend Ghajini. As for Memento, we are used to seeing scenes progressing one after the other and getting along with the story.But what if,someone plans to reveal scenes one before another and yet is not only able to maintain the coherence of the plot but also has been able to make it all the more gripping.That is exactly what hugely talented director Christopher Nolan(his other creations include the Dark Knight,Prestige and Batman begins and of whom it is said that he is totally incapable of making a bad movie) and his editors have managed to achieve in this movie.Hence I wasn't surprised at all when recently it was declared as the movie with the best climax ever. I hope that Mr. Nolan will never got an opportunity of seeing Ghajini coz as an Indian i don't want that he will laugh on Indian way of making movie. Look i just want to say that, the basic storyline of both the movies are same, in a very crude language we can say: Its a revenge drama in which heroine died and hero takes the revenge (Though Memento had got more to it).. What is new in it? In fact the main Hero of the movie is the disease that had engulfed our main protagonist.. and sadly Mr. Murugadoss( Director of Ghajini) cant explore that part of the movie.\n\nNow some people can argue that ITS WRONG TO COMPARE?? To them i want to say that then Why the hell Ghajini crew is shouting that they had created an original movie?? Polaroids camera, tattoos, short term memory loss.. what is all this?? To top it all Mr. Khan had said in an interview that his movie is an original one and he had seen Memento and HIS movie is a better one because he cant understand Memento?? Mr. Khan in my whole life as a student i cant understand Einsteins theory of relativity that means it is of no use???\n\nCome on Bollies come out of your shell... Try to make something of yourself, something original.. Playing safe will never take you to the top."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "kjjames81",
        "review_rating": "5",
        "review_title": "A nice revenge thriller.",
        "review_detailed_main": "After sitting down for 3 hours I now have to say what I thought of this film. Firstly the bad points, yes it has to be said, the singing, in a film like this seemed out of place, I know Bollywood films have them in. The unintentional humour in it, it seemed to take the tension away from the film, which I think spoilt the movie. Okay the fight scenes were a bit over the top but it didn't bother me. The good points, Aamir Khan was very good in the role of the hero. The story, okay not original, but done very well. All the other actors and actresses done really well in their roles. This wasn't my first taste of Bollywood films, I had previously watched One Man Army, and it's sequel. After watching this, I will be watching more Bollywood movies, of the are in this area of film. See this movie if you have the time. Very enjoyable."
    },
    {
        "movie_id": "tt1166100",
        "movie_name": "Ghajini",
        "movie_rating": "7.3",
        "review_username": "s-sunilpal123",
        "review_rating": "",
        "review_title": "Load of Old tosh!",
        "review_detailed_main": ""
    }
]