[
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "preppy-3",
        "review_rating": "9",
        "review_title": "Very grim and disturbing but you can't stop watching",
        "review_detailed_main": "Detective Lt. William Somerset (Morgan Freeman) is about to retire. He is teamed up with a young new detective David Mills (Brad Pitt). Together they try to find a serial killer who uses the seven deadly sins as his M.O. Meanwhile Mills' wife Tracy (Gwyneth Paltrow) fears for her husband's life and is very depressed.\n\nDark and depressing but just fascinating. Director David Fincher shots the entire film in dim light and shoves the victims mutilated bodies in our face. The grimness of the tone wears you down but that's appropriate considering the subject matter. No humor either. It all leads to a truly harrowing ending. There was supposed to be a happy ending but they (wisely) chose not to do it. Freeman and Pitt work very well together and both give excellent performances. I even thought Paltrow (who I hate) was good! Kevin Spacey is very good too in a small role.\n\nIf you have trouble with blood, gore and disturbing subject matter stay far away from this movie. But if you can handle that, watch this one. It's depressing and unpleasant but riveting."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "RedRoadster",
        "review_rating": "10",
        "review_title": "A dark and disturbing masterpiece.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Insipid_Shell",
        "review_rating": "10",
        "review_title": "\"Se7en is well crafted and ingeniously clever, making it one of the greatest films of the 90's\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tomgillespie2002",
        "review_rating": "10",
        "review_title": "Still manages to astound after 20 years of repeat viewings",
        "review_detailed_main": "After his calamitous experience working on his début film Alien 3 (1992), David Fincher took on a small genre picture that, little did he know, would revitalise his career and become one of the greatest films of the 1990's. Se7en appears to begin as your typical detective neo- noir, with the cynical veteran and the naive rookie taking on an elusive serial killer seemed hell-bent on turning the sin against the sinner. But, set in an unnamed and permanently drizzly American city, Se7en is a meditation on evil and a pessimist's depiction on the modern world, climaxing in one of the bravest and most memorable endings in Hollywood history.\n\nDetective Somerset (Morgan Freeman) is on the verge of retirement, where he plans to leave his inner-city life behind him after years of fighting on the side of good. His replacement is the brash Detective Mills (Brad Pitt), an optimistic young recruit eager to learn, who Somerset takes under his wing. Their first homicide investigation involves an obese man who has been fed at gunpoint to the point of causing his stomach to rupture. With Somerset ready to leave the force, Mills takes on his first solo case in the murder of a rich attorney, a man forced to cut a pound of flesh from his own body. The murder scene has the words 'greed' written in blood. Somerset eventually finds the word 'gluttony' etched in grease in the apartment of the first victim, and he becomes convinced the murders are connected, and that the killer is murdering under the guidance of the seven deadly sins.\n\nThe genius of Se7en is rooted in the way the movie keeps the audience as clueless as the detectives. Normally in genre pictures such as this, we either know who the killer is and eagerly wait for the investigators to put the pieces together, or we have a line-up of suspects and red herrings to decide from. Here, apart from brief glimpses during a thrilling chase scene, we are devoid of clues. The killer is always one step ahead of Somerset and Mills, alluding to the idea that the mysterious 'John Doe' is indeed having his work guided by a higher power. Of course, he is not, he is merely a man, but this helps gives Se7en dramatic weight, rather than it becoming a nihilistic exercise in cruelty.\n\nWhen, three-quarters of the movie in, the killer hands himself in, the movie becomes a masterclass in writing, slowly building into one of the greatest climaxes in film. Somerset, a decent man who has devoted his life to the side of good but has had the fight slowly drained out of him, meets his nemesis in John Doe (Kevin Spacey). But as they talk, Doe's reasoning becomes clear and, shockingly, almost sympathetic. \"Wanting people to listen, you can't just tap them on the shoulder anymore, you have to hit them with a sledgehammer,\" he says. It's about a world gone to s**t, a view shared by Mills' wife Tracy (Gwyneth Paltrow), who talks to Somerset in a diner about allowing a baby to be born into the world after discovering she is pregnant. Cerebral and Gothic, Se7en transcends the genre on so many levels thanks to some bleak yet stylish direction by Fincher, and it still manages to astound after almost 20 years of repeat viewings.\n\nwww.the-wrath-of-blog.blogspot.com"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "10",
        "review_title": "A brilliant postmodern film noir that is grim, intelligent and disturbing",
        "review_detailed_main": "From David Fincher, Se7en is a compelling and brilliant postmodern film noir. It is grim and disturbing but it is also very intelligent and daring. What I did love about Se7en especially is that it is incredibly stylish, beautiful dark cinematography and dazzling landscapes really do add to the atmosphere. Very little of the murders are shown but we are appalled and shocked by what we hear of them, the action is tense and the climax is shattering. There is also an intelligent screenplay, a clever plot telling of a vicious serial killer who murders his victims in a gruesome way to atone for the sins(gluttony, greed, sloth, lust, pride, envy and wrath)he deems them to have committed and excellent direction. The acting is also superb, Morgan Freeman gives another brilliant performance as the disillusioned detective and Brad Pitt is great as Mills in a more meatier role than he has ever done. Gwyneth Paltrow makes a small yet significant appearance as Mill's uneasy wife, while Kevin Spacey superbly delivers equally superb dialogue as John Doe despite the fact he isn't in the film much. Overall, a brilliant film, with adept performances, direction, style and ambition. 10/10 Bethany Cox"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "chvylvr80",
        "review_rating": "10",
        "review_title": "Probably the greatest murder story ever",
        "review_detailed_main": "Seven's quality puts it so far beyond most of the \"cops on trail of deranged killer\" genre that it comes out as a true jewel of cinema. Everything about seven is perfect. It is art captured on film. This movie is a bright spot for all of the stars who worked on it.\n\nBrad Pitt never gets the credit he deserves for his acting because he's a pretty boy and the press is a lot more interested about how he and Jennifer are doing. That's a shame because he is a talented actor that isn't afraid to take chances with both the roles that he picks and the characters that he plays. That is quite rare in the A-list world. Morgan Freeman is a great actor. You can always count on him to do what he does best which is play a wise veteran that has seen it all. Kevin Spacey is another great actor that has great range and really puts life and personality into his characters.\n\nThe real talent of this movie, excluding the actors that brought it to life, is the director David Fincher and the writer Andrew Kevin Walker. Fincher's talents for making a visually stunning film are now well known and he often brings a dark patina to his work. Andrew Kevin Walker must have some incredible demons living inside him. Either that or one hell of an imagination for bringing the intricate story of Seven and the plan of John Doe to life.\n\nJohn Doe's plan really is twisted and I won't be spoiling it here. Suffice to say I have never seen so evil and complicated a plan in a movie before or since. The cinematography of the film is dark but beautiful and throughout the film it is either night or raining or both except for two very brief moments. It is such an emotional movie that you can't keep from being caught up in what is happening. Do you understand and sympathize with what John Doe is doing or do you think him a mad killer that must be stopped.\n\nBottom Line: If you haven't had the opportunity to see Seven yet then you must at least rent it. It is so damn good that I know you will like it. The only reason you wouldn't is because you're just too damn fragile to take something this hardcore."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jpevoto",
        "review_rating": "",
        "review_title": "Somerset's World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Boba_Fett1138",
        "review_rating": "10",
        "review_title": "Dark and disturbing thriller that will stay with you for ever.",
        "review_detailed_main": "Rarely there has been a movie with such a good dark and chilling atmosphere. I even see this movie more as an horror movie than as a thriller because of that. \"Se7en\" is unique in many ways. The movies mood is already set right from the beginning on. The movie starts dark, intense, chilling and mysterious, a mood that is present throughout the entire movie. It's very depressing to watch and I mean that in a positive way of the meaning of the word. The mood is set by good camera work and lighting, or better said, the lack of it. The music from acclaimed composer Howard Shore also adds to the chilling atmosphere. Unlike many other movies from the same genre, the movie is slow paced and takes it time to develop the characters without falling into some obvious cliché's. The two main characters played by Morgan Freeman and Brad Pitt are presented as an unlikely police-couple that are different in many ways from each other but in a way that is also what makes them such a great couple. Brad Pitt for once has the opportunity to play more than just the pretty boy and he does it with success. Kevin Spacey truly plays a bone chilling character, almost just as legendary and chilling as Hannibal Lecter. I would very much like to see the two of them put in the same room, just to see who would make it out alive. Further more it was great to see R. Lee Emrey again as the police captain. The movie is filled with some truly gross, sickening and horrifying scene's, this seriously ain't no kids stuff! The movie has some of the most sickening murders I have ever seen featured in a movie. But it aren't just only the gross scene's that are good, there are also some scene's that are made with lot's of beauty and profession such as the library scene. Dark and chilling movie that you will never forget also thanks to the ending which I will not spoil for you. A real must see. 10/10"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tsatsas",
        "review_rating": "10",
        "review_title": "Modern Masterpiece!!",
        "review_detailed_main": "Gothic, shocking, suspenseful, disturbing and clever, `Seven' marked a new beginning for director David Fincher's career. This dark tale of murder and crime revolves around two detectives in present New York city played by two brilliant actors `Brad Pitt' and `Morgan Freeman' who are paired together to solve a puzzle of murder that is at the hands of a man who kills regarding to the seven deadly sins. Both actors displayed striking performances that are so sharp and realistic sometimes you have to remind yourself that's its all acting.\n\nDavid Fincher's masterpiece really gives us an opportunity of a lifetime, maybe it's one that we don't all wish to share, but by seeing this movie you will experience a glimpse of the horrors that this world is filled with, and a small piece of mind of a man who you only prey you never have to meet.\n\nBrad Pitt successfully proves to us that he's not just a pretty face on screen, and that he sinks into his character so well, that you can walk off after the film finishes classifying him as a pretty darn good actor.\n\nYou wouldn't expect anything else from Morgan Freeman because it's perfectly obvious that this guy was born to play the roles of the smart detective.\n\nDavid Fincher's timeless directing and memorable filming captures all the goods that this film has to offer and will undoubtedly leave you shocked and begging for more films like this. Seven is a step into the harsh realities of life, a realistic portrayal of two detectives investigation into the un-describable horrific world murder, and the darkest realms of the human soul.\n\nWe can only prey for more classic memorable work from Mr. Fincher and for those future directors who are intent on making a gothic, psychological thriller, make sure you sit down and watch Seven with a pen and paper ready to take notes."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Sleepin_Dragon",
        "review_rating": "10",
        "review_title": "An out and out classic.",
        "review_detailed_main": "A retiring Detective and a young rookie are hunting down a serial killer, a killer with a dark MO, murdering his victims using the seven deadly sins.\n\nAs I watch this, it's coming up to its thirtieth anniversary, and it's as fresh now as it was back in 1995, it's an intensely macabre take, crimes that are infinitely macabre and depraved, and intensely twisted.\n\nThe combination of Freeman and Pitt is incredible, they work immensely well together, we have the fresh zest of Mills, and the unshakable, but battle weary Somerset. Paltrow and Spacey are excellent in support.\n\nTwo hours flashed past, there is no lull, no moment to switch off and boil the kettle, the intensity is immediate, the pacing designed to keep you glued.\n\nI have always thought there is a shade of Alfred Hitchcock about this movie, such is the intelligence of the plot.\n\nVery good visuals, the macabre and gruesome bodies look shocking still, nothing is spared or hidden away.\n\n10/10."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "purebace",
        "review_rating": "10",
        "review_title": "Outstanding Performances / Great Storytelling",
        "review_detailed_main": "This movie is from start to finish a well produced and directed film. The performances in this movie are outstanding. Brad Pitt, once again, makes his role a stand-out performance by putting his versatile acting skills into his interpretation of Detective David Mills. Morgan Freeman is well-cast. His brooding acting style fits the character (Detective William Somerset) like a glove, and Gwyneth Paltrow gives her best performance EVER in the role of Brad Pitt's supportive wife/lover (Tracy Mills). And of course, Kevin Spacey who plays the diabolical yet misunderstood serial killer.\n\nThe movie is suspenseful and in parts very exciting. There is a \"Pseudo-Noir\" quality to this movie that really fits in well with the content of the film (Serial Killing). It has it's philosophical moments that anyone who thinks a lot about the state of the world today can appreciate. It makes subtle moral judgements without insulting any beliefs that the viewer may have and it also generates debate for any post-film coffee/drinks gathering.\n\nAndrew Kevin Walker (Screenplay) has taken the subject of the Seven Deadly Sins and he really puts a great new twist on these themes. As a writer, I really could appreciate the depth that he goes into with these ideas. The movie gives us just enough information to be entertained and informed yet not bombarded and made bored with too much philosophy. In this respect, the film doesn't \"preach\" any special meaning even though the film's moral statements are still maintained. This film can be enjoyed on so many levels and I really enjoyed the third act. One of the best pieces of storytelling and scriptwriting ever.\n\nOutstanding performances from everyone involved (And yes, of course, David Fincher does a wonderful job) Say no more. *****"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "hitchcockthelegend",
        "review_rating": "10",
        "review_title": "He's experienced about as much pain and suffering as anyone I've encountered, give or take, and he still has Hell to look forward to.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "epramatarov",
        "review_rating": "6",
        "review_title": "Good movie - not the greatest.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "prvteye-1",
        "review_rating": "5",
        "review_title": "Didn't live up to the hype",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "johnmbale",
        "review_rating": "10",
        "review_title": "Stand out Thriller thanks to Fine Cast.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "gjgillett",
        "review_rating": "",
        "review_title": "An uncompromising story, filthy, grainy visuals and terrific performances make Se7en a modern classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Twins65",
        "review_rating": "9",
        "review_title": "20+ years later, I watched it again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "mjw2305",
        "review_rating": "10",
        "review_title": "Top Serial Killer Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "winner55",
        "review_rating": "9",
        "review_title": "one of the best-made films of its era and genre",
        "review_detailed_main": "Despite clichés, and a very depressing finale, this is one of the best-made films of its era and genre.\n\nThe strengths of the film include an odd relationship between the two lead cops, who seem loosely based on the two lead cops of the \"Lethal Weapon\" series, but who (thankfully) never play for laughs, and never really become \"buddies\" - the young cop is too arrogant, and the older cop has too much experience, which the young cop refuses to acknowledge. The two characters are also brilliantly acted by Morgan Freeman and Brad Pitt (probably his best performance).\n\nThere's one odd flaw in the film - about half-way through, I found that I had learned to \"expect the unexpected\" from the film, which meant that the rest of the film was predictable in a bizarre way - simply decide where the expected move would be, and then expect the unexpected move instead. The most obvious instance of this is in the finale itself, which could be guessed at least 5 minutes ahead of time.\n\nNormally, this would be a formula for disaster - but fortunately, the high quality of the film-making twists the film into an edge-of-the-seat suspenseful waiting game as we watch with horror the one cop's encounter with the insanity of pure evil.\n\nI didn't want to admire this film (to be honest, I dislike Brad Pitt something fierce), but I'm afraid I must - very professionally made, it delivers its promised suspense all the way."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ShyRaptor",
        "review_rating": "10",
        "review_title": "One of the best films ever made",
        "review_detailed_main": "\"Se7en\" (1995) is a true masterpiece. I have seen this film like a thousand times and every time I watch it again it's as disturbing as the first time. It's always intriguing from start till finish. This is one of the best stories ever told on screen. 10/10 for this motion picture, it's a true art. A must watch."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "billreynolds",
        "review_rating": "10",
        "review_title": "The best thriller ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "dommercaldi",
        "review_rating": "9",
        "review_title": "David Fincher Strikes Again, With An Unwavering Thriller That Strikes Straight To The Heart",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "husks",
        "review_rating": "9",
        "review_title": "No one is without sin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "lathe-of-heaven",
        "review_rating": "6",
        "review_title": "With over 900 reviews, mine is hardly necessary : ) Blu-ray: Excellent A:10 V:10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "blueangel-76133",
        "review_rating": "5",
        "review_title": "See David Fincher's later work to enjoy better films",
        "review_detailed_main": "Despite the presence of the surely very talented Freeman and Pitt, this early David Fincher film is, like his other early films such as Alien 3, marred by his strange artistic obsession with grime and filth (every location and even the look of the film is dirty, scummy and excessively grimy for no realistic reason). Having said this, in his more recent films, such as The Game (Sean Penn and Michael Douglas), Fincher has grown out of this style and made some excellent movies."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "pooch-8",
        "review_rating": "",
        "review_title": "Superbly crafted drama delves into darkest corners of the psyche",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "sandnair87",
        "review_rating": "10",
        "review_title": "Se7en is a Sinfully Enthralling Thriller!",
        "review_detailed_main": "Se7en is a nerve-jangling thriller, hauntingly shot by visionary director David Fincher, who crafts one of the most iconic films of all time.\n\nSe7en tells the tale of a grisly serial killer who is twisted on delivering a sermon against modern depravity. He murders his victims to atone for the sins he deems them to have committed; his crimes echo the seven deadly sins namely gluttony, greed, sloth, envy, pride, wrath and lust. Tracking this gruesome killer (played with a quiet insanity that makes your flesh crawl, by an actor par excellence – no spoilers here!) is a cliché pair of cops. There's the jaded veteran Detective Lieutenant Somerset (Morgan Freeman who brings great depth and dignity to the part) who is in the last week of his employ with the police department. Partnering him is a young, eager-to-kick-some-evil-butt cop Detective Mills (Brad Pitt whose callowness works perfectly for his character). After killing an overweight man by force-feeding him to death in the name of gluttony and bleeding to death a lawyer for greed, the anonymous killer is now turning his attention to the five remaining deadly sins. As the two men investigate, the gulf between their respective world-views begins to inform everything about how they respond to the savagery of these crimes.\n\nIt is impossible to deny the potency and artistry with which Fincher executes the material. Although very little of each murder is shown, the director expertly allows suggestion to lead the appalled viewer towards the truly cataclysmic climax. Fincher's sepia-toned gloom successfully lends the film the knock-out punch it intends to. Purposely draining his landscapes of color, and setting all the tense action against rain-washed streets and under-lit interiors, Fincher evokes an atmosphere of nightmarish proportions as he unfolds a gripping tale of urban horror.\n\nSe7en is riveting in a gut-twisting way. It plays out at an engaging pace destined to entrance you with its abject horror. The film is as dark and brutal as a film can be, without showing much actual violence. Most of the stuff in the film is implied, but it's so damn disturbing that you feel like you actually saw it. And that is the beauty of Se7en!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "namashi_1",
        "review_rating": "10",
        "review_title": "Fincher At His Finest!",
        "review_detailed_main": "David Fincher has made remarkable films throughout his career, but 'Se7en' finds him at his FINEST! This neo-noir psychological-thriller, is an astonishing piece of Cinema. I was mesmerized.\n\n'Se7en' Synopsis: Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.\n\n'Se7en' is a Masterstroke from start to end. A dark, moody, violent & utterly gripping story, that keeps you at the edge-of-your-seat. There isn't a single dull moment in this blockbuster, in fact, the tale gets more & more intriguing as it progresses.\n\nAndrew Kevin Walker's Screenplay is Ace. It's a spine-chilling tale about two heroes out to get a psychotic killer. The Writing grips you from the moment it begins & refuses to let you go. Fincher's Direction is incredible. The way he has handled this twisted story, deserves an ovation. Darius Khondji's Cinematography is flawlessly done. Richard Francis-Bruce's Editing is tight. Action-Sequences are mind-blowing. Howard Shore's Score is perfect.\n\nPerformance-Wise: Morgan Freeman is at his understated best. The Oscar-Winning Legend delivers a master-class act here, that ranks amongst his finest to date. Brad Pitt is in terrific form, adding depth & anger to his part. Kevin Spacey is loathsome to the core in his creepy portrayal of the wicked villain. Gwyneth Paltrow is wonderful in a brief, yet important role.\n\nOn the whole, 'Se7en' is a film to die for. Two Big Thumbs Up!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "illbebackreviews",
        "review_rating": "10",
        "review_title": "Fincher's Se7en is a classic crime story which can rival the likes of Silence of the Lambs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "supah79",
        "review_rating": "9",
        "review_title": "The best Hollywood has produced for a long time",
        "review_detailed_main": "After the Alien-debacle Fincher proved all the critics wrong. This film is one of the best in a genre that hasn't been very innovative for a long time.\n\nEveryone know's the story by now, so I won't waste time telling it. This film was trend setting with it's dark, gritty look and opening sequence. We still see it copied in movies and TV-series today. Everything is great about this film. I guess if anything, the weakest link in the film is Pitt, who is grossly overshadowed by Freeman. But let's not look for flaws when there really aren't any. The script is intelligent and uncompromising. The direction is innovative en daring. The production-design and cinematography are top-notch.\n\nFincher is one of the big boys in Tinseltown these days. Seven is the reason why."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Sergeant_Tibbs",
        "review_rating": "10",
        "review_title": "One Of The Greatest Thrillers Of All-Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ackstasis",
        "review_rating": "9",
        "review_title": "\"This isn't going to have a happy ending.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Fluke_Skywalker",
        "review_rating": "9",
        "review_title": "So good it's a sin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "manoj-aryan",
        "review_rating": "8",
        "review_title": "Se7en",
        "review_detailed_main": "'He is preaching\u0085.punishing'.\n\nSerial killing with clues from killer is not a new thing to Hollywood but David Fincher's Se7en exceptional. Its evil genius. Se7en opens with a homicide where a fatso is killed in a very strange manner. We meet Detective Somerset(Freeman) who is about to take off and detective David Mills(Pitt) has just fought to get assigned there. Somerset is calm, mature and has achieved mastery over his job. He probably seen so much that now he badly wants to go far away from this bloodshed. David appears cocky first but turns out amiable character of the film. Tracey(Palthow) is David's wife who hasn't got used to with guns even after so many years of their marriage.\n\nIt begins. Each killing is shockingly repellent. Like an artist's signature every victim holds a note, a sin highlighted with lines from Dante Alighieri' s 'Divine Comedy', Shakespeare's 'Merchant of Venice'. And his name is John Doe(Kevin Spacey). Those lines are screaming that this not just some insanity. He wants to make a point.\n\nEach murder is done by reaching horrific extremes of those deadly sins. A fat man is fed until he burst. Then there is an infamous lawyer got gun stuck on his head, handed a knife -a weighing scale is in front of him and he has to cut 1 pound of flesh from his body by himself. A druggist tied to bed for a whole year!! A famous model, her nose is cut and bandaged again and gave a choice- phone in one hand to call help n sleeping pills in other one to die rather than live deformed. A whore is punished ruthlessly that you should see on screen only. John says, \"The world is so shitty\u0085and we get used to them\".\n\nThis Script is sumptuous. It mirrors today's society skillfully and boldly. Nothing is hidden by the camera. All we watch is naked truth that we hate to admit and most of the time that we hardly care. The spirituality woven in has its impact all over. Most of all ending is a blow. It is stunning.\n\nThere are number of memorable sequences in Seven. One especially is breath-taking when Somerset and Mills reaches John doe's apartment and Doe directly starts shooting at them and chase sequence followed is absolute fabulous. On other hand dinner party at Mills house we feel wine mixed in the air. Tracey and Somerset's meeting at coffee shop is the finest ones I ever seen. The intensity of that conversation can't be described.\n\nThis is a very dark film. It is all time raining. All environment surrounding Se7en is so grim and ghastly it clouds viewers with the same. Music refuse to leave us even when it is over. I must mention titles and credits rolled, one of the best I ever seen.\n\nSe7en comes out with strong performances. Morgan Freeman is truly outstanding. Brad Pitt made me his fan from this movie. The way he says \"Ladies and Gentleman we have a homicide here\" and same David when taunted by Somerset \"You are saying you care for these people?\" says with assuring impulse \"Sure I do\u0085.!!!\". Gwyneth Paltrow 's Tracey doesn't have much screen presence but when she is there, we just can not stop love her character. In final half an hour we are introduced to Kevin Spacey's John Doe. The preacher. What can I say about this chilling work? Spacey gave such a performance that stings. We hate to admit with this man but somewhere we know he is right. Somerset asks him, \"So you are saying some higher power tell you to do this?\" Just watch John Doe reply \"Lord works in mysterious ways..\". Interesting thing pointed out by one of the fan is Somerset and John Doe both observed the same facts about today's society but responds in different ways, Somerset want to run away and Doe takes action.\n\nNo matter how many thrillers I shall see but this will always one of my favorites. It affects deeply. That's the power of Se7en. Se7en is a terrific thriller and a modern classic."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "eclee-59960",
        "review_rating": "7",
        "review_title": "Se7en gets a seven",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "werplant",
        "review_rating": "5",
        "review_title": "Cheesy as your mom's spaghetti",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Simply one of the darkest and best thrillers of the 1990's \u0096 but don't let anyone spoil it for you.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Screen_Blitz",
        "review_rating": "10",
        "review_title": "Dark, grisly, and highly intelligent edge-of-your-seat thriller",
        "review_detailed_main": "David Fincher has been one of most thoughtful directors in Hollywood for many years, and his ingenious filmmaking all started in the mid- 1990s with this grim, but intelligently crafted psychological thriller. This film follows David Mills (played by Brad Pitt), a newly transferred police detective in an unnamed crime-ridden metropolitan city, who is partner with an old veteran detective William Somerset (played by Morgan Freeman) who is on the verge of retirement, to investigate a string of gruesome murders all around the city. These murders happen to correlate with the seven deadly sins which include: gluttony, greed, sloth, lust, pride, envy, and wrath. Mills and Somerset take in matters in their own hands to hunt down the sadistic serial killer (played by an actor who I'm gonna keep a secret) responsible for the grisly murders, only to be faced with a scarring truth about his intentions.\n\nThis David Fincher masterpiece is not a horror film, but it certainly sits directly at the borderline of one. Complete with eerie visuals and near non-stop suspense from start to finish, this film pulls audience into an unflinchingly grim atmosphere that leaves shivers down their spine and rarely lightens up. To add more to the dark tone, it rain in nearly every scene taking place outside to give them a more somber look. As the plot progresses, the audience are treated with nauseating afterviews of the serial killer's murder. But instead of having the camera linger over the gory details of the victims, we are giving heavy implications of how they particularly occurred. These scenes do just enough without the suspenseful music score to leave viewers at the edge of their seats. Then there is the serial killer himself who is portrayed as very sadistic, almost Lecter Hannibul-like, and creepy in appearance. His way of outwitting the main characters are quite shocking. The actor who plays him does an incredible job on his portrayal. As the story continues on, it builds up to one of the most haunting conclusions ever put to film, an ending that really pushes the boundaries. Ultimately, it works pretty well.\n\nSe7en is one of the well-crafted and twisted thrillers I've ever seen and one of the spine-chilling films Hollywood has to offer, thanks to the incredible camera-work, brilliant direction by David Fincher and fantastic script by Andrew Kevin Walker. Brad Pitt and Morgan Freeman who play the main characters show amazing chemistry on screen together and their performances work pretty well. While the film is really great, it is definitely not recommended for the faint of heart."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Howlin Wolf",
        "review_rating": "10",
        "review_title": "Se7en gruesome chapters of a killer's manifesto...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Mosquito_Maps",
        "review_rating": "10",
        "review_title": "The Greatest Crime Thriller Ever Told....With The Greatest Villain Of All Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "SnoopyStyle",
        "review_rating": "9",
        "review_title": "beautiful darkness",
        "review_detailed_main": "Somerset (Morgan Freeman) is a wearied homicide detective. Mills (Brad Pitt) worked hard to transfer to the troubled precinct. He's married to Tracy (Gwyneth Paltrow). There is a serial killer on the loose delivering his sermon on the Seven Deadly Sins. Somerset is tired of the city. Mills is eager to investigate.\n\nDirector David Fincher has filled with beautiful darkness. It's more than just the gruesome murders. It's the rain, the music score and the grungy setting. Fincher has weaved together an artistic masterpiece. Freeman is the perfect grizzled veteran. Brad Pitt is a terrific eager newcomer. There are surprising comedy sprinkled in. The final twist is simply cinematic history. The big line is awesome. Pitt delivers it perfectly with so much heart aching pleading. Some do deride its grotesque gloom but that's like complaining about a movie being too funny or too exciting. This is suppose to be dark and it achieves it."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "gardenwriter",
        "review_rating": "10",
        "review_title": "Superbly done",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "auuwws",
        "review_rating": "9",
        "review_title": "Se7en",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "deleyshaun",
        "review_rating": "9",
        "review_title": "Perhaps the greatest ending in movie history.",
        "review_detailed_main": "Se7en - for the most part is a procedural thriller/ mystery featuring detectives young idealist ( Pitt) and cynical and experienced (Freeman) together. They are chasing the clues of a serial killer who uses the seven deadly sins as the denominator of his kills. You don't actually see the murders- only the aftermath. Throughout - the movie delves into themes such as banality of life, evil and humanity intelligently. And at the same time doesn't deviate from the story moving along. There is a lot of dread throughout which is fitting. What elevates this film to \"greatness\" is the final 35 minutes- featuring discussions between the villain ( Spacey) and the detectives after his voluntary surrender- and then the final denouement which will test the viewers faith in this world we live in. It is extremely rare that a film builds you up to expecting a great conclusion - but then actually delivers on this promise. The acting is first rate by all and is masterfully directed by Fincher with great score throughout- especially the last scenes. A truly life changing experience. An absolute must watch."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "heatsilver",
        "review_rating": "10",
        "review_title": "Man vs. Society",
        "review_detailed_main": "Rarely does a thriller murder film draw in the audience from start to end without presenting predictable foreshadowing. From the opening credits leaving out Kevin Spacey's name to the consistent \"one step behind the killer\" storyline, Se7en accomplishes a dramatic theme of leaving the audience in a dynamic naïve state through the eyes of Mills and Somerset. Although the acting was emotionally and physically precise, it was the cinematography and lighting that generated the dreary setting and interactions throughout the film, often evoking the appropriately timed tension and emotion. Presented beyond the surface, however, Se7en calls upon a society accusation through the thread of Dante's \"Seven Deadly Sins.\" Se7en indirectly advocates that society, as a whole, is migrating towards an inevitable abyss filled with specialization in many of these deadly sins. Even though humans may be ignorant to this path, it continues to occur all around us until we become dragged into it, just like Mills in the ending. The only individual within Se7en that posed a dichotomous relation was Somerset; as he continued to logically view the world in awe of the irrevocability. Somerset and Doe both saw the world in this 3rd person perspective, but their actions represented their individual commitment to the change of society. Doe was willing to take action in an upsetting demonstration, but Somerset continually wanted to escape the world in a hopeless fashion. Therefore, Se7en displays multiple protagonists and antagonists throughout the movie. On the surface, Mills and Somerset are the protagonists trying to stop the killer, John Doe, who is the antagonist. Indirectly being argued, however, is that Doe and Somerset are the protagonists with opposing plans towards the change in societal nature (being represented as the antagonist through the seven deadly sins characters including Mills). That is why I give Se7en a 10/10 for its ability to draw in the audience through cinematography, lighting, plot, and controversial character dynamic throughout the entire film."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "gastgast",
        "review_rating": "7",
        "review_title": "Nice Movie",
        "review_detailed_main": "Good Movie and entertaining plot twist. But nothing special."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "adamkasher",
        "review_rating": "5",
        "review_title": "What people find so special about this film?",
        "review_detailed_main": "It really brings nothing new, it's basically a long CSI episode with no edge to it what so ever. It all was very predictable, and in the end of the day there wasn't a single scene in the movie made me go 'WOW'. It just that nothing felt new, in contrast to what films of that supposed caliber should do. I think most of the love to it is deriving from people tendency to get excited from the two main actors, especially freeman for some unclear reason.\n\nAll in all it is a pretty standard movie, that's the problem with it and unfortunately also the only source of it's positives.\n\nI'm not usually reviewing movies, but this one felt so blatantly overrated to me that I felt like I have to."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "harveybdickens",
        "review_rating": "8",
        "review_title": "Bleak, suspenseful, yet intriguing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "peisherman42",
        "review_rating": "8",
        "review_title": "the universe in which the movie takes place is more interesting than the plot itself",
        "review_detailed_main": "The filter, the rain and the depressing elements from the city in general set the dark, mysterious vibe of the movie, grabbing your attention from the start.\n\nThe actors are, as expect, amazing are delivering their lines and had a lot of chemistry with each other. The dinner scene was especially super natural and spontaneous.\n\nI also really enjoyed how the film isn't scared to show heavy gore in the victim's scenes.\n\nBut, to be honest, the plot was not as intriguing as I was hoping for. Sometimes, the investigation seemed kinda forced, like they were really lucky to find answers. Maybe my expectations were way too high. Still one of the coolest thrillers I have ever seen tho."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ElMaruecan82",
        "review_rating": "10",
        "review_title": "Atypical ... Disturbing ... Haunting ...",
        "review_detailed_main": "\"Se7en\" is one of these cinematic rarities that elevate themselves to unsuspected levels of depth after each viewing, in the greatest tradition of film noir and detective mysteries. Like \"Chinatown\", it reinvented the noir genre with its own particular atmosphere, both were and are still atypical for their time, and both end with a case solved, yet a puzzling conclusion.\n\n\"Se7en\" is less about the series of crimes committed than the two men who lead the investigation, and the way their relationship evolves and highlights their respective approach to life, to death, to the world they live in, with an implicitness that respects our intelligence enough so we can respect the film in return. This intelligence (or subtlety) is not immediately palpable, and the opening scene can mislead some viewers by falsely establishing the sort of odd couple we'd expect in a cop team: the wise veteran and the hot-headed youngster. Of course, you can trust David Fincher's directing and the cleverness of the script because there's much more to say about Morgan Freeman and Brad Pitt in these two roles, among the best of their careers.\n\nMorgan Freeman is Sommerset, a cop in his last week before retirement but not THE typical cop about to retire, (as a matter of fact, nothing is typical in \"Se7en\"), he's a law enforcer who never fired in 34 years of service and never got shot either, quite an achievement for someone who doesn't work in the most secure neighborhood. Sommerset incarnates the typical noir protagonist, whose optimism was eroded by years and years of facing and fighting the most sordid crimes. Although he's not the most likely to have faith in humanity, he's not cynical because he still respects his job. However, he's lucid about one thing, as long as there will be men, there will be rapists, killers, and criminals of the worst species. Sommerset is lucid and competent, he's like a spotlight of hope in a gloomy darkness, and that's enough to gain our respect, he's calm even when facing the most horrific and gruesome crimes, like the poor obese man forced to eat to death.\n\nThis opening crime is spectacular and graphic, but Fincher restrains himself because the horror is sometimes more efficient when it's suggested. The horrific aspect of the first crime is also distracted by the first interactions with Mills, Brad Pitt, as the replacing Detective. Mills is not a rookie, he's got his share of thrills and he knows his business. The problem is his temper: too cocky, too hot-headed, too sure of himself, he can't stand Sommerset's patronizing attitude. The progress of the investigation depends on the partnership between Mills and Sommerset, so they do their best to accommodate each other but it's only when Sommerset is invited to dinner by Mills' wife Tracy, that the ice is broken. Tracy here is essential, and not just as a simple plot device, she's a sweet and caring housewife, beautifully played by Gwyneth Paltrow. Tracy loves her husband and provides the extra level of depth needed to appreciate Mills' character who's more one-dimensional in contrast with Sommerset.\n\nTracy is the emotional connection between the viewers and Mills, and consequently between Mills and Sommerset, she's the heart of the film, and plays like an efficient counterpart to the gloomy atmosphere we're plunged in since the very start, it's no wonder that she 'hates the place', she embodies hope, family, marriage, loyalty, the best in humanity. And that's the most brilliant aspect of \"Se7en\", especially from a 29-year old director: David Fincher, with a remarkable craftsmanship, establishes all the elements of the puzzle in the first half-hour, setting the atmosphere: a rainy, dark and totally unappealing little town. It's a hellish, nightmarish world where we're plunged, where only feeble spotlights can penetrate a nightmarish darkness, it's one of these places, you're afraid to walk like in a dark room where you can accidentally put your foot on a sleeping cockroach. Talk about a hostile atmosphere.\n\nBut this atmosphere is perfect because it fits the nature of the crimes committed, and creates the disturbing urge to establish a peaceful relationship between Mills and Sommerset, which coincides with the discovery of the first two murder's links: a fat man is killed by eating, a successful lawyer forced to trade parts of his body to (temporarily) spare his live, two words written in various parts: Gluttony, Greed \u0085 an obvious 'to be continued' message to the cops. So, everything leads to the conclusion that the crimes are related to the seven deadly sins, and this time, it's not a killer who kills, but, as states Sommerset: a killer who preaches. But Mills calls a spade a spade, and by labeling the unknown man as 'demented' and 'crazy', he lamentably clouds his judgment while Sommerset is more rational and tries to think like the killer. Mills is all about emotional reactions, Sommerset thinks before he acts, impulses and reason, interestingly, it's the former who believes in love and family, as if 'passion' could work like a double-edged sword.\n\nThe atypical nature of the crimes and their author elevate the film, Sommerset goes to library to try to find out hints in Saint-Augustin's books, Dante's Inferno and other medieval and metaphysical classics. Though \"Se7en\" doesn't necessarily go deeper in the subject but it touched them enough to carry a sort of pedagogical value. We might not read all these books after, but I'm sure many of us, would question their approach to some crucial religious notions like faith, forgiveness, innocence and passion. On that level, the film is not just a cat-and-mouse thriller; it's also a descent into the most hellish aspects of humanity, incarnated by the villain's face, what's more with a perfect conclusion, leaving us with a truly awkward and uncomfortable sensation, free enough to see the half-full or half-empty glass.\n\nAgain, \"Se7en\" is a film that respects the viewer's intelligence."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Degree7",
        "review_rating": "8",
        "review_title": "Urban decay has never been so slickly photographed.",
        "review_detailed_main": "Se7en is one of those films you watch in between long intervals. For me, this was my third rewatch and my last. I don't think I have the stomach for another.\n\nIt is essentially a buddy cop flick, but the script touches on deeper issues of the future of human society, sin, apathy, and predestination. The Noir trappings are beautiful to behold, the constant rain, squalor, grimy city that feels like every dystopian metropolis combined into one. But it occasionally veers into fantasy with a plot that relies on a few too many gimmicks to make it flawless. The villain is simply an omnipotent being at times with almost magic powers.\n\nThere are moments of genuine humanity that doesn't make it completely hopeless, but the atmosphere is filled with so much despair and nihilism that the grunge attitude of it does begin to wear as the clock ticks by. And by the time the villain of the piece makes his grand entry, I kept expecting him to appear with a leather mask on his face and gloating evilly about eating a census taker's liver with fava beans and a nice Chianti.\n\nStill, the dynamic between Freeman and Pitt is still enticing to watch, and the story works as a parable or even sadistic fable at a rudimentary level. But sometimes I wish the story hadn't been so manipulative and fixed just so that it could punish these characters and push them to insane lengths. I felt like character motivations and development were being engaged at the behest of the plot progression, so certain events begin to seem contrived just so it can reach the shocking conclusion. I assume the writer was trying to teach a lesson, albeit in a clumsy fashion.\n\nI would call it a minor 90s classic, and the dreamlike, twilight zone-esque environment adds a nice surreal atmosphere. For those willing to ignore plot conveniences and the dingy weather, this film will take you along for a horrific trip into the darkest recesses of what men are capable of."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "MissCzarChasm",
        "review_rating": "9",
        "review_title": "The Best of its Kind",
        "review_detailed_main": "Seven is by far one of the best serial killer movies ever made. This movie has a great premise, fantastic actors, great direction by David Fincher, and a fantastic gritty atmosphere.\n\nThe story centers around 2 dectectives, both going down seperate paths. Det.omerset(Morgan Freeman) is heading toward retairment while Detective Mills(Brad Pitt)is just starting out his career. He's full of energy and opinions. Soon the both are on the msot disturbing case they have ever come across. A serial killer is killing his victims based on the seven deadly sins(Gluttony, Sloth, Wrath, Lust, Greed, Envy. The killer is very smart and the two detectives soon realize that he is using them as a pawn to complete his masterpiece.\n\nThe acting in this film is amazing. Morgan Freeman turns in a great performance. very subtle, yet commanding. He's like a wise-man spreading his knowledge to others. Brad Pitt is also very good in a more energetic performance. His character is pretty unlikable but he does have a certain charm. Gwyneth Paltrow is a bit underused but she is still very good. She's one of the only bright spots in this othe wise dark film. The killer, who's identity i won't give away here is avery effective in his small amount of screen time. He gives a very creepy performance that will leave a lasting impression.\n\nAnother thing this film has going for it is style. David Fincher has put together a film with a fascinating atmosphere. It's very dark and it sets th tone for the film.\n\nI suggest you go out and rent this film if you haven't seen it. Also for fans of the film the 2 disc dvd is a must have."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Leofwine_draca",
        "review_rating": "8",
        "review_title": "It doesn't get much more influential than this...",
        "review_detailed_main": "Two very different films about serial killers ruled Hollywood in the 1990s: 1991's SILENCE OF THE LAMBS, featuring Anthony Hopkins as the infamous Hannibal 'the Cannibal' Lecter, and this, David Fincher's masterpiece about a pair of New York cops tackling a perverted killer inspired by the seven deadly sins. SE7EN is an extremely stylish film that ended up inspiring dozens of copycats like RESURRECTION and THE BONE COLLECTOR: all of the films share a gritty-grimy style with depictions of unflinching violence, seedy backdrops and sleazy characters.\n\nWhichever way you look at it, SE7EN is a great movie. It has a pair of sterling performances from relative newcomers Brad Pitt and Morgan Freeman, playing stock clichéd characters: the young rookie and the older, wiser cop on the verge of retirement. Both Pitt and Freeman overcome their characters' conventions to make them believable people. Their quarry is Kevin Spacey, giving one of his traditionally disturbed portrayals as a sociopath with no inklings of good or evil. Much of the film is made up of police procedural elements, with the investigation of crime scenes, the following of leads and at least one fantastic chase sequence halfway through in which Fincher's direction is top notch. It's also blessed with a gruesomely dark twist ending which stays in your head forever afterwards.\n\nFor what it's worth, I'd pick SE7EN over SILENCE every time."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "GirishGowda",
        "review_rating": "10",
        "review_title": "Se7en is a dark, depressing, powerful and a clever movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "MadReviewer",
        "review_rating": "9",
        "review_title": "Modern Horror At Its Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jcarlos-96740",
        "review_rating": "6",
        "review_title": "Extremely overrated",
        "review_detailed_main": "I don't really understand the hype over this movie, it has a good cast and it is a good movie but it's different to be good and to be one of the greatest and this movie has nothing that makes it one of the greatest. The only interesting thing here is that the killer uses the seven deadly sins but even this premise could've been better used, the plot twist is kinda shocking but isn't one of the best ones, ain't one of those jaw dropping ones, at least not for me. The actors did normal nothing especial here too. I love movies of this kind but I got bored watching this and is really nothing special about it, just a massive disappointment"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "area01",
        "review_rating": "",
        "review_title": "John Doe - Right or Wrong?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "aurora-41206",
        "review_rating": "5",
        "review_title": "Interesting imagery, but a bit pretentious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "elshikh4",
        "review_rating": "8",
        "review_title": "Love and Fear.. Who Killed Whom ?!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ChristopherVaughan94",
        "review_rating": "10",
        "review_title": "Excellent Movie, Superb Storytelling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "richardtownsley-19550",
        "review_rating": "10",
        "review_title": "\"What's in the box?\"",
        "review_detailed_main": "Se7en remains one of the most disturbing movies I have ever watched. Unlike many other movies made during and since its release, Se7en refrains from gore and somehow becomes even more appalling because of it. Over time, general audiences have been desensitized to violence and gore. What may have been considered absolutely horrifying back in the 50s is nothing nowadays. So instead of showing the results of the crime, director David Fincher uses a somewhat Hitchcockian technique; by refraining to show the results of the horrible acts committed, and instead of revealing it through dialogue and acting, notably in the 'LUST' scene and 'SLOTH' scene, Fincher lets our brain do the heavy lifting and figure out what happened, and what it must have felt like. Fincher also goes out of his way to come up with the most disgusting ways a person can die, although some are admittedly tame. ('PRIDE' had it easy) The acting is incredible, featuring one of Morgan Freeman's best performances as an old, broken-down police detective, and Brad Pitt in one of his finest roles, and his acting skills are on display in his explosive acting during the finale. However, the best actor in this movie is the actor who plays John Doe. Observe his acting. Smug, self-satisfied, intelligent, analytical. His composure and fearlessness. The movie rests on this one actor to say every line perfectly. He does. His performance is just as affecting as Anthony Hopkin's in Silence of the Lambs. But the most impressive feat of all, David Fincher does something impossible: he makes the villain seem like a hero. It is hard to explain, but there are some villains that give us a glimpse into our deepest, subconscious desires. And that's terrifying. We all have parts of ourselves that we try to hide and pretend don't exist. These types of villains hold up a mirror and say, look. This is you. It's like watching a perverted car wreck that you can't look away from that hits you somewhere deep and hidden."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Theo Robertson",
        "review_rating": "8",
        "review_title": "Less Proves More",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "OriginalMovieBuff21",
        "review_rating": "10",
        "review_title": "A must see!!!",
        "review_detailed_main": "I went to a friends house last night and rented movies. I picked Se7en to rent because I've always wanted to see it since I saw David Fincher's masterpiece, Fight Club and his well made thriller, Panic Room. People have always said this movie was good so I wanted to see it if they were right and they were sure right. Seven is an insanely brilliant film from start to finish. The performances by Morgan Freeman, Kevin Spacey, and especially Brad Pitt are all phenomenal in this chiller. The movie was just plain out suspenseful and left my heart beating fast til the movie was done. The twist at the end was very intense and you never knew it was coming. Totally unpredictable. Overall, a fantastic film and David Fincher is a pure genius when it comes to smart films and Se7en deserves to be one of the greatest thrillers that has ever been made. I highly recommend it.\n\nHedeen's Outlook: 9.5/10 **** A"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "rat_salad",
        "review_rating": "9",
        "review_title": "Methodical, Calculated, Brilliant",
        "review_detailed_main": "This story takes you where it wants you to go.\n\nThe proof is that while there are some gruesome acts in this movie (you only see the aftermath, no action), the most disturbing crime in the movie is the least gruesome.\n\nThere are very few movies that pull-off a mix of repulsive crime and psychological involvement as well as this one.\n\nThe character development was done very well with while not distracting you by burying you in the personal life of each character\n\nInitially, I felt the main detective character was a little unbelievable a bit too methodical. As the character developed though, you start to see that as a part of his personality, the element that levels the playing field between him and the criminal. In the end, I found him to be as diabolically analytical as the criminal.\n\nThe chess game between the main detective and the criminal was flawless. Had they got the criminal into custody any other way than they did.. it would have ruined the movie."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "moonwio",
        "review_rating": "9",
        "review_title": "Who's right and who's wrong?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "asdf-12",
        "review_rating": "",
        "review_title": "Pretentious and disturbingly overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tjb103",
        "review_rating": "9",
        "review_title": "An Eulogy of 'Seven': The modern Shakespearean tragedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "raulfaust",
        "review_rating": "6",
        "review_title": "So so",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Bill-276",
        "review_rating": "1",
        "review_title": "Se7en Problems with Se7en",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "chavarriaviggo",
        "review_rating": "8",
        "review_title": "A film worth the watch",
        "review_detailed_main": "Great crime story, and probably the best I've seen. The twist at the end got me completely by surprise, but I wish they had shown us more instead of abruptly ending. Story kept you reeled in, and the pacing was admirable. The killer's mindset near the end is contradicted by the final showdown which opened up some holes in the character that would not have been preconceived if there had been a different way of going about things. Someone who kills people who are labeled innocent by society but not by himself because of his examination of what sin they had committed alters his thinking for the involvement of Mills (Brad Pitt). Overall a great film that holds it's own on the shelf of noir films."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "bwicknoff",
        "review_rating": "10",
        "review_title": "Best movie ever seen in my life 100/10. Beats everything today in 2023 aswell.",
        "review_detailed_main": "WOW. Thats how to describe this movie. Absolute masterpiece that everybody needs to watch at least once in their life, wouldn't be surprised if everyone has already seen this once in their life, it is that GREAT. Now whoever put Brad Pitt and Morgan Freeman deserves a medal for life because they created the BEST DUO OUT. The story is so well written, the movie has your interest the entire time, I can watch this for the rest of my life and never be bored of it. Everybody involved in this movie needs an oscar each, it is just a history record breaker of being the greatest movie ever made of all time. Every actor, scene, suspense, plot, story in this makes it the movie it still is today. It is so hard to reach this high of a level of a movie nowadays, just an incredible watch. Thanks to all for creating this gem!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "justine-goodwin09",
        "review_rating": "10",
        "review_title": "7 Cardinal Sins ( Could the freak be any more vague?)",
        "review_detailed_main": "I've watched this true masterpiece several times over the years,I have yet to watch a film that comes anywhere near it in terms of pure horror at the lengths humans will go to inflict pain on each other... The brilliance of this film is you don't see the acts been done,it's left to your own imagination. Brad Pitt,Morgan Freeman and Kevin Spacey are fantastically cast , the setting is wet and dark,( you never find out where the city is meant to be ).A Constant feeling of dread runs through this film which I can only say is an absolute must watch movie. Its is in my(and many others) opinion, probably one the best films ever made in the history of film making .. WATCH IT!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "smithcorey",
        "review_rating": "8",
        "review_title": "Good Movie! worthy of #49? No.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "travola-35109",
        "review_rating": "10",
        "review_title": "A 90s Masterpiece.",
        "review_detailed_main": "Seven is the first time we ever really experienced Fincher (Alien 3 doesn't count!!). Great performances by a young Brad Pitt and the always reliable Morgan Freeman. Freeman is the highlight here and he should have gotten some awards consideration for Seven.\n\nFantastic look and thriller story and one of the most talked about ending a of all time!! Highly recommend and watch at night to increase the the feel."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "bradrufc",
        "review_rating": "10",
        "review_title": "Astonishing how this was not even nominated for Best Original Screenplay at the Academy Awards",
        "review_detailed_main": "The film \"Se7en\", with outstanding performances from Brad Pitt and Morgan Freeman, as well as a short but important performance from Gwyneth Paltrow, is a genius masterpiece of utter thrills, horror and the best suspense you will ever see. David Fincher's second cinematic release will leave you thinking for weeks on end, the build up to the ending is so insanely gripping you will not even realise that the film has finished after its unforgettable ending. The movie is paced fantastically, has an interesting dark visual style, a moody vibe, and is all round perfection."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "vsdes89",
        "review_rating": "9",
        "review_title": "\"A dark thriller set in a dark and disturbing world\"",
        "review_detailed_main": "As the title of the movie suggests , there are 7 sins and watching a masterpiece ain't one of them. This movie has everything,a wonderful and a talented cast, a great director and the center of it,a story. It has a Gothic horror movie vibe to it but at the core it's a psychological thriller.This movie isn't for the faint-hearted as it contains a few disturbing scenes."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "MickeyTheConstant",
        "review_rating": "10",
        "review_title": "Gripping Storytelling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "zkonedog",
        "review_rating": "7",
        "review_title": "Could Have Beaten \"Saw\" To The Punch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Andrew_81",
        "review_rating": "",
        "review_title": "\"What's in the box\" - Still sends shivers down my spine!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "vocklabruck",
        "review_rating": "4",
        "review_title": "Overrated... Come on. It's good but not a masterpiece! Many PLOT HOLES and utterly predictable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "anthonymichaelbangert",
        "review_rating": "10",
        "review_title": "Se7en Ate Nine, So This Gets a Ten",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "The-Social-Introvert",
        "review_rating": "8",
        "review_title": "Quickie Review: Se7en",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "lauratkacser",
        "review_rating": "9",
        "review_title": "One of David Fincher's best films",
        "review_detailed_main": "I watched on the recommendation. I am glad I knew as little as possible about the movie before watching it.\n\nThe team was great. I'm not an fan of Brad Pitt but always I like his performance in Fincher's films. Then there's Morgan Freeman who is playing Morgan Freeman. And Kevin Spacey was OK.\n\nAlmost perfect among the films categorized in the group of thriller, it can be compared to the \"silence of the Lambs\" because of its dark, noir and almost gore plot. The film made me tense from beginning to the end.\n\n\"Se7en\" is one of David Fincher's best films. This is why is 9 out of 10 for me."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Atif_AK",
        "review_rating": "9",
        "review_title": "Incredible story revises your moral code",
        "review_detailed_main": "I developed phenomenally as a person when I saw this movie. Although not my favorite genre, but the plot is immaculate. I don't know how it can conceived this way. Was it a real story that was the inspiration behind. I don't know but just amazing. The performances, the direction, the editing, color grading, title- everything is near perfect. I became a fan of David Fincher, initially I thought it was a little talky but the movie is just hard to forget."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ryancortero",
        "review_rating": "9",
        "review_title": "A very interesting mystery film with a cool premise",
        "review_detailed_main": "Seven is a mystery thriller with an interesting premise, which you should not look into before watching this. If you've seen Zodiac or Gone Girl, you'll like the feel of this movie (especially since they're all directed by David Fincher). The mystery surrounding this movie had me intrigued and was building up well. The ending was not what I was expecting but I think it was a good conclusion. Morgan Freeman is his same amazing self, and Brad Pitt does really well in his role. There is one more actor who sold his part well, but I don't want to spoil who that is. The score by Howard Shore fits well too. I would definitely rewatch this because there are definitely things to pick up on."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "adityarocks-38866",
        "review_rating": "8",
        "review_title": "I am just speechless after watching thus movie.",
        "review_detailed_main": "The theme of the movie is so dark that at certain points in the movieI felt like stop watching this one but its way of narration and the suspense does'nt let me do so. David Fincher has made this master piece in such a way the it will not make you feel boarded at all . The ending of the movies was the best as well as the darkest part of the movie which revolves in the viewers mind even after the move ends. Its one of the best Drama/Mystery movie I have seen. Overall this movie is outstandingly brilliant."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Henke-4",
        "review_rating": "9",
        "review_title": "A film that scars",
        "review_detailed_main": "David Fincher once said: \"I don't know how much movies should entertain. To me I'm always interested in movies that scar. The thing I love about JAWS is the fact that I've never gone swimming in the ocean again.\" Well, SE7EN gave me a scar... and wow.. What a scar. 'cause it's so dark and so scary that I keept thinking about it for days, not to mention while walking out of the cinema. So if you haven't seen this one yet, all I can say is: I N V U."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Morgoth_Melkor",
        "review_rating": "9",
        "review_title": "Agonising Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tripwires",
        "review_rating": "",
        "review_title": "Oh, my god...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "moonspinner55",
        "review_rating": "6",
        "review_title": "Predictably gruesome, less predictably formula-bound...",
        "review_detailed_main": "There's a serial killer on the loose in rainy New York City who's modus operandi is to stage seven grisly crime scenes modelled after the Seven Deadly Sins. He is soon aware of the two homicide detectives on the case and becomes enamored with their drive and determination. Hit thriller from director David Fincher and screenwriter Andrew Kevin Walker is mostly left vague and unexplained. We learn precious little about the psychopath except that he's highly literate and educated, with too much strict religion in his background. This is all hoary police-movie fodder, as is the set-up with the detectives: the wise codger about to retire and his cocky new partner with the short fuse. Fincher mounts the tension well, with staccato glimpses of corpses and gore, but can't escape a fatigued sense of déjà vu (it has \"The Silence of the Lambs\"-itis). Brad Pitt gets off to an awkward, hesitant start in his role, but does improve. Freeman is sensational; whether throwing his knife at a dartboard or studying up on literature at the library, he is focused and gripping. The lust-and-death-soaked atmosphere is wallowed in--it's the Big Apple as a Gothic Hell--and, certainly, the grimy vibes are palpable and captured successfully, but they're also off-putting. Words written in blood on the walls...it's too much like ugly crime scenes from the evening news, and Fincher and Walker aren't clever enough to distract us nor cunning enough to help us distinguish the difference (the killer does leave clues, but they are quickly solved). The narrative is a mix of derivative movie-thriller ideas and new-fangled ways of making the viewer as squeamish as possible. It's the old pulling-wings-off-flies number, but on a larger, sick-making scale. **1/2 from ****"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "schatzkilla",
        "review_rating": "2",
        "review_title": "Not quite sure about all the hype...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Brazilian_Pharaoh",
        "review_rating": "8",
        "review_title": "Generic/Masterpiece",
        "review_detailed_main": "Inspired by the Divine Comedy (there are other religious books that inspire the villain but i don't remember them), the psicopath John Doe (Kevi Spacey) tries to teach a sermon by torturing people based on one of the seven deadly sins they are accused of committing.\n\nThis movie biggest sin (pun intended) is that only became a masterpiece that it is known only half way through it. The first hour is a generic detective movie with all the clichés: the two cops who are opposite from each other(Morgan Freeman and Brad Pitt), a murder mystery, etc.\n\nBut aside from that, it's a great movie worth watching specially for the twist at the ending."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "mortenjp-07072",
        "review_rating": "10",
        "review_title": "They don't make movies like this anymore",
        "review_detailed_main": "The entire experience from cinematography to plot development and attention to detail is 10/10. Usually, I'm quite critical when it comes to movies, but I can't find any flaws in this one. Imagine if modern day Hollywood and the modern day audience were less interested in \"safe\" blockbusters and superheroes and more interested in deep themes and character building... The acting is superb as well."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ShadowRomeo1784",
        "review_rating": "9",
        "review_title": "One Of The Best Dark/Suspense/Horror/Crime Movie Out There.",
        "review_detailed_main": "My Personal Rating - 8.5/10 - This Film is also great the acting the atmosphere is good. especially the ending, i won't spoil anything, just watch this film if you love suspense, mystery, a little bit horror in my opinion. and as always this film might not be for everyone obviously it's no mickey mouse kinda movie that a kid can watch. it's dark."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "muminndc",
        "review_rating": "8",
        "review_title": "A finesse of acting",
        "review_detailed_main": "Seven is a detective movie of Brat Pitt and Morgan Freeman. This movie found a serial killer who killed people for their seven deadly sins. They are gluttony, sloth, pride, envy, greed, wrath, lust. Even the wife of Pitt was killed for the envy. The Killer John Doe used to envy the life of the detective Pitt that led to killing of his wife, Tracy in the morning when Pitt left the home for operation. The killer showed up and submitted in the police station with bloody hand and asked for lawyer and his help. However, he killed two other people that he wanted to show the detectives and took them to a barren high tension wiring places. Then a delivery van came and kept a box where Tracy's head was packed. In that morning, Doe killed her, she was pregnant. That misery Pitt could not afford and killed the Killer despite repetitive urge by Detective Somerset to stop firing. The quote of the Somerset is 'The world is a fine place and worth fighting for. I like the second part'- Detective Somerset.\n\nThis movie hugely used the idea coming from Divine Comedy, Purgatory of Dante and Canterbury's Tales by Chaucer."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "lbeattie-65122",
        "review_rating": "9",
        "review_title": "Awesome, twisted serial killer flick",
        "review_detailed_main": "Se7en is one of my favorite movies. I guess that says a lot about me. I can't pass it by when flicking through my cable guide. Every time I watch it I see or hear something new. Morgan Freeman is superb as a tired and emotionally beaten down cop getting ready to retire. Brad Pitt is very convincing as a young new detective running his first serial killer investigation with all the nerves and ambitious recklessness you'd expect from having to partner with a veteran on his last case before retirement. The duo face a witty killer who kills based on the seven deadly sins. The real stars of this movie are the writer, director and set designers for presenting incredibly intricate and graphic murder scenes and making all the characters likable. The writing is deep and you have to pay attention to every detail. As the bodies mount you find yourself counting down each deadly sin to the incredible climax and shocking but truly awesome ending. You can't go wrong with the cast assembled in Se7en. It's a great movie for whodunit fans that like a little more tension and voyeurism in their crime dramas. It will not disappoint."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "fatalsin80",
        "review_rating": "10",
        "review_title": "Oh spacey you slay me!",
        "review_detailed_main": "This was an awesome movie! Spacey should have won an Oscar he was devilishly cruel and good! Even Brad Pitt had a stellar outing in this as the young cop with something to prove, beautiful lady at home etc.. Morgan Freeman as the smart older and on the verge of retiring cop but is pulled back in for this one last case.. is excellent. Its a shame this didn't receive more Oscar attention. It really found its groove later on I suppose as a classic. Not recommended as a family film has a lot of violence as its a take on the 7 deadly sins. Overall this movie was a 10 for me the cast the directing the story line was dynamite! Well worth a watch a time or two!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "RickHarvey",
        "review_rating": "8",
        "review_title": "just how I like'em",
        "review_detailed_main": "Thrillers are either a hit or a miss. They can be awesome while many can be awful. Seven is in the Very awesome category. Basing the film around the seven deadly sins is an concept that everyone can relate too. We have all sinned meaning we can be put ourselves in the shoes of the victims ( not all victims mind you ) . When you imagine a film in which it always cloudy and overcast with rain pouring down 24/7 , you would think it going to depress you . Truth is , you don't actually notice the weather , but instead take huge interest on what happening in the homes of the city.\n\nI'm not an huge fan of Brad Pitt but it seems that when he teams up with Fincher , he always puts on an good performance. Then there's Morgan Freeman, which is fairness, is playing Morgan Freeman. He fun to watch but you know what type of performance he going to act out. Both are very good but the one who steals it is Kevin Spacey. He may be in it for 20 minutes, but his role is extremely memorable. His character is well made and maybe deserves a bit more screen time . The film is very well made and an joy to watch. It keeps you awake and leaves you to wonder about the next deadly sin. When watching it, you can clearly see that Seven was an influence towards Leigh Whannell and James Wan and there SAW film. Everything about SEVEN was great, the concept, the acting, the finale. I highly recommend this film."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "mdaadila",
        "review_rating": "10",
        "review_title": "Best thriller movie ever",
        "review_detailed_main": "It's a best thriller movie all time i love it.\n\nYou should watch this movie both actors are playing their roll very well.\n\nSeven moulders are in these movie included."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Horst_In_Translation",
        "review_rating": "6",
        "review_title": "Good film with a great ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Brad K.",
        "review_rating": "",
        "review_title": "Tough thriller with an incredible climax.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "hannahkraft",
        "review_rating": "3",
        "review_title": "Ending was dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "maxhammer",
        "review_rating": "9",
        "review_title": "A short review of the classic \"Se7en\"",
        "review_detailed_main": "Se7en is a true classic. Upon release people already knew that this movie was going to be a classic and would be seen for decades to come. With the two Oscar-winning actors Morgan freeman as detective Someset and Brad Pitt as detective Mills in the lead this movie provides a energetic and true acting. Se7en is about a reckless serial killer killing \"innocent\" people related to the seven deadly sins of Christianity. Detective Somerset and Mills are put to on the case, but they're soon to know that the serial killer has a plan for them both. This movie is without a doubt a cult classic film. Because of its unique camera angels and editing as well as its quite absurd ending. It does make you think about the lifestyle that we are living in. Therefore i give this movie a solid 9/10!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Phillip-Riback",
        "review_rating": "10",
        "review_title": "Dark thriller full of perfection",
        "review_detailed_main": "Its today's cult status this movie gained thanks to the excellent work of director David Fincher (whom this was only the second major movie in his career) and screenwriter A.K.Walker (who also wrote the screenplay for \"8MM\"). With this film Fincher ranked himself among the most wanted directors and gained a reputation of true heir of Hitchcock, which was confirmed by his later movies \"Play\" and \"Panic Room\". The assignment of roles in the movie is excellent, and I especially need to emphasize Brad Pitt's acting (as in \"Fight Club\") which proved that he is not just a beauty figure whose main task is to lure women to cinemas, but also showed that he knows to act! Freeman is excellent in the role of a veteran detective - like it was made for him, and Spacey in the role of the killer was, as usual, brilliant and gravely. The atmosphere of the film is so dark and depressing that the bizarre and terrible murders make it even more stressful. I was particularly impressed by the way murders were described, which are quite original and leave a big impression on the viewer. (Something like that was attempted in \"Resurrection\" with C.Lambert but not very successfully, and \"Saw\" - interesting, but not on a par with \"Se7en\"). All in all this is an excellent and original movie which is rarely seen."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "beardedmovieguy",
        "review_rating": "10",
        "review_title": "The Rainy City Holds A Lot Of Secrets",
        "review_detailed_main": "Wow, here is the thing, most movies that have been out for a long time and I have been told that are great but have not got a chance to see yet, well, most of the time they never live up to the hype. That is not the case with Se7en. This is one amazing movie. The acting was stellar, directing was spot on and the use of the city and rain added so much atmosphere that it was almost another character in the film. I did see the end coming even though I was hoping that I was wrong.(I think I knew what was coming not because this movie was predictable, more so that after this movie lots of movies and TV shows have stolen from it, so it kind of easy to see where it was going, I am sure if I had seen this when it was first out I would have been surprised) This is a five star movie that I think will still be great 50 years from now. 5 Beards Out Of 5 Check out my video review. http://youtu.be/WCVDBOziSrM"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "andrewvus",
        "review_rating": "10",
        "review_title": "Definitely worth a movie cinema - worthy, offered to a competent, but still with good actors.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "maresal-musca",
        "review_rating": "9",
        "review_title": "One of the best thrillers",
        "review_detailed_main": "One of the best thrillers I've ever seen. It's too bad that most of this genre movies aren't produced anymore during the last years. Best thrillers, in my opinion, are the ones from the '90s and early 2000. Why's that? Aren't there any good screenwriters? It's hard to find now days a good thriller that can blow you up. Most of them are at a 6 average mark or below and quite short (not so many over 1h30 min). Se7en has, almost everything that a thriller needs: action, emotion, curiosity, a good screenplay, good actors, unpredictable end and it is not a short movie. We have here a young Brad Pitt, that plays very well, a mid age Morgan Freeman as his mentor and a \"sick\" Kevin Spacey (in a good way, of course)."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "maidwell-45616",
        "review_rating": "10",
        "review_title": "My 2nd favourite movie of all time",
        "review_detailed_main": "I remember walking out of the cinema at the end of this film in a daze, my brain incapable of computing the audacity it had been subjected to by the unhollywood ending and stylish bleakness on display for the previous couple of hours. It hits you like a sledgehammer and won't let go. I love a movie that makes you FEEL, and seven does that every time I've watched it in the 25 years since. It's not for the faint of heart or people who need to see a sunny outlook on humanity, it's far too real for that. Fantastic acting, pitch perfect direction and screenplay combine to make a true classic of cinema. If it passed you by in the 90s (or you weren't around then!)... give it a go, it has aged beautifully."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "victor-esanu",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "If you love cinema, you HAVE to watch this, I just can't say why, cause if I start, I know, I won't stop and there will be a lot of spoilers, and nobody wants that. Watch it"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "neon47",
        "review_rating": "10",
        "review_title": "oh yeah!",
        "review_detailed_main": "Se7en is great. Need I go on? Alright... Se7en starts off nicely making it look like another day at work. Well it is, but it's the beginning of something big. Not 5min into the movie and we're introduced to the first murder scene which is a obese man with his hands tied together under the table and his face smashed into a pile of noodles. He's obviously dead. The killer in this movie picks his victims according to the seven deadly sins, which if you don't know are: greed, gluttony, lust, pride, wrath, envy, and sloth. The killer is very original in the style he kills his victims, which are often times very gruesome. Although they don't really show any killings in here just the way they implied lust was enough to turn my stomach. The movie does a great job with its dark setting and bad neighborhood. Symbolic that this city sucks and is run down. The acting by Mordan Freeman and Brad Pitt is sensational, as well as Kevin Spacy's acting, whom I praise for his role. Overall this is one of the best movies I've ever seen, and the ending... oh buddy, the ending will getcha."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Floated2",
        "review_rating": "7",
        "review_title": "Quite gripping and disturbing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "john in missouri",
        "review_rating": "",
        "review_title": "Okay, but a bit overrated IMO",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jscontoyannis",
        "review_rating": "1",
        "review_title": "predictable, methodical, overrated...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "The-Kissable-Writer",
        "review_rating": "9",
        "review_title": "Ambiguous, shocking, brilliant.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "stallone-9",
        "review_rating": "10",
        "review_title": "Can't stop watching.You are already sucked into the story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "youllneverbe",
        "review_rating": "9",
        "review_title": "One of the best Serial Killer films ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "xdfernx",
        "review_rating": "10",
        "review_title": "Why isn't this movie more popular????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Just-A-Girl-14",
        "review_rating": "9",
        "review_title": "Strong movie",
        "review_detailed_main": "This movie is meant to shock the viewer. It is a statement on human society that is even more true now than it was 26 years ago when the movie came out. Whether you agree or not, whether you're shocked or not, it is a good strong movie with a great cast. Highly recommended."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "dave_472",
        "review_rating": "10",
        "review_title": "Wow... all I gotta say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "Very well made, but....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "andrewchristianjr",
        "review_rating": "7",
        "review_title": "DISAPPOINTED WITH THE ENDING.",
        "review_detailed_main": "What twist everyone is talking about? Kinda disappointed with the ending. I am lover of thriller but this one has no thrill in it. It's overrated tbh. 😑"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Kausality_",
        "review_rating": "",
        "review_title": "Dour.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "TensersFloatingDisk",
        "review_rating": "2",
        "review_title": "WHY is this considered a good movie????",
        "review_detailed_main": "I'm sorry for those of you who think that a watered-down pseudo-sadistic murder spree makes for compelling or an intelligent film. It doesn't.\n\nLet's set aside for the moment the miserable lighting and cinematography in this film -- half the movie is so monochromatic that it's difficult to tell what you're looking at, and the 'artistic' angles compound the problem.\n\nLet's set aside the absolutely rotten characterizations -- Freeman tries hard with his portrayal of the absolutely-cookie-cutter jaded soon-to-retire cop, but there's nothing there, and Brad Pitt's scenery-chewing over-the-top \"look at me, I'm sooooo mad!\" rookie-detective turn is, frankly, laughably silly. Gwyneth Paltrow has absolutely nothing to do, and Spacey's character is...well, he's not a character. He's a bit of hackneyed dialogue, without motive, without charisma, without even a semi-consistent tone (we're supposed to believe that this infinitely careful killer is also so ramblingly incompetent that he leaves evidence all over his apartment? That he's so confident he knocks off cops' wives, but so easily frazzled he loses his cool under light questioning in the police car?\n\nLet's instead focus on plot holes so wide you could toss a horse through them.\n\nWhat kind of police department is this? There is not ONE ATTEMPT to answer some of the obvious questions that would be asked in any murder investigation (is there surveillance video of the lawyer's offices (there would be)? Where did the killer get his antibiotics (those things are tracked, numbskulls)? Why aren't the cops even TRYING to predict the killer's victim pattern, after they've been given ridiculously explicit hints? Most importantly, the entire ending is completely implausible...under no circumstances would any department, anywhere, EVER, send two detectives off with the high-profile confessed murderer like that. When Spacey proposes his little 'deal,' the cops would have said \"tough. Rot in jail, sicko.\"\n\nI suppose the success of \"Se7en\" proves that if you shower an audience with enough slickly-produced gore (not even that imaginatively rendered), they'll buy it, particularly if you layer on some random pseudo-literary quotation to give it a sheen of \"art.\" A sad comment on the state of the horror genre."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "hooflethroid",
        "review_rating": "10",
        "review_title": "One of the finest films ever made...",
        "review_detailed_main": "I first saw this movie when I first visited America, I knew nothing about this film (as it had just opened) so I paid my money and gave the film a chance. It simply blew me away. The ending is just unbelievable. The performances are fantastic, the direction and art design are exceptional and Kevin Spacey (my fave actor) popping up towards the end was the icing on the cake. Plus every time I watch the film now it reminds me of being in America... it's my favourite movie, for so many reasons. :)"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "slightheadwound",
        "review_rating": "10",
        "review_title": "Se7en",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "berggeit9",
        "review_rating": "9",
        "review_title": "David Fincher does it again!.! ^__^",
        "review_detailed_main": "Se7en is a reflection of our everyday life, we live in a world filled with media & information technology which makes people often live beside each other instead of with each other, even though the serial killer is portrayed as the devil in this movie i can empathize with his feelings/opinion about seeing sins on every corner of the streets. The intellectual, patient personality that's Sommerset & the young rebellious \"let's dance\" Mills really contrast each other, creating interesting character development.\n\nWe as the audience are confronted with biblical/religious statements throughout progress of the film concerning homocide cases, if Sommerset had to choose a playing card then he'd retire as soon as possible, he's been doing detective work for way to long, but however he does get motivated by the unusual case of 7 sins that are about to unfold including all the plot twists & turns.\n\nSe7en has been directed with unusual grimmy & dark look, during the film it's constantly raining, as if time never seems to change the mood is captured with great directorial vision, the dark & wet apartments that seem to be abandonded for ages, a combination of brown & black colors recreating a new kind of innovative film noir, consciously leading us to unique cinematographic history.\n\nSommerset comes to terms with our serial killer John Doe & even though they might agree on certain points when it comes to the subject of everyday life, these 2 characters are worlds apart at the same time, in a sense that John Doe murders his victims using the 7 deadly sins.\n\nPacing of this movie is nice but if you're expecting a big action movie, perhaps you're better of watching a vin diesel (XXX) movie. We're invited by the director to be intellectually stimulated, while the story develops we must think along, asking ourselves new questions about every single horror murder committed as we go.\n\nWith that said the film is in my humble opinion highly recommended, especially if you're a fan of the acting skills of Brad Pitt & Morgan Freeman, it's got quality(not much though)action, dark mood, acting, story development, character development, mystery, among others. Even though not for the faint hearted, since some scenes of the committed murders are visually shocking to say the least (adult rated), Se7en is a great police drama by director David Fincher. * * * * * * * * * 9 OUT 0F 10 STARS !"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "i_know_people",
        "review_rating": "10",
        "review_title": "loved it",
        "review_detailed_main": "i love this film, it is the ultimate thriller film, everything about se7en is brilliant. the cast are well picked and make the best contributions, the main characters Somerset and Mills are portrayed perfectly through Freeman and Pitt. in my opinion this is both Pitt and Freeman's best film, they still have not outshines there fantastic performances. Paltrow as mills wife was a good choice though there are a few other actresses that could have played this part, though i think that what paltrow brought to the role was the fragile emotional side of the character, so i am pleased that she played this part so well. the director is my favourite of all time, Mr David Fincher! he is a fantastic director, not just for this film but for his other films like fight club. he gets fantastic results from his cast and crew and makes the perfect film. and as i'm a budding editor myself i have to mention the fantastic edit on the film, by the editor Richard Francis-Bruce, i do love the edit on seven as he cut at hit points and generally did well.\n\nif you haven't watched it watch it, if you've seen it seen it again! i certainly will."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "DavidYZ",
        "review_rating": "9",
        "review_title": "Brilliant",
        "review_detailed_main": "This is an excellent serial killer thriller.\n\nMorgan Freeman and Brad Pitt play police detectives who together are tracking a serial killer who kills people who have each committed one of the seven deadly sins in a way that's relevant to the specific sin. Kevin Spacey plays the killer."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "therealwargame",
        "review_rating": "10",
        "review_title": "David Fincher and the Se7en deadly sins",
        "review_detailed_main": "David Fincher's great style of directing, a movie that's brilliantly dark and it's superbly acted. Morgan Freeman and Brad Pitt are a pairing couple or opposite personalities and Kevin Spacey is the villain we all love and hate, such a great performance. Intelligent writing with no clichés and the imagery of the grotesque never descends into thoughts unnecessary gore or sensationalism. Brilliant cinematography with a bleak tone, the film has a sense of dread and some moments are climax. Se7en sticks with you in your and it's really unforgettable. The plot keeps you hooked until the most terrifying final moments you will ever see. It is scary because it uses your imagination against you in a deep, deeper level. A classic crime thriller that remains uncompromising no matter how many times you watch it."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Nikhil_87",
        "review_rating": "9",
        "review_title": "Excellent",
        "review_detailed_main": "This great thriller is about a serial killer (Kevin Spacey) and his Se7en victims who represent the Se7en deadly sins. Two cops (Morgan Freeman & Brad Pitt) have been assigned to investigate this case.\n\nThis is the best movie of the 90's, it has great thrilling moments, Morgan Freeman & Brad Pitts performances are excellent. Se7en has one of the best but shocking and surprising endings of all time. The end is something nobody would expect, i kept rewinding over and over again to see them 3 short seconds where you see... (im not going to spoil the movie).\n\nKevin Spacey's role in this movie was a surprise for everyone, well except for the people who use IMDB, it said who the killer was played by.\n\nThe most shocking moment for me was when you see that body on the bed and everyone thinks that person is dead because of the state of the body, but its not, that scene shocked me alot, i never forgot it and never will.\n\nOverall i gave Se7en 9/10, everyone that likes thrillers should go see this movie, HIGHLY RECOMMENDED."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Poptart_Psycho",
        "review_rating": "8",
        "review_title": "Need To Make More Thrillers Like These",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "amathubagoldhq",
        "review_rating": "7",
        "review_title": "Divine Murder!",
        "review_detailed_main": "Throughout history the Bible and its wisdom have been used as an excuse for murder. The director in \"Seven\" cleverly makes use the seven sins as Kevin Spacey's Divine permission to commit the biggest biblical sin of them all; murder! While Spacey is sacrificing his victims in the name of religion and punishing them in graphical behavior for their weaknesses; Morgan Freeman and Brad Pitt appear as the prophets defending and protecting all that is good by trying to catch him. The director David Fincher keeps you on the edge of your seat as you watch each brutal murder appear across the screen and as you watch Freeman and Pitt getting closer to their killer. Freeman always appears the wiser while Pitt gets more and more engulfed with rage as the killer taunts his pursuers while punishing his victims. We the viewers, are filled with anger and wrath (one of the sins themselves), as we want the killer to be caught but we realize at the end that he wants more than that! At the end the shocking revelation takes over our minds and fills us with even greater anger as we want Spacey punished! We also want him dead for his last brutal act! We also want Pitt to kill him! The question to be asked, is the unborn child saved from been born in a world full of religious contradiction or should those who wrong us be punished without question?"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "zhidoo",
        "review_rating": "",
        "review_title": "9/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "fung0",
        "review_rating": "1",
        "review_title": "I deeply regret seeing this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "BaronBl00d",
        "review_rating": "9",
        "review_title": "Gritty, Disturbing Thriller - One of its Kind",
        "review_detailed_main": "Incredibly gritty, very fluid, and most disturbing are all ways that one might describe David Fincher's Seven, a film, as all of these reviews on here will attest to, is about a serial killer-maniac killing people based on the seven deadly sins. There is little need to rehash the plot here then but what makes Seven such a good film and one of the best thrillers of the last few decades? 1). Two strong, key performances by Brad Pitt and, in particular, Morgan Freeman as New York police detectives just united as one, Pitt is coming, and the other is about to retire. Freeman and Pitt have some chemistry between them and let's face it - Freeman is just plain good at just about any role he assays. Add to this strong supporting work from Paltrow and R. Lee Ermey and especially Kevein Spacey as the killer. Spacey's voice and looks sent chills down my spine each time he was on screen. 2)David Fincher knows how to direct. This film is gross and really is selling a very seedy product as something more. Fincher makes that happen with the crisp dialog between Freeman and Pitt, the very low lighting effects throughout, the quick pacing of the film, and the depth of characterization that he allows his characters to have. 3) The story is well-conceived, well-written, and just crazy enough to be believable. The film has many scenes which are shocking and designed to be so - they succeed. But behind all that blood and seedy atmosphere lies a chess game between two police detectives - each good at what he does in a different manner - and one crazy but brilliant sociopath killer. The journey they take us on is one scary ride."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "sir_striker886",
        "review_rating": "10",
        "review_title": "Must see.",
        "review_detailed_main": "It's very hard to talk about this movie without spoiling it so I need to keep it simple. Thinker/mind bender. Its insightful/disturbing nature is the only reason why I can see that it only has 8.6 rating. It's a movie you have to pay attention to. A movie you can watch over and over and always find something new. If you don't agree with that... watch it 5 years from now."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "shahaberry72",
        "review_rating": "9",
        "review_title": "A masterpiece",
        "review_detailed_main": "I was too young to fully appreciate this when I first watched it. Now though, whole different game. I love it so much that I think I'm watching it every year. Fincher's finest."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "vav-61764",
        "review_rating": "9",
        "review_title": "Se7en is Going to Freak You Out With Its Mind-Blowing Plot and Intriguing Characters",
        "review_detailed_main": "As I was watching Se7en, I was both shocked and fascinated, this movie surely can be used as a mirror to other suspense films to show how they should be made. The anxiety and apprehension grows along the film for having such a captivating story, even if some scenes are very disturbing to watch, you can't take your eyes off. Another big contributor to make it more hypnotic is the soundtrack, when it's needed does an incredible work to elevate even more the breathtaking feeling. The director, David Fincher, did an amazing job in crafting this movie, it's proved how talented he is and something noteworthy is in some particular scenes, how they were shot regarding the style, angles of the camera that make you feel like you're in the scene.\n\nThe cast, both leading and supporting, did a marvelous work in performing the characters. They're so consistent and believable, we really have the chance to know the identity of every single one in terms of dreams, emotions, regrets. Morgan Freeman plays an old detective, Somerset, who is fed up with his detective's life, because the city and the world as in general are too hateful, the apathy is present in people's everyday life and he can't take any longer this. He's methodic, pragmatic and due to his long career in the police, he's very meticulous in a crime scene. Detective Mills is played by Brad Pitt, different from Morgan Freeman's character is a young detective with a lot of stamina, enthusiasm but he's reckless and very emotional too. The contrast between the characters is pretty perceptible and is very well explored to show a man already marked by a tough and cruel world, Somerset, and other still untouched and a bit naive about the cruelty of the society.\n\nThe murder scenes are so realistic and disgusting, they really make you feel uncomfortable and revulsion witnessing them and passing how sick the serial killer is. The murderer, John Doe, is played by Kevin Spacey. The tension drastically grows when he's speaking, his performance succeeds in portraying a person mentally disordered, a psychopath. No Doubt, John Doe after such a remarkable acting gained a sit among the most famous psychopaths of the cinema."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "kechhh",
        "review_rating": "",
        "review_title": "Great Twisted Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "supertom-3",
        "review_rating": "10",
        "review_title": "One of the 90's best movies!",
        "review_detailed_main": "David Fincher has become one of Hollywood's most wanted directors since this film and this is a fantastic film. Since this he hasn't done a bad film, in fact most are excellent. Seven is more conventional than his films the Game and Fight Club but it has a great script which is fantastically directed. The actors of the film are of the highest calibre. Morgan Freeman, Brad Pitt, Gwynith Paltrow and Kevin Spacey are all fantastic, Freeman and Spacey in particular. The film has plenty of twists and is involving while everything comes to a shocking and stomach churning ending. This is definitely one of the best crime thrillers ever made.\n\nAs with other Fincher movies it looks fantastic. The cinematography is outstanding. The score is also fantastic and the overall look and sound of the film is top class. This is a modern classic, no doubt. *****"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "addictive1",
        "review_rating": "10",
        "review_title": "On top of the my best movie list",
        "review_detailed_main": "Brad Pitt and Freeman are very good duo in this movie. I admired the acting. The story was so beautiful. The final scene is very impressive and amazing. People go into a lot of different emotions.Everybody thanks for the movie. These types of movies are not satisfied with one time of watching."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Hitchcoc",
        "review_rating": "8",
        "review_title": "Almost Too Much to Bear",
        "review_detailed_main": "I was totally taken with this film. It's not The Usual Suspects, but it is really something. Unfortunately, I felt almost sick when I was finished watching it. The madness of the murders and the general philosophical sickness that carries it along put it out of reach for some of us. I can't imagine the world portrayed here. Great cast. I really thing Brad Pitt is excellent; and, of course, Morgan Freeman is his usual complex self. Once again, however, in a relatively brief appearance, Kevin Spacey steals every scene he's in. It's that unflappable delivery of his. No matter what is said or done, he anticipates it. The murders are hideous. The camera doesn't show the most gory details (which I appreciated), but they are sold to us through outside factors. I missed this the first time through and wanted it to be part of my movie-going experience. I don't think I could ever watch it again."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ccthemovieman-1",
        "review_rating": "8",
        "review_title": "The Good & Bad Of 'Se7en'",
        "review_detailed_main": "I am shocked that I watch, much less own, this movie, and as often as I do. It's so dark, so uncomfortable to watch in many spots and so profane (although I use a TV Guardian) that it's not a very likable story and film.....but I find it fascinating. Let's continue on with the bad, and the good, of this film - at least from my vantage point.\n\nTHE BAD - As a Christian, I get tired of seeing the villains, the sickest of serial killers, portrayed as Christians. It's unbelievable Hollywood bias that would never be tolerated if minorities were the constant victim of this kind of prejudice. In case, you don't get the message they even pass by a brightly-lit neon cross in the guy's room! That, and another cheap shot about a Southern Baptist being the killer, and comments about the sicko \"preaching a sermon\" plus Kevin Spacey's talks about people's sins....all are designed to portray a sick killer as a religious nutcase. Also, for further Liberal slants, good-guy Morgan Freeman is talking to Gywneth Paltrow at a neighborhood diner and he relates having talked an old girlfriend into having an abortion which Freeman says, \"to this day, I am positive it was the right move.\" Yet, he also says it was a mistake and he regrets it. Huh?? Other negatives include too many f-words and usages of the Lord's name in vain, mos of them said by Brad Pitt. There are also several really, really downright gross scenes in here. If you don't expect them, you can easily be shocked with these disturbing images: some very sick pictures of tortured and mutilated bodies.\n\nTHE GOOD - Despite all of the above, the story - as shocking and sordid as it is - is a fascinating one. It gets you so involved that it's almost impossible to put down, even with the unpleasant scenes. The finale is memorable, too. I also appreciated the wonderful cinematography in here. There are some strange colors in here but it all looks fantastic on the special-edition DVD. Spacey was relative unknown in his acting career at this time was riveting in that final 30 minutes when he had his speaking lines. All the actors in here are excellent. This is a film that is impossible to forget.\n\nOVERALL - As a friend once told me, \"This movie is very disturbing.\" It's also extremely interesting, but beware it's not easy to watch."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "deatman9",
        "review_rating": "7",
        "review_title": "Terrific thriller!!!",
        "review_detailed_main": "This movie was just awesome.A thriller that really leaves you on the edge of your seat the whole time your watching. It starts morgan freeman who always does a superb job, accompanied by brad pitt who always did an outstanding job. And to top it all off it was directed by David Fincher who has made some great movies.\n\nThis movie is about two detectives (Freeman,Pitt) who are sent to invesitage a weird string of murders. There is a murderer killing people using the seven deadly sins as justification.\n\nOverall this movie was really good. Great actors, great story line and a lot of twists and turns to keep you interested. I really liked it."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "robotradiohead",
        "review_rating": "1",
        "review_title": "Annoying",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Ed5y but Ordinary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "anupamsatyasheel",
        "review_rating": "10",
        "review_title": "Dark, Chilly, Brilliant and\u0085 Disturbing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "FrankBooth_DeLarge",
        "review_rating": "10",
        "review_title": "Grisly, Disturbing, and well created thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "steiner-sam",
        "review_rating": "9",
        "review_title": "Brilliant, not a formulaic mystery",
        "review_detailed_main": "It's a psychological crime drama set in the 1990s in a large American city. It follows two detectives tracking a serial killer basing his murders on the Seven Deadly Sins.\n\nWilliam Somerset (Morgan Freeman) is an older, unmarried African-American homicide detective one week from retirement. He is thoughtful and highly educated, with a clear religious base. His replacement and partner for a week of overlap is David Mills (Brad Pitt). Mills is a young, impulsive high school graduate with limited literary interests. He and his wife, Tracy (Gwyneth Paltrow), have just moved to the city from \"upstate,\" where Mills previously served as a detective. Tracy is less than enthusiastic about the move.\n\nSomerset's and Mills' first case is a bound, obese man found at his kitchen table. Then, a prominent lawyer lawyer dies. At the crime scenes are the words \"gluttony\" and \"greed.\" The two detectives realize they're pursuing a serial killer and, at one point, almost catch him. Later, the highly literary John Doe (Kevin Spacey) reveals himself and offers to lead the detectives to two more bodies. There is a horrendous ending.\n\n\"Se7en\" sifts through the life views of both Somerset and Mills and their struggle to analyze the killer's motivations. Freeman and Pitt pull wonderful characters from an excellent script. Though there is one memorable chase scene, their dialogue is much more important than the action. Paltrow and Spacey are good in their more limited roles. The cinematography includes much rain and dark, grimy interiors, making this outstanding neo-noir. The ending is twisted and unforgettable, reminding one of \"Silence of the Lambs.\" The display of the murders is horrific but not overly gory. \"Se7en\" is not a formulaic mystery."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "miguelneto-74936",
        "review_rating": "9",
        "review_title": "an excellent thriller with a brilliant script",
        "review_detailed_main": "Seven has one of the best original scripts of cinema, and one of the most amazing already made finals for only the second movie of the excellent David Fincher he sent well , seven with Gone Girl is the two best Fincher movies in my opinion , the performances are great , the duo Brad Pitt and Morgan Freeman works very well , the rhythm is good, and the script explains very well , even with a few holes , the soundtrack is more or less , I say it because I did not notice right it, photography is good , Seven in my opinion was wronged Oscar 1996 deserved indicated best film, best actor, best screenplay is better sound (which was his only statement, Seven is a great movie with a great cast and a screenplay very intelligent. Note 9.4"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "neerajmenons",
        "review_rating": "10",
        "review_title": "A Masterpiece of Crime and Suspense",
        "review_detailed_main": "David Fincher's \"Se7en\" is a grim, unrelenting journey into the darkest corners of human nature and morality. From its haunting opening credits to its shocking and unforgettable climax, this film remains a benchmark in the thriller genre.\n\nThe story follows two detectives, the seasoned William Somerset (Morgan Freeman) and the brash rookie David Mills (Brad Pitt), as they hunt down a serial killer who uses the seven deadly sins as his modus operandi. Freeman and Pitt deliver powerful performances, their contrasting approaches to justice and life providing a rich, emotional core to the narrative. Freeman's portrayal of Somerset's world-weariness is a masterclass in subtlety, while Pitt's raw intensity captures Mills' youthful fervor and desperation.\n\nKevin Spacey's chilling portrayal of John Doe, the methodical and philosophical killer, is one of the most compelling antagonists in cinema history. His calm demeanor and twisted rationale make for a deeply unsettling character that lingers long after the credits roll.\n\nAndrew Kevin Walker's screenplay is tight and meticulously crafted, each sin-related murder scene more gruesome and thought-provoking than the last. The dialogue is sharp, often poignant, and imbued with a sense of impending doom.\n\nThe film's cinematography, by Darius Khondji, is visually arresting, utilizing a desaturated palette to emphasize the bleakness of the urban landscape. The relentless rain and perpetual gloom heighten the sense of decay and hopelessness that permeates the film. Howard Shore's haunting score further amplifies the film's eerie atmosphere, blending seamlessly with the visual elements to create an immersive experience.\n\n\"Se7en\" is more than just a crime thriller; it's a profound exploration of human depravity and the complex nature of justice. The film poses difficult questions about the nature of sin and punishment, forcing the audience to confront uncomfortable truths about society and themselves.\n\nThe climax of \"Se7en\" is one of the most shocking and powerful in film history. It is a testament to Fincher's directorial prowess that the tension remains palpable, the revelation both horrifying and inevitable. The final moments are seared into the viewer's mind, leaving an indelible mark that sparks reflection and discussion.\n\nIn conclusion, \"Se7en\" is a cinematic tour de force, a film that excels in every aspect of storytelling, performance, and technical execution. It's a dark, disturbing, and unforgettable journey that stands the test of time. If you haven't seen it, prepare yourself for a relentless and thought-provoking experience that will stay with you long after the screen goes dark."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "MysticSolver",
        "review_rating": "8",
        "review_title": "Awesome performances",
        "review_detailed_main": "The main actors of the film deliver hard on this one, bringing the stakes to another level and making the movie quite thrilling to watch, even when I have seen it multiple times.\n\nThe movie of course is very dark, but considering when this was made, I can appreciate that because it must've been a very risky choice at the time when cinema was overall a more positive environment when it comes to the themes and imagery of film. This film won't hold back on its grittiness, but also doesn't show you stuff just out of the need to be dark, and that I also appreciate quite a bit with shows like The Boys around which do the polar opposite. Dark for the sake of being dark is never an appealing thing for me, and never will.\n\nSo much has already been said about the movie that I'll end my review here, movie is solid 8/10."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "duncannoella",
        "review_rating": "8",
        "review_title": "A disturbing yet great film",
        "review_detailed_main": "I really liked it suprisingly. Seeing it is not the type of genre I would normally watch and that I generally like but this film was really well done. It has a gripping and interesting storyline. I think the whole plot around the seven capital sins was really ingenious and made the story great. I love the beautiful dark cinematography and the screenplay is really intelligent. To add on top of that great performances from Morgan Freeman playing the detective and Brad Pitt as Mills. I also like how the film talks about a lot of murders but really not much is shown. Overall a disturbing yet really good film."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "mbdr-82276",
        "review_rating": "9",
        "review_title": "A timeless, compelling, and thrilling classic of a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "arashrastan",
        "review_rating": "7",
        "review_title": "Good chemistry between characters",
        "review_detailed_main": "I really liked the movie's direction and atmosphere. Acting was great. Characters were real with sufficient motives. Cinematography was perfect. Over all was a good work of art in many aspects of filmmaking. The film's score helped to create the tone of the film. Very good camera work and Art direction was very good. I will give This movie A."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "il primo",
        "review_rating": "1",
        "review_title": "The McDonald's of Horror Films",
        "review_detailed_main": "Wow. There are a lot of bad films out there, but even with the worst of the worst there is some redeeming quality, like that neato big wave in the Perfect Storm. But Se7en? The acting is flat (Brad Pitt's opening lines seem like they're coming from someone acting for the first time, his moaning at the end, when he gets his special gift, just seemed pathetic); the script is not at all inventive and unsuccessfully covered up by hyperbolic special effects and redundant gore. The \"twist\" at the end is hardly disturbing because the writer/ director have been shoving gimmicky horror effects down the our throats for the entire movie.\n\nPeople who like this film- the dark, urban atmosphere, the pseudo-noir elements: please watch some David Lynch films and see how this should be created, i.e. not by using video game titles, not by relying heavily on special effects, make-up, and yet ANOTHER plot with biblical references, but instead by a careful selection of actors, beautiful cinematography, and incredibly original stories.\n\nStop funding this director so that he will go back to making TV commercials instead of two hour long theater commercials."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "braddugg",
        "review_rating": "10",
        "review_title": "Calling this film 'Terrific' would still be an understatement.",
        "review_detailed_main": "Calling this film 'Terrific' would still be an understatement.\n\nEngaging right from the word go, and shocking at the end, this film is an epitome of writing and shows that if a well-written script is directed well, then everything becomes great. David Fincher was not a great well-known when he was making this. His first film Alien 3 was supposedly panned by most people. Then, he took on directing this cold blooded murder mystery film, and boy he did the job extremely well.\n\nThe dialogues are extremely important and they have a lot of weight. It's rare to see a thriller filled with such nuances and have a deep meaning to words. The action is minimal and yet has a very high impact. The culmination or finale is a shocker. To say the least, the last 30 minutes are riveting and spine chilling.\n\nThe nearly 130 minutes film becomes highly action packed after 90 minutes. In the last 40 minutes, actually, there is a lot of dialogue that's very provocative than action. Yet. it's so very engaging that it takes me to the edge of seat each time I see this film thus, I call it as action-packed. I must say, I have seen this film multiple times, with multiple people as my viewing partners, and each time I like it more. So this film just keeps growing on me.\n\nThe cinematography is amazing and so is the editing. These two departments technically are supreme. Other departments did their job well too. Of all, it's the direction that mattered. Fincher gave us a glimpse what he is capable of with this supreme film, his next one was \"The Fight Club\" which is a cult in itself.\n\nIt's a 5/5 for a great film that surpasses time to stand out as a classic thriller. I have not named the actual supreme character in this film, so go and find out who it is and what he does."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "scarlettimogen",
        "review_rating": "10",
        "review_title": "Beat film I've ever seen",
        "review_detailed_main": "An absolute masterpiece.....simple as that.......absolutely the best film I've ever seen"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Macleanie",
        "review_rating": "10",
        "review_title": "This is one of my all time favourite movies",
        "review_detailed_main": "An incredibly dark and noir thriller by David Fincher. It stars three of hollywood's best in what is a twisted mystery with some classicly memorable scenes. Right from the off, this movie sets a tone which it continues throughout with such strong performances. This is one of my all time favourite movies."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "anderson-marques",
        "review_rating": "10",
        "review_title": "Amazing Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "m-burakyuksel-564-438070",
        "review_rating": "10",
        "review_title": "A Film Beyond the Age",
        "review_detailed_main": "When I first saw the movie, I was too young to understand the movie. Many years later, I re-watched the film. It's really a much better production than any other film that's been made in those years. Morgan Freeman once again plays an old retired citizen. Ever since I was born, he's always been old."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "bek-25198",
        "review_rating": "10",
        "review_title": "All in all, You have to see it.",
        "review_detailed_main": "I may not be a Film expert, but as a new English Learner(at pre - intermediate level) when I was 11; I first saw this movie and with the help of adolescence I was touched by it(Not like your uncle did to you).\n\nMorgan Freeman was always my man, but with Brad they made and awesome couple. I watched every Freeman Movie there is and I have to say after Shawshank, This is definitely the second movie.\n\nIf you are a simple movie watcher, not reading between the lines, do not bother. Themes between those lines are epic and so clear that it moves. well at least it moved me.\n\nHave Fun all;"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jackthepgl",
        "review_rating": "9",
        "review_title": "What's in the box?",
        "review_detailed_main": "Here I go on my mission to find the seven deadly sins in this David Fincher mystery crime thriller, Se7en. It focuses on dark and brutal themes of mystery and horror and it has that very evocative story that'll keep you on the edge of your seat whilst Brad Pitt and Morgan Freeman are witnessing the horrors of the seven deadly sins, Gluttony, Greed, Sloth, Envy, Wrath, Pride and Lust. Whoever uses those sins as motives in murders is John Doe and he cut his own fingertips so that the police and two detectives, David Mills and William Somerset won't know who killed these victims but Mills and Somerset do know it's John Doe who committed these horrible crimes. Brad Pitt and Morgan Freeman have great chemistry together on-screen to have the mystery to solve the seven deadly sins in this creepy cruel world where sins and crimes are committed including in bad weather 'cause the filmmakers wanted to make the atmosphere look gritty and dark. David Fincher has his reputation for making his films and cinematography look gritty, brutal and dark as I said in his previous films. The twist at the end is brutal, it's amazing. The box has something inside and Mills know that someone's head is inside and he says that one line that everyone knows about is \"What's in the box?\" and he has the great chase scene between him and Doe. Both of these scenes are suspenceful. I love Se7en and Se7en is an brutal and dark edge of the seat neo-noir crime thriller that will keep you invested for some mystery and thrills by David Fincher. There is another films that stars Brad Pitt and directed by David Fincher is Fight Club and I am interested in checking it out because of David Fincher's directing style and cinematography. If anybody hasn't seen Se7en, I would recommend you go watch it and if anybody who hates the film, they are totally sinned. I know that's just a catchphrase but that's just the way it is for people who hated Se7en."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "motezart",
        "review_rating": "10",
        "review_title": "Fincher's Best Film",
        "review_detailed_main": "If Fincher didn't invent the convention of the brilliant serial killer always being just one step ahead of the police, he unquestionably perfected it here. This is the twisted psychopath unleashing his vengeance upon the deserving, avaricious world at its absolute best. And this remains Fincher's best film.\n\nTwo cops in New York are hunting a serial killer. The presence of the killer is momentous even before the detectives track him down, once caught, the killer is channeled through Kevin Spacey with a disturbingly authentic evil calm.\n\nWritten by Andrew Kevin Walker, this amazing original script that was almost never made. Walker wrote it as an original screenplay around 1991. Apparently he was quite depressed at the time. New Line Cinema bought it, but it took years before it went into production Walker went to work on other projects thinking the script would never be made, but it was. It was released Sept 22, 1995. By using the seven deadly sins as the basis for justifying the killer's prerogative, the film's plot is definitely one of the best around, added to this amped up, excellent performances by Brad Pitt and Morgan Freeman, the production comes off flawlessly, but Seven is so haunting and goes down as one of the best Thrillers of all time because of Fincher's vision of a hellish New York. This world is poison and Fincher makes it seep.\n\nThe grit and grime of the crimes scenes combined with filth of the city streets, alleyways, rooftops, constantly being pounded with rain, darkness engulf even the few happy moments of the film. So much of this film's beauty is in the compilation. The sets and lighting are so complex that making Seven must have been the result of a finely tuned crew, each member bulked up on their own creative genius. It is how everything, every element aligns perfectly that makes Se7en such a phenomenal filmmaking achievement.\n\nMore at getthebonesaw.blogspot.com"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "KingBrian1",
        "review_rating": "7",
        "review_title": "Good movie",
        "review_detailed_main": "Seven is an extremely good crime thriller. Brad Pitt and Morgan Freeman are really good in this movie. The movie is really dark with many effective scenes in the movie. It is like the director is going out of his way to make the viewer queasy. All in all it is a good movie if a bit dark for my liking but the characters are good and the narrative is also worthy of respect. It is a blend of crime, horror and Thriller movies and shows and in some respects it is a foreshadow to the CSI series that now are all over TV.\n\nGreat performance from Brad Pitt in this movie. The gritty feel of the movie is also very realistic."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Finntroll",
        "review_rating": "",
        "review_title": "Dark masterpiece of the genre.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "onerslnt1",
        "review_rating": "1",
        "review_title": "Why do people watch this movie?",
        "review_detailed_main": "I always take the trouble to write an IMDb review when I think a movie is too horrible to watch - the good ones, I am sure people can find them without me.\n\nThis movie is rotten to the core. It does not entertain a sensible mind. It does not uplift. It has not humor, no fun, no moral. It is morbid, depressing, meaningless. But it is not meaningless like, say, life. Life's meaninglessness has a depth, it is somber. The meaninglessness of this movie is like a small child killing a white rabbit - wanton, senseless, rabid.\n\nWhat did you learn from this movie? What did you enjoy? What moved you? Nothing unless you admire gore and violence per se. Yes, the acting, especially of KS, was superb. But I do not see any glamor in superbly acting the part of a mad killer. The mad killer can do it himself.\n\nAnyways, I am rambling; but after a movie like this, you are at a loss for words. You wonder what kind of people spend a million dollar on a movie like this. You wonder what kind of people go to watch it. You wonder, most of all, how someone can enjoy spending money on this rather than giving some money to, whoever."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "diegoalcivar",
        "review_rating": "10",
        "review_title": "Disturbing Masterpiece",
        "review_detailed_main": "Maybe one of the best movies of the 90's. The work done by Fincher and Khondji and the atmosphere they created is just outstanding."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "dudov-61967",
        "review_rating": "10",
        "review_title": "THE GREATEST ENDING OF ALL TIME!!",
        "review_detailed_main": "This movie is so disturbing and that's why I absolutely adore it"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "evancartin",
        "review_rating": "10",
        "review_title": "Vile and exceedingly wicked",
        "review_detailed_main": "This film truly haunts with its darkness. The crime at the end of the movie is shocking and full of chaos. I couldn't have guessed that the villain would do something so wicked. The ending is truly haunting, but that's what makes it intriguing. This film is the true definition of a thriller. Se7en doesn't play around with excessive philosophy, but instead presents extreme and terrifying nihilism. Director David Fincher successfully creates a terrifying atmosphere that surpasses the supernatural. It's a horrifying nightmare of terror, and its mystery holds the audience until the end. Despite being incredibly frightening, this film shows no mercy for a cruel world. I don't support nihilism in this film, but I see it as an extraordinary work. Without Fincher's chilling touch, this film wouldn't succeed. The screenplay writer is also remarkable, as they manage to present morally unsettling questions from beginning to end. It is relevant to the horrifying real world."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Sonic_Ocean",
        "review_rating": "10",
        "review_title": "Se7en is a beautiful film and worth watching. I agree with both parts.",
        "review_detailed_main": "Getting into the film noir genre was probably one of the best things I've done for myself as a person who loves film. Deep, moody stories all the while being stylish and evoking a despondent atmosphere are definitely my type of movies. Movies that ask important questions of us dealing with our humanity or depicting the ugliest parts of the human psyche that is disturbingly relevant to our modern society shows that movies are more than just mere entertainment. This is everything that makes Se7en a great movie, in my opinion.\n\nI could go on and on about the film, but first I have got to talk about the atmosphere that makes the movie so effective in many ways. It is just pure grit and grime and I love the film's consistency in its tone. Not just through its sets, but also the color tones that were used to enhance every scene makes each scene moody and ominous. These aesthetics definitely make for a lot of great cinematography and there is quite a number of memorable shots in the film. A key scene for me would be all the scenes taking place in the library, which are definitely some of the most beautiful cinematography I have seen in film thus far.\n\nWhat also makes Se7en stand on its two feet are definitely great performances from Morgan Freeman who makes each movie I've seen him in have depth and character. While Freeman delivered a performance to compliment the film's story, Kevin Spacey was definitely the one to steal the show. To deliver such a disturbing performance that elicits just as much fear as watching Hannibal Lecter on screen was a feat that I didn't even know could be accomplished. I was holding my breath in every scene he spoke to another character. He was that captivating in his acting performance.\n\nI don't know what else to say without spoiling this great movie, other than that anyone who is a fan of the noir genre or just a person who enjoys a good story should definitely watch Se7en. The film is so good that I had to include this on my personal list of my top favorite movies of all time. A pure classic in every way."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "MarieGabrielle",
        "review_rating": "10",
        "review_title": "Perfect and consistent theme, amazing cast....",
        "review_detailed_main": "This film has many indelible moments, an amazing cast: Morgan Freeman as Detective Somerset is impressive and real. The Charlie Parker soundtrack with the blues sung by Billie Holiday \"I Cover the Waterfront\" captures the dark mood and underlying violence which exists in the city. Being from New York, the street scenes at night are 100% accurate, executives, harried workers, hookers and dealers all intermingle in a pastiche of chaos.\n\nWe see the early scene where Freeman first meets novice detective David Mills (well portrayed by Brad Pitt) and he asks him what NYC homicide is like, and won't agent Somerset regret retiring? Freeman answers tiredly ...\"I am moving....anyplace...far away from here\"...\n\nSloth, Greed, Lust, Pride, Envy, Gluttony, the seven deadly sins as proclaimed since Medieval era. Each murder is precisely carried out. John Doe is creating his masterpiece, an artwork of perfect murder. Kevin Spacey is superb as John Doe. His presence and diction are cutting and menacing. I would love to see him in more of these roles. The quote from Morgan Freeman at the end of it all resounds true: it is the quote from Hemingway. The theme is \"ask not for whom the bell tolls, it tolls for thee\"....Everyone is affected by violence. Best thriller and suspense, other than Hitchcock. Kudos to David Fincher and the cast The screenplay is amazing, I have bought that as well as the DVD. Highly recommended. 10/10."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "maxwell-364",
        "review_rating": "8",
        "review_title": "Genius in concept and execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "bcr43",
        "review_rating": "9",
        "review_title": "1, 2, 3, 4 . . . Anchored.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "brianberta",
        "review_rating": "8",
        "review_title": "One of the best crime thrillers ever made",
        "review_detailed_main": "This is one of the most horrifying movies ever made. But it doesn't just consist of violence. It has amazing performances, tense scenes, and a nail-biting finale which you won't ever forget for a very long time.\n\n2 detectives try to hunt down a psychopath as he kills people in grotesque ways based around the seven deadly sins.\n\nThis movie contains several memorable scenes which have the tendency to knock you off guard. Besides the ending, another amazing scene is when they investigate the sloth victim. The gore is amazing but we get the jumpscare of our lives in it. I'm not going to spoil it though because otherwise I'll ruin it. Many people will agree that the ending is the best part by far. It is tense and suspenseful and it is completely unpredictable. It is one of the most memorable movie endings by far.\n\nAlso, the acting is amazing also. In my opinion, Kevin Spacey and Brad Pitt both give one of their best performances yet. Morgan Freeman's also gives as amazing performance and it is rivaled only by his performance in The Shawshank Redemption.\n\nThe acting worked real well because this movie did a great job with its choice of casting. Fincher probably looked at previous works of Freeman, Pitt, and Spacey's roles and he knew that they would be perfect for these roles and his casting choices really paid off.\n\nAs much I want to give this movie a 10, there are a few scenes which I felt carried on a bit too long or were more slower-paced than the rest of the movie. There weren't too much that bothered me too an extensive degree though. However, I do think that this would've been a masterpiece if it weren't for those few scenes.\n\nNobody thought much of Fincher when he directed Alien 3 and he was originally dismissed as just another style over substance director. However, he looked at the mistakes that movie made and he showed moviegoers with this movie that he is a talented director. Since then, he has made several more amazing movies (especially Fight Club) and he is now one of the more appreciated directors working today.\n\nIn conclusion, Se7en is a near perfect movie. Sure, the pacing can be a bit slow at times but this is still an amazing crime drama and I think that this is one of the best crime movies ever made. It will keep you on the edge of your seat the entire time and it contains one of the best finales to a movie ever. I understand why some people disliked this movie but none of the reasons affect my opinion of this movie and I think that it is a must-watch for everyone as long as you don't mind realistic violence and gore."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "firefalcoln",
        "review_rating": "7",
        "review_title": "Good, but not very good IMO",
        "review_detailed_main": "First off let me say that the direction and acting is very good. I don't recall having any major complaints and can't recall many minor complaints. To me this film just didn't have a 10 out of 10 script which is why I give it 8 stars. For me, the story is the most important part of just about every film. This movie's story was very good for the most part. However I had 2 big complaints. 1: for the first murder, they mention receipts for the food he bought. They mention that there was food bought twice the same day. Why didn't the cops investigate the store on the receipt and see if there was any video footage from either/both purchases? 2: I was able to predict the end right before it happened, which really is less than ideal when it was clearly meant to be a shock. I might have ranked the film higher if I hadn't just watched: Witness for the Prosecution. And that film pulls off the surprise ending better and more dramatically than just about any other film. So I had a high bar of expectation prior to seeing the film and I had really high hopes for 7, seeing how it has an 8.6 ranking. I think following my viewing i won't leave as a fan or hater of the film. I managed to see a lot of impressive components in the piece, and it's still well worth a viewing if you can handle the disturbing content. And maybe I was a rare case in predicting the end."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "chugs-1",
        "review_rating": "1",
        "review_title": "A stupid film for stupid people",
        "review_detailed_main": "The film is for children, needing to be spoon feed every ten seconds the next step, victim. Like most crime films the writer/director feeds the view just enough information to avoid giving away the story even when such restrictions are illogical and unrealistic.\n\nThe film is utterly disconnected from the realities of a major criminal investigation. We're expected to believe that NYPD would assign only two homicide detectives to what is clearly a serial killer.\n\nIn the real world dozens of detectives would be assigned. The FBI bought in. Crime scenes would have their lights turned on (instead of the melodramatic and never ending use of torches), and instead of following like hansel and gretal the crumbs the killers has left them they would be following real leads.\n\nCanvesing, obtaining the CCTV's surrounding each victims house for several blocks. Establishing a when the killer was there and working out where he came and went to. Like another review mentioned we are asked to believe that this killer makes absolutely not a single mistake and that no one has ever seen him.\n\nHowever the films great crime is the belief, even after his home base and money is found, that killer continued to kill and work with nay a concern for being caught.\n\nIts utterly ridiculous and anyone who can watch this film without realising its utter crap is utterly deluded.\n\nEven most of the I hate it Reviews on IMDb complaints are banal and vexatious. Subjective things like tone, narrative and photography are well personal choice you either like em or you don't but they in themselves don't make the film good or bad.\n\nA good intelligent film treats the viewer with respect.\n\nLastly the constant ripping on Silence of the Lambs (there are several comments in the film that refer to SOTL) when this film is far more of a marketing puff piece is an utter joke.\n\nI've deleted this film, and refused to even watch the much vaunted \"twist\". That in itself so utterly illogical and stupid part of the plot that its not even worth discussing."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "bakwas-duniya",
        "review_rating": "9",
        "review_title": "Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "PredragReviews",
        "review_rating": "9",
        "review_title": "\"It seems that envy is my sin.\"",
        "review_detailed_main": "Seven is a very disturbing thriller about a serial killer,John Doe (Kevin Spacey), killing people via examples of the seven deadly sins - gluttony, greed, sloth, lust, pride, envy and wrath. The story begins with Detective Mills (Brad Pitt) being assigned to Detective Somerset (Morgan Freeman). Detective Somerset is due to retire at the end of the week, and Detective Mills is moving up in the world, and is to take Somerset's place. This is a very disturbing movie. It will keep you enthralled and glued to your seat for the entire 127 minutes. Indeed, I was staggered that I never once lost concentration or was bored with this movie.This is a movie with an unexpected ending that is absolutely unpredictable and which is not at all a \"Hollywood\" style ending. \"Seven\" is symbolic of several things in this film: Of course, the seven deadly sins (Gluttony, Greed, Sloth, Lust, Pride, Envy, Wrath) are the killer's inspiration; Somerset has only seven days to retirement and he was given this assignment as his final investigation; seven is the also the amount of days that transpire between the beginning and the ending of this case; and seven are the amount of victims that are at John Doe's mercy in that time span.\n\nGwyneth Paltrow portrays Mills' wife Tracey, and there is a certain sadness to her character, something she reveals to Somerset one day while they are having breakfast in a diner. Even though her role is not one that is major throughout this movie, she is a crucial element that plays itself out in the climax of the film. One of the most haunting ironies I find in Walker's script well portrayed by Fincher's cast is the uncanny similarities between John Doe, the antagonist and Somerset, the protagonist. If you watch that one scene in the car, you will realize that Somerset agrees with Doe, yet although realizing that their consensus does not justify Doe's irrational, yet seemingly rational killings. With Doe's philosophy explaining his intolerance for the prevalence and trivialization of the deadly sins, Somerset's continuous argument that we are becoming too apathetic of a society, only motivated by such things such as our temptations and self-indulgence, there is admittedly a strong parallel that exists between the two characters. Yet, they stand opposed to one another, because while Somerset, although discouraged, managed to keep his faith in mankind, Doe did not, and could not tolerate the injustice any longer. The film has some gory and graphic scenes that might turn some weak stomachs, but it has everything you'd want from a thriller: mystery, suspense, a great plot, great acting and a great, shocking and surprising ending.\n\nOverall rating: 9 out of 10."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: It will be Eighth Sin not to Watch This!!",
        "review_detailed_main": "Se7en. An unpredictable serial killer plot, the great storytelling of ace director David Fincher, performed by always reliable Morgan Freeman, star actor Brad Pitt and if it was not enough Kevin Spacey who does not how to do bad acting, all these give you one of the darkest and chilling thriller of all time. From the word go, you find yourself solving the case with two detectives played by Morgan and Brad. At one moment, they are very near to solve the case and then everything is turned upside down with a heartbreaking climax. Another movie that comes this close to perfection in serial killer plots is another David Fincher classic Zodiac. Gwyneth Paltrow as Brad's wide does well in her small part and provides lightness to otherwise heavy setup. Se7en although questioning the morality still maintains the good side of morality. I am going with fantastic 8 out of 10 for Se7en. You will enjoy it best when seen in total silence or undisturbed environment. If you love to be thrilled, then don't miss it!!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Terno720",
        "review_rating": "8",
        "review_title": "Great film - would recomend",
        "review_detailed_main": "The set design in the film was amazing. I Would have to say is is probubly the best sed desigh I've seen or at least my favourite. The story is also really good it keeps you engaged and curious. for acrime film its done In a different way than I'm used to, I'm used to the new age crime cop movies and this is done a lot better. The crimes are sick and twisted but they are key to the story and moveing it forward and very well thought out and purposeful.\n\nAlso the shots and cinematergraphy are so beautiful and well framed."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "JinZhiQiang",
        "review_rating": "10",
        "review_title": "*CONTAINS SPOILER* A must see film for any type of viewer.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "romanrock-48568",
        "review_rating": "10",
        "review_title": "Se7en: detective with the best ending",
        "review_detailed_main": "Se7en is an absolutely incredible movie in its genre, one of the best movies directed by David Fincher. The movie is about detectives who investigate crimes based on the 7 deadly sins.\n\nLet's go through all the points to adequately rate the movie:\n\n1) Plot - I give 1 point to the movie for its idea. The theme is quite off-the-beaten-path, especially in 1995. At that time, I'm sure, \"Se7en\" made a real sensation.\n\nThe second point goes to the movie for the smooth development of the plot: from incident to incident the heroes get more and more buried in the investigation, and each next crime is tougher than the previous one. Dialogues are also worth mentioning: they are perfectly written, meaningful, and there is no sense of any naïveté.\n\nThe third point is definitely for the logical ending. Nothing is broken - neither chronology, nor the original idea. The scenes ending the movie fit perfectly into the general plot and logically conclude it.\n\n2) Actors' performance - the actors have a psychological correspondence with the characters. The main actors played their roles admirably: Morgan Freeman and Brad Pitt showed the highest skill. They are really unconditionally believed throughout the entire timeline. Kevin Spacey also coped with the role 100% - moderately calm and cold-blooded, moderately cunning, moderately painful. Also +1 point.\n\nOne more, already the fifth point should be awarded to the movie for the stunning appearance of the characters. Each character corresponds to his clothes, behavior, atmosphere in the scene. As an example we can cite one character from the very beginning, this image is so memorable that it even found an echo in the music industry: German band Rammstein re-shot this scene for their Haifisch music video (2009).\n\n3) The music - not much can be said about this one. It is concise, keeps the tension at the right moments, and otherwise skillfully accompanies the awesome video. A well-deserved sixth score for the movie.\n\n4) Visuals - a lot has been said in the paragraph about the actors, and now we should mention their surroundings. All the sets, makeup, lighting, color correction - everything fits perfectly with what's going on. The movie is moderately dark, and this is to its advantage. The seventh point in the piggy bank.\n\nThe camerawork is marvelous. The angles, framing, shooting of dynamic scenes are flawless. The editing does not strain, the frame does not shake, there is a clear understanding of what is happening. There are also a lot of incredibly atmospheric scenes in the movie. +1 again.\n\n5) The finale - oh, it's an absolute masterpiece. It is unpredictable, until the very beginning of the denouement the viewer has no idea what the antagonist's plan is. It shows a very emotionally powerful scene where the mind confronts the animal's anger and feelings. For the unobvious denouement I give the movie 2 points at once.\n\n10 out of 10\n\nWell deserved. Undoubtedly."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ipekmine",
        "review_rating": "9",
        "review_title": "One of the most successful movies of its kind",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "justahunch-70549",
        "review_rating": "7",
        "review_title": "Solid",
        "review_detailed_main": "Took a look at this again after 27 years. While the whopper of an ending has stuck with me, I recalled little else other than that I wasn't super impressed by this back then and I think a lot of that had to do with my then not very high opinion of Brad Pitt. It's a well made, unusual, sometimes gruesome serial killer crime story about with a solid performance from Morgan Freeman. I always had a problem with Pitt when he was young in that I didn't think he was all that great of an actor. I still have some issues with him here, but he's better than I remembered and has some moments that are interesting. This was a big year for Kevin Spacey with this and The Usual Suspects, but it's hard to look at him now in this creepy role that he plays so perfectly. Seems a lot of people on here love this good movie."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "MatiaseK",
        "review_rating": "",
        "review_title": "damn, if I was a psycho, this film would only motivate me!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jerrylb",
        "review_rating": "1",
        "review_title": "Words cannot describe the unmitigated nastiness",
        "review_detailed_main": "I know there are many reasons to like or dislike any movie, and that most people who rate a movie 1 or 0 simply don't 'get it'. I feel a great sympathy for those who cannot find anything to praise in a film. Se7en is not an especially bad movie; it creates and maintains a particular atmosphere most of the way through; it is deliberately grungy, nasty, and brutal. The extreme lack of lighting serves a purpose - Marlon Brando in Apocalypse Now seems bathed in floodlights by comparison - and the film achieves its ends efficiently enough.\n\nI am relatively OK with gore and violence (either on-screen or implied.) Many plots have holes, many movies get very clunky at the end, many actors share features with cardboard, and Se7en is no exception. If this film were in any way critical of the human capacity for the sheer unbridled brutality which it portrays, I might forgive it. If it had any redeeming qualities whatever, I like to think I would be prepared to try to acknowledge them, however grudgingly. Many dark movies manage to evince a knowing smile at some point, or succeed through technical brilliance or gripping acting.\n\nBut I came out of this film wanting to throw myself under the nearest bus. It was as if everyone involved with the making of this film had spat (I think I spelled that correctly) in my seat. My experience of this film exactly matched that of another reviewer: it raped my soul. What worries me most is that there are quite so many positive reviews for this movie. I think this would have been one of H.P. Lovecraft's favourites, since the guiding hand behind it is most obviously that of Cthulu."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "utkarsh-00205",
        "review_rating": "8",
        "review_title": "Great Psychological thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "dnarayan",
        "review_rating": "9",
        "review_title": "Meaningful serial killer movie",
        "review_detailed_main": "one of the best film about serial killer... Meaningful movie,Although the story isn't original, it's powerfully directed by David Fincher, The investigation and the clues that lead to the murderer are well thought out and continually provocative. As a narrative, the film is quite involving.The Morgan Freeman gives another of his superbly understated performances. Decent film making, universal subject, overall good performance, David Fincher is at the top of his form with Seven, one of the darkest, creepiest, and most brilliant serial killer pictures in American film history, far more interesting, handles the violence with sensitivity, announcing its obscenity in spoken analyses and briefly glimpsed post Morten shots, but never showing the murderous acts themselves."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ryklinker",
        "review_rating": "8",
        "review_title": "Two homicide detectives must track down a serial killer who uses the \"Seven Deadly Sins\" as his guideline for his killings",
        "review_detailed_main": "Detective William Somerset's years as a homicide detective have come down to their last seven days. He has closed many a case, and we meet him as he encounters his last Young Detective David Mills has just transferred to the local police force as Somerset's replacement, and he shooting from his hip as soon as he walks into the first crime scene. Local police have found an extremely obese man dead in his house, and after a few minutes of investigating, the initially believed cause of death, brain hemorrhage, is soon replaced with murder. The two detectives conclude that the victim was forced to eat by his killer, and then kicked in the stomach. This is but our first taste (insensitive pun unintended) of the sick world that this story takes place in. Within 24 hours of this, a top-notch attorney is found dead in his office, and the word \"greed\" written into the carpet. On an inquiry of the first victim's apartment, Somerset finds the word \"gluttony\" carved into the wall behind the fridge. It does not take Somerset and Mills to realize that this unknown killer is systematically murdering his victims using the themes of the Seven Deadly Sins, which are: gluttony, greed, sloth, lust, pride, wrath, and envy. With the identity of the killer, and 5 more victims helplessly unaware of what is to come, detectives Mills and Somerset must find their man, and navigate the dark world that surrounds them.\n\nIf the first murder wasn't an obvious clue, this is a dark movie. The \"gluttony\" victim, and all of the other victims for that matter, is brutally executed, and most of the grisly remains are what we see. Though we do not see the murders themselves, there is little left to the imagination. In this aspect, this luridly-themed film took me to my limit, and perhaps past it. I would like to think that I can handle just about anything that a camera can show, but this film proved me terrifyingly wrong. Putting the murders aside, this film was very well put together. Freeman does a great job of playing the \"old vet\" archetype, and Brad Pitt as the young rookie is a well-cast role. Kevin Spacey as our \"John Doe\" makes the antagonist utterly sickening, which is exactly what director David Fincher wanted. From a cinematography standpoint, the film was well-shot, and the editing (Oscar-nominated) was very well done. I will leave you with a few key points that I feel I must emphasize. As a devout Christian, I found the killer's system very appalling, and I dearly hope that the public does not associate this with any Christian value. In case you did not pick this up in my previous notes, this film is DARK. I myself had to watch through my fingers at times, and I have no doubt that any future viewer will as well. The language in itself is R-rated, and it just adds to the dreariness. In his review of this film, the late film critic Roger Ebert began by saying \" 'Seven,' a dark, grisly, horrifying and intelligent thriller, may be too disturbing for many people, I imagine, although if you can bear to watch, it you will see film-making of a high order.\"\n\nThe thrills did thrill, and the horrors did horrify, but I found it too far exposed. Though Fincher is known for his dark portrayal of life (Fight Club, I'm talking about you), this film took it past my favorable level.\n\nwww.sportsandcelluloid.blogspot.com"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "urema-1",
        "review_rating": "9",
        "review_title": "Character development clinic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "sebbystone1",
        "review_rating": "9",
        "review_title": "Dark, compelling, and utterly heartless, Se7en is a slow yet disturbing thriller burned into movie history",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "lastliberal",
        "review_rating": "9",
        "review_title": "Yeah, a landlord's dream: a paralyzed tenant with no tongue.",
        "review_detailed_main": "There is no one who could argue against the fact that if you put Brad Pitt, Morgan Freeman, Gwyneth Paltrow, and Kevin Spacey together in a film, it is going to be a hit.\n\nI have watched countless hours of murder mysteries in movies and TV and have read innumerable books, and there is no finer murder/serial killer story than this one.\n\nIt has every element that one would look for in this type of story and it delivers with a punch to the gut that is visceral and lasting.\n\nThis is one of those films that you can watch countless times and never tire of."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "richuk-98954",
        "review_rating": "8",
        "review_title": "Se7en - A great story, but very violent.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "TheSilentBlur",
        "review_rating": "10",
        "review_title": "You Will Be Thinking About This For Days (Really, you do)",
        "review_detailed_main": "The 7 Deadly Sins: Gluttony. Greed. Sloth. Envy. Wrath. Pride. Lust.\n\n\"Se7en\" is definitely a movie no one will forget after watching it. The story follows two detectives: Somerset (Morgan Freeman) and Mills (Brad Pitt) tracking down a serial killer who murders his victims according to the seven deadly sins. Seriously, this movie kept me at the edge of my seat the first time watching it. I was too young to see the movie when it came out in 1995, but I managed to watch this on DVD just recently. This movie is told from the point of view from the detectives, trying to find the motives and reasons why the killer is taking out random victims. We see them in a frustrated situation (Brad Pitt's character is a fine example of this along with his F bomb dialogue).\n\nThe performances from the cast are superb. The majority of the film focuses on Morgan Freeman and Brad Pitt's chemistry - how their relationship builds up as the two are desperately trying to solve the case. Gwyneth Paltrow is placed third in the top billing as Detective Mill's wife - a woman who loves her husband but has a dislike for living in the terrible city they live in. Her performance sells, but I feel she did not have enough screen time.\n\nThere is one other actor's performance I really want to talk about. But I can't. You'll have to see the movie for yourself and you'll know who I am referring to.\n\nThe movie never fails to lose your interest. You are invested in these characters solving a murder mystery that is (to them) not common, yet very disturbing. Each kill has been done off screen, and we are left to our imagination of how each murder went down. What we don't see is much more effective than if we do see...And I believe director David Fincher has done a great job at this. There are plenty of twists and turns throughout, and it's executed unexpectedly which works for this kind of film.\n\n\"Se7en\" was a movie ahead of its time. I can't imagine what would it be like had the film been made in let's say 1989-90. Definitely recommend this thriller if you're into surprises. Even on repeated viewings it's still a thrill to watch and look out for things you may have missed in the first time viewing."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "DVR_Brale",
        "review_rating": "7",
        "review_title": "Philosophical inquiry about human nature packed as a criminalistic mystery thriller",
        "review_detailed_main": "Why is Se7en so good? Well, one of the reasons is because it was directed by none other than David Fincher who is well known for his perfectionism. Other reasons include amazing cast and interesting concept with religious main premise. Morgan Freeman, Gwyneth Paltrow, Brad Pitt and one I won't mention because Fincher decided to kip him as a surprise all delivered amazing performance. How can you not like Freeman's relaxed and gentlemanly attitude (he loves books) as opposed to Pitt's sort of angry and action type character (he loves chase)?\n\nDo you think that people who commit deadly sins deserve to live? Of course you do, but this serial killer doesn't. He thinks that the world is better without them. Theologically speaking, deadly sins are called deadly because they have been identified as a root cause to other sins and separateness from God. As a result, one who commits one of those, shall find nothing but darkness in his life and will eventually loose capacity to be happy. If one doesn't want to end like that (spiritual death) one has to firstly turn away from his sin, ask God for forgiveness and then expiate his sin. This serial killer is not merciful. He positions himself as a god who doesn't forgive or give chances to turn away from them. Since spiritual death is a final result from consistently committing deadly sins, this serial killer delivers physical death by murdering his victims in a way that particular sin harms them. He had given himself a right to deliver justice; but justice without love becomes cruel.\n\nAfter this short theological reflection let me now turn my attention to detectives Somerset (Freeman) and Mills (Pitt). As I mentioned earlier, they stand opposed but somehow complement each other. Together they discover frightening and bizarre murders and react in a way specific to them. This is important when you consider the ending. Everybody knows Se7en has one the most shocking ending ever made (other being Requiem For a Dream). Since committing deadly sins influences character as well (not only spirit), carefully watching both detectives actions ads to your understanding of Se7en. This movie is not about chase or little evidences analyzed by technology; it's about seeing people behind the mask, the way we truly are. That's at least what I think.\n\nSo why did I give Se7en a symbolic seven? I don't have any particular reason. Se7en just lacks that something some other movies have. Apart from being shocking, it didn't stick with me. It's predictable as well, but it seems to me that Fincher decided to make it that way on purpose. We know what is going to happen and that gives us more \"space\" to focus our attention on characters and the way they'll react and not on story itself. Soundtrack could be somewhat better as well. Se7en also lacks that noir feeling that would've made it better.\n\nSo to conclude: Se7en is a shocking and cleverly made movie with great cast. Underneath the hub is a lot of material for reflection about human nature. Those of you more philosophically oriented are surely going to enjoy this one or should I say seven."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "liviu_e2006",
        "review_rating": "",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "reddragon-hl",
        "review_rating": "4",
        "review_title": "A Good Movie Ruined By Its Ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "kahfner",
        "review_rating": "10",
        "review_title": "Se7en",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "caitlinmalone",
        "review_rating": "8",
        "review_title": "Excellent Movie",
        "review_detailed_main": "David Fincher reveals a masterpiece of a movie in his film Seven. The movie follows the process of two detectives, Somerset (Morgan Freeman) and Mills (Brad Pitt) as they attempt to track down a serial killer (Kevin Spacey) who is choosing his methods and victims based off of the seven deadly sins. The film is high quality for two main reasons: its complex characters and its moral commentary.\n\nThe most intriguing character is easily John Doe, the killer. Rather than creating a stereotypical mindless killer, Fincher makes Doe a serious, soft-spoken man, whose power comes from his brain rather than his brawn. Doe is extremely logical and methodical in his approaches, as his killings require intense planning. His character poses as a striking contrast to Mills. Although he is the \"good guy\"-the cop, the detective, the one trying to stop a killer- Mills is not likable. Unlike Doe, he raves and constantly shows frustration, and often reverts to physical violence to try to accomplish his mission. Although the watcher probably will still root for Mills, when Doe speaks, they will be more apt to listen. Somerset serves as the voice of reason, reeling in Mills when necessary and respecting Doe's genius as he tries to catch him.\n\nThese characters, especially John Doe, perfectly display the film's social commentary on the seven deadly sins within our culture. More importantly, they raise the moral question of what is evil, and what is good. There is a clear clash between good and evil within the film, but the reason it is so successful is that it makes the audience ask themselves questions. Are evil people able to be victims? Is society harming the killer or did the killer harm society? What is a just price to pay for evil doings? Therefore, I highly recommend Seven to anyone who is not too squeamish and who enjoys a perplexing film that will leave you thinking. I enthusiastically endorse this film with an \"A\"."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "BenjaminPopkin",
        "review_rating": "9",
        "review_title": "Amazing Film",
        "review_detailed_main": "Se7en is a 1995 Crime/Thriller directed by David Fincher that stars Brad Pitt and Morgan Freeman as two homicide detectives on the hunt for a serial killer who is committing various dark and gruesome crimes based on the Seven Deadly Sins. This movie is very well filmed and tells a haunting yet realistic story. In the sense that there could be a serial killer who does things like this in real life, because nothing is too extraordinary in the film to the point where it's not possible; so, that's what makes the brutality of the crimes so impactful and horrific.\n\nThe film has great direction by Fincher. The movie does a good job at keeping you interested throughout. It is written well and Brad Pitt and Morgan Freeman really bounced off one another. I was surprised with their chemistry on screen because I have never seen them together like this in a film before.\n\nThe films aesthetic throughout the runtime is dark, gritty and filled with dread through the use of production design, composition, color and cinematography. The colors in the film were always murky. Stylistically the film is beautiful in a sick way with how Fincher manipulates what's on the screen and how it's on the screen. Although, there were times in the movie where I didn't even want to look at the screen, but there were also times where Fincher doesn't even need to show us and we still know something horrifc is on the other side by the way it is suggested through the mise-en-scene. (The Lust sin in particular). There is a clear vision that is being executed. However, the focus is not all on the violence, but on the setting and the people as well. The characters all have depth and they feel like real people that we have to spend time with. The scene with Pitt, Paltrow, and Freeman having dinner together is an example of one of these scenes we get that are character driven. The setting is constantly shown off through the mise-en-scene.\n\nOverall, I thought Se7en was an amazing movie. I thought it was written well. There were some great dialogue scenes in the middle of the movie as well as the end. The end was really good one of the best parts of the whole movie. The entire third act is pretty insane to be honest. It was very well written and executed; totally had me on the edge of my seat the whole time. The cinematography, writing, acting, and direction were all very well done. The film was disturbing and gritty yet in a way very real which makes it all the more shocking and the climax is one of the best I have seen in a while. I really liked it and I recommend checking it out especially if you're into darker movies."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "dblegendsdragonballs",
        "review_rating": "10",
        "review_title": "Superb drama",
        "review_detailed_main": "David Fincher's bleak, relentless, and ultimately terrifying crime thriller Seven transcends other films of the genre with incredible plotting (the sort Hitchcock might employ were he alive and making films in the 1990s) and scalding intelligence. With only a small handful of minor flaws -- the overly familiar retiring cop/young cop pairing; the awful \"I'm taking you off the case!\" cliche seemingly required by the genre; one giant lapse in logic in the downward spiral toward the conclusion that cannot be revealed without ruining the script's gruesome surprise -- Seven typically keeps its viewers imprisoned in their seats with a combination of morbid fascination and abject fear."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "danrutnut",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "I saw this film in an empty cinema with a mate and I came out with chills, Kevin spacey plays his role amazingly same as Morgan freeman and Brad Pitt and could watch this film over and over and it would never get boring! The effects are also amazing the tone of the films is bleak at times but I like that in films so this one is definitely highly recommend!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "TheAll-SeeingI",
        "review_rating": "10",
        "review_title": "Real-World Scary",
        "review_detailed_main": "Put your goblins and monster films away: This one's based on the horrors humans commit, and therefore hits home in a real-life way.\n\nThe performances are incredible. Before Kevin Spacey's behavior got him \"canceled\" by emerging societal trends, he proved himself with films like this one that's a generational actor.\n\nPitt and Freeman also deliver elite performances in a film that's thrilling, mysterious, and ultimately in the Pantheon among the greats."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "apr-407-799961",
        "review_rating": "9",
        "review_title": "Great direction for a great story",
        "review_detailed_main": "Seven is a superb suspense thriller. The movie is binding with stellar performances by all the actors. Brad Pitt in his portrayal of a detective who is impatient with his partner is perfect , so is Morgan Freeman calm and calculated and , Kevin Spacey the serial killer who thinks his killings are justified .Gwyneth Paltrow also is brilliant playing a wife full of hopes.\n\nThe seven deadly sins are not a monarchy to anyone , each one of us in a way is affected and how deeply rooted they may be even in good people keeps us thinking long after the movie is over. The story telling is great and so is the direction , a must watch."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "buschboy5",
        "review_rating": "8",
        "review_title": "This Movie Is a Pure Psychological Roller-coaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "alibrahim1",
        "review_rating": "7",
        "review_title": "Ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "NoArrow",
        "review_rating": "",
        "review_title": "Cool, stylish, but still sad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "musicallyrt",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ferssantos",
        "review_rating": "10",
        "review_title": "The Perfect Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "avisheksahu99",
        "review_rating": "8",
        "review_title": "Vendetta of Numbers",
        "review_detailed_main": "Numbers sold exotic are numbers made not eternal over dispensability inbuilt in rates by dispensability of labour deemed superficial thereby unless boring jobs of taxation do not incorporate labour in the commissioning of numbers as identity to make survive as unreferenced unless referenced in deals of the day keeping nobody over the other unless number defining position in deals is linked indispensibly to other numbers over work undertaken together to keep number loner in disguise for numbers on the loose under threat of no redemption thereby. When number is experience linkages are dreary, when number is riot linkages are weary, when number is style linkages are teary, for a number deleted is deleted nowhere when etched on paper somewhere to keep numbers recorded as identification of departments etched on concrete still."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "payameskandare",
        "review_rating": "10",
        "review_title": "very good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "isaiahwilson15",
        "review_rating": "9",
        "review_title": "Se7en: One hell of a creepy movie",
        "review_detailed_main": "Se7evn once again proves David Fincher is the master of composing a story that perfectly balances drama with suspense, and it then finished off with an excellent twist ending. Major credit also goes to Andrew Kevin Walker who creates a story that is creepy, compelling and above all original. The progression of Se7en is significant as it starts out with an insignificant investigation that evolves into an extremely intense encounter. The movie keeps a good pace whether it's giving the reader time think through what's happened or forcing them to predict what's going to happen. The constant chase makes for a great movie pace, which is further enhanced by the detective duo. Brad Pitt and Morgan Freeman are perfectly cast as Detectives Somerset and Mills. The progression of the relationship between the two characters is done perfectly as the viewer sees the ups and downs both characters go through. The introduction of Tracy then introduces a huge wild card, which has a huge impact on the mentality of both characters as well as the ending. Se7en's villain John Doe is what ultimately makes this movie. The brutality, as well as the meaning behind each of his murders, is both fascinating and disgusting at the same time. The scene where Mill and Somerset question Doe as they drive to the location of the final two victims is the best scene of the film. Doe finally reveals his motives behind his murders that while they are rather disturbing, do actually make sense. The creep factor of Se7en is comparable to that of a scary movie. It's frightening visuals, themes, and the villain makes the movie much more suspenseful and frightening than many would expect. However, its the relatable characters and setting keep the movie grounded. Top that all off with one of the best twist ending that leaves the viewer jaw dropped throughout the credits, and you get one of the best thrillers of all time."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "thesouthfamily2-552-707097",
        "review_rating": "10",
        "review_title": "\"People will barely be able to comprehend it, but they won't be able to deny it.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "dionnevdnat",
        "review_rating": "8",
        "review_title": "Review on seven",
        "review_detailed_main": "Are you afraid of the deathly sins? By Dionne van der Nat, Floris van Hoogdalem and Myrte Tjoa\n\nThis review is about the film 'Seven', directed by David Fincher. The film is set in 1995, the year in which the movie was released. In which city the film is set, is unclear and unmentioned in the film. The two main characters, detectives Mills and Somerset are played by Brad Pitt and Morgan Freeman. It is a thriller which is very well directed and acted.\n\nThe film se7en is about two detectives who try to solve a series of brute murders. Detective Summerset is retiring in seven days, the seven days relate to the title of the film and the seven murders committed. Mills, the young detective, is desperately willing to do a case on his own. Every murder committed relates to one of the deathly sins. When the two detectives discover after the second murder they are dealing with the seven deathly sins they know there are some more horrible murders about to happen. Summerset and Mills try and do their best to catch this guy, but are they able to stop him in time? We thought seven is a very good film and enjoyed watching it even more than once. The film is really catching and moving. While watching the film you have the feeling you are really in it and everything in the film is really happening around you, you can feel the terror and fear of the characters. Unlike other films you can relate seven to reality, without knowing everyone sometimes feels or acts like the deathly sins, what if you would be murdered if you did again...?\n\nFirstly, what makes this movie brilliant is that the acting is very convincing in Se7en. The character of William Somerset is brilliantly played by Morgan Freeman. His facial expressions, the way he talks and even his body language makes us believe in the character of William Somerset and he develops throughout the film. The connection between him and Brad Pitt is great and also shows us what a great actor Brad Pitt actually is. David Mills is the young gun in the movie, he is eager to learn and Pitt sells this really well. The two completely different detectives develop their 'bromance' throughout the film and you develop a form of sympathy towards the two. Another great acting performance is from Gwyneth Paltrow, who plays Mils' wife. The young actress has to make David Mills feel comfortable in his new surrounding and she tries to do that, although she herself is very insecure. Paltrow might be one of the most important characters in the whole story.\n\nSecondly, the editing plays an important role in the movie. On the DVD version of the movie they show how and why they have sometimes edited the light and shots. When a scene with a negative mood is filmed, they edit the light in such a way that it is very dark at the set. When a scene with a positive atmosphere is filmed the set has been edited much lighter. The head-space of the actors has been chosen with care, e.g. in a serious scene they want to show the whole face of Morgan Freeman to show how serious he is and they also do this in the opposite way to create suspense. The use of the reverse shot is used quite often in this kind of movie, especially when there are interrogations. Se7en is not an exception, this technique also creates suspense, and you can clearly see the intentions of the one who talks. The average shot length in this movie is different per shot and this makes you think about it. The director has done this sometimes to create suspense, sometimes to make things clearer for the viewer. The use of parallel editing is not used that often in this movie, but when it is used, it is very effective and sometimes it shows a surprise.\n\nThirdly, the use of camera-work is from big importance in the movie. The director sometimes does not show things to manipulate us into thinking nothing is there. The use of reverse shot has been discussed in the paragraph above and this is vital in the movie to show the emotions from the characters during conversations. The way we see the corpses for the first time in this movie is also very well done. The camera is moving very slowly and you will see the grossest thing first. This creates a form of disgust and sometimes leave you breathless. The close-ups are mainly to show that the characters are worried and you can see the desperate look in their eyes. The movement of the camera when the detectives are chasing someone makes you feel part of the action and is therefore used effectively. The angle of the camera is sometimes used to make one of the characters look heroic (low angle) or to make a character look weak and vulnerable. The low angle technique is effectively used when the detectives chase the serial killer and it stocks your breath at that point.\n\nWe think this film was really well thought of and very well casted. Everything said in the film really makes you believe the serial killer could stand right behind you. The camera-work is very well done and the music well-chosen. The suspense keeps up throughout the entire film and at the end of the film we were breathless. We think this was a very good movie, and although is was made almost twenty years ago, the special effects are used effectively and the actors are believable. We really recommend watching this film!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tomosp1965",
        "review_rating": "10",
        "review_title": "May be the best film ever!",
        "review_detailed_main": "This film may be the best film I have ever watched. I was gripped from start to finish and actually applauded when the credits started to roll. The last time I did that was when I watched 'The Sixth Sense'. The writing is exceptional, the plot believable and the acting is of the finest standard. Morgan Freeman and Brad Pitt make a great partnership, even though it would seem unlikely, given their different approaches to dealing with homicide cases.\n\nI would ask everyone to try not to second guess the outcome, but rather follow the clues, as the detectives do.\n\nThis is a fine film of the finest quality, with an ending to make your hairs stand on end."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "tanzilnasib",
        "review_rating": "7",
        "review_title": "Best Of Thriller Genre",
        "review_detailed_main": "Se7en is a movie that really sticks with you, not just because of its intense story but because of how it makes you feel. From the moment it starts, you're pulled into this bleak, rain-soaked world that feels almost suffocating. It's not just a movie about catching a killer; it's about confronting the darkness that exists in the world-and within ourselves.\n\nMorgan Freeman as Detective Somerset is the heart of the film. His character's weariness and wisdom come through in every scene, and you can feel the weight of all the years he's spent dealing with humanity's worst. Brad Pitt's Detective Mills, on the other hand, brings a raw energy that contrasts with Somerset's calm demeanor. You see the toll the case takes on him, especially as they get closer to unraveling the twisted mind of John Doe.\n\nKevin Spacey's portrayal of John Doe is terrifyingly calm and calculated, making him one of the most unsettling villains I've ever seen. The murders, each representing one of the seven deadly sins, are horrifyingly creative, and the film's dark cinematography only adds to the sense of dread.\n\nThe ending-wow. It hits like a punch to the gut, leaving you questioning everything. \"Se7en\" isn't just a crime thriller; it's a deep dive into the human psyche, showing how easily the line between good and evil can blur. It's a movie that leaves you thinking long after it's over."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "uds3",
        "review_rating": "",
        "review_title": "\"Seven\" or \"Four point five?\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "sneepvaart",
        "review_rating": "5",
        "review_title": "Spacey isn't a believable psychopath at all - think about it....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jrarichards",
        "review_rating": "9",
        "review_title": "Uncomfortably convention-defying psychological thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jameslinton-75252",
        "review_rating": "8",
        "review_title": "Another great performance by Kevin Spacey",
        "review_detailed_main": "Anyone else think that Kevin Spacey is being type-cast as psychopathic serial killers? It's only because he's so damn good at playing them.\n\nSe7en is no exception. In this film, he plays the unnamed serial killer who kills people in conjunction with the seven deadly sins. His portrayal of the serial killer is chilling, unnerving and powerful. Se7en delves well into his backstory and fleshes him out as a character.\n\nAlthough I did think the film was a little anti-climactic in terms of its scariness. I expected a crime thriller to be gorier than this and I was disappointed when it wasn't, but this is more of a minor criticism.\n\nRead my full review here: http://goo.gl/04bo6s"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "izzknaimi",
        "review_rating": "10",
        "review_title": "The Jaw dropper, the eyebrows raiser.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "xAMERICANxPSYCHOx",
        "review_rating": "10",
        "review_title": "The Quintessential Psychological Thriller",
        "review_detailed_main": "What can one say that, I'm positive, hasn't already been said about this film? That taken into consideration, I will review this title regardless.\n\nSeven, from start to finish, is a film that \"Will Be Puzzled Over, Studied, and Followed... Forever.\" That is a quote used in the movie to describe the crimes that ensue(d), but I feel it works quite well as a tag-line for the film itself. The Film is set in semi-modern New York and revolves around two characters - Detective David Mills & Detective William Somerset. (David being a transfer/\"rookie\" and Somerset, the hardened veteran) The plot consists of Mills and Somerset trailing a serial killer by way of varying but distinct clues left at each scene. I personally believe that Seven lacks in no definitive aspect or area; it is (in my opinion) perfect in every way and a true classic that should be enjoyed by everyone - and I would be more than willing to debate this statement any time, any day. Breakthrough roles, more than incredible cinematography, plot line and supporting roles with awe- striking scenes, twists and developments at every turn."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jdring2007",
        "review_rating": "10",
        "review_title": "detective thriller masterpiece",
        "review_detailed_main": "Let's start with the basics. Which, in this movie, aren't as simple as the term implies. There is mystery to be had, thrills to experience, chills down your spine, the wrinkling of your nose in disgust, the unease in your gut, and oh yes, even a handful of chuckles. Mostly thanks to the dark humor and sarcastic manner of Brad Pitt's character, while Morgan Freeman's is the much more solemn, except that one scene where he's laughing more than I've ever seen him laugh in any other movie. Their polar opposites help engage different parts of your brain, and emotions, as the movie progresses. It's a rollercoaster of sorts, but mostly stays in the ballpark of disturbing this after disturbing that, yet all the while you're immersed in the bleak atmosphere, you're simultaneously glued to the screen. The score is haunting, the cinematography just - I don't know the word, I just love it - and the performances superb from one character to the other. Aside from the main two stars, all the supporting roles throughout execute so naturally that half the time it feels like a sordid documentary. Then of course there's Kevin Spacey, in a notorious role that was a shocker to people watching it for the first time. Given that I only write spoilerless reviews, I won't touch on the details of what I consider one of if not my favorite movie ending of all time. Back to the beginning, I love that the movie opens with a scene, and then runs the credit sequence, which is unnervingly perfect in itself, and from there the movie proceeds. Sure, it has some slow moments, but to be expected, and ultimately I am still too enrapt to have any of that detract from my rating. Even though the movie strictly follows the detective side of things versus the actual murders, the riddles and intrigue suffice to keep you far from bored."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "fkirsch-48364",
        "review_rating": "9",
        "review_title": "A really good thriller",
        "review_detailed_main": "I love how the subject is treated, the evolution of the characters is great. Add some gritty images and the dark tone and you really get involved as a viewer."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "filipemanuelneto",
        "review_rating": "9",
        "review_title": "A huge thriller, although visually disturbing to the faint hearted.",
        "review_detailed_main": "In this film, two detectives have to work together in order to catch a psychopathic killer obsessed with the Seven Sins. Directed by David Fincher, with a script by Andrew Kevin Walker, this film has Morgan Freeman and Brad Pitt as protagonists.\n\nThis film approaches, several times, the grotesque. Its far from appealing to everyone but it will, almost certainly, please any fan of thrillers or police movies. The killer is a madman who seems obsessed with a naturally awkward topic: the Seven Deadly Sins, well known to anyone who has attended Sunday School. The film never speaks openly of religion, but we deduce that this crazy killer is probably Christian, which may displease the practitioners of that faith and even Catholics. In fact, religious fanaticism is quite implicit in the history, and the scenery. Like it or not, its an excellent idea for a movie and gave rise to a great plot, capable of holding the public until the end, despite several disgusting scenes, able to make any popcorn-eater throw in the bag. Yes, this is an alert for the teenagers and the faint hearted: this film is, indeed, visually shocking.\n\nThe way the main characters were developed is very reasonable. They are two detectives, very different personally and professionally, almost the antithesis of each other until they need to form a true partnership. Brad Pitt gives life to a young cop, active, impulsive, passionate, naturally clashing against the thoughtful and prudent manners of the character played by Morgan Freeman, who only want to do the job well done and go home at the end of the day... until he understands (and he does it quickly) that this killer will not stop easily and is different from anything they thought before. The work of the actors is good, especially Freeman, who incorporate his character easily. Pitt also shone, but his character it's hard to like up to half of the film.\n\nThe film is exceptionally heavy. The picture is dark, most of the scenes takes place in low light or at night (the most notable exception is the police station, plenty of bright and light colors). The crime scenes are usually dark and have black elements (in one of them is the furniture, for example). There are religious elements evident throughout the film also. The soundtrack is interesting, contributing decisively to densify the tension with the constant repetition of high and long chords.\n\nIn short, this movie is deep, psychologically challenging, shocking and promises to leave no one indifferent. A great story of suspense, from start to finish."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "SameirAli",
        "review_rating": "9",
        "review_title": "Best Thrilling Crime Drama.",
        "review_detailed_main": "David Fincher, Morgan Freeman and Brad Pitt; these 3 names are enough to make this movie a must watch for film lovers.\n\nSe7en is the story of a serial killer, who kills his victims for the seven deadly sins. Two homicide detectives join their hands for the investigation. It is the last case of a retiring officer, Somerset (Morgan Freeman) and the first case of Mills (Brad Pitt).\n\nNot writing more about, in case if anyone has not seen yet.\n\nGreat direction supported by amazing visuals make this movie a worth watch.\n\n#KiduMovie"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "yuukiftb",
        "review_rating": "7",
        "review_title": "scary crimes",
        "review_detailed_main": "In America, one day, a dead man is found in an unusual style. He is surely obesity, and the reason for his death is that he is forced to keep eating food. Near the dead body, there is a message from him, saying \"GLUTTONY\". Then, two detectives stand to solve the incident, but it doesn't end. Similar murders happens repeatedly, and the victims always tell them some messages by writing. It has seven crimes according to the title, but how will it go to the end? I thought it is very shocking, and has a lot of scenes that makes us surprising. For me, I can watch, because I like that kind of mystery, but some people might be struggle watching it. Anyway, I am surprised by its end!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "ahunt",
        "review_rating": "",
        "review_title": "A Gr8 film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Tiamat10",
        "review_rating": "1",
        "review_title": "Sick, Depressing and Boring",
        "review_detailed_main": "I can't understand what the critics saw in this film. It's basically a standard serial killer film full of cliches (old cop on verge of retiring and young eager cop full of new ideas -yawn) but with two main differences - the ending, and the sheer grossness of the murders.\n\nI've watched many horror and crime movies and I'm not squeamish but I found the murders so unpleasant that I became detached from the movie and started wondering. . The disgusting crimes combined with the general darkness and mumbled dialogue made the whole film depressing and hard to care about.\n\nAs for the ending, it only served to remove any suspense that had been building up. I didn't find the last few scenes shocking or surprising - I realised what was coming and just wanted it to be over.\n\nWell made - maybe. Well acted - perhaps (if you could make out all the dialogue). Innovative - yes, but not in a good way. Imaginative - yes, but not the kind of imagination you want to dwell on. Watch only if you actively enjoy being made to feel miserable."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "graceamatthews",
        "review_rating": "9",
        "review_title": "Seven",
        "review_detailed_main": "I feel as though this the first truely chilling murder mysteries i've watched, Kept me horrified and guessing, very depressing finale. Extremely well crafted movie."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "rosielester-66327",
        "review_rating": "8",
        "review_title": "Blood-tingling Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Icarus_prime",
        "review_rating": "8",
        "review_title": "A grisly, visceral hard-boiled thriller with a superb ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "imdb-92083",
        "review_rating": "9",
        "review_title": "What's in the box?",
        "review_detailed_main": "David Fincher directs Brad Pitt, Morgan Freeman. Kevin Spacey and Gwyneth Paltrow in a hunt for a serial killer, slowly knocking off innocents based on the 7 deadly sins.\n\nPitt does his usual head scratching, hair fluffing as seen in Fight Club and Twelve Monkeys, Freeman is as calm and slow speaking as ever, almost sounding like narrating in The Shawshank Redemption. Spacey is as creepy as ever.\n\nThey quickly work out the killer is basing his kills on the 7 deadly sins as the murders add up until only one is left.\n\nThe climax is unforgettable as Spacey turns the tables on Pitt. In one of the most dramatic finales I have seen.\n\nIt comes from a time when films were films, these days it would be a Netflix mini series, with adverts liberally scattered throughout- breaking the flow. 2hrs6minues extended to over 3 hours once you have adverts every 5-10 minutes.\n\nClassical music, long shots instead of the ADHD style of cutting every few seconds, silence, without dialogue- it's a classic."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jonas-adolfsson",
        "review_rating": "9",
        "review_title": "Dark thriller",
        "review_detailed_main": "Seven is by now more or less a modern classic. The movie is so dark that I almost felt depressed when I left the cinema. I disagree with another reviewer who calls it \"One of the most overrated \"thrillers\" of all time\". The only point this reviewer has is that the camerawork is great. Good acting, good story, great camerawork. Bottom line; If you are looking for suspense you will get it here. You might even get a depression, but that's for free.\n\nOne of David Fincher's (director) best films. Fincher is very talented but probably also very depressed considering the movies he has made. Except for Panic room (there is a turkey for you) he has made a couple of very interesting and unusual movies (Fight club, The game).\n\nThriller rating: 8/10 Movie rating 7/10"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "cwat-97965",
        "review_rating": "8",
        "review_title": "Incredible Movie and Pacing",
        "review_detailed_main": "This movie is incredible for a multitude of reasons. The acting, the premise, but I think one of the things that really sets this film apart is the pacing and deliberate cinematography to create a sense of dread. During the scenes at the crime scene they light the scenes and have the camera follow the lead characters in a way that enables us the viewer to discover the true horror of the acts committed as the lead characters do. We as the viewer are along for the ride and experience the sheer horror and rising terror that the characters experience in the moment.\n\nAlso, Brad Pitt's line \"What's in the box?!\" might be my favorite line he's ever spoken in a movie."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "leomcom",
        "review_rating": "10",
        "review_title": "A Masterpiece",
        "review_detailed_main": "Without a doubt the best mystery film of all time. The story and development of this film is just awesome and the ending is definitely one of the best of all time. Brad Pitt gives one of his best performances maybe his best and Morgan Freeman and Kevin Spacey are perfect too. I could watch it every day because it's just gorgeous. Definitely in my top 20 of all time!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "lesleyharris30",
        "review_rating": "10",
        "review_title": "Complete and Utter Suspense,",
        "review_detailed_main": "Se7en is an amazing movie with an incredibly well developed plot and a stunning cast. It had me glued to the screen for the entire run time, as we follow two detectives struggling to catch a serial killer who has been murdering people as a representation of the seven deadly sins, the images this killer makes the bodies in to are literally some of the most brutal things I have witnessed on film. David Fincher and writer Andrew Kevin Walker did a stellar job developing detectives Somerset and Mills, who Morgan Freeman and Brad Pitt bring to life flawlessly, their relationship is a complicated one that becomes more layered as the film continues. However, the highlight was Kevin Spacey, who steals the show as the man we were waiting to see from the very beginning, and is not one bit disappointing, he is sinister, absurd and a straight up creep, he chilled me to the core, I do not think any other actor could have portrayed this psychopath better. Thrilling, engaging and incredibly well acted, I can not find a single flaw in Se7en, highly recommend to anyone looking for a good mystery or thriller.\n\nTwo detectives search for a serial killer who plans on taking seven victims as a way of exposing the deadly sins.\n\nBest Performance: Kevin Spacey"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "matty79m",
        "review_rating": "7",
        "review_title": "Very good movie with shocking ending.",
        "review_detailed_main": "Se7en is an undoubtful masterpiece concerning suspense, locations and camera. The actors are also brilliant and the story is one of the most thrilling and intelligent of our time. Really great: none of the killings are shown and are left to the mind of the viewer. So, why should someone like me who has just written so nicely about this movie rate it with just se7en stars? It is because of its ending. Surprisingly indeed, but... I think, a little too surprising. In the ending this movie seems to lack in logic. The characters Pitt and Freeman are playing make some progress in the story and they get to know each other better and better. Freeman's role is the one of a very intelligent cop who often has to calm down the hot-headed character Pitt is playing. But in the last minutes of the movie - I cannot imagine why - he doesn't calm him down and absolutely underestimates the danger. It seems to me that this movie just wanted to have a surprising, shocking ending (it really doesn't need to have!!!) and spoiled it a little bit to me. But anyway, this is a brilliant movie everyone should have watched. Once again, se7en out of ten!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "max-850",
        "review_rating": "1",
        "review_title": "Another Example of American VIolence Porn",
        "review_detailed_main": "This movie is almost unwatchable because of the pornographic use of violence. There are filmmakers who use violence sparingly when necessary and then there are the ones who wallow in it like porn. This is an example of the gratuitous use of violence. The studios know that Americans and lots of foreign markets like southeast Asia LOVE violence for its own sake and so they dish it up because it sells. It sells better than sex. Religious zealots will let their kids watch violence while insisting that they avoid sex. So these kinds of movies get elevated to Academy stature. It's symptomatic of the American psyche. We would rather let our kids kill someone than have too much sex. Okay, that's overstated but you get the point. Quentin Tarantino is one of the most famous violence porn producers. David Finscher is talented but I can just imagine him and Quentin masturbating to graphic violence. They need it to get off."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "t4art",
        "review_rating": "9",
        "review_title": "The timepiece that never dies.",
        "review_detailed_main": "I consider this film to be a cradle and inspiration for every filmmaker who presents crime and mystery cinema.\n\nThis is a film that should not be re-presented in any way, but I hope that there will be a new part for it and we will see after years what the investigators have reached and how they are facing crime in our time.\n\nThe Seven Sins are still present among humans and the movie must present us with a new masterpiece with a new part and with the same weight."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "lucasrosano",
        "review_rating": "10",
        "review_title": "The perfect thriller",
        "review_detailed_main": "This is the best movie that i have seen of my life. The acting of brad pitt and morgan freeman is amazing. I think that David Fincher could do one the best thrillers of the cinema history. I still see some director trying make something like that, but never it be possible. It has many scenes that will be in my mind forever. Kevin Spacey do a work awesome doing of murderer how also morgan freeman like detective. Without a doubt it has a plot interesting of the beginning until the final. I'd like to watch more film of this style. I'm boring of watch films about super heros and romantics or teenegers like Maze Runner, Papers Cities. C'mon Fincher for more movies like that!!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "timothyhilditch",
        "review_rating": "8",
        "review_title": "City of sin",
        "review_detailed_main": "A young detective transfers to the city to replace the aging detective who is on his final week. Strange homicides start coming in which they have to investigate. A detective thriller which doesn't follow the usual story beats. You fall into the twists and turns as you learn about the seven deadly sins, ultimately I think this movie is about pride. Brilliant performance by the killer and excellence writing throughout. It really leaves you at the end to think."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "rish1603",
        "review_rating": "9",
        "review_title": "Masterpiece made better by incredible acting",
        "review_detailed_main": "As a 15 year old, I did not know what to expect from the movie. All I knew is that it was supposedly good and that the actors were the best there are. The storyline takes the viewer on a journey along with the characters. The viewer soon begins to empathise with Brad Pitt's seemingly over- confident character. This is similar for Morgan Freeman's cool, calm and collected camera. This turns out to be significant towards the end of the movie. This movie is no murder mystery like any other, and perhaps not much of a murder mystery at all. This is due to the difficulty that the detectives have when attempting to solve the case. With any other actors, the movie may have been unbearable as it is often slow paced. However the acting was so real and, well, brilliant that you can't take your eyes off the screen for one second. All in all, the magnificent, unpredictable storyline combined with brilliant acting makes this movie a must- watch for all fans of film."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "FlashCallahan",
        "review_rating": "10",
        "review_title": "This isn't going to have a happy ending.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "costasachin",
        "review_rating": "10",
        "review_title": "A mind twisting tale",
        "review_detailed_main": "If you will see this movie the first thing will come into your mind will be\"Oh my god\". This is a tale of a serial killer and let me tell you this one is quite different from other you seen. This guy (kevins.) is looking so intense in the movie. Though the story seems fit to the characters but the creepiness of the main idea is very unique....!! And like always brad pit is looking handsome and morgen is intelligent but kevin is a winner in this movie. when i saw this movie last night i wasn't thinking that it will be so intense like its review says on IMDb but just after watching it for 30 min. it gripped me in such a ways which words can not define. this is movie which you will remember for a lifetime and discuss with 1000 people and everyone will have the different theory for the characters but i bet on that - everybody will be agree on the idea and the intensity of the movie. A must watch if you like the serial killer movie and light blood n gore but i bet the idea will more hit you then this. I am giving it 10/10!! Best in its category."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "michellekendi",
        "review_rating": "8",
        "review_title": "Intrigued",
        "review_detailed_main": "The detail in Communication is awesome.\n\nJOHN DOE: \"...wanting people to listen, you can't just tap them on a shoulder anymore, you have to hit them with a sledgehammer and then you'll notice...\"\n\nThe dialogues are superbly delivered. A film that kept me engaged...listening and watching, waiting for what's next."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "chera_khalid",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "Sure! \"Se7en\" is an intense and gripping thriller that keeps you on the edge of your seat from start to finish. With its dark and atmospheric setting, the movie creates a sense of unease that lingers throughout. The performances by Brad Pitt and Morgan Freeman are outstanding, bringing depth and complexity to their characters. The plot is cleverly crafted, taking you on a twisted journey as the detectives hunt down a serial killer who uses the seven deadly sins as inspiration for his murders. The cinematography and direction are top-notch, adding to the overall suspense and tension. While the movie is undoubtedly disturbing at times, it's also thought-provoking and leaves a lasting impact. I highly recommend \"Se7en\" for its thrilling storyline, strong performances, and its ability to keep you guessing until the very end. It's definitely a must-watch for fans of crime thrillers. 9/10!"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "swmoncur",
        "review_rating": "7",
        "review_title": "Remarkable ending to an overall good movie",
        "review_detailed_main": "At times, the movie felt somewhat drawn out to me. Most of the details and scenes were necessary to the buildup, but I felt it could've been done in a more concise manner. The setting and feel of the first 3/4 of the movie also began to feel repetitive and, at times, boring.\n\nWith that said, the acting and plot in this movie were fantastic-especially the latter. The grand finale, which transpires over the last 20 minutes, deserves a 10/10 rating. Truly chilling the way it all comes together at the end. If it were all accomplished with a bit more brevity I think the desired effect would have been even more powerful."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Mokrosuhibrijac",
        "review_rating": "1",
        "review_title": "Overrated,boring and silly.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jlspenc-84630",
        "review_rating": "10",
        "review_title": "Seven deadly sins and nine circles of hell.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "deliaofficial",
        "review_rating": "10",
        "review_title": "The best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "inanisumeet",
        "review_rating": "8",
        "review_title": "serious real , not for light mood , well acted",
        "review_detailed_main": "this is of 1995 and yet scenes are so realistic . it seems they really killed a person to show believable autopsy . Morgan freeman as about to retire detective plays the part very well while brad Pitt is young guy who partners him in last case . gwyneth paltrow looks charming . story is depressing . notice how the credits roll at ending , then you will know the idea of director . there is a chase scene in which cop is alert & determined , committed to his duty , uncaring of his scars , yet evil sneaks up on him . the picture of life painted is quite bleak . the limitations of law rule book are shown . the apathy of human beings to each other makes situation grim and hopeless for viewer ."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "rick-jatti",
        "review_rating": "8",
        "review_title": "really good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "preston_peace",
        "review_rating": "9",
        "review_title": "If Lethal Wepon Was Realistic",
        "review_detailed_main": "I think the greatest strength of Se7en is its opening twenty minutes. The first twenty minutes makes you think that you're in for a decent, gritty, detective movie. But nothing worth the 250. It's sort of what Summerset and Mills thinks they're getting into. They think that this is going to be a hard case, but not scarring. They keep their heads high and don't think much of it. But after those twenty minutes, it becomes a tale of self worth, moral ambiguity, guilt and everything that'd usually be fluff in any other movie, turned into a disturbing look into what we can and have become as a species.\n\nThe film is hard to write about because it does everything in a bad buddy cop movie and makes it realistic. How would Mel Gibson and Danny Glover function outside of the job? How would the world react to absurd James Bond like plans? How would a basically criminal master mind make his plans make sense? The film is like a satire that went all of the way. It makes everything that'd be nonsense in any other film, and I mean any other film, work. The dialogue works, the acting, the camera, the story, the plan, the makeup, everything works. And the best part is, you don't expect it to. By all means, this film should've been awful, and it's brilliant.\n\nThis the first time I'm truly recommending a movie. Unlike a lot of good movies, this one you want to suggest to others. It's hard to recommend something like The Good, the Bad, the Ugly or Citizen Kane because of one reason or another. It's too long, some things don't make sense, but Se7en is a film that's enjoyable and for reasons that can't be explained. It's a watchable movie.\n\nThe only problem is also the greatest strength. The first twenty minutes are a bit, well, \"slow\" because they're necessary and without it the film wouldn't work on an emotional or logical level. But, even then, it so much more watchable than a lot of other first twenty minutes. It's a \"good movie\" no matter what.\n\nIf nothing else, everything about this film WORKS. What that means, I still don't know. But it's a working movie and make of that what you will. Please, watch this movie."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Reyhan5289",
        "review_rating": "10",
        "review_title": "Frighteningly beautiful thriller",
        "review_detailed_main": "I watched Se7en assuming it would be a regular detective movie. I am happy to say that I have been proven wrong to a great degree. First off, I'd like to gush over how perfect the cinematography is for this movie. The intense downpour of rain present throughout (most of) the movie adds so much to the noir atmosphere the film evokes. The lighting is quite minimal throughout the movie. This choice was obviously made to create a more claustrophobic and creepy ambience and I would say it works. Howard Shore's score is not too noticeable in the film, it does add tension and in the final act it does help with freaking out the viewer even further.\n\nThe disgusting murders shown in this movie are what set it apart from other crime/thriller films. Not to spoil anything, but the people who made this were certainly creative. Brad Pitt, Morgan Freeman and Kevin Spacey are beautifully cast here. The best way to see this movie is completely blind like I was, so I won't give anything away.\n\nThis movie is definitely not one to forget and is a must-watch.\n\n10/10."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "emilyjo-10549",
        "review_rating": "8",
        "review_title": "\"You brought me closer to God\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "haydenbate-95920",
        "review_rating": "8",
        "review_title": "A damn good movie",
        "review_detailed_main": "Seven is a crime, thriller following a rookie and a hardened, retiring detective as they try and solve the case of the mysterious murders, one per day for Seven days, finding that the victims also follow a pattern, they all represent one aspect of the seven deadly sins. The duo must find this killer before he finishes his grand masterpiece.\n\nI love this movie, the grimy and dark atmosphere, almost rustic in nature. Beauty in imperfection. David Fincher is a masterful director, choosing to rely on the weight of the scene, allowing it to hold, over fast cuts and fancy camera movements. The movie hooks you in most with it's disturbing nature, everything is so graphic and or disturbing in context. Right there, seeing what the detectives sees, trying to solve this puzzle with them.\n\nBut outside of that, the story is simple yet deals with complex ideas, while also keeping it in a 2 hour runtime, which is impressive, knowing how long it needs to be and not over staying it's welcome.\n\nThe only real issue i had with the movie is that i didn't feel that much of a connection as much as i should have to the story, until John Doe finally comes into the picture. From there, the movie is tense and had me hooked the entire time, the building music and the overall feeling that the characters are not in control. This is Fincher's true start into cinema. Though i prefer fight club and zodiac, this is by far his best original project."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Pedro_H",
        "review_rating": "7",
        "review_title": "Great thriller if a little cold and dehumanising.",
        "review_detailed_main": "Two cops - one young, one old - chase a serial killer that is leaving a paper trail.\n\nThis is actually one of the best films that I have seen that I have only wanted to watch one. The reason being that while it has an interesting plot, plenty of action and a great twist it also has a horrible aftertaste. Like spending too long trying to clear a blocked drain.\n\nHollywood has, for far too long, glamorised crime and the chasing criminal so it is surprising to see a film maker going the other way. This is a dark, decrepit and cold world where everything is falling apart and unkept. This seems a deliberate policy move that features in many of David Fincher's films. Interesting - in that is different - but strangely alienating and depressing - and these are emotions I don't want to wish upon myself.\n\nThe serial killer and the criminal that leaves clues are nothing new, but the way the plot develops is. If you know the twist the movie will be cut in half and thank god I saw it without knowing the pay-off- although I knew there was going to be one. This is a movie after all.\n\nBrad Pitt never convinces as a professional of any type. Here he seems to have become a cop overnight and without much training. Morgan Freeman does his usual quiet-but-logical act that has bought him fame so late in life. He is nearing retirement (in the film), but I thought all cops were about to retire in movies - I took that as read!\n\nThis is very involving stuff and we are drawn to grandstand finish that we will remember forever - but what is Se7en in longterm reflection? A horrible world in which horrible people carry out horrible acts for reasons of self-gratification?\n\nSerial killers have existed since the dawn of time, but America is home to half of the world's population of them. Why is this? Maybe it is the last chance to make a mark on a society where being in the media and being in the spotlight are prized? When you have killed someone you are interesting, when you haven't you are not. Simple."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "pzjg1",
        "review_rating": "5",
        "review_title": "#42 of all time? Not a chance.",
        "review_detailed_main": "I had been waiting a long time to see this movie and I finally had the chance. #42 all time? 8.4 on IMDb? Man it must be GREAT.\n\nInstead, what I watched was a slow, almost boring movie. Where were the great twists? It was amazingly predictable. Guys print on a wall? Bet he's missing a finger or hand. Guy starved to death? Bet he's still alive, why else would they so lovingly pan over the body? Friday the 13th did that, too. Nice serene music and BAM! I wasn't counting on Seven being a \"slasher film\" but it sure seems to have followed many of the \"tricks\" of cheaper slasher films.\n\nThere was some character development, I guess, and i'm sure that slowed things down a bit, but that hardly made this a great film.\n\nAnd why was it so damned dark half the time! IT ISN'T NECESSARY! Man I hate that in movies.\n\nAnyways, i'm sure some will love it. I found it totally run of the mill, with a lot of wasted star power."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "snoducky",
        "review_rating": "10",
        "review_title": "Seven",
        "review_detailed_main": "A dark, gloomy and hideous masterpiece.\n\nFrom start to finish this movie grips you tight and doesn't ever let go. The storytelling is perfected with the narration extending throughout the whole film. The film creates a chilling and disturbing atmosphere perfect for the plot of the film. The acting carries this film to what it is, it's shuttle but realistic and manic. The movie shows the perspective of a maniac , how he thinks, believes and acts and how hard it is to fully understand what's going on in their head. It also shows the downsides of our world, how it is and how there truly is a sin on every street corner."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "eman063",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "This is just an all around great movie. Great acting, original story line. They don't make them like they used to. A good movie I hope they never try to re make. Some movies just need to left the way they are. A Great villain role in this movie and the hero's are both perfect in their roles. A must see"
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "oddballloulou",
        "review_rating": "10",
        "review_title": "Absolutely amazing! The best film I think I have ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "fury12",
        "review_rating": "9",
        "review_title": "Delivers More Than Expected from This Genre",
        "review_detailed_main": "After the troubled production of \"Alien 3\", David Fincher directed his second movie \"Se7en\", The film was a great success both commercially and critically.\n\n\"Se7en\" starts with the usual crime mystery introduction where a serial killer is involved, but what makes this movie stand out is the use of the concept of the seven deadly sins. The serial killer assigns each sin to a victim who represents it and gets on with his acts. The story is tightly constructed with no wasted moments, making full use of its runtime. Although the ending is somewhat expected, it remains effective despite lacking a major twist that could have provided a more surprising conclusion.\n\nThe film begins strongly, with characters introduced at a perfect pace, neither rushed nor dragged out. About three-quarters into the movie, the pacing falters slightly as the plot becomes predictable, but quickly recovers. The climax, while gripping, starts and ends rapidly, leaving little time for the viewer to fully absorb the tension. Nevertheless, the film's overall structure is impressive, with only minor issues.\n\nThe main characters are well-developed and well-linked to the story. Morgan Freeman and Brad Pitt give strong performances, though Pitt has some minor shortcomings. The side characters contribute effectively without unnecessary screen time, perfectly used to move the narrative.\n\nDialogue is a major strength in the film. It is well-written and executed, with no wasted words. Every conversation ties directly or indirectly to the plot, which ensures the correct usage of the film's runtime.\n\nThe cinematography is outstanding, resulting in some amazing shots. Sound effects are well-placed and fitting, while the music, though not a standout, subtly sets the mood.\n\nCostumes and makeup are fitting and natural, seamlessly blending into the film. The setting is well-chosen and effective, ranging from small rooms to city streets to the expansive countryside. Props are well-used, adding essential details to the plot.\n\nEditing is well-executed, maintaining the film's pace and supporting the overall direction.\n\nOverall, \"Se7en\" is a great film that offers a nice twist to its crime genre. The film offers a well-written plot and characters that are delivered by strong acting performances, accompanied by great cinematography. However, the plot and the plot structure suffer from some minor issues."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "reefosj",
        "review_rating": "9",
        "review_title": "Perfectly terrifying",
        "review_detailed_main": "Not one for watching these movies due to the stomach turning it causes me, but then I started to realise that's what makes this movie so captivating. Not all of the terrifying scenes were visual, a couple depended on your own imagination, scary to think about but it really pulled me into the film, I felt more and more horrified as the movie continued. You can expect quality art from these actors and the direction from the writing/ producer is top notch. Horrifying with a satisfying ending. Great film."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "film_riot",
        "review_rating": "9",
        "review_title": "Se7en",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "davidburrows89",
        "review_rating": "10",
        "review_title": "The best film of its genre by a mile!",
        "review_detailed_main": "IMO this is David Finchers best film. Fight Club was good. The Game was interesting, but this overshadows them all.\n\nMorgan Freeman and Brad Pitt play two detectives who are after a serial killer who uses the seven deadly sins as his M.O.\n\nBrad Pitt actually acts in this film, Morgan Freeman is awesome as always, but Kevin Spacey delivers one of the best performances I have ever seen.\n\nThis film had me gripped from start to finish, however it is the last 30 minutes of the film that made this so special. Never before or since I watched this film have I ever been so engrossed in a film than I was in the last 30 minutes of Se7en.\n\n10/10. Superb."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "jamisonslabaugh",
        "review_rating": "9",
        "review_title": "Se7en - Jamison Slabaugh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "Eneser66",
        "review_rating": "6",
        "review_title": "Whats the Hype about?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "finnigan2",
        "review_rating": "1",
        "review_title": "Depressing gross out without even the redeeming feature of conveying a moral message.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "robertzorack",
        "review_rating": "10",
        "review_title": "Am I the only one that wants to see a Se7en 2?",
        "review_detailed_main": "I would love to see another film like that. I have been searching everywhere and most of the films in this genre sucks or it's plain stupid."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "zhivago97",
        "review_rating": "10",
        "review_title": "Joyful movie about inner strength",
        "review_detailed_main": "Kevin Spacey plays John Doe, a misunderstood but well meaning community leader who does good deeds in dirty New York City. His goal is to help people. Brad Pitt and Morgan Freeman are two bumbling detectives who add a comic element. Gwyneth Paltrow plays a depressed wife who goes on a spiritual journey and ends up in a better place with some help.\n\nOverall the movie is upbeat and really points to how important it is for people like Kevin Spacey/John Doe to help others overcome their inner demons from obesity to laziness and other evils. His techniques are very effective! And he even does expert manicures! He is a multitalented saint.\n\nAfter watching this movie, anyone can become inspired to help those around them be better people."
    },
    {
        "movie_id": "tt0114369",
        "movie_name": "Se7en",
        "movie_rating": "8.6",
        "review_username": "poe426",
        "review_rating": "10",
        "review_title": "Thinking outside The Box...",
        "review_detailed_main": ""
    }
]