[
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Spooky!",
        "review_detailed_main": "A sequel to the 2008 box-office hit '1920', '1920: Evil Returns' is Spooky! Its got the thrills!\n\n'1920: Evil Returns' Synopsis: A famous poet meets a woman who is in trouble. In order to treat her, he takes her to Shimla in a big hospital, but soon that woman gets possessed by devil and goes out of control.\n\n'1920: Evil Returns' is as scary as '1920' was. Vikram Bhatt & Amin Hajee's Screenplay isn't foolproof, but it offers some great thrills & engaging moments, especially in the second-hour. Cinematographer-Turned-Director Bhushan Patel knows his job. Cinematography & Editing are crisp. Music by the under-rated Chirantan Bhatt is melodious.\n\nPerformance-Wise: Aftab returns on the screen after a hiatus. He's good, but looks well-fed throughout. Tia is haunting. Vidya Malvade is average. Sharad Kelkar is fair.\n\nOn the whole, '1920: Evil Returns' is a spooky watch!"
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "kinshuk-gaur",
        "review_rating": "6",
        "review_title": "Serving old Wine in new bottle.",
        "review_detailed_main": "1920 Evil return is a descent watch. With Good picturesque locations , good background score that keeps you glued on the screen. The movie starts on a promising note and leaves the viewers thinking.\n\nWatching this movie is exploring \"The Exorcist\" of 70's in various scenes when the lead actress gets possessed. Tia Bajpai manages to give a good performance, Aftab looks confused in the entire movie rest of the Actors are ordinary.\n\nOK! we come to the spook part, barring 1 or 2 scenes there is nothing that will give you a chill. If we compare 1920 with the sequel,1920 returns is a huge let down during the climax which is the integral part of the movie.\n\nAll said and done still 1920 returns is good watch around Halloween and much better than bhatt's previous venture Raaz 3. Though Vikram Bhatt is not the director of this movie still it has all the characteristics of the bhatt camp\n\nPlease try new things in horror rather just serving old wine (The Exorcist ) in a new bottle ( 1920 , 1920 returns ) each time."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "fuzonn22",
        "review_rating": "6",
        "review_title": "1920-Good to return",
        "review_detailed_main": "Seeing 1920 brings back memories of B.R chopra's Mahabharat,mainly the portion between Dronacharya and eklavya.With this film Vikram Bhatt again proves that he is a modern day eklavya to the Ramsay brothers who act as his multiple dronacharyas.From the screech in the opening scene (which takes place in a jungle set where the fog machine naturally went on an overdrive) to the hero(a beefy Aftab with an even beefier stubble) strapping a Om printed cloth onto his hand and grabbing the the collar of the evil spirit,Bhatt gives a proper shraddhanjali to the fathers of the Indian horror genre.The film is replete with innumerable clichés from horrific close ups,a homeless villager who can see spirits,secondary characters who get murdered one by one to some forgettable love scenes,but just when it seems that the film is going to sink like the titanic halfway through the runtime,it picks up steam,some interesting back stories are shown and ultimately it hurtles towards a memorable climax.The climax is full of spine chilling moments,the actress Tia bajpai makes up for her careless acting in the 1st half by delivering some gruesome moments with great panache.Ultimately on seeing 1920,you are left with the feeling of savoring a biriyani from a roadside stall,your stomach churns a few time,you have to gulp a few extra glasses of water but ultimately you would be left craving for more."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "pingu-hash",
        "review_rating": "2",
        "review_title": "What a Horrubbish plot... Failed again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "bobbysing",
        "review_rating": "2",
        "review_title": "Another mediocre film churned out for the fans of horror genre.",
        "review_detailed_main": "An almost full theater for 1920 EVIL RETURNS in a multiplex on the first day itself (also a holiday) clearly proved that there are still enough fans of horror genre, desperately waiting for a good Hindi horror film from long. But unfortunately once again they all are served the same mediocre stuff from the house of Vikram Bhatt, which has got nothing exceptional as associated with the brand of 1920. May be the result is such since this time the unrelated sequel is not directed by Vikram but by the debutant Bhushan Patel, who mainly falters in the opportunity given due to a poor and unconvincing writing.\n\nSo even when the film gives you some well executed scenes depicting the possessing spirit, it overall fails to impress because of an all predictable, soul-less storyline penned by Vikram Bhatt himself along with Amin Hajee. As a result, 1920 Evil Returns just remains a quick sequel, purely made to en-cash the brand value of both Vikram Bhatt's Horror Cinema and 1920 in this festive season and nothing else. It begins on a confusing note and then continues its uninteresting run till the interval without moving any further as far as the plot is concerned. And then in the second half too it rarely manages to scare you off in its prolonged climax shot well. At times, the scary sequences even turn out to be funny instead of frightening when the ghost starts singing songs and keeps laughing weirdly.\n\nWith the actual twist in the script unfolding only in its last 40 minutes, the film relies mostly on repetition and unwanted songs which ideally should be strictly avoided in this particular genre. But as per the routine, the director keeps throwing one love song after another at regular intervals into the film and ruins an otherwise decent soundtrack by Chirantan Bhatt including few fine tracks such as \"Uska Hi Banana\", \"Apna Mujhe Tu Laga\" & more. Apart from the soundtrack the film also has a fine Cinematography which again gets overshadowed by a loud and annoying background score which sounds the same as Vikram's earlier movies.\n\nMoreover 1920 EVIL RETURNS remains a hushed-up project in its performance department too as no particular actor is able to contribute in the film through his acting skill other than Tia playing the lead role of a possessed girl. Both Aftab and Sharad Kelkar fail to impress mainly due to the lackluster roles given to them and Vidya Malvade simply stands wasted. Further the viewer is not able to find any emotional connect with the sufferers on the screen because of a feeble screenplay which neither establishes Love or Fear in its 2 hours of duration.\n\nTo put it together, after watching 1920 EVIL RETURNS you can easily add the name of Vikram Bhatt in the list of those famous film-makers who have now found a new style of making films on a fixed Template or Pattern. In clear words, after Madhur Bhandarkarand Parkash Jha, here is Vikram Bhatt with his new horror film made on a preset template to win over the audience. Now whether you want to be fooled again or not, the choice is all yours."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "gops-s21",
        "review_rating": "1",
        "review_title": "Best unintentional fun!",
        "review_detailed_main": "\"Tum achha sangeet gaa leti ho. Tumhara naam Sangita rakhenge.\" is one of the few gems that is delivered with a serious face by Jaidev Verma played by none other then Aftab the great, in a movie that is so genuinely entertaining(unintentionally).\n\nTalking bad about a movie that made me laugh so hard through out non-stop would not do justice because I got more than my money's worth. So here's what I thought about this movie.\n\nThis movie is one of the best unintentionally enjoyable films that you would ever find.\n\nTalking about all the different factors in this film like direction, acting and all is hilariously futile. Except for one actor named Sharad Kelkar who does something that resembles the word \"acting\".\n\nBut I'm sorry I never went into watch anyone act! In fact this isn't a movie that you sit and seriously watch.\n\nIt's a movie to make fun at and in the process get all your money's worth.\n\nSo go buy a cheap ticket and be the dialog writer of this movie along with your friends. Bring out the creativity in you man!\n\nConclusion:\n\nGo strictly with a group of friends, keep an open mind and have a blast.\n\nYou will enjoy like you have never enjoyed before.\n\nThank you Vikram Bhatt."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "yunusitboss",
        "review_rating": "7",
        "review_title": "1920: Evil Returns (A) Hindi ------------- my Rating : ★★★½ ENDS ORDINARY",
        "review_detailed_main": "For more Complete reviews and Hot news ... Just LIKE this page ?\n\nFacebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\n1920: Evil Returns (A) Hindi ------------- my Rating : ★★★½ ENDS ORDINARY\n\nSTRENGTHS : - * Performance of the Actress * Sound editing and Background music .... * Songs were beautiful ... * Horror scenes and thrills ..... * First Half - screenplay was very fast... whereas second half flats .... * Dialogues : very beautiful and logical manner .....\n\nWEAKNESSES : - * Second half with a funny climax ...... * Title : It is a not a sequel and nothing related to the First part \"1920\"\n\nFINAL VERDICT :- * It is clean one time watch thriller .. highly recommended to watch in night to at least feel the Horror experience of this movie .....\n\nThis story revolves around a famous poet who meets a woman who is in trouble. In order to treat her, he takes her to Shimla in a big hospital, but soon that woman gets possessed by devil and goes out of control. Now the question remains that what is the relation that poet shares with her which compelled him to go to any extent to save her, why she was possessed by devil and who is the devil."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "2",
        "review_title": "Sasta 1920",
        "review_detailed_main": "Nothing is more painful than a movie having Aftab as a lead. I think I described everything in the movie already.😏"
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "sinto92",
        "review_rating": "6",
        "review_title": "Why Bollywood??? why???",
        "review_detailed_main": "First of all I watched the trailer and I said \"holy crap a good thriller\". Then I decided to watch the movie...I said OK Bollywood but it seems really good.\n\nThe movie has a bad thing! MUSIC and HORROR don't go together!The songs in a thriller I think that is the worst thing.\n\nThe script is very strong with a very nice background but I thing this movie is TWO movies! A nice romance musical and a very well played thriller but this two things can't go together!\n\nThe main actress don't have a very good performance is a little fake but at the scenes of exorcism she is very good!\n\nThe effect is a little too much and I think they can do it better! So much money Bollywood spend for the movies, they can't do a good effect production?\n\nI think the movie is good only for the script and please Bollywood the next time don't do that!!It isn't necessary songs and music like this in a horror movie! The songs every twenty minutes make the movie funny!\n\nI will rate this with a 6 (six) for their try and the well built script!!"
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "olhyan",
        "review_rating": "1",
        "review_title": "1920 - evil returns to haunt pocket",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "ammar_yngwie",
        "review_rating": "8",
        "review_title": "Not a waste of time",
        "review_detailed_main": "Another 'not' bad horror movie presented by Bollywood, I started to love this kind of movies, they are really improving and should produce more and more, they are a great stories and excellent writers.\n\nWell, what I have to say about this movie? nothing much but if you liked the movie 'Huanted 3D' then this one is good for you to watch, mostly you will know what will be coming but there are more interesting stuff in the scenario and a shocking story to be revealed after the interval.\n\nLoved the way they put in the storyline and as I said if you don't liked 'Huanted 3D' the don't bother to watch this.\n\nEnjoy it!"
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "piyushkumar-41077",
        "review_rating": "7",
        "review_title": "It's perfect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "silvan-desouza",
        "review_rating": "4",
        "review_title": "Another Exorcist remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "lateefwagay-164-546714",
        "review_rating": "4",
        "review_title": "Something was missing in plot.",
        "review_detailed_main": "This movie was really diabolical one.What do you want to expect from this movie a good plot,horrorness,scary environment,honestly saying that it really ruined the expectations and hopes that people had.This movie continued to torcher me for the time that i spend in the theatre.I thought that this time Vikram Bhatt will do something unexpected but to no avail.Some scenes of this movie were same as there in 1920 like the ghost was knowing the family background of priest.\n\nHonestly,i will say that Jia Khan was far more scary than Tia bajpai.Arjun Rathod was best in acting than the experienced Aftab Shivdsani.I really liked the songs sung by ghost that was something new added to this sequel."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "gauravnaughtyvirus",
        "review_rating": "10",
        "review_title": "Fully enjoyed!!!!",
        "review_detailed_main": "Many can say plot holes etc but this is a very good movie,good story,good acting and what you need from a movie,,,people should understand that this is only a movie not a true story or reality,,,every thing is larger than life is shown in a movie i think it has a better story than DABAANGG 1 or 2...so don't think so much and just enjoy the movie :D I really respect the film makers that they at least are making the films of this genre. I will give this movie a 10/10.it is fully paisa vasool movie and lastly the songs of the movie are great,don't know if you enjoy the movie or not but you will definitely enjoy the songs of this movie. so don't waste your time just watch it..... :D"
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "ashokmanil",
        "review_rating": "8",
        "review_title": "Good movie with fantastic story",
        "review_detailed_main": "Yes 'evil returns' is not in the same league as previous 1920. The acting, horror and direction are not as par with 1920 but the 'story' and 'music' is something that is better than previous 1920. The story is fantastic, even acting by the girl (Tia) is very good and comparable to 1920 girl (Adaah). Music is definitely better with quite a few hummable songs. I think the direction is a bit loose and there are not much scary moments. Aftab is good. I think his role was of a silent and introvert person and he performed it well. Overall a great movie. Do not go by negative reviews and low ratings. The movie is definitely worth a watch. 8/10 from me."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "abhishekbawa",
        "review_rating": "10",
        "review_title": "That time was best, I miss bollywood",
        "review_detailed_main": "Perfect movie for horror lovers. Good songs, good acting with average VfX. I still watch this movie in 2021."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "sahilmittal452",
        "review_rating": "8",
        "review_title": "1920-Evil Returns-- Not Much Too Horror But Pretty Good",
        "review_detailed_main": "1920 Evil Returns---Not Much Too Horror But Pretty Good Just like an unbeaten series of Raaz, Vikram Bhatt is successfully making a franchise of his 2008 hit movie '1920'. As it's a sequel, one would be definitely expecting a better product than the original. Thus '1920 - Evil Returns' should be spookier, horrifying and attention-grabbing, along with an excellent storyline, more than '1920'. However the makers had effectively impressed the moviegoers, especially to the one who have loved the first part....... 6/10\n\nAwesome Direction by VIKRAM BHATT\n\nPluses:\n\nFull of chilling moments, impressive background score, edgy-direction\n\nMinuses:\n\nClimax is stretched,songs come as lo break\n\nWatch it for real jump out of the seat moments"
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "ameepatel-13836",
        "review_rating": "10",
        "review_title": "All time fav",
        "review_detailed_main": "Amazing story with best music. Acting is great too."
    },
    {
        "movie_id": "tt2222550",
        "movie_name": "1920: Evil Returns",
        "movie_rating": "4.9",
        "review_username": "fejashpresadashuria",
        "review_rating": "10",
        "review_title": "Very good movie",
        "review_detailed_main": "I really enjoyed this movie it had everything romance drama and horror 👍"
    }
]