[
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "anthrofredd",
        "review_rating": "3",
        "review_title": "This didn't get sent DTV why?",
        "review_detailed_main": "If you missed the ridiculously shallow ego-trip of Hilary Duff \"Material Girls\" last year, don't worry, here's another shallow teen movie for you that steals so much from Mean Girls that it hurts. The movie is based on the ugly dolls with the same name with perfect bodies and lots of money - only in the movie, the blond girl doesn't have any money at all. But don't worry, when she really needs it (for a dress), her friends have gift certificates.\n\nSure enough, no one would like to see a movie with a bunch of fat teens running around acting silly but did the movie have to star four slender girls with attitude problems? Because let's face it, these girls think that appearance is the most important thing in the world. They're seriously not much better than their enemy - Meredith. And by the way - how did the word 'brat' become a positive word? For me it's still a very negative word meaning that your parents have spoiled you.\n\nBratz doesn't want to give its core audience (small girls) a good message. It wants them to realize how important fashion and appearance is - and if you have an ugly outfit on - always make sure to keep a fashion emergency kit with you. Ugh."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Quinoa1984",
        "review_rating": "2",
        "review_title": "thoughts from a grown man about a movie based upon dolls who've spent 100 hours a week at the mall",
        "review_detailed_main": "Let me be clear here first of all: I'm in my twenties, and I saw Bratz, but not for any kind of simple lewd intentions at gawking at sexy teens in gobs of make-up and slutty clothes. My intentions were a little more pure, on a movie-geek level. Or rather, I went in with the expectation that it *would* be a bad movie, and even one that would go to such ridiculous lengths as to be awesomely bad, to the level of something like Ghost Rider, where taking it seriously would provide brain damage, and by not would give some form of entertainment (especially if you have friends to make jokes with during the movie, which for something like Bratz isn't inappropriate to 'ruin' for the rest of the audience). It's a staggering, warped view of high school life, the connections made in 'cliques' and social order, and about the bonding between girls who can't get enough of talking to each other through their web-cams. It also has enough montages to kill a few horses, Jon Voight with not only a prosthetic nose but a statue of his head with the same fake nose, a fluffy dog who gets beauty treatment along with her owner, a mariachi band that lives at the house of the Hispanic girl of the Bratz (and, for some reason, this doesn't seem too out of place, especially when they show up at talent shows), and...Jesus, did I mention the montages?\n\nBut for all of this, if one is in the right frame of mind, it's hilarious, even achingly and hysterically, funny material, whether it was intentional or not. Frankly, I'm sure that the filmmakers didn't quite know what they were doing outside of making a big long commercial with the intellectual value of Tropicana fruit punch. But on those levels it almost works at times at looking like an unintentional satire; what is one to make of the symbolism of the heightened security at the high school envisioned by the school emblem and trophies: a hand holding an ax, with little figures holding the axes all over the school in one form or another? It also makes for some ample absurd moments when just seeing the four Bratz having a fight amongst themselves about sticking together or going off into their other interests (naturally, they have only one aptitude a piece, one soccer, one cheer-leading, one science, and one journalism/singing), and as well the diabolical attempts to thwart all of their fun by the nasty, less than one-note daughter of the principle, who goes for a 2nd super sweet sixteen party even after she's turned 16.\n\nMaybe if you're already quite a young girl, seeing this movie might not matter too much in the grand scheme of things as far as real psychological impact. But at the same time if one were to look objectively, Bratz's message is a little scrambled and quite off in any positive aspect. Does one stick with friends or act individualist or, um, like, go into another clique or another table? How about staying fashionable, in the glammed up style that the girls go to lengths to do- leading up to, of course, the Bratz mobile that they walk out of to the climactic talent show- even in the face of peril? It really doesn't serve any artistic integral purpose whatsoever either. So, in the end, it works best as a so-bad-it's-still-bad-but-uproarious treat for those who gorge on works that slip by in pop culture that are so sapped with the vigor of commercialism that to read through the mixed messages would take a pot of coffee and a fine-toothed comb. But along the way, it's got montages, and songs, LOTS of songs- which are, as one might imagine who doesn't listen to Radio Disney, the worst trash possible right now. Brattitude!!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "so_calhunni",
        "review_rating": "2",
        "review_title": "simply awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "editor-299",
        "review_rating": "1",
        "review_title": "By far one of the worst films - ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "jameswestinghamiii",
        "review_rating": "1",
        "review_title": "Aaaaugh! My Eyes! My Ears! My Brain! All Ruined!",
        "review_detailed_main": "Aaaaaaauuuugh!!!! This movie was so awful it makes me wish I had been struck blind and deaf as a child! I watched it with 2 friends, to try for an MST3K style viewing but.... it doesn't work!!! One of my friends became very still, and started attracting flies halfway through the film, and another one became temporarily quadriplegic from watching this! I'm 20... I haven't cried for any reason since I was 12, and this movie brought me to tears. Not from laughter, not sadness... it was SO bad, I had no emotions that could be connected to this film, and I just started crying because nothing else quite fit. If these people tried to perform like this two thousand years ago, they would have been stoned to death. The acting was so terrible, I think I lost my faith in mankind. The materialism in this movie was so... I can't even think of an adequate adjective to describe it... No wonder there are countries that want to see our way of life crumble... after seeing this movie, I almost agree with them. The MST3K guys would be speechless, watching this. It's so awful, no one could possibly lampoon this movie. It's too terrible to properly mock and satirize. I feel really terrible for the companies that sponsored this. They really lost out on this investment. The attempts at throwing in messages about individualism and inner strength would have worked, if there hadn't been the \"be yourself, but dress fashionably to be accepted\" message splayed across this film like roadkill. It's a good thing I didn't have any forks, or acetylene torches nearby... or I would have tried to stab/burn my brain out. I seriously considered gnawing my own leg off several times, to escape watching this film. I actually lost the ability to breathe after about 40 minutes of this film... I eventually remembered how, but it took a while. Not good... My roommate has completely lost his mind... he asks questions like, if Darth Vader showed up at our door, should we hang out with him, and some remarks about hollowed out breasts and orange juice... he's completely lost his mind.\n\nDon't watch this movie if you value your sanity!!!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "nightmare975",
        "review_rating": "1",
        "review_title": "What a way to ruin a birthday party.",
        "review_detailed_main": "Ugh. The first words that came out of my mouth when I found out my friend's sister wanted to see this for her birthday. First off, I have never bothered to play with Bratz dolls once in my life, nor will I ever. This movie has got to have some of the worst dialog in a movie ever. (Note to script writers: If you really have to put \"OMG\" as an actual spoken line, then I think it's time to rethink your career) After this monstrosity finally ended, I looked to my friend and we looked to her sister, who then informed us that the movie was horrible. In the words of the Bratz Girls: \"Like OMG! No way!\" Seriously, if you want to ruin someone's birthday, then I recommend Bratz: The Movie."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "ultimecia_omega",
        "review_rating": "1",
        "review_title": "This movie is the worst",
        "review_detailed_main": "I was just reading some comment before i decided to make my own, this guy honestly believes this film deserves a 10/10 rating. Yes that's right, according to this guy the film Bratz is a perfect masterpiece with impeccable acting, dialogue and story, backed up by Oscar worthy directing and screenplay. At least that's what a film with a 10/10 rating should be. Bratz is not. This is possibly the *worst* film i have ever seen. This film does not even deserve a 1/10 it is that bad. Im not trying to spite this film, i am honestly speaking my feelings for this film here, i have never felt more insulted, never have i cringed so much in a film and i actually felt embarrassed by some of the scenes i have had the misfortune of watching.\n\nStay away from this film at all costs. It will scar your brain forever."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "chambers-dc",
        "review_rating": "1",
        "review_title": "This film has put me off moving to America and/or having children",
        "review_detailed_main": "Well...first off..just why. If the intention of writing this film was simply because the last time a movie has been this cringe-worthy was Britney Spears' Crossroads, then the idea was a nail hit directly on the head.\n\nIf you feel any emotion, be it happiness, joy, elation or even sadness (in context to the film, as opposed to its existence) during the running time of this film, you are unfortunately a biased person...or are 2 years old, in which case you would not have the mental capacity to read this or form opinion throughout the film...except for when to soil yourself during its run time.\n\nThe sad truth is that this film was surely doomed from the start. No-one would in their right mind would write, direct and produce this film, under the impression that anyone would actually enjoy it except for toddlers...and, unfortunately, that peculiar clique...young girls who actually assume that they and there friends are actually Bratz.\n\n\"Oh, that film was totally written about us,\" they say.\n\nUnfortunately...it probably was."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Rubydog06",
        "review_rating": "1",
        "review_title": "An utter disappointment",
        "review_detailed_main": "Worst movie ever. Luckily, I didn't go to it with high hopes. The acting was horrific, the entire way through I had a strong urge to strangle every actor/actress who participated in it, as they could simply NOT act. The four main characters were so plastered in makeup, I couldn't make out what they actually looked like. The plot, lines and scenes were so cringeworthy, I had to look down and pretend I was somewhere else.\n\nThis is coming from a twelve year old girl, so don't think it's biased. I have never, ever willed a movie to end before, but I found myself considering walking out of the theatre. I sincerely hope someone realizes what a mistake this movie was, and destroys all proof of its existence. No one, not even children, should ever have to set eyes on this abomination.\n\nThe person who let this crap be released does not deserve to be involved with the movie industry."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "lori_lori_lori",
        "review_rating": "1",
        "review_title": "A new fund raiser for Lanie and Jon!",
        "review_detailed_main": "My youngest two will not be seeing \"Bratz\" as I could not find anything about it worth merit in the preview. I do not allow the collagen-laced plastic ladies in my home, thinking it would be better to invite professional women of the evening to my home to play with the girls than the molded mini-ho variety. At least they would learn some class and depth. My girls will not grace the movie in the theaters (I am sorry I did), and it will NOT come to our home when in DVD.\n\nBut I digress. Obviously, those veteran actors of rich talent, Lanie Kazan and Jon Voight, have some sort of money troubles. For both of them to appear in this, they must have reached dire straits indeed! I cannot begin to imagine what financial crisis both of them face, but appeal to the Industry: Please- You all take up causes and collections for everything from flood victims to stray presidential candidates. Can't you once help your own, and start the Kazan-Voight Foundation? They will appreciate your assistance, and not have to stoop to such menial prostitution of their talent!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "fabulousarah",
        "review_rating": "10",
        "review_title": "Guys - sit down.",
        "review_detailed_main": "So, my friends and I were searching on demand forever and couldn't find anything to watch. I see this film on the list, no idea what this movie is, but knowing well of the dolls. Thought it might be an animated movie or something else to keep us entertained. So I say \"F*** it we're watching Bratz.\" and we did. It's a Saturday night and we are juniors in high school - our expectations aren't high.\n\nTo start off, let me say that I know for a fact that this film was obviously in no way meant to be taken so seriously. I literally made this IMDb account just now simply to write this review for this movie. I see reviews of other members saying things like (a-hem), \"No-one would in their right mind would write, direct and produce this film, under the impression that anyone would actually enjoy it except for toddlers...and, unfortunately, that peculiar clique...young girls who actually assume that they and there friends are actually Bratz.\", or \"If you really have to put \"OMG\" as an actual spoken line, then I think it's time to rethink your career\", or even, \"It makes high school seem like a horrible place full of cliques and a mean, prissy, \"boss\" figure that runs the whole school\"\n\nMy God. You people need to relax.\n\nWe were all laughing hysterically the entire duration of this movie. This is literally one of the most bizarre things I have ever seen. But from the intentional overuse of predictable stereotypes of teen behavior/society in general, mixed with a good helping of cliché 'heartfelt' moments, we couldn't help from being amused.\n\nThe budget was incredibly high. It is undeniably a very quality-made/high-end film (cinematography-wise). So in that sense its also pleasing to the eye. Very colorful. Lot's to look at.\n\nIn comparison to a movie like Clueless, of course this film doesn't compare. But it is completely different. This is a movie about BRATZ DOLLS we are talking about. Bratz. As in, the child's toy. Expecting a Bratz movie to accurately depict high school life or common social interaction or whatever else you think it should have, is mad.\n\nHowever I do know that this is a film I will never forget.\n\nI will always have these fond memories of watching this astonishing film with my friends on a Saturday night. Being blown away by how outlandish it was, but enjoying it thoroughly as a fun movie night with friends.\n\nSo let's chill out."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "cassandrebouchard",
        "review_rating": "7",
        "review_title": "I actually quite enjoyed this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "thecaliforniabug",
        "review_rating": "1",
        "review_title": "It was long, stupid, slow, boring...",
        "review_detailed_main": "Okay, it looks like this film was created to do two things; Obviously, the first one is to give little girls another movie to add to their collection of princess/bubblegum memorabilia. The second one was likely to keep some of those girls off the street for at least two hours. For about a week, they (the makers) seemed to have accomplished both of those. On top of that, some parents decided to tag along because of the perception that is was good for the entire family... They couldn't have been more WRONG, because it seemed like a dumbed-down version of 'The O-C', written in a day care center. On top of that, girls who DO watch this film will be(or have been) convinced that they must be hip and cool to survive. In its time, the Bratz enterprise has killed more brain cells than a MILLION Coca-Colas. And there's NO upside to this film! It was long, stupid, slow, boring, obnoxious and incapable of keeping anyone's attention without using a weapon of some sort! I ask all you fine people, \"WHAT DID ANYBODY SEE IN IT?!?!\""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "StevePulaski",
        "review_rating": "5",
        "review_title": "Smarter than your average doll, which is saying a great deal for this film",
        "review_detailed_main": "Bratz, based off the wildly popular line of dolls, is actually a much more tolerable film than the one I was expecting to be greeted with. Rather than a shallow, frothy, candy-colored stroll through ditzy women, inappropriate fashion, and immature circumstances, I received a mildly-entertaining, high-energy romp filled with attractive leads, all of whom at least carry their part with some semblance of conviction, acceptable, if scatter-plotted themes and ideas, and a pleasantly fun diversion through the world that sort of mimics our reality but still finds itself wholly trapped in cinema's, family-friendly kind of reality.\n\nMake no mistake, Bratz isn't really a good film and it wouldn't be the first thing I recommend your daughters see. However, for a film that concerns three teen girls who are obsessed with fashion and self-expression, we could've been handed a much more harmful piece of cinema. Even as a male child, I always wondered why so much outrage and hate was directed at Barbie, who predicated herself off of being a good-natured sweetheart, was always the subject of vehement feminist controversy while the Bratz doll-line went under the radar, with their skimpy attire, makeup-heavy faces, and distracting artificiality. You want to talk about giving young girls the false sense of beauty and exercising the gender roles? The Bratz essentially were telling them not to leave the house without a tube-top, eyeliner, and eyeshadow.\n\nBratz follows four lifelong best-friends - Cloe (Skyler Shaye), Yasmin (Nathalia Ramos), Sasha (Logan Browning), and Jade (Janel Parrish) - as they enter high school with an attitude to keep each other as close as possible. However, they are heavily burdened by the idea that the self-indulgent, wildly narcissistic class president Meredith Baxter Dimly (Chelsea Kane) wants to identify every student by what clique they should belong to, forcing nothing but social segregation in the already ominous halls of high school. Of course, Meredith finds the free-spirited girls disgusting and offsetting to her plan, but finds little to worry after two years of high school.\n\nYes, by junior year, the lifelong friends have become nothing but faces in crowded hallways to each other, drifting towards their own sort of cliques, falling victim to Meredith's plan to keep all students part of their own little class of people. Cloe becomes invested in soccer, Sasha becomes a gifted and determined cheerleader, Jade embraces her inner-scientist with the chemistry club, and Yasmin sort of watches it all happen, while quietly participating in journalism. Yet the girls are brought together by four colossal, incredulous misunderstands at lunchtime, which reminds them that they have fallen prey to Meredith's system. Upon reuniting the group to prove that they can still be inseparable and devoted to each other, Meredith sets out to destroy the girls by recreating the party she threw for her sweet sixteen, making it even bigger and better, which she hopes will propel herself to the known voice of the school while the four girls wallow in their shame.\n\nI laud Bratz for at least doing what I never thought would be done in one of the most ostensibly shallow teen films of the last decade, which is etch some solid, vital commentary about high school into its material. While many films have addressed the abundance of cliques and groups in high school, Bratz recognizes the problem with it, which is that kids get the idea that they shouldn't be seen with kids of different cliques, which stunts their emotional and mental growth all the more. Yes, Bratz would be better if it didn't make the cliques so overblown and farcical that they tread the line of being part of a high school satire, but its acknowledgment of a real problem in a pleasantly real way is actually heartwarming to say the least.\n\nThen there's the abundance of singing, dancing, and just hanging out these girls do, which is surprisingly fun and enjoyable, given how shallow it sounds. These are teen girls being teen girls, minus the sarcastic and childish lingo utilized on contemporary kids shows like iCarly and Victorious, but also without the biting wit and commentary of something like Mean Girls, one of this particular's decades smartest teen films.\n\nBratz essentially wants to be a flashier, more stylistically-potent Mean Girls, but its reliance on scenes that are too goofy and ridiculous to be taken seriously and its repetitive nature are what hinder it from living up to what it could be. The visuals are eye-popping, the music is catchy, if existing from the often forgettable subgenre of bubblegum pop that expires quickly, and the four leads are all charming with their smiley charisma and micro-mini fashionista sense, but the film simply has too much going on to really settle on a focus and it bogged down by scenes that are either not funny or heavy-handed in their moralizing. But the fact that there's moralizing in a film called Bratz, taken from the line of dolls that look the way they do, is surprising enough, giving the film much more leverage and likability than I could've ever imagined.\n\nStarring: Skyler Shaye, Nathalia Ramos, Logan Browning, Janel Parrish, and Chelsea Kane. Directed by: Sean McNamara."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "i_am_momo",
        "review_rating": "3",
        "review_title": "too many montage songs",
        "review_detailed_main": "Bratz is not a good movie. It has a lot of stereotypes. It was trying to be one of those chick flicks but did not achieve. The deaf representation is not good. Deaf people are not just all the way deaf. Deafness is a spectrum. Plus nobody would ever read lips that far lol. If you want to watch Bratz, I recommend watching the cartoon version (the superior)"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "flio191",
        "review_rating": "3",
        "review_title": "sweet Jesus biscuits, that was bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Rob_Taylor",
        "review_rating": "1",
        "review_title": "A movie based on doll ho's....what could possibly be bad?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Rainer255",
        "review_rating": "1",
        "review_title": "If I was suicidal and this movie was the deciding factor for my life...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "kimbow1991",
        "review_rating": "5",
        "review_title": "It's not that bad!!!",
        "review_detailed_main": "OK, so everyone's on here slating this movie and I just have to say, it's not that bad.\n\nIt wasn't exactly my choice to go see this, but I thought I'd save my parents the pain and offer to take my little sister to go watch it. This film was actually surprisingly popular. MY friends wanted to see this (despite being sixteen) and my 14 year old MALE cousin went to watch this, with his girlfriend and friends of course.\n\nWell the start, despite these girls having a 'passion for fashion' they didn't half look a state, but the thought was there - I supposed. At times theplot seemed a little trivial and the singing, well lets leave it to the HSM lot next time. Despite this the heart of the film was in the right place.\n\nIt had a strong message about sticking with your friends and showed the value of friendship. To be fair, this movie could have been Oscar worthy and still been slated, just for having the 'Bratz' tag.\n\nSo despite what everyone seems to be saying by watching this film (and playing with the dolls) your children are not going to be brainwashed and filled with messages that they must dress like a hooker.\n\nIf you watch this expecting it to be what it is, a movie for young girls about fun and friendship, then you won't be disappointed and neither will the young girlies in question."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "ericapearson",
        "review_rating": "10",
        "review_title": "This is amazing!!",
        "review_detailed_main": "I don't know why everyone says this is a bad movie but they clearly have no taste. I've been watching this since I was a kid and it has a great story line and the actors are awesome as well!! I love it!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "captainawesomnessnes",
        "review_rating": "7",
        "review_title": "It's surprisingly good",
        "review_detailed_main": "I genuinely think it's a good movie, it's got a below average plot and the acting is from about E-list actors, but there's something really nice about it, it's really quite nostalgic for me and the fact I could relate with this when I was younger, idk but generally it's really appealing and although it's got shitty reviews, it's on Netflix and Lovefilm, won't cost you any extra but I do recommend it. The film in itself is about 4 girls who are completely different however, they still have a close bond, but as they go through school they get split apart by the things they like and within two years, they've almost forgotten each other. They vow to change however it's difficult and that's all I'm really gonna say, it's pretty corny but it's not bad once every so often, eh?"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "xxlittlemissnaughtyxx",
        "review_rating": "1",
        "review_title": "I Felt Violated",
        "review_detailed_main": "As a teenager- I enjoy cheesy pre-teen films- just for the laugh. However, after I saw this- I felt violated. Girls at that age never say 'OMG' or 'BFF'. There is cheesy and just stupid! I also think it sends out a really bad message to pre-teens or younger girls; all these girls are too pretty and no one can be so popular and likable and it happens that they all get guys. I can't think of a worse film I've seen, and I've seen a lot of crappy films. The acting was rubbish and the actresses who are supposed to be 16 or 17 actually look like they are 30! And what I hated most of all was how unrealistic it was; it just happened that they could all sing, dance, and bake! And it so happens that they are all pretty. Whoever would watch this film more than once should be shot! Don't watch it unless you want to waste two hours of your life..."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Nkiruka-am",
        "review_rating": "1",
        "review_title": "Perpetuating All American Stereotypes",
        "review_detailed_main": "This movie..... Was a cornucopia, an easter egg basket even, a bucket full o' American Stereotypes! Particularly with the characters. You could literally point every stereotype out within say 7 minutes of the movie. Let's start with....\n\nYasmin: Your typical, American written \"Mexican\". One house, one family, 500 people.\n\nSasha: Apart of your typical \"African Anerican\" family. Divorced parents, jumping between living at both parents houses. Parents wont speak to each other\n\nCloe: Simple. Typical dumb, sporty, clumsy and ditzy, but amazingly gorgeous blonde.\n\nMeredith: Typical Blonde, Rich little \"daddy's girl\" who always has to have her way. And of course, leader of the Popular Group at school, with her brunette and ginger sidekicks. Oh yeah, also undeserving Student Body President. Yup, Daddy's the principal of the school.\n\nJade: Typical Asian-American girl with strict mother who over burdens her with academic work, Jade has to act like she loves all of it, but has a secret rebellious side.\n\nIf that doesn't scream American cultural movie character stereotypes, I don't know what does. And I found all of this out within I kid you not, less than 7 minutes of watching this movie."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "johnnymacbest",
        "review_rating": "1",
        "review_title": "I let my case speak for itself.",
        "review_detailed_main": "This film was doomed to fail from the start. I mean, c'mon, a film based on little sexualized urban \"Barbies\"?!?! Its just amazing what Hollywood would do to make a quick buck out of this derivative piece of uninspired pretentious \"image conscious\" POS. The main \"characters\" are just clones of those from yesteryear of film. Put simply, this film just plain sucks. IT SUCKS!!! John Voight, has, up to this point, belittled himself to the detriment of himself...literally. What actor would star in this? Is it for the money or to push up against these \"beampoles\"? The main idea of this film is image, just what perception of image as laid out in this film is anyone's judgement.\n\nLittle kids or fans of these \"Urban Barbies\" may like this film for its \"merit\" but only from a kid's point of view. Adults, please take heed and do your best to try and wipe this film's existence from your mind. Like Morpheus said to Neo in the Matrix: Free your mind."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "dreasura",
        "review_rating": "5",
        "review_title": "Rethink your expectations before you see this movie.",
        "review_detailed_main": "When this movie came out in theaters, my daughter was a Bratz fanatic and I thought I was going to be tortured by bringing her to see it. I was wrong. My expectation entering the theater was that this was going to be the cheesiest and lamest thing since Josie & the Pussycats. Instead, I was pleasantly surprised. Many people are quick to review poorly, but you have to wonder why any self-respecting 20yr old would see this movie without children in tow? This is a children's movie. There is a time and a place for everything, and this movie has a limited target audience; it is aimed specifically at the teeny-bopper age!!\n\nI ended up liking it because it brought me back to my childhood and my own experiences with \"mean girls\" and cliques, and it helped me have a wonderful conversation with my daughter afterward. There is some merit to a movie that can touch upon a girls coming of age & self worth.\n\nI suspect that many bashers of this film are also on the Anti-Bratz bandwagon, and likely think that Barbie is the queen of dolls. My own opinion about Barbie is; If she \"can do anything\", why does she need her mother to have a baby for her? Maybe my own Barbies were risk-takers, but they loved the GI-Jo's in the neighborhood. Ken was a sappy pretty boy with no personality. I preferred the funner Dawn dolls and their ilk. Plus they were smaller, and more portable."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "mccurdy_moses",
        "review_rating": "",
        "review_title": "BRATZ a Actual movie? ........ Awesome!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "hakkai_kira7182",
        "review_rating": "5",
        "review_title": "It wasn't THAT bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "JL2021",
        "review_rating": "1",
        "review_title": "Don't watch it",
        "review_detailed_main": "One of the worst movies. Its like a student short but feature! Why does it even exist, how they were able to pitch that awful script to get budget?!\n\nSo many questions, not enough answers.\n\nLets start with the actresses. Its so clear that the only one person who knows at least remotely how to ...perform lets call it... is a black hair girl. No clue what is her character name, they all are so plain, blend together, there no depth of the characters, that it doesn't even make sense to differentiate them one from another while watching.\n\nHowever let's not to blame these girls for the poor acting result. Without blaming the director! Well it seems like the director (Sean McNamara) is specializing on this kind of level movies. He evolved a bit with his another movie from 2022. And its only fair to mention that at 2007 when Bratz were shot he was less experienced so he might (definitely did) overlook poor acting, betting simply on high pitch voices, wide smiles, vividly sad emotions.\n\nOverall overacting, constant music, bad script and lack of logic in dialogues are simply destroying this movie.\n\nThis movie was probably okay-ish for mid scholl girls back in 2007. But nowadays its not classic, good or funny, its bad taste poor quality movie that has to be forgotten.\n\nUnfortunately I had to watch it against my will."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "springsunnywinter",
        "review_rating": "2",
        "review_title": "Terrible but not the worst movie ever",
        "review_detailed_main": "It's very difficult to write a long review for this film because there isn't much in it to talk about. Bratz was on the bottom 100 when it was on the cinemas but still has a very low rating, which is fair enough. It had a very simple story that wasn't even told very well and I only understood it by reading it on paper not on screenplay. It was boring with many daft scenes like when one of the four girls was changing her clothes while the other three were covering her. Probably it is specifically made for girls but my sister didn't even like it although she is a huge Bratz fan. The movie was quite bad throughout but the ending was good & saved it and that's why I'm giving it a 2 out of 10. I can't say that it is the worst movie ever because no film can be worse than Pulp Fiction and Jackass part 1 & 2. The food fight scene was creative at start then was very funny. Most users either gave it a 1 or 9 out of 10, which means that you can either really hate it or love it but 10/10 means perfect, which definitely isn't. Overall I didn't like the film but I absolutely did not hate it as well because it did not bore me to death and I have seen much worse films."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "carolineggordon",
        "review_rating": "5",
        "review_title": "Only for the under 10's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "sammy-j17",
        "review_rating": "10",
        "review_title": "So bad it's good",
        "review_detailed_main": "This movie is awful. Many of the actor's performances in this movie are cringe-worthy, and make you wonder why they were ever cast in this movie in the first place. The script is corny, the plot follows a cliché formula which appeals to a very specific demographic (5-10 year old girls who play with Bratz dolls). The only redeeming factor in this movie, for me, is the soundtrack, which actually sold a few copies and received many good reviews in contrast to the movie, which was labelled instantly as a shocker.\n\nHowever, I find this movie so bad, the performances so cringe-worthy and the plot so overused that it is actually appealing. The director has directed episodes of a Disney shows like Phil of the Future, That's So Raven and Even Stevens, so it's clear that he is compotent.\n\nSo bad that it's good."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "tessier-jenifer",
        "review_rating": "7",
        "review_title": "It's a kids movie !! Deal with it!!!",
        "review_detailed_main": "I just want to say this movie wasn't made for an adult or a teenager it was made for kids, the kids who play with the dolls, and watch the cartoons. So the fact that you \"didn't like it\" means nothing, unless you enjoy the dolls and cartoon. This goes for the one comment, on how the person writing hated the movie, but the six year old girl loved it, that would be because she enjoys thinking life is all about school and clothes. If it was made for anyone over the age of 14 it would have been quite a bit different.\n\nAlso, If you are going to bad talk a kids movie because YOU didn't like it then hopefully you have some interesting reasons to back the opinion up because believe it or not people do use this as a judging point unfortunately. So they see a bad comment from a 19 year old who wanted to see a Lindsay Lohan movie with drama but got a g rated kids movie about clothes and popularity."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "aimless-46",
        "review_rating": "2",
        "review_title": "I Was Dazed and Confused",
        "review_detailed_main": "It's been a weird day. My air conditioner went belly up and I sought refuge from the 100+ degree heat at my local mega-multi-plex, buying a ticket to the \"Bourne movie\". After 20 minutes of that movie's self-conscious unsteady-cam filming technique I was feeling a little queasy and bailed. Stopping at \"Bratz\" to recover my equilibrium before seeking a refund and an airsickness bag. What I saw was a totally empty theater (zero people) just two weeks after the movie's release.\n\nI couldn't find much similarity between the teen actresses and the dolls (the dolls are all a lot cuter). What strikes me as interesting is not the content of the movie but the fact that it was given a wide theatrical release. The inventory of films must be pretty low if they have to send this anywhere but direct to video.\n\nAs already pointed out this is \"the single most shallow, insignificant, poorly-directed, badly- acted movie of this year\", or maybe any year. It also has about the narrowest target audience possible for a mainstream film, 3 to 9 year old girls with an infatuation with clothes, shoes, hair, and make-up. They must be serious girly-girls, your soccer and softball playing daughters won't find anything to relate to here.\n\nBut I'm not sure if the complaints about the message behind the film are really valid. It revolves around four multi-ethnic BFF teen girls who have nothing in common except their fashion trend value systems. Now this would be bad if the characters were played by beautiful young actresses in a school full of gorgeous likewise beautiful girls with perfect bodies. Which is what you expect from the standard pre-sold teen movie. But instead Yasmin (Natalie Ramos), Jade (Janel Parish), Sasha (Logan Browning), and Chloe (Skyler Shaye) look ready to pledge a dogs, pigs, and elephants sorority. For a while I thought I was watching an episode of \"Animal Planet\". Meredith (Chelsea Staub) was a pleasant exception in this school's bovine to canine parade.\n\nThey look more like four homely college freshman than hot high school fashion types and the student body looks just as bland. Whatever happened to the days when starlets got parts based strictly on their beauty with their acting skills irrelevant? Of course acting skills were just as irrelevant in these casting choices. Which leads to the obvious question of how a group of people so average looking and so clueless about the thespian profession happened to all wonder onto the set of this movie looking dazed and confused. The point being that no little girl is going to get an inferiority complex or suffer from an eating disorder because of watching this movie. The producers have unintentionally managed the positive message that no amount of expensive clothes, shoes, hair, and make- up can make an average girl look like a hot teen actress.\n\nSpeaking of wandering on to the set looking dazed and confused, Jon Voight plays Meredith's father and the school principal. Now I realize that the highlight of Voight's recent career is a \"Seinfeld\" cameo and his teeth marks on a pencil, but appearing in this mess is the equivalent of Bela Lugosi working with Ed Wood in the 1950's to support his drug habit.\n\nThe movie concludes with a loud and irritating musical number which I suspect was inspired by the success of \"High School Musical\".\n\nThen again, what do I know? I'm only a child."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "ttandb",
        "review_rating": "",
        "review_title": "Only go if your daughter holds you at gunpoint!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "grkamerican1984",
        "review_rating": "1",
        "review_title": "what has the world come to when a film based on dolls that teach girls to be sluts is made?",
        "review_detailed_main": "this movie is the worst thing ever made. even worse than Jaws the Revenge. My little cousin (girl) likes Bratz (the dolls)and had thoughts about seeing the movie. well i'm glad she didn't see it! this movie and the dolls teach little girls how to be sluts. that girl meredith was the most annoying little bitch i've ever seen on a movie screen, the four lead actresses are just your typical 20 something year old whores who can't act trying to make it big, and not even John Voight (that's right, JOHN VOIGHT) could save this film. I'm very close to my little cousin, and she looks up to me. i personally told her not to see the film because it would make her feel unpretty and stupid. i'm very glad she followed my advice. if you're a shallow low-life crackhead who thinks fashion and acting like a bitchy slut is what life is all about, then this movie is for you. i'm serious this movie is so bad, bad acting, stupid plot, and EXTREMELY ANNOYING CHARACTERS. 1/10"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "CJ_Thorpe",
        "review_rating": "1",
        "review_title": "This is bad and you should feel bad...",
        "review_detailed_main": "I've seen a lot of bad films, for comedic purposes, but this is by far the worst.\n\nI cant believe people are defending this as being \"A movie for little girls\". If you show this movie to children, you are a bad parent.\n\nIts the most vapid \"film\" in existence and will do nothing but breed future contestants for \"The only way is Essex\" and \"Jersey Shore\"."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "This film is quite good if you are looking for a DVD for a relatively dumb and very undemanding teen or pre-teen. Otherwise, you couldn't help but do better.",
        "review_detailed_main": "Why would a 49 year-old guy watch \"Bratz\"? Well, he could be a totally sick freak (I swear, I am not...though that's what freaks would say also...but I am not!!). But in my case (again, I swear) it's because I have a goal of seeing as many horrible films as possible before I die. I am not talking about run of the mill bad--those films I avoid. I am talking about really, really, REALLY bad movies. So, after seeing all 50 of the films on Harry Medved's amazing book \"The 50 Worst Films of All Time\", I needed a new challenge--IMDb's Bottom 100 list. While I have made a very impressive dent on this list, some films (such as the Turkish ones) are just about impossible to find with subtitles or dubbing AND they keep adding films all the time to the list (such as \"Bratz\" which only recently entered the list despite being released in 2007).\n\nI should point out that technically, \"Bratz\" is not a bad film in the traditional sense. The cinematography, sets, costumes (the the girls wear thousands each) and music are all very professional--so I think a score of 1 is unmerited--even if it IS a vacuous film. When I say vacuous, I mean that it is written with no subtlety and is designed for incredibly stupid kids in the 10-14 age bracket. Now if you have a valueless, undemanding and rather clueless kid in this age group and you like them to be this way, then perhaps it IS a film to rent or even buy. After all, while very, very stupid, the film is squeaky clean--as the corporate types behind this mega-marketed film know this would make the film non-threatening and acceptable viewing for this age group.\n\nSo why is the writing so bad? Wow...this is like shooting fish in a barrel! The characters are all completely one-dimensional and more caricatures than something written by a professional screenwriter. The nasty girl at school is 0% real--but so are the four 'Bratz'. These girls are all PERFECT and represent carefully coiffed images--sort of like junior Spice Girls. One is great at math and science....and hot. One is great at music....and hot. One is brilliant....and hot. And the other is great at sports...and hot. This film is about their fabulous adventures in high school*.\n\nNow I must interject something that really bothered me about this film. As I mentioned above, this is just a corporate attempt to further whore off the Bratz name. The Bratz dolls are marketed to young kids--very young kids. And, in a completely cynical attempt to be BOTH non-threatening and pretending to be inclusive, three of the Bratz are ethnic. Now I am NOT talking ethnic is a real manner. Nope. It's a CORPORATE style of ethnicity. The black girl has non-brown eyes, talks EXACTLY like any white kid and is groomed just like a white kid. The Asian kid is vaguely Asian and you only know that she is part Asian at the film's conclusion when you see her mother. And, the Hispanic kid looks 100% non-Hispanic white and speaks with no accent and throws out occasional Spanish words for no discernible reason. As for her family, like the actress they don't look or sound the least bit Hispanic (Lainie Kazan?!). When this girl and her mother sing \"La Cucaracha\", it is pathetic--with no accent AND they don't even know the words! But wait...they at least have a disabled kid, right?! Well, sort of. He's hot, does NOT wear a hearing aid or cochlear implant (they would be SO gross....ewww!!) and yet, inexplicably, speaks perfectly and seems to function 100% normally. In fact, to deafness, he's a lot like what Daredevil is to blindness!! I really think that the corporate-type schmucks responsible for this terrible film just think that REAL blacks, Asians, Hispanics and disabled kids are not stylish enough to be in a Bratz film.\n\nA few final quibbles. First, how did Jon Voigt get in this film? Does he need the money THAT badly? If so, I am sure we could all take up a collection to help him avoid similar mistakes in the future. Second, I cannot believe that the film managed to insert classical music into it--making me almost hate the tunes. Third, I know I am thinking too much here, but who would let the bad girl bring a dog to school? I know her dad is supposed to be the principal, but bringing along a dog (obviously a knockoff of \"Legally Blonde\") just shows bad writing (duh...this IS a bad film!!). Overall, I see \"Bratz\" as a vapid, valueless and crappy film with no redeeming merits. And, given its place on the IMDb Bottom 100, I can tell that I'm not alone here!\n\n*Oddly, while the characters all appear to be about high school age, I cannot imagine high school-age kids watching this one unless you drug them!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "hovey1908",
        "review_rating": "1",
        "review_title": "Now I know what is being shown at Guantanamo",
        "review_detailed_main": "I have fortunately never been diagnosed with a terminal disease but I would imagine the shock of such an announcement would be on par with watching this movie. First off, the cast has the same racial make up as USA for Africa with a Latino girl hanging out with an Asian girl, a black girl, and what I originally thought was some lost member of the Russian Aristocricy but ended up being poor even though she had a huge house and her introduction to the movie dealt w/ her enormous shoe collection: funny, a movie that tries to break down walls still has plenty of stereotypes. Example, the Latino girl lives in a house with 674 people and one car, the Asian girl is good at math, and the black girl's parents are divorced.\n\nThese girls are ripped apart by some bizarre social system whereby everybody gets placed in a group like it's Red China. This system is created by a girl who never seems to graduate. There is a sequence where the movie fast-forwards by two-years and this girl is still the president of the student body and running the school like the Gestapo. Merideth, the girl in question, is easily the worst character in motion picture history. Steve Buschemi in Airheads is Jimmy Stewart by comparison. Furthermore, unlike most movie that do not make your eyes bleed, this girl who spends 100 minutes raping the soul does not even get her comeuppance. Like if Michael Vick was named chairman of PETA. The characters are, sadly, only part of the problem. Saying the whole portions of this movie are unwatchable is untrue, b/c that would imply that some parts of the movie are. From start to finish, Bratz is a step by step instructional manual on how-to-whore-out-your daughters, but keep them passionate about friendship. Several scenes in particular are horrendous: like a Super Sweet 16 party equipped with an elephant that is so mind-numbingly retarded that I was sent into anaphalectic shock and needed as epi-pen to be revived. Finally, the real atrocity in the Killing Fields that is Bratz is its includence of one Jon Voight. Before I had defined the lengths people would go to pay off gambling debt or meet the daily \"fix\" by referencing Kenneth Branaugh as Dr. Arlis Lovalce in Wild Wild West. No longer. Jon Voight is so ridiculous in this movie that you have to wonder if the producers had kidnapped his wife and blackmailed him. First off, they try to sneak his name in the credits so unless you are paying attention you don't even know its him. Next they disguised him as if he were snitching on the mob, complete with chotch mustache which only ups his creepy factor b/c he is constaly checking out the Benaton Ad that are the main characters. In Brief, theologists have their work cut-out for them since they have to explain how any higher power could have allowed Bratz. Even non-sentient beings will be driven insane. Keep the dog away from chocolate while it's on. Terrorist you have been warned."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "samzabbel",
        "review_rating": "1",
        "review_title": "A crappy movie....even for tweens!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Teen movie stereotype hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "denise-begmann",
        "review_rating": "1",
        "review_title": "I don't know what I expected",
        "review_detailed_main": "First of all, after reading some previous comments... I watched this movie on purpose. I played with bratz dolls when I was young and even had a few computer games, one of which was based on this movie. I have long growned out of the designated audience age but when I saw the movie on netflix I thought I give it a try.\n\nI was surprised to see some quite good actors in a seemingly horrible early performence. I give this movie a 1 star rating because it has no substence I could not enjoy it.\n\nHowever, consider that this movie is quite old and aimed at children, there was nothing else to expect. The actors where not given a solid script or plot to work out there full potential. They need to overreact and stay simple without any layers. This movie is supposed to be like this, for kids. A 1 rating for me as an adult. But if I would have seen the movie when I first longed for it (age 10 or something) I may not love it but probably enjoyed my time anyway.\n\nSoundtrack by the way... for this kind of movie surprisingly great!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "smaug327",
        "review_rating": "10",
        "review_title": "I thought it was a cute movie",
        "review_detailed_main": "I can not believe some of the comments I've read about the Bratz movie. I bought the DVD for my 7 year-old daughter for Christmas and we've watched it 4 times a day since then. I think you'll enjoy the movie more if you realize that the intended audience is 7 - 14 year old girls, not adults.\n\nMaybe it would have been more well received by critics if one of the girls became a drug addict, another was in abusive relationship, etc. The movie was meant to entertain young children and it did that job admirably.\n\nIf you're looking for a movie with a deep plot, then watch something else. If you have a young daughter, especially one who likes Bratz dolls, this is a movie for her."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "nataliabatsko",
        "review_rating": "6",
        "review_title": "Surprisingly, I didn't hate this",
        "review_detailed_main": "When I was younger, I liked Bratz, to be more specific, their Babyz versions. I also remember watching the Bratz Babyz movie and loving it. However, today I'll be talking about their live action theatrical debut simply called Bratz. It's one of the lowest rated movies along with the Emoji movie (I don't hate that movie either) and for some reason I thought it was alright, nothing spectacular or extraordinary but it's fine.\n\nThe movie starts with our quartet: Yasmin (Nathalie Ramos), Cloe (Skyler Shae), Sasha (Logan Browning) and Jade (Janel Parrish) going to college and being best friends forever! However, one person in particular Meredith (Chelsea Stubb) is a perfectionist daughter of the principal who wants to sort our main girls into clubs, thus separating them.\n\nBut our main characters will still be together no matter what and that annoys the antagonist so much, that she will do anything to humiliate them.\n\nWell, the whole setting reminds me of Disney channel's High school musical, even the villain is too similar to Sharpay by being a spoiled rich girl with a puppy in her purse. However, the whole musical aspect happens in the end with the talent competition. The story is ok, but can be a little weird sometimes. Like in one scene the whole school makes a food fight simply because a puppy pulled Cloe's leg and she dropped her lunch on Jade and then the whole college throws food on each other with classical music on the background.\n\nSpeaking of songs, they were pretty good, especially \"it's all about me\" and \"Brattiude\". Sure, they are not as good as songs in Bratz Babyz (these songs were awesome), but both singers and composers did try their best and are actually radio-worthy. The actresses were not that bad either, most of them are actually teenagers (with the exception of Skylar Shae, who played Cloe) and they act well. I also noticed that the movie talks about some issues like parental divorce, money issues, deaf students and the decision whether you should stick with your old friends or follow your passion. Sure, they are only briefly shown because of the fact that this is a movie for preteens, but the fact that it included such themes, makes this movie better than it should be. Of course, it's still has fashion and shopping moments like usually in Bratz movies, but it's not really the main focus and it still follows the plot about friendship.\n\nOverall, I would recommend this movie to girls of 8-12 years, high school musical fans and people who liked Bratz when they were younger. But it's not for Bratz haters, so if you are one, then it's better to skip this film."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "benjaminweber",
        "review_rating": "3",
        "review_title": "Racist, unimaginative trash",
        "review_detailed_main": "There really isn't much to say about a film in which a hispanic character lives in a crowded house with a mariachi band, and the Asian who is good at maths being wooed by someone using martial arts techniques. So instead, here's the haiku I was inspired to write while watching this:\n\nHate without ending My heart implodes with despair Death is eternal"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "DoreenXia",
        "review_rating": "",
        "review_title": "To know how others live their life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "The most cornball movie ever made?",
        "review_detailed_main": "There are some really awful kids movies, but this might just be scraping the bottom of the barrel. This has to have one of the worst scripts, dumbest premises, and characters who try to teach diversity through stereotypes. Only the very young can enjoy this, and everyone else will just hate it.\n\nSasha (Logan Browning), Jade (Janel Parrish), Yasmin (Nathalia Ramos) and Cloe (Skyler Shae) are all best friends and going into their first year of high school together, but at Dimly high school, you need to belong to a clique. Principal Dimly's daughter Meredith (Chelsea Staub) will make sure of this, as she hands out what clique each person will belong to. Eventually, even the four girls (aka the bratz) give in. A few years later, they are no longer friends, but thanks to a bizarre spontaneous schoolwide food fight, they become friends again. Now they must stop the school from separating everyone into groups and they must defeat the uber-popular Meredith.\n\nThis movie is filmed like a music video mixed with a commercial. There is constant use of slow motion, which grows obnoxious after one use, and the characters constantly stare at the camera up close, which looks like a mouthwash commercial or something. It's annoying.\n\nSpeaking of annoying...these characters....they are almost intolerable! Meredith, the antagonist is so ridiculously horrible to listen to. She must have no life, as all she ever does in the movie is try to make sure the school stays separated. It's like she has nothing better to do! Her super sweet 16 party is ridiculous, the song she sings is ear bleedingly bad, and her cronies are clichéd from bad kiddie cartoons. The main four girls are harmless characters, but they have such bad lines they become unlikeable quickly also. They almost act like they're five years old in their purity. Then there's the creeper character, Yasmin's little brother Manny (William May). He's supposed to be in high school, but he keeps hitting on Meredith's eight to ten year old sister. In a couple years this guy'll be asking for it when he gets sent off to prison.\n\nThe worst part of the movie are the lines. There is not a single interesting thing said by these characters, and almost every line is a horrible and corny line. The fact that a character says \"I've got the passion for fashion.\" is enough to shut this garbage off and throw the tainted TV in the trash. But it doesn't stop there. Most of the conversations here go back to my previously stated commercial comment. These conversations sound like one's from bad deodorant commercials or something.\n\nThis is just a horrible kids film. It will only appeal to little girls. Anyone else who enjoys it, well more power to them. For me, this is complete and utter rubbish.\n\nMy rating: BOMB out of ****. 100 mins."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "victoriamontanez",
        "review_rating": "4",
        "review_title": "Who doesn't love The Bratz",
        "review_detailed_main": "This was one of my favorite movies as a kid. As a theater major I do feel like some of the acting could've been better but again it's a kids movie and I still to do this day enjoy watching it. Bratz over Barbie!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "hishirey",
        "review_rating": "1",
        "review_title": "My soul died",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "crow30002003",
        "review_rating": "1",
        "review_title": "Wanna know why other countries hate us?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Queeniestarbucks",
        "review_rating": "1",
        "review_title": "I lost the will to live.",
        "review_detailed_main": "So we decided to watch this film, as a laugh. It was Very far from a laugh, it was terrifying and traumatising, The shrieking awful actresses with their squeaky voices running amok screaming 'BFF' and 'IT'S ALL ABOUT ME' sent traumatic shudders up my spine. This piece of tripe is not a CHICK FLICK, nor is it a kids film, it's a horror movie, that resides in your brain and destroys it after watching it. I can honestly say that, my brain is still in the process of recovering.\n\nThe deaf boy wasn't really deaf, I don't think i reluctant deaf boy would have learnt to lip read in such a quick time, nor speak properly. Furthermore, the final performance 'bratitude' is the WORST WORST WORST performance ever. No she cannot sing, and they cannot dance. =_=."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "AntonFokker",
        "review_rating": "1",
        "review_title": "lifeless, no effort, no personality and just bad for the intelligence of children. Just like the dolls.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "mechamortal20",
        "review_rating": "1",
        "review_title": "This movie is too much.",
        "review_detailed_main": "I was kind of forced to watch this when my girlfriend played it on our TV and I must say, I'm kind of angry at this movie. Just like all the other high-school movies, this movie is crammed with clichés to the teeth. There's the typical overwhelmingly snobby girl villain who suffers from severe narcissistic personality disorder who rules the school, implementing a segregating social caste system within it. The unrealistically active and thriving high school with people partying all over campus as if class never starts for them, and kids who care if four girls are sitting together at a table. All of these movies always depict this type of high school activity, yet I've never been to school where one beautiful girl calls the shots for the entire school. The cliché of the popular girl trying to bring down the main character because she shows a sign of not giving a damn who she is. The glorification of being materialistic is too much, as this seems to be a trait of every female in the movie. None of these girls are really separable in terms of personality besides the \"villain\"."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "tajaphorplay",
        "review_rating": "8",
        "review_title": "come on, ppl!!!",
        "review_detailed_main": "OK, for what this is, a movie for 5 year old little girls, I think it was great. My nieces love The Bratz, and for them, this movie is great. I don't understand why adults are watching this film and commenting badly on it. What were you expecting, an intriguing story, deep, heartfelt emotional scenes, from The Bratz movie??? Come on, you can't judge this like you would a movie for adults. So, for adults who have nothing better to do than watch children's movies and judge them as if they are Ebert, go get a life. For little preschoolers and elementary school girls, this movie rocks. I will give it 8 out of 10 stars. This movie encourages kids to step out and be themselves and to dress how they feel, regardless of what others say AND to set good examples for other people. So, all in all, I'd say this movie succeeded at what it intended to do, be enjoyable for little kids and promote a good message!!! Rock on, Bratz!!!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "KiteVega",
        "review_rating": "6",
        "review_title": "Entertaining enough...but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "SolidB",
        "review_rating": "1",
        "review_title": "the most horrible movie i've ever seen",
        "review_detailed_main": "Prior to this, i thought 'Hot Rod' was the dumbest movie ever, but no! There is this movie to the rescue! I pretty much don't understand how people could make something like this professionally. This is def. not for adults, but i believe kids shouldn't watch this too. It's just too dumb to be watched, either for kids or for adults. These people have gone overboard with whatever creative ideas they got there. One word to let you able to picture the whole movie: DISGUSTING! For real, if these girls just want to sing, please please for the love of God, just sing and don't make any dumb movie!!! To be a little bit fair, I sense that they're trying to be kind of making a live-action from some kind of an animation here. But they fail to make it good like the Japanese do with their live-actions. You girls would've been better shopping around in the mall instead of playing in a movie!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "panache2005",
        "review_rating": "",
        "review_title": "Horrific--I really do wish I'd watched \"License to Wed\" instead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "movedout",
        "review_rating": "1",
        "review_title": "Vapid and insidious, \"Bratz\" will gnaw at your conscience",
        "review_detailed_main": "\"Bratz\" is not just the most atrocious film this year but it's a horrifying indictment of obnoxious American teenage narcissism. While I fully understand that I'm clearly 'like soooo' not in their demographic (sticking out like a sore thumb in the process, flanked by a handful of empty seats) but what is plainly opposable is its toxic value system that prioritises superficiality and pop music over its sledgehammer lessons of friendships and inclusiveness. Sprung from a line of fashion dolls that make Barbie look like an Amish housewife, the film tones down its creepy sexualised tone for quickie moral lessons and puerile considerations of racial identities.\n\nThese Bratz consist of freshmen high schoolers in Hispanic Yasmin (Nathalia Ramos), African-American Sasha (Logan Browning), Caucasian Cloe (Skyler Shaye) and Pan-Asian Jade (Janel Parrish). Preaching individualism through materialism and in a haze of noxiously pandering stereotypes (Yasmin's represented through food and music, Sasha teaches everyone a thing or two about dancing, Cloe's a pretty go-getter at soccer and Jade's a science whiz under all that face-paint!), the thing that's even more egregious is its condescension of young femininity under the guise of appreciating the gender. Considering its impressionable core audience, it commits such a cinematic sin when it is caught attempting to traffic in post-feminism while at the same time, disparaging it completely.\n\nConsciously cavalier and ironically insular, its entirely manufactured theme of abolishing cliques and embracing individuality is a tougher merchandise to flog than the titular skanky dolls when all it ends up affirming is the sorry state of materialism that is allowed to pervade even the most tenuous of idealisms. \"Bratz\", while never once approaching the subversion of \"Mean Girls\", would have been a fantastic satire if they had proceeded to cast the chasms of mainstream pop culture like Paris Hilton, Nicole Richie, Britney Spears and Lindsay Lohan, that and if it wasn't so hands-over-eyes blind about its consumerist schlock peddling."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "clarinta-subrata",
        "review_rating": "1",
        "review_title": "This movie was a huge waste of time!",
        "review_detailed_main": "I watched this movie when I was really bored, with the hopes of it being a feel-good movie. The trailer looked decent enough, and I had expected it to be on the same level as Mean Girls.\n\nBut boy was I wrong. From the first 5 minutes of the movie I wanted to tear my eyes out from the extreme fakeness of it all. They way they talk and the things they say were so horribly clichéd and they made it sound so scripted too. And more and more clichés were to come: such as the ever popular rich blonde girl with the tiny dog with her two dumb entourage.\n\nThe worst part was the talent show. I think I died during that scene and then woke up again when it ended. Somehow I wanted to block it all out in fear of it destroying my brain cells.\n\nSo to sum it up, do not watch Bratz if you have the tiniest bit of self dignity because at the end of the movie, you'd be punching yourself and asking \"Why did I waste 2 hours of my time on this?\" Oh and seriously, letting little kids watch this will not change the way they think about 'life' or 'friendship'. I cannot give them credit for deepness."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "noimosyni",
        "review_rating": "1",
        "review_title": "The BRATZ are not THE BRATZ.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "durioa",
        "review_rating": "5",
        "review_title": "Hating on the actors is uncalled for",
        "review_detailed_main": "It is not the actor's fault they were given a bad script. Many of them have gone on to do really good work. The most notable is jade, who went on to be Mona in pretty little liars, a part she played spectacularly, she was able to capture psychopath so well. And Sasha's actor went on to be one of the leads in the Netflix original dear white people, another great show. Blaming the actors for something they had no control over is extremely unfair, it's not their fault, and unless you've been in acting you don't really know how much of a struggle it can be to get parts, so blaming them for being a part of this movie is really uncalled for. Of course this is no excuse for the script, which is littered with plot holes, but it's not really a movie made for adults, it's just supposed to be entertaining for young children, and when I first saw this as a nine year old, I loved it, and rewatching it as an adult is really nostalgic for me, because I loved the franchise as a child. This doesn't mean it's a great movie by any means, and being content for children isn't an excuse to phone it in on a script, but this is no where near the worst movie I've seen, and anyone who thinks that has obviously never had the displeasure of watching movies like birdemic and food fight. There's too much hate in these reviews for the wrong thing, because the actors aren't the ones who write the script, and it's ignorant to blame them, but who could expect anything else from people in 2007."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "ivana15141",
        "review_rating": "4",
        "review_title": "Not that bad but again...",
        "review_detailed_main": "I did read some of the reviews and all of them were by parents: i don't like it, i hate it... it annoys me. I don't think that the movie has a bad attempt i mean its a movie for 8 year old's! They don't see anything bad in it. Most of children don't understand that those are empty-brain girls because they are KIDS. And thats it. What else to say? 1 movie is not going to affect kids life. But if the kid likes it that means that she/he sees nothing bad in the movie because well you are parents and u should know it that kids don't see bad in anything. But let me go back to the movie, i think that the point of the movie is to just be yourself and don't care about everyone else if they don't like it. I think thats the only good thing in the movie."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Ai-Fan",
        "review_rating": "1",
        "review_title": "After the infamous...",
        "review_detailed_main": "... \"Daniel, der Zauberer,\" this was the second worst movie I've ever seen."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "kukudollar",
        "review_rating": "1",
        "review_title": "stupidest teen movie ever made by man kind",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "throatsock",
        "review_rating": "10",
        "review_title": "A true masterpiece.",
        "review_detailed_main": "This is the best movie I've ever seen. The people who wrote the script are literary geniuses; the director had the best creative vision of the century. Honestly, I think if Charles Dickens were alive to read the original script, he would be blown away. So would Fyodor Dostoevsky and Shakespeare. The movie is too fantastic for words.\n\nThe cast is phenomenal. I would absolutely love to get a window into the personal lives of all of the female actresses; I wonder what techniques they used before each scene? I'm guessing Stanislavski's. How else could they be such excellent role models for young girls around the world? They are all at exciting points in their career right now. They are on the cusp of an astounding revolution. Their talent surpasses that of iconic actresses such as Bette Davis and Audrey Hepburn. Maybe even more talented than Hannah Montana! Their talent as young artists are immeasurable. It can't be measured even with an advanced measuring tool such as a protractor, or a ruler.\n\nEveryone who contributed to this masterpiece are all truly artists of our generation. It's times that this movie's fans mobilize to fight for the truth. I can't stand the Bratz bashing. This movie is brilliant. If only there was a way of spreading this message besides reviews at IMDb.com :("
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "erinok-85232",
        "review_rating": "7",
        "review_title": "i actually liked it.",
        "review_detailed_main": "This movie may have been cheesy and was it the best movie ever? no. but it was entertaining and watchable. i thought it had a positive message: to not let cliques rip you and your friends apart. 7/10."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "olivertool",
        "review_rating": "2",
        "review_title": "Ugly, materialistic, stupid, shallow. Exceeded expectations.",
        "review_detailed_main": "Honestly, I thought this movie would be worse than it was. And it was TERRIBLE. But better than I thought. I honestly felt bad for the people who put so little money into this movie (which should have been made for TV, the plot was so small and not universal). It sent messages about both how you should be yourself and how you should be cool. My ears weren't burning, my eyes weren't falling out, but I didn't want to stay in the theater. Honestly, it's a toy I played with when I was little. You can't make a movie out of it. But they did a surprisingly crappy-but-not-sickening job. Yeah, the sets were cheap and stupid, the actresses were practically B-lists, and typically, played characters with as empty and ditzy expressions as their own, but it could have been worse. But I'd prefer you don't buy this movie. And that they never wasted it and ruined the careers of some of the people who worked on it."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "anaconda-40658",
        "review_rating": "3",
        "review_title": "Bitter.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "zzissizz",
        "review_rating": "1",
        "review_title": "Brat movie",
        "review_detailed_main": "Bratz, a movie based on the franchise terribly bad and boring!\n\nThe premise is not the best, the plot of the film is based on spoiled protagonists rivaling an antagonist who is also spoiled, in a singing competition with a scholarship on the line, and a boyfriend of one of the group of the protagonist girls who is deaf and for some idiotic reason loves music... Then the film has so many stupid scenes as mentioned little the hearing-impaired boy who listens to music by putting his hands on the speaker to feel the vibrations or like the one of the antagonist who \"humigates\" one of the protagonists by showing a picture of her on how she dresses in the morning... The soundtrack then makes you want to rip your ears off from how bad it is.\n\nA pointless film that teases the viewer."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "southdavid",
        "review_rating": "3",
        "review_title": "Craptz",
        "review_detailed_main": "Another film I watched for the \"How Did This Get Made\" Podcast, \"Bratz\" is perhaps the most hardwork I've ever found a film I watched for that reason to be. It's unremittingly terrible.\n\nFour friends believe they will be friends forever when the arrive at High School, but their varying interests have them split into their cliques and no longer hang out. The cliquey nature of their school is fostered and policed by Meredith Dimly (Chelsea Staub) the daughter of the principle (Jon Voight). Two years later, the friends come back together after a food fight and decide to try and encourage cross friendships. Meredith doesn't like this, and tries to use both her sweet sixteen party, and the school talent show to beat the girls.\n\nI accept that I'm not target audience here, as an English man in his forties. But even then, it's impossible not to see that the film is relentlessly boring and shallow. It's full of baffling decisions, such as why the character of Dylan is deaf. I know representation matters, but it only is a very minor factor in one scene and the rest of the time he doesn't struggle to understand anyone, even when they don't appear to be looking at him when the speak. Even more baffling is the decision to have Jon Vought appear in the role as the class head teacher and to put him in a prosthetic nose. Why not save the money and cast a capable but less well-known actor?\n\nPerformances across the board are terrible, perhaps only with one exception. Chelsea Staub's character of Meredith is a very stereotypical \"mean girl\" but she at least imbues the character with some life and spark. The rest of the school are horribly wooden, and I couldn't care less about any of the our leads or what they were doing.\n\nJust bad. Often then \"HDTGM\" films have some sort of so bad it's fun aspect to them, but I come back again to my main thoughts about this film, that it was hard work to get through it, and I'd recommend nobody else does."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "armyoffatimah",
        "review_rating": "4",
        "review_title": "be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "jumanji321",
        "review_rating": "1",
        "review_title": "awful and probably the worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "matthewspahr",
        "review_rating": "1",
        "review_title": "Just don't watch it",
        "review_detailed_main": "The more I think about this movie, the more I realize that it's just High School Musical.\n\nBoth have villains that separate students into different cliques Both have villains that are blonde, controlling, and own a dog Not to mention both have the villains being foiled at some singing performance\n\nTo be honest, I don't care at all about that. What really annoys me is how the Bratz are perfect at everything they do. For example, while trying out for soccer the blonde klutz (that's what they called her) is able to score a goal by pulling off a bicycle kick. How...just...just why?\n\nI would have just ignored this movie not rate or review it, but when the Sharpay ripoff started singing a song entitled \"Fabulous\" I ran away screaming \"NO, NO NO!!!\" I'm not joking. I actually did this. I probably wouldn't have done this if someone else was around at the time, but no one was so I did it. Did I mention the songs are terrible cause they are?"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "britneyswaggerty",
        "review_rating": "5",
        "review_title": "Not bad but not good",
        "review_detailed_main": "I used to love this movie when I was younger but now that I've watched it again after a long time it's not as good especially since whoever sang for Yasmin doesn't even sound good nor does the voice go with her face, also who sings for her anyways?"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "lorita_105",
        "review_rating": "8",
        "review_title": "Friendship IS important",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "elizy-33092",
        "review_rating": "6",
        "review_title": "Definitely cringy, but watchable and funny",
        "review_detailed_main": "This is definitely a very over-hated movie. The movie isn't Oscar worthy, and it's not trying to be, but I think it can be enjoyable and fun. The acting is a bit rough, the plot is very much all over the place, the movie isn't really a loyal or accurate adaptation of the Bratz franchise, and the movie's portrayal of the life high schoolers is obviously very unrealistic (especially its portrayal of Hispanic or deaf-ed high schoolers. Lol if you've seen this movie, you know what I'm talking about.), but man, was it fun to watch. I'm sorry, but it's hard for me to hate this movie. I'm gonna be honest, most of the time, the movie is funny in moments that aren't really supposed to be funny, like The Room. If you like watching those \"so bad it's good\" kind of movies, this is a good choice regardless of your age. It's one of those movies you can watch with your friends and laugh at.\n\nI wouldn't give it a high rating though, because I don't think giving a movie credit for being campy or ironically funny is fair if that wasn't their intention, if that makes sense, but I'm not gonna rate it one star either, because I think the movie was enjoyable. I'm not gonna give a movie ten stars because they made a movie that's enjoyable BECAUSE of the lack of work or thought they put into it."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "avalonjoyous",
        "review_rating": "1",
        "review_title": "They are a bunch of brats.",
        "review_detailed_main": "Academy award acting .\n\nBeautiful music that is a breath of fresh air .\n\nHilarious and charming .\n\nOkay now with all of that sarcasm out of the way the truth.\n\nThis movie....S U C K S !\n\nSome of the absolute worst acting in years and this was made in 2007 mind you .\n\nA plot that was mediocre,boring,lame,predictable,and extremely corny all rolled into one .\n\nThe movie epitomized the word corny from the over acting to the SASS to the obvious reading straight from the script lines .\n\nThe movie was just ...bad period .\n\nI get I'm not the demographic for this film and more power to the fans of this film I just found it to be an exercise in pure torture getting through it .\n\nOh and the MUSIC ?\n\nMy God talk about absolutely horrible and the music video at the end was extremely lame as well as laughable .\n\nIt also didn't help that the villain was as equally annoying as the lead characters were .\n\nEven less helpful is how superficial the characters all are and that doesn't really improve much."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "whammy666",
        "review_rating": "2",
        "review_title": "Good Lord!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "prettyparis97",
        "review_rating": "1",
        "review_title": "My eyes! They burn so bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "breadbingirl",
        "review_rating": "2",
        "review_title": "Why on earth did I used to like this?",
        "review_detailed_main": "Back in the day I used to love this film. I would watch it nearly every day. Now I wonder why.\n\nI rewatched last week and it truly is terrible. The dialogue is poorly written and although the actors are trying, they aren't very good, although it's not really their fault. I feel they would've been better if the writing wasn't so ridiculous.\n\nAlso the jokes in this film aren't even funny. This film is aimed at young girls, and even in my past days of absolutely loving this film, I didn't get a lot of the jokes and just pretended to laugh at them to seem cool to my friends who were watching it with me.\n\nBratz tries too hard to be a more kid-friendly version of Mean Girls and other high school films. I'm rating it two stars instead of one just because of how much I loved it when I was younger. God I was an absolute idiot."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "trinitygirl5611",
        "review_rating": "1",
        "review_title": "it was good...if you were deaf, blind, and mute",
        "review_detailed_main": "OK so i was home sick the other day and i was going through my movie channels and came upon this trainwreck of a movie and thought i might as well watch it cuz there was nothing else on. worst idea ever. i only saw the second half of it and i couldn't stop twitching from all the bright colors and obnoxious Paris hilton-esquire music. i mean this is a movie about 4 girls (who suck at acting and should be banned from Hollywood) who obsess over looks, looks, and oh yeah...looks. then there is that popular girl who catagorizes the whole school into groups and everyone puts up with it. i mean what high school is this? academy of the perpetual barbies with no life? and don't even get me started on the deaf guy. at first i didn't even know he was deaf cuz he seemed to understand everyone. ughh! the only part i liked was the credits and even then you have one of them playing a piano and belting out some retarded song that had no relationship with the movie. so basically its a movie that screams \"IF YOUR NOT POPULAR, PRETTY, AND HAVE A PERFECT BODY YOU WILL FAIL AT LIFE\" filled with overacting, ear-bleeding songs, and outfits only prostitutes and strippers would wear."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "Lots of brat-itude but no style or substance",
        "review_detailed_main": "Despite my indifference towards the Bratz dolls and disliking what they stand for, and disliking just as much the 2005 CGI-animated show, seeing as there are good examples of musical, comedy and high school films so gave 'Bratz' the benefit of the doubt with an open mind. Plus Jon Voigt has shown that he can be good if the material is (i.e. 'Midnight Cowboy').\n\nAlthough expectations were not high to begin with, 'Bratz' managed to not only be exactly what was expected but be worse. It gets points for some nice bright colours which stops it from being one of the all-time worst films, but that is pretty much the only very faint praise. The 2005 show, as very bad as it was, at least tried to incorporate some unoriginal but important morals and relevant relatable issues. This film also does both, but they are not just ones done to death in every kind of visual media in existence but they are delivered also with the subtlety of a sledge-hammer and in no way feel meaningful.\n\nThey are also further disadvantaged by the stereotyping, it's not just one or two aspects or characters that are stereotypical. Everything is stereotyped to the maximum, seeming like every one in existence, and in a way that make tea party saucers and very shallow water when swimming in the sea look deep in comparison. The un-subtlety is similarly applicable here as it is in the morals/issues 'Bratz' tries to show, the stereotypes are excessive in number, over-exaggerated and a few are not for the easily offended. Not in a while have more shallow and unlikeable characters graced any film by me seen by me recently, they all live up to their names as brats with personalities that never sparkle and instead make one depressed and they serve as unhealthy role models for the primary target audience.\n\nOther than the bright colours, there is a real straight-to-video/DVD look to 'Bratz'. It strives for glitz but ends up being pure garish tack with unexceptional at best amateurish at worst filming. The songs written for the film are repetitive and irritate fast, even the worst of the songs heard in the charts today are more tolerable than the songs here. They are also sung with variable sense of pitch, lacklustre energy and nasal, and at times shouty, poorly recorded voices that are far more unpleasant than the worst singing of Disney Channel stars. The choreography is lazy and danced with awkwardness.\n\nCalling the script stilted and shallow are insults to those words. It's truly cringe-worthy, forced and vapid, so poorly delivered and has no substance whatsoever. The story is non-existent thin and would strain to sustain even a half an hour television episode let alone a feature length film.\n\nAnd now we come to the acting, have not seen acting this appalling in quite some time. Everyone either looks like they are on autopilot or are so over the top that one feels ashamed for struggling to laugh out loud. There is no discernible chemistry between them either, with the titular characters it is hard to believe that they are friends with the way they interact and believe.\n\nOf the performances, Chelsea Staub as Meredith gives perhaps one of the worst performances ever. Similarly, once again (just when you think he couldn't get just as bad as his career-low-point, film and performance, in 'Superbabies: Baby Geniuses 2'), Jon Voigt disgraces himself with an bumbling idiot role (that is actually meant to be an authority figure) overacted dreadfully, and no obviously prosthetic/false nose won't give you any dignity sadly Jon no matter how hard you try to hide behind it by looking barely recognisable.\n\nIn conclusion, lots of brat-itude but no style or substance of any kind. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "unityhimym",
        "review_rating": "2",
        "review_title": "One of the worst movies I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Bratz",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "janel-roberts",
        "review_rating": "10",
        "review_title": "passion for friendship",
        "review_detailed_main": "the movie was good for any of ages, not just for girls.\n\ni thought the movie would be bad, but it wasn't actually.\n\nthis has a lot of fun!\n\nand the storyline is cool, even there's one unimportant scene.\n\nbut it was heart-touching and so high school!\n\nbut that doesn't matter because overall the movie offers an amazing story about friendship.\n\nthe character i loved is Cloe because i like her soccer ex school. and the star is Janel Parrish.\n\nshe's an amazing actress. and the soundtrack is so cool too!\n\ni don't understand why people love hating the movie!!!\n\nand after all, Bratz is one of the best teen-comedy of the year!\n\n^_^\n\n10/10"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "rebeccabradshaw-56134",
        "review_rating": "6",
        "review_title": "Only 'good'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "IonicBreezeMachine",
        "review_rating": "2",
        "review_title": "As plastic and artificial as the products it bases itself upon.",
        "review_detailed_main": "Four lifelong friends Cloe (Skyler Shaye), Yasmin (Nathalia Ramos), Sasha (Logan Browning), and Jade (Janel Parrish) are about to start their freshman year at Carry Nation High School. Student Body President, Meredith Baxter Dimley (Chelsea Staub), daughter of Principal Dimley (Jon Voight) maintains order in the school by assigning all incoming students to Cliques. This includes Cloe, Yasmin, Sasha, and Jade who all find their friendship tested by the oppressive social structure.\n\nLaunched in 2001, the Bratz doll line while slow to start eventually became a major competitor against the de facto monopoly of Barbie capturing nearly 40% of the doll market. The doll line was subject to both criticism and praise with some applauding the ethnic diversity of the line in contrast to Barbie, while others were quick to interpret the attire, attitudes, and other facets of the line as promoting sexualization and promiscuity. Most of the criticism was written off and had no major effect on the line's success, and what hiatuses happened were mostly the result of legal actions by Barbie owner Mattel. In 2006, Avi Arad fresh from his resignation at Marvel Studios before the MCU took off, acquired the rights to Bratz to make a feature film based on the property helmed by low budget children's film director Sean McNamara and produced by Jon Voight and Steven Paul's production company Crystal Sky Pictures best known for production on the Baby Geniuses movies. The film was a massive failure critically and commercially and was even nominated for worst picture at the Golden Raspberry Awards only being beat out by I Know Who Killed Me, the Razzies made a mistake because as bad as I Know Who Killed Me may have been, it at least feels like a movie as opposed to Bratz.\n\nFrom the point the movie opens, the titular \"Bratz\" are pretty much interchangeable in terms of personality and really only distinguished by their wardrobes which are the subject of a number of montage scenes (which makes sense given the movie is based on dolls) and for the most part talk, act, and behave pretty similarly to one another. On occasion you'll get some cringey humor based on antiquated stereotypes such as Yasmin's homelife where it's basically bludgeoned into the audience she's of Hispanic heritage down to not only is her home filled with people, it also has a Mariachi Band in it....you read that correctly, and there's other instances just like this for the other characters. Things aren't much better once we get to Carry Nation High School (because kids love Prohibition/Temperance references?) where the student body is made up of broad caricatures that make up the \"cliques\" with your typical jocks, geeks, loners, and odd ones like \"kids who dress up like dinosaurs\". On occasion there's maybe an inspired gag such as a scene where Principal Dimley is reading a book called \"How to Run a Prison\" but it's so suffocated by the weight of the movie and its lack of subtlety that it barely registers.\n\nThen we have the underlying crux of the movie of \"being yourself\", \"don't let the world define you\", and etc. Which is a worthwhile enough message but A) it rings pretty hollow when you're utilizing broad stereotypes and caricatures and B) The movie spends so much time focusing on the titular Bratz \"fashionizing\" and \"accessorizing\" themselves it's comes off like lip service trying to disguise how superficial the whole thing comes off as. The 2004 film Meangirls handled this material much better, but that movie was written by Tina Fey and carried a PG-13 rating which allowed it to tackle the High School experience with more edge and wit. The movie is written by credited writer Susan Estelle Jansen (though initial uncredited work was done by Susie Singer Carter) and while Jansen has a successful history as a producer on the Lizzie McGuire series and even wrote the finale film, the writing of that series skewed younger and focused on Junior High students and a very polished version of Junior High at that. While there have been some movies that take place in High School that are PG, they typically play up the camp value or silliness because it's very difficult to address teenage issues in a \"family friendly manner\", and Bratz seemingly wants to be both a fluff piece and a friendship story and doesn't have the ability to pull off either one.\n\nBratz is a soulless product that looks, feels, and plays like a feature length commercial. From bland interchangeable protagonists, to over the top style and performances, to high school satire that's about as cutting as baby teeth, Bratz is just as plastic and artificial as the products it bases itself upon."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "squirrel_burst",
        "review_rating": "1",
        "review_title": "Until you've seen it, you don't truly understand how bad it is",
        "review_detailed_main": "\"Bratz\" leaves it's audience at a loss for words, wondering what kind of weird dimension they walked into. Every character could be described as one dimensional if you felt like being generous, the plot is just utter nonsense and everyone in the film looks like they wish they had invested their money better so they wouldn't have to be on screen. I know some people would argue that my standards for what a movie can be should have been lowered when I came across this live-action film based on a series of dolls, but aren't little girls people too? Don't they deserve the same kind of respect for their intelligence that everyone else does? None of the characters have any personalities besides whatever accessories their toys come with (so for example, there's a sporty one, a smart sciency one, a cheerleader and if I remember correctly... the last one is just clumsy) and it becomes almost offensive how broad the comedy is. This might just be John Voigt's worst movie. Yeah he's been in some real stinkers like \"Anaconda\", \"Baby Geniuses 2\" and \"Karate Dog\" but in how many other pictures can you see him with a goofy prosthetic nose while playing a bumbling comedic principal? I have this movie at home because I collect bad movies and this is one of those that's so bad you have to see it to believe it. (Dvd, January 6, 2012)"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "lisafordeay",
        "review_rating": "4",
        "review_title": "From The Director Of Casper Meets Wendy And The Man Who Co Founded Marvel surely its not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "swim_freak777",
        "review_rating": "1",
        "review_title": "It's been done so much better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "girlzrock101",
        "review_rating": "1",
        "review_title": "You've GOTTA be kidding me!",
        "review_detailed_main": "I didn't lose 10 IQ points; I lost 100 IQ points! In simple words, this is the story: Cloe, Yasmin, Sasha and Jade, the 4 biggest losers ever, are starting 9th grade, where Yasmin falls in love with Dylan , Cloe falls in loves with the soccer girl & Cameron, Jade falls in love with Dexter the Dork, & Sasha falls in love with Beth! Then they become a 4 way again for a few months. Then Yasmin gets together with Merideth, and at the end, it's a group! Woo-hoo! It wouldn't even win an Oscar if it were the only movie ever! So my advice: Either don't watch it or cover your eyes & wear earplugs when you do! And if you've seen it without the requirements or you will, you suck!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "ja_kitty_71",
        "review_rating": "10",
        "review_title": "Bratz hits the Silver Screen!",
        "review_detailed_main": "What got me into \"Bratz\" was that I would watch a couple episodes of the CGI animated TV show; I prefer them in CGI because in 2D their lips look huge. As for the doll line, I am more of a Barbie girl myself. Yes! I am 22 years old, and I still collect Barbie dolls. I only love the TV show and the new live-action film that came out last summer. As I said a million times, I was shocked, surprised, and flabbergasted by the negative reviews I would see on the web. I thought the film was an excellent comedy.\n\nI adore the concept of friendship, even though some may consider it cheesy. I am captivated by the challenges that the girls Yasmin, Sasha, Chloe, and Jade encounter during their initial year of high school. I've been a fan of high school-themed films and television series since I was in eighth grade. I love it when Meredith shouts, \"You brats!\" It's as if the film's title would come out of her mouth. The Bratz's act at the school talent show left me in awe; it was remarkable."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "laurenalen",
        "review_rating": "7",
        "review_title": "Fun, don't take it too seriously",
        "review_detailed_main": "Most of these reviews slate this movie, and I guess I understand why. The plot is unrealistic and predictable and there are a fair few jokes that don't quite hit. However, this movie was obviously intended for a young female audience, and it works well for that purpose. The music is good, particularly the Bratitude number, there is not just inclusion, but appreciation of characters of different races and a first for a preteen movie, a fairly major character with a disability which is addressed in a positive way. Contrary to other reviews, I think this film sends a great message about friendship through adversity, acceptance of peoples differences and even the importance of education (through Jades science club and the scholarship). I recommend, just don't have unrealistically high expectations, remember it is just a feel good movie for young girls. Maybe it's just that I first watched it when I was 6 and grew up with the Bratz franchise, but having recently rewatched it, I might've shed a tear at the finale.."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "balletdancer1427",
        "review_rating": "8",
        "review_title": "Cute",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "PoisonKeyblade",
        "review_rating": "6",
        "review_title": "Surprisingly not that bad of a Movie",
        "review_detailed_main": "Every year, there are movies that look utterly horrible and actually ARE utterly horrible. But every now and then, a movie comes along that you are expecting to be so bad, so terrible, that you are ready to hate it before you see it\u0097when you do you are strangely surprised that the movie isn't all that bad, and it was actually kind of good. Every year has its surprises. Borat was last year's big surprise, and this year had three big surprises that came out on the same day: Underdog, Hot Rod, and Bratz. Yes, let me get it out of my system now. Bratz, the movie I was going to love hating, really wasn't all that bad. The previews promised torture to the viewers who were unfortunate enough to watch it, and I went to see it because I needed another god-awful film to dethrone Napoleon Dynamite as the worst movie of all time. But Bratz, a fun teen flick with lots of heart, strangely won me over about an hour in. It did the opposite of what I was expecting around almost every bend (although there is still that typical cliché ending that everyone will expect from this sort of movie). Bratz features four relatively new actresses in the lead roles; Logan Browning plays Sasha, Janel Parrish plays Jade, Nathalia Ramos plays Yasmin, and Skyler Shaye plays Cloe. John Voight is also in a small role playing the principal of the high school.\n\nSasha, Jade, Yasmin, and Cloe have always been the very best of friends, and they don't expect high school to be any different. Scheming, spoiled, snobby, little-miss-perfect prep girl Meredith, however, thinks otherwise. She is the president of the student body, and she makes her presence more than known\u0097all of the new kids must come to her so that she can sort them in with their associated cliques. No one is allowed to make friends outside of the cliques basically. When the girls arrive, however, Meredith begins to fear that there could be trouble. In their freshmen year, however, the girls blend in with their own assorted cliques; Jade hangs with the science nerds, Yasmin hangs with the cheerleaders, Cloe becomes a preppy jock, and Yasmin is pretty much left by herself. As time goes on, the girls begin to drift farther and farther apart from each other until two years pass, and they are pretty much little more than acquaintances. Through a series of events, they decide that they need to be friends again, and they cannot let the situation with the cliques get in the way of their friendship. Meredith is pretty much appalled as she watched the world she created crumble beneath her, so she sets out to teach the 'Bratz' some lessons.\n\nI am actually kind of embarrassed to say that I liked this movie. It did, after all, teach some very good life lessons, it had really good songs, and some of the actors were halfway decent. Clearly the best among the bunch were Janel Parrish and Nathalia Ramos, who play Jade and Yasmin, respectively. They gave their characters life and they had loads of fun with their roles. Chelsea Staub, who played Meredith, seemed like she was having lots of fun, but she wasn't the best actress in the world. Also somewhere in the middle of the acting spectrum was Skyler Shaye, who played Cloe. While she did bring a unique personality to the character, she was very weak at times, but she was mostly tolerable, and I loved her character to death. The very worst by far in terms of acting had to be Logan Browning, who played Sasha. She was absolutely horrendous in nearly all of her scenes, although there were a couple where she showed a bit of promise. Very close behind in terms of the awful acting was the young actor who played Yasmin's little brother. He showed no skill at all, his lines were always forced and never subtle, and he always seemed devoid of any sort of emotion or energy. The supporting cast was all pretty decent, including the parents of all the girls and the all of the boys.\n\nAs stated previously, the musical numbers were all handled very well. While I couldn't stay during the credits because I had to work, I did love every song and I liked the directing very much. There were so many bright colors and funny moments scattered throughout the movie that I couldn't help but smile. This is another feel-good film the whole family can enjoy.\n\nAs much as there are positive things to say about Bratz, there were many negatives. Before the 'two years later' sequence occurred, the movie showed no promise at all. I almost got up and walked right out because it was delivering exactly what the preview had promised. The script for the introduction to the characters as well as the opening scene were very poorly written, and basically all of the actresses delivered their lines like robots. For some reason, though, once it hit the half hour point, things got considerably better and it actually seemed as if it was molding itself out into an actual movie as it progressed. By the end, everything was actually coherent and very enjoyable. In many scenes, the acting became a major issue and annoyed me to no end. Still, Bratz definitely had its moments where I actually saw a great movie shining through. It was very cliché in some aspects, but in many others it tried something new and most often succeeded.\n\nBratz the Movie was full twists and turn, surprises and songs, good acting and horrendous acting. I liked the characters a lot, and the movie itself actually managed to be halfway decent. I was expecting this to be utterly terrible, but it surprised me in every category. Still, the movie is not without its share of flaws and it is far from perfect. 6/10"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "golden_sparkle12",
        "review_rating": "10",
        "review_title": "Hey, I quite liked this movie.",
        "review_detailed_main": "H'kay, I'm a 17-year-old girl, and I watched this movie with my mum. I've never really been into the Bratz dolls, so I had my doubts for the film. But I was really surprised. A very colourful film, filled with an inspiring friendship between four girls - who are all amazing young actresses, who we'll be seeing much more of in the future, no doubt! Sure, it may be a 'kids film', but I think mum and I both agreed that this was a movie worthy of 10 stars.\n\nPeople giving low rankings should perhaps remember that this film is probably aimed at younger children who have grown up with the Bratz dolls. ((my generation kinda grew up with Barbie dolls xD))"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "kyauchiha",
        "review_rating": "7",
        "review_title": "Don't take all these over the top hateful reviews to heart",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "valdeztonyjoe",
        "review_rating": "9",
        "review_title": "Hey come on",
        "review_detailed_main": "This movie isn't that bad because when I first watch it as a kid I do love it Idk why adults hate it my only problem at the film is the didn't include burdine and the tweevils they should've include them if they make new movie again I hope burdine will be on it btw Sasha carried the movie.\n\nAs a kid I repeating watching it because who won't it is so good movie when I was kid but many adults didn't like it. One thing they should've made there clothes more on fashion because Bratz is about fashion not disaster I get the point of friendship I really love the movie the problem is where's burdine???"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "danmax",
        "review_rating": "8",
        "review_title": "I heard a lot of good thing about Brats.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "alexp81",
        "review_rating": "10",
        "review_title": "The BEST Teenage Movie Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "lauren_moore-81136",
        "review_rating": "10",
        "review_title": "2023 rewatch",
        "review_detailed_main": "I was a young girl when this film came out, so the desired audience. I was curious and checked here to see the poor rating and wondered why it was so low. Fully grown adults reviewing films made for children/young teens makes absolutely no sense to me. I dont think it was ever meant to be Oscar worthy or too serious about itself. It's about friendship and identity, not to mention its diverse characters for the time that this came out. Yes the acting isn't great, but it's a cheesy little feel-good story. Rewatching it now, it's aged pretty well in comparison to some other well rated films of the same time."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "jbeswickwork",
        "review_rating": "10",
        "review_title": "Fun fashion friendship",
        "review_detailed_main": "This is on mean girls level of sass, just about a group of pals! Just living there best lives! Bring on a bratz 2 in 2020!!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "jjsan13",
        "review_rating": "10",
        "review_title": "Y'all sleeping on this masterpiece",
        "review_detailed_main": "The only problem with this film is that they have a white girl as a latina as if we don't all know what a Latino is. it's cute, funny, and I've watched it like 20 times"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "shovan-12183",
        "review_rating": "10",
        "review_title": "why do peaple think that this is a bad moveie?",
        "review_detailed_main": "I thongh that this was a good moveies.kidhood marorres."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "zbunting-09332",
        "review_rating": "10",
        "review_title": "It's bad, but it's childhood, so it's amazing!",
        "review_detailed_main": "Yes, the acting was not the best and the cliche stereotypes are outdated, but h the is was childhood, and back when I was a young lady, this was amazing! It's hilarious and entertaining."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "libbyscott94",
        "review_rating": "9",
        "review_title": "Man i know I'm trash",
        "review_detailed_main": "But this is like that enjoyable trash that you watch when no one else is awake, but it's disgustingly enjoyable. I am 19 and I still watch it as a guilty pleasure."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "rubleabigail",
        "review_rating": "10",
        "review_title": "masterpiece",
        "review_detailed_main": "I've never in my life been so moved by a movie. It shows in order to grow together you must grow apart. I mean I've never seen a deaf guy read lips so well ... beautiful. and the cameos from kevin mchale and beans from even stevens? genius, it keeps viewers engaged and guessing what the next cameo is gonna be. all of this leads to the movie being a perfect 10, thank you for reading and taking into consideration when writing your review!!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "brooke-98054",
        "review_rating": "10",
        "review_title": "Hilarious!",
        "review_detailed_main": "Bratz used to be a doll line and in movies/ a tv show. Now they are in a live action movie that was completely pointless. I don't know if this movie was meant to be taken seriously? I laughed throughout the whole thing because of how ridiculous it was! The actresses are terrible along with the songs they sing. Yasmin's singing voice is so off that I died. Not to mention Sasha's too. Jade was the only who could actually sing. And the choreography is so bad that the girls look unattractive. I think the girls were awful influences on young girls. They wear way too much makeup for young high schoolers. Plus, Yasmin is absolutely terrible to Dylan. In the words of Yasmin, \"You don't sound deaf.\" There was so much wrong with that whole situation. Another bad thing was how cliché the whole plot and characters were. The mean/rich girl, the jock, the cute boy, the annoying friends, the sports girl, the cheerleader, the shy girl who has an 'amazing voice', and the smart girl who has a, \"passion for fashion.\" The real reason I gave this a ten is because it's that bad that it makes you laugh. You can't help but enjoy all the mistakes it makes from beginning to end."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "fordivaz",
        "review_rating": "8",
        "review_title": "So much original for teenage girls story.",
        "review_detailed_main": "I hate teenage girl story which contains sex, drug and more inappropriate thing like some teen series todays felt like adult movies. \"BRATZ\" is that movie which is really recommended for young girls because it teach a lot about friendship, self-improvement, girl empowerment and team work. Each of the main characters have a speciality and interesting personality which we can admire and even related.\n\nThe actresses are excellent, as well as side characters. This movie is very well-written and right-targetting young girls. No sex, no drug, no inappropriate things for teens. Everything here is so original and normal. Even kids are able to watch since this movie is based on animated series \"Bratz\" which has been critisized for being sexual due to its young girls' target. But the movie is different, each of main casts potraited correct characteristics of the Bratz dolls. The music is fun. The main antagonist is also damn funny and interesting. Its school life also gives inspiration to how a high school should look like. Also no inappropriate kissing scenes like usual teen movies have, that one of the special thing from this movie. But what I do not like here is the cast for Yasmin; she is beautiful, has good acting, but her hair is too light for Yasmin who should be with dark hair. Anyway, the girls did well.\n\nBratz is not popular at all in my country. I just watch this today and never hear the name before. I just realize how good this movie is for young girls. So inspiring and not boring at all. The comedy is also funny. I never expect a fashionable girl Jade woud have a crush on a nerd guy, but he is handsome afterall. The story of four girls which is representing the real girl empowerment without that garbage feminism manner."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "josepranadika",
        "review_rating": "10",
        "review_title": "one of the BEST film of the year by far",
        "review_detailed_main": "i watched the movie along with my friends to celebrated our friend's birthday. we, 24 students, went because Bratz is a comedy movie, so, we think it would be fun.\n\nand surprisingly it is. we were had a lot of fun and often laughed out loud while watch the movie. Jon Voight's face always make us laugh because he could act funny. and four BRATZ girls were shown good acting too, especially J. Parrish who played Jade in the movie. and Meredith's character was successfully played by C. Staub. but i like Skyler Shaye who played Cloe because her unique acting is really amazed me out. after the movie was ended, some of us were decided to go back watch the movie again and my birthday friend was happy because that was like her best birthday ever.\n\nfor me, the movie was cool and good for any ages. the movie has a great message for all of us! and in fact, the soundtrack of the motion picture is cool too.\n\nwell overall, BRATZ was not a bad movie at all! It was total amazing!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "aidanthomas-39729",
        "review_rating": "10",
        "review_title": "Loved it!!",
        "review_detailed_main": "I absolutely adored this film! The values that are present throughout this entire masterpiece allows my faith to be returned in all of film making. Christopher Nolan, Steven Spielberg, Martin Scorsese and every producer/director out there should take a leaf out of this film's book as it is and absolute classic. My all-time favourite movie of all time!\n\nApparently there needs to be at least 10 lines for it to pass as a review, so please enjoy these instructions for making brownies; Method Step 1 Preheat oven to 160C/140C fan-forced. Grease a 6cm-deep, 22cm square cake pan. Line base and sides with baking paper, extending paper 2cm above edges of pan. Step 2 Place chocolate and butter in a medium saucepan over low heat. Cook, stirring, for 5 minutes or until melted and smooth. Cool for 5 minutes. Step 3 Add sugar and egg, whisking to combine. Stir in flour and cocoa until combined. Add choc bits and sour cream. Stir to combine. Spread chocolate mixture into prepared pan. Dollop with caramel. Using a butter knife, swirl mixture to create a marbled effect. Step 4 Bake for 1 hour or until a skewer inserted into the centre of brownie comes out with moist crumbs clinging. Cool completely in pan. Serve cut into squares."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "austintbackyardigans",
        "review_rating": "10",
        "review_title": "I'm being honest here",
        "review_detailed_main": "As a 19 year old girl with autism who have loved Bratz, Barbie, my little pony, etc since I was young I have to say this.\n\n1. Yasmin is NOT Mexican, she's HISPANIC! People need to get that right, Hispanics can have white skin. 2. I'm glad they have a deaf character, the bad part is that there's not much American Sign Language. 3. It has American high school stereotypes? THIS WAS FILMED IN THE US! 4. I hate the three characters that were mean to them. 5. The songs are amazing!\n\nI also love how they have diversity including a character with a disability. We people with disabilities don't get in much normal movies which hurts me.\n\nIt is also very colorful!\n\nBut I hated the part where they were fighting, I wanted to cry at that part."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "rosiebrookshaw",
        "review_rating": "10",
        "review_title": "How are you reviewing this movie badly",
        "review_detailed_main": "Okay it's cheesy, but it was made in 2007 and it's a childhood staple. The Bratz were iconic (I mean they still are) and this movie was fabulous in its time!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "cazzmarquez",
        "review_rating": "9",
        "review_title": "Bratz forever",
        "review_detailed_main": "Lol I mean I watched this movie when I was 8 today I'm 19 not that much but of course I loved it so much one that I remember from my childhood so much even when I didn't really own the bratz toys I mean it's a movie for kids/girls I see it and they kinda annoying but still love it haha!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "ellenxx",
        "review_rating": "9",
        "review_title": "Perfect Movie for any age",
        "review_detailed_main": "Bratz has had a lot of strong criticism and bad comments made about it but i think its a great movie. Young girls would love a movie about this, with the good girls beating the bad girls.\n\nThis movie has some sweet natured parts behind it, including a deaf boy learning to appreciate music and 4 best friends reuniting and become a team again, teaching kids that best friends should always be there for each other.\n\nIf you want your little girl to truly enjoy a night out at the movies, then take her to see Bratz. in fact she doesn't have to be a little girl, she could be any age and still love the catchy songs and excellent storyline."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "taurus_220492",
        "review_rating": "10",
        "review_title": "Nice For Summer Girl Power",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "cloeramosparrish",
        "review_rating": "10",
        "review_title": "Friendship Never Diez",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "reveal_attitude",
        "review_rating": "10",
        "review_title": "BFF's and OMG were worth to seeing. i'm BRATZ Lover!",
        "review_detailed_main": "i watched the movie over and over, again and again.. with my girl friends, guy friends, family n my self. i just want 2 say that the movie was good n as the matter of fact, it was great. it has good messages (of course), nice story, pretty acting, and awesome musics. the ending was actually a bit heart-touching when Cloe was given the present by Yasmin, jade n Sasha then she said \"For Real? Oh, I Love You Guys! We're Truly Best Friends Forever\" And Then They All Shouted \"BFF! Even Better.. BRATZ!\" well, i think yeah Bratz deserves to get 10 for the ratings. but i DON'T think that Bratz deserves to get 1 for the ratings. so, i think u have to watch it. but if u will be afraid to feel ashame for watch it in theater because u stupid, then just watch the movie on DVD. and prepare to be amazes!"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "tony-68180",
        "review_rating": "10",
        "review_title": "Great For Young Teens",
        "review_detailed_main": "Look, obviously this movie isn't the \"best\" of all the movies that are available in the world. However, to a young teenager, they would have a very different perspective towards it.\n\nI'm a guy and currently in college right now. I first saw this movie as a class (we voted for a movie on the last day of sixth grade in 2008 and Bratz won, so we saw it) back in elementary school and I must admit that I enjoyed it very much.\n\nTrue, many may question the movie's message, but in many ways I see that it does project a positive message. Throughout the movie, the four Bratz girls (Chloe, Jade, Sasha, and Yasmin) meet events that challenge their friendship. However, they make it through putting their friendship as a priority. This delivers a very important message to young teenagers/tweens that they should always learn to maintain friendships and set how to aside their differences.\n\nAnother important message the movie delivers is basically how to stand up for yourself. It's very important that children in their pre- teens know this as it is very possible that they will also face similar issues once they head into highschool.\n\nLastly, this movie wasn't intended for adults or the \"general audience\". It was directed towards preteens/young teens in general. Many teenagers at that time (myself included) were very interested on \"what high school is going to be like\". Therefore to them, this movie would be very enjoyable."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "loveandsonic",
        "review_rating": "9",
        "review_title": "The Movie is Great!",
        "review_detailed_main": "I don't understand why this movie has to be very low in rating. But I'm just going to be one of the optimistic people telling people the good side of the movie.\n\nFirst let's start with my cons. Nathalia(Yasmin) is the singer or the girl who loves singing....welll supposely they would have found someones voice that matches the way she talks more if she cannot sing. Including Skylar(Chloe). But none of them use there real voice except Janel Parrish(Jade). If I made the movie I can easily find people who can sing very well and look great for bratz...\n\nAnother thing why does it have to take them 2 years until they get back together? It would have took just a month for the better? I mean friendship is awesome but no girl in real life would split up because they are in different cliques,clubs,sports, or interest. Especially it can't take 2 years.\n\nOkay let me explain the pros.....\n\nThe movie is still good, the lesson is understandable....the lesson fits the point of the story, and is just a film that feels like an exciting girly movie. I enjoy this since I was a little girl. Those cons I said on top, I mostly wished it didn't take 2 years for friendship to happen again.It would have been less plus the story would have been written better like....\n\nMeridith saw 4 girls having a strong friendship but she becomes friends with one of them and lie about how one another hate or say things about each other and make tricks. Later on they find out and stop her.Lesson would be \"don't be jealous\"\n\nOr it would have just been a movie about competting against her in a competition and they try to learn how to work together and make plans to stay strong as a team. \"Lesson would be stay strong, fight to win , or enjoy the competition, if you lost no big deal\"\n\nOr another competition against dancing as a team or fashion just because thats what you always see in the animation.\n\nThe music and the songs is great....no one should not deny that.\n\nI found it very funny how at the end Meridith got embarrassed in her sweet 16th or her second one.\n\nI can relate to yasmin when she is sad and nervous. But is bad that the evil character easily persuade them to be separated just because she tells you to hang out in a certain group. But in real life no one tells you to hang out with people...that would cause a lot of chaos."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Xizer",
        "review_rating": "10",
        "review_title": "This is the best movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "datzwazup0706",
        "review_rating": "10",
        "review_title": "Amazing!!!!!",
        "review_detailed_main": "I watched this movie at the theater and OMG this is like totally amazing. The acting is beyond amazing. I just loves it it is so cute. Those girls are so tight. And to all you fat nerds who hate on us skinny models stop tripping OK cause we are gorgeous and y'all ain't/ HMM!!! This movie was so cool and amazing and I recommend to everyone even old people! Yes EVEN OLD PEOPLE! Loves It!!! Now go out and see it. These girls spill their hearts out on screen and it is just so Godly. It is the perfect movie for all of you who want to see it after you go to the mall and shop for cute outfits.\n\nP.S. To the guy who said charity and helping people is More important than fashion is obviously on something cause it ain't."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "josiemortean-1",
        "review_rating": "10",
        "review_title": "Enchanting gal movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "tricita123",
        "review_rating": "10",
        "review_title": "A Cute Movie, and don't miss the video at the end.",
        "review_detailed_main": "I think that the movie was very cute. I don't know much about the dolls, but the movie is very lighthearted sends a good message about friendship. The girls all had their quirks without upstaging each other, and I think the actors portrayed the characters very well. My favorite was Jade, because her character seemed the most genuine and had the greatest depth. My absolute favorite part was the video that played at the end of the credits. Janel Parrish (Jade) performed a beautiful song called Rainy Day, which she wrote herself. It is on the soundtrack, which I plan to download from I-Tunes. I really hope to see a sequel."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "elizabeth_777",
        "review_rating": "10",
        "review_title": "if you get it you get it and if you dont you dont",
        "review_detailed_main": "Talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before. If you get it you get it and if you dont you dont."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "baconeee",
        "review_rating": "10",
        "review_title": "Best movie I've watched",
        "review_detailed_main": "I loved the Bratz movie so much it was so relatable to me. I identified with one of the characters. I really felt like Chloe was me. I have never saw anything as fun and inspiring as this movie. This movie has saved my life from my darkest moments. Overall it is a fun and easy going movie to watch :)"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "xonzodaagzamova",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "This movie is actually very interesting and enjoyable. I don't understand why people are judging it. It is one of the best comedy movie for teens I have ever seen."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "thelegendofbribri",
        "review_rating": "9",
        "review_title": "Open eyes! Oops this is supposed to be about the movie...",
        "review_detailed_main": "Brats... I mean Bratz! IS AMAZING! A lot OF PEOPLE HATE THIS MOVIE BUT ITS ACTUALLY A QUALITY MOVIE! I was super shocked at how bad this was! The best part was the end! Open eyes is the bomb! It keeps you on the edge of your seat listening to Yasmin's \"real voice\". Also let's talk about Sasha! Come on girl you could've held the microphone to your mouth! Chloe did have the best reaction during the song! Pure disgust! Anyways I did enjoy this though. I got to enjoy this movie with myself and then I got my family to enjoy this as well! So I'm glad this movie is here for my whole family to love! Just watch this movie! I promise it will be enjoyable! \"You know it's all about me.\" - You'll get it when you watch it!:)"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "r_trachtenberg",
        "review_rating": "10",
        "review_title": "Excellent Bratitude",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "michauxchloe",
        "review_rating": "10",
        "review_title": "Very Bratz",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "akelly-02546",
        "review_rating": "10",
        "review_title": "Underrated AF",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "sagequirk",
        "review_rating": "10",
        "review_title": "This movie kept me on the edge of my seat through its ENTIRETY!!!!!!!!!!",
        "review_detailed_main": "This was by the far the most exhilarating movie of 2007. Forget about Transformers, The Bee Movie, Alvin and the Chipmunks, and Spider-man 3-- this movies tops them ALL. I do not have the words to describe this movie, therefore I will use my favorite song to express my feelings for the movie: F to the A to the B-U-L-O-U-S Yeah, Yeah (Come On) F to the A to the B-U-L-O-U-S Yeah, Yeah This is your lucky day Your standing in my presence This is your lucky day I'm like slice of Heaven Flown of the flowing Greatness in your presence Flown of the flowing Time to take a lesson, from me I Guarantee I'm fabulous Simply one and only Fabulous Come and get to know me Fabulous You wanna be my home Funky and fabulous Don't hate me 'cause I got it Fabulous You know I'm gonna flaunt it Fabulous Gonna make you want it She's so fabulous. Oooh-way, Oooh-way F to the A to the B-U-L-O-U-S Oooh-way, Oooh-way I'm so fabulous Oooh-way, Oooh-wayF to the A to the B-U-L-O-U-S Oooh-way, Oooh-way F-A-B-U-L-O-U-S This is your lucky day My music's got you moving' This is your lucky day Oh yeah, it's got you grooving' Flown of the flowing Now I gotcha swooning' Flown of the flowing You've become addicted to me, that's how it be I'm fabulous Simply one and only Fabulous Come and get to know me Fabulous You wanna be my home Funky and fabulous Don't hate me 'cause I got it Fabulous You know I'm gonna flaunt it Fabulous Gonna make you want it F-A-B-U-L-O-U-S Back in the day Back in elementary People like me were treated so differently Now you know they were wrong They were jealous of me all along Now take a breath Just sit back, let it go Just chill out with the flow Because now I am running the show I'm funky, I'm fly I'm fabulous and here's why I'm rowdy, I'm real Lemme tell you how I feel Don't worry that your inferior, It's just that I'm superior Don't sweat it, Don't cry Don't fret it, Here's why Fabulous Simply one and only Fabulous Come and get to know me Fabulous You wanna be my home Funky and fabulous Don't hate me 'cause I got it Fabulous You know I'm gonna flaunt it Fabulous Gonna make you want it She's so fabulous Fabulous Simply one and only Fabulous Come and get to know me Fabulous You wanna be my home Funky and fabulous Don't hate me 'cause I got it Fabulous You know I'm gonna flaunt it Fabulous Gonna make you want it F-A-B-U-L-O-U-S"
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "dandrews-61866",
        "review_rating": "10",
        "review_title": "Wow",
        "review_detailed_main": "Much good, very like, much recommend. Good story line."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "berglisxam",
        "review_rating": "10",
        "review_title": "Best movie i have ever watched",
        "review_detailed_main": "The Bratz 2017 movie is the best movie i have ever and will ever have watched. The bratz 2017 movie birthed me, raised me, drove me to school, paid for my school trips, put my artwork on the fridge, bought me an iphone, picked me up from parties, paid for my driving lessons, sent me to college, watched me graduate, helped me move out, loved me. I will be showing this movie to my future kids who will be showing it to my future grandkids. My dream is for a Bratz movie 2 to be made and for all of the Bratz to be in a polyamorous lesbian relationship in it. Thank you for listening."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "Funstacy",
        "review_rating": "10",
        "review_title": "BEST CHILDHOOD MOVIE",
        "review_detailed_main": "Yes, it has many plotholes, weird dialogues and other stuff, BUT IT IS ICONIC. Just don't take it too seriously! It's super fun, easy to watch and has many GIRLBOSS moments, slay."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "dkgyb",
        "review_rating": "10",
        "review_title": "Nostalgia and Charm: Appreciating a Teen Classic for What It Is",
        "review_detailed_main": "As a teenager, this movie was aimed right at people like me, and I absolutely loved it. It's lighthearted, fun, and carries a sense of nostalgia that takes me back to those carefree days. It was never trying to be a cinematic masterpiece-it's simply a movie for teenage girls, and it honestly holds up as well, if not better, than other films from that era that have received higher ratings. Watching it for the first time as an adult and then picking apart the acting, pointing out plot holes, or focusing on every small flaw misses the mark entirely. This film was made to be enjoyed by a young audience who could relate to its characters and story, not for adults to dissect it years later. Criticising it so harshly as an adult feels disconnected from its real purpose and the nostalgic charm that continues to resonate with those who grew up with it."
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "rumblinglove",
        "review_rating": "",
        "review_title": "Same Old Ideas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804452",
        "movie_name": "Bratz",
        "movie_rating": "3.1",
        "review_username": "dontspamme-11",
        "review_rating": "",
        "review_title": "I hope they never make a sequel to this film...oh...wait...dang..",
        "review_detailed_main": ""
    }
]