[
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "aptrapani",
        "review_rating": "5",
        "review_title": "Don't see how it deserves a 3.2",
        "review_detailed_main": "At least a 5 would suffice. Like come on this movie is meant for kids and those whom love that little nostalgia yeah it was corny, and yeah, it was really stupid. But fellows, that is the power rangers. Many teenagers such as myself grew up on it. We fed on the corniness of having huge robots to make one mighty robot. It's just sad how people will judge a movie based on power rangers because power rangers aren't cool anymore. Most of these people believe it isn't because society tells them, \"hey you kid, you're what, 10? Yeah... well, f.y.i. you;re a loser for liking power rangers still, move onto anime.\" What else is sad... is how critical people are. It's a KID'S movie. Yeah, sure, \"Finding Nemo\" was funny for everyone but, Power Rangers was never meant for adults. Simply, children. If it was for adults I'd say hell yeah, a 2 is out of remorse, but since i remember the good old days. I'm giving this movie a 5 because yes, there is much better movies, but this movie is good for its purpose. Or at least was."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "At the end of the day, it is actually mindless fun!",
        "review_detailed_main": "Okay, if you forgive the banal dialogue and the plot contrivances, plus the fact the film tends to become silly and cheesy, it is really mindless fun aimed at kids. Yes the script is weak, and the story is suggestive of an extended TV episode, and does get very silly at times. Despite all this, it does have a sense of fun, and not as bad as the rating makes it out to be. The music is good, and an unrecognisable Paul Freeman as the villainous Ivan Ooze is surprisingly good, with some excellent delivery of the film's best lines. Ooze is not only scary but incredibly funny as well, and Freeman the great actor he is nailed that on the head. The performances on the whole are decent, certainly not Oscar worthy material, and there are some well staged fights, even if the effects are nothing special. I will confess I don't like the TV show that much, but despite the failings that this film has, it is fun to watch. 6/10 Bethany Cox."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "ADFman",
        "review_rating": "6",
        "review_title": "enjoyable",
        "review_detailed_main": "Ok i admit it i was into the power ranger thing back in the day. This is a fairly decent big screen adaptation of the TV series. dont get me wrong but at the time Power Rangers was the Biggest thing in Childrens Entertainment. I went and saw this movie. i enjoyed it. nothing negative that i can say about it, i think its a Quirky film appealing to the tween market. This movie is better than the series when they get their Ninja Powers. but that was about it. BTW the new series is looking like it is back in stride with the originals. It nice looking back on this film as what childhood meant to me. Turbo, isnt that nice of a movie by all means. out of the two Power Ranger Feature Films pick Mighty Morphin Power Rangers: The Movie. Cast is from the TV series. enjoyable adaptation"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "Very cheesy kid stuff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "yashyamashita",
        "review_rating": "5",
        "review_title": "this is my childhood",
        "review_detailed_main": "this is my favorite movie out of all the power rangers movie released. this is the first movie that i owned (and in VHS back when i was a tiny child).i would watch this every single week and almost had the script memorized. i would wear my pink ranger costume and held onto my action figure while reciting the lines from the movie.\n\ncheers for our childhood."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jordan_perryuk",
        "review_rating": "4",
        "review_title": "Globalization commenting on globalization?",
        "review_detailed_main": "One thing I've noticed when watching this movie again (caught it languishing on the sleepy annals of daytime TV) is that there is an overriding theme of anti-globalization. The whole mass manufacturing of the 'ooze' to brainwash the parents of Angelgrove, seems to be like some grotesque fast food enterprise. Is this the intelligent, political message we've all been trying to find in the movie? Well, hardly, as the whole Power Rangers franchise, in its day, was one of the most wealthiest and popular businesses, and it dominated the television and toy industries.\n\nI remember I was seven years of age when the movie was released. However loathsome you may think of it now, when the movie was launched, prepubescents everywhere were celebrating. It was what the countless hordes of kiddies were waiting for. The irony is, is that I was among those ranks of enthusiasts, who believed that the Power Rangers vehicle was deified or something. But the real irony is that we were all brainwashed, as if we had guzzled our own healthy dosage of ooze. Oh, how naïve.\n\nThe script, is of course, utterly abysmal. The movie's entire dialogue seems to be a disgusting volley of clichès. Their purpose was probably to add a touch of humour, but their delivery were so unforgivably corny they were all swallowed by the audience (apart from those too young to know) like lead bullets. They are so dull I can't remember any. There is some unintentional laughs: when Tommy stops the monorail from plummeting from the tracks 'just in time'. Everyone knows that they'll be practically teetering on the edge before they are dramatically saved.\n\nI remember I used to vehemently abhor Bulk and Skull, but now I actually feel sorry for them. They are a duet of desperate low-lives who just seem to get in the way, but we sort of sympathise with them, because they are just so inordinately hopeless.\n\nIt is true there is nothing beyond the hammy kung-pow karate theme, but the people who saw it in 1995 (exempting the submitting mothers who promised to send their kids to the cinema as long as they'd just shut up) weren't expecting a Sartre-style treatise on existentialism, but to consume more vacuous action from the Power Rangers. Naturally, its more of the same: its basically an episode agonisingly stretched to feature-length. To my juvenile anger, Lord Zed played a very small role in the movie's plot. Instead you have eccentric despot Ivan Ooze who had been 'woken' (as most movie horrors are resurrected) who does have a sort of shine about him, but he's still terribly drab in parts. You can imagine the parents raising a smile to a couple of his sardonic comments.\n\nTo be fair, the acting isn't totally irritating. The Power Rangers were marginally better than they were on the small screen, but for anyone watching the movie today, there is little to get excited about. They are predictable and so therefore of little interest. What I still find interesting today is the costumes, such as the dinosaur fighter statues that emerge from the rocks. They look like overgrown Henson puppets. And Ooze's cloak looks like its made from purple tin foil.\n\nThe effects were advanced for their day, I'll give them that. The whole plot is like one behemoth of a computer game, so without special effects, the movie would have been further flawed. But once again, they have painfully dated, and the scene where Ivan Ooze extends and morphs into one of his giant metal insects is hysterical.\n\nStill, its the classic schmultzy 'and they all lived happily ever after' movie, and as long as you ignore the lukewarm script and just prepare yourself for a film that doesn't delve beneath the surface, you'll find it's an alright movie to watch, maybe once, with the children or the family. Its no Citizen Kane, but then what in today's film industry really is?\n\nAnd no one can deny that the Power Rangers were something almost everybody raved over in the early nineties: they were at their popularity zenith when this film was released in 1995. It WAS a big part of many children's lives, who wished something exciting as this would happen in real life. And lets face it, for many children the watchful eye of the Power Rangers would be something comforting, a protection against the bleakness of the world. Shame it's just so awful today."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Quantom-X",
        "review_rating": "7",
        "review_title": "First movie I saw in theaters, 5 years old",
        "review_detailed_main": "Lots of nostalgia here. I grew up watching the TV show. And as far as I can remember, I believe this was the first movie I saw in theaters. It has it's ups and downs, the acting is on par with typical Power Ranger acting, but it has it's greats. Jason David Frank as Tommy is amazing as ever. And Ivan Ooze is one of the all time best Power Ranger villains period."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "J-1984",
        "review_rating": "3",
        "review_title": "Better than Turbo: The Power Rangers Movie...",
        "review_detailed_main": "The first series of Power Rangers was good, then it all went down hill. The movie is better than Turbo: The Power Rangers Movie but still could be ALOT better. It suffers from a very bad script and below average acting. Ivan Ooze is not scary and the special FX are extremely poor. This could have been a good childrens martial arts film but instead it's...not."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "10",
        "review_title": "Brings back so many memories",
        "review_detailed_main": "1994 was the year of the Might Morphin Power Rangers, I was only 9 years old and was such a huge fan. I remember the summer of 1995 my friends and our parents took us to see The Might Morphin Power Rangers: The Movie and we thought it was the greatest movie ever made. I know that's sad, but we loved the show and the movie lived up to a great episode with an even better budget. I hadn't seen the movie since '95, but my boyfriend and I went to Target and found this movie on the $5.50 shelf and I grabbed it for old times sake since he was also a Power Rangers fan when he was a kid. We watched it and I have to say that despite how bad it is and how mega cheesy the lines and acting are, Mighty Morphin Power Rangers: The Movie is what it is. It was aimed at kids and was terrific for them, the story was so bad that it was actually good.\n\nThe rangers are living their lives in the fast lane, they're sky diving and roller blading, I mean is there anything they can't do? But anyways, all that is put on pause when Zordon warns the rangers of Rita and Zed's evil plan to raise Ivan Ooze. Ivan is planning to take over the world when he shrinks Rita and Zed and is putting all the kids parents under a powerful spell to make them do his bidding. Ivan then visits the command center and destroys it leaving Zordon in bad shape and now the rangers have to save the world on top of saving Zordon and become the powerful ninjas to regain their powers and defeat Ooze.\n\nMighty Morphin Power Rangers: The Movie is extremely silly and cheesy, but I don't know what people were expecting when they watched it that it got such a bad rating. It's one of those movies that is so bad that it's actually good. Although Zordon's face will haunt my dreams for a long time, it was classic the way the \"actors\" who played the rangers presented their lines, I loved how they would fight and do back flips, yet could say their lines perfectly without sounding out of breath. Also how they replaced certain rangers with people who looked like they were picked out of a kick ball team line. But Mighty Morphin Power Rangers: The Movie is a classic film I think in a sense and will be a true time capsule of 1995.\n\n10/10"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Slarkshark",
        "review_rating": "7",
        "review_title": "In Morphin' Teenagers We Trust",
        "review_detailed_main": "Starting a movie off with Red Hot Chili Peppers is always a recipe for success.\n\nEither you grew up with the Power Rangers or you didn't. If you didn't, this is one of the stupidest movies out there, but if you're like me and were a kid through the nineties there's a good chance you watched Power Rangers. As a result, I watched this movie a lot as a kid, and so even now it's packed full of nostalgia.\n\nIvan Ooze was a pretty good villain too with clever dialogue. After all, Paul Freeman was the villain in the greatest adventure movie of all time, that of course being 'Raiders of the Lost Ark'.\n\nThe CGI is pretty rough, but again it's 1995 and Power Rangers, so just enjoy it for what it is."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "marshall89",
        "review_rating": "2",
        "review_title": "A true stinker, but you were expecting L.A. Confidential?",
        "review_detailed_main": "Yes, this movie truly does suck. But observe my review summary folks. I'm not going to say I liked this movie, but it is a Power Rangers flick after all. It's supposed to be bad! I'm sure that when the writers were cooking this up they intentionally threw in average dialogue and bad fighting. After all, when the crowd you're trying to appeal to is a bunch of 5-year-old boys who run around in clunky Power Rangers costumes and wear PR underwear, you know you don't have to work too hard.\n\nI'll admit I never was a Power Rangers fan. I can still remember back in the mid-90's when the show was huge, and a lot of my friends were into it. But even at age 6 I never did view Power Rangers as a ray of hope from the heavens like most boys. I always thought their outfits were stupid and that the villains looked dumb. And at age 13 my opinion hasn't changed one bit (Gee, go figure.). But you see, the reason we ended up with this monstrosity is because we received it as a Christmas gift from one of my dad's students, and she comes from a family that doesn't have a lot of money, so forgive.\n\nNow, let's get down to the point. In some construction yard an egg containing the evil Ivan Ooze (Oh god...here we go) has been dug up and opened, releasing the evil piece of snot to terrorize the world, even though he couldn't pull off a robbery at a convenience store. Ooze goes to the Power Rangers' control center and destroys everything, leaving the place in ruins and stripping leader Zordon of his powers. The Power Rangers must go to some planet and learn some powers to save him and destroy Ooze. As if the plot isn't bad enough, the film only gets worse. The first sequence has the Poopy Rangers sky-diving while a pop version of Stevie Wonder plays in the background. The song is catchy, but come on: Why is music from a genuine musician like Stevie Wonder in such a lifeless film? Anyway, let's skip everything and go to where our \"heroes\" discover Ivan's egg, and then engage in an incredibly fake battle with Ooze's drones. Then comes the parking garage scene, where the Rangers constantly strike their stupid fighting pose and react to drops of water. Then they find the boogers and fight them while simultaneously delivering sucky catch phrases every 3 seconds, a tradition that is revived later on. I couldn't spot any cables or tracks, but you can still tell they're being used anyway. For instance, how do you explain the scene with the blue ranger falling but going into a pillar rather than touching the ground? Nuff said. They eventually squash all of the goobers, and let me state that the scenes of them getting squashed aren't the least bit violent. I don't need to explain the rest, for it only gets dumber somehow. And I'll let you in on a very surprising secret: I haven't even watched it all the way through. I would have seen everything, but my parents told me I didn't have to watch it to be nice. Even as a teen you've got to admit that mom and dad are always right, and they were definitely right on this stinker. On the only plus side, Paul Freeman does actually deliver a good performance as Ivan Ooze, and is given the only lines that are sort of funny. He also seemed to be the only one who cared amidst an entire crew whose only intentions were to release a 6-year-old junk flick.\n\nI'd say more, but I feel what I have stated is enough. One thing's for sure: I will never, ever forgive myself for watching this steaming pile of s***.\n\nI'm gonna go watch some Spanish soaps now.\n\nOverall rating: 1 out of 5."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "gorillez",
        "review_rating": "10",
        "review_title": "Power Rangers on DVD wow!!!",
        "review_detailed_main": "When I was 8 I used to rush home from school to watch the Power Rangers fight their new baddie of the week. I thought it was great! And then the movie came out and I was able to see them on the big screen. I've gotta tell you that it was fantastic! As an 8 year old I fell in love with Tommy (my first crush) and couldn't help but laugh at all of the jokes. 10 years later I found it sitting on a shop shelf, WHAT! POWER RANGERS ON DVD??? NO WAY! SO, as you do, I bought it and it was just as good as I remembered. Perhaps not for the same reasons though. Some of the jokes have worn off but as a now 18 year old I am understanding all of them now. I still find Tommy to be absolutely adorable and I have found this trip down memory lane to be quite an exciting adventure. I would recommend this movie to anyone who was a fan of the show as it is quite funny to see them talking with their fists all of the time no matter the context and the different fashion back then. How often do we see teenagers dressed with their shirts tucked into their jeans with a nice brown leather belt? Ha ha ha. I thought this movie was great for a laugh. POWER RANGERS ON DVD??? WOW!!!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jhaggardjr",
        "review_rating": "7",
        "review_title": "Major guilty pleasure",
        "review_detailed_main": "I hate to admit this, but \"Mighty Morphin Power Rangers: The Movie\" is one of my major guilty pleasures. I really shouldn't like this movie since it's aimed squarely at kids. But to my astonishment I did. It's no classic to be sure. It's mostly ridiculous. It's absurd in many ways. However for some odd reason, it entertained me. The thing I liked best about the movie is the six young actors who play the Power Rangers. They're all good, although I wish the screenplay would have let their characters delelop better that it did. Then this movie would have been better. I wish this movie, as well as the TV show, could have been aimed at teenagers instead of kids. Then some of it wouldn't be so juvenile. However, this movie is nowhere near as childish as the terrible second movie \"Turbo: A Power Rangers Movie\". One good thing about \"Mighty Morphin Power Rangers: The Movie\" is that you don't see much of two of the most brainless characters in the history of show business, Bulk and Skull. Cut those guys out! The six actors who play the rangers (Karan Ashley, Johnny Yong Bosch, Steve Cardenas, Jason David Frank, Amy Jo Johnson, and David Yost) give far better performances compared to the two actors who play those goofballs (Jason Narvy and Paul Schrier) in this movie and on the TV show. Of all of these actors, only Johnson has gone on to some fame (on TV's \"Felicity\"). \"Mighty Morphin Power Rangers: The Movie\" has better special effects than on the show and in \"Turbo\", and that helps alot. This is one odd picture. It ain't all that good, but it's not all that bad either.\n\n**1/2 (out of four)"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "WhatsThePointOfThisShow",
        "review_rating": "1",
        "review_title": "Power Rangers, first the worst television show, now the worst movie to accompany it!",
        "review_detailed_main": "First of all, the power rangers television show is the worst television show ever made, so, I guess the people behind it, want the worst movie ever made. Mission accomplished.\n\nPower rangers is about a group of intellectually inferior kids who dress up in silly spandex outfits and play around in '70s Japanese plastic toys, they \"fight\" each other with Kung Fu.\n\nYou would think that Americans would have the intelligence to avoid such nonsense, but, I guess not, the youth of America were gullible enough to buy into this nonsense, so what did they do, make a silly movie to accompany their awful television show.\n\nThis is not a television show or movie, it's really a commercial to sell second and third class plastic garbage to the gullible youth of America, period.\n\nAvoid at all costs!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "David, Film Freak",
        "review_rating": "",
        "review_title": "It's Morphin' time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "dee.reid",
        "review_rating": "4",
        "review_title": "Losing its \"Power\"",
        "review_detailed_main": "I've got good news and bad news. Here, there is dual cause for celebration, and dread. The good news: In \"Mighty Morphin Power Rangers: The Movie,\" the Saban-backed children's television commodity-turned-feature-length movie is pretty much everything fans of the awesome color-coded defenders of good could ever want. The bad news is, that's about it. This big-budget feature-length movie plays out pretty much like an extended version of the television show, and doesn't really offer much - to outsiders or the hardcore fans accustomed to the high-kicking action and special effects.\n\nAs a fan of the Power Rangers from about 1994-1996 when I was between the ages 9 and 11 (the movie features the best and most popular cast from the television series, when Power Rangers were at their peak), I was one who eagerly waited in anticipation for a \"Power Rangers\" movie. I collected the toys, and I watched the show almost religiously on weekday afternoons on Fox Kids. Believe me when I finally saw the movie, I was blown away.\n\nIn 2007, I'm 21; I've grown up. But I've still found myself attached to a lot of stuff from my more youthful years; Power Rangers aren't one of them. Some of it's because I haven't watched the show since the cast from the '94-'96 season changed, and a recent viewing of \"Movie\" offers little to a former fan. Maybe it's because I, like my favorite high-kicking teenagers, grew up.\n\nAs a youth, it's easy to fall in love with this stuff. You got cool-looking characters, really bad guys, lots of kung-fu action, crazy plots, cheesy dialogue, and explosions and stuff. If you're an adolescent into things that go BOOM!, you're in the right place. I was one such adolescent with a big imagination and wished he had awesome morphing powers like his heroes. Some parents even got angry because they believed \"Rangers\" taught kids to fight out their problems rather than talking them out. Please.\n\nIf you were into the show, you remember that six teenagers of the fictional city Angel Grove, California, were chosen by the being Zordon to become the hyper-charged Power Rangers, ninja-like warriors sworn to defeat evil everywhere it reared its ugly head, with awesome powers and their Zords - gigantic machines that represented prehistoric animals that could be used to fight their enemies in kaiju-style showdowns. Aisha (Karan Ashley) became the (second) Yellow Ranger, Adam (Johnny Yong Bosch) became the (second) Black Ranger, Rocky (Steve Cardenas) became the (second) Red Ranger, Tommy (Jason David Frank) became the White Ranger, Kimberly (Amy Jo Johnson) became the Pink Ranger, and Billy (David Yost) became the Blue Ranger; Billy was always my favorite. Together, they defined teamwork and were perfectly suited to fight off the extraterrestrial and domestic evils that threatened mankind.\n\nIn \"Movie,\" Ivan Ooze (Paul Freeman, chewing up all his scenery) is freed from a 6000-year imprisonment when Angel Grove construction workers accidentally stumble onto his lair. The nefarious Lord Zedd and his motor-mouth wife Rita Repulsa and their two minions Goldar and Mordant go to meet him and allow his revenge on Zordon. But he must first deal with the Rangers. After a few confrontations with Ooze's foot-soldiers, Ooze attacks their base, which leaves robot Alpha 5 short-circuiting and Zordon with only a few days to live. This renders the Rangers without their powers or their Zords, and they must journey to far-off Vados to receive new powers. With help from bikini-clad warrior chick Dulcea (Gabrielle Fitzpatrick), you can pretty much bet your $8 that this trip will be worth it, again, if you're a fan.\n\nFor those of us who are die-hards for \"Mighty Morphin Power Rangers: The Movie,\" screenwriter Arne Olsen and director Bryan Spicer ensure that this is one adventure that won't disappoint. Except for a few minor changes, Spicer and Olsen stay remarkably faithful to all that we knew and love about the source material. This is also the first incarnation of \"Rangers\" to feature completely original material, instead of stock footage borrowed from Japan's \"Super Sentai,\" the show that inspired \"Mighty Morphin Power Rangers.\" The choosing of the show's original stars instead of new actors was also a plus.\n\nProblems abound in \"Movie,\" the simple fact that it seems like an extended of version of the show. A rundown: an evil appears, and the Rangers come together to fight it. The movie pretty much follows the same formula, except it's 101 minutes of your life that you'll either love or want back desperately. Original \"Rangers\" show was never much for performances (so it's a moot point here to even mention it), and the dialogue never really goes beyond typical Ranger-speak (\"Let's do it, guys!\" or \"You ooze, you lose!\").\n\nThe one having the most fun, however, is Freeman. Unrecognizable under some heavy-duty prosthetics, he relishes playing the bad guy ten-fold in the best (and somewhat hokey) performance. Comic bullies Bulk (Paul Schrier) and Skull (Jason Narvy) are remarkably underused, and youth Fred's (Jamie Croft) is also underused. Most telltale about how much we've grown up, are the film's CGI special effects, which were brilliant for 1995 but have obviously dated and are yet another reminder that this is a film showing its age from a time when television was so much simpler.\n\nI guess \"Mighty Morphin Power Rangers: The Movie\" found its audience 12 years ago but will definitely have a hard time finding new viewers. I personally loved the cast and the show, but have a hard time looking at the movie now. Regardless of my misgivings now, 10 years ago this was it and probably about as good as it was going to get for the Power Rangers. Unfortunately, this is all we have left of the glory days when the Power Rangers ruled the world. When they lost their powers in the movie, some people today might wonder why they didn't lose their powers permanently.\n\n4/10"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "allmoviesfan",
        "review_rating": "5",
        "review_title": "Go, go, Power Rangers!",
        "review_detailed_main": "What a trip down Memory Lane!\n\nThere was a time where the biggest thing in the playground and recess and lunch was Mighty Morphin Power Rangers: toys, TV show and movie.\n\nThis feature film - shot in my home town of Sydney; the iconic skyline is very prominent throughout, and the single track for the now-defunct Monorail is destroyed in one scene - probably came out around that time. If you're a kid, you're gonna love this film. I certainly did, back in the day. We all thought the Rangers were the epitome of cool.\n\nRewatching it nearly three decades on was not kind. It's corny, cheesy - oh, so very, very, very cheesy! - dumb, and over-acted; there isn't one main cast member who isn't guilty of this. That said, it probably sold a LOT of toys and that's the name of the game with these sorts of movies. Also, not being a kid any longer, I'm not the target audience. They don't notice that sort of thing. Interestingly, I noticed plenty of pop culture and other movie references. Very clever."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Christopher_Reid",
        "review_rating": "7",
        "review_title": "A childhood favourite, still fun even if it's silly",
        "review_detailed_main": "Like about 20 movies in total, Mighty Morphin Power Rangers: The Movie was for some period of time my favourite movie. I really liked the style, the colours, the energy, the basic concept, the action, the comedy, etc. Much of that still holds up today although it's very flimsy - not much is to be found in deeper meaning or originality.\n\nEbert is right that the characters don't have much individual personality, but that hardly matters. Their teamwork and positive attitudes shine through. Even though it's cliched, at least it's a good message for kids. They do fun things like skydive and roller blade (something I've recently been learning in my mid-30s), all while being safe and wearing their assigned colours. I don't see why they need issues to be more interesting. Nor do I think they need majorly different roles to play. As it is, we at least get Tommy who is a leader and Kimberly who is more sentimental.\n\nThe action is enjoyable, especially with some good music to go with it. It's harmless fun with many ridiculous physics-defying moves - a lot of flying kicks and spinning.\n\nVisually, the movie holds up well. The costumes are cool - all different and shiny, including the goodies and the baddies. The special effects are dated but the designs of the zords and robots are cool, all of them newly introduced in this movie.\n\nThe music is surprisingly good and underused if anything. The action songs are decent, fit the choreography and don't disrupt the flow, but the orchestral score is even better.\n\nThe plot is very thin and full of holes. Apparently the Rangers can casually teleport to other planets and Ivan Ooze's bird monsters can also fly through space with ease. And I didn't know that comets were fireballs which you could throw enemies at. At least the movie hits the right beats and we don't get buried in melodrama or exposition - the story just keeps moving and focuses on the action, comedy and excitement.\n\nPaul Freeman is clearly having fun as the main villain. He gets many funny lines including one he apparently ad-libbed - that he was disappointed to have missed The Brady Bunch Reunion (he likes being around for disasters). As an adult, his performance is the main highlight although the action and some of the comedy is also sincerely entertaining.\n\nI can see that the movie isn't quite as flawless as it felt when I was 10 years old, but it was good enough to engage me and still generate some laughs and smiles. It embraces its goofy, safe, feel-good action and does it well."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "BeastWarsTransformers",
        "review_rating": "1",
        "review_title": "The power rangers television show is bad enough, but this movie is far worse!",
        "review_detailed_main": "Okay, we all know how bad the power rangers television show is, but as bad as the show is, this movie is far, far, worse! At last check this movie rated only a 3 out of a 1-10 scale.\n\nI really don't see why this movie isn't rated lower! Power rangers, with all of it's television shows is nothing more than a commercial for second class plastic garbage to sell to unsuspecting children around the world.\n\nThe television show has already been banned in two countries, New Zealand, and Malaysia, perhaps they see through all of this negative advertising.\n\nThere are far better forms of entertainment for our children. Avoid showing them power rangers in any way."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "greenglowstick",
        "review_rating": "10",
        "review_title": "This Movie is the Shiznit!!",
        "review_detailed_main": "This film is not meant to be at all meaning full to an adult audience. I however saw this film as a child and loved it. I wish that children's films were still like this today instead of that animated junk. This film was terrific it has a pretty great story lovable characters and great villains. I fell bad that this terrific series has gone down the poop shoot with about 9 remakes of the characters. I think that a lot of people that were children when this came out would agree here. Not to mention the film had an amazing soundtrack. All in all for a children's film i think that this film was worth the money and i suggest this movie for the newer generation of children too!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Adam-the-tall-1",
        "review_rating": "6",
        "review_title": "So much nostalgia.",
        "review_detailed_main": "This movie is stupid. It's meant to be stupid. As stupid movies go, there are certainly worse picks. If you ever need to kill 90 minutes and you have an odd urge to see a ninja robot kick an alien robot in the crotch, launching them into space, there's no better way to kill two birds with one stone."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "ironhorse_iv",
        "review_rating": "5",
        "review_title": "Uh-Oh! The movie is in trouble. Somebody came along, and burst their bubble! Still, it was alright fun. It's Morphin' Time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "dnjlifestyles",
        "review_rating": "10",
        "review_title": "Fantastic Fun!",
        "review_detailed_main": "This movie was released when I was a kid, and I was already a huge fan of the Power Rangers television series (the original series is still the best!). This film had all the right ingredients from the series, with added fun like new costumes, villains, locations, etc. And of course, all the stars look fantastic in it, and if you're a fan of the series, you'll be amazed at how much better the film comes across on screen. The action scenes are well set out and of course, there is lots of cool graphics (bigger budget means bigger looks!). But don't just think it's all about the action- there is a lot of fun mixed into it all as well. Lots of fun, and can appeal to a large range of audiences. Sure, it may just be a 'kids' film, and is not exactly Oscar material, but it is perfect for what it is! Remembering that this series is one of the most successful children's series in the last 20 years, the film is a definite must for all fans."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "coreyl145",
        "review_rating": "7",
        "review_title": "Fantastic,Perfect for fans of the TV Series!",
        "review_detailed_main": "Power Rangers:The Movie is one of my new guilty pleasures. Now I'm gonna admit,I was born in 1999,after the big craze of The Mighty Morphers died out somewhat and have only recently started watching the entire series,only prior experience i had was with time force,wild force,ninja storm and Dino thunder. I Watched this film after finishing season 2 of the mighty morphin power rangers,which i consider excellent and had somewhat high hopes for this film. For a fan of the series,mainly the zordon era,this is a great movie to watch,and i feel it does the series justice,even it is now not canon to said series. The Plot of the film follows the rangers of the second season of Mighty Mrphin (Rocky,Adam,Billy,Aisha,Kimberly and Tommy) battling the villain Ivan Ooze,who has been released from an egg Zordon imprisoned him in six thousand years before the events of the movie. Ivan Damages the command center and incapacitating Zordon. the rangers are sent to the planet Phaedoes to become powerful enough to stop Ivan and help Zordon,and ultimately save the world. The action scenes were awesome in that special Power Ranger/Super Sentai kind of way,especially the Scene with the new Zords and when the rangers are skydiving,and the story was fun and easy to get into and immerse yourself with a great new villain. This film is a perfect side-watch to fans who have seen the Mighty Morphin Series,although if you aren't a fan of Power Rangers,you will more then likely find no enjoyment from this film other then the fantastic action scenes."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "dinoballz",
        "review_rating": "1",
        "review_title": "MMPR storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "dtm666",
        "review_rating": "",
        "review_title": "They call this a movie... and it shows.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "bkrauser-81-311064",
        "review_rating": "1",
        "review_title": "Not the Nostalgia Trip You'd Hope For",
        "review_detailed_main": "Oh boo, hiss, yes I know! \"Don't mess with my childhood,\" I hear so many of you ape in unison like teenage fans at a rock concert. When was the last time you actually watched Mighty Morphin Power Rangers? When was the last time you actually tried to understand the group dynamics, the intricacies of the plot and the villain's head-scratching plot for world domination?\n\nThe movie begins with a prolonged skydiving sequence (which granted was cool when you were six but looks silly now). After slapstick bulwarks Bulk (Paul Schrier) and Skull (Jason Narvy) land in a construction site, they discover an alien looking egg which alerts Power Rangers leader Zordon (Nicholas Bell). The Rangers are dispatched to recover the egg but perennial villain Repulsa (Julia Cortez) gets to it first and unleashes Ivan Ooze (Paul Freeman), a powerful inter-dimensional wizard capable of usurping untold amounts of energy. He neutralizes the Rangers, forcing them to travel to a far-away planet to find more power I guess. Meanwhile Ivan dolls out his ooze to the masses gaining control of a hypnotized slave workforce to recover his Titan robots. The Rangers return in time for the ultimate battle, suiting up in snazzy new costumes and inexplicably appropriately themed mega-robots.\n\nMighty Morphin Power Rangers: The Movie upon repeated viewings feels like an overt cash grab, complete with brand-spanking-new animal themed robots meant to sell toys. Everything from the acting to the story is so flaccid, boring and phoned-in that it's borderline insulting watching it as an adult. And lest we forget, even if you forgive all it's faults, there's still the cheap special-effects. While as a young child such ineptitude was forgivable, today the Power Rangers' chintzy miniatures and vapid monster v robot setup conjures memories of Post- Mothra Godzilla (1954) movies."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "suspiria10",
        "review_rating": "5",
        "review_title": "S10 Reviews: Mighty Morphin Power Rangers: The Movie (1995)",
        "review_detailed_main": "Ivan Ooze is uncovered after 1,000 year slumber and only those Power Rangers can defeat him. When Ooze destroys their layer and leaves Zordon to die, the Power Rangers must travel to a distant planet to find more powerful Zords to defeat Ooze\u0085.before he enslaves the human race. I'd hate to live in Angel Grove, the school's suck.\n\nBy all accounts the film is pretty lame, much like the series but for some reason it was enjoyable. It moved pretty well and the corny action and screwball jokes elicited a guffaw or too. Pretty similar to the Masters of the Universe movie and the Teenage Mutant Ninja Turtles series. They were all OK popcorn moochers."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "emasterslake",
        "review_rating": "7",
        "review_title": "Back when I was a sucker on franchises like this.",
        "review_detailed_main": "I was obsess with the Power Rangers when it first came on back in the mid 90s. The show already hypnotized me, so I was looking forward in seeing this movie. I remember there were hardly any people in the movie theater when I saw it.\n\nIt's much different from the TV series I knew from. Starts off with the discovery of an egg pod containing ooze that's been imprisoned on Earth for quite sometime. Lord Zed and his minions come to awaken the the egg pod which has this Ooze dude named Ivan Ooze who's going to create chaos and crush the Power Rangers with his very hands.\n\nOnly to discover that this foe is much more challenging than he appears to be. And the Power rangers will need upgrades in order to defeat him.\n\nI've seen this movie so many times right until I lost interest in the series years later. Been years since i've last seen this film. But since I'm no longer a fan of it, I don't really consider it a cult classic. The die hard fans might enjoy it a lot. This is one of the examples of low budget movies that lure me, way before I knew the difference between a good and bad movie."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "The_Movie_Cat",
        "review_rating": "3",
        "review_title": "\"Go Go Power Rangers!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "D_I_Sammi",
        "review_rating": "9",
        "review_title": "Underrated, innocent and chock full of 90s harmless fun",
        "review_detailed_main": "Accused of not being ambitious enough, Mighty Morphin Power Rangers: The Movie stays true to its TV form rather than change and branch out into the movie mainstream - this gives the movie a unique attraction to those who enjoyed the mindless but invoking nature of classic Power Rangers. My favourite part are the amazing sets and costume designs, particularly that of the command centre and the make up for Ivan Ooze, one of the greatest and most fun villains in any nineteens movie. Accompanying this are some great orchestral scores and a genuine sense that life is happy and everything is going to be okay; and even if it lacks overall scope, quality CGI, character depth or ambition, it returns instead pure innocent coolness and a sense of adventure."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Lando_Hass",
        "review_rating": "7",
        "review_title": "The Power Rangers TV series basically went to hell after the movie...this movie was good though...",
        "review_detailed_main": "Back then when I was a kid,I thought that the Power Rangers were cool,but now I realize that all of the rangers are geeks...just plain geeks.The last time I watched this movie was when I was like 6,and I thought the movie was the best thing ever made,but I just watched it again to see what it was like,and it was just plain average.This movie does have some good pints,it has some pretty good fight scenes,good make-up effects,and just the fact that it was the classic Power Rangers,it wasnt Power Rangers Zeo,or Time Force,or whatever else they came up with,it was just the old good Power Rangers.there was some stuff I didnt like about the movie,for one,I didnt like the acting,it just didnt really seem convincing that all 6 kids were heros,but when your like 5 years old,you dont really care for stuff like acting.Another thing I didnt like was that the Power Rangers' suits didnt look all that great,but again,the suits look good if your 5.The new villains were pretty clever,but those ooze things dont have the vibe that the old puttys had.Overall,Power Rangers: The Movie is a great movie if your under 7,and its a good movie if your over 13.7 out of 10."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "zkonedog",
        "review_rating": "3",
        "review_title": "Doesn't Understand The Meaning Of \"Camp\"",
        "review_detailed_main": "The last time I saw the first \"Mighty Morphin Power Rangers\" movie was as a 10-year old in the theater in 1995. I remembered it being rather disappointing, and upon a recent re-watch (inspired by the new PR film in theaters) it had much the same effect. Unfortunately, the producers of the film don't understand that the appeal of \"Power Rangers\" lies in camp humor, not witty wisecracks.\n\nFor a basic plot summary, this film introduces new super-villain Ivan Ooze (Paul Freeman) whose goal (as usual for this show) is to take over the world. The first part of the plan? Trash the Rangers Command Center and leave Zordon (Nicholas Bell) close to death. This forces Rangers Tommy (Jason David Frank), Rocky (Steve Cardenas), Adam (Johnny Yong Bosch), Billy (David Yost), Kimberly, (Amy Jo Johnson), and Aisha (Karan Ashley) to search a nearby planet for a secret power force that can restore Zordon (and thus their powers) to full health in order to defeat Ooze.\n\nYou know, the sad thing is that there is a kernel of something decent planted early in this film. The idea of Zordon being central to the \"rescue plot\" is intriguing, and I will admit it is kind of cool seeing a totally Americanized version of the Ranger outfits (no Super Sentai footage here).\n\nAlas, the biggest problem with the film is that the filmmakers don't seem to understand that \"camp humor\" is a big part of the Power Rangers draw. I think of it like the only 1960s Batman episodes: Batman and Robin play ridiculous situations totally straight...and that is much of the fun! As soon as the Dynamic Duo starting winking and nodding at the camera, the jig is up! That's exactly what happened in this film. Without the Super Sentai footage and structure that powered the first two seasons of \"Mighty Morphin Power Rangers\" on television, the approach here was to insert wise-cracks and (dumb) humor whenever possible. The worst offender was the Ooze character. Even as a 10-year old I could easily see how stupid of a villain he was.\n\nNot helping matters is that, to be frank, Rocky, Adam, and Aisha cannot hold a candle to the Rangers they replaced (Jason, Zack, & Trini). I don't think there is much debate about this among fans of the show. Also, the whole \"ninja costume\" Ranger sequences fall very flat, while the Zords battling Ooze's \"monsters\" would have been better served by Super Sentai, I think, as they were so so poorly conceived.\n\nAll in all, this was a poor effort pretty much all-around. Probably the only reason I can give it three stars is because I have so much nostalgia for the show that I won't let myself go lower! There are a few hints at what could have been a decent effort here (new villain, Zordon plot, etc.), but none of them are used correctly. Sadly, this movie pretty much torpedoed my fanaticism over Power Rangers during my childhood. I realize that the shelf life wouldn't have been much longer anyway (this stuff is made for kids, and kids grow up and find new things to do), but even sitting in that old theater (probably hyped up on sugar) dying to see the film, by the end I could tell that the bloom was off the rose."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Randyconrad",
        "review_rating": "10",
        "review_title": "well...",
        "review_detailed_main": "This could possibly be the best movie in cinematic history. It is well made. there is a good story line, and of course it gives you the erg to run out and break some ones arm, or leg, or ribcage. No, but in all seriousness the movies pretty horrible, but its a good horrible. the kind of horrible you watch with you're old buddy's and roar about how impressionable you were when you where, oh lets say six? what really got me going was how when they talking at the same time and do the same arm movements. How ever i must admit, i think i have a crush on the pink power ranger again... You have to love the nineties and I'm sure we will look back at the 2000's in ten or twenty years time and laugh the same way we are now."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "maxmages",
        "review_rating": "7",
        "review_title": "it's Morphin time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "gtsuth69",
        "review_rating": "1",
        "review_title": "GOOD then BAD",
        "review_detailed_main": "I was five when i first saw this and I thought this was the best thing that happened to the power rangers. The effects were awesome, the acting great and it was just really cool to see Tommy and Adam fighting again to save the world. With such wit that would knock anyone of their feet, nothing was going to stop this movie However, this was when I was five.\n\nLittle did I realise that what C R A P this actually was.\n\nMy eight year old brother got it out again - and I thought it would be good to relive the old days, when you would come home from kinder and switch on the 4:00 ABC kids to watch them morph and kick some PUTTY a s s.\n\nI'm now seventeen, and I don't remember how I liked this movie. There were so many flaws in it that my 8 year old brother got bored from this movie.\n\nThe acting was C R A P. The black guy didn't even say anything, the Rita bad lady's voice was dubbed, the effects were S H I T, even for back then, and the movie was filmed in Australia, with some Australian actors and even with the Sydney Harbour Bridge in perfect sight. What really annoyed me was that an actor got out of an obviously right hand drive car on the left side after driving it up his Australian drive way with gum trees in the back ground. and they TRIED to pretend it was in the USA!!!!\n\nAnyway, if your five and your blind enough to miss the constant, irritating flaws then you will LOVE this.\n\nHowever, for 95% of the rest of the population, you will cringe at the most minute of details that are persistently C R A P.\n\nWhen I was five and a serious fan: two thumbs up\n\nNow I'm seventeen: two juicy thumbs down!!!!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Mister-6",
        "review_rating": "1",
        "review_title": "Not so \"Mighty\"...",
        "review_detailed_main": "The TV show is bad enough; a bunch of teenagers dress up in fluorescent primary and secondary colors to beat up a bunch of guys in old Toho monster movie costumes while talking about being good citizens, caring for the environment, whatever's politically correct.\n\nThe really bad thing is someone thought it should be made into a movie.\n\nI don't know: does \"Mighty Morphin Power Rangers: The Movie\" appeal to anyone outside of its targeted demographic (i.e. - pre-teens who are too old for the Ninja Turtles but still like seeing people get beaten up faux-Shaolin style)? Don't see how, since there is next to nothing worthwhile in this movie. I heard that in an interview one of the actresses compared this to \"Star Wars\" and \"The Wizard of Oz\". I call BLASPHEME!\n\nIn fact, the ONLY good part of this debacle is Ivan Ooze himself, as performed by Paul Freeman. He is the most aware, most expressive, most intelligent and, by far, gets the best lines. For example, when beset by the MMPRs, he squeals, \"Ooh, where's my autograph book?!!\" Now right there is one entertaining moment more than you'll witness from any of the good guys.\n\nIf they had just made \"Ivan Ooze: The Movie\", that would have been something worth seeing. However, teen violence as shown here is about on par with the \"Friday the 13th\" flicks. At least there, the teens got theirs.\n\nOne star, for Ivan Ooze, but for the rest of MMPR:TM - less \"Power\" to you."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "MovieFanGuyy",
        "review_rating": "1",
        "review_title": "Power Rangers is definitely one of the worst films ever made!,",
        "review_detailed_main": "Okay, the awful t.v. show is bad enough, well, it's worse than bad, but that's a different story.\n\nPower Rangers is easily one of the worst films ever made, of course there are some \"kids\" who still enjoy this nonsense, however, any intelligent human being would be insulted at the complete stupidity presented in both the show and this completely useless movie.\n\nWhat is exactly the point of this movie anyway? To sell more of it's plastic garbage to unsuspecting children? What is the story, that a bunch of less than intelligent karate kids dress up in bad costumes and such? No wonder so many people make fun of this show! Truly one of the worst films ever made!!!! Thankfully the public agrees with me."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "iCrazyDavey",
        "review_rating": "7",
        "review_title": "From the small screen, to the big screen.",
        "review_detailed_main": "6 teenagers are chosen by Zordon and are given powers to fight the evil of Rita Repulsa and Lord Zedd. I was only 10 years old when Mighty Morphin Power Rangers first hit the air in 1993. It was my favorite show beck then... and it still is one of my favorite kid shows today. (Yes, I watch all the new seasons!) The reason I loved it was because of the cool characters, cool looking costumes and awesome looking zords. Who never wanted a Zord action-figure when they were a kid? Everyone I know had one! 2 years later, before Season 3 aired on TV, Mighty Morphin Power Rangers: The Movie came out. I loved it when I was a kid and I still enjoy it today. Sure, it's no acdemy award winner... and will never be as good as other superhero movies like Batman Begins or Spider-Man 2, but Power Rangers is aimed for kids anyways."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "raven-19",
        "review_rating": "1",
        "review_title": "Absolutely Sad.",
        "review_detailed_main": "Its very sad that kids nowadays would even consider watching the particular movie. Cartoon violence, only this is done not by cartoons (which kids would attempt to imitate less as most children understand that cartoon physics (or lack of them) has nothing to do with real life) but by real actors.\n\nReal Actors, dressed in extremely ridiculous suits and quoting a really ridiculous script.... Overall, I do not see children over 12 (which is the minimum age to watch the movie in some countries) being attracted to MMPR:TM. It appeals to a much lower in maturity audience."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "frankmcgowan-official",
        "review_rating": "10",
        "review_title": "A mighty fine mighty morphin offering!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "MovieFan983",
        "review_rating": "7",
        "review_title": "Enjoyable",
        "review_detailed_main": "Don't judge it b4 you see it, it's really fun! 7 out of 10 Rated PG for fantasy action violence."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "vip_ebriega",
        "review_rating": "1",
        "review_title": "One of the worst movies I have seen by far.",
        "review_detailed_main": "My Take: One scene of awe-inspiring ineptitude and stupidity after another.\n\nI haven't watched this movie since I was a kid. Back then, I was a real fan of the Rangers, maybe because back then, I was a Dinosaur fan (and Dinosaurs were some kind of symbol for the Rangers). But When I grew up, I began to realize how awful it really is. Well, you know, when you're a kid, you like anything flashed in to your screen. But now, I have watched a variety of movies, and know how to distinguish a bad one from a good one. And \"Power Rangers: The Movie\" is baaaaad!!! I mean the plot is lame, the acting atrocious, the special-effects are low-budget, the slapsticks are corny and the heroics, come on, are they really heroes? Still, it's kinda good for camp laughs sometimes, but don't even think that this is a popcorn movie, it'll spoil your appetite (for popcorn). If they actually tried to do what needs to be done, and done right, it would have been better, waaaaay better. You may rent it for the kids, maybe even watch it with them. But never watch it alone, it's no mature movie, everything is childish, no stupid.\n\nWell, this may be one of the worst movies I have ever seen, and I've seen a lot of movies. Now, do yourself a favor and avoid it. Maybe watch a Looney Tunes head-banger and be amused.\n\nRating: 0 out of 5."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "emailadressequelsunlimit",
        "review_rating": "10",
        "review_title": "It is what it Is",
        "review_detailed_main": "This Film, is what it is. Its a children's adventure movie and thats all. It should not be compared to anything else, and it should not be judged the same way great films are judged. Its an original idea, and its bold. Its a non Disney production, meaning its fresh new and exclusive to my generation. Sure there is better children's entertainment, but that doesn't mean that this example is 'bad'. All i know is that I have a ball watching it now, just as I did as a kid, and that all the little children I know, enjoy it just as much as I did, meaning it cant be all bad if its standing the test of time, and reaching out to kids 12 years after it was made. Its a good time, and a good source of escapism for the adults that are dragged into seeing it. I do recommend it. If you watch it, just to negate, reject and make fun of it you will not like it. But that goes for any movie, including Star Wars and pretty much every modern family classic from Lucas/Spielberg."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "elsterusa",
        "review_rating": "7",
        "review_title": "pretty bad, indeed",
        "review_detailed_main": "This is a horrid movie. Completely dumb in every aspect that it delves in. An insult to movies, and art itself. You know what I think they did wrong with this movie? They didn't make it a comedy. Certainly, there were scenes in the movie that were meant to be humorous, but they failed and there weren't enough attempts anyway. The way I see it, this movie is a joke. I laugh at failed scene after failed scene filled with drama that would be excusable in a bad, colorless, fuzzy, and altogether terrible soap opera. This has some of the most cheezy special effects I've ever seen. The music is okay, but usually just plain stupid (not as bad is in Turbo: A Power Rangers Movie). Suspense that, well, just plain bored me. Everything is a joke. There is one thing in this movie that is not horrible. That is Paul Freeman's performance as Ivan Ooze. I believe he realizes that the movie he is in is terrible. Instead of being dramatic, in every scene he strives to find some sort of punchline so that the audience will have a harder time dozing off. I respect that. Unfortunately, this movie was made about five teenagers who look like thirty year-olds and have nothing better to do than save the world and do pointless karate moves with some very fake sound effects. Yep, a real shame. 3/10"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Klunte",
        "review_rating": "2",
        "review_title": "Sad, just sad.",
        "review_detailed_main": "This was one sad bunch. Just saw the movie again recently, and I must say i'm very disappointed. The first I saw this, it as cool and awesome but now it just stinks of stiff acting and lame stunts. The story is really thin, you just seem to get thrown into the whole thing within ten minutes or so, without any real explaining back story. The only thing that is really good about this movie is the creative make-up.\n\nOverall this film has a really annoying villain, some stereotypical heroes (But then again, it is Power Rangers), a lame storyline and some extremely ridiculous sound effects. Overall this is clearly not a bright spot in the Power Ranger history."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Op_Prime",
        "review_rating": "",
        "review_title": "Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "PowerRangersAreASININE",
        "review_rating": "1",
        "review_title": "Power Rangers is the worst television show and movie in history.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "GiveMePizza",
        "review_rating": "1",
        "review_title": "Mighty Morphin Power Rangers, one of the worst films ever made.",
        "review_detailed_main": "I see a lot of people who are badmouthing the new Transformers sequel, but, I guess if they really want bad film-making they should look no further than the 1995 power rangers movie filled with awful costumes, cheesy special effects, laughable characters, and a storyline so laughable it's hard to keep a straight face.\n\nIn 1995, right after the power rangers mania swept the country, the people behind the completely idiotic show decided to make a movie out of it.\n\nTo say that Mighty Morphin Power Rangers: The Movie is one of the worst films ever made is an understatement. Critics everywhere completely trashed this film, and it's box office was completely underwhelming as well.\n\nRoger Ebert wisely called this one of the worst films he's ever seen. I agree with him.."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Honesticedragon69",
        "review_rating": "7",
        "review_title": "Good 90's Fun For All Power Rangers Fan And Viewer With A Few Flaws.........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "lrkennedy",
        "review_rating": "1",
        "review_title": "Pwew... what reeks?",
        "review_detailed_main": "There are many things that suck in this world. Like old popcorn, New Coke, crime, and Kathy Lee Gifford. And now, we add to that list \"The Mighty Morphin Power Rangers\" movie. Not only does it suck, but it.... damn, it just sucks. Don't see it, instead rent \"The Shawshank Redemption\""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Foreverisacastironmess123",
        "review_rating": "8",
        "review_title": "\"Just throw it in their faces!!!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "kstanni87",
        "review_rating": "6",
        "review_title": "It's good",
        "review_detailed_main": "For power rangers fan it's a must see movie. It is cliche for a 1990's era movie including the humor and the CGI used for the Ivan's Ooze's robots and the Ninja Megazord didn't quite age well with the reliance on the metal being reflective and shining. How ever. Paul Freeman did a great job in his role as a no non-sense villain.\n\nHowever some of the sound effect are terrible when the Rangers are fighting the slime monsters Oozemen (Ivan calls them \"My Kids\"."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "worldsworstwryter",
        "review_rating": "3",
        "review_title": "Interesting...",
        "review_detailed_main": "So this one was definitely a wild ride. The action is quite fun in the beginning, and the acting is incredibly cheesy. However, the middle half does lag a little bit, but the ending kind of makes up for it, by evolving into a giant CGI monstrosity, that's somewhat enjoyable to look at."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Terryfan",
        "review_rating": "8",
        "review_title": "The Power Is On, The Big Screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jordanclewans",
        "review_rating": "7",
        "review_title": "27 years later, I finally watched this",
        "review_detailed_main": "So I saw the sneak-peek of this movie on my VHS of 'The Pagemaster' as a kid. Never got around to seeing it as a kid, but I found it today uploaded to the Internet Archive & I decided to catch up on old times.\n\nI don't know why IMDb collectively rates this movie, at the time of writing, only a 5.3/10. Sure, the CGI is dated now. But that's about the only criticism I have. The action is fast-paced. The soundtrack is good. The set locations are impressive. Tommy is a cool bro. Kimberley alone is worth at least a couple of stars! The humour keeps things nicely lubed. What more do you want? It's a kids' movie from the 90s!\n\nIt was bittersweet to finally have watched this. Bitter, only in the sense that I feel a little sad that I've never been a valued member of such a cool team of friends as the Power Rangers. But sweet that I've gotten to experience such a great blast from the past."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jwtrox08706",
        "review_rating": "5",
        "review_title": "Perfect if you came from the era of the original series and are feeling nostalgic",
        "review_detailed_main": "Okay, I'm being extremely generous by rating this at a 5. I think I owe it to the film even now because I couldn't get enough of this stuff when I was a kid (and now I'm going through some nostalgia, because I can with the Internet and very recent technology allowing me to do so). I remember going to see the movie with my friend and his family who lived down the street. I thought this was the mecca of all films. Now, recently I've seen it, and I realized how much I have grown. If you're looking for a film that is groundbreaking and something that will touch your heart...forget about this film. But it seems fitting to make a movie about the Power Rangers, considering how much of a fan base they had and still have. I just have one big burning question\u0097WHY PAUL FREEMAN? How the hell did such an amazing actor who played a perfectly egotistical villain in Raiders (1981) who ended up having his head exploded after opening the Ark of the Covenant end up sitting through hours of having purple cosmetics added to his face and body so he could play the chief villain named Ivan Ooze in a Power Rangers movie. Paul Freeman must have been the big name that they scored for this movie (as if the six teens and Bulk and Skull weren't big enough names), because I can't see how he could possibly have been of sound mind when he decided to do this film\u0097no offense intended. I will give him this, though, he did have a rather good performance...he was over the top...but of course that's how Ivan Ooze is. I wonder why they decided to begin the Power Rangers: Turbo series with another film? As if this film wasn't bad enough, they had to go and make a second Power Rangers film, when the series was starting to get tired (despite many changes happening all the time). I'm quite surprised that it's still going on today fifteen years after it first began. But this film has nostalgic sentimental value to almost anyone who went through their childhood in the early '90s, so it's not like Jaws 4 or a movie of the week. Enjoy revisiting your childhood."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "lordzedd-2",
        "review_rating": "",
        "review_title": "Let The Power Entertain You",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "shanestgermain",
        "review_rating": "5",
        "review_title": "A flashback to the past",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "swilliky",
        "review_rating": "4",
        "review_title": "Cheesy Nostalgia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "tlso1987",
        "review_rating": "7",
        "review_title": "THE way to remember Power Rangers",
        "review_detailed_main": "Side by side, the old Power Rangers show and the movie that came in the middle of it are pretty different. While the movie was written like an extended episode of the TV show, it's saved by better production values and good editing.\n\nHere's an example as far as production value - the Command Center in the TV show, if you remember, was a black curtain with Christmas lights hung around to fill it up. Zordon was a 2-second video clip that was looped to look like he was talking. In the movie, the Command Center is a huge room of patterned metal walls and blinking computer panels. Zordon, in the movie, is an actual actor in makeup, green-screened so his head is floating in the air.\n\nAnd the editing - the main characters always perform these over-the-top, often wire assisted martial arts, but in the movie these moves are cut just long enough to be ridiculous, and accompanied by humorous sound effects.\n\nThe main characters are as useless as ever, and really it's the villains like Paul Freeman who steal the show, but if you grew up on Power Rangers and are looking for a trip down memory lane, look to the movie for some kicks."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "T-ZER0",
        "review_rating": "5",
        "review_title": "The Power is On",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jasonmichaeldickinson",
        "review_rating": "10",
        "review_title": "The Power is On",
        "review_detailed_main": "Mighty Morphin Power Rangers The Movie is a fun ride from start to finish the acting is really good the story and plot is good the cast did a great job in this movie I always loved watching this on vhs what a blast to watch the villain is great yes the effects are dated but this movie is still enjoyable to watch I really never understood why this movie gets so much hate it has everything you want in a power rangers movie most of all Rest In peace Jason David Frank always in our hearts and memories Thank you Jason David Frank for making my childhood fun and being my childhood Hero PR 4 life. Rip."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "mkoesy",
        "review_rating": "7",
        "review_title": "A Movie that fits children who loved the TV show",
        "review_detailed_main": "As we were running intruder-safety drills at my school, I noticed in my teacher had the Mighty Morphin' Power Rangers movie and I remembered how I use to watch the movie until I gave it away. I remembered how much Inoticed the difference between the show, how it was filmed and what emotions they may or may not have put in in. I really enjoyed watching that movie a long time ago. It was definitely made for the kids and that is what I think the film critics missed. I mean come on! Its not supposed to be some sort of Academy award-winning movie that sets the standards for all movies. It actually had a pretty good story though some of the side-villains are made up of cheap plastics. Overall, the movie was great and the action sequences were pretty exciting for a child my age at that time."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Fredrik-Hamper",
        "review_rating": "2",
        "review_title": "A dragged out episode of Power Rangers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Chandlergellar",
        "review_rating": "10",
        "review_title": "It's Morphin Time! big screen style!",
        "review_detailed_main": "Well, Well, well.... what can i say about the movie version of the Mighty Morphin Power Rangers? in one word.. AMAZING! This Story follows the journey of TV's favourite superheroes Tommy, Billy, Kimberley, Rocky, Aisha and Adam, as they fight their latest enemy Dr Ooze! but they unluckily lose their powers when Ooze destroys Zordons command centre and they need to find the Ninja Powers before he destroys the world, (leading back to the TV show storyline). They fight some baddies on the way and when they get new Powers, Zords, its back to Angel Grove, where they need to finish Ooze forever. The action is great, the effects are great and everything about this movie is great because of the great cast, although i did prefer Zack, Trini and Jason to Adam, Aisha and Rocky but O well! Amy Jo Johnson is as sexy as ever, David Yost (Billy) is always great and David Frank (Tommy) is always an OK character but overrated! this was my favourite movie as a kid and its also a little of a guilty pleasure when i watch it now! this is the best Spin Off to come out the Original Power Rangers EVER! and don't bother watching any other lame spin off, this is the one for you!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jim4551",
        "review_rating": "6",
        "review_title": "An Nice Night Of Nostaglia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "3",
        "review_title": "\"Mighty Morphin Power Rangers: The Movie\"- What was once thrilling as a child is just a little too cynical looking back as an adult...",
        "review_detailed_main": "I was born in the late 80's and grew up a total 90's kid. There were three facts I knew to be certain... the kids who owned both a Sega Genesis and a Super Nintendo were gods amongst men, Ren & Stimpy were the highest achievement in comedy humanity has ever witnessed, and the Mighty Morphin Power Rangers were the world's greatest heroes. Seriously, I was obsessed. I had tapes upon tapes of recorded episodes, owned all the toys and merchandise my parents would allow me to get, went as the Green Ranger for two Halloweens in a row, had a holographic Red Ranger pocket-wallet... I was obsessed. So of course, the second a movie was announced, I was stoked beyond repair. Heck, I even talked my parents into ordering me the movie's making-of scrapbook from my elementary school's Scholastic Book-Club!\n\nIn honor of Saban rebooting the franchise with the upcoming big- budget, big-screen 2017 film, I decided to nostalgically revisit the original 1995 movie that the series spawned after its first few years on-air. I haven't actually watched the film start-to-finish in darned-near close to twenty years. (I drifted from the series just a few years after the movie came out.) What would happen? Would I relive my childhood thrills? Would it be a nostalgic blast from the past? Or would it falter and fail to live up to those great memories of mine growing up? Would it just feel like a cynical cash-grab?\n\nSadly, thought I know many a fan still enjoys the film, my feelings upon revisiting it do definitely fall back on the later feelings above. While it is a fairly competent aesthetic and tonal transition for the series from the small to the big-screen, the story presented feels wholly manufactured exclusively to bring in the big box-office and merchandising dollars without really pushing the series forward or even really making an effort to connect with it. (Heck, the movie isn't even feasibly canonical with the show given all the ret-cons and continuity errors!) And while it is far from a terrible film, this former Rangers fan feels sadly let-down looking back at a movie I once loved, now that I see it for what it is.\n\nThe Power Rangers Rocky DeSantos, Adam Park, Billy Cranston, Aisha Campbell, Kimberly Hart, and Tommy Oliver are in for the fight of their lives when their foes Lord Zed and Rita Repulsa unearth and resurrect an ancient and vile villain known as Ivan Ooze (Paul Freeman)- a \"morphological\" being with a wide-range of powers. When Ooze destroys the command center and gravely injures the Rangers' leader Zordon, the super-powered teens will be forced to travel to a faraway alien planet in search for a \"Great Power\" to save their master and find the inner strength to defeat this new threat!\n\nTo give the film the credit it deserves, there are some definite positives to be had. The actors portraying the Rangers all do about as well as they do on the small screen, and they're all pretty likable. Freeman makes for an entertainingly over-the-top villain with some great riffs and gags that I'm assuming were his additions. (A hilarious joke where he lists the things he missed out on before being brought back by Zed and Rita in particular is uproarious.) And the film does a nice job updating the Rangers for the big- screen. The then- cutting-edge CGI, brighter and more detailed costuming work and grander scope are definitely appreciated. This is the best the original Rangers ever looked, and everything feels a lot bigger and more bombastic thanks to the higher budget.\n\nUnfortunately, the rest of the film falls very flat in my opinion, and comes off as little more than a mindless cash-grab. The script by Arne Olsen and John Kamps hits every note that you'd expect a cynical kids movie to hit. From the addition of a never-before-seen child \"sidekick\" who needs to assist the Rangers by helping them save the day (a common trope in children's entertainment, and always an unwelcome addition), to adding in plenty of new villains and heroes and robots and costumes to drive up toy-sales, to constant eye-rolling banter and catch- phrases that stink of 40-something writers trying to emulate their teenaged children... it's all so lazy and trite. Direction courtesy Bryan Spicer is barely passable, with his structuring of scenes feeling overly suspect and standard. And the film can barely even try to hide the fact that it's an expensive, 90-minute commercial. Each and every scene shows off new products to buy, blasts new music for kids to beg their parents to buy them, shows us the shiny new versions of last years toys that parents must now re-buy... it's kinda shameful, to be blunt.\n\nI keep seeing a recurring theme in the positive reviews claiming that this is all fine because it's \"just a kids movie\"... no, sorry. We as adults need to demand more from the entertainment geared towards our children. It's completely not OK to just give them bad entertainment and justify it by saying it's \"just a kids movie.\" There are plenty of good, high-quality kids films out there. Stop enabling what is nothing more than inherent laziness on the part of filmmakers trying to make a quick buck off of children.\n\nLook, I still love my memories of the Power Rangers. And I'll never regret my time spent with the franchise. Heck, I'm probably gonna see the new movie in theaters when it comes out. But we have to admit... it's not the perfect pop-culture relic that we pretend it to be, and some facets of the series- including this film- are little more than cheap merchandising tools.\n\nI give \"Mighty Morphin Power Rangers: The Movie\" a sub-par 3 out of 10."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "cathcur",
        "review_rating": "",
        "review_title": "Not at all bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "MinTurtles1",
        "review_rating": "1",
        "review_title": "Jason",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Mr_Beale",
        "review_rating": "5",
        "review_title": "Much Worse Things Have Happened",
        "review_detailed_main": "For a die-hard kiddie movie, Power Rangers: The Movie is pretty good. It's not annoyingly pacifistic like so many other kiddie movies. The movie's respectable sfx, decent action sequences, and quips from Ivan Ooze should keep adults being forced to watch the movie in an attempt to appease their toddlers from suffering too much. They probably will enjoy some of the scenes. Unfortunately, the fact that the storyline's pretty dumb and pretty much every bit of dialogue that doesn't involve Ivan Ooze is pretty awful keeps this movie from being a good film for the entire family like \"E. T.\" or \"Homeward Bound.\" So, if your kid wants to see it, don't fret. They'll enjoy themselves, and you will survive."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Comiccritic83",
        "review_rating": "6",
        "review_title": "Enjoyable, but a letdown for fans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "FeastMode",
        "review_rating": "3",
        "review_title": "Kids like anything",
        "review_detailed_main": "This movie is laughably terrible, but I still like some of it. Major nostalgia. And these ninjas in cool suits fighting is pretty awesome. It's also hilariously bad. Nothing makes sense. The writers must have said this a lot: \"who cares, it's for kids, they won't notice.\"\n\nThe stuff on the other planet is hysterical. The whole parents plan is hysterical. But the Power Rangers are still awesome lol. And I still heart Kimberly. And Tommy is still a bad-ass... sort of. And Billy is still lame.\n\nThe CGI at the end is astonishing. I couldn't believe it. Why would you include that if that's what it looks like? Maybe they ran out of money when they were creating these images post production.\n\nThis movie should really be one star. But... Go Go Power Rangers! (about 4 viewings, 5/12/2023)"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "ScoreArtist",
        "review_rating": "8",
        "review_title": "Better than the (2017) film by far...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "capone666",
        "review_rating": "6",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "Mighty Morphin Power Rangers: The Movie\n\nWhen you manned a vehicle in the 1990s that fused together to become an enormous robot everyone just called you Voltron.\n\nLuckily, this fantasy film assuages any similarities between the super robots.\n\nWhen the witch Rita and her master Lord Zedd unearth an ancient egg, they unleash the purple despot Ivan Ooze (Paul Freeman) on Angel Grove: home of the Power Rangers (Amy Jo Johnson, Jason David Frank, David Yost)\n\nOoze promptly imprisons his evil benefactors before stripping the Power Rangers of their morphing abilities, and setting his own agenda on how to rule the Earth.\n\nNot only does this feature-length version of the popular TV show feature the original Ranger line up, but also their inept high school tormenters: Bulk and Skull. Faithful but with a cinematic edge, this adaptation provides more than adequate camp.\n\nBesides, morphing into a giant robot only looks cool when both legs show up.\n\nYellow Light\n\nvidiotreviews.blogspot.ca"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "solex10",
        "review_rating": "5",
        "review_title": "The Only Way To Enjoy This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "bradleygranz",
        "review_rating": "9",
        "review_title": "go go power rangers",
        "review_detailed_main": "L love powers rangers snice i was 6 years old power rangers the movie is a better good i love watching it power rangers forever"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "zephyrsystemsnet",
        "review_rating": "7",
        "review_title": "Sometimes, something comes along that can not be explained...",
        "review_detailed_main": "The movie was corny, stupid, and funny. But when you get down to it...there is nothing else like it.\n\nAs a movie, I would have to say that it was bad. It was simple, and had no real conflict outside of a simple good versus evil. But lets face it, it was charming to say the least.\n\nThere is no real explanation for my love for this movie, other then the fact that is was a charming and decent attempt at original children's science fiction.\n\nThe movie just had something about it that could not be explained that just appealed to me."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "mwcanadian",
        "review_rating": "3",
        "review_title": "Go Go Power Rangers...Go away that is",
        "review_detailed_main": "As a fan of the TV show Power Rangers, this was a letdown, especially at this age and at the age I realized things better. As a kid, I didn't realize the issue I know now because the action is great. The issue is the story....it's bad because this movie doesn't go with the show. It's very different, there's a pig monster that is there randomly, the command center and Zordon look (honestly) better than the show, Ivan Ooze is a lame villain and I'm also not a fan of how they get their ninja powers here. Very lame movie"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "g-dude",
        "review_rating": "",
        "review_title": "Decent special effects and a wondefully bad villain make this a better kiddee movie than Pokemon: The First Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Beta_Gallinger",
        "review_rating": "3",
        "review_title": "Good thing it was meant for kids only!",
        "review_detailed_main": "The \"Power Rangers\" franchise began in the early 1990s, with the original TV series, \"Mighty Morphin' Power Rangers\". Without a doubt, although it may have been highly criticised by those past their childhood, the show turned out to be a huge hit with kids. In addition to that, two years after the series began, young fans finally got to see the superheroes on the big screen, in 1995's \"Mighty Morphin Power Rangers: The Movie\", which didn't seem to disappoint most of those fans.\n\nThe evil and despised Ivan Ooze is finally released from captivity after six thousand years, so the Power Rangers have a new enemy! The superheroes soon find that their power is gone, and when they go to the command centre, they discover that Ivan has destroyed the place, and Zordon is dying! In order to defeat Ivan and rescue Zordon before it's too late, the Rangers must travel to a distant planet, the only place where they can retrieve their powers! Meanwhile, Ivan begins his attack on the city of Angel Grove!\n\nBeing in the right age group at the time, I remember the heyday of the original Power Rangers series very well. I was a big fan for a while, but never saw this movie. Basically out of curiosity, I finally just watched it, years after losing all interest in the entire Power Rangers franchise. Early in the film, I found that it was so bad that it was sort of funny, with its cheesy lines and action sequences, so it looked like it would be mildly enjoyable, as an unintentional comedy. Unfortunately, it doesn't stay this way for long, it soon changes, and for the rest of the movie (which is most of it), it's both cheesy AND boring, that is, for those who have left their childhood behind. The Power Rangers franchise was made strictly for kids, and this full-length feature is no exception. I might even give this movie a lower rating than 3/10 if it wasn't for the fact that I probably would have LOVED it if I saw it when it was first released, and probably even three years later!\n\nAlthough it appears they're still making new Power Rangers shows of different names, the days of the original are now long over, and those who were kids in the 1990s and were fans are now much older. Some TV shows and movies that one enjoys while in their childhood could easily still be enjoyable for them when they grow up, but clearly, \"Mighty Morphin Power Rangers: The Movie\" is not one of those. With the ridiculous name of the main villain (Ivan Ooze) and the \"ooze\" that comes out of him, as well as the childish lines (such as \"Go get 'em, booger man!\"), the poor quality characters, and so many other things (most of which you would probably find in the show as well), I'm sure it's VERY hard for an adult to take this movie seriously. So, for adults, I don't recommend \"Mighty Morphin Power Rangers: The Movie\", even if you're looking for a movie that's so bad it's unintentionally funny. However, looking at how many kids this movie has impressed, I guess it deserves SOME credit."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "byson5186",
        "review_rating": "5",
        "review_title": "Wait Till The 2017 Movie",
        "review_detailed_main": "I've only seen this movie once. It was back in 1995, in the movie theaters. Man, that was 20-years ago. I have seen a couple of scenes from the movie since then, but I haven't seen the movie the whole way through. Though, I can still remember some of it from back then. It obviously wasn't a movie I cared to see again, because often times I think of the movies you really like are movies you'd want to see again. Some kids watch the same movie everyday Interestingly, as an adult another movie I left a review on which I remember renting 2-years ago and enjoying enough to watch it 3 nights in a row after renting it and immediately bought a copy and regularly go through scenes is a movie called Junior High Spy.\n\nMighty Morphin Power Rangers is a childhood memory of mine. I went from being obsessed with Power Rangers to no longer caring about them. I stopped watching the show after the second season which was mostly when the show seemed to lose it's popularity. I mean I remember seeing so many kids dressed up in school as Power Rangers during the Halloween of 1994. But, the year after I only remember one kid dressed in a Power Rangers costume. I wasn't aware what was going on with the show during the 3rd Season. I think it's interesting how I went from being obsessed with that show to no longer really caring about them.\n\nI feel like the show went downhill during the second half of Season 2, around the time 3 rangers left. I think most of us preferred the original 3 over their replacements. I also started to realize as a kid that the show became predictable and even though Lord Zedd was supposed to be superior over Rita, more of his monsters were taken down more easily than Rita's. The show just stopped appealing to me as a kid, and I imagined coming up with my own plots.\n\nMany years later, I'd watch Zyuranger and buy the episodes on DVD. Man, I didn't know Power Rangers was from a Japanese TV show at the time. Watching Zyuranger I can't believe that I'm watching something older than the Power Rangers and what inspired it. I like a lot of you think Zyuranger is a better T.V. show and better done than Power Rangers. It wasn't common knowledge back then like it is now, that Power Rangers used it's footage from a Japanese T.V. show. Since Power Rangers was so popular back then, I wish Fox Kids would have taken time to show us more where the show came from, possibly even showing subtitled episodes of Zyuranger back then on Fox. Imagine how American kids from back then would have reacted if they could have seen episodes of Zyuranger and compare it to Power Rangers?\n\nI've mostly talked about my thoughts on the Power Rangers. But, let me explain the movie. Well, years later when I watch episodes of Mighty Morphin Power Rangers I notice how this show wasn't entirely well done or well thought out. There seem to be plot holes and continuity errors. It was a little the same with this movie. I mean I noticed as a kid how this movie drifted from the series. We have the same characters play the Mighty Morphin Power Rangers, but there are numerous things different from this movie than in the series. It doesn't feel like it's canon.\n\nThis movie also took place in Australia. I'm not sure why they had to go all the way there. Interestingly, some of the episodes that were made around the time this movie was made were also filmed in Australia.\n\nHere's what I remember about this movie. I'm sure we all remember the opening scene which was skydiving. I wonder if that was actually the actors who were skydiving, though probably not because they'd have to be like professional skydivers to skydive as well as they did in the movie. It also would have been hard to film it, as cameramen shoot from different angles? They could have had professionals skydivers, or they could have just used a green screen to make it look like the characters were skydiving.\n\nI remember enjoying this movie. If you watched Power Rangers back then, you'd probably think the movie was enjoyable. I liked Ivan Ooze as a villain. However, I also remember around the same time I saw this movie when I saw the Power Rangers on stage. That show seemed more canon to the series than this movie and was a fun experience back then. You can see it on YouTube now, and it seems like a lot of people preferred that over the movie.\n\nThey're working on a movie that is expected to come out sometime in 2017. I'm sure we've all noticed how a lot of TV shows that we remember when we were kids that even had previous movies made for them, are having new movies made based on the original versions with 21st Century action and special effects. They've done that with Transformers and they're working on a second Teenage Mutant Ninja Turtles movie when a lot of us prefer the original 1990s Teenage Mutant Ninja Turtles movie.\n\nI'm waiting for the next movie. I feel like almost any film can be good if they have the right director who can come up with an entertaining movie. I bet the next Power Rangers movie will be better, or at least make a lot more money than the previous Power Rangers movies including this one which had a theatrical release.\n\nWell, that's it and I give this movie a 5/10. It entertained me, but it could have been better."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "X_THE-MATRIX_TRINITY-LEO_1992_X",
        "review_rating": "7",
        "review_title": "HAIM SABAN BANDAI NAMCO SHUKI LEVY AVI ARAD THE POWER RANGERS _",
        "review_detailed_main": "HAIM SABAN BANDAI NAMCO SHUKI LEVY AVI ARAD THE POWER RANGERS _\n\nI BECAME A POWER RANGER WHEN I WAS 7 YEARS OLD - HOWEVER I DID NOT KNOW THAT AT THE TIME _ I FOUND OUT IN THE YEAR 2017 THAT I WAS A POWER RANGER AND THAT SURPRISED ME _ I AM CURRENTLY 35 YEARS OLD - THE YEAR IS 2024 _\n\nI WAS FIRST IN MIGHTY MORPHIN DIVISION AND WAS WHITE RANGER GOLD MODE WHICH IS A LEGENDARY POWER RANGER _\n\nI WAS THEN TRANSFERRED TO SPD SPACE PATROL DELTA DIVISION AND WAS OMEGA RANGER WHICH IS ALSO A LEGENDARY POWER RANGER _\n\nI WAS THEN TRANSFERRED TO TURBO DIVISION AND WAS THE PHANTOM RANGER WHICH IS ALSO A LEGENDARY POWER RANGER _\n\nI HEARD THAT I WAS A POWER RANGER AND WAS GOING AROUND AS THAT JUST A BIT _\n\nI BECAME LEADER OF THE POWER RANGERS AT CHRISTMAS TIME 2022 - I WAS IN LONDON ENGLAND UK AT THE TIME AND WAS STAYING AT A TRAVELODGE HOTEL FOR THE HOLIDAY SEASON _\n\nI BECAME LEADER AND JOINED LIGHT SPEED RESCUE DIVISION - I BECAME AND AM TITANIUM RANGER _\n\nUS ARMY BLACKLIGHT IS POWER RANGERS NOT BLACK HAWK DOWN MILITARY _\n\nTHREE HUNDRED THOUSAND POWER RANGERS AND THEY HAVE A SEVEN MILLION PEOPLE ARMY _\n\nSPACE SHIP ZORDS AND ULTRA ZORDS ONE PIECE AND MEGA ZORDS MULTIPLE PIECES AND ZORDS AND VEHICLES AND RANGED WEAPONRY AND MELEE WEAPONRY AND HAND TO HAND FIGHTING AND ADVANCED BATTLE ARMOR AND TELEPORTATION AND ABILITY TO BECOME GIANT _"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "prestonwardcondra",
        "review_rating": "5",
        "review_title": "Gets points for attempting to do something nice with the license but, the movie is ultimately mediocre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Spacetree",
        "review_rating": "10",
        "review_title": "Monumental!",
        "review_detailed_main": "This movie is everything you've ever wanted out of a Power Ranger movie. Everything was done so professionally: it was a movie that literally glittered like gold. Every facet from the show was here, but all of it was given a new coat of paint. The uniforms were jazzed up, the zords were upgraded, the fights were bigger, the stakes higher, the plot bigger, the villain was badder, the emotions ran higher, hell, even the command center was even improved. Everything that you loved from the show was here, and everything that you loathed was gone: it was Power Rangers the way it ways always meant to be. SPECTACULAR.\n\nWATCH IT. LOVE IT. REVEL IN THE FANSERVICE.\n\nEven if you've never watched Power Rangers, it's still a pretty good adventure flick."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Thephenom52",
        "review_rating": "7",
        "review_title": "Doesn't quite cut it for me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "TheHonestCritic",
        "review_rating": "8",
        "review_title": "This is, without a doubt, one of the cheesiest movies ever made. But, does that make it good or bad?",
        "review_detailed_main": "\"Mighty Morphin Power Rangers: The Movie\" (1995), I remember when I was a kid, I used to watch the different \"Power Rangers\" television series, created by Haim Saban and Shuki Levy. So far, there have been 20 different incarnations of \"Power Rangers\" TV shows. My top favorite ones are a tie between \"Mighty Morphin Power Rangers\" (1993-1996) and \"Power Rangers Lightspeed Rescue\" (2000). When I first heard there was a \"Mighty Morphin Power Rangers\" movie, I got excited. Now, of course I didn't see it in a theater, I was three years old at the time of it's release! I first watched it on VHS and I loved it right away. It's just as good as the original TV series, if not better in some aspects. This movie has a great story, great acting, great sets/locations, and a great soundtrack. The only real flaw in this movie is the special effects. For the most part, they are good. But, a few of them are bad and have not aged well, particularly the CGI animation for the Megazords and the robot villains. To be perfectly honest, the Megazords in the original series look more realistic, and those actually look like toys! How ironic, the toy-like Megazords and robots look more realistic than the CGI for this film. Plus, the effects for the exterior shots in outer space look a little bit cheesy. Other than those particular special effects, the rest of them are actually very well done because of the higher budget for this movie compared to the original TV show. Now, let's get into the positives for this film. The story is a lot of fun from beginning to end. It is cheesy and a bit corny at times, but then again, so are the TV shows! This film gives fans of the TV series, including me, everything that they expect to see, and then some. Also, there are several one-liners uttered throughout the movie. Usually, one-liners can make or break a movie or TV show. However, in the case of this film, they are all clever, funny and they do not slow down the plot whatsoever. Overall, the storyline is a lot of fun and if you're willing to suspend your disbelief, anyone can enjoy it. As far as the acting goes, it's fantastic from all of the actors and actresses. They fire on all cylinders. It also helps that the majority of the actors and actresses from the original show were cast in the movie. They all retain their chemistry with their respectable characters and really help bring the film to life. There are a couple of new actors introduced. The yellow and black rangers are played by different actors than the show. They do not hurt the movie in any way, and both of them play those characters flawlessly. Aside from all of the actors and actresses playing the Power Rangers, the biggest standout performance is from Paul Freeman as the main villain, Ivan Ooze. He really makes this movie! His performance is just as funny as it is sinister. That's definitely a rare combination to pull off in a villainous character. All of the sets/locations are nice, it looks like the actual TV series has been transported onto the big screen. Which really gives the film a great atmosphere! Finally, the soundtrack is excellent. Overall, this movie is a lot of fun and is definitely worth watching, especially if you're a fan of \"Power Rangers\". Even to this day, I still watch this film once in a while and enjoy it every single time. I give it 4 out of 5 stars on my personal scale, which equates to 8 out of 10 stars. If you're a fan of cheesy or corny films, then this is the movie for you! I honestly don't see anyone watching it, and not at the least bit enjoying it for what it is. Yes, it is bad, but it's so bad that it's good!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "ZegMaarJus",
        "review_rating": "7",
        "review_title": "Ivan Ooze",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "ck-27",
        "review_rating": "",
        "review_title": "Fantastic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "I_Ailurophile",
        "review_rating": "7",
        "review_title": "Silly genre fun, just as you'd expect (for better or worse)",
        "review_detailed_main": "Ah, the Power Rangers. I never followed the franchise beyond the first TV series to air in the early 90s and a title on the original GameBoy, but it was quite the phenomenon at the time and somehow continues to endure. Even at its worst (say, initial casting so On The Nose as to be racist and sexist), it was still just silly fun, and between the martial arts wackiness and monster designs, there was a fair bit to earnestly appreciate in some measure. (And I may or may not still have a bit of a crush on Amy Jo Johnson.) I've never seen the first full-length film, either, but why not?\n\nOne might reasonably say that 'Mighty Morphin Power Rangers: The movie' is nothing more than a slightly bigger version of what we got in the TV show, and that's not wrong. Yet I think that's essentially what we wanted from the film in the first place, or at least expected, so one can't get too upset. Sure enough, all the hallmarks are here of the series, except maybe with a slight upgrade owing to a bigger budget. The creature designs and effects, costume design, hair and makeup, special effects, production design, and art direction are wonderfully imaginative, and look fantastic. The proliferate stunts and action scenes are a total blast, if sometimes a tad ham-handed and distinctly kid-friendly (as is also true of the writing broadly, including humor). And bless the cast - no matter how cheesy or over the top a moment requires them to be, they embrace the tomfoolery, and do their best to play out more dramatic moments with all due sincerity. As ever, those portraying the villains (Julia Cortez as Rita Repulsa, Paul Freeman as Ivan Ooze, etc) especially lean into the bluster and are unquestionably having a great time.\n\nEverything mostly looks and sounds quite excellent, truthfully, though these are givens; one would assume no less. Meanwhile, even if one weren't familiar with the Power Rangers otherwise, this feature and the franchise at large share kinship with plenty of other contemporary fare geared toward youths, including the Teenage Mutant Ninja Turtles. This includes the writing: we may get distinct themes imparting life lessons, or kernels of sage wisdom, but more than not the details don't even matter that much. The plot follows a tried and true path of heroes and villains, overcoming adversity and pursuing conquest, triumph and defeat, and still is after all just a vehicle for the martial arts action, monsters and effects, and genre stylings. None of this is to in any way diminish the contributions of the writers - only, there's no mistaking the slant and intent. And again, it bears repeating that especially when it comes to the story being told, this 1995 movie is basically just an episode of the TV show, writ large.\n\nSure, some aspects are particularly thin; observe the attempted profundity that Dulcea imparts to the teens as their powers are stirred, and what she has to say to poor Adam. Some of the delivery, or directions seemingly imparted to actors who are in the background in a moment, inspire a skeptical raised eyebrow. While each of the Power Rangers are characterized in one way or another by different animals, these traits don't specifically come out in their fighting styles or abilities (except when the Zords are involved). Perhaps most abjectly glaring: The CGI is, in fairness, on par with mid-90s fare generally - yet less than perfectly seamless, sometimes outright cartoonish, and frankly an eyesore; one wishes the digital creations at the climax hadn't replaced the tangible models and rubber suits of the TV series. While overall this is pretty fun, the horrid computer graphics make me wonder if I'm not being far too generous in my assessment.\n\nAgain, though, this is a family-friendly sci-fi/fantasy action/adventure romp; what more do you want? When all is said and done you're either on board with what this title and its ilk represent, or you're not. I admit that nostalgia may be in play, but for my part I had a good time watching. It looks and feels just like the TV show, and more to the point, it's exactly the genre flick I anticipated and wanted to watch. Some kitsch, some tropes, some bombast; lots of great action, a terrific visual presentation, a cast completely enjoying themselves - and that's a wrap! One can probably ascertain at a mere glance if this is to their tastes or not; all I can say is that if you like the genre spaces the franchise tarries with, this will suitably scratch that itch, too. 'Mighty Morphin Power Rangers: The movie' may not be an essential must-see in any regard, but it's pleasant, duly satisfying light entertainment - and that's all it needs to be."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Angelus2",
        "review_rating": "10",
        "review_title": "Opening fight scene makes this film simply great!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "KahnuevsKrake",
        "review_rating": "7",
        "review_title": "Great movie for what it is.",
        "review_detailed_main": "I remember seeing this on the cinema when I was about 7 and loved it. I bought the DVD recently out of curiosity and was surprised I loved it still, why? This is a kids adventure film based on a TV show so it's obviously not meant to appeal to over 12's. Kid's films that are spin-offs of TV shows do have an unsurprising reputation for being absolutely rubbish with crap acting because in most cases it's true.\n\nThis film actually \"feels like a film\" rather than a few episodes of it's TV show counterpart stuck together which is most spin-off films feel like (some of them actually are).\n\nThe story is nothing special, but in some cases you need that if your head hurts from keeping up with episodes of 'Lost' for example, the acting is average at best and the dialogue is corny but there are some amusing lines (not to mention Bulk and Skull's utterly stupid but hilarious antics), the effects are what you'd expect from low-budget kids film at the time when CGI wasn't as advanced as it is today, I must give the costume designers a big hand here as they look rugged and ready for battle unlike the costumes in the TV show which are basically leotards and crash helmets with the Power Ranger motif on them.\n\nI would recommend this movie to any kid who watches Power Rangers as it is today (I watched a couple of episodes of one of their more recent incarnations the other day and after 14 years, although the characters are different and they're set in different places, it's still the same old sh*t (this whole \"Megazord\" thing has gone stale years ago and it's like the makers don't really give a damn anymore).\n\nIf any kid enjoys todays incarnation of Power Rangers, then they should see this movie and they'll be worshipping it by comparison, or if you're an adult, it's better than most spin-off kids movies out there today so there might be some pleasant surprises in store if you watch it with an open mind."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "lukem-52760",
        "review_rating": "8",
        "review_title": "A Huge Part of My Childhood!!! Big Nostalgia Love for film that's Important to me.",
        "review_detailed_main": "This super fun fantasy adventure flick brings back so many memories of a better & more innocent time, the 90's!!!\n\nThere's some things you grow up watching & loving that becomes a part of you & i grew up loving Teenage Mutant Ninja Turtles & Ghostbusters & Star Wars & Transformers & Power Rangers. These were my main franchises that i absolutely loved, of course i liked other stuff but those were my main things i was so into.\n\nI still remember when the Power Rangers action figures first came out & it even hit the news how popular they were & how quickly they sold out. I remember going to town to buy one in Woolworths (sad it's gone) & i got the Red Ranger & played with it non-stop. I liked Red Ranger best until Green Ranger/White Ranger came out. I loved the t.v show, as did everyone back then, & i used to jump around doing action pretending to be a Ranger. The Power Rangers meant so much to us kids growing up in the 90's, they were a symbol of goodness, protectors of the earth against evil & we loved them. Boys & girls all loved the Rangers & wanted to be one. As i write this I've just shockingly found out that my hero, the Green Ranger is no more!!! The great legendary actor who played Tommy Oliver is dead. Jason David Frank is no longer with us R. I. P, I'm gutted. So i felt inspired to write a review of the great underrated fantasy film that was a huge part of my childhood & who i am. The series was great but the Power Rangers movie was even better. Power Rangers the movie is also very colourful & that always attracted kids & Ivan Ooze's monster troops splat beautifully when the Rangers kick their buts lol & we get lovely purple slime splattered around. Ivan ooze is a fun & lively villain that has an ancient past & escapes from a prison egg found at a construction site. As well as the purple ooze reminding me of Ghostbusters 2 pink slime, well Ivan is an ancient Mythical ruler that reminds me a bit of Vigo the carpathian ruler from Ghostbusters 2, there's just something similar to me. Anyway Ivan is my favourite villain that our heroes have ever gone up against. Also this 1995 fun adventure has some old dated CGI effects & at it's time it looked great but now it's simply old dated computer effects but it also adds to it's pure 90's goodness.\n\nThe 1995 hit Power Rangers movie came out & gave us a fantastic fantasy adventure full of wonder & action & comedy. We got much better Ranger suits with the bigger budget & we got the best villain of the franchise with slimy ancient ruler IVAN OOZE. I loved the purple ooze of the film that is symbolic of Ivan because it always reminded me of Ghostbusters 2 (1989) with it's own pink slime, & that's my all-time favorite movie.\n\nThe threat is bigger in the movie with deadly drama with Zordon, life & death drama. The Rangers HQ is destroyed & the Rangers are sent on an important mission to save Zordon & the world. We get beautifully designed fantastical worlds with awesome Skeleton dinos & Rock monsters & Ivan's gooey henchmen & massive evil mega zords. There's plenty of action & that lovely 90's innocence that's lost today. Tommy is the best again here as he leads the Rangers towards winning at all costs. The Rangers feel like a family & that's a nice vibe that comes accross on screen. I owned this film on good old VIDEO & I'm so thankful i grew up during those much better times.\n\nIn the real world, especially now in 2022, the Rangers are a force of good that is worth revisiting from time to time to remember that the world was a better & nicer place once.\n\nAll in all Power Rangers the movie is a nice film, a film made in a better time & characters that are big pieces of our childhood & i love the film.\n\nI will always have fond memories of this movie & the Rangers....even more so in today's extremely dark times."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "jordiojoystar",
        "review_rating": "6",
        "review_title": "Amy Jo Johnson is one Hot Babe!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Quicksand",
        "review_rating": "",
        "review_title": "More Kung Fu than Kiddie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "RosanaBotafogo",
        "review_rating": "7",
        "review_title": "The little purple monsters are cute",
        "review_detailed_main": "Binging through the 3 remaining PR movies to complete the franchise (95/97/23), the special effects are just as good as the originals, which are quite adorably flawed. I love this version of the girls Yellow and Pink, and my friend's favorite, the White PR, which doesn't appear in all of them... The little purple monsters are cute, but the movie is too silly to let it play while you do some work or something else...\n\nThis time, maybe the Power Rangers have found a match for them: the most sinister monster in the galaxy - Ivan Ooze. Attacking the good citizens of Angel Grove after six thousand years of confinement, Ivan Ooze takes away the powers of the Power Rangers and their leader, Zordon. Now, the Power Rangers must travel to a distant planet to learn the secrets of the ancient Ninjetti. Only then will they be able to harness the power to restore their shapeshifting abilities and defeat the evil Ivan Ooze."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "the_headless_cross",
        "review_rating": "10",
        "review_title": "Without a doubt, a fun trip down memory lane.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Styles_Clash",
        "review_rating": "7",
        "review_title": "Fun to look back at my youth",
        "review_detailed_main": "In a movie/TV forum on a message board someone brought up the old Power Rangers TV show. I'm 17 now, and when the show first came on I was 7 years old. After reading through the thread I wanted to go back and watch some of the episodes for old times sake. So I went to a video store and found the movie for really cheap on DVD and I bought it. And you know what? I loved it. I felt like a little kid again watching it. It brought me back to a simpler time and it was fun to go back and watch.\n\nIf you're an adult who was too old to watch the show when it was on of course you're gonna hate this movie. The acting is horrible and the special effects just reek. The one thing about it I'd say everyone could like is the Ivan Ooze character. He's pretty cool. But if you're like me and you lived this stuff when you were little you should be able to go back and watch this and just have fun. You don't care about the horrible CGI, you don't care about the bad acting, none of that matters.\n\nI really find it funny how some people here talk about this movie like it was made to be anything else than a movie for kids. Damn, lighten up people. This wasn't made to make you think or tug at the heart strings. It was made for kids."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "stephenchase-63504",
        "review_rating": "10",
        "review_title": "Two versions: English and Japanese!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "zurnderrick",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": "Talk about a movie that has absolutely nothing to do with the TV show it's based off of. It's delivers a whole new story, new characters we know nothing about, and new Power Rangers suits that make them look like pepped up NASCAR drivers. But, I will be quite honest. I love this movie! It is one of the best movies from my childhood.\n\nEven though the film delivers a lot of clichéd jokes and gags that will put everyone in the audience to sleep, it is still entertaining to see the Power Rangers kick ass. It is also interesting to see CGI animated zords for the first time, though I think the Ninja Megazord on the show looked better in my opinion.\n\nIf you have time to kill, watch this movie. It's fun, entertaining, and will interest you. Surely it's not as good as other films like Star Wars, but is still a good film. I don't who these pinheads are who are putting it down."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "abelgezahegn",
        "review_rating": "10",
        "review_title": "One of the Best Childhood Movies Ever... Should of got a higher rating (7.8/8.0)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "kallam-reid",
        "review_rating": "10",
        "review_title": "90's filled drunk pleasure",
        "review_detailed_main": "How is this absolute cliché 90's movie rated so low clearly anyone who loved the original series should re-watch this movie. sure its cheesy and predictable but its a bloody kids movie of course it is when you grow up. the weird thing is when i re-watched this, when i was 20 years old just to see if as a kid i had good taste and to relive what i loved as a kid and it me least 10 beers of courage to watch it.\n\nbut after that i watch it and was really cut up about how low this was rated.the sight of seeing that this is rated so low made me write this. sure it fills every 90's cliché in the book but that's what it is. this is the 90's movie, when i become a father that i will tell my kids to watch. i was a fantastic movie for any 90's kid that was a fan of the TV show. when you grow up a little you see the smaller things you respect the villains and remember how they use to haunt you. great movie for what they had to work with and a movie you respect with age if you were born in the 90's."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "other_guy16",
        "review_rating": "10",
        "review_title": "Underrated: an excellent film a la Superman The Movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "ANTC0SM0",
        "review_rating": "10",
        "review_title": "my childhood.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Writer_Commentary",
        "review_rating": "8",
        "review_title": "Pretty good film",
        "review_detailed_main": "So this film isn't well received on this site. I don't know why and I don't care. I just know that this movie is a pretty good film for every Power Rangers fan. I don't know why non ranger fans would watch this in the first place, but one actually could. I don't know if this is in the same universe as the show or not and I really don't think that matters to enjoy this film. While most TV shows want to turn into movies, they have the problem of just making a movie into a very long episode. This is not the case (although some might argue with me). This is a very unique film. There may be a least one obvious plot hole but it isn't big enough to not be important and prevent you from liking the movie. I find this to be very enjoyable and hope that everyone who liked the series to watch and own this film."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Joek00l7",
        "review_rating": "10",
        "review_title": "Changed my Life",
        "review_detailed_main": "OMG this movie was amazing. After seeing this movie i was inspired to get a job and have a family. I now fight puppets for a living in miniature city sets. Power rangers, if it wasn't for you I would still be on the streets eating rats and drinking out of a sewage pipe. I love power rangers. The way the black one kicks those bad guys butts was truly cinematic gold. The use of sparks instead of blood reaches out of the screen and knocks you in the face. Every battle leaves you awestruck and wanting more. Oh just talking about it makes me want to pop some over-sized man in a squid suit from space right into a mini building that immediately explodes into a burning fury of sparks and paper mache. Who i am 30 years old and can barley get out of bed every morning but somehow this movie rejuvenates me. My excitement before seeing it helps me overcome my lose of breath and my constant chest pains. Bravo MMPR, Bravo. My hat goes off to you for such a glorious display of action and mayhem. My mother saw this movie when she was dieing of cancer and it gave her the strength to go out side and douse herself in gasoline and light up a cigarette. I know it will change your life as much as it has changed mine."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Cinematic_Suite",
        "review_rating": "10",
        "review_title": "HD Zane 4K messed it up.",
        "review_detailed_main": "It was the best movie when it was in the movie theaters and when it first came out on VHS but these days you got HD and 4K messing up the good movies like this one. Shouldn't even touched it with the 4K and HD but other than that every time I watch it then it brings back the memories!! Love it."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Gaasu",
        "review_rating": "10",
        "review_title": "MMPR : The Movie",
        "review_detailed_main": "I can remember back to when I was a child and was absolutely obsessed with Power Rangers. Then, I watched this movie. I was amazed. I was in awe. And to be honest, I'm still surprised that I'm enjoying this movie at the age of 14! He he.... But, anyway, this movie is fantastic. I would suggest it to anyone who is a fan of Power Rangers, young and old. As I watch Power Rangers: Space Patrol Delta, I'm almost depressed. I think back to the original actors: Amy Jo Johnson as Kimberly, Johnny Young Bosch as Adam, and who could forget Jason David Frank?! So I try to go back to watch this movie as much as possible (it's THAT good) just so I can reach back into my childhood. :D"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "maple-3",
        "review_rating": "10",
        "review_title": "Friends",
        "review_detailed_main": "The movie was very good, it was about friends helping one another out by keeping a job factory from being shut down. They also helped their mentor Zordon. I have seen this movie 10 times. The only thing that I did not like was the foul language, that was used."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Maza16123",
        "review_rating": "10",
        "review_title": "Successful Entertainment",
        "review_detailed_main": "Although the plot of the movie had severe clashes with the original plot and settings of the show, I believe that a successful and effective product was spawned. Bizarre twists were added into the movie such as the skydiving sequence, the introduction of the ninja zords, Ivan Ooze, and not to mention a scantily clad warrioress for extra eye candy. Even if these elements had nothing to do with the original show, they did raise the appeal of the movie to the general public. Excellent special effects and an absolutely fantastic soundtrack made this movie quite enjoyable to a long term fan such as myself. Even with a dislike towards Power Rangers, one is able to sit down and enjoy this movie."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "rsboyce",
        "review_rating": "10",
        "review_title": "Wow",
        "review_detailed_main": "GREATEST Movie Ever!!!!! CHANGED MY LIFE!!!! UNBELIEVABLE!!! When I was 29 years old, this film was released in my native language (German). The quality of acting was exquisite and the vision of the production crew was phenomenal. After this 140 minute masterpiece. I began my quest to become a Power Ranger. I quit my job and began training myself in all forms of martial arts for over 13 hours EACH day. I constructed my own zord out of macaroni, whicker, and vinyl siding. It was AMAZING! With it, I was able to find girls that would go out with me. NO ONE can escape the lure of MEGAZORD! I was also able to paint the entire uniform on my body and defeat the giant rats through a series of roundhouse kicks. So in short, the movie was spectacular, Sherman is NOT good looking and Knibb High Football rules!!!!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "joshuadrake-39480",
        "review_rating": "8",
        "review_title": "A really cool Power Rangers movie!",
        "review_detailed_main": "Mighty Morphin Power Rangers: The Movie is one of my 25 year-old sister's movies that she used to watch, so I thought I would review it.\n\nBefore the film was released, there was a television series, followed by another series of TV shows after this film and in 1995, Saban Entertainment and Twentieth Century Fox decided to team up and bring us the first POWER RANGERS movie, MIGHTY MORPHIN POWER RANGERS: THE MOVIE, an Americanized motion picture based on the Sental series.\n\nWhile many says this film is a bomb, I think some people has also enjoyed this film and accepted it for what it is. I have heard that there is a reboot being made and released by Lionsgate for a 2016 release and I really want to see how it's going to do.\n\nThe six main actors playing our Power Rangers may not be great, but they could have been a heck of a lot worse, because they're playing heroes with superpowers, what is not to like about this film? The suits for the Power Rangers are made out of armor and I hope they are like that for the reboot of the film series.\n\nI love the plot of the movie, too, and for them to go against Ivan Ooze was really cool and the ending climax of this movie was just fantastic and I watch the new POWER RANGERS show that is being shown on Nickelodeon and the new show is very amazing and fantastic.\n\nThe music and visuals are really great for a movie like this, as well as they were in 1995 and the production design was really amazing in this film.\n\nOverall, I love MIGHTY MORPHIN POWER RANGERS: THE MOVIE and it is just simply a classic film. 8.9/10."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "nightdai",
        "review_rating": "9",
        "review_title": "Oh come on!",
        "review_detailed_main": "I've been sorely disappointed to see this in the top 100 worst films of all time. Having watched this when Power Rangers was at its highest in the UK, and having been of the right age to have interest, I absolutely loved this! I remember watching it plenty of times, and all my friends at the time shared the same opinion that this film completely ruled! Getting to see all the notable and very memorable characters was great. Sorry to sound over-reminiscent but having Lord-Z and Reta working side-by-side was awesome! The scenes are corny and childish, the plot is simple, the characters are drones, the humour is pathetic and the graphics are bland. BUT THEY AREN'T IMPORTANT TO THE TARGET AUDIENCE. This film was breathtaking at the time me and my friends saw it, and it will forever be one of those films that I can remember having a great time watching. I urge people not to down-vote this because it doesn't tickle their mature tastes, and leave it to it's target audience, that unfortunately probably know nothing about how to vote on this website :) But to those who watched it at a young age (like myself), let's not say this film wasn't worth watching at least half a dozen times!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "civilsweetie",
        "review_rating": "10",
        "review_title": "A good movie, for its time.",
        "review_detailed_main": "I didn't think this was a bad movie. For its time it was pretty good. And they fit the storyline in with the series too!!! Which some films even short films don't do. I lacked in some parts but is a great movie. Sure the graphix are a little cheesy but the story of the movie is great. A great rise in the power rangers series!! One of their highest points. Great movie! I would say the worst of the movie is when they did get their new \"powers\" and their outfits didn't change. But the Zords are cool. And it looks better and IS better then the next movie in the series. 'Turbo A Power Rangers Movie'. Now that was a laugh. But this is a great movie. Recommend for anyone well who has or has seen the Mighty Morphin Power Rangers series. Zeo, Turbo, Space, Lost galaxy, Lightspeed, Timetravlin one, and Wild one, and Dino Thunder not required to see! ;)"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "nitas_guardian",
        "review_rating": "",
        "review_title": "I disagree Raven",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "king_tom_505",
        "review_rating": "10",
        "review_title": "WORTH WATCHING!!!!!!",
        "review_detailed_main": "Excellent, so worth watching if your a real Power Ranger Fan,I know I certainly am!!! Enjoy it as I did and you will have no problems with the film!! It is the best Power Rangers film in the world!! It sums up all together how good the Power Rangers actually are!! The film includes great graphics and is full of but kicking action, that I'm sure you will enjoy it if you like the Mighty Morphin Power Rangers. What more can i say, the film is just brilliant as the Power Rangers are. I think it was a great idea putting the Mighty Morphin Power Rangers and a film together!!! Well i hope you really enjoy the film! HAPPY WATCHING!!!!!!!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "balthier1983",
        "review_rating": "",
        "review_title": "a failed attempt",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "sweet_eve",
        "review_rating": "10",
        "review_title": "It depends on you.",
        "review_detailed_main": "I have heard plenty against this movie. Many of the points cited by those who decry this film are valid. Yes, it has martial arts action. Yes, the dialogue can be cheesy. Yes, it can be considered violent. What is not pointed out is this: what you get out of it depends on you. The characters are the main force of this film, showing teamwork, loyalty, courage, discipline, a true love, a sense of duty, a sense of humor, and respect. It can be used to encourage values, to teach when to fight, standing up for what is right, doing good, and love without sex. I'm not saying this film is appropriate for unsupervised small children. What I'm saying is the PG is more than just a rating; the parental guidance is needed. With the help of mature perspective, this movie can be a powerful teaching tool."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "tom_bombadillo-1",
        "review_rating": "10",
        "review_title": "Aged, But Still Enjoyed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "aaaa",
        "review_rating": "",
        "review_title": "Better than the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "erminahotmail",
        "review_rating": "10",
        "review_title": "the best story about Power Rangers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "fjustice",
        "review_rating": "",
        "review_title": "I really enjoyed this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Pilsung89",
        "review_rating": "10",
        "review_title": "classic 90's cheesy nostalgia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "Remember the Show? Well Guess What? THIS IS EVEN WORSE!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "MrWonderful",
        "review_rating": "10",
        "review_title": "For Fan's Only",
        "review_detailed_main": "I'm not sure why, but I've always liked this show. Cheesy humor and all.\n\nThe only part I didn't like was Rocky. He should've never joined the original cast. Rocky got better in Zeo, when he dropped back, becoming the Blue Ranger. Of course, now it didn't matter, since Jason was back. As the rumor mill told, Austin St. John wanted too much money, as he was still the leader, not taking back seat to 'Tommy.' Though when having some time to think about it (or as some would say, too long without a job), he came back as the Gold Ranger (though another group says he knew he'd now be in the spotlight, so that's why he returned).\n\nJohnny Yong Bosch & Amy Jo Johnson are the only one to have much success outside the series. Johnson with Felicity and \"Susie Q\" (and probably another movie or two) and Bosch is the voice of Vash The Stampede in \"Trigun\" and also had a few voices in Cardcaptor Sakura, Witch Hunter Robin, and a few other series. Also, Tommy's not been lost as he returns as the Black Ranger and new mentor for Power Ranger Dino Thunder. Of course, 'Rocky' and 'Aisha' went nowhere, because they suck and David Yost was the hardest to work with, as it's been reported, plus he thought every time the show got a new fan, he should get a raise."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "leezachary-19503",
        "review_rating": "9",
        "review_title": "Great Movie of My Favorite Child Hood",
        "review_detailed_main": "This is a Great Power Rangers Movie I thought Ivan Ozz is a Great Villain In My Opinion Got Great Action Fight Scenes As Well"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "veryold",
        "review_rating": "10",
        "review_title": "Better than most think",
        "review_detailed_main": "This is a great movie to watch with you child between 5 and 9. Power Rangers was big in it's time. It was fairly well made if lacking a story line."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "KalKenobi83",
        "review_rating": "8",
        "review_title": "Go Go Power Rangers",
        "review_detailed_main": "Throwback Review:Watched Mighty Morphin Power Rangers Movies starring Jason David Frank(Mighty Morphin Power Rangers) as Tommy Oliver,White Ranger ,Amy Jo Johnson(The Eddie Files) as Kimberly Hart,The Pink Ranger, David Yost(Lady Killer) as Billy Cranston, The Blue Ranger. Karan Ashley(Hangin With Mr Cooper) as Aisha Campbell,The Yellow Ranger, Johnny Young Bosch(Akira) as Adam Park, The Black Ranger ,Steve Cardenas(Power Rangers Zeo ) as Rocky DeSantos,The Red Ranger, Paul Schrier(Eagle Riders) as Bulk , Jason Narvy(Masked Rider) as Skull .Also Starring Gabrielle Fitzpatrick(Fire) as Dulcea , Nicolas Bell(Skytrackers) as Zordon, Peta-Maree Rixon(Ni Hong) as Alpha 5 , Mark Ginther(Babylon 5) as Zedd, Juilia Cortez(The Adventures Of Priscilla, Queen Of The Desert) as Rita Repulsa and Paul Freeman(Indiana Jones And The Raiders Of The Lost Ark) as Ivan Ooze. This was my first my introduction to The Power Rangers also really enjoyed the Story also great character in everyone also really enjoyed great villain in Ivan Ooze I can't still after several years I enjoyed it release I can't fault all though I would've like to seen there dinozords prior Ivans Take Over of Zordon. amazing costume design from Joseph A.Porro(Stargate) Score By Graeme Revell(The Crow), and Cinematography By Paul Murphy (Dallas Murphy) ,Amazing Direction from Bryan Spicer(SeaQuest 2032)Go Go Power Rangers 8 /10"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "invisihand",
        "review_rating": "10",
        "review_title": "To all the idiots that gave this movie the low rating it has today...",
        "review_detailed_main": "I wish i could give you a hard slap in the face. this was our childhoods. this was out life. this was us. power rangers, and especially these six were some of the most influential people in my life. yeah that sounds silly now. but we were 5 YEARS OLD or so. every damn critique on IMDb is coming from people who said they loved it, but now that they watched it as adults, saw how corny and childish it was. NO FUÇKING SHI\u0086. I honestly can't believe the stupidity from some people. its meant for kids. and this was glorious. everything about this movie and the other originals deserve so much more regard. it saddens me that this movie is tarnished for such a bad rating. i just watched it again and it filled me up with so many good memories i can't even explain it. stupid people."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "erichedlund1",
        "review_rating": "8",
        "review_title": "its not that bad",
        "review_detailed_main": "I admit as a 14 year old and watching it its pretty good. Critics don't really understand that power rangers is a kids show and making a movie out of it is just making a kids movie. Its underrated for what people give it. I like it because of the strong action although it was only occasional because it didn't want a lot of violence. The action was good and the story was well paced. The soundtrack score is phenomenal and the acting was good. I understand why people wouldn't like it. For starters is the overall budget. The costumes for the villains looked stupid and the CGI zord fight was unconvincing. The slapstick was ridiculous along with the jokes. I don't really like the suits with its armor because it looked silly. They could've done better but it could've been worse"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Salvager10",
        "review_rating": "10",
        "review_title": "A Classic From My Childhood",
        "review_detailed_main": "This movie was one of my favorite movies when I was a kid. I was a huge Power Rangers fan back when I was a kid. I would watch every time I got home from school and on Saturday mornings. When I first heard that there was going to be a Power Rangers movie, I was so happy. When I first saw it, I fell in love it. It didn't disappoint one bit. I thought it had some of the best fights and best zords in the Power Rangers series. I would watch this over and over Years later, I still watch whenever it is on. So nostalgic and fun to watch. I just look back at it realize things I never realized. Like how The Red Hot Chili Peppers and Van Halen were part of the soundtrack, and how far we have gotten in computer graphics technology. I still find it a fun movie, but for a slightly different reason in some areas. This movie has a place in my childhood, so thats why I could never hate or dislike it. One thing still makes me wonder. What ever happened to my copy of it on VHS?"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "moviemattb",
        "review_rating": "8",
        "review_title": "Its no masterpiece, but its a good one",
        "review_detailed_main": "You all know how much I love the show, but now here is what I thought of this movie. \"Mighty Morphin Power Rangers: The Movie\" is very much non-canon to the show because of the suits, Zordon's look, Angel Grove being shot in Australia, etc. Heck, \"Turbo: A Power Rangers Movie\" is like the only one that is canon because it serves as a bridge between \"Power Rangers Zeo\" and \"Power Rangers Turbo.\" Also, the production quality in both films are different. Lastly, there was an episode of \"Mighty Morphin Power Rangers\" where the Power Rangers get new Zords and becoming Ninja Rangers, and the name of the episode was called \"Ninja Quest\" as it was a retelling on what the movie did. With that said, the premise of the movie is the Rangers are participating a Charity Drive for the Angel Grove Observatory as they receive a call from Zordon, and warns them that Earth is in danger and that Ivan Ooze is about to return after being buried in an egg chamber 6,000 years ago. Unfortunately, Lord Zedd and Rita Repulsa had already freed him and commanded him to destroy Zordon. The Rangers arrive too late as Ooze leaves them to fight his Oozelings, and entering the Command Center by destroying it as well as Zordon with him being outside of his time warp. The Rangers began to loose their power as Zordon is about to die soon, and Alpha sends them to a planet where they can get new powers. Ooze turns against Rita and Zedd and takes charge over the situation of the Rangers as he plans to brainwash the parents of Angel Grove as they dig up his Ecto-Morphicons to destroy not only Angel Grove, but taking over Earth. So its up to the Rangers to get new powers to save not only Zordon, but to save Angel Grove and Earth. I do remember watching this movie growing up as a kid, when it was on an old VHS copy that it really had \"Mighty Morphin\" on it as on later DVDs took it out. I hope this gets a Blu-Ray release for better picture (no DNR) and sound as well as a great amount of special features. Also, put \"Mighty Morphin\" back in. If I did a documentary for this movie, I would go into much detail about how the behind the scenes went as well as the issues. If Shout Factory did this besides me doing it, then it is all in good hands. Anyway, I thought this was a fun movie to watch. I do appreciate that the filmmakers were trying to make a high quality version of the show from being cheap, but now it looks dated which I will get to that in a second. I thought the cast did alright with their acting abilities, which I know everyone wants to poke fun of their acting. I know I can find some bad acting, but mostly I rather find is some good acting. So all in all, they did what they had to do. Paul Freeman who you may know him as Belloq from \"Raiders of the Lost Ark\" plays Ivan Ooze in the movie, and I thought he was good in it for being both evil and over the top at the same time. The makeup of him looks really good as well as the suits that the Rangers wore in the movie. The story itself was told fine, and I can tell that tone of the movie is trying too hard to be a dark movie but I give them credit for trying. Hopefully, the reboot can do something better with that as well as making it fun. I also do like Graeme Revell's score for making it suspenseful and exciting. I do enjoy the updated version of the \"Power Rangers\" theme song with \"Dreams\" by Van Halen and other songs that I enjoy. Bryan Spicer did a fine job directing the movie, but nothing more I can say about. I will say that the action in the movie is really darn good. Any flaws? Yes. I thought the movie has some good practical effects, but the CGI effects are downright terrible; they were probably good at the time, but now they don't anymore. I also would have love to see the original Red, Black, and Yellow Rangers in the movie if they had stay on the show instead of being replace. Also, I don't mind the movie being shot in Australia but could they get at least get the vehicles from America instead of fooling us with some Australia cars as if the wheels are on the left but not the right. There are some other flaws that I can point out, but that is all I got say. Nevertheless, the movie is both good and bad at the same time because all it is that it just wants to be a fun movie, and it really did; its no masterpiece but its a good one. I give \"Mighty Morphin Power Rangers: The Movie\" an 8 out of 10."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "shauncatania",
        "review_rating": "8",
        "review_title": "Go Go Power Rangers",
        "review_detailed_main": "It's corny, its stupid, the acting is terrible and ITS GREAT. When I was a kid this was an awesome movie. I couldn't wait to see it and I wasn't disappointed.\n\nBased on the original (and best) Power Rangers and at the peak of there fame it couldn't have been better timed. This is a kids movie back when the special effects looked exactly like the toys that you and all your friends had.\n\nAfter watching this movie I came home like a kid who had way too much sugar, jumping around pretending to be a power ranger.\n\nGo Go PowerRangers"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "em_1986",
        "review_rating": "10",
        "review_title": "wicked....",
        "review_detailed_main": "I cant believe that this film got such bad reviews....admittedly, i may had only been 8 when this movie was released, and i am biased because i was a massive fan of the power rangers ( i still speak of the original serises very fondly...even now) but it was a brill movie.\n\nCompared to some of the trash that is being released now, i dont see how it could have recieved dismal reviews...\n\nThe plot may not have been great and the acting left much to be desired, but so many young people thought it was fab (me included...). to me it was the Thunderbirds of the 1990's.\n\nPersonally, i think that they should revive the old serises, the ones before all the new stuff came in.....i know i would be watching it...."
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "zurnd",
        "review_rating": "8",
        "review_title": "Cult Classics: Mighty Morphin Power Rangers: The Movie",
        "review_detailed_main": "Mighty Morphin Power Rangers was one of my favorite shows growing up. I mean, come on, it's a bunch of teenagers in spandex beating the crap out of giant rubber monsters. It's the ultimate cheese fest from the 90s and was at one point one of the most watched kids shows in history. What many people don't know about MMPR and the quadrillion seasons that would follow is that they used stock footage from a Japanese TV series called Super Sentai (in the case of MMPR, Kyoryu Sentai Zyuranger). The only thing the Americans added was the cutscenes with the American actors as well as Zordon and Alpha 5. By Season 2, they created Lord Zedd and while stock footage was used from subsequent Sentai series, they still stuck with the Zyuranger costumes for the Rangers. Then in 1995, Saban Entertainment and Twentieth Century Fox teamed up to bring us Mighty Morphin Power Rangers: The Movie, a completely Americanized motion picture based upon the Sentai series. While many consider this film a dud, many have come to admire this film for the cornball that it is and the film has since become a cult following. What are my thoughts on the movie. I love it, I love it, I love it!\n\nI know the film stands apart from the TV show's continuity and that the CGI effects aren't that great by today's standards, but there's just something about this movie that screams childhood. 18 years after the film's release, I still have the VHS tape in my possession and once in a while, I pop it in and I'm instantly taken back to the mid 90s. My cousins and I obsessed over this movie and I got jealous of my one cousin because he had the Ninja Megazord toy and I didn't. Still, I'll never forget the first time I saw this picture and watching it to this day, I can honestly say that it's a pretty decent flick, a campy cluster of cottage cheese from the convoluted 90s (let that alliteration sink in for a moment). The actors who play the six main Power Rangers are not the greatest of actors by any means, but they're portraying teenagers with superpowers, what do you expect? The Ranger suits are more of an armor instead of the spandex like on the show and if they one day decide to reboot MMPR like they did with Transformers and Star Trek, I hope they use suits like the ones in this movie. In fact, why didn't they just use these suits for the metallic armor on the TV show instead of those crappy glitter suits? I'm sure they were available in Saban's inventory, why not just use them? Oh well.\n\nThe actor who steals the show is Paul Freeman as the main villain Ivan Ooze. Revived after six thousand years of rotting in a giant pink egg, Ivan Ooze is a mix between Jack Nicholson's Joker and Freddy Krueger. Also, I think his character design is brilliant. He's got this slick, slimy purple look to him. He is made of slime after all! It's hard to believe that this is the same guy who played Belloq in Raiders of the Lost Arks. Who knew Freeman was such a hilarious guy! Anyway, Ivan Ooze is so powerful that he ransacks the Command Center with his magical flute and temporarily defeats Zordon. As the Rangers set out to find the Great Power which will save Zordon and give them back their ranger abilities, Ivan Ooze imprisons Lord Zedd and Rita Repulsa in a tiny snow globe and enslaves the parents of Angel Grove with his canisters of purple gunk. What an elaborate plan for a goofball of an adversary. I'd like to see this guy go up against Hades from Disney's Hercules.\n\nOn the planet Phaedos, the Rangers embark on a dangerous quest to get the Great Power. After a sorceress named Dulcea (who looks like one of Jabba the Hutt's slave girls) gives them the powers of a ninja, the rangers travel to the monolith which holds the power. Along the way, they encounter the deranged skeleton of a dinosaur as well as a couple of stone monsters. After defeating them and getting the Great Power, they return to Earth and for some reason, they decide to take out Ivan Ooze and his giant robots before going to the Command Center to revive Zordon. Why would they do that? It's one of the film's most noticeable plot holes, but it doesn't take away from the good goofiness of the movie. The climax in which the Rangers take on Ivan Ooze in their new Megazord is not the greatest of climaxes, but it's a neat final battle to tie up loose ends. It's also one of the few times an enemy is defeated by being knocked in the crotch and sent into an incoming comet. It's a decent conclusion to a decent movie that will intrigue Power Rangers fans for many years to come.\n\nHappy 20th anniversary MMPR!"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "shinodahahn_vic",
        "review_rating": "10",
        "review_title": "Those were the good old days...",
        "review_detailed_main": "I can't believe I'm making comment about this movie after 10 yrs it has been released. Gosh. Power Rangers were one of my favorite TV show when i was a kid. I remembered I was like rushing home after school just to catch this show. And gosh, Tommy is my all time favorite (although I don't deny Jason is cool too ;)) It's so weird that how the memories strike back yesterday. Of course it's 2005 now and there's so many cool super heroes movie. But I think for us kids last time, Power Rangers nailed it. Kids who were born-ed in the 80's or 90's, almost every of them knows and loves the 6 super heroes of Angel Groove. I didn't watch this movie in the cinema, I remembered how I used to collect all their tapes. Now i'm regret of throwing them away. Of course the new power rangers are like improved with new technologies. For me, tale as old as times. I love the original MMPR rather than the new ones we have. I might be 20 yrs old this year. But honestly,those good old days really makes me smile again. Knowing that Tommy aka Jason David Frank is one of the real good martial arts constructor, I'm proud to have him as my first \"kiddie prince charming\" when I was a kid. JDF rocks! ;)"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "zordmaker",
        "review_rating": "10",
        "review_title": "You're watching so much more than just a movie here!",
        "review_detailed_main": "The original Power Rangers Movie.. what can I say? If it's illegal for someone who worked on the film to review it then I guess this review is a bad one, but to everyone else I'll give a different view, especially now that I have kids of my own who just watched it and loved it.\n\nTo start with. One thing makes this film bearable to watch again and again. Paul Freeman as Ivan Ooze. A great baddie really makes a superhero film and Freeman is up there with the best of them in MMPR:TM. But to move beyond the critique of stories, actors and effects we need to consider this film for the landmark it is. It's in the same box as things like \"Tron\" (1982). Sort of \"How dare they\" and \"what were they on\" and even \"how much money can you throw at something to make it work\"? MMPR:TM is a visual feast. The locations are fantastic and the designs truly unique. It represents the first time anyone, anywhere had attempted to make a film this way. Most of all it stands as a cornerstone in the side of the Australian film industry which created it.\n\nBefore MMPR:TM, this barnyard rabble was a disjointed collection of individuals living off crumbs and making films about things nobody really wanted to know about. After MMPR:TM things were very different in Sydney - and this collection of film makers and crew who had \"passed through hell together\" went on to forge it's own stamp on the international film screen.\n\nMMPR:TM was a pivotal cog in the \"golden age of Sydney film making\" spanning a period of about 10 years from 1992(beginning with the very successful \"Babe\") to 2002 (basically finishing up with \"Superman returns\".) In between, it bought forth things like the successful Wachowski \"Matrix\" films, the somewhat forgetful but pretty Babe sequel, Alex Proyas' ingenious \"Dark City\", the indulgent \"Mission Impossible 2\", the Oscar winning \"Moulin Rouge\" and of course the final two \"Star Wars\" prequels. All these films bow down to MMPR:TM for without the Power Rangers, none of this would have happened.\n\nEven the Sydney Olympics opening and closing ceremonies (long recognised as the \"best ever\") in 2000 have much to thank this same creative team of individuals for. People who met for the first time at the Sydney Showgrounds in 1994 working on some crazy film about coloured superheroes.\n\nSo as you watch the Power Rangers Movie - remember that you're not just watching some old kids' film. You're watching the birth of greatness. The lighting of a bright torch \"down under\" that would live to burn on for many years before being extinguished by the troubled winds of financial disaster which now has the Aussie $1 riding at US$1.07, instead of the very respectable $0.64 average it enjoyed during those \"Golden Years\" of Sydney film making.\n\nAnd remember to watch carefully and see if you can see who'se holding up the \"Celebration Tonight\" sign at the very end, won't you :-) Zordmaker"
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "AndrewHatch",
        "review_rating": "",
        "review_title": "out of place",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Stone Rules",
        "review_rating": "",
        "review_title": "Awesome!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "red_thunder",
        "review_rating": "",
        "review_title": "Where has all the power gone?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "pirateruth",
        "review_rating": "",
        "review_title": "Relax, it's just a PHASE.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "matthewsgirl-85",
        "review_rating": "",
        "review_title": "Cool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "joseayarza",
        "review_rating": "",
        "review_title": "If you're a fan of the TV show, this one is for you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "sngbrd39",
        "review_rating": "",
        "review_title": "No, no, make it stop!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "star_dust_blue",
        "review_rating": "",
        "review_title": "great classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "rjc2_ph",
        "review_rating": "",
        "review_title": "loved it and it is still fun to see",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "chadd firchau",
        "review_rating": "",
        "review_title": "teenage morphin power rangers.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "newage91",
        "review_rating": "",
        "review_title": "The script of this movie is, like, IMPLANTED in my brain!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "TheOutcast05",
        "review_rating": "",
        "review_title": "Could have been SO MUCH BETTER!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "bmyatt_uk",
        "review_rating": "",
        "review_title": "ah, sweet nostalgic bliss... (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "stevenfallonnyc",
        "review_rating": "",
        "review_title": "It was a fun movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "SeanSmith",
        "review_rating": "",
        "review_title": "IT'S MORPHIN' TIME!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "halfway_crook",
        "review_rating": "",
        "review_title": "Entertaining At Least",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "gaiafaye",
        "review_rating": "",
        "review_title": "Not horrible, but not good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Roland-charleer",
        "review_rating": "",
        "review_title": "power rangers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "theluckofthefryish",
        "review_rating": "",
        "review_title": "Echoing what others have said before me...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "Keyser Soze-12",
        "review_rating": "",
        "review_title": "Ah, ah, HA HA HA HA HA HA HA HA!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0113820",
        "movie_name": "Mighty Morphin Power Rangers",
        "movie_rating": "5.3",
        "review_username": "suivezlachat",
        "review_rating": "",
        "review_title": "It's good for what it tries to be",
        "review_detailed_main": ""
    }
]