[
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "MovieAddict2016",
        "review_rating": "2",
        "review_title": "Completely terrible. I feel sorry for Leslie Nielsen.",
        "review_detailed_main": "Watching this on television the other day, I instantly felt great remorse for star Leslie Nielsen. After the success of the \"Naked Gun\" series, he has been restricted to a career of playing the same character over...and over...and over....\n\nThis time, he is US Marshall \"Dick\" Dix (the first of many human anatomy puns/so-called \"jokes\"). I wonder how long it took them to come up with that one in the writing room.\n\n\"How about Agent Butt K. Isser?\" \"How about Agent T. Itz?\" \"No, wait guys! I've got it! Dick Dix! Haha we're comedic geniuses!\" The budget is very obviously on the low end. Special effects are terrible. The film tries to lampoon the space travel segments of Kubrick's \"2001\" and fails miserably. Nielsen sucks food through a straw and can't manage to get it up the straw the whole way. Hahaha I chuckled all night thinking of that one! Or how about the woman in the back of the space shuttle who has huge breasts and manages to accidentally shed out of her clothes, which float around and slap Nielsen in the face? No, it couldn't have been the ugly fat woman whose clothes magically disappear...it's the busty blonde...I love Hollywood."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "TheOtherFool",
        "review_rating": "2",
        "review_title": "Things are just getting worse and worse...",
        "review_detailed_main": "I'm curious: doesn't Leslie Nielsen (once a decent actor) read the scripts of the movies he's playing in anymore? It seems that nowadays all the writers or director of a movie need to do is tell Nielsen: Hey we're gonna make fun of some other movies, interested? And Nielsen would just sit there like, 'yeah'!\n\nInstead of what the title would assume, 2001's main victim isn't A Space Odyssey but the more recent Men In Black. But, having said that, I cannot think of one decent joke relating to that movie. Nor can I tell here what the story is all about... it's got something to do with the president being swapped with a clone, or not, or whatever.\n\nBy lack of anything good to offer director Goldstein just throws some lusty women into it, but perhaps it says all that no well-known woman apparently would like to take up the job, so we have to do with an unknown French woman and an unknown German one...\n\nIn fact, I don't know of any reason why I should recommend this movie. Some lame jokes are just about OK, but nothing more than a 2/10 if you'd ask me."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Sandcooler",
        "review_rating": "2",
        "review_title": "There are no heroes",
        "review_detailed_main": "This is like finding out that 6th grader who's always jumping over stuff with his mountainbike is lactose intolerant. Leslie Nielsen plays a guy called Dick Dix in this movie, and guess what, that's one of the better jokes. It's absolutely painful to see Leslie Nielsen in this movie, desperately looking for one bit of material that he could make work. The script centers mostly around slapstick that doesn't go over at all, but sometimes it takes a break from that and goes for some terrible political satire. This is a movie that gets a Clinton impersonator, and focuses on how he plays the saxophone. That's hard-hitting satire right there. Remember how Clinton always played the saxophone? I do, kinda. Later Nielsen narrates about a woman's finesse while she's beating everyone up. Comedy. Pavarotti also threatens to castrate a guy, the pope swears, the three tenors sing \"In The Navy\", did Germans write this or something? The type of comedy isn't even consistent, one time it's the aforementioned slapstick, then it's \"satire\", then suddenly the writers remembered they didn't have any in-jokes yet. So they put in like ten in a row. This thing sucks like you wouldn't believe."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Unassuming Local Guy",
        "review_rating": "",
        "review_title": "Why? Oh, why??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Krog__",
        "review_rating": "1",
        "review_title": "Whatever Happened To Leslie Nielson?",
        "review_detailed_main": "Oh, how the mighty have fallen. Leslie, Leslie, Leslie, what happened to the days when you asked us to stop calling you Shirley? To the days when you and that Priscilla whatever-her-last-name-is were laughing while walking out of a movie theater playing, \"Platoon\"? To the days when--\n\nI guess you get the idea. It's not that Leslie Nielson doesn't have the acting ability; it's that the movie is probably the stupidest and worst comedy to come along in my lifetime. It broke dead even with Mystic River in the laughs department: none (unless you count after the movie, in which case Mystic River is way ahead. Academy Awards, ha!). I kept waiting for something funny to happen and the movie to suddenly go good, for everyone to pop out and go, \"Hey! It was all just a joke! We only wanted you to think that the movie sucked because then the rest of the movie is great!\"\n\nDidn't happen. Avoid at all costs. I mean, I LOVE Leslie Nielson and it still sucked. Oh, well; at least he's not doing porn."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "RobMS88",
        "review_rating": "1",
        "review_title": "The World Got Worse When This Was Made!",
        "review_detailed_main": "I have just had the displeasure of viewing what can only be described as an abysmal shambles.\n\nThe film starts of as bad as it finishers, with you being drip fed drivel from beginning to end.\n\nIt is so bad, it causes friendships to be cut and relationships to end. It ruins the careers of those in it and the lives of those that have seen it. It should have this warning on the box.\n\nI paid £3 for the film, and it was £3 over priced. You should be paid to watch it, not the other way around.\n\nThe $45,000,000 budget would be better used in cash to wipe my rear end.\n\nThe only reason you would want to buy this is to get the few seconds of pleasure that come from knowing you have taken a copy of the shelves to pop in the bin.\n\nDVD players should be encoded to prevent poor films such as this to even reach display monitors.\n\nIf you have considered buying this feature, you should be ashamed and embarrassed of yourself for getting that far.\n\nI drank heavy for 3 days after seeing this film just to try and block the mental images and thoughts of every cast member making a fool out of me and them.\n\nI would like to make an official apology to my friends and family for letting you down and making you watch such garbage.\n\nAvoid like the plague."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "3",
        "review_title": "Glad to know that I just didn't understand the film",
        "review_detailed_main": "I kinda watched this film in a bad mood hoping for a good laugh, Leslie Neilson always makes me laugh. Especially parody movies, since I wasn't into 2001: A Space Odessey, I thought that this was a fun looking movie that would make fun of that film. Well, it turned into something pretty bad, I really couldn't find myself laughing at any of the situations, which is sad, because I find the stupidest situations very funny and I am easily amused. But I was curious if maybe it was my bad mood that killed the comedy for me, but I looked on IMDb before watching it again and it's not just me apparently.\n\nWell, a some what take off of the Naked Gun series, only in outer space situations, Leslie is now Dick Dix, a clumsy detective that is sent to a planet called Vegan where he learns that President Clinton has been kidnapped and cloned and that the clone is on Earth with bad intentions for the world. Or as it seems, Dick actually plants the clone by accident and well... it just wasn't funny.\n\nThe jokes tried too hard and the story was just weak, it could have been something special, but unfortunately they took too much advantage of the Naked Gun series, which was pretty sad. I know Leslie can do much better and he has, so I forgive him. For those users who are looking for a recommendation here, I'm not going to give you one because like I said, I thought it was just me that didn't like the film, but I think the rating is enough warning in itself.\n\n3/10"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "The irony in the word \"travesty\" is correct...",
        "review_detailed_main": "Now I do like spoof movies, when they are funny and done right. There are some funny spoofs around, Young Frankenstein, High Anxiety and Loaded Weapon 1 for example, but the spoof genre has also had some excrement such as Disaster Movie and Epic Movie. 2001: A Space Travesty is not as bad as any of the worst of Friedberg and Seltzer. However, that is not saying much, 2001:A Space Travesty is still a terrible movie, being contrived, embarrassing and unfunny and it makes you think what possessed Leslie Nielson to take on this project.\n\nAs I said in the review title, the irony in the word \"travesty\" is correct. To be honest, while hardly clever or original the title is the best asset of this movie, as well as the end credits which was the only time in the entire movie when I cracked a smile, you know immediately there is something wrong when that is the case. The production values are cheap, with the costumes more reminiscent of fancy dress, shoddy camera work, dismal special effects and wobbly sets. The soundtrack is poorly thought out, In the Navy by The Three Tenors especially felt as though it was shoe horned in.\n\nThe story is predictable and almost a non-event, the pace didn't draw me in in any way and the direction was decidedly patchy. Also the characters are little more than stereotypes and caricatures and really bad ones at that with names that felt like poor Carry On lampoons. The acting is terrible, yes including from the talented Leslie Nielson. Nielson shows he can be funny as with Naked Gun and Airplane, which are comedy classics in my opinion, but he overacts and mugs shamelessly here which saddened me hugely. Everyone else either overplay, are bland or seem to be playing themselves. Worse is the humour, the film just isn't funny and is filled with the crude and vulgar kind of humour that doesn't come close to the inspired zaniness of the best of the spoof genre. The homages and references to sci-fis such as 2001:A Space Odyssey(one of my favourite films) are obvious and poorly thought out and the script is abysmal and didn't make me laugh one time.\n\nIn conclusion, not the worst of the genre but a mess all the same. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "storytym",
        "review_rating": "1",
        "review_title": "Atrocious and sad, but certainly not funny",
        "review_detailed_main": "Ewww! I saw this on a plane and was thunderstruck over how awful it was. The writing was virtually joke-free, and the direction incompetent. Even the sight gags--which are the easiest part of comedy to pull off, were lame and uninspired. Leslie Nielsen has really embarrassed himself here. In his successful Zucker Brothers spoofs, he's a master at playing ridiculous scenes completely straight, and thereby making the funny stuff work. Here he acts desperate. He mugs just to inject some life into the dreariness of it all, and, as other reviewers have mentioned, embarrasses himself mightily. If you want to see him in a movie devoid of intentional laughs, check out the original POSEIDON ADVENTURE. At least that flick has some inadvertent giggles."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "basketcasecat",
        "review_rating": "1",
        "review_title": "it's not bad - it's worse than bad",
        "review_detailed_main": "i guess i have seen this movie. i've watched the first 15 minutes of it several times, and once i even watched the first 20 minutes. why do i keep trying? because i really like Leslie Nielsen. why don't i watch the whole thing? because it's awful. no, it's worse than awful. it's pathetic, and it's embarrassing. the jokes are not funny, not even when they are off-color. (\"stifficus\" for a constellation? come on, come on.) do i somehow think it's going to be better the next time i watch? i must think so, because i keep trying. and i suppose one of these days i will try again. it's very sad to see a long-time favorite star descend to such depths. i felt the same way with \"the world's greatest lover\" with gene wilder. well, i guess it's back to \"naked gun\" and \"dracula - dead and loving it.\""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "fdpugh",
        "review_rating": "1",
        "review_title": "A tired retread of an aging role",
        "review_detailed_main": "I quite honestly could not watch much of this movie. I did have it playing all the way to the credits, just to be fair however.\n\nWhat completely turned me off of it was that the type of humor that was so well crafted into airplane and the first two naked gun movies has unfortunately been made so blatantly vulgar by whoever directed this film that it is not funny. You could watch the same scene in Mr. Neilson's earlier films 3 and 4 times and find a new joke every time.\n\nThis waste of celluloid wants to be risqué, but is not willing to deal with adult humor at an honest level. This 'suggestive' humor is not all that funny since the whole point of a dirty joke is to be dirty. The rest of the humor is not complex enough to warrent more than five minutes of attention.\n\nOn the positive side- production value is adequate. The film does not appear to be a bargain budget piece that one would see as a Sci-Fi channel original's series.\n\nBottom line:\n\nUnless you have an unnatural obsession for Leslie Neilson films- skip this one."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Petey-10",
        "review_rating": "8",
        "review_title": "Leslie Nielsen in outer space",
        "review_detailed_main": "Marshal \"Dick\" Dix is a master of getting himself in awkward situations.He is told that the President of the United States of America, Bill Clinton, has been cloned.He is then sent to moon base called Vegan to safe the situation.He is helped by the attractive Cassandra Menage.2001: A Space Travesty (2000) is directed by Allan A. Goldstein.The film parodies 2001: A Space Odyssey, Star Wars and so on.Leslie Nielsen is very funny as Dix.Ophélie Winter is fantastic as Menage.Peter Egan is very good as Dr. Griffin Pratt.Damian Mason does terrific job as Clinton.Ezio Greggio is great as Capt. Valentino DiPasquale.Michel Perron gives a great portrayal of Luciano Pavarotti.Same thing with Teresa Barnwell as Hillary Clinton.Recently we lost this great comedian, Leslie Nielsen.He could make any film slightly bit better.Without him this would be a much worse film.Many people call this a total turkey, but I'm not one of those people.It made me laugh a few times watching Leslie causing a riot in outer space and on Earth.The terrorist hostage situation in the beginning reminds a bit of The Naked Gun.And it's quite hilarious when he makes a mess at the villain's office, destroying his Vegan model and spreads paint all over the place.The Three Tenors at the end were hilarious.Leslie Nielsen, I raise my hat to thee."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "apfraats",
        "review_rating": "7",
        "review_title": "Come on, this wasn't meant to be serious, so don't take it like that...",
        "review_detailed_main": "Lot's of negative reports on this one. But let's face it, it wasn't meant to be a serious movie at all. First take you're daily dose of Prozac twice, otherwise y'll may get depressed, thinking this one should be taken seriously. After that, have a bottle of some strong booze in front of you and look at this one. I liked it, not because it was a good comedy or something, but I respected how someone is capable of making a movie like this. You'll have to see this movie as a game. Use you're remote over and over again, zoom in, play some parts frame by frame and try to recover all jokes (or 'jokes', come on..), idiotic things, and stupidity in this one. I bet that those who have the most negative criticism on this one , haven't noticed for 50% how many and silly stupid jokes are made in it. OK, it's hilarious, but it should be. I enjoyed watching it and even watched it twice, noticing new 'jokes'and 'stupidity' the second time. I'm sure if I see it again I will still notice new 'jokes' e.d. For that reason alone I liked watching this movie. So I'm not complaining that this one is no comedy, it's an interactive game using you're remote and try to find all 'jokes' and other stuff. There many more than one might expect. It's a parody, not a real comedy. If you keep that in mind, it's well worth watching. And remember: Try to find them all........\n\n7 out of 10"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "wetterbericht",
        "review_rating": "1",
        "review_title": "What the hell leads someone to do something like that?",
        "review_detailed_main": "Having watched this cheesy piece of pure nonsense made me want to comment on it: The best way to enjoy this movie is to remove your brain. If you don't do so, you'll either wish you'd have done it before or switch the film off after 15 minutes. The best one can expect from this movie are old, washed-out puns from the \"Naked Gun\" - everything else is just plain silly humour, tasteless \"fart-jokes\" and cheap boob-thrills. I wonder what makes any director or actor want to take part in something like this - what is the target-group for this kind of cinema? The homages to any science-fiction movie are so subtle, that no one would mention them or they are so embarrassing stupid, that you wouldn't mention them without being ashamed of remembering: Sad, sad 87 minutes for every Leslie Nielsen enthusiast. If I could, I would rate this movie with 0 stars, but unfortunately - as I found out - I have to give it at least one."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "muximas",
        "review_rating": "",
        "review_title": "Absolutely brilliant...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "EdYerkeRobins",
        "review_rating": "1",
        "review_title": "A \"Travesty\" Indeed!",
        "review_detailed_main": "Oh how the almost mighty have fallen. Leslie Nielsen may not be regarded as a comedic genius by anyone's standards, but he has made some stupid, but enjoyable films in his career. In contrast, his latest, \"2001: A Space Travesty\", is just stupid, a very poor rehash of Leslie Nielsen's \"Naked Gun\" series and character with dated attempts of humor that just aren't funny.\n\nLeslie Nielsen is Richard Dick Dix, a total rip-off of his Lt. Frank Drebin, his most well-known role from \"Police Squad!\" and the \"Naked Gun\" series. As his name and the film's R rating already tell, instead of going for light-hearted stupid slapstick comedy a la most of Nielsen's other films, \"2001: AST\" attempts light-hearted stupid sexual comedy. This in itself wouldn't be a bad thing if it didn't fail so miserably at it. There is a ton of crude toilet and sexual humor, and none of it is funny to anyone over the age of 10 (and the majority of it wouldn't be funny to anyone under that age either). Nielsen's trademark straight delivery of absurd lines and situations is still present, but the material isn't by any means even remotely funny so it doesn't work.\n\nA good portion of the material is not only unfunny, but dated as well. A Bill Clinton impersonator playing the President is OK considering production of the film began in 2000 and probably before the new election, but scenes near the end featuring \"celebrities\" include impersonations of the Three Tenors, Madonna, Prince, and Hulk Hogan. This dated nature can also apply to the jokes; in reality they are no different than those in \"Naked Gun\", except that the last film in that series was made almost ten years ago, and sex-based humor has moved on, which would explain why it's just not funny. Director Allan Goldstein and writer Alan Shearman have no expertise in comedy to notice or help matters much. Shearman in particular hasn't written a comedy since 1990, which further explains the dated feel of the film.\n\nPerhaps if this film had been released 10-15 years ago it would be funny. I would still be a child who would appreciate the attempts at toilet humor, and lewd sexual comedy was still on this level. The dated \"celebrity\" in-jokes may have even made sense. Even then, however, this film would still be known as the worst \"Naked Gun\" film. Released today, my ideas of comedy have matured much past this simple childish toilet humor, the dated jokes make no sense, and it's just terrible, by far one of the worst films I have ever seen."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "canucktunes",
        "review_rating": "1",
        "review_title": "Very disappointed!",
        "review_detailed_main": "As a Zucker Adams Zucker fan I would say this is the worst film Leslie has appeared in. It isn't funny, at all. The pacing of the film tries to compensate for its non existent humor. Avoid this unredeemable film."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "ridgyolive",
        "review_rating": "1",
        "review_title": "This Movie Is A Space Travesty",
        "review_detailed_main": "I just wanted to make that joke because this movie is painfully awful."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Bearlicker",
        "review_rating": "1",
        "review_title": "Truly appalling.",
        "review_detailed_main": "What were they thinking. This is the most unfunny comedy film I've ever seen. What it tries to pass off as comedy is sexist and childish. It's almost as if they lifted a script from the 1970s."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Bo-27",
        "review_rating": "1",
        "review_title": "What where they thinking or Hollywood garbage at it's worst!",
        "review_detailed_main": "It was a slow day, with rain stopping the play at the US Open. As a result I managed to watch the entire movie. And it can be summed up as: unfunny trash, garbage and total waste of time! Throughout the entire movie I was thinking how could the actors be part of it and not realize how utterly bad this was? Not one joke was funny. And I do not mean \"laughing out loud\" funny. Not even \"a chuckle\" funny. If children indulged in that sort of spectacle, maybe one could forgive them. But watching adults, hopefully conscious adults, in this trash defies all explanations. I don't care how much they were paid. Showing the the world that you can lower your standards to this, just to be paid, is demeaning. This movie is a proof that mind altering drug use is rampant in Hollywood, as I can't imagine anybody with clear mind reading the script and thinking that this is a movie they wish to make and have their names associated with."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "joeholland",
        "review_rating": "1",
        "review_title": "god awful crap",
        "review_detailed_main": "Attempted viewing this on comedy central, gave it a try for 65 minutes and could not finish watching this crap. This movie would have not been funny in 1925 with old tired jokes and one liners. Poke yourself in the eye with a blunt stick and go to the hospital, you will get more enjoyment of that."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Enak",
        "review_rating": "1",
        "review_title": "A Space Tragedy",
        "review_detailed_main": "A yet another Leslie Nielsen movie. I've always enjoyed his movies since they had an ability to make one laugh... hard. But, lately something has started to go wrong. His last movies were not funny at all. It may be because of Nielsen's age or because of directors presumption that having Leslie in his movie will guarantee a success. Although he tries to make the movie work it fails completely. Moments where you will catch yourself smiling (not laughing) can be counted with one hand and the whole plot fails in the middle of the movie where it is being turned into a boring and long theater scene. The whole idea about having Nielsen play a Magoo like character has failed miserably because it's not funny anymore - this time dear old Leslie doesn't have to play, he simply is old!\n\nAlso the FX in this movie don't seem to work well. Although you might think they don't have to for a comedy. But in the case of this movie it's different. The authors tried to use CG but 90% of the time it simply looks fake and stupid, not funny.\n\nSo, for me the movie is a complete failure. They would have done better hiring some good script writers instead of trying to use the same old tricks with the same OLD guy."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "REDdog-1",
        "review_rating": "10",
        "review_title": "O.K.",
        "review_detailed_main": "I love Leslie Neilsen, but the fact is he hasn't been in a good movie since Dracula: Dead and Loving it. Wrongfully Accused had some moments, but Mr. Magoo and Safety Patrol were absolutely unwatchable. This isn't as bad as those movies. You could watch this movie at least and even laugh once in awhile. I will admit the three tenors singing In the Navy at the end was a funny bit, but you have to be under ten to really enjoy this movie. 5/10"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "ab-2",
        "review_rating": "6",
        "review_title": "A somewhat decent naked gun like movie",
        "review_detailed_main": "Movies like the Naked Gun and Airplane are classic comedies. This movie while DEFINITLY not up there it at least was somewhat decent. A lot of the humor is actually quite funny I thought but then there are many stupid I just didn't laugh at. Depending on your type of humor will most likely depend on much you enjoy the movie. Unless you are a die-hard Leslie Nielsen fan, I would definitly say you won't enjoy the movie totally.\n\n6/10"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Bigs_nl",
        "review_rating": "2",
        "review_title": "He's done better",
        "review_detailed_main": "I'm quite a fan of Mr. Nielsen. The 'Naked Gun' series are of course never-dying classics, 'Spy Hard' was hilarious and the more recent 'Wrongfully Accused' was a worthy addition to this great line of films. But now there's 'A Space Travesty', which was a great dissapointment starting from the first minute. Most of the jokes are just getting old and the film lacks a decent storyline. If it hadn't cost me money to rent it, I probably wouldn't have even finished it. I'm very sorry, but if this is the best our gray genius (yes, he really IS a genius :) ) can come up with nowadays then I'm afraid his days will be over very soon."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "apailate",
        "review_rating": "",
        "review_title": "Only funny to Aliens!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Tedious and unfunny.",
        "review_detailed_main": "Leslie Nielsen got a new lease on his long career with the \"Airplane\" movies...which led to \"Police Squad\" and the \"Police Squad\" movies. All of these had a few things in common...excellent writing as well as the Abrams/Zucker alliance. In other words, Nielsen alone was NOT the reason these projects were so funny. This is sadly apparent in a string of films he made with hack writers/directors...resulting in crap films like \"Repossessed\", \"Scary Movie IV\" and this one, \"2001: A Space Travesty\". Watch it if you'd like....but don't expect it to be funny nor worth your time. And remember...it's not just my opinion...the film is #73 on IMDB's infamous Bottom 100 list!\n\nSo why didn't I enjoy this film? Well, to put it bluntly, the film was cheap and unfunny. Many of the special effects and costumes were dreadfully bad...especially at the beginning with the \"2001\" intro parody. Additionally, too often the movie went for cheap childish laughs instead of clever ones...relying too often on things such as farts, rip-away dresses and crude character names (such as Dick Dix and Miss Menage). By comparison, Mel Brooks' worst films seem like works of genius by comparison. Overall, a tedious and mostly unfunny film seemingly written by untalented chimps....very untalented ones."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "grahamsj3",
        "review_rating": "1",
        "review_title": "Very disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Beta_Gallinger",
        "review_rating": "4",
        "review_title": "An unfortunate display of bad comedy writing",
        "review_detailed_main": "This is another spoof movie starring Leslie Nielsen, and I first heard of it a while ago, and knew it was obviously a sci-fi spoof. The title is derived from Stanley Kubrick's groundbreaking 1968 film, \"2001: A Space Odyssey\", though this film is certainly not entirely a parody of that one. I've seen that particular Kubrick movie several times, but was not as impressed with it during my last viewing, in January 2008. Still, the title of this 2000 comedy, \"2001: A Space Travesty\", was what brought it to my attention, since I obviously know where this title came from. I could see that this was not one of Nielsen's popular spoofs, but after a while, and only about 24 hours after first watching \"Airplane!\", an earlier parody film with Nielsen (and a MUCH better one) this week, I watched this despised sci-fi comedy. While I didn't find it to be QUITE as bad as many others have (maybe most other people who have seen in at some point in the past decade think it's worse than I do), I still thought it was a lousy attempt at comedy, so I can't defend it.\n\nMarshall \"Dick\" Dix is a clumsy detective who is informed that the President of the United States (a nameless character, but obviously based on Bill Clinton) is being held captive on a moon base called Vegan and has been replaced by a clone! The detective is sent out of Earth's atmosphere to this moon base, on a mission to rescue the real president and find out who's responsible for the crime. He is accompanied on this mission by an officer named Cassandra Menage. Together, the two of them make it to Vegan, where they see that there are many beings around, both human and alien. Dix and Menage begin their inspection, which will obviously not be helped by Dix's clumsiness. After defeating the evil Dr. Griffin Pratt and his hoodlums in a fight, thanks largely to Menage's martial arts skills, the two inspectors escape from the moon and take the president with them. Back on Earth, Dix puts who he thinks is the real president back in the White House, but it turns out he has just replaced the real president with the clone! Even though the detective has messed up, it's still up to him to save his home planet, so the mission which started with a trip to the moon now continues on Earth!\n\n\"2001: A Space Odyssey\" is obviously too slow paced for some viewers, and it did seem too slow to me the last time I watched it, but with only one viewing of \"2001: A Space TRAVESTY\", it seemed to me that it had the opposite problem, it was too fast! The direction seems so rushed and unfocused, and so does Leslie Nielsen's narration. Unfortunately, the problems certainly don't end here. The movie is full of very juvenile and unfunny humour, and since it's a comedy, that's its main problem. This already shows during the opening sequence and is featured in many other scenes, including the penis jokes about the main protagonist's name, Dix trying to use a spaceship toilet on the way to the moon just as the artificial gravity is turned off, a human on the moon coming out of the bathroom covered in alien waste, condoms which are found later in the film, etc. There are so many gags here which obviously took no comedic talent whatsoever to come up with! Not only does the toilet humour fail, so does the slapstick, with such occurrences as Dix accidentally making a huge mess during his inspection on Vegan. The gags generally seem like they were just thrown in with very little or no thought put into them. In addition to that, the film also seemed too noisy to me.\n\nUnfortunately, with all this movie's flaws, it's most certainly a misfire. Leslie Nielsen's character here is like Lieutenant Frank Drebin, his character in the \"Naked Gun\" series (they're both clumsy detectives), but if you're a fan of any or all of those movies, that certainly doesn't mean you're guaranteed to like this later spoof. I remember one time when I was in high school, a student was banned from my school bus route after playing with a dildo during the ride home and giving the bus driver attitude when he told him to get off the bus. \"2001: A Space Travesty\" seems like it was written by hyperactive high school students like that guy! I'll admit, I did smile at times while watching this film, but this was VERY rare, and I never actually laughed. Not only did it not make me laugh, I may have had a slight headache while watching it, which the film didn't help. Yes, my rating for this sci-fi spoof is 4/10, which is higher than what seems to be the most popular rating for it, but I still don't like it. I even feel like 4/10 just might be too generous, and know that many people would believe that saying this rating is too generous is an understatement! If you've never watched this unpopular 2000 comedy, I strongly suggest you don't, whether you like Nielsen's comedy roles in general or not."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "mysteriesfan",
        "review_rating": "1",
        "review_title": "Some slick packaging around an uninspired, embarrassing mess",
        "review_detailed_main": "I found this movie in a bin of bargain-basement, second-hand videos. I seem to have a weakness for \"spoofs.\" I liked the first Naked Gun (even though the cop sidekicks were better cast on TV's Police Squad), and rode out the two disappointing sequels. I tried but never got into the Airplane movies. I stuck with the increasingly thin, sophomoric Austin Powers films. I made it through Loaded Weapon, Scream, three Scary Movies, Not Another Teen Movie, and a series of Leslie Nielsen clunkers so lame that I did not think it could sink any lower - Repossessed; Dracula: Dead and Loving It; Spy Hard; Wrongfully Accused; and Mr. Magoo (by then, all a well-known film critic who had once praised Nielsen's comic talents had to say about him was that he was the \"bozo du jour\"). But Spy Hard is a masterpiece compared to \"Travesty.\"\n\n\"Travesty\" has enough budget and production values to not quite give away by its looks alone how bad a film it really is. The name of Nielsen's character -- Dick Dix -- is catchy (certainly better than Spy Hard's weak \"Dick Steele, Agent WD-40\"). Early on, there are a couple of laugh-out-loud moments: Dix being snapped back and forth from front to back of a space shuttle by the suspenders of his pants snagged on a seat, sending him flying head-first into a levitating anvil; and Dix crushed on top of someone and undergoing various contortions during a gravity-defying drop in a high-speed space elevator.\n\nBut the movie is a thin, slow-paced, forced, brain-dead mess. It does not even get Dix into space until it runs through an infantile \"history of the universe\" sequence (featuring the constellation \"stifficus\" and takeoffs on a \"white dwarf,\" a \"moon,\" and \"aliens\" (shots of Michael Jackson and Dennis Rodman)) and scenes that play like rejects from a bad Naked Gun movie. Dix is a \"Marshal\" with the \"International Security Force\" (whatever that is). His car radio is conveniently tuned to the local police frequency, and he butts in on a hostage situation at a fast-food joint. He goes from there to more unfunny, chaotic scenes at the \"bull pen\" of his D.C.-area headquarters.\n\nYou expect things to pick up when Dix is sent to a moonbase for humans and aliens to investigate a report that an evil doctor there is cloning and replacing world leaders. But almost immediately, it becomes clear that the film has nothing interesting to do in space. It sags and drags.\n\nThis is partly because of a cut-rate, no-name supporting cast which has zero rapport with Nielsen. The worst are a laid-back, jive-talking black dude and a hammy, low-rent, Italian-version Inspector Clouseau, neither of whom manage a single funny or even understandable line or action in the entire movie; and two unremarkable novice actresses who go through the motions with little or no apparent acting skill or characters to play (reviews that slobber over them need to get a life -- or take a look at any random actress starring in any major movie).\n\nIt is also because of crude, childish, labored, unfocused, rip-off gags that smother anything remotely funny. For example, Dix chases around after and makes a disgusting mess of the doctor's toupee; Dix tracks ink all over the white carpet and destroys an office; Dix gets hands and feet stuck on a door bearing a note written in glue; and so on. A disco scene is another loud, chaotic waste of time.\n\nThe movie even ruins the elevator scene by having Dix and the woman remain entangled long after the doors open, with him standing up and holding her upside down, facing him, so that she has to peer through his legs and he gets a \"fart\" in the face. The movie also sinks to this kind of \"comedy\" in the space shuttle bathroom; in sloppy mispronunciations by a French security guard (\"backstage p*ss\"; \"no one will get p*ssed\"; to musician, \"you can blow your instrument with confidence knowing I will be here holding the f*rt\"); and in the simple-minded gimmick, after the end credits roll, of disembodied sound effects with captions. None of this has anything to do with satire about space movies or anything else. It is cheap, junk \"humor.\"\n\nBy the time Dix returns to Earth, the film has become unwatchable. What feels like the movie's last half, or more, slogs through desperate, disorganized, clumsy, endlessly drawn-out scenes at a Paris opera house, before a \"world leaders' conference.\" Dix and his cohorts (wearing stupid, unfunny \"disguises\") and the villains take forever to reach and then fight in the control room for the stage, trying to keep their version of the U.S. President in place.\n\nAlong the way are senseless, tasteless jokes (Pavarotti's condoms?!?); quick cuts to bad impersonations of dignitaries or pop stars in the audience (the Pope is the worst); lame, obvious humor about the Clintons (he acts like a good-ol'-boy boor and she rolls her eyes); and frantic, loud, boring antics backstage and on stage. Cutaways to the increasingly embarrassing supporting cast and material, which by now have the movie in near-total meltdown, ruin an already forced bid for laughs with the \"Three Tenors\" singing \"In the Navy.\" The movie limps to an end with a strained, tacked-on scene at a restaurant where one of the young women, who the movie never bothers to develop as a love interest, dines with Dix, who for no reason makes a mess.\n\nMindless, goofy, silly movies can be fun. But calling something a \"parody,\" \"satire,\" or \"spoof\" hardly makes it an automatic laugh riot. And any feeble effort that comes along is not worth recommending with the lazy, sloppy excuse \"come on, this is supposed to be bad.\" It is no fun to watch a stand-up comedian die on stage, much less to watch it for 100 minutes. This pretty much sums up how it feels to watch \"Travesty.\""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "adam-1009",
        "review_rating": "1",
        "review_title": "please god, take away my sight!!!!!!!!!",
        "review_detailed_main": "I've seen the \"Mystery Science Theater 3000\" movies but even the worst science fiction crappy movies from 60's they made fun of weren't as bad as this one!!\n\nfrom the start I wasn't expecting much, even thought they've had Leslie Nielsen, but with each minute I was more and more depressed, bored and ashamed to waste my life with this kind of bull**it\n\nI'm not a impulsive man, but all the authors of \"2001: A Space Travesty\" should be taken to the prison for what they have done - for the first time in my life I wished god would take away my sight so I didn't have to watch the movie until the end!!!!!!!!"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Whitefield",
        "review_rating": "1",
        "review_title": "Oh my God!",
        "review_detailed_main": "This is possibly the very worst movie I have ever seen, and I've seen some baddies. I should ask Blockbuster for my money back; I'm sure they'll understand.\n\nI won't go into detail about why this movie is so bad--the other reviewers have done that. The only good thing I can think to say is the title is completely accurate. This is a travesty in every sense of the word.\n\nWhy Leslie Neilsen agreed to do this schlock is beyond me. I dearly hope he's not becoming senile... Do NOT rent this under any circumstances--well, unless you're really into pain."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "JoeytheBrit",
        "review_rating": "3",
        "review_title": "Star Drek",
        "review_detailed_main": "Oh dear. Poor old Leslie Neilsen must be the only movie star who feels like the rest of us: every day he has to get up for work and do the same thing over and over and over again...\n\nThis so-called comedy is in the style of Neilsen's Naked Gun flicks, but the humour on display here is far removed from the inspired zaniness of that series of films. Neilsen's OK - he can do this kind of thing with his eyes shut, I imagine - but everything else about this film is bad. The female lead in this just about passes muster, but she only weighs about two stone, and the bad guy used to be Richard Briers' suave neighbour in Ever Decreasing Circles back in the 80s, so its just about impossible to see him as a real baddie.\n\nThe film itself doesn't really have much to do with 2001 - in fact it looks more like a take on the Men in Black flicks, although films of every genre are referenced throughout. It does get marginally better in the last 20 minutes when the three tenors give a spirited rendition of Village People's In the Navy, but by then only the strongest-willed of viewers will still be around.\n\nBottom line: Everyone involved in this should hang their heads in shame..."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "kooz_jr",
        "review_rating": "10",
        "review_title": "A Classic",
        "review_detailed_main": "The critics hated it. But it's a keeper for me.\n\nAn intellectual comedy it is not. Some parts are a little stupid, but if you enjoy some mindless Leslie Nielsen humor, this is worth a look."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "ZhuLien",
        "review_rating": "6",
        "review_title": "very funny and totally underrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Vassago",
        "review_rating": "1",
        "review_title": "\"How funny!\", I thought this morning. But I wasn't thinking of this movie.",
        "review_detailed_main": "\"Hey, it's 2001... let's make a comedy with this date in title!\" thought the makers of \"Space Travesty\". \"Let's make it a comedy, too, and let's have Leslie Nielsen in it. Plot? What plot?!? We'll throw in some jokes and glue them together with scenes showing Leslie Nielsen making faces!\"... and so they did. Oh dear. You know this movie is awful already before seeing it - and that's because its trailer does not contain a single funny scene. As you probably know, movies of this sort put all their good jokes in their trailers (vide: Mel Brooks's Dracula). The trailer for this one has nothing funny in it, and that is not because the makers kept the good jokes for the movie itself but because they don't even have one funny gag to show - the whole \"film\" consists of some jokes older than the Pacific, plenty of awful \"sex 'n' barf\" kind of \"humor\", and a lot of dreadful, unimaginative, uninspired, boring, inane and inept attempts at a parody (\"SAL! oh, that's Italian, and there's that music from GODFATHER playing, oh how funny!\"). I don't blame Leslie Nielsen for this dreck - the writer and director (or, I should say, the \"writer\" and the \"director\") are to blame for it - but it's sad to think that he hasn't appeared in a movie worth watching since \"The Naked Gun 2 1/2\"..."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "",
        "review_title": "Under-rated but underwhelming Nielsen spoof",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "KubrickCRM114",
        "review_rating": "1",
        "review_title": "This is disgraceful",
        "review_detailed_main": "This is the biggest pile of crap I have ever seen. It wasn't funny AT ALL! Not one of the stupid, over-used pop-culture references was even remotely humorous in any way. The one good thing that can come from my seeing this piece of s*** is I can be sure I destroy every copy I come into contact with."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "TerryMcC",
        "review_rating": "1",
        "review_title": "Travesty is right!",
        "review_detailed_main": "Can you give a film a negative vote here? If so and all you could give were a -10 I would still complain and want a -11.\n\nThese hype farces are at best a hit or miss affair. This one for me was a big miss.\n\nThe idea with these things is that if you don't like the joke you are seeing wait two minutes and five more will come flying by. The problem with this one is for me all of them were horrid.\n\nCrude, low-brow to the point of the hair descending to the knuckles. I am sorry, but I just found this painful.\n\nThe actresses were pretty at least."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Enrique-Sanchez-56",
        "review_rating": "1",
        "review_title": "I am left speechless to describe how BAD this is..",
        "review_detailed_main": "To say that a movie is BAD is a disappointing thing. To say that a movie made one convulse with cringing and embarrassment is even more.\n\nThere are many problems with this movie, here's my short list:\n\n1- Too much frenetic camera work and too much static camera work. Which is to say also that the editing was just as criminal.\n\n2- Too many jokes piled on top of each other. Movies of this genre - the Spoof, are not a wild ride down the Colorado River.\n\nThey must have enough subtlety to deliver each joke, pun, sight gag as a surprise and not as the central point of each shot or scene.\n\nWhat made earlier NIELSEN spoofs so successful was not its excesses but the way that you didn't know where the next joke was coming from.\n\nOne scene in a disco was so badly conceived because it had no direction. It had so so very many \"jokes\" piled on top of each other, the shock value of each new attempt at comedy was not allowed to breathe. In two words: NO TIMING.\n\n3- Too many gimmicky STAR CLONES.\n\nOh what Frank Capra or Preston Sturges could have done with HALF as many people! It boggles the mind.\n\nI second the motion that this movie should be able to receive a NEGATIVE 10 Rating. More than what are classically called BAD films, this has to rank among the worst only because of the embarrassment of riches which lay waste within its starving potentialities."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "bellhollow",
        "review_rating": "4",
        "review_title": "The Naked Gun 44 1/4 Gone Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "0DegreesKelvin",
        "review_rating": "1",
        "review_title": "Holy cow",
        "review_detailed_main": "I enjoyed the Naked Gun series (in fact, I'm watching the first one as I type this), but this movie was so unfunny it was tedious to watch. I forced myself to watch the entire movie hoping to reach some point in the movie that would become entertaining. Frankly, the only reason to watch it is for Ophelie Winter's phantabulous physique. Aside from that, don't waste your time.\n\nNaked Gun was funny because the antics were so absurd, even stupid, but they were still funny. 2001 Space Travesty's comedy lived up to the movie's name in full form. Somehow I can't put words to why the slapstick antics in Naked Gun didn't work in this movie, but take my word for it, they didn't."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "bellino-angelo2014",
        "review_rating": "2",
        "review_title": "Among Leslie Nielsen's worst movies",
        "review_detailed_main": "Despite Leslie Nielsen began as a movie actor in the mid-1950s he didn't become widely recognized until when he did the AIRPLANE and NAKED GUN movies. These movies are true classics of the spoof genre, and mostly because they were cleverly written, well acted and with likeable characters all around. Unfortunately this didn't continued as the years passed because Nielsen ended up appearing in wretched movies badly written/acted/directed like REPOSSESSED, DRACULA DEAD AND LOVING IT and this one. If you watch it do it, but don't expect it to be a masterpiece or a comedy of the level of NAKED GUN. And I am not the only that hated it remember... the movie is currently number #96 on IMDB's everchanging Bottom 100 - the list of the 100 lowest rated major releases of all time.\n\nSo why the movie is easy to hate? Well, first of all, it's unfunny. Many of the jokes are crude and the costumes' design and the sets are incredibly bad. Plus, for most of its time the movie went for cheap and annoying jokes such as farts, revealing dresses and the dumbest characters' names you can find (such as Richard Dick Dix or Miss Menage). And Ezio Greggio, despite SILENCE OF THE HAMS bombed, didn't learned his lesson of leaving acting to real actors!\n\nOverall a dumb and unfunny movie that looks like it was made with a 500$ dollar budget, horrible sets and a director that seemed very clueless."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "carletonclements",
        "review_rating": "4",
        "review_title": "\"How did this get 3?\"",
        "review_detailed_main": "I thought: \"3? Pretty much nothing deserves a 3\", but this movie left me wondering how it didn't get lower. Were there actual people out there who seriously gave it a decent rating? Why?? I'd attack its plot, but I don't even know what it is. I get the movie was supposed to be \"so bad, it's funny\", but there's a limit to how bad a movie can get. It was stomach-turning. Each joke was cringe at best; blow up your television at worst. I've ran out of explosives."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "darthcornstarch",
        "review_rating": "10",
        "review_title": "good movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "minenok-06239",
        "review_rating": "7",
        "review_title": "Don't pay attention to hate reviews",
        "review_detailed_main": "Probably all that 1-point hate reviews were left by devoted supporters of Bill and Hillary. This movies mocks them like it mocks everything else it's about, but that's how this genre works, get over with it. Former president and his never-be-president spouse are as legal to be object of jokes as any other celebrity.\n\nAnd for those who like hilarious movies and Leslie Nilsen here is my advice: Watch it you like Naked Gun movies, Airplane, Space Balls and Dumb and Dumber. It's not as great as those but still give plenty of laughs.\n\nDon't pay attention to imdb ratings for this title, voting is biased."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Bernie4444",
        "review_rating": "4",
        "review_title": "This is the same man that was in Forbidden Planet?",
        "review_detailed_main": "The president has been cloned. It is up to Dick Dix (plural) to rescue him from an alien plot. Naturally, his sidekick is a sexy blond (Ophélie Winter) and he encounters too many close encounters of the third kind.\n\nIn these days of diversity, it is almost impossible to find a one-star product. Well, here it is. This poor film had nobody to save it. The script has a superficial appearance but never follows through. The slapstick humor is not professional enough to get a giggle. Their timing is off and the mystery is not. This animal is not even in the same category as a spoof. If you see the first few minutes you have seen it all.\n\nA note on the VHS edition. There are approximately 20 minutes of coming attractions that make you look forward to looking at this film. After five minutes of the film, you will want to watch the coming attractions again instead."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Perhaps Nielsen's lowest point",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "bojanmilo",
        "review_rating": "3",
        "review_title": "A hot steamy coil",
        "review_detailed_main": "Please don't get me wrong - I love comedy in the Absurd, Slapstick, or even outright Silly categories, and can stomach a heaping bowlful of saucy schtick in a single sitting. I so love Nielsen in a comedy role, and so wanted Ezio Greggio to have a follow-up to his Silence of the Hams, but this movie was so contrived and unbearable that I could only power through what seemed to be a five-hour dignity slaughter by killing a bottle of whiskey with countless toasts to a Dracula, Dead and Loving It poster.\n\nMy second star was piteously donated from my regard for Nielsen and Greggio, and my third mindlessly to the impressive budget that was dedicated to this eye-gouger. It really needed to have a Brooks, Zucker or Abrahams to help it through, but it didn't.\n\nI understand that Nielsen (God bless his soul) had been suffering a lull in his career at the time ...as he had gone slapstick, and was not attractive to the big hitter producers. This was a dreadful follow-up to Mr Magoo and wrongfully Accused, and his career had never really recovered. He was posthumously honoured by the Academy for his noteworthy career.\n\nI will probably scrub through this again just to see Nielsen and Greggio again, out of my best regards ...or perhaps not."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "pcbrooks",
        "review_rating": "1",
        "review_title": "Not as good as it should have been",
        "review_detailed_main": "This movie is probably not intended to be viewed by American or British audiences, despite the presence of two of my favourite actors - Leslie Nielsen and Peter Egan.\n\nThe style of acting here is more usually seen in movies intended for French, German or Italian audiences, where slapstick and exaggerated movements, associated more with the silent era, are still popular faire.\n\nThis is definitely not of the same calibre as Police Squad, Airplane, Naked Gun or Dracula: Dead and Loving It - which is a little surprising, given Leslie Nielsen's credit as co-writer.\n\nThe movie begins fairly strongly but then disintegrates rapidly, running out of steam and containing bizarre 'filler' scenes to the end (check out the condoms stuck to the beard scene - this should have ended up on the cutting room floor along with its sequel).\n\nThat's sad, because it could have been a contender (and should have been, having ridden on Nielsen's name). I strongly suspect this was an STV (Straight To Video) offering aimed at a specific European audience, and the credits do tend to bear this out - my guess is that most of the other actors are probably well-known outside the States and the UK (I know I've never heard of or seen them before).\n\nHowever, it's not a terrible movie (I've seen very much worse) and if you like the style of acting found in French, German or Italian farces then you'll enjoy this one."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "colinpearse",
        "review_rating": "1",
        "review_title": "Banal",
        "review_detailed_main": "I had assumed this movie would contain a humour similar to that of the writers: Abrahams, Zucker, Zucker who did Top Secret, Airplane and Naked Gun. It doesn't. Very unfunny. Most of the humour here is slapstick that can in itself be funny, but not when it's predictable and contrived and repetitive as it is in this film. \"Oh look he's slipped and put ink on his face, ha, ha\". \"Oh, oh! That Frenchman has said fart when he intended to say fort, oh how hilarious\"... are maybe some of the thoughts that will go through your head when you watch this movie or maybe you'll just cringe. A few members of the audience gave sarcastic mocking laughter in the same way and was actually more funny than the movie itself. If you ever have a chance to see the movie then save 2 hours of your life and look elsewhere for entertainment."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "tombps",
        "review_rating": "1",
        "review_title": "If you insist on watching, you'll understand after 30 seconds.",
        "review_detailed_main": "It ain't funny. Trust me. The first \"joke\" sets the tone for the whole movie.\n\nI presume that Les Nielsen was involved in filming and producing only his scenes, otherwise he'd have bailed half way through when he saw what was happening.\n\nThere are 6 funny things in this film. After a short time I realised I'd be able to keep count of them. One of them is a typical slapstick Nielsen scene, all of the others are in the closing credits. That's another thing that I can't understand. It means that, among those involved, obviously more than one person thought that audiences would be howling with laughter, and decided to milk it by including \"crazy credits\". I wish they'd included outtakes, but I think there can't have been any; anything that went wrong would have been an improvement."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Seanette",
        "review_rating": "1",
        "review_title": "A total disappointment",
        "review_detailed_main": "This was a total disappointment to me. IMO, it was basically \"all the cliches of every Leslie Nielsen movie\", *minus* the customary intelligence and humor. I can't recommend this one, even to other diehard Leslie Nielsen fans."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "futuramafan105",
        "review_rating": "1",
        "review_title": "Ugghhh...",
        "review_detailed_main": "Oh man, this one is sooo bad... I'm a big fan of Leslie Nielsen, but this is by far his worst work ever. This was on Comedy Central once, and I thought, \"Hey, a Leslie Nielsen movie I haven't seen! It looks pretty good!\" But I was dead wrong. The movie is so desperate for laughs it's amazing. Right away the movie starts with corny, overused sex jokes that won't even make you smile. Of course, Nielsen's trademark bumbling is featured in this movie, but even that can't save this turkey. I read an interview with Leslie Nielsen recently where he referred to this film as one of the worst projects he had done, and \"he had a horrible time working on it.\" I truly feel for him."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "robin_schmidt",
        "review_rating": "1",
        "review_title": "The single worst film of the last few years",
        "review_detailed_main": "What an embarressment that this movie has been partly financed by German funds...\n\nI am a HUGE Leslie Nielssen / Zucker / slapstick fan ... but this is without doubt the worst movie I have seen in years, and I have seen MANY really really awful ones. This film cannot possibly be enjoyed by anyone whatsoever, regardless of age, nationality or background."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "kinetica",
        "review_rating": "9",
        "review_title": "Great beginning, misunderstood middle...",
        "review_detailed_main": "The beginning of this movie offered some of the best laughs of Space movies I have had in a long time. The middle part does lag, but the last third is not that bad at all. There were worse movies by far, but this is a spoof, not serious and it does spoof the serious movies, and serious people, so it was well done over all.\n\nMany gags were new, and the beginning which is about 15 minutes skewering of 2001 was indeed very funny. But then again, perhaps in recent times such humor is not appreciated as much as it once was.\n\nThe slowest part is the break-in... not well fleshed out, and the development of the antagonist is in need of work."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "NikTesla",
        "review_rating": "1",
        "review_title": "The farts at the end of the movie were the funniest bit!",
        "review_detailed_main": "This has to be one of the most pathetic movies of all times! There is very little that can be said about this movie. It is complete garbage. What was Leslie Nielsen thinking of when he signed up for this load of utter rubbish.\n\nI don't want to think about it any more."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Lament79",
        "review_rating": "",
        "review_title": "A travesty? You betcha.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "gridoon",
        "review_rating": "3",
        "review_title": "You've been warned.",
        "review_detailed_main": "If you're a Leslie Nielsen fan, and you desperately want to see this movie, don't. It's a disastrous, too-frantic, headache-inducing, long, sloppily directed, senselessly written comedy. Read the comments on this page instead; they are funnier! I'll give it one star (instead of none) out of four though, simply for the rather elaborate production design. It's a shame that the people who worked on it saw their efforts wasted so badly."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Wuchakk",
        "review_rating": "3",
        "review_title": "Stunningly bad space spoof with Leslie Nielsen",
        "review_detailed_main": "Released in 2000, \"2001: A Space Travesty\" spoofs space shows/movies and anything else it feels like making fun of, like politicians and musicians (e.g. \"Bill Clinton\" is one of the characters). Leslie Nielsen stars as a Frank Drebin-like character and the movie shoots for the goofy humor of The Naked Gun trilogy, but fails. With the wealth of material at its disposal, I don't know how this movie could've gone so wrong, but it's rarely funny and often downright bad; and this is coming from someone who enjoys goofy humor a la The Naked Gun. It doesn't help that the 2-3 most prominent women aren't sexy; to me, at least. Worse, the sex-oriented jokes are more gross and vulgar than funny. Thankfully, the third act is better than the first two, but that can't save it.\n\nThe film is overlong at 99 minutes.\n\nGRADE: D+"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "crispi",
        "review_rating": "1",
        "review_title": "The worst \"funny\" film I have ever watched",
        "review_detailed_main": "Not funny. Full stop. Period. I'd rate this as below childish. I mean! having fart sounds at the end of the film to try and be funny.\n\nNo. Not funny. Painful."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Empire-3",
        "review_rating": "1",
        "review_title": "Horrible crap!",
        "review_detailed_main": "Words can't describe how bad this \"comedy\" is. Never has 90 minutes seemed so long! There isn't nothing good in this \"movie\".\n\nI wonder did the production crew held a competition for \"Celebrity Look-a-likes?\" \"The winner gets a chance to star in Leslie Nielsen's new movie!\"\n\n1 out of 10 (½ out of *****)"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "theferociousbeast",
        "review_rating": "1",
        "review_title": "This movie bites.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "panicwatcher",
        "review_rating": "1",
        "review_title": "Not a complete waste of time.",
        "review_detailed_main": "Although this movie is devoid of humor, it was not a complete waste of time for me. The lack any interesting scenes put me to sleep and when the movie was over I woke up refreshed. That is something a movie with good writing and compelling characters can never do."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "yogi_bear_k2",
        "review_rating": "5",
        "review_title": "Not as bad as it sounds!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "kellyleighcrutcher",
        "review_rating": "10",
        "review_title": "This isn't meant to be taken seriously; it's a movie that you can laugh your head off at while you watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "R.Dalton",
        "review_rating": "4",
        "review_title": "Eh...",
        "review_detailed_main": "This movie wasn't really all that good. Lame parodies, tired gags, and the same old Leslie Nielsen schtick. This is Naked Gun in Space, no more, no less. It's really no wonder that I haven't heard about this movie until its network television premiere."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "bndalton",
        "review_rating": "",
        "review_title": "Aptly titled",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Raydio",
        "review_rating": "1",
        "review_title": "In a word... GHASTLY!!",
        "review_detailed_main": "There's not much to say about this pathetic attempt at a comedy, other than that it was TOTALLY unfunny. I don't want to add any sense of credibility to this film by writing a lengthy review - \"2001 - AST\" does not merit my time. I've seen a huge number of films in my time, and perhaps with the exception of \"Little Nicky\", this is the worst film I've ever seen, period! About as enjoyable as Haemorrhoids. 1/10"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "boomguy",
        "review_rating": "1",
        "review_title": "The Worst movie I have ever seen.",
        "review_detailed_main": "There are not enough words to describe how bad this movie is. I watched it on television today, so after 10 minutes, I was able to turn it off and watch something else.\n\nDon't rent it, don't pay any money to see it.\n\nThe premise is stupid, the acting is terrible."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Theo Robertson",
        "review_rating": "5",
        "review_title": "Inconsistent But Nowhere As Bad As Is Made Out",
        "review_detailed_main": "Time for another cliché to raise its ugly head and that is - Did I see the same movie ? I read a few of the comments on this page just before I sat down to watch 2001 A SPACE TRAVESTY and feared the worst . After spending an hour and a half of my life watching it I feel some people have overreacted to it . Okay it's certainly not a comedy masterwork but neither is it the cinematic atrocity some people are claiming\n\nCertainly the opening sequence is very tough going , so much so I can't help thinking the people pouring vitriolic hatred on the movie actually gave up on it at this point . To say the film could only get better at this point is to state the obvious but 2001 does indeed improve down to the fact that Leslie Neilson may be playing a character called Richard \" Dick \" Dix but is detective Frank Drebin in everything but name and the introductory sequence where Dick ends a hostage crisis in his own unintentional style is fairly amusing and leaves one hoping for more of the same similar to the style of THE NAKED GUN movies\n\nThis sums up the problem with 2001 and that is that is it sustain the laughs and is very patchy . There's a long segment set on a moonbase and it really belongs in another film as the audience anticipates the sort of antics we'd expect from Frank Drebin . Instead of the sharp , witty , snappy one liners we more often than not get jokes that are stretched out beyond their natural length , most blatantly the three tenors having a Village People routine which gives the impression the writers aren't trying too hard\n\nIn summary 2001 A SPACE TRAVESTY isn't a classic Leslie Neilson comedy but contained enough jokes to bring the occasional wry smile to my face . Everyone else on this page seems to hate it but if you genuinely think this is a bad movie starring Neilson I suggest you watch both REPOSSEED and DEAD AND LOVING IT which really were so bad as to be unwatchable"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Angry_Santa",
        "review_rating": "2",
        "review_title": "Pitiful at best.",
        "review_detailed_main": "What is there to say, that MovieAddict2013 hasn't already said? I can imagine my children would've had a few laughs watching this movie - when they were of pre-school age. Plenty of attempts at slapstick with very few successes. The movie seems to have been made so as to be easily overdubbed with other-language audio tracks, hence meaningless dialogue (I'm sure one could attain the same level of understanding by watching with the volume turned down completely) and a plot barely comparable to the typical Bugs Bunny cartoon.\n\nHaving just now flicked through director Goldstein's other credits, I must say I can comfortably add him to the \"not worth watching under any circumstances\" list; whether it's his inability to bring life to a story (a talented director can breathe life into the most mundane stories) or just poor judgement in choosing what he takes on, is anyone's guess."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "lee_eisenberg",
        "review_rating": "5",
        "review_title": "Don't treat it as serious, people!",
        "review_detailed_main": "A previous reviewer called \"2001: A Space Travesty\" one of the stupidest and worst comedies ever. Describing like that implies that it was meant to be taken seriously. This one isn't meant to be taken seriously. Like any Leslie Nielsen movie, it's an excuse to be silly. It casts him as a marshal sent to outer space to stop a coup, but the plot of course isn't important. The movie's purpose is to have Leslie Nielsen get into a series of embarrassing situations - that is, embarrassing for him, a hoot for us. Granted, this one doesn't quite reach the standards set by the \"Naked Gun\" movies, but it has its share of laughs (particularly the opening scene)."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "woodyweaver",
        "review_rating": "2",
        "review_title": "Just caught it on Comedy Channel",
        "review_detailed_main": "Rather a waste. There is some intellectual curiousity at watching a train wreck, but that is the only way to approach this movie. One of the jokes: Nielsen is trying to save the president (a Bill Clinton double) from being cloned. \"Mr. President, is that really you?\" \"It depends upon what you mean by the word, 'is'.\" I repeat, pass."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "evil_squealer",
        "review_rating": "1",
        "review_title": "what is this crap?????",
        "review_detailed_main": "i haven't even seen this movie, and already i feel as though i've wasted my time just by looking it up on IMDb. I pity those of you out there who were foolishly expecting an enjoyable film. This title unfortunately brings the \"space odyssey\" name and reputation down into the cinematic pits. Stanley Kubrick must be rolling in his grave. the sickos who made this movie MUST DIE p.s Mariah Carey and Glitter must also die~~~!!!\n\nDO NOT SEE THIS MOVIE\n\ni think that movies like this should be taken off the shelves at our video stores and burnt with heaps of metho, because it's films like this that pollute our minds and corrupt our society. i also hate baby geniuses because they are creepy and sick..."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "bgordo81",
        "review_rating": "8",
        "review_title": "A bit silly, but does NOT belong at the bottom of the chart!",
        "review_detailed_main": "I personally don't quite understand why this movie is seen as so rotten. Sure, there are downsides to it. It's rather goofy, and a lot of Dix's narrative humor doesn't quite fly. And, most importantly, no I don't think real gorgeous women would find Leslie Nielsen THAT attractive. But let's face it: not all movies should be taken seriously, especially comedies. The pace was quick enough that it kept me watching the whole time, the action was entertaining, the plot was light but still actually made sense, and the lovely ladies featured didn't exactly hurt as well -- the movie is actually better than most I have seen in the attractive woman department. If you like silly slapstick humor, and particularly if you like the Inspector Clouseau Pink Panther movies and Galaxy Quest, I think you should enjoy this one. And if you haven't seen those, it should still be good if you want to watch some lame, non-serious humor to get your mind off all the trouble in the world. I'll give it an 8 out of 10."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "raulfaust",
        "review_rating": "3",
        "review_title": "Quite funny but....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "fmikeb",
        "review_rating": "",
        "review_title": "It's not a joke, this movie really stinks!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "eva3si0n",
        "review_rating": "5",
        "review_title": "2001: A Space Travesty is a fantasy comedy and parody",
        "review_detailed_main": "2001: A Space Travesty is a fantasy comedy and parody. Trying to parody everything in a row, the film lost its face. 2001: A Space Travesty cannot be seen as a one-piece film, it is for the most part a set of scenes that tried to glue together an idiotic plot. There are few funny jokes, unlike The Naked Gun trilogy. Of course, you can watch once, but there is no humor of the Zucker brothers."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "homgoblin",
        "review_rating": "3",
        "review_title": "Unfunny spoof movie.",
        "review_detailed_main": "This movie is an anomaly. They clearly had a decent budget, with passable cgi and good build stages and costumes.\n\nUnfortunately the direction, the editing and writing is atrocious.\n\nA few good gags but the rest is a messy unfunny movie."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Timofey1980",
        "review_rating": "5",
        "review_title": "A normal movie.",
        "review_detailed_main": "Police bailiff Dix gets another task, the purpose of which is to save the whole Earth. His superiors suspect that at the moment in the chair of the president sits not himself, but his clone, and to check this, sends Dix to the moon. It is there that the factory is located, the purpose of which is to create many clones of famous personalities."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Meh...",
        "review_detailed_main": "I actually never knew about this 2000 comedy before now in 2023, as I happened to stumble upon it by random luck. And seeing it was a movie with Leslie Nielsen in the lead, and given the movie's title, of course I opted to sit down and watch it.\n\nHowever, I must say that the type of comedies that Leslie Nielsen starred in were actually starting to wear thin here. And this 2000 movie from writers Alan Shearman, Vince Di Clemente and Francesco Lucente just felt like they were beating a dead horse. The storyline wasn't really particularly entertaining, much less actually overly funny. And it sort of felt like a random escapade of jokes and gags made up on the go.\n\nOf course it was enjoyable enough to see Leslie Nielsen on the screen, but I have to say that this particular genre of comedy had been bled dry already, and it was a bit of a struggle to watch him attempt to make the script funny.\n\nIt should be noted that some of the alien creatures in the movie were actually nicely enough made, and definitely were colorful and imaginative. Whereas the CGI in the movie was horrible to look at.\n\nI can now check this movie off of my list of watched movies, though I doubt that I will ever return to watch it a second time, as it was bit of an effort to sit through it the first time around.\n\nMy rating of \"2001 A Space Travesty\", from director Allan A. Goldstein, lands on a four out of ten stars."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "eminkl",
        "review_rating": "2",
        "review_title": "What happened to the great spoofs of the 20th century?",
        "review_detailed_main": "The greats like the Airplane and Naked Gun flicks have turned into the rubbish spoofs of this century like Disaster Movie, Date Movie, Epic Movie, and this crap, 2001: A Space Travesty. This movie was at least bearable when they were in space, but the last half, back on Earth, was sheer torture to watch."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "farce4u",
        "review_rating": "3",
        "review_title": "The title says it all",
        "review_detailed_main": "A terrible movie in every respect. It tries way too hard for laughs and doesn't know when to stop recycling the same jokes. I must admit that I did laugh at the end when the bird falls into the soup and the waiter comes over and rings its neck. The sounds it makes are hilarious! But the laughs came too little too late to save this travesty. 3 / 10 for the soup gig."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Joel-O-Man",
        "review_rating": "9",
        "review_title": "Wow...",
        "review_detailed_main": "January 23, 2005 --------------------------- Wow... I just saw this movie for the first time and I can see why I didn't run out and see it when it first came out 5 years ago. Although the movie had a horrible plot, low budget special effects, and was generally unentertaining, it did have a saving point and her name is Cassandra Manage played by Ophélie Winter (http://www.imdb.com/name/nm0935807/) and that's the reason I chose to rate this film as a nine. Although her filmography isn't that long, mostly containing foreign/international films, her beauty absolutely took my breath away. Ophélie Winter is definitely at the top of my list of the most beautiful women in the world and I hope to see that she is recognized soon for it. I sincerely doubt it, but if Ophélie Winter actually gets the chance to read this, you are a beautiful woman, talented actress, and I truly hope to see you in future films as you expand your fruitful acting career."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "wishkah7",
        "review_rating": "",
        "review_title": "I don't care what people think.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "\"Airplane\" in space - part 2!",
        "review_detailed_main": "Note that I've called this review \"'Airplane' in space - part 2!\" is because there has already been an \"Airplane!\" movie that had taken place in space! (Hey, cool rhyme!) \"Airplane 2! The Sequel\" was the name.\n\nAnyways, I've called it that because Leslie Nielsen is in this movie. I remember him from the \"Airplane\" movies, and I best know him from all three \"Naked Gun\" movies - \"The Naked Gun: From The Files Of 'Police Squad!',\" \"The Naked Gun 2 and a half,\" and \"The Naked Gun 33 and a third,\" all of which are reminiscent to the \"Airplane\" movies because something funny happens every 10 seconds or so.\n\nI guess this must be Mr. Nielsen's trademark or something, because \"2001: A Space Travesty\" is just as funny as all the other movies mentioned!"
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Vermin_Empire",
        "review_rating": "",
        "review_title": "WORST. MOVIE. EVER.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "itsmedude-36690",
        "review_rating": "9",
        "review_title": "Better",
        "review_detailed_main": "Better than 2001 A Space Odyssey! Don't take this movie so serious."
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "eddie54",
        "review_rating": "",
        "review_title": "Did Janet Reno direct this film?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "JerseyJim77",
        "review_rating": "",
        "review_title": "It's a travesty all right!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "MarioB",
        "review_rating": "",
        "review_title": "Bad to the bone, but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Set.",
        "review_rating": "",
        "review_title": "fantastic! (see below)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "andrewtheartist",
        "review_rating": "",
        "review_title": "pathetic, maybe, you decide.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "Vlad one",
        "review_rating": "",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "douglasmcdonald3",
        "review_rating": "",
        "review_title": "one of the best movies ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "jbels",
        "review_rating": "",
        "review_title": "Eye-crossingly bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "movieguynathan",
        "review_rating": "",
        "review_title": "\"Travesty\" is right...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "sat-elite",
        "review_rating": "",
        "review_title": "Back to Space for Mr Neilsen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "filmfreak-5",
        "review_rating": "",
        "review_title": "Loads of mild laughs..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "baconbit",
        "review_rating": "",
        "review_title": "When will Hollywood learn?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0157262",
        "movie_name": "2001: A Space Travesty",
        "movie_rating": "3.5",
        "review_username": "rmanx",
        "review_rating": "",
        "review_title": "Don't Waste time or money on this one!",
        "review_detailed_main": ""
    }
]