[
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Vidya Balan is Terrific!",
        "review_detailed_main": "Inspired by the life of the late Silk Smitha, an actress noted for her erotic roles, 'The Dirty Picture' is decent biopic on the late sex-symbol. The main reason why this biopic works, is because of the On-Screen Silk, played terrificly by Vidya Balan. She stands out!\n\n'The Dirty Picture' is a tale of pain, desire, ambition, struggle, and darkness. It's about Silk & her entire journey. It's a complete look at the rise & fall on the late south-siren.\n\nCinematically, 'The Dirty Picture' is a decent effort, that has enough potential to earn itself a viewing. Of course, the Second-Hour could've been better, but otherwise, there is no major flaw in here to point out. Rajat Aroraa's Screenplay is generally good, but it definitely could've been stronger in the Second-Hour. A special mention for the superb dialogues. Milan Luthria's Direction is passable. Cinematography, Editng & Art Design, are mention-worthy. Music by Vishal-Shekhar, is good\n\nPerformance-Wise: Vidya stands out from Scene A to Z. She delivers a terrific performance as Silk. This is Her Bravest & Best Performance to date. Emraan Hashmi is first-rate. Naseeruddin Shah is his usual self, while Tusshar Kapoor deserved more footage. Rajesh Sharma & Anju Mahendru are simply fantastic in supporting roles.\n\nOn the whole, 'The Dirty Picture' is a decent effort. Watch it for Vidya's Performance!"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "rahuljha-jha",
        "review_rating": "8",
        "review_title": "Great first half! So so Second half!",
        "review_detailed_main": "Great first half! So so Second half! Typical Milan Luthria movie, 80s setting, 80s music, people don't speak normally but in couplets. Vidya Balan outstanding, others mediocre. Naseeruddin Shah looks ugly but that's what the movie demands from him. The movie starts well with a young girl who is fascinated by movies and glamor. She runs away from her move a day before she is getting married. Turns up in Madras and tries to get to act in movies. She stands in queue for junior artists outside studios without luck. Then one day she gets a chance to finally do a song which no one else is willing to. And from there her career looks like taking off. But a minor setback almost forces her to go back. But not to be and she becomes 'Silk'. Vidya Balan as silk has done great work and the movie is all about her. 3.5/5"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "ankillasaikiran18",
        "review_rating": "8",
        "review_title": "Vidya Balan should be given 2oscars...one for choosing \"The Dirty Picture\" movie and other for best acting..!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "mu_amir",
        "review_rating": "",
        "review_title": "A great movie with DIRTY title",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "Peter_Young",
        "review_rating": "7",
        "review_title": "Yeh, Ms. Balan is a hoot!",
        "review_detailed_main": "Said to be based on the tragic life of Silk Smitha, The Dirty Picture tells the story of Reshma, an ambitious village belle from the South, who aspires to make it big in the movies. Through this character, we also get to see a rather satirical take on Bollywood's 1980s, which is known to be the most dreadful period for mainstream Hindi films of that time. At first Reshma strives to prove her talent as an actress, but as soon as she learns how showbiz really works, she realises that the only way she can make her dream come true is by using her sexuality and exposing her body, and that's where she turns into Silk. The film industry is portrayed as rather sleazy in the film; casting couch is a standard phenomenon, artistry is a word mostly uncommon to filmmakers and audiences. That said, even though I don't buy it all, it is an amusing watch. The dialogue is witty, the art direction is fantastic, and the film is just too colourful to skip in spite of its faulty script. But then, everything is put aside when it comes to the lead role as played by Vidya Balan, who represents everything that this picture is about and everything that's good about it.\n\nHaving seen her spectacular performances in Paa, Ishqiya, and No One Killed Jessica, I'd had huge expectations from Vidya Balan. Little did I know that she would just transcend them all with her dazzling performance in this film in a role which many actresses would either fight for (mostly in retrospect) or shy away from. Forgoing any trace of whatever she was ever known for, Balan just becomes Silk in a fearlessly uninhibited performance that is replete with energy, authenticity, spontaneity, confidence, and a never-seen-before sensuality. She's unabashedly sexy, charmingly vivacious, awfully attractive and just too smashing hot, and the way she delivers those witty, provocative lines is simply awesome. And if that isn't enough, that turns out to be just one side of hers, because Balan brings a great deal of depth and understanding to this complex character. There's a lot of pain, struggle and conflict in her portrayal—something that a lesser actress could have easily missed—and it often ends up being a moving portrait of loneliness. This is a class act which reaffirms Balan's position as one of the finest actresses of our time.\n\nEven though the show belongs to its leading lady, the supporting actors get nice parts to play, and they handle them well enough. Naseeruddin Shah offers a wonderfully spoofy act as a caricature Bollywood hero of the 1980s, that of a middle-aged man that is idolised and loved and still plays parts of much younger heroes on-screen, romancing young girls who could well be his daughters and later playing their sons. Emraan Hashmi is very good in a subdued performance, but Tusshar Kapoor is not as convincing, though good enough. All the rest come and go without leaving much of an impression. I liked the film's music, particularly that \"Ooh La La\" number, which epitomises the style of the 1980s and which was well presented on-screen. To sum it up, The Dirty Picture is definitely a watchable film, but it's never a particularly convincing one. I somehow wished the story had more depth, and I often found the script too simplistic. But leaving its flaws aside, there's one thing about The Dirty Picture, which is the real thing, and that's, as said, Vidya Balan, whose performance makes every flaw in the film easier to forgive."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "CastleToe",
        "review_rating": "6",
        "review_title": "Choli ke peeche kya hai? (What's behind the blouse?)",
        "review_detailed_main": "Imagine you are making a movie about something really energetic in its own way, for instance, the enormous amount of water that is required to fill a large Sintex tank on top of a building. You may begin by showing how water fills up such a huge tank, the energy of flowing water and so forth. It is however important to note here that it is not the water alone but also the magnanimity of the tank, the height of the building etc. that must get to play an important role. Without an uncompromising projection of how huge the tank is, how it was carried over to the top of a large building and, so on, it will become impossible to feel the enormous presence of the water that fills it.\n\nAnd that would sum up how The Dirty Picture was executed. The energy of Vidya Balan in the central role was simply enormous. So much so, that the rest of the picture was unable to match up and consequently felt bland and weak in comparison. People often ask, if the writer writes the story, cinematographer films it, actors act and music director scores, what does the director get to do? The director must ensure that the energy of all people involved in the project is channelised in a single stream that gets projected on the screen and must be eventually, felt by the audience.\n\nDirector Milan Luthria fails miserably in his job here. A hammy comical Naseeruddin, a controlled Emraan Hashmi and a joke of a Tusshar Kapoor comprise the side characters around the unabashed and shamelessly unapologetic Vidya Balan. Her power over the crowd is merely shown each time by repeated shots of punching movie tickets, crowds of people rushing in and a different dance sequence on the screen. A shabby compromise! The promising biopic is not only slaughtered in its execution by the director but also in its clichéd screenplay (by Rajat Arora who adopts the same dialogue-styles from his previous OUATIM) that allows for an unnecessary narration sequence by Emraan Hashmi and a frequent spew of corny lines and witty (yet, effective) one-liners that end up disrupting the mood of the scene. The audience are however shamelessly satisfied without noticing the loose threads in the story. Like, what happened to the other character who sang with Silk? But who watched it for the story! People cheered when an extra half inch of Silk's bosom became visible or when she has finally got to kiss the medley of different heroes on screen. Special jeers and remarks for Hashmi's kiss. And I was in a multiplex hall.\n\nCinematography comprised of a sepia-ish hue to depict the 80s period in South India which went very well with the art direction but sadly, it avoided wider angled shots which could have been used to capture scenes involving Silk's audiences or at least to add authenticity to the period drama. This, coupled with the screenplay greatly limited the scope of this movie. The star power that the soft-porn star exhibited was neglected in various scenes. For instance, in the scene where Silk was creating a ruckus outside someone's house, the gathering of the crowd and their cheers were avoided and instead, the focus was on Naseeruddin, Tusshar and other star people involved. Better editing could have spiced up many of such shots.\n\nMusic score was mismatched and even slightly boisterous in some places.(I suspect that they must have hired the guy who gives those reaction sounds from Ekta's TV soaps for some of the scenes). Ooh La La was the only fun song. Honeymoon Ki Raat was a mind-boggler! Why was it even there? Sufiana was an unnecessary addition towards the end but they had to have it to show Hashmi kissing Balan.\n\nActing wise, however, this movie saves its face. Naseeruddin maintained the humour in the first half. Hashmi was consistent throughout. Tusshar was vapid and maintained a stupid look on his face in most of the scenes. Rajesh Sharma is indeed the discovery of the year. After a helpless police officer in No One Killed Jessica, he is unbelievably perfect as the B grade-ish producer. Expectedly, Vidya Balan saves the day by lifting the entire weight of the dirt of this picture and excelling herself as she has done in her past movies. Every performance since her past 3-4 movies has saved her movies from going noticeably awry. I was never a Balan fan from the start. But as of today, all I can say is that no one in Bollywood is in a position to make a picture that can sustain her energy and performance. It's like taking all the water meant to fill the Sintex tank and using it to fill your water bottle. The bottle is enough for you, not for the water.\n\nProducer Ekta Kapoor must have a really weird sense of humour. This movie that holds the vulgar expectations of the audience responsible for the rise and fall of Silk targets the very same from the audience of this film. And apparently she has hit the right spot. Sadly, this is apparently what \"Entertainment\" in a film is all about! When I walked in for a fourth day's show, many people around me were able to repeat various monologues by rote and in sync with the actors. The Irony!"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "Saayer",
        "review_rating": "7",
        "review_title": "No Dull Moment",
        "review_detailed_main": "Some people watch a movie for its elegance, good acting and high production values. Others watch movies for their sleaziness, skin display and controversy. How often do you get both the sides leaving the theater satisfied thinking that they got a great value for money? Milan Luthria presents The Dirty Picture. In the words of Silk Smitha, a film works for three reasons; Entertainment, Entertainment, Entertainment\u0085 And The Dirty Picture is entertainment. However, it's a movie for Adult audience who can take the kind of humor and exposure it has to offer.\n\nThe Dirty Picture (DP) is story of a South Indian actress Reshma, popularly known as Silk. Rajat Arora's script keeps flirting with glamor of showbiz and the bitter realities faced by a girl running away from her house to become an actress. To the extent where she eats only a spoonful of sugar once a day as her meal. It exposes how despite criticizing the amount of exposing on cinema; the masses actually enjoy the skin show and that sex sells. The story is a rather predictable tale of rise and fall of a female actor and whatever happens in between, however, it's the treatment and performances that make DP a thoroughly enjoyable watch for lovers of almost all genres.\n\nThere are two more things that make DP stand ahead of other recent films. First is the outstanding background score. From the evergreen Naka Mukka to the entertaining 'Ooh Lala' use in the background along with the SFX, background music is simply superb. Secondly, the fiery dialogs are probably the best thing in the entire film. One jewel after another. So much so that you cannot even keep count on them.\n\nBobby Singh's cinematography is first rate. His best work to date even though he was an unexpected choice. When you have to show sleaze and skin, it's a tough job to still stay classy and Bobby Singh does exactly that. Especially the way Vidya's being overweight has been shown is remarkable.\n\nDP is loaded with powerful performances. It's not very easy to find Emran Hashmi in a bearable role. I don't know why a talented actor like his keeps wasting himself in his serial kisser movies. It was once again Milan Luthria after Once Upon A Time in Mumbai (OUATIM) who took out the best in him. Tushaar too is bearable. Can you believe that? Every single supporting character has done a fabulous job. Rajesh Sharma in another major role after No One Killed Jessica (NOKJ). Navin Gothi, the actor playing Vidya's lucky charm and the director who first kick Vidya out of his set are especially very good. Arya Banerjee makes her presence felt as a new-comer Shakila. Vikas Shrivastav as casting director who sends Vidya out with a 5 rupees bill and Sarang Sathaye as choreographer George who gives Vidya her first song are noticeable in their cameos.\n\nAnd then comes Naseer Uddin Shah. Who else could have done a better job than NS as the aging malicious actor? He gets into the skin of the character of Surya and does a splendid job of it. Despicable and convincing.\n\nAnd last but not the least is Vidya Balan. What a powerhouse of an actress. She started the year with NOKJ and has ended it with The Dirty Picture. Totally contrasting roles. In one she was a nerdy homegrown nonentity and in the other she is the sex symbol of the industry calling herself Entertainment and boy, how she excels in both the roles. Watch out for her award ceremony speech, her early scenes with Naseer and the climax. Easily the best female lead performance in 2011. Filmfare worthy material.\n\nThe real hero of DP is Milan Luthria. How far has he come from Kachhe Dhaage days? If he was very good in OUATIM, he is even better in DP. Complete grip on the screenplay, taking out the best from the actors no matter how small their roles is, creating an 80s atmosphere still looking totally different from Om Shanti Om and Action Replay, this is a director how is in command. This makes the sequel of OUATIM the most anticipated movie of 2012 as far as I am concerned.\n\nThe Dirty Picture hardly has a dull moment. It does get a bit slow when it goes to the soft side of Vidya and Emran, however, that too remains an integral part of the storyline. Do keep in mind the 18+ rating of the film before going to the theaters and keep the expectations on those lines. If you do, you are up for a treat."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "ilpintl",
        "review_rating": "7",
        "review_title": "Bold and thought-provoking...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "Somak21",
        "review_rating": "9",
        "review_title": "Focuses On The 'Dirt' In Our Minds",
        "review_detailed_main": "Expectations for this movie were totally 'Tharki'. The nation was set on fire since the trailer was launched. Vidya Balan is the hot topic in every corner for her flaunts and oomph. Emraan's something new avatar was also noticed. Shortly, people who were keen to see 'The Dirty Picture' were either waiting to see what Vidya had still to show or some very delicate people were impressed by the centralized theme of the movie.\n\nSilk Smitha was a heartthrob of her time, not for her acting but her skin-show and sex-appeal. Describing her life is nothing so important as she as totally washed out from many minds. But I would praise Director Milan Luthria's 'one step forward' thinking and make such a mind-blowing movie on Silk. I mean, Silk would have got amazed if she could watch the movie and realize how interesting her life was to many people.\n\nEkta Kapoor is a producer of some different movies like \"Once Upon A Time In Mumbaai\", \"Love Sex Aur Dhoka\", \"Ragini MMS\". 'The Dirty Picture' is a 'hatke' and 'sexy' attempt to bring a rage in Indian movies.\n\nReshma (Vidya Balan), a girl who had big dreams in her mind sets off in a journey that will lead her to vulgarity, betrayal and impure fame. Her career stars with being 'Silk' and ends when the 'Reshma' in her rises. Suryakant (Naseeruddin Shah), Suryakant (Tusshar Kapoor), two siblings were the two obstacles in her 'want to be' good life. Ibrahim (Emraan), who looked upon Silk as a vulgar, dramatic actress and personal enemy, finally finds that what she is doing is not intentional. Real Life V/S. Movie - the difference is shown in this film and by whom it's shown is late Silk Smitha.\n\nNo Two penny comments on performance by Vidya Balan. She has shown everything where what should be - 'Body' and 'Herself as a perfect performer'. I can say with extreme surety that she will win 'Best Actress' award in every function (can get a national award as well). The sex content in her role, horny expressions, dialogs (that can shut any person up) - everything made Vidya Balan the show-stopper, simply marvelous. Next to her whom I liked very much is Emraan Hashmi, a small wonder. His role was thin and short but his carrying out was commendable and deserves applause. Naseeruddin Shah was fantastic as a rude, selfish and villain-ish person. Tushaar Kapoor was first-rate in his gentle turned evil role. Rajesh Sharma deserves some points. Others like Anju Mahendrum, Mangal Kenkre & Shivani Tanskale are fine.\n\nThe One thing which I liked most in the whole was kick-ass dialog was heroic, crude and strong. Some sexual references were hilarious. Nearly every Dialog is a stunner. Awesome work on dialogs as well as story and lyrics by Rajat Arora. Cinematography by Bobby Singh was good as he covered 80's wonderfully. Costume by Niharika Khan was top notch. Making Vidya Balan look sexy in her big tummy was hard but costumes covered much. Music by Vishal-Shekhar is average. 'Ooh La La\" and \"Ishq Sufiyana\" are the only ones that one can enjoy in a situational position.\n\nOn the whole, The Dirty Picture is the best movie of this year so far as it has every ingredient perfect in it. From Story to script to dialogs to performances - everything is just fantastic. Even the Sex-quotient is very high and vulgarism is over the top, still this movie shines for his genuineness and strength in plot and lead actors. Moreover, This movie is a grand success for it's three elements \"Entertainment, entertainment and entertainment\". Finally I would state that, If you skip \"The Dirty Picture\", it will be one of the biggest mistakes you've ever made. Please, watch it! P.S. - This movie is 'Strictly', not for kids and under-ages."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "saytosandeep",
        "review_rating": "7",
        "review_title": "MY REVIEW: Nothing dirty about it!!",
        "review_detailed_main": "Those titillating promos were just tip of the iceberg. The real part was every award winning performance of Vidya Balan. She takes the steps way ahead of its competition and makes her portrayal of southern siren Silk Smitha look believable and commendable. Apart from Vidya, other casting is also chosen very carefully. Naseruddin Shah is reliable as always. Tushar Kapoor fits for his role. Emraan Hashmi looks charming and his scenes with Vidya in second half are touching and subtle. Milan Luthria captains the whole movie like an expert. Background score is rocking and dialogues are clap worthy. However, movie is not without its flaws, there are one or two extra songs and scenes which could have been removed at the editing table. Overall, movie will be remembered for brave performance of Vidya Balan and some of its one-liners said deliciously by Emraan Hashmi."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "jain-anirudh",
        "review_rating": "5",
        "review_title": "Watch first half for some lighthearted fun and a few laughs. Bail in the interval. Don't stay for the second half.",
        "review_detailed_main": "This movie was extensively marketed and apart from the sleaze, also appeared to be a promising story and biography. The final output is quite disappointing.\n\nThe first half is enjoyable with Vidya Balan playing a \"devil may care\" character, some funny double meaning dialogues and sequences and general cheerfulness of the movie.\n\nThe second half is pathetic. The transition of Vidya from a successful star to a self-destructed wreck is not at all convincing and Balan fails to impress. The story is very patchy and disorderly. The end is specially an overkill with the bridal dress and the sleeping pills. The kind of character Vidya plays wouldn't act like a helpless and pitiable character of 1960s. I guess the only good thing about the second half is the attention paid to Vidya's makeup - the eye bags, clothes that suggest many extra pounds and the paunch.\n\nAs for the other aspects of the movie, Tusshar looks mentally retarded as usual. He should probably only play mentally challenged characters as he wouldn't need to act much and would fit right in. Whoever wrote the dialogues tried to hit a six off each delivery. He needs to understand that each dialogue can't and needn't be a punchline. Emraan Hashmi should specifically get someone to write dialogues for him that are not always senseless metaphors.\n\nOverall - 5/ 10 rating. Watch the first half for some lighthearted fun and a few laughs. Don't bother with the second half."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "AishFan",
        "review_rating": "9",
        "review_title": "Vidya is mind-blowing! Witty dialogs!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "erisedwitch45",
        "review_rating": "6",
        "review_title": "Vidya Balan all the way!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "durgadada001",
        "review_rating": "2",
        "review_title": "Uninteresting",
        "review_detailed_main": "Whats with the 'rave reviews' and 'unanimous praise' directed at this movie and its lead actress ? Well....its bullshit...that's what it is.\n\nI am from the south and Silk Smitha is a legend in her own right. Another misunderstood and misrepresented vamp actress(with talent mind you) who met a 'oh so familiar' end (both in career and in life). Nevertheless, great material to make a bio pic.\n\nAnd here is where my problem is - when you make a biopic or try making one, you show us the \"person\", not play out 'rumored tales' about the person's life (in the case of Silk its already public knowledge). Evidently no research has gone into her real life or personality. When discussing biopics, movies like Patton, The Aviator, Malcolm X and all those great ones come to mind. Although Silk Smitha's life is not as celebrated as Howard Hughes or George Patton, you do expect the director do some digging and show us the real personality rather than the screen persona.\n\nVidya Balan is a good actress, only, with a stronger screenplay and content (not to mention a more capable director), she could have made this portrayal a career best. Instead, you have the usual clichéd \"masala scenes\" and \"dance numbers\" which totally miss the point. If you guys think this is a great movie, so be it. I understand your limitation and pity the many more crappy Indian movies to come. BTW, the nakku mukka background score was not only funny, but also annoying..."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "Vidya Excels in a weak script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "creative_sohini",
        "review_rating": "6",
        "review_title": "Vidya Balan...the USP of this movie.............",
        "review_detailed_main": "\"THE DIRTY PICTURE\" with an 'A' certificate is a biopic on the life of Silk Smitha,a southern siren of the 80s.Many will argue tat dis film is filthy, lewd, sleazy and every other word that has the same meaning. But it is because it's based on someone who embodies all these adjectives.\n\nWid a highly entertaining 1st half, and a mediocre 2nd, the film falls short of being truly remarkable. Overall, a big thumbs up to \"The Dirty Picture\", which is in its truest meaning, an entertainer. And its been proved as it has set the cash registers at the box office on fire.\n\nThe film belongs to Vidya Balan and she does absolute justice in playing her part to perfection.She seems to have submitted herself completely to her director and to the demands of the script and has acted so naturally that it is difficult to imagine anyone else doing what she has done in the film. She would easily bag every best actress award this year for her remarkable show of talent.\n\nNaseeruddin Shah is very good as the Lecherous South Indian superstar, he plays his part very well. Emraan Hashmi as the 'Hatke' film director & the narrator of the movie does total justice to his character. Tussarr Kapoor's role is the weakest link in the film, he has no expressions nor his role was of any importance. He simply bagged the role because of his Mother & Sister being the producers of the movie."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "saad_khi",
        "review_rating": "6",
        "review_title": "Vidya's Item film",
        "review_detailed_main": "Not being a party pooper but the only aspects that drive it are the script and dialogues. Did i hear, what about Vidya? The fact is she is a miscast! Gone are the days when actresses wanted to act blind or mad. Now the crores worth heroines are not different from Raakhee Sawant and the like. They want to do dare to bare roles and item numbers and it's becoming passe! The journalist Naela rightly tells Silk to stick to her guts. What she did will be considered 'freedom' in the future. She was right. Silk was original, or say a pioneer. And the vying for top position heroines today are following suit! So much so she even inspired (a saree clad) Vidya to emulate her and gave an excuse or say a reason for the sake of celluloid art to show skin and do not just an item number but a complete item film to last a lifetime! The fact is any actress could have easily done this role, so Vidya is no exception."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "arupghose",
        "review_rating": "6",
        "review_title": "Taking vulgar to another level",
        "review_detailed_main": "In summary, this film is way too vulgar! Sex certainly sells in Bollywood, but this has taken it too far. I was unimpressed with the story line, but must compliment Vidya Balan on not only choosing such a role, but also delivering it to the her best ability. She reminds me of Shabana Azmi - she doesn't do the entertaining all singing and dancing films, or glamour roles but she is turning into a very highly rated and dependable actor.\n\nNaseeruddin Shah is simply fantastic! For someone his age, to take on the roles of first Ishqiya and now The Dirty Picture - you have to give him a lot of credit!! Emraan Hashmi is excelling with every film he does. I am happy that he has moved away from doing Vishesh banner films only, and delivering films such as Once Upon a Time..He has talent and it is about time he worked with some well known Directors.\n\nTushaar Kappor is a waste! I find him difficult to watch. He never comes across naturally on screen unless he is mute in the Golmaal series. The only reason why he is in this film is because it's produced by his sister, and the same went for Shootout in Lokhanwala (which he was a total misfit for the role!).\n\nOverall I give this film a 6 purely because of Vidya. She is fantastic and deserves all the awards she wins this year, but only due to a lack of competition."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "kamalbeeee",
        "review_rating": "6",
        "review_title": "Average biopic about silk..!",
        "review_detailed_main": "The movie about actress silk and her life story... Interesting at some scenes but too shocked at some scenes about her behavior and her decision... (I don't why she live alone even she got famous and have more money) One time watchable movie..!!\n\nThe movie about actress silk and her life story... Interesting at some scenes but too shocked at some scenes about her behavior and her decision... (I don't why she live alone even she got famous and have more money) One time watchable movie..!!\n\nThe movie about actress silk and her life story... Interesting at some scenes but too shocked at some scenes about her behavior and her decision... (I don't why she live alone even she got famous and have more money) One time watchable movie..!!"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: The Dirty Picture",
        "review_detailed_main": "I suppose it's not easy trying to make a bio-pic about a controversial actress that calls for some parading of skin due to various states of undress. In Singapore, the Rose Chan project has been stalled from its initial announcement, with one of the close contenders for the role dropping out and to date leaving the project quite in limbo. In what would is a generally conservative society, you can imagine the challenges faced by director Milan Luthria (of Once Upon a Time in Mumbaai fame) in making The Dirty Picture, a largely fictionalized biography film about one of the sex sirens of Indian Cinema known as Silk Smitha, who had made a staggering 450 films over a career spanning 17 years before her untimely demise at age 35.\n\nThe Dirty Picture chronicles the life and times of Silk Smitha (played by Vidya Balan) as seen through the eyes of her one time enemy and art-house film director Abraham (Emraan Hashmi), her less than successful love life with directors and screenwriters, and in her desperation, willing to do just about anything for that shot at stardom, in an industry where fame is reserved only for a few, and chauvinistic too. In this version of her life written by Rajat Arora, Silk Smitha adopts her namesake thanks to a producer who sees the opportunity to set box office alight when he chanced upon the unused item number in Abraham's film, and from sultry dance numbers one after another, her role in films begin to expand, and so does her notoriety amongst the gossip rags, playing up her sex siren role to strata-strophic heights. I suppose you know when you're a star when audiences pay full ticket prices only to enter the hall to watch your item number, and leave soon after it ends.\n\nMy interest got piqued not only that this is a story of the rise and fall of a sex siren in a film industry, or the controversial scandals that go on behind the scenes, but truly stem from getting another chance to peek into how the industry might have worked previously in the 80s, in South Indian cinema. Om Shanti Om provided that glimpse into the 60s era, though this one offered a look at both mainstream and the adult based industry, although the latter was a little too short to make an impact in this film. The star system is obviously in full swing here where everything a superstar does get praised and sucked up to, and the reverse where junior artistes get the flak for everything else is the norm. Favours are exchanged for opportunities, and soon Silk becomes the mistress of megastar Suryakant (Naseeruddin Shah) who carries out their affair on set behind the back of his wife.\n\nDirector Milan Luthria crafted a very charming film that doesn't border on the exploitative, even though the film's main subject matter is precisely that, presenting just how cutthroat the film industry is, where enemies can become friends and vice versa, and just how fame is such a fleeting issue one can get forgotten fairly easily and fade away just as fast as one enters the scene with a big bang. There's an excellent balance in drama, comedy and of course the need to highlight just how far Silk dares to go against industry norms and shock and awe audiences and crew with her boldness, and the pace is kept to a breeze, forgoing most of Silk's earlier, non-acting life to kickstart where it started to matter.\n\nAnd clearly the star of the show is the heroine, Vidya Balan, as she takes on what would be her most challenging role to date, making herself believable as a sex siren with no qualms in dressing to the nines in figure hugging outfits, piling on the kilos to look the part of the South Indian actress, and spouting lines of dialogue filled with endless sexual innuendos, not to forget constantly giving that come hither look. In some way Luthria managed to steer clear of being vulgar, and his Silk came across as more sensual and seductive, rather than downright crass, giving you reason to believe just why hundreds of thousands worship the new female film idol who's taking the industry by storm. Balan deserves every single accolade that will come due to this role, as she provides both that steely exterior that defies the odds, and that vulnerable interior self who is out of luck when it comes to matters of the heart, making you sympathize with Silk every step of the way.\n\nNaseeruddin Shah also excelled as the prima-donna superstar actor Suryakant, a Casanova of the industry who soon establishes an affair with the actress, and is every much the cad he is made out to be. Having co-starred with Balan in an earlier film last year in the acclaimed Ishqiya, they continue to share that chemistry on screen here, with Shah in top form as he hams it up in his role as the pampered acting star able to call on every whim and fancy. Tusshar Kapoor stars as his screen writing brother Ramukant who takes over the romantic male lead midway when he romances Silk, and Emraan Hashmi's uncompromising art-house director Abraham assumes the role of the enemy of the heroine inevitably turned friend and eventual lover, whose story arc resonates the constant struggle between a director's vision, to that of the producer's in wanting to guarantee box office returns.\n\nWith superb acting, magical musical numbers, a strong narrative storyline and a look into the exploitative films of the 80s era, The Dirty Picture plays on its much preached about mantra of entertainment, entertainment and entertainment, delivering what it had promised, and at the same time making it thought provocative, teasing you to find out a lot more of the real Silk Smitha and the films and era that she had crafted in her heyday. Definitely highly recommended!"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "nibeditadasnibi",
        "review_rating": "7",
        "review_title": "Vidya Balan ma'am hats off",
        "review_detailed_main": "So basically I used to think this is a cinema all about sex cause it is name The Dirty Picture. This cinema was released when I was 12 and I used to enjoy the 'oohlalah' song very much and it is still my favourite. So when the cinema was released I was not allowed to watch cinemas only kids move were allowed. And I was very curious to watch the cinema that time but as years passed it slipped my mind. And two days ago I was scrolling through imdb saw the name then I decided to give it a watch. I didn't watch the trailer so didn't know what this cinema was about. I wasn't even expecting much as the ratings are somewhat low. But this cinema turned out very good. Love you ma'am. Always a fan."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "saish746",
        "review_rating": "4",
        "review_title": "Dirty Picture is over-hyped and over cleavage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "user-107-982434",
        "review_rating": "8",
        "review_title": "An Outstanding Unique movie from Bollywood. Entertainment, Entertainment and Entertainment.",
        "review_detailed_main": "The Dirty Picture is a biographical movie on the life of Silk Smitha. The story of movie is unique and interesting unlike todays bollywood movies. Vidhya Balan as Silk in the film is truly outstanding. Hats off to Vidhya for such incomparable and incredible role. Naseeruddin Shah had also given excellent performance. Character of Emraan Hashmi in the movie is very unique. He has also did a great job in The Dirty Picture. Role of Tusshar Kapoor in the movie was an average role. Story, script and direction of movie makes The Dirty Picture very unique bollywood movie. Music is also good. The first part of movie will catch your attention. But after interval, movie will become slower.\n\nThe Dirty Picture is a story of a strong woman, Reshma (Vidya Balan), who can go to any extent to fulfill her dream of becoming an actress. After few hurdles, she becomes an instant sensation 'Silk,' a woman every man desires. But, on her journey to stardom, she eventually starts craving for true love and feels betrayed each time. She gets the first blow, when she misunderstands lust to be love in case of her all-time favourite actor and later a co-star Suryakant (Naseerudin Shah). She is almost trying to cope up when Ramakant (Tusshar Kapoor), a storywriter too disappoints her, though that's truly unfortunate, as he has no wrong intentions. She gets her final blow, when stardom too starts bidding a goodbye to her. Lastly, when her all-time enemy (Ebrahim) Emraan Hashmi, a director turns into her passionate lover, she encounters a sad death.\n\nOverall, Entertainment, entertainment and entertainment. The Dirty Picture is an outstanding bollywood movie with a unique story. It's highly recommended movie."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "braddugg",
        "review_rating": "6",
        "review_title": "\"If fruits are big, it doesn't mean they have to be tasty.\"",
        "review_detailed_main": "\"If fruits are big, it doesn't mean they have to be tasty.\" One of the dialogs in the film goes very well with film.\n\nBig films need not be completely great and small and mid-budget films need not be tasteless either.\n\nBased on the life of Silk Smitha, this film takes a sneak peek into an actress life who got men rolling in 1980's in almost her every appearance (irrespective of the time she was on screen)\n\nA few lines about Silk Smitha before I proceed with the review. A seductress by choice, she got the name and credit she earned in her own way when men were ruling the roost with action. She was not a forced actress, she did things freely and seduction was in her voice and in her every move on screen. The most memorable film of hers for me is Sadma (Moondram Pirai in Tamil and Vasanthakokila in Telugu). So that's about Silk Smitha, the woman who was termed vulgar by the then hypocrites.\n\nNow, coming to dirty picture. What it has is, Entertainment, Entertainment, Entertainment (not in the real sense) in terms of Vidya Balan. I must say, she has single handedly given life to a lackluster script that has good dialogs but it suffers by too many unimportant small things being detailed.\n\nRajat Aroraa's many dialogs are noteworthy and if some are straight in the face, some are twisted with humor, for most dialogs I laughed. The good thing is that for most part the movie does not take itself seriously. Only in that last half an hour or so, it changes its point. From an entertainment queen, she is turned into something that brings the inevitable end. Did Silk Smitha die? Oh sure she did but the way she did was shown simplistically in the climax (I liked it), a great change for Hindi films where every climax has to be big and loud (as per a set norm).\n\nPlease spare Mr. Tusshar Kapoor and keep him out of any film please, he is a complete misfit. Nasseruddin Shah was his natural self. Emraan Hashmi, I must say had done his job well. Actually, I was very apprehensive watching an Emraan Hashmi film on screen because it would be complete waste of time. But here he did it well and yes his character was very liked by me, he played a hypocrite as a one who knows what's hypocrisy is all about. Now, the only reason for which you should watch this movie is Vidya Balan.\n\nShe deserves all the best actress awards next year. She exposed for the character while other actress expose to show themselves in the name of \"script demands it\". Here, we have a script that truly demanded what Vidya did and she came out in flying colors. All my appreciation to her. I shall now say, she is the best actress we have around and use her properly please and she will deliver extremely superb acting for sure. I would dare say, she is Smitha Patil or Shabana Azmi of today.\n\nFor the film, the editing and sound design please are two departments that I think are un touched and very bad that are a big let down. Art direction is very good and cinematography is mediocre. This script had a lot of scope for using camera but I believe camera was very minimally used. So all these, got the movie to a mediocre level. But, Vidya Balan covered most of the shortcomings.\n\nAs of today, I rate it 3/5 a movie a good one for Vidya Balan."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "aashishraina",
        "review_rating": "3",
        "review_title": "Too much!!!",
        "review_detailed_main": "Well, I read some awesome reviews of this movie and decided that i should go for this. but i came out disappointed. I still don't understand what the fuss is all about. People have said that \"there is not a dull moment in the movie\". i agree. but there is nothing new in the movie. Its too predictable and the dialogues are just pathetic. At time, dialogues didn't even make any sense. The only thing i liked about the movie was the guts. Vidya Balan. Salute you for that. To do such a role. You need guts. Gaining 12 kgs But except for that there was nothing in this movie. All the movie makers cared about was to show skin!!"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Vidya Balan, Vidya Balan and Vidya Balan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "cap-nimo007",
        "review_rating": "9",
        "review_title": "the dirty picture !!!!!!!!!!!!!!!!!! behold the dirt within",
        "review_detailed_main": "THE DIRTY PICTURE!!! the name certainly is one of the most catchy name for a movie to pull audience to the theater. In case of genre it is a very rare genre of film which is made in India. It is mainly a BIOPIC based on the life of silk smitha the SOUTH SEX BOMB who died in solitude in year 1996. To make a BIOPIC the director must follow the details of the life of the character . the detailing made in the movie is perfect seemed to me. Silk was born a TELEGU village girl.Her movement (From walking to dancing)is brilliantly portrayed by VIDYA BALAN. She is the one actress industry was searching for. technically some faults are there in the film. some dialogs are not very subtle to describe the depth of the scene last song (pictue had three songs used) was not really necessary. The strength of the movie is MS VIDYA BALAN , and also the background score. If VIDYA made the appearance then it is only the score which make the scene dramatic.."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "vibhordhawan",
        "review_rating": "4",
        "review_title": "Likable in parts but disappointing overall",
        "review_detailed_main": "The movie is essentially a Vidya Balan movie, some witty dialogs less than ordinary songs and poor acting barring Vidya and Hashmi to certain extent. Story of Silk Smitha is definitely an inspiration but justice is not done to the plot and barring some exchanges between Emraan Hashmi and Vidya Balan which have witty dialogs both trying to get one over the other, the movie was a disappointment. Tusshar Kapoor is disastrous and Nasseruddin Shah was hopeless.\n\nIta a dirty movie not advisable to be watched with family and is very much avoidable otherwise too.Vishal and Shekhar have disappointed big time and no song deserves a place in my play list. Second half seems to carry on long and everyone glance to their watches to see when this torture will be over. I will be giving it 3 out of 10 with 2 for Vidya and 1 for Emraan."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "harpisteva",
        "review_rating": "10",
        "review_title": "A Film Everyone In Bollywood Should Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "nishesquire09",
        "review_rating": "4",
        "review_title": "Atypical Bollywood, but still mediocre",
        "review_detailed_main": "Many people will rave that the \"The Dirty Picture\" is not your typical Bollywood movie and then mistake \"atypical\" with \"great.\" True: the movie contains many, many sex and kissing scenes -- some of which are hilarious and others that will make you squirm. Also, Vidhya Balan shows a lot of cleavage and bares her midriff way too often (I say this because her midriff will also make you squirm). But beyond the sex scenes and body exposure, does the movie really present anything new or interesting for Bollywood? My answer is no. I walked out of the theater with the feeling that the movie missed the chance to be compelling and lacked the cohesion and precision of a true \"hit\" movie (I just watched Rockstar, by the way, which WAS an epic, compelling, powerful movie). The second half, especially, was very disappointing. Sorry, but the overly sexual theme and explicit language does not, by itself, make this movie deserving of a high rating.\n\nThe movie is watchable, and is at times funny. Vidhya Balan is the star of the show. She remains at most times a lovable and fun character. My guess is that movie watchers will fall into two camps: those that love the \"entertainment\" of the sex scenes and occasional funny moments, and those that expect much more from a movie. Because I fall in the second camp, I cannot rate this movie higher than a 4."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "bilal-farooq009",
        "review_rating": "10",
        "review_title": "Its the time to get Dirty with the Dirty Picture.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "lagan_kool",
        "review_rating": "1",
        "review_title": "Very Pathetic",
        "review_detailed_main": "Absolute non sense and cheap movie making. Don't waste your money, time and energy on such a miscalculated take on Silk Smitha's life. So sad I went to a Cinema Hall to watch something which in my correct senses of mind can never be called Cinema, this movie is absolutely non sense and nothing but Vidya Balan's fat being on display almost throughout the entire period of the movie. What a turn off this lady can really be. The Dirty Picture as its name suggests is really a very very dirty movie, cheap, not erotic rather an opposite. Please don't watch it until you really want to torture yourself. Such a sorry the great Naseeruddin Shah is a part of this movie although he played his character well.."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "pramitmaity-249-642776",
        "review_rating": "9",
        "review_title": "Entertainment, Entertainment & Entertainment",
        "review_detailed_main": "\"Three things make a film run: entertainment, entertainment and entertainment. And I am entertainment\". Silk's words of wisdom, spoken with a naughty glint and a seductive smile by Vidya Balan told us the definition of Milan Luthria's \"The Dirty Picture\". The rumor is that the film is based on the life of Silk Smitha, who is sought-after actress of 80s. But the true fact, this film is inspired from struggling female actors of 80s in male dominated society of India. The Dirty Picture not only enhances attention to the life of the sex goddess, but also makes us responsive tragedy behind the illusion.\n\nThe film is based on the life of Reshma (latterly \"Silk\") who provides thrill to millions of audience. To the world she is the queen of sensuality. But at heart she is just another woman who loves her mother most. It's a journey from Reshma to Silk. It's doesn't take her long to storm the box office as \"Silk\", the sex symbol of India. Apart from Silk, Abraham (Emraan Hashmi), Suryakanth (Naseeruddin Shah) & Ramakanth (Tusshar Kapoor) plays a vital role in this film. From the world of stardom Silk moves to the world of darkness. Her list of worshipers and lovers keeps multiplying, until it's downhill time. Finally unable to tolerate the depression and failure in life, she has killed herself by consuming sleeping medicine.\n\nOn the whole \"The Dirty Picture\" is well narrated and wonderfully executed, with electrify and sex value. It's an exceptional story of an ordinary person's rise from strike to extraordinary heights and later fall. And yes the movie has \"entertainment, entertainment and entertainment\"."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "hassam_a_malik",
        "review_rating": "1",
        "review_title": "This is a piece of crap, sorry.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "bobbysing",
        "review_rating": "8",
        "review_title": "A brave & bold masterpiece showcasing 'Life As It Is' with its four aces - an exceptional script, an intelligent direction, fabulous dialogues and an extraordinary Vidya.",
        "review_detailed_main": "To start with, there are very few films made (especially in Hindi Film Industry) with sheer honesty and sincerity, showcasing \"Life as it is\" on the celluloid. And THE DIRTY PICTURE can easily be included in the top bracket of such films which dare to hold back nothing, showing you the dark side of the game as it is without any hiding. Reportedly inspired by the life of South six-siren of 80s, Silk Smitha, it literally transmits you to the era of sex-oriented films made in the 80s with all those catchy songs heavily relying on their meaningless words and sensual dances with vulgar steps.\n\nThe film starts off with a bang, forcing you to look around in embarrassment. Yes, that's the word, as many viewers might not take it sportingly, the way Vidya hits them real hard below the belt, just within the first 5 minutes of the film. And then SHE along with her director takes you on to a sexual, shocking, hell of a roller coaster ride till its declared Intermission on the screen. So apart from those who might find it objectionable, rest all are sure going to have a great time in theater with Vidya in this first half. Post interval, its all about the more darker realms of the entertainment business where the celebs are moving towards their downfall.\n\nSet in the South Film Industry and its surroundings, TDP is like a NAKED TRUTH brought on to the screen with utmost sincerity and honesty. With THE DIRTY PICTURE, director Milan Luthria and Viday Balan take you back in those shady days, revealing many inner truths of the film world which sadly did exist in our industry 'as it is' in those years. Unlike today's world where even a child can see any Porn Stuff on his computer available free over the internet, in those days people used to get over excited seeing any such song or movie in the theaters.\n\nComing to the four aces, which make TDP a must watch for all, the first one undoubtedly has to be the bold and extra-ordinary performance by Vidya Balan. The girl not only shocks you with her unexpected moves but also blows you over with her remarkable, flawless performance as SILK. This unarguably can be termed as the most dangerous move of her career where she otherwise was known as the girl best suited for Indian traditional roles. To justify what great magic she has done on the screen, I can only quote a dialogue again from the film itself which says, \"Yahan Stars To Bahot Hain Iss Industry Mein, Par Actor Bas Tu Hi Hai\". Hats off to you Vidya, for showing your mettle in this \"Image Driven Industry\"\n\nThe second ace of TDP is its full of life SCRIPT by Rajat Arora, which entertains the viewers in its first half and enlightens them in its second. Though many would not like to appreciate its second half with the same spirit (as said before). But for them I would like to say that its just like what happens to SILK in the movie. When she is hot and sizzling, burning the screen\u0085\u0085.you like her (Pre-Intermission) but when she is torn, with dark circles, a fat belly and not able to entertain (Post-Intermission)\u0085\u0085.you get bored.\n\nAn intelligent, entertaining yet thoughtful direction by Milan Luthria is the third ace of the movie which needs to be applauded a lot for even thinking of choosing this unusual subject for his film. With THE DIRTY PICTURE, Milan excels himself and the film brings him forward in the list of more respected and renowned directors of the industry, unarguably.\n\nThe fourth but a very important ace of the film is its splendidly written Dialogues which keep you glued to the screen in such a way that you don't want to miss even a single line said by any character on the screen. In fact the dialogues of TDP just play as another lead HERO of the film adding to its entertainment value in a big way.\n\nBut here apart from these four aces, I would like to mention a Joker- Card of the movie played by its Costume Designer (Niharika Bhasin Khan), Dance Director (Pony Prakash Raj) and Music Directors (Vishal-Shekhar). Especially I would like to praise Vishal-Shekhar for their great understanding shown in the arrangement of the score using the same style and instruments used in that decade, particularly in the track \"Ooh La La\" which is full of energy and has already become a Big Hit.\n\nIn the supporting acts, Nasseruddin Shah plays the ageing South super- star elegantly along with a pinch of over-acting as required by his role and he is simply perfect in that. Emraan Hashmi deserves praises to accept this role where though he is narrating the whole film but still has got very less screen presence if compared to his present solo hero status. However its Emraan only who gets the most positive points in the end being a silent admirer of SILK. Tusshar once again impressively plays the sweet guy who also becomes cunning with the change in circumstances. Anju Mahendroo is great as the influential lady journalist and Rajesh Sharma is outstanding as SILK's first producer.\n\nIn all THE DIRTY PICTURE has got everything to entertain all kinds of viewers in different regions. It has sex, it has shocks, it has a script and has entertainment in full dosage to give you worth of all your money spent on it. It also made me recall a great World Cinema Masterpiece called SUNSET BOULEVARD (1950).\n\nBut here I somewhere also feel that through TDP, its producers, director and Vidya herself in one way has used the same SEX again to get their own share of success at the Box-Office, just like SILK did in her own days. So they too remain the culprit here in the ugly game."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "harsha-zamil",
        "review_rating": "5",
        "review_title": "diry picture is vidya balan only not the film",
        "review_detailed_main": "First half of the film was good.vidya baln and nasarudheen shah made it well. but second half went lagging like award film.unwanted songs,scenes.very lagging which made it bore for the viewers. story was good but the director could have made it shorter. sexy appearance of vidya balan OMG i don't have words to say.vidya balan what an acting.she made it beautiful.the three things of this film is VIDYA BALAN VIDYA BALAN AND VIDYA BALAN... TUSHAR KAPoor is waste for the film.... DIRECTOR could have given more role to emraan hasmi in 2nd half. diry picture gave interest for the glamour and sexy looks of vidya balan and also the hot and excellent performance of vidya balan... THOSE WHO interested in that can watch the film and get DIRTY...."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "kalonsumit",
        "review_rating": "8",
        "review_title": "The beauty of this dirty picture lies in its approach",
        "review_detailed_main": "The movie can be seen from two aspects. First, which is quite obvious, is that movie revolves around Silk (Vidhya Balan) and her bold, meaningful double meaning dialogues. Second, the way movie has been made, that is, the life of Silk narrated by Ebraham (Emraan Hashmi). The movie does not depicts only the Silk's life. It's more than that. It's about how Silk and Ebraham tussle with each other and their fight with the outer world keeping their respective principles, which are entirely opposite. And then transforming of Ebraham as he understands the Silk's reasons for her such behavior. This Bollywood movie's approach is in a way similar to Hollywood Movie \"Insomnia\", where movie was not about the investigation case or the suspense in that. It was about two persons suffering from insomnia because of their own reasons which were opposite. I hope that if THE DIRTY PICTURE would be seen in that light then you would definitely find it well woven.\n\nThe dialogues are amazing, performances are bold. And all this coupled with the movie's approach, I give this movie 8 out of 10"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "mmithun",
        "review_rating": "2",
        "review_title": "dud after much hype",
        "review_detailed_main": "i had much expectations about this movie...first half is OK....where u get to c how silk becomes star out of nowhere...the lady has been presented in sensuous way...indeed she is a vamp...but second half is boring....during second half i felt getting out of the hall...but climax is heart touching... the song oh la la has made me ...ohhhhh.....lalalalllalala...rolf...the only person who gonna get name from this movie is leading lady herself....i am sure their will be more offers coming for her in the future... i just want to say to those who are planing to watch this movie...don't watch it in multiplexes...its waste of money..choose some low grade cinema halls around you.. don't get offended.. have fun"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "zariwala",
        "review_rating": "10",
        "review_title": "Best bollywood movie of 2011, slow sometimes in 2nd half",
        "review_detailed_main": "Best Bollywood movie of 2011 The song ooh la la is amazing..reminds me of the industry in the 80s. The actress Vidya Balan deserves a national award After Madhuri Dixit, Kareena Kapoor and RaniMukherjee, Vidya is the actress in Bollywood who can actually ACT The Hindi dialouges are amazing!\n\nThe movie is based on the seductress actress named Silky Smitha who played a sensual role in the Hindi movie \"Sadmaa\".\n\nVidya Balan gained a lotta weight for this movie, though she was already on the heavier side, but flaunting ones paunch is not anybody's game. I do not think that any other actress would have been able to do justice to the role like Vidya did.\n\nThe dance competition song was stupid and uncatchy and wasn't required at all. They could have roped in a better actress for Shakeela who is in fact very fat in reality but in the movie she is slim trim.\n\nI wonder why Ekta takes Tushaar Kapoor, he is such a bad actor and looks horrid. Tushar should have been replaced by some other actor as he is the only weakest link in the movie. He just can't act and doesn't look like a hero or even a side artist. This home production must have excluded Tushaar.\n\nBut Vidya balan is flawless"
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "hs_101",
        "review_rating": "1",
        "review_title": "Vidya has always been a fatty",
        "review_detailed_main": "Vidya Balan actress has always been chunky. So I don't see why the fuss about her gaining weight. When has she been skinny? fair enough if it had been a skinny actress gaining loads of weight, that I could understand. but an already big actress gains more weight for a movie and all of a sudden it takes guts. am i the only one who can see that? i don't even think vidya can act very well. shes more suited for south Indian movies than bollywood ones. and shes not very pretty either. the movie and story line was below average. people have made too much out of this movie. or maybe the title made everyone get over excited for no reason. i wouldn't bother watching the dirty picture if i were you. a complete waste of time."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "crossbow0106",
        "review_rating": "9",
        "review_title": "Absorbing, Tense At Times and Essential",
        "review_detailed_main": "Before watching this, I only watched one Silk Smitha film but have read about her, how by ramping up sexuality in film she was both lusted and reviled. This film stars the immensely appealing and capable Vidya Balan as Silk, a young lady seeking fame as an actress. At first discouraged, her turns as a sexy item girl to actress make her both famous and infamous. Remember, this is India, not Hollywood, so in the film she constantly pushes the envelope of decency and sexuality in film. This works against her eventually, which gives the film its tension and best, though sad, scenes. The acting is all good, but Ms. Balan is a revelation. Whether loosely based on Silk Smitha or not, the story itself keeps your interest, with the direction being crisp and paced well. The bigger the screen, the better the film will feel. Enjoy."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "cobipal",
        "review_rating": "5",
        "review_title": "Dirty Silk is in the House.....",
        "review_detailed_main": "Me being a South Indian does know that Silk Smitha the girl that Vidya portrayed in the movie was totally DIRTY and this Vidya Balan has done to boundless perfection. It couldn't have been done better than any other. Kudos to the Director for shooting vividly and seamlessly the life of South India. I must say it was ENTERTAINMENT, ENTERTAINMENT AND \"MORE\" ENTERTAINMENT. Naseruddin Shah(hope I got the name right) played his role brilliantly mimicking that of a South Indian Tamil actor. The oldies and the old times come to light in this movie and you kind of feel nostalgic, that is if you have seen them oldies. Brings back memories of Silk for me in no better way than this picture \"THE DIRTY PICTURE\""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "marndibiswa",
        "review_rating": "9",
        "review_title": "May be just short from being an epic biopic",
        "review_detailed_main": "The first expression that comes after watching dirty picture is 'wow'. Man did they pull it off -they actually outdid to anyone's expectation. The film's done with the heart in its right place and in a great mind.There were big doubts when the first trailers promos arrived. The name of the film itself drew a lot of negative retaliation in the mind. But whatever the story offers you is by far the best you get in the whole year.\n\nFrom the beginning itself the story is gripping. The narrative so great it doesn't pass you by in the proceedings but it immerses you in the depth of the character 'Silk'. In all logic and dignity we get to know Reshma not some B grade voluptuous bombshell Madrassi actress. Hats off to Vidya Balan , not that there was any doubt that she would do any injustice to the character but she has definitely shown that nobody is like her in the industry. From the guts of accepting so demanding role to gain oodles of weight for the sake of it is definitely gratifying. If not her in the scene there is always Nasiruddin Shah, Tushar Kapoor and Imraan Hashmi who surely don't let the tide ebb. All three make there screen presence evitable especially Imraan Hashmi as 'Ibram' is quite an endearing character.Still am missing the great roles from 'Nyla',Silk's mother and Surya's wife all are memorable and defining for Silk as well.\n\nThe most astounding part of the film still is tits script. Though loosely based on real character biography could never have been this colourful on screen. As lots of us have felt biopics to be dim and gloomy this is not the same fare. Moments of disparity prevail in the movie but the pacing and the dialogues just fill in your appetite. Some dirty dual talking in the first half to the great shayeris in the second half this is filled with memorable dialogues.\n\nGreat lines great acting what more can now a days we ask or but still this got more than that. Definitely Silk fires the screen each time she enters but we are talking about the technical details the film has stood by. Absolutely astounding sound design of the 80's and aptly built production design and set pieces. The film shines in every category. Surely the film comes with warning but it is still a must watch."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "sribornagain-394-460163",
        "review_rating": "5",
        "review_title": "It is a \"Dirty Cinema\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "ramanathan999",
        "review_rating": "8",
        "review_title": "A Must watch movie",
        "review_detailed_main": "The movie was a pleasant surprise from the rigmarole of movies released recently by the bollywood and Hollywood.\n\nIt triggered emotions of awe, surprise and sadness. And 'No' its not a sensual movie. Its well directed and the lead of the movie has been played brilliantly by Vidya Balan. She even makes actors like Imran Hashmi look good on screen.\n\nThe first half of the movie was better than than the 2nd half. Give it a 9 & 7 for each half.\n\nSee it and have fun. No sensuality, and i would recommend it as a family movie."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "anuvrat-bhansali",
        "review_rating": "",
        "review_title": "Have You Felt Silk Lately? No! Try a Half Porn Star.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "Vivekmaru45",
        "review_rating": "1",
        "review_title": "This film PROVES all BIG ACTRESSES are PROSTITUTES and PROSTITUTES are BIG ACTRESSES",
        "review_detailed_main": "What a PARADOX! And its true 99% of the time.\n\nThis film is inspired by the real life escapades of sexpot actress SILK SMITHA. When I first heard her name I thought who could she be??? Then I googled her and remembered that scene from the Kamal Hassan Sridevi film SADMA.\n\nWho the **** cares about this ***** to make WHOLE FILM about her? They have to be the CRAZIEST PEOPLE IN THE WORLD.\n\nDUMB*SS PLOT FOR KIDDIES: Rebellious and uninhabited Reshma lives an impoverished lifestyle with her mother, Ratnamma, in 1980s South India. She is an ardent fan of film actor, Suryakant, and her one ambition in life is to meet and act with him. She runs away to Madras, and like, hundreds of young women, lines up outside Jupiter Studios to try and get noticed. With her plain, next-door-girl looks, she gets ignored but as fate could have it she is given a chance to play a minor role after she manages to sneak into the studios. The role exploits her as a sex symbol, driving males to the cinema houses to absorb her movements and beauty. Virtually overnight she, now renamed Silk, becomes a sensation, and together with the aging superstar, Suryakant, the one she had always fantasized about, she sizzles the silver screen with her sex appeal. Suryakant's brother, Ramakant, an author, is smitten by her - so much so that he would like her to opt out of movies altogether...\n\nDon't waste any MONEY or TIME on this STUPID NONSENSICAL FILM."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "too_cool_all",
        "review_rating": "10",
        "review_title": "If u hate vidya then go n watch the movie i bet u will love her SUPERB ACTING",
        "review_detailed_main": "i would not shocked if vidya gets best actress award in most of the awards function her role and ACTING is superb and before watching this movie i was confused because of vidya has a lead role coz i m big fan of imran bhai but then i decide to watch it and i was surprised to see the work of vidya though i don't like her face and still don't but the acting was superb and thus i will go and watch her upcoming movies too and yeah a little hint IF U R NOT A FAN OF VIDYA OR IF U Don't LIKE HER then you must go n see her i bet u will not regret so in short superb acting , perfect storytelling , beautiful colors , awesome dialogues , nice music and songs , and last but not least nice cleavage ."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "diwiboii",
        "review_rating": "1",
        "review_title": "This is a miss",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "cooljalz",
        "review_rating": "8",
        "review_title": "Entertainment, Entertainment, Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "myfamily1983",
        "review_rating": "3",
        "review_title": "Totally not worth the time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "anuj302",
        "review_rating": "9",
        "review_title": "Vidya Balan's show all the way",
        "review_detailed_main": "Although trailers were quite enticing to invite audience into cinema, the real film had top class acting of Vidya Balan and co stars along with dialogues and directing of Milan Luthria has made this a movie to be remembered for decades to come. In the same vein as a lot of women oriented movies. Purists will say too much of vulgarity- but was it vulgar? Vidya portrayed it with subtle variations and dignity - hats off for a great art work from a tragic real life story. The Dirty Picture is essentially Vidya Balan's film, all the way. She gives a towering performance as the protagonist who remains unapologetic about her life till the very end. The high point of her act is the fact that despite portraying a sex bomb, her sexuality never ever gets vulgar and crude. Instead, there is an endearing quality to her attempts to shock and awe a staid society that thrives on the fake."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "ayonbhunia",
        "review_rating": "5",
        "review_title": "Average",
        "review_detailed_main": "The Movie is average as it has shown that people who enjoys the dirty character,they didn't accept it later ! Tho this movie is around 9 or 10 years ago but I think this kind of movie is still being made for people acceptance ! Overall the is not so not so good ! 2.5/5."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "Suryanarayanan",
        "review_rating": "10",
        "review_title": "Movie is awesome,Dialogues are out of the world.",
        "review_detailed_main": "I would like to kiss the hands of the writer,i watched the movie twice, just to enjoy the Dialogues again. Vidya Balan has mixed the lust,innocence and the rage with perfection. What a brilliant piece of acting. Music is classic,it gave the flavor of \"Silk\" in the Tamil movies of the 80's. I have to say that i was screaming loud for the song \"Nakka Mukka\",it was the first time i was hearing the song and now i am a big fan. The script is written and executed very well, it brings out the feelings of a rising and a falling Star. I could feel the pain of the character, and thats why i must say the movie is exceptionally good. The humor in the movie is terrific, thanks to \"Surya Sir\" (Naseeruddin Shah), he is simply amazing. \"Abraham\" (Emraan Hashmi) and \"Keeda Das\" (Rajesh Sharma) have contributed well in building the drama. Life behind the scenes has been portrayed very well,the movie stands up to the expectations,it has got the lust factor,it has the rage,it has the humor,it has the drama."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "mannuskyhigh",
        "review_rating": "9",
        "review_title": "Vidya Balan steals the show - Completely !",
        "review_detailed_main": "I saw this movie recently and there is no doubt that Vidya Balan Steals the show completely. But there is more to her bold skin show, non stop sexually filled dialogues, and fake orgasms. She lives a woman who is determined to make it big at any cost but she has a heart too. She is in love with an ageing superstar who is already married and set new records in affairs with women. She also comforts his brother who apparently is in love with her, but fails to understand her when she hits low. She is a center of hatred for a Director because Initially she is held responsible for destroying his career. But Little does she know that she holds a special place in his heart which later turns into love and he becomes her real 'Man'.\n\nOK let me tell this straight, The Dirty Picture is not an extraordinary fare that can it a memorable film for decades. It has its share of flaws and sometimes it goes beyond to provide shock and sex value. There is nothing new that has not been presented on screen before. But What makes it a delight to Watch is Vidya Balan, Naseeruddin and Emraan of Course. But I can understand very well the intentions of filmmakers that they had to put the entertainment value to receive bonus points. The same thing Naseer says to Emraan in the movie that 'Good Movies can make names in film festivals but can't get success in theatres.' Because they need masala. And which is exactly the reason reviewers have been a little hard on the movie but it a got thumbs up from the audience. Mission Accomplished LOL !\n\nI read some reviews where people said that Emraan - Vidya's track slows the narrative and is boring. I completely disagree on this. When you watch the movie then you will realize that Emraan's character has been perfectly matched with Vidya's character because at the end he was the only one who could understand her but he couldn't propose her. The time Silk realizes when she is in love she gets doomed. That's life, That's tragedy. There is no sudden change of heart, Silk always had a place in his heart but he showed his hatred in public only. He was smitten by her beauty but her speech at the award function makes him realize that she does not do all this intentionally. Its what 'they' wanted to her do - they stands for the filmmakers and the audience.\n\nAnd I also would like to disagree with people who ever calls Vidya vulgar or offensive. Because She is the only one which brings class to the show. And I think the reviewers on IMDb who has written her cheap, turn off etc must be hired by Kareena Kapoor, Priyanka Chopra and Katrina Kaif. Vidya has been showing middle finger to these ladies for three consecutive years. its high time that these ladies first learn to act in their movies. Coming to Vidya again, she is marvellous because she has surrended herself completely to the director which is a very brave step that any actress would think twice or thrice before doing. But having said this, she is dignified. Watch her in the scenes where she exposes the mindset of people and dirt at the award function. The scene where she performs in a song with the hunter to get attention. Her scene with Emraan in second half on the beach where he starts to like her. The scene where she stops the traffic to destroy the journo's party although kissing the lame Tusshar Kapoor was a turn off, but superb scene in total. Vidya does a 'manly' job in the movie which is admirable at the same time demands a standing ovation. Please watch it for Vidya, She just doesn't bare it all, she performs too with Conviction."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "shaanmenon",
        "review_rating": "9",
        "review_title": "The Dirty Picture is not Dirty at all....",
        "review_detailed_main": "It is commonly believed that heroine (read women) oriented films are never a guarantee for success, especially in Bollywood. But here is one movie that is out there to prove us all wrong. 'Dirty Picture' is a look back at the 1980's when plus-sized heroines as well as dance-girls posed as sex-sirens on the screen ensured a movies success. The southern Starlet Silk Smitha was an undisputed queen of this crowd and this movie was a good attempt at focusing on her life and times .\n\nPic Courtesy : Chitramala.in\n\nDirty Picture is a semi-biography of sorts about this actress who used her oomph and sexuality to good measure, leaving men panting, and marking her presence in Tamil movies as an instant guarantee for cash registers ringing. Vidya Balan, who is otherwise known for her non- conformist and clean image, plays the role of Reshma or just 'Silk' to good effect in this thought provoking film. At these times, when her peers are running after size-zero, Vidya Balan is gutsy enough to add 12 Kilos to and flaunt it too.\n\nThe Story\n\nThe story follows Reshma (Vidya Balan), a run-away bride, landing herself in a Movie set asking for a role . She is turned off from the sets for being ugly and IN-glamorous. She is resolute to make it big and continues her struggle until she gets a role as a female dancer complete with pouting lips and revealing attire. The raunchy song becomes an instant success, and thus was born 'Silk'. Through out her life, many men fill in her days only to cause distress and those include her childhood idol Suryakant (Nasiruddin Shah), RamaKant (Tussar Kapoor) who is the brother of Suryakant. Ramakant genuinely loves Silk and wants to marry her, but his parents are embarrassed by her wild ways. Abraham(Emraan Hashmi), is another person who enters Silk's later life and it is Abraham who stays till her end helping her mother to cremate her dead body in the finale.\n\nThe story basically is about Reshma(Silk), from being a make-up girl to her rise to stardom, and ultimately to her tragic death by swallowing sleeping pills. It is the story of a woman, who had a care-free attitude, and lived her life without thinking twice Dirty Picture is also about the portrayal of women as objects of 'Entertainment' and how women start accepting this as a way of life. Silk ultimately had to succumb to the society's bad-mouthing and exploitative nature.\n\nDirty Picture is basically a tight rope-walk between the sensual silk and her life as an exploited woman. The movie Shows her short-lived rise to fame as also the contradiction of her as the object of male fantasy and her quest for love, only to find infidelity and unfaithfulness from the men she love. This catalysis her fall from 'grace' and leads her towards loneliness and ultimately to suicide. The film reeks of the apparent hypocrisy that exist in the society as a whole. She is crestfallen by this duplicity of being revered by the people whom she feeds with her sexuality, but the very same people, wearing a mask of bogusness, is ever ready to put a question mark on her character.\n\nMy Take\n\nAll in all, the movie is pure entertainment, intertwined with humor (not at all crass) and mimicry of the old times. Vidya Balan literally lives the character and does full justice to the role of Silk and carries the film from start to finish. Having given the job of playing a sex-siren, Vidya Balan carries it wonderfully, and never makes her character look vulgar on screen. Instead she oozes sensuality. Nasiruddhin Shah is wonderful as the aging superstar and having given the brief to mimic a certain style of acting which was prevalent at that time, he does it with aplomb. Emraan Hashmi and Tussar Kapoor play their part well and this is just another instance where Emraan shows us that he can act and very well indeed. Anju Mahendroo's cameo as the Fashion Journalist is worth mentioning. Just like the 'lady-in-the- lead', Dialogues are hard-hitting and is another attraction. The music is over-hyped and is an average fare. The good thing about the movie is that it is never judgmental anywhere about the life of Silk.\n\nThe movie is surely worth a watch, just for Vidya Balan's performance and will be a trend-setter of sorts, hoping that, this will inspire more movie-makers to try and experiment with women-oriented subjects. That would indeed be a real turn-around for Bollywood."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "silvan-desouza",
        "review_rating": "9",
        "review_title": "Superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "A-J2006_777",
        "review_rating": "8",
        "review_title": "A daring step !!",
        "review_detailed_main": "The Dirty Picture is a bold, fun, and super entertaining film!\n\nThe movie dives into the world of glamour and fame, and the erotic scenes feel natural, adding to the character's story instead of being over-the-top. They show off Silk's attitude and daring personality in a way that makes sense for the plot. It's not just about the boldness, though - there's a lot of drama, emotion, and humor that keep things interesting. It's got a great mix of glam, passion, and real feelings, making it a must-watch for anyone looking for something different and daring.\n\nOverall, a good and thrilling movie to watch."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "nadkarnisumeet",
        "review_rating": "8",
        "review_title": "Milk Smitha!!",
        "review_detailed_main": "The Dirty Picture review:\n\nA semi biopic on South siren Silk Smitha; The Dirty Picture showcased the rags to riches and back to rags saga of Silk (Vidya Balan) detailing her affairs and sexual escapades through her (in)famous filmography.\n\nKangana Ranaut was the first choice of director Milan Luthria but she declined the offer and then Vidya Balan came on board. Balan put on weight for the buxom character she was playing and also smoked ciggies just to get in to her character. Her performance was outstanding to say the least and she rightfully walked away with all the awards that year - from National to Filmfare!!\n\nThe male leads were no less and I loved Naseeruddin Shah's Suryakanth which was loosely based on certain South superstar of that time. Emraan Hashmi sprung a pleasant surprise as the acclaimed director who initially hates Silk but later grows to love her. One can see a hint of mentor Mahesh Bhatt in Hashmi's performance though the character is not based on him. Tusshar was reliably restraint as Suryakanth's brother who has a short fling with Silk. Rajesh Sharma left an impression as the symathetic producer whom Silk loves to call 'Keedadas'.\n\nBappi Lahiri recycled his Mawaali (1983) song \"Ooyamma Ooyama\" in to \"Ooh la la ooh la la\" which became a huge hit amongst youngsters. The dialogues were also filled with punchlines which evoked loud ceetis at G7 Multiplex, Bandra where I saw the film in its second weekend.\n\nIn one scene, Vidya's Silk utters a line \"Entertainment Entertainment Entertainment!!\"; that sums up what Bollywood is all about. Its what this film offered aplenty and something every movie must have in order to be a success. No doubt!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt1954206",
        "movie_name": "The Dirty Picture",
        "movie_rating": "6.6",
        "review_username": "salsabilaummay",
        "review_rating": "8",
        "review_title": "Showing reality",
        "review_detailed_main": "It's a good movie.bidya balan has shown very bold scene that is why i ignored it but now after seeing it i realised it is showing the reality of men. They do all these bad things and characterless inside but want to show off that they are good people"
    }
]