[
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "ne12cbina",
        "review_rating": "8",
        "review_title": "Superb Movie!!",
        "review_detailed_main": "It was really funny!! Baburoa played by Paresh Rawal was superb, and so was Akshay Kumars character, although Sunil Shetty'z character didn't shine through as much as in Hera Pheri!! The Chemistry between the three was great to watch, the characters haven't changed in the way they act they still get themselves into trouble and this time round they get into such a big mess!! I cant say that it is better then the first one because the Original is always the best!! Overall i believe that the film is good to watch and my comment is only based on the first time i watched it so If u ain't seen it GO 2 c it or get it on DVD when it releases because it definitely will have u kneeling over with laughter!!!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "manupande-33152",
        "review_rating": "8",
        "review_title": "One of the best comedies",
        "review_detailed_main": "This movie will make you laugh throughout. It lacks a good story and ending."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sweetsudaa",
        "review_rating": "8",
        "review_title": "A good laughter",
        "review_detailed_main": "Its indeed first is always first but the 2nd one really shocked everyone as it was no where near 2nd part of Mallu movie Ramji Rao Speaking...and all the credit goes to Neeraj! Not to forget the Hera Pheri 1st where Paresh himself mentioning after receiving the best actor award...that the credit goes to Neeraj as Paresh is a total guju guy and due to Neeraj..he could project the marathi guy in 1st movie..all credit goes to the script writer and his perception as even the director directs but the key sense to the soul is the script writer..and I would say being a 2nd it really bags the credit for what it has done! A movie which will chuckle your bones and you don't worry about anything when you are driving back to home... Kudos to Neeraj the comedy king Cheers"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "rohitrc-51763",
        "review_rating": "10",
        "review_title": "Bollywood's Best Comedy Movie of All Time",
        "review_detailed_main": "This is the best comedy movie of all time. This is that kind of movie which you can watch 100+ times without getting bored. You can't miss to watch this movie."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Sauvik",
        "review_rating": "6",
        "review_title": "Has anyone seen Lock, Stock and Two Smoking Barrels?",
        "review_detailed_main": "This has to be one of the overrated disasters of this year. The original Hera Pheri had a refreshingly new plot, \"desi\" settings and ample doses of situational comedy.\n\nBut this one fails to even come close to the original. I am pretty sure that 95% of the people who will watch this movie have never even heard of \"Lock, Stock and Two Smoking Barrels\". For the uninformed, this is a stylish Brit comedy by Guy Ritchie and is simply amazing. If you ever get a hold on this movie then watch it.\n\nSome of the scenes, plots and situations have been mercilessly copied by Mr. Vohra for his latest film hoping that the ignorant Indian movie goers will love it. Well, he succeeds to some extent. The problem lies in the adaptation. While \"Lock, Stock...\" is set in Britain with their 90s way of living, the director did a bad job in transposing the settings to modern day Mumbai suburbs. Surprisingly, (well not so surprisingly) even the last open-to-interpretation scene of \"Lock, Stock...\" has been photocopied.\n\nThe dialogs aren't as strong as the original and the director/writer tries hard to impose series of slapstick humor in order to save the movie. And how could I forget those unbearable minutes where one wonders who in the name of God has composed/written/sung this song? The only saving grace are the three lead characters \"Raju\" (Akshay Kumar), \"Ghanshyam\" (Sunil Shetty) and \"Baburao\" (Paresh Rawal). These guys seemed to have mastered the art of comic timing with extra \"Bananas\" to Paresh Rawal. Most of the actors did a pretty decent job but I felt that some of the characters were wasted.\n\nThe reason why it gets a 6 is because of the acting and because of director Neeraj Vohra's courage to make a sequel to a cult movie albeit slaughtering Guy Ritchie mercilessly.\n\nPlease go and watch \"Lock, Stock and Two Smoking Barrels\". If you are unable to get hold of a copy, try \"Hera Pheri\" instead."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "jd-41689",
        "review_rating": "10",
        "review_title": "PHIR HERA PHERI IS BOSS OF AKKI'S COMEDY FILMS",
        "review_detailed_main": "This film is an epic and absolute comedy with numerous rib-tickling moments.Akshay kumar,Paresh Rawal and Sunil shetty are perfect as the three leads who enter into trouble due to money's greed.Johny lever,Rajpal Yadav,Rimi sen,Sharat saxena,Manoj joshi and all other supporting actors add even more fun and comedy to the film.Last part evokes greatest laughter.ENJOY!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "kathuria_nidhi",
        "review_rating": "",
        "review_title": "Phir Hera Pheri- Phir Paisa Vasool!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Electric_Sheep",
        "review_rating": "6",
        "review_title": "Not upto the mark - good fun though.",
        "review_detailed_main": "After the unprecedented success of Hera Pheri, here is more of that good stuff.\n\nPros : Once again its great to see this unexpected together. The chemistry remains top notch. The 3 characters have heavy roles with their own wizardry to match them. Akshay is suave, rich yet left wanting for more. Sunil remains the good man with the standard pessimistic approach to Akshay. In the middle is Paresh Rawal and bundles of humour.\n\nThis plot is set off promisingly with a concept of having gained, lost all and now trying to get it back! :)\n\nCons : - What made Hera Pheri amazing was the original dialogue and interaction between the characters and how the final story tied itself well with the sub-plots. This is not so here because the director decided to lift the latter half of the story from \"Lock Stock and 2 Smoking barrels\" which is a big shame because the story only gets confused and dragged into the region of \"when is this going to get over\"\n\n\n\nStill fun to watch if one does not have very high expectations."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "shahansr",
        "review_rating": "10",
        "review_title": "This Movie is filled with Memes and Catchy Dailouges 😆",
        "review_detailed_main": "I watched this film for over 30times and every time i liked it It's not the best film that ever made but it was the funniest film when i was a kid and still i can recall every lines from this movie"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Sparrowmaniac",
        "review_rating": "7",
        "review_title": "Sequel Success",
        "review_detailed_main": "Let me say the truth. Yes I was slightly disappointed with this movie. Though it is still Hera Pheri, the same characters, Shyam, the guy who always smells trouble, and the stupid Baburao Wapte, it isn't the same any more. Hera Pheri stressed on the common problems of the poorer class people of India. There was a lot of character development in the prequel, the three characters bonded with each other. Whereas this movie is basically a spin off for Raju(Akshay Kumar) and some nice comic relief from Baburao Wapte(Paresh Rawal). Shayam(Sunil Shetty) has basically no part to play. Also the number of characters in the movie makes it a lot complicated. Hera Pheri was simple with a few basic characters, whereas Phir Hera Pheri sends the audience on a cat and dog chase. This becomes terribly boring at times, and only Paresh Rawal shines through with his impeccable ability to play the fool. He lets you rolling with peals of laughter. The songs are decent, Bipasha Basu and Rimii Sen does a good job as the co stars to this movie. And it was a nice cliffhanger of an ending keeping the people pondering whether there will be yet another sequel to this or not ...\n\nIt should have been rated a lowly 5-6.. But only due to Paresh Rawal, it gets a 7... That man just gets better with each movie he makes. His ability to make you laugh is just impeccable.\n\n7/10 !!!! Chalate jao Paresh ji !!!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "kooleshwar",
        "review_rating": "5",
        "review_title": "A bad copy Lock Stock and Two Smoking Barrels but funny in parts.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "surajchaudhary89",
        "review_rating": "10",
        "review_title": "Epic Comedy!!",
        "review_detailed_main": "Best dialogues, Best Characters, Best casting, definitely the mood changer"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "xpics",
        "review_rating": "6",
        "review_title": "The movie runs on jet speed pace and you hardly get time to breathe, gasp, feel, absorb, react or relate",
        "review_detailed_main": "A sequel has its upsides and flipsides. The upside is that it can redeem on the recall value of the prequel and attract audiences to the theatres. The flipside however is that it has to meet the gigantic expectations of the prequel to satisfy the audiences sitting in the theatres. Most sequels turn a victim of this flipside. Phir Hera Pheri is no exception. When judged on its own merit, Phir Hera Pheri is a fairly entertaining comedy flick. But comparisons with the prequel, though unfair, are inevitable and that's where the film might disappoint to an extent.\n\nThe writer of the prequel, Neeraj Vora writes and directs this sequel. Vora manages to pull of the film from where it ended in the first part and also maintains connectivity between the two films. And since the characters were already established in the first part, he wastes no time here to go ahead with the storyline.\n\nRaju (Akshay Kumar), Shyam (Suniel Shetty) and Baburao (Paresh Rawal) who earn big bucks at the end of the first part; live a lavish life at the start of the second episode. But with money comes greed for more money. So in the greed to double their money, they borrow more money from underworld and invest it in a chit fund on the behest of Anuradha (Bipasha Basu). But the company turns out to be bogus and thereby they lose all their assets coming back to square one. From here on starts their attempt in paying back loans taken from the underworld.\n\nThe movie runs on jet speed pace and you hardly get time to breathe, gasp, feel, absorb, react or relate. With every alternate scene a new gang is introduced and by the interval point you have around a dozen mobsters linked to each other. The film is clustered with so many characters that you lose count after a point of time.\n\nWhile Neeraj Vora scores as a writer; to an extent, he fails as a director. On the writing part, despite so many characters to handle, he etches an interesting screenplay connecting all of them. Obviously you are not expected to think logically in today's comedies. Off lately, slapstick has turned out to be an easy alternative to tongue-in-cheek humor. So you don't have to exercise your brains cells when a circus gorilla (a palpable human in a monkey mask) is in pursuit of Johny Lever in the climax, as far as the duo makes you laugh. Or for that matter, don't think twice when the mastermind of first part, Akshay Kumar falls for a silly trap of doubling money in the second. But then these minuscule loopholes can be overlooked.\n\nWhat cannot be overlooked are the over-the-top loud performances. There's where Vora's directorial skills come into question in extracting performances from the cast. While none of the actors are bad, they are unnecessarily boisterous at times. Vora also ends up sketching caricature characters of a stammering gangster duo (played by Sharat Saxena and Ravi Kissen) to evoke humor. The humor is more formulated.\n\nWhile Vora overuses Paresh Rawal, he overlooks Suniel Shetty. Paresh Rawal gets the maximum gags and is ably supported by Akshay Kumar who compliments Rawal for a perfect comic chemistry. While showcasing the dumbness of his character Baburao, Paresh Rawal at times stretches the jokes too far and goes overboard. Akshay Kumar has a spontaneous comic timing, but off late with this similar kind of roles, he is getting typecast. However he's far better tickling the funny bone than indulging in emotional inanities like Humko Deewana Kar Gaye.\n\nPhir Hera Pheri essentially tried to use the original Hera Pheri pairing of Akshay-Suniel-Paresh as its USP. But post Hera Pheri; there have been so many films with the trio combination like Awara Pagal Deewana, Aan: Men at Work and Deewane Hue Pagal that there's hardly any novelty or a recreated charm effect when they come together here.\n\nOne aspect where the film is better than its prequel is that unlike Hera Pheri where there were half a dozen redundant forced songs and item numbers, in Phir Hera Pheri the songs don't intrude in proceedings and are kept at their minimal best runtime.\n\nPhir Hera Pheri does induce plenty of laughter. But you do feel that with a little more fine-tuning, it could have been even more hilarious. The extended climax is aptly set in a circus that brings the entire clown-cum-caricature cast together. The movie however ends quite abruptly, keeping enough scope for a sequel to continue the series. We just hope that the next episode gets better."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "SelvarajanK",
        "review_rating": "3",
        "review_title": "Comedy Without Laughter",
        "review_detailed_main": "Phir Hera Pheri stands separate among the so called comedy films with single meaning Sex dialogs. Because of the huge success of the earlier movie(Hera Peri), this might have to take a beating. The director does not have a strong story line to build on, But Niraj's brilliance is visible in patches. All he need is a good script where he can Improvise. He tries very hard to Improvise a script which has no base unlike Hera Peri, that why you get frustrated as the movie goes on. If not the perfect comedy movie its a decent movie for the entire family which is rare to see now a days. Among the actors \"Baburao\" & \"Thotla\" steals the show when ever you see them on screen. One problem with the movie I thought was it doesn't leave any impact on you that you can think of and laugh even for a brief period of your walk back to the parking area to fetch your vehicle."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "jaheenahmed",
        "review_rating": "10",
        "review_title": "Best Comedy film of all time",
        "review_detailed_main": "This was my very first Bollywood movie and it's my favourite comedy movie. The movie will make you laugh no matter how much you watch it will make you laugh every minute of the movie has a comedy"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "jainil18rathod",
        "review_rating": "7",
        "review_title": "Good but Not as great as the first one",
        "review_detailed_main": "This film takes place after the events of the first film. Raju, Shyam and Baburav, no longer poor and living in a mansion, are enjoying their lives without any incidents. That is until Raju once again receives a phone call that is supposedly meant for Devi Prasad. He receives an offer from a woman called Anuradha to double his money in 25 days. Of course, things don't go the way he was expecting and once again our trio is in trouble.\n\nLike many Indian comedies,there are many characters and several different plotlines going simultaneously. The movie handles most of these different characters and their motivations surprisingly well.\n\nThe Romantic subplot is the weakest part of the movie. Shyam falls in love with Anuradha simply because her name is \"Anuradha\" (his previous lover). This is probably the worst part of the movie. His obsession with her makes no sense. At least Raju's love story had some kind of build up. I guess you can't make an Indian movie without romantic subplots.\n\nRegardless, if you can ignore some of minor mistakes. This is an enjoyable movie. The movie ends with a cliffhanger but I doubt we are ever getting a sequel."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "akumbhar",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Sequel of Hera pheri Neerj vora hat's off ⭐⭐⭐⭐⭐ Best comedy franchise Waiting 3rd part. Akshay Sunil paresh (comedy combo) Akshay ⭐⭐⭐⭐⭐ acting"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "AishFan",
        "review_rating": "6",
        "review_title": "The trio are at it again!",
        "review_detailed_main": "Priyadarshan's team of Akshay, Suniel, and Paresh are at it again repeating the success formula of Hera Pheri! This time, Akshay falls for a scheme presented by a company that claims to double your money in 21 days if you invest with them. Others get involved such as a stuttering don, small-time thieves, kidnappers, drug smugglers, and a black market dealer creating one hilarious laugh riot. Of course, Paresh once again gives the funniest performance with his great comic timing. Songs are ignorable. The only drawback of the film is the climax scene, which is funny but is stretched out way, way too long and makes you wonder when this movie is actually going to end. The ending is a bit aggravating as it leaves you hanging, but I guess that was intentional as Priyadarshan wants us to watch Hera Pheri III!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "aqharoon",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Best comedy movie 🖤 really loved the acting of paresh rawal and akshay"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "ssst419",
        "review_rating": "",
        "review_title": "Doesn't take long....does it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "shovonbhattacharjee",
        "review_rating": "7",
        "review_title": "Great comedy movie",
        "review_detailed_main": "I already seen Hera pheri. I have to tell, this is not better than Hera pheri. Anyway this is also a very good comedy film."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "bboyforeva",
        "review_rating": "2",
        "review_title": "Where is the Originality?????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sagarempire",
        "review_rating": "10",
        "review_title": "Best comedy movie",
        "review_detailed_main": "The best comedy movie i have ever seen. Just the audio quality of some dialogue is not good, but beside that this is the best comedy movie. I watched this movie more then 100 times and never disappointed"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Sherazade",
        "review_rating": "4",
        "review_title": "You have got to be kidding me!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "amolrc",
        "review_rating": "10",
        "review_title": "One of the best comedy movie ever made... period.!!!",
        "review_detailed_main": "Surely one of the best not only in Bollywood but I can say overall... can't stop laughing watching this..each and every scene is epic..and yaa each and every scene every dialog is a meme nowadays...this movie deserves higher rating here.. people who rated this one low....I don't knw what was going on in their head that time..!!!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "skumarjha153",
        "review_rating": "10",
        "review_title": "Those who gave this masterpiece less rating is mental patient",
        "review_detailed_main": "This movie is perfect in every single aspect. The trio of Raju, shyam and baburao lit the screen by the performance of Akshay kumar, sunil shetty and Paresh Rawal and even supporting actors did legendary acting. Perfect 10/10"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "amitmardi-85726",
        "review_rating": "10",
        "review_title": "It's not a movie it's a emotion",
        "review_detailed_main": "This movie doesn't deserve rating this deserve only love. One if the best comedy movie ever made."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "ashray_koch",
        "review_rating": "5",
        "review_title": "Copy of Lock Stock & Two Smoking Barrels. But funny",
        "review_detailed_main": "It feels sad to digest the fact that a sequel of Hera Pheri (which was like a trend setter in the bollywood for its situational comedy )was lifted from Guy Ritchie's Lock Stock & Two Smoking Barrels.The movie is funny in some parts cos of its big list of comedians and it keeps us entertained from starting to the end cos of some fine performances from akshay kumar,sunil shetty,paresh rawal,johnny Lever and the other comedians . But nothing would justify it as the story is not an original one. I had a lot of expectations from this movie as it was a sequel of hera pheri. But the fact that it runs on a copied story is just not acceptable."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "anirudhsaini",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "I really don't know what Indian cinema has come to.This sequel is nothing compared to the original Hear Pheri and thats not it, its a total rip off of the English movie Lock,Stock And Two Smoking Barrels.The story, the scenes, even the ending is the same.Most people watching PHP have not seen Lock,Stock And Two Smoking Barrels so the director has got away with it.most of the comedy scenes too have used earlier in this movies prequel.The only reason for wathcin this rip off is because of Babu Rao (Paresh Rawal) for his expected excellent performance.The songs again are nothing out of the ordinary expect a few.All said and done this movie was a major diappointment and you can anticiapte every next scene as it is a reel to reel cop of Lock,Stock And Two Smoking Barrels."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "meetlv",
        "review_rating": "10",
        "review_title": "Evergreen movie",
        "review_detailed_main": "Comedy at its best movie from my childhood i still can't miss this on tv"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sarveshsinghtanwar",
        "review_rating": "10",
        "review_title": "I Don't have idea why so low rating on imdb.",
        "review_detailed_main": "It is the best comedy movie of all time. Ever dialogue is epic . This movie is full of meme material. Every single sec is enjoyable of this movie. I have watched this movie more than 100times."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "aayushredmi",
        "review_rating": "9",
        "review_title": "Best Comedy Movie Till Now",
        "review_detailed_main": "This is really masterpiece of comedy. Till date it is best comedy movie I have seen, although you can find some awesome memes on internet from this movie. Great Content."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "canidae-1",
        "review_rating": "1",
        "review_title": "What a shameless rip-off of Lock Stock and Two Smoking Barrels",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Krazzy4",
        "review_rating": "10",
        "review_title": "Best comedy film i ever seen after Garam Masala and Munna Bhai MBBS",
        "review_detailed_main": "Thumps Up- Akshay and Paresh 's chemistry and performance, decent music, directions, shared Susana, johny lever and rajpal were funny in some parts,dialogs, climax was mad funny, and first was fast then second half went slow....\n\nThumps down: bi pasha and rim mi sen were wasted, other supporting actors were also wasted.....\n\noverall super duper mega hit because of Akshay Kumar, parish's performance, dialogs and directions by niraj Vera......\n\nbetter then first 1 but niraj could've edit sum scene like circus.....lot of mess, twists, troubles and actors which made the film impossible to possible......film can be seen 100 times....."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Asifshaukat",
        "review_rating": "3",
        "review_title": "Cheap Copy of Lock Stock and Two Smoking Barrels",
        "review_detailed_main": "Don't waste your time and watch the original; so much better, this is a 3rd class copy."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "piyush-14791",
        "review_rating": "10",
        "review_title": "Best movie of the decade",
        "review_detailed_main": "I don't know how this movie got just 6.7 imdb. It deserve to be in 9+. No matter how many times you watch, you'll always find it entertaining and refreshing"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "abhi21297",
        "review_rating": "9",
        "review_title": "One OF The Best Comedy Movie Of All Time",
        "review_detailed_main": "GREAT GREAT Movie I Literally Burst Out OF Laughing Great Acting By All Of The Cast Specially THE Great Comedian We Have Its AKSHAY KUMAR PARESH RAWAL The Chemistry Between Three OF Them Was Superb It Will Definitely Change The Comedy Tradition IN India The Script,Direction,Cinematography,Editing,Techniqule Part And All The Cast And Crew Worked Really Hard For The Movie I Will Ensure That If You WIll WAtch THis Movie OVer And Over You Will Never Get Bored Of The Movie"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "deepsharmads-54815",
        "review_rating": "10",
        "review_title": "The best comedy movie have ever made.",
        "review_detailed_main": "From dialogue to costumes all damn funny and awesome and from Acting to screenplay so so amazing , I have watched so many time that I can tell each dialogue of each character."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "anirudh_shivaswamy",
        "review_rating": "5",
        "review_title": "What a waste of time and money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "pankajtecky",
        "review_rating": "9",
        "review_title": "Comedy movie of the century for me.",
        "review_detailed_main": "It's one and only akshay kumar show.NO one in this world could touch akshay in comedy."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "vebkumar",
        "review_rating": "1",
        "review_title": "Awful Sequel to a very funny movie",
        "review_detailed_main": "For those who don't know, this movie is a sequel to the movie 'Hera Pheri.' Hera Pheri was a truly funny movie. It's not that the humor was very sophisticated or even ambitious - the movie was merely funny at a very basic level. This sequel is perhaps one of the worst movies I have ever seen, and undoubtedly one of the worst sequels ever made by Bollywood (and that is an achievement!!!) Firstly, it seems that the movie was merely made to cash in on Hera Pheri's success (as opposed to say realizing that they could do more with the same characters).\n\nSecondly, as some people have noted, it's a total rip-off of 'Lock, Stock, and Two Smoking Barrels' (which is an excellent movie!) - even to the point that the ending scene is exactly copied!! Frustratingly, throughout the movie the copying is done with total non-application of mind, and this factor alone is worthy of the contempt that any self-respecting movie buff should have for this atrocious excuse for a movie.\n\nIt's really a pathetic situation here in India where soooooooo many movies are made by ripping-off movies from all around the world, and the vast majority of the audience are ignorant of this fact. This movie is just another illustration of this terrible state of things.\n\nGuy Ritchie, sue these guys!!!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "ranvijaysinghrajawat",
        "review_rating": "9",
        "review_title": "Best comedy movie",
        "review_detailed_main": "All time best comedy movie of last decade . All hail Legendary Trio , Raju ,Shyam ,baburao"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "amitshankhla0017",
        "review_rating": "10",
        "review_title": "Best comic movie of all times???? Yessssss 🤣🤣",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "kushalthakur-45720",
        "review_rating": "9",
        "review_title": "The package of laughter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "silvan-desouza",
        "review_rating": "1",
        "review_title": "First Successful but Worst sequel ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "rockinghrishabh",
        "review_rating": "10",
        "review_title": "A masterpiece",
        "review_detailed_main": "Songs, actors and story line a perfect combination. Awesome comedy scene & fun loving movie. Maybe one of the most Loved movie."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "HiddenVoice",
        "review_rating": "3",
        "review_title": "Overstuffed and over-hyped.A mess of a comedy as usual.The worst is always expected from Bollywood.",
        "review_detailed_main": "I watched the original film when a friend of mine lent me a DVD of the film.It was fun and entertaining.It doesn't focus on the characters or the plot well,and it's pretty much a mindless comedy and it was messy throughout.But nevertheless I liked it.It was the first Bollywood that I kind of enjoyed.Mainly because it had originality.I'd give that a mere 6.5 out of 10.Paresh Rawal stole every scene and Askshay Kumar(one of only actor that I admire,with Aamir Khan and Akshay Khanna for his performance in Dil Chahta hai only.No other actor is good enough.)proved early on that he can take the comedy genre well.His collaboration with the film's director made yet another mindless,silly,mess of a comedy,which was really fun and entertaining because of Akshay Kumar.Here it's a disaster.It's a showcase of how unoriginal and terrible Bollywood can be.\n\nNow a sequel to that film is out.I wasn't keen on watching this film.I didn't even had any expectations.I didn't even gave a damn about this film but I gave a look anyway.And the verdict,well,I would never say disappointing.It's an expression that you cannot use for a Bollywood film.Cuz a bollywood film can never be disappointing ,you can't expect anything but a terrible film.Before you enter a film you can always expect worse.And this is exactly what happens.\n\nI don't understand what the hype was all about.This was less a comedy and more of a mess.It's loud ,noisy,mindless,ridiculous and overstuffed.\n\nThe story is heavily borrowed,wait,copied from the Guy Richie's cult,Lock,Stock and Three barrels.Especially in the second half ,where the film borrows most of the scenes from that film.Both plot-wise, and scene to scene enactment and characters.It also borrows slightly from Snatch.And a few more Hollywood crime capers.And redoes the scenes from the original.\n\nYes,I enjoyed the original.It was ridiculously mindless and silly.But I liked it.There was originality in that film.Develops the story and characters well.\n\nHere,it's a mess.From beginning to end,it was all yelling,screaming and screeching noises.Dialogues were shouted out.The comedy feels terribly forced.\n\nIn the original,the three actors gave really funny and good acting and had great chemistry.Here,they try everything they can to make you laugh,but all they can do was pull off 3 or 4 minor laughs,1 or 2 actual laughs,and a couple of chuckles.The rest feels forced.It seems funny but it isn't at all.The actors don't seem to get along well this time.And even the funniest character ,which was called Babu Rau seems less funny than the first.He was annoying.Kumar and the rest were not funny.\n\nThe execution was all terrible.The first film's director should have returned.At least he would know how to make people laugh.The writer director has no idea how to make people laugh or what he is doing.\n\nThis is yet another over-hyped film.Bollywood has no celebrities.The actors are praised for no special reason.It's not the audience or fans that make them famous,it's actually the media,or TV shows that promote these actors.It's Bollywood who promotes these actors,praises them for no reason but to make people be aware of their actors all over the world.The audience don't even give a rat's ass.They're just there to kill 3 hours in the dark and then forget about it.They don't care about the actors,they've got far better things to do.They work.Bollywood is just a self-promoting industry desperately trying to do anything to get noticed.The actors don't even deserve the praise they get.They are not worthy of it.None of it is true.It's just a big stunt.The actors are turned into celebrities even when they have one dud after another.Just because they think the actors are good ,so they promote them.That's all they do.\n\nNow this film I heard was over-hyped,buzzed around the television.And was claimed to be the most original and best film of the year,just like KRRISH.And what do I see here?Nothing.All of it was untrue.A bluff.Another film called Chup Chup ke was rather better.But just as weak.It's made by the original film's director.But it was far better than this romp.\n\nThis is not a funny film at all.Only a few laughs and forced entertainment.It's successful back in its country because of its hype.A low class comedy that only favors the Indian people."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "taniton-53154",
        "review_rating": "10",
        "review_title": "Ton's of MEME",
        "review_detailed_main": "This movie will give this this much enjoy and laugh that you will regret you whole life"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Indianmoviebuff",
        "review_rating": "8",
        "review_title": "Best comedy of the year so far!! Hilarious",
        "review_detailed_main": "Phir Hera Pheri, the sequel to the most endearing cult-comedy of our times has released. I managed to watch it at a paid preview and here is my appraisal of different elements of the movie:\n\nParesh Rawal as Baburao: Of course you start with him. Baburao is the real hero of the movie. Baburao Ganpatrao Apte is one of my (I think a lot of people will agree with me here) all-time favorite screen characters and Paresh currently one of the best actors around. The way he says \"Devaa Devaa, Utalerey\", only he can do it. He gets most of the best punchlines and as expected delivers them flawlessly. Whenever he is on screen, which he is most of the times, the smile hardly fades from your face. He overshadows all flaws in the movie and any blemishes from others. Outstanding work by Paresh Rawal!! What an actor! Rating \u0096 A\n\nAkshay Kumar as Raju: Another fantastic job by him. He is fast becoming the new age comedy icon (if he has already not). There is never a dull moment with him around and he is just getting better with each film. After Mujhse Shaadi Karogi and Garam Masala another knockout performance by him. Check him out when he says \"Haaye Mujhe Sharm Aati Hai\" or in the maze scene during climax (which is a laugh riot) or the way he addresses Rimii with different names. Well done. Rating \u0096 A\n\nSuneil Shetty as Shyam: He is the quintessential action guy who is trying his hand at other roles. His comedy roles like in Hera Pheri, Hulchul, Awara Pagal Deewana have been OK. He is not really that great an actor at comedy (On second thoughts in any role) but still somehow manages to hold his own. Here also he holds his own, but he needs to improve somehow or will be reduced to playing inconsequential character roles (irrespective of whether you change the spelling of your name or not). Here he is fine and actually some of his shortcomings are overshadowed by others. Rating \u0096 B+\n\nJohnny Lever as Munna: One of the most popular comedians ever but he has not been in form in recent times. Here he is back in form as Munna a small time crook who wants to be big by robbing his earlier master. Some of his dialogues are funny. Only problem, his character could have been etched better. Rating \u0096 B+\n\nRajpal Yadav as Pappu: Another current favorite. Problem he does get much scope to prove his ability, but he has his moments. Rating \u0096 B\n\nBipasha and Rimi: They don't get much scope at all. Bipasha looks hot throughout but I think that is what she was required to do as her acting skills are ahem\u0085Rimi on the other hand looks lost. Anyway not much was expected from their characters. Rating \u0096 B\n\nSharad Saxena as Tiwari: Amazing performance!! As \"Totla Tiwari\" he is riot. He is the don whose money is conned (it's too complicated to explain here) and he expects our heroes to give it back. His character can't talk properly and his scenes with Baburao make you laugh your guts out. Rating \u0096 A\n\nThere are a host of comedians in the movie. But most of the others don't get much scope as this is entirely the story of Baburao, Raju and Shyam. Suresh Menon (Munna's spy in Nanjibhai's camp) and Manoj Joshi (Kachra Seth) are very good. Rating \u0096 B+ Bhojpuri superstar and one time Hindi film hero Ravi Kissen as Tiwari's henchman is also good Rating \u0096 B+ Dinesh Hingoo, Milind Gunaji, Razzak Khan are OK. Sunil Pal is wasted. The gorilla and the \"man with no visible head\" (or Qutb Minar as Akshay puts it) are fun.\n\nDialogues: Special mention for the dialogues. This movie has some fantastic dialogues. I won't spoil the fun by mentioning them here. Rating \u0096 A\n\nMusic: Himesh Reshammiya can do no wrong currently. Aye Meri Zohrajbeen is a fantastic number and the video is, you've all seen it on music channels, fantastic. The others songs are time pass.\n\nDirector: Satish Kaushik was supposed to do this movie but he pulled out and Neeraj Vora the writer has directed this. Considering his previous accomplishment as director (Khiladi 420 anyone), this is an amazing achievement. He has improved by leaps and bounds. It is never easy to direct a comedy that too a sequel and make a good job of it. A sequel always has to endure comparisons to the first part. This is not just another comedy but a sequel to Hera Pheri whose characters have now achieved cult status. There is never a dull moment. The movie moves at a very fast pace which gives you no time to brood over what is happening. Just enjoy the happenings as it is. What a job by Neeraj in this movie. Rating \u0096 A\n\nThe movie has some amazing performances and dialogues. There are some references to the first part like the song \"Golmal Hain Bhai Sab Golmal Hai\" in the background or the \"Dhoti Utaale\" scene. But it is still enjoyable. Certain characters could have been avoided. One jarring note was the climax. I didn't like most of it much but people around me were in splits, maybe it was beyond my sensibilities. It will no doubt be compared to the first part. Some will like it and some will not. But don't let the comparisons deter you from watching the best comedy of the year so far. Overall, it is complete time pass. Rating \u0096 B+\n\nThe way the movie ends leaves scope for another sequel (Maybe called \"Ek Aur Hera Pheri). Can't have enough of Baburao, Raju and Shyam, so bring it on.\n\nAppraisal Rating Definitions: A -- Fantastic/Excellent B+ -- Very Good B -- Good B- -- OK C -- Poor"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "coolzain_me",
        "review_rating": "10",
        "review_title": "Great movie a rib ticking comedy and great performances",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "wajeehkhan01",
        "review_rating": "5",
        "review_title": "The disappointing sequel",
        "review_detailed_main": "I have to say, the first Hera Pheri was hilarious and probably one of the best Hindi comedy films ever. But Phir Hera Pheri really doesn't live up to that.\n\nA lot of the jokes were lame and somewhat immature, and there was a lot of extreme overacting at parts. Rajpal Yadav and Johnny Lever weren't really at their full potential of comedy, and honestly they got annoying.\n\nThe story was a ripoff.\n\nThe performances were decent. Paresh Rawal once again did the best, he really saved this movie. Akshay Kumar and Sunil Shetty were average. They both were good in parts however. Rimi Sen and Bipasha Basu are nothing. They were just there to attract people. However, here and there there were some scenes that reminded you of the prequel.\n\nThe music was bad. Since this film was released at around the time Himesh began to sing and act himself, the music is mainly Himesh singing himself and that was painful to hear.\n\nOverall, this movie had high expectations, but mainly disappointed. I'd rate it an overall 5 out of 10."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "robotatbb",
        "review_rating": "10",
        "review_title": "Just Epic",
        "review_detailed_main": "Each & Every dialogue of this movie is now meme. Such a strong movie. Eagerly waiting for Hera Pheri 3."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "meenotigoswami",
        "review_rating": "4",
        "review_title": "A highly overrated comedy movie",
        "review_detailed_main": "After watching Hera Pheri I had a huge expectation from this movie but it turned out to be a dud.It's nowhere near to it's prequel.I found Golmaal 1 to be better and more entertaining than this movie.I have seen people comparing it to it's prequel they have no taste.Everything in the movie looked fake.Overdose of overacting.There was hardly any scene that made me laugh. As far as acting is concerned Paresh Rawal tried his best but let down by weak script and other actors have been wasted.Songs are bad.\n\nOverall the sequel of Hera Pheri is a disappointment.If you liked it's prequel then it will disappoint you.Avoid it."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "knlrockstar",
        "review_rating": "10",
        "review_title": "This movie deserves an overall 10/10 stars.",
        "review_detailed_main": "Best comedy movie of all time. It deserves an overall 10/10 stars. Anyone rating it less than 10 really lacks taste in an epic comedy."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Kaatil29",
        "review_rating": "10",
        "review_title": "BEST COMEDY MOVIE INDIAN CINEMA EVER PRODUCED.",
        "review_detailed_main": "THIS MOVIE WILL MAKE YOU LAUGH THROUGHOUT THE WHOLE MOVIE. SHYAM,BABURAO & RAJU'S CHEMISTRY IS FABULOUS. EVERY CHARACTER IN THE MOVIE IS HILARIOUS. IF YOU ARE HAVING A BAD DAY THEN YOU SHOULD DEFINITELY WATCH THIS. YOU CAN WATCH THIS MOVIE UNLIMITED TIMES AND STILL NOT GET BORED FOR EVEN A MINUTE. THIS IS THE MAGIC OF THIS MOVIE. YOU SHOULD NOT ASK FOR GOOD STORY OR ENDING CAUSE THIS MOVIE IS JUST A ROLLERCOASTER RIDE OF FUN. JUST SIT ON IT AND HAVE FUN(10/10)"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "nksarker-19829",
        "review_rating": "9",
        "review_title": "HAPPINESS IS DOUBLED IN 25 DAYS",
        "review_detailed_main": "The 1st part was excellent, so as the 2nd part. Directed by Neeraj Vora, this film added some new characters like Pappu, Kachra Seth, Tiwari Seth with top notch acting of original starcasts like Raju (Akshay Kumar), Babu Bhaiya (Paresh Rawal) and Shyam (Suniel Shetty). 25 din mein Ek ka Double. It's double happiness that film will spread."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "dev_titans",
        "review_rating": "",
        "review_title": "Do not waste your time on this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "travised87",
        "review_rating": "4",
        "review_title": "Hera Pheri goes Hungama!",
        "review_detailed_main": "I just watched this one on TV, with some anticipation and a few fears. Both were realised, to my retrospective disappointment:\n\nHera Pheri told the story of three losers, Shyam, Baburao and Raju, and their attempts to escape the poverty and desperation they and their respective families were in to ultimately become rich. A simple story, with a moral angle, and of course, the wider focus on comedy. They get the money, climb out of poverty, all is well, blah blah and the film ends. This is where its sequel starts.\n\nThere are formulas, patterns, tried and trusted that many directors reuse for their films. The formula for Hera Pheri, was used for hungama, hulchul, and several other subsequent priyadarshan films. Problem is, tautologically speaking, it no longer works for the sequel of the originator.\n\nSpeaking of circles, the director - who is different from the original - gets himself stuck in a plot circle (no pun intended) and leaves us wondering about the subsequent direction of the film. After losing their property early on in the film, the trio are on the streets, back to square one, and this means of course that the rest of the plot will be about them trying to get back to being rich. Predictable? Yes. Thrilling? No. The problem like I said, is the blind reusage of the winning formula of other films. It seems that there must be a goose chase, and the familiar 'hera pheri' (and all its synonyms) style ending with all characters insanely after the object of desire. To do that, he brings the trio to the footpath, and exasperated, we, with them, start again. this undoing of the original's work to, only to redo it again is an immature directorial gimmick.\n\nHera Pheri was a controlled film, with a simple, poignant tale subsumed into the larger serving of comedy. The 'Hera Pheri' element, was mainly at the end. Here, due to the absence of a plot, it bursts in uninvited half way through the story. This means the relinquishing of control so early on, which is disastrous. We become lost in the madness, and seek an elucidating ending, a 'clear-it-all-out' which doesn't happen. The heaps of plot twists become entagled webs that keep piling up, until at the end, we, exhausted, become more desperate than ever for a clear, happy end to cure our misery. This never happens, and instead what the director does is suddenly in the last two minutes, expect the audience to put on our thinking caps, which we never brought to the film, to swallow the ending. As much as i understood the ending, I was initially in disbelief and frustrated enough to spew expletives.\n\nA failure, a case of trying to ambitiously juggle too many things at once is what brings this film down. What he could have focused on instead was perhaps the moral element: how the trio learn that money is not everything, and that happiness actually is about the simpler things in life, etc. Even the characters, seems to have escaped the strings of their puppeteer here. Rawal is excessive, and the other two portray their characterisations poorly this time. It is as though the director hung a piece of meat high up on a string a distance away from the audience, letting them smell and savour its fragrance in the original, and his successor decided to just cut the string and let them devour it in this one. What ever it was, it seemed a cheap imitation of the original, and it didn't help that it was just one of many money-grabbing sequels released in the year."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "TheNonSmoker",
        "review_rating": "8",
        "review_title": "Recommended 👍",
        "review_detailed_main": "This is something to be worth watching during this lockdon and all other restrictions."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sriramthestranger",
        "review_rating": "4",
        "review_title": "No logic!! Only fun!!",
        "review_detailed_main": "When you have a successful first part, the 2nd part was made without considering a proper storyline and only considering the stand out elements of the 1st part.\n\nSo, the plot goes from rich to pauper with good recall to the 1st part and it looks like a sequel with a truck load of characters who are there solely for comedy and comic expressions and don't add anything to the story or screenplay.\n\nIts all comic gags one after the other without break and it works at some places and fails at other. Sunil Shetty character was given no importance and the screenplay revolves around Akshay and Paresh Rawal."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "gokulkhanal-83808",
        "review_rating": "10",
        "review_title": "BEST BOLLYWOOD COMEDY MOVIE",
        "review_detailed_main": "Love all the casting. We should be proud that the film is released on our generation."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "akshayfan-83284",
        "review_rating": "10",
        "review_title": "Iconic characters",
        "review_detailed_main": "If you haven't watched this film you have missed lots of fun. Must watch & enjoy comedy of iconic trio Akshay - sunil - Paresh."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "shajjo123",
        "review_rating": "10",
        "review_title": "chronic laughter attack!",
        "review_detailed_main": "i saw this film last night and when it finished it got a big clapping send off from the audience. speaks volumes!! i think on the whole, with some reservations, this is more evenly paced and humorous than the original. however it does have its own demerits namely that this time the famous trio have been reduced to cartoon characters. there is a lot more fun but at the same time they all go over the top. this was the beauty of the original. they were all simple and believable characters. but situational comedy has been replaced by sheer slapstick. another thing there are a lot of references to Brit film lock stock. that was a put off. also i think paresh rawal needs to give it a break. he is the funny man yet again and boy he is good at it, but i am sure i don't want to watch him again in a funny character in near future. on the flip side, the chemistry between the three was amazing. in fact its their constant bickering that keeps redeeming the film time after time. suniel shetty was alright, more like a catalyst for the other two superior actors do their job. akshay kumar, well, what can i say?? his unbridled zealousness raises the film by leaps and bounds. he was in his home territory and like paresh rawal will have you in splits. rest of the cast did their part well. on the whole a great film for escapism!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "jomy-augustine",
        "review_rating": "4",
        "review_title": "Amateur comedy",
        "review_detailed_main": "Part 1 was great cos it was copied directly from a masterpiece but this.... The only great thing in the film was Johnny Lever... Exceptional performance by the legendary comedian... Rest all was below average and overacting."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "fauzia_lala",
        "review_rating": "9",
        "review_title": "Laugh loud",
        "review_detailed_main": "This movie was a decently directed movie in the sense that it makes you laugh most of the times it was meant to, but no one can take over Priyadarshan. Certain scenes and dialogs were not funny at all like the ones when Babu Rao talks about his telephone in the beginning and when he comes to take the money in his chaul house to not believe it really is his home, also when Raju peeks into Johny Lever's apartment through the picture and several such scenes. Priyadarshan never includes lame comedy scenes or dialogs in his movies. Yet, the climax was a very Priyadarshan style where the comedy goes long into several groups fighting with each other like in Hera Pheri (part 1). Moreover, certain scenes and dialogs were repetitive. For instance, the two tall black villains added no substance what-so-ever and the Rs.1000 scene with Raju and his girl was over done the first time and thereon had the same concept repeating in subsequent scenes. Since most people only count the times they laugh to judge a comedy movie, I would say it's a great laughter movie and every couple of minutes, you find yourself either laughing or smiling. So if you haven't yet, go watch it!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "somesh-77321",
        "review_rating": "9",
        "review_title": "Best comedy movie",
        "review_detailed_main": "No one can match this trio. raju, shyam,baburao is the soul of this movie.from childhood to 20s this is always be my favourite movie seies ."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Donel_S",
        "review_rating": "8",
        "review_title": "Excellent movie with superb doses of laughter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "tereranisharma",
        "review_rating": "8",
        "review_title": "Sequel even funnier!",
        "review_detailed_main": "When I went into this movie, I didn't know what to expect. I loved the first movie, and didn't think they could top it. But soon I realized this movie was better. Through out the whole movie I was laughing and having a great time.\n\nParesh Rawal was of course the funniest character. I love all of his movies, and this was one of the best. His role as Baburao Apte was fantastic. Akshaye Kumar did the best acting. He fulfilled the role of Raju. And of course Sunil Shetty did great. But out of the three I liked Raju and Baburao more but that doesn't mean Shyam didn't do a great role.\n\nThis movie was full of laughs, and the story had so many turns and twists. If you loved the first then you will love this. Even if you haven't seen the first one, watch this one anyway. I had a great time."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sureshsharma-52297",
        "review_rating": "10",
        "review_title": "All time classic comedy film",
        "review_detailed_main": "Full of laughter Raju sayam and Baburao a classic jodi I watch this movie twice in a year A classic comedy movie"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "amit-38384",
        "review_rating": "10",
        "review_title": "The Ultimate Comedy n Meme Material Movie",
        "review_detailed_main": "I have watched this movie 100+ times. I never get bored. I can relate this movie's dialogue in real life. There are thousands of meme on this movie. Anybody can watch this movie at anytime. This one is my fvrt in comedy movies."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "mukeshjain-14778",
        "review_rating": "10",
        "review_title": "Cult classic",
        "review_detailed_main": "Outstanding n superb performance from the trio akshay kumar, paresh rawal n sunil shetty. A laugh marathon."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "johnmclaine-55644",
        "review_rating": "10",
        "review_title": "A masterpiece and a Cult Classic",
        "review_detailed_main": "This movie has the Biggest Following in the Hindi Cinema believe it or Not even if it is not still running in Theatres. This movie is like the Diamond which will not be recognised immediately but it has made an even bigger impact than it's previous installment believe it or not and real movie lovers will always appreciate the movie in the years to come. The reviewers who had given it 1* are merely hating it on some of the scenes from Lock Stock and two smoking Barrels and the Circus by Charlin Chaplin but Neeraj Vohra has put together a Masterpiece with such scenes and the Untimate Trio. As Usual the Akshay - Paresh Jodi is the Show Stealer and very good work by the remaining Cast as well. Deserves to be Well Rated."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "anshulrs",
        "review_rating": "10",
        "review_title": "BEST COMEDY MOVIE EVER",
        "review_detailed_main": "Don't check rating just watch this epic comedy movie. loved by all hated by none."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "muditsharma-95696",
        "review_rating": "10",
        "review_title": "Super fun",
        "review_detailed_main": "The best movie in comedy and plenty of fun. I love watching this movie . The actors are performing so well that it is always great to watch it"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "harshaddhoka",
        "review_rating": "9",
        "review_title": "An underestimated movie with huge potential",
        "review_detailed_main": "This movie is not just a classic comedy but with a message. How 3 friends get stuck in a scam and lose all their money. How they struggle with the poverty and also deal with the problems of extortion and kidnapping. It also shows a love story which starts with a 1000 rupee note and ends with diamonds. Depicting struggle, real life problems, love story and above all true friendship of an iconic trio raju, shaam and baburao. This is a must watch movie and deserves several rewatches."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "raviparnani",
        "review_rating": "10",
        "review_title": "No movie can match this gem.",
        "review_detailed_main": "Best of all time..all actors have done great jobs."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Puroo",
        "review_rating": "10",
        "review_title": "The best sequel of any Bollywood comedy",
        "review_detailed_main": "I learnt about this film before the prequel. I was casually browsing all the channels when I just happened to stumble upon it. Back in the days we didn't have an internet and since we didn't have a TV until a few years ago, I didn't know anything about what film is. And after a few scenes I was completely on board with this. Later on I learnt about the prequel, watched it and then watched this film. And with all that done, there's no second thought - this is the perfect sequel to that film, and that's actually pretty surprising considering both have been made by two different directors and both are adaptations of two drastically different films.\n\nThe film begins with Raju, Shyam and Baburao having become rich. But then Raju falls for a scam and makes them all broke again. It is hilarious to see Shyam and Baburao's reaction when they learn about it, and it's even funnier when they try to attack Raju throughout the film. They start living in a tenement until their luck strikes back again. And once again they try their best, except this time they fail.\n\nThe film adds many more interesting characters to the duology, like Kachra Seth and Pappu. I don't know if this is a popular opinion, but I personally like this film's characters more than the prequel's. Except for the songs, it doesn't matter which scene you're watching. You know you will have a good laugh. The death of the man who tells them Kook-doo-koo initially looked like it was going to be a sad scene, but it also became funny eventually. Every time we think the film cannot have any more amount of comedy of errors, it introduces one more. And in spite of that it does not feel shoehorned. It feels absolutely natural.\n\nEven as writing this review I feel like rewatching it. Not only was it so much fun to watch, it also has a huge amount of nostalgia for me. It was the film from which I learnt about and instantly became a fan of Akshay Kumar. Although I have heard there is a third part coming up, I'd personally prefer it does not come. Time has passed by a lot so films like these aren't appreciated anymore. A sequel will only end up ruining it."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "hasanmehmoodfaruqi",
        "review_rating": "10",
        "review_title": "Not a Movie - Slideshow of Memes",
        "review_detailed_main": "Its not a movie but a slideshow of memes.\n\nMost funny movie ever released."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "rsimran007",
        "review_rating": "10",
        "review_title": "This is Lubb",
        "review_detailed_main": "With the memes that came from movie , it's more hilarious watching movie again & again."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "satyamrathod5800",
        "review_rating": "10",
        "review_title": "I love the comic timing",
        "review_detailed_main": "Movie with full of meme and love on Indian cinema.. And i love the performance of akshay and sunil"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "anmolstar-00104",
        "review_rating": "10",
        "review_title": "Comedy movie",
        "review_detailed_main": "It's a great comedy movie with a lot of meme material."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "parmarashish-12561",
        "review_rating": "10",
        "review_title": "Joymaker movie",
        "review_detailed_main": "You can watch phir Hera pheri as many times you will surely enjoy it. This kind 0f movies considered as rare."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "ishanrajvi",
        "review_rating": "10",
        "review_title": "Best comedy",
        "review_detailed_main": "The most funnier movie that Bollywood could ever create. Actors have done a very very good job."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "guljannat",
        "review_rating": "10",
        "review_title": "THE THE BEST COMEDY MOVIE...",
        "review_detailed_main": "Non-stop laughing. Good story. Extremely talented director. Waiting to see The Second part. We loved it."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "agrawalpiyush",
        "review_rating": "10",
        "review_title": "Funniest movie on earth",
        "review_detailed_main": "The replacement of this movie can never be found. Funniest movie of this planet. You can watch this 1000 times & still won't get bored."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "Li_85",
        "review_rating": "8",
        "review_title": "Borrowed from Lock, Stock...but still FUNNY",
        "review_detailed_main": "In 1999, we saw Hera Pheri, which was the funniest film of the year. You can even saw a classic comedy, with three fabulous actors. It's good to know, they are making a sequel with the famous trio again. Part One had a brilliant Con, Part Two's con is a copy of the great British Gangster movie Lock Stock and two smoking Barrels. The whole film ain't a copy, The first half is Great, Impossible not to laugh. The second half was a little predictable for me since I have seen Lock stock. It still managed to make me laugh. The final ending was one of the funniest parts of the film, set in a circus. It was unnecessary of having a fake gorilla, unless the Gorilla takes Johnny Lever to the bush. Now, that would of been a copy of Ace Ventura when nature calls ending, but still would of been funny. Paresh Rawail is Funny as usual in a terrific role. Sunil Shetty gives a good performance yet again. Akshay Kumar gets better all the time, he is the funniest of them all. The supporting cast are decent. The ones that stand out are the Sexy Bipasa Basu in the dance sequence. Johnny Lever, its great to see him after a long time, a natural born comedian. Rajpal Yadav is funny in a small role. Sharad Saxena is hilarious as the gangster of the town. This is overall a Great comedy, and Worth the watch for sure."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "krmhashmi",
        "review_rating": "10",
        "review_title": "Best Comedy Movie till date!!!",
        "review_detailed_main": "A Cult Classic....Just one of those films you never get tired of watching..."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "shaikhnaoman",
        "review_rating": "10",
        "review_title": "CULT Classic",
        "review_detailed_main": "One of the Best Comedies of bollywood cult classic best of the best 👌 best comedy Trios must watch movie for the whole family Laugh riot highly recommended for everyone"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sbarve-44646",
        "review_rating": "10",
        "review_title": "All time Blockbuster 🔥🔥🔥🔥🔥",
        "review_detailed_main": "Memes material movie non stop comedy scenes And Akshay ,sunil and paresh sir are Great 🙏 Ye movie abhi theater re release karni chaiye..Love this movie..❤"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "niyazshaikh-22029",
        "review_rating": "10",
        "review_title": "One Hilarious Ride!",
        "review_detailed_main": "A crime comedy film with over the top characters but relatable at the same time. The dialogue used have become a part of the daily vernacular spoken. The first installment lacked blockbuster music though it was still good. This film has got humour that is positive, hilarious as well as kid friendly. No objectification or adult kind of humour is used. Still, it is one of the funniest comedies we've ever had.. the only drawback here is the director's death. I am eagerly waiting for the third installment."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "rohantrivedi-62040",
        "review_rating": "10",
        "review_title": "Best comedy movie of all time",
        "review_detailed_main": "Great movie to watch. No matter how many times you watch ,it will surely make you laugh."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "chavanpratish",
        "review_rating": "10",
        "review_title": "Perfect everytime",
        "review_detailed_main": "I dont kmow how this movie gets 6 rating deserves 9 or 9+"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "trishsuraj",
        "review_rating": "9",
        "review_title": "Masterpiece of Comedy",
        "review_detailed_main": "Every character nailed their character especially the Raju (Akshay Kumar), Shayam (Sunil Shetty) and Babu Raw (Paresh Rawal) are not just character they are emotion."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "siyam_hossen",
        "review_rating": "10",
        "review_title": "I couldn't stop laughing while watching the movie",
        "review_detailed_main": "The story of the movie is very good and it is full of funny dialogues. Akshay Kumar and Paresh Rawal acted superbly. Suniel Shetty's acting was a bit weak."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "wickedsunny-49309",
        "review_rating": "9",
        "review_title": "Entertainer❤",
        "review_detailed_main": "I love this trio ( Raju + Baburao + Shyam ) very much... .... Specially Raju ❤"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "omkumarhrp",
        "review_rating": "10",
        "review_title": "One of the best comedy movie....",
        "review_detailed_main": "For me this is one of the most iconic movie that bollywood made. I have watched this movie countless time and I can still this as same. If you dont like this it is your bad."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "lutforrahman-59171",
        "review_rating": "8",
        "review_title": "Evergreen it is !",
        "review_detailed_main": "We want more this types of film from bollywood...one of my favourite.."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "amitkumarsingh-95386",
        "review_rating": "10",
        "review_title": "Raju (Akshay kumar) is love",
        "review_detailed_main": "Best comedy movie ever made in bollywood Akshay kumar,paresh rawal ,sunil shetty,johnny level each & every character is mindblowing man\n\nMust watch movie."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "himanshusinghmannu",
        "review_rating": "10",
        "review_title": "Best Comedy Movie ever made",
        "review_detailed_main": "The best comedy movie ever made .\n\nTreat for meme lovers .\n\nCast was perfect for each role .\n\nPhenomenal acting with best dialogues.\n\nActing , direction , casting , dialogue delivery , comic timing are top notch .\n\nWe can't ever forget the @ iconic pose of Raju , @ 150 rupiya dega , @ , khopdi tod saale ka."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "myinfinitesteps",
        "review_rating": "10",
        "review_title": "India's One Of the best comedy movie",
        "review_detailed_main": "Akshay Kumar, Paresh Raval and Sunil Shetty do great acting. It's is one of the comedy movie of all time .You can't yourself laughing. Dialogues are awesome."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "badmunnybusiness",
        "review_rating": "9",
        "review_title": "Hilarious!",
        "review_detailed_main": "10 stars just for Paresh Rawal's Baburao character ."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "sonahrp",
        "review_rating": "10",
        "review_title": "Cult Classic!",
        "review_detailed_main": "Simply best Comedy movie in the History of Indian Cinema. Each line of this movie is famous and Undoubtedly most loved Comedy movie by this generation. Akshay kumar just nailed it as Raju bhai.\n\nThe best trio in the world cinema is Raju,Shyam,Baburao... And besides main leads, the other supporting cast of this film has done amazing work. Rajpal Yadav,RaviKishan,Johnny sir, etc.\n\nThe repeat value of this movie is uncountable.\n\n25 Din mei Paise Double."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "fuzmwb",
        "review_rating": "10",
        "review_title": "Best comedy movie",
        "review_detailed_main": "This is best comedy movie that I have ever seen in my life across any industry."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "harshtirole",
        "review_rating": "10",
        "review_title": "Best suspense film",
        "review_detailed_main": "Best comedy and one of the best character trio a must watch"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "krishsingh-35435",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "This film is so great!!!!!! It's a perfect family watch. Inspite of watching it so many times, it makes me laugh each and every time. Only an idiot would not like this movie."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "dambarkeshubham",
        "review_rating": "10",
        "review_title": "Best comedy movie I have ever watched",
        "review_detailed_main": "Everyone's acting and the timing of dialogues is just amazing."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "tariquemahmud",
        "review_rating": "10",
        "review_title": "Best comedy movie ever!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "deewanaakkika",
        "review_rating": "10",
        "review_title": "Epic Comedy Movie",
        "review_detailed_main": "They are back.Raju, Babu Bhaiya & Shyam. The epic sequel of epic comedy movie Hera Pheri. As funny as Hera Pheri.\n\nRecommended."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "rabiashehzadi-74754",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "chaudharychaitanya-94273",
        "review_rating": "10",
        "review_title": "It is very funny movie",
        "review_detailed_main": "Paresh raval is very good actor akshay kumar 's acting is epic"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "aagamjain-10834",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Amazing movie Amazing movie Amazing movie Amazing movie Amazing movie"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "bihariboiimehra",
        "review_rating": "10",
        "review_title": "An even more thrilling ride",
        "review_detailed_main": "It is so hard to believe that it's rating is so less compared to its predecessor although being even more amusing, hysterical and overwhelming . Along with our stars Akshay Kumar as Raju, sunil Shetty as shyam and ofcourse Paresh rawal as Baburao , big and proven comedic stars like Johnny lever, Rajpal Yadav, Sharat Saxena, manoj joshi, the late Neeraj Vohra, suresh menon , Kiku sharda and Ravi kishan join this thrilling and hilarious ride which already shows that it's more massive in scale than the first and sure will be funnier as I mentioned before. To crown it all up I won't just deem this to be a worthy sequel but the best ever in bollywood . Unlike illogical and stupid sequels like sadak 2, race 3 and housefull 4 this is a sequel which has purpose and effortlessly impresses without any flaws what so ever, I think the makers of the above sequels which I have listed should learn something from this masterpiece of a film"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "himanshusharma-22523",
        "review_rating": "9",
        "review_title": "Best comedy of Indian cinema!",
        "review_detailed_main": "Phir Hera Pheri is the best comedy movie ever made in Bollywood. This movie is famiye for its iconic characters. Akshay kumar aka Raju one of his best character. Me and my whole family love this movie."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "zansari-02791",
        "review_rating": "8",
        "review_title": "Perfect Sequel, 7.5 My rating Underrated comedy movie",
        "review_detailed_main": "Phir Hera Pheri doesn't disappoint audience as they expected after Hera Pheri success even it's funny from their previous one but lack of story\n\nGood Points\n\n1. Movie is full of fun and alot of comedy even if you watch multiple times you will not get bored, .\n\n2. No Vulgarity, No adult comments, unnecessary dialogue, and bad comedy scenes are not included Family type of comedy movie.\n\n3. Movie has some Moral like don't invest money anywhere until you have proper knowledge and first research before you investing like Share Market, Crypto, Apps etc.\n\n4. Every scenes related with reality and can easily be converted to Meme.\n\nBad Points\n\n1. Sunil with Bipasa gets fall in love that's annoying sometimes it's irritating.\n\n2. So much characters included some characters can be avoided and also Biapasa and Rimi Sen just average both actress is just for romance not for comedy.\n\n3. Movie Story goes in several direction getting confused while watching it lacks a good story but it's ok for comedy movie."
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "amitbarua-34788",
        "review_rating": "10",
        "review_title": "fun movie can be watched with everyone",
        "review_detailed_main": "It was really funny!! Raju played by akshay kumar was superb, and so was Akshay Kumars character, although Sunil Shetty'z character didn't shine through as much as in Hera Pheri!! The Chemistry between the three was great to watch, the characters haven't changed in the way they act they still get themselves into trouble and this time round they get into such a big mess!! I cant say that it is better then the first one because the Original is always the best!! Overall i believe that the film is good to watch and my comment is only based on the first time i watched it so If u ain't seen it GO 2 c it or get it on DVD when it releases because it definitely will have u kneeling over with laughter!!!"
    },
    {
        "movie_id": "tt0419058",
        "movie_name": "Phir Hera Pheri",
        "movie_rating": "7.3",
        "review_username": "saifur-rey",
        "review_rating": "10",
        "review_title": "Best comedy movie ever",
        "review_detailed_main": "Each and every dialogue of this movie is a hit. If released during today's time, this generation will make sure that it never gets out of the theater. My man what a movie.. 100/10."
    }
]