[
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ThomDerd",
        "review_rating": "6",
        "review_title": "It could have been great but...",
        "review_detailed_main": "It's a 5.7... and it's trying to be a tribute to the first film-which was epic-but not a good tribute. Some jokes are good, some characters are ok (e.g Wesley Snipes) but the story and the writing are so lazy and uninteresting that instead of a comedy, it's a sleep-athon. I give it above 5 because I liked the music, the performances, the costumes and the fact that the original cast got together for this. And for some nice jokes here and there. But...why didn't they try a bit more? With the likes of Eddie Murphy and Arsenio Hall you can get a great comedy. However, these guys didn't seem to enjoy much being there. The pace is slow and the energy is low in about 80% of the film. Tracy Morgan is not adding anything new and Leslie Jones... was more annoying than funny. The plus points here are that it's indeed a feel good movie if you don't fall asleep... 5.7/10 They could have tried a bit more."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ElMaruecan82",
        "review_rating": "5",
        "review_title": "Was that trip really necessary?",
        "review_detailed_main": "I'm a longtime fan of Eddie Murphy, he belongs to that breed of likable comedians who can make a film that fails without failing by himself. \"Coming 2 America\" succeeds at least in one department: it makes you realize how good he used to be and how good he can be like in his recent (and better) \"Dolemite\". Now, to describe my feeling about \"Coming 2 America\" I will paraphrase Dewey from \"Malcolm in the Middle\": \"I expect nothing but I'm still let down\". In fact, that quote should be the stock answer to all these tiresome trends of rebooting, remaking and sequels or prequels that sprayed all over Hollywood creation like a certain virus in our everyday lives.\n\nIt's not that the film is bad but it's just a benign nostalgia-driven project that keeps basking in the shadow of the original whose references are expectedly countless. Some are cute like the three old guys' cameos and some downright funny like the promised bride who was still barking and jumping on one foot after thirty years; but unfortunately, the film can't live up to the same levels of fun and the material isn't original enough to be referenced to in ten years. The costumes and set-designs were visually creative but same can be said about \"Cats\".\n\nWhat's the story about? Prince Akeem, now King of Zamunda, has three daughters, he's pressured by General Izzi, the tyrannic ruler of the neighboring country Nexdoria (got the joke?) into marrying his daughter Princess Meeka (KiKi Layne) with his son and thus guaranteeing an access to the throne because Zamunda can't be ruled by queens. At that precise moment, anyone can guess the obvious trajectory the plot will take. The problem isn't that the film takes a long detour through Queens to get to the obvious solution: change the law, but that the solution all depends on Akeem's good will. Indeed, the prince who challenged his own father, who rejected the tradition, wouldn't change the rule. Of course, if he did, there would be no story and maybe the first film didn't need a sequel to begin with.\n\nTo his defense, Murphy throws in the script a few lamentations about Princes generally changing once they become kings but that aspect left me with an uncomfortable thought: in the end of the first \"Coming to America\", Akeem resigned himself and if it wasn't for Lisa having an afterthought or his father Jaffe Joffer changing the rule, he wouldn't have married the girl of his dreams. Now, why wouldn't he make the same move to let his rather competent daughter fulfill her dream? I started looking Akeem as a hypocrite and I blame the sequel for that. And when he is put in his place by Lisa (Shari Headley) and everybody's supposed to be \"about time!\", I was like \"couldn't that conversation happen before and spare all the trouble?\".\n\nBut I'm reading too much. You can tell there's a reason why this problem exists: the same than the 'forced marriage' thing, it's the unfair law that must be canceled. That's the point. And so it's a foregone conclusion that Meeka will become the queen. If you don't get that instantly, you've missed many movies of the 2010s (not that you missed much). My suspicions raised with the martial arts fighting sequence with Akeem practicing with his daughters, it was as if Eddie Murphy just discovered the \"girl power\" thing almost one decade too late, making the film dated in its attempt to be in touch with today's trendy streams of inspiration. The problem is that his daughters aren't given much screen-time anyway so the script begs us to root for them while dedicating the whole storyline to the illegitimate son: Lavelle played by Jermaine Fowler.\n\nLavelle is referred with the b-word (the film's most memorable running-gag), the unwanted result of an intoxicated night with one distinguished lady they met in the nightclub. That's the best they could come up in a flashback sequence that provides a few clips reminding us how awesome the original was. Akeem has no trouble finding Lavelle, he's a likable loser who welcomes with enthusiasm the prospect of being a prince, and so does his mother played by Leslie Jones. And so what we got is a reverse formula of the original where you never exactly know whether Africa is honored or mocked, Zamunda was supposed to be an expositional joke to highlight the contrast with America but Murphy handles the matters of succession with utter seriousness while providing the worst caricatures about the continent.\n\nThat African fantasy is a source of one-note jokes awkwardly contrasting with the whole theme of inequality. Even the romance between Lavelle and a groomer named Mirembe (Nonzamo Mbatha) has to get in that territory. Had the film delivered its share of laughs, that would have made for a more enjoyable experience. It started well but went downhill after the death of Jaffe (James Earl Jones). Arsenio Hall is underused as Semi, Tony Amos add some gravitas to Akeem's position recalling his more progressive mother, and well we have the \"references\" to ornate the rather half-baked comedy and so many musical cameos I felt like watching MTV. The film put me in such a sorry state of mind that when I saw the three guys in the barbershop, I thought they should be logically dead. My spirit was.\n\nThis is not a bad film because it is predictable, the original wasn't a masterpiece of originality either, but it just didn't have that energy, that gentle silliness the original had (Craig Brewer is no John Landis), it was like Akeem: too pompous and civilized for his own good and so obsessed with rules and the etiquettes he wasn't aware of his own contradictions. I said about the original that it was pure 80s fun, in a way the sequel also exemplifies the 2020s: a lackluster era where remaking what's old stands for newness. Like I said, I expected nothing but..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cliftonofun",
        "review_rating": "5",
        "review_title": "More reunion special than movie",
        "review_detailed_main": "When I rewatched the original Coming To America this week, I was struck by its timelessness - every scene still worked, every laugh line still felt quotable/funny. In 1988, it somehow managed to be both a classic fairytale and something that felt remarkably fresh (All Black cast?! Actors playing multiple characters?!). This movie meanwhile is...fine? I could not help but enjoy seeing the actors and their characters again, but that's not a movie. That's a reunion special. So we wound up with 2 different things happening: an updated version of the first film starring Jermaine Fowler and a bunch of cameos from the original. It is entertaining in fits and starts. But it is not timeless. It is not even cohesive. I have probably watched Coming To America 20 times, but I'm not sure I'll watch this one more than twice."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fatcat-73450",
        "review_rating": "2",
        "review_title": "One of the Worst Movies I've Seen",
        "review_detailed_main": "40% or more of this movie is choreographed group movement (I won't say dancing because sometimes it doesn't have music) or terrible musical numbers that spoof popular songs but change the lyrics in an amateurish way to pertain to the characters in the movie. The main character even gets a freestyle rap in... Ohh, did I accidentally change the channel? Is this a live-action 2021 movie or a bad 90s cartoon?\n\nIt's pathetic that while this musical mess is going on the characters watching it are snapping or swaying along like it's so good. You're trying too hard. Just stop.\n\n30% of the movie is woke virtue signalling. They repeatedly, crassly, and directly continuously state how it's messed up women don't have as many opportunites as men, how sexism is bad, how there's systematic racism, how it's wrong to grope women... Was the script written by a ultra-liberal children or an out-of-touch high school teacher or what?\n\nThen they imply that society has changed and now people consider all that stuff bad. Is it implying that the first movie was miogynistic and culturally backwards? Uhh... I didn't see Eddie Murphy groping women or denying women their rights in the first movie. How is this relevant or necessary? It's not on both counts.\n\nNow we can talk about the shrimp larva of a plot. Basically Eddy Murphy's character has a son and we meet the son.\n\nThat's the whole plot. It's not about anything in particular because there are many storylines, none developed beyond the outlines, none of them logical, and all regressing at some point:\n\n1. Fish out of water trope? The son and his family are from the hood and they go live in this African king's palace. Except the son's not really very hood, knows how to behave himself appropriately when going into an interview, and quickly settles into the princely life. He doesn't play the role like a poor boy but like a middle class person.\n\nThe mom is a little bit more exaggerated and urban but she disappears for most of the movie. He also has an uncle of the same persuasion but he only comes out near the end. All of these characters drive the royals up the wall but are reconciled with them at the end and become close friends with no explanation.\n\n2. Poor guy suddenly becomes rich trope? He's (supposedly) poor, but not really. He wants to get a job for the sake of his dignity. His king father comes to get him. At first he doesn't want to go. Then he sees money and gold and wants to go. Once he's there he decides he doesn't care about money or luxury and wants to go back. Once he goes back he cares about money again and wants to return... Ad nausem.\n\n3. Love story: Rehashes the same plot from the first movie. Except at first he wants to marry the shallow girl because she's hot. Then he talks to some other girl for a week and wants to marry her... If he could fall in love with a girl he barely knows in a week and he's 30 wouldn't he have done it by then?\n\n4. Son is needed to ascend to the throne: They say a son is needed to ascend to the throne and never explain why. Kind of because some other guy wants to attack Wakanda or whatever their country is called if there's no male heir - for no reason. It's forgotten at the end.\n\nIf you're a huge, huge fan of the original, the only redeeming quality is the cameos. All of the main characters and even some minor characters who appeared in the first movie show up again.\n\nI've seen a lot of movies, but this is truly shameful and pathetic and I don't hesitate to say it is one of the worst movies I have ever seen. It's barely a movie. More like a series of tik tok shorts badly sewn together.\n\nOhh, and no, it's not funny.\n\nHonourable Mentions: Yes, I hate Chariots of Fire (1981) with a passion, but I much prefer it to this movie. At least it had ONE good scene."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "It's not funny at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "neilowen_74",
        "review_rating": "6",
        "review_title": "Some people look too deep into movies!",
        "review_detailed_main": "Is this as funny or as good as the original? No, never was going to be either. Is this as bad as the 1 star reviews? No it's not either! It's entertaining & funny, with some good links to the original. Apparently the story is weak, well yeah it's a comedy, it ain't written to get an Oscar or golden globe!! It's written for laughs, to sit down, unwind, switch off the brain and smile."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "marymcfarland-01866",
        "review_rating": "1",
        "review_title": "All the Bad Reviews are Correct",
        "review_detailed_main": "Good God....this was a terrible movie. I made it halfway through and then I couldn't take it anymore. The storyline is ridiculous, the Leslie Jones, Wesley Snipes and whoever the hell the son is characters are intolerable. This movie is not even a little bit funny...I mean...jeez. Everything about this stupid sequel is an insult to the excellent original film. What a disappointment."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jamyers85",
        "review_rating": "7",
        "review_title": "Deserves Credit",
        "review_detailed_main": "It's funny and nostalgic. You know you're not coming for the in depth story line so just enjoy. Deserves more than its current score just for the effort."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ukproject",
        "review_rating": "1",
        "review_title": "As painful and entertaining as a turd finally pushed out after 33 years of constipation.",
        "review_detailed_main": "If I didn't have any affection towards the original, I would probably have turned this movie off about 15-20 minutes in.\n\nThe only thing that kept me tuned in is just sheer fascination to see how bad this crapfest could get.\n\nAnd boy it just kept getting worse and worse.\n\nIf there is a hell, then everyone associated with this shameless piece of garbage should be forced to watch it on repeat for eternity."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "dtnmusic",
        "review_rating": "7",
        "review_title": "ED-EEE... ED-EEE...",
        "review_detailed_main": "Probably the most surprising sequel ever! Like, 33 years later, that's hilarious in itself. Eddie and Arsenio were great together in pt 1, so I was happy to see both of them back. Plus, I haven't seen much of Arsenio lately. The premise is great in that, Akeem, left a little secret behind in America and it's time to answer that call. So much time passing works well for that premise also. I don't want to give anything away as it's not exactly a thick plot. I will say some of it, plot and jokes, was predictable. Sequels always have that uphill battle. But, overall it did the job and as far as I was concerned, the surprise of it simply showing up after all these years won me over. Don't overthink it, just enjoy it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "The-Sarkologist",
        "review_rating": "3",
        "review_title": "Not That Funny, and Didn't Need to be Made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "areyofsunshine-10199",
        "review_rating": "8",
        "review_title": "It's not perfect but it's entertaining.",
        "review_detailed_main": "It is a film made with friends - old and new. The fashion was still on point. It is family friendly. A few political jabs do not end the enjoyment. It is a comedy and should not be taken so seriously."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "gous21",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "Plenty of nostalgic and funny moments, with a basic plot lined story. Not ground breaking or memorable movie, but good enough to deserve a watch."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Linda1973",
        "review_rating": "1",
        "review_title": "Horribly Disappointing",
        "review_detailed_main": "The movie looks cheap with some bad and obvious CGI. There is no charm like the original had. The actors seem like they're doing an imitation of their characters, if that makes sense. Too many lame and recycled jokes. And there was a strange scene near the beginning that felt totally out of place where they jam Morgan Freeman, En Vogue, Salt N Peppa and Gladys Knight all into a five minute period that felt horribly forced and painfully unfunny. Which pretty much sums up the whole movie...horribly forced and painfully unfunny."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "melias-51440",
        "review_rating": "7",
        "review_title": "Not bad",
        "review_detailed_main": "This is a good sequel, it brought back memories from the old movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "debellum",
        "review_rating": "3",
        "review_title": "Not good",
        "review_detailed_main": "Best thing about this movie is that it brings back all of the actors. Worst thing about this movie is the movie. Great idea but horrible storyline."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fathead-555-926966",
        "review_rating": "6",
        "review_title": "Well I liked it!",
        "review_detailed_main": "So glad I ignored all the bad reviews. Good fun movie, seeing all the characters again brought back some great memories. Don't be put off by all the negativity, give it a try for yourself."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "peter-lejon",
        "review_rating": "2",
        "review_title": "Quick cash grab",
        "review_detailed_main": "Such a disappointing movie. I didn't laugh at all. Where is the originality of the first movie. The witty ideas. Just a bunch of aging stars grabbing a quick buck. Some thing are better left alone."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ruleof2187",
        "review_rating": "7",
        "review_title": "Good comedy sequel 👍🏽",
        "review_detailed_main": "It's a comedy sequel made 30 years later.. Much better than any other long waited sequel. You'll enjoy it if you like the first one... Great call backs.. It's a comedy not dramatic art. Modernize so you can watch it with a new generation and connect with it still.. If you have a soul."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ray-68402",
        "review_rating": "1",
        "review_title": "Believe the reviews",
        "review_detailed_main": "Yes, this movie is awful, but I still put a very good deal of thought into coming up with a list of things are redeeming about this movie and make it still worth watching if you have not yet done so. Here is that list:\n\n1."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ohamberxx3",
        "review_rating": "10",
        "review_title": "I loved it!",
        "review_detailed_main": "I don't understand all the negative reviews. You can't go in comparing it to the first, it's been 30 years. Times have changed. The acting was wonderful and I loved the storyline. This is definitely one of my top 10 favorite movies now. I watched it last night, and watched it again today. It's wonderful."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kelove",
        "review_rating": "7",
        "review_title": "Worth It!!",
        "review_detailed_main": "I enjoyed the movie! I enjoyed seeing the old cast and new cast members. I feel that the movie was respectively done. It's hard to live up to the original movie because it's a cult classic, but part 2 held it's own. Definitely a must see."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mailtaskservice",
        "review_rating": "2",
        "review_title": "Horrible movie 2021 and as other reviwers said: insult to first movie.",
        "review_detailed_main": "I thought this will be good as part 1 but I am very disappointed by this horribly made movie. It tried to be funny in many aspects but failed miserably. I regretted wasting my time watching this horrible movie that is poor directorship, poor comedy, illogic, bad storyline, lousy special effects and so many more horrible things.\n\nI give this a low grade 2/10 because has a big star actor, part 1 was a hit, this movie supposes to be good and at least show some real movie dignity respect but all failed. Thi movie looks like a budget movie too and if they invested lots of money, all be in a big doubt: What the heck they did with the money to produce such a standard of movie!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "davidcla-471-617940",
        "review_rating": "7",
        "review_title": "Good sequel",
        "review_detailed_main": "Not sure what folks wanted or expected but glad I tried this instead of giving up after the abysmal rating. This sequel delivers entertaining performances by an impressive cast. The plot is simple and moves along quickly. It never takes itself seriously, and you don't want it to. The barbershop group rocks. Eddie still has it. There's nothing wrong with this production. Enjoy!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kmckienz",
        "review_rating": "3",
        "review_title": "They tried.",
        "review_detailed_main": "I appreciate the plethora of cast that returned for the sequel, but the humor fell flat for me. It was predictable and failed trying to recreate the humor of the first movie. The CGI left a lot to be desired as well.\n\nI hated giving this low of a rating, but it is what it is. Perhaps others will like it more."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "terimkel3",
        "review_rating": "7",
        "review_title": "Not sure what people were reviewing",
        "review_detailed_main": "Most of the reviews are about the movie being \"woke\"? I'm sorry that these \"reviewers\" didn't actually review the movie based on the actual plot and the acting. The costumes and visuals were excellent as usual. The movie was good, with Leslie Jones and the Barber Shop gang."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "TheOneThatYouWanted",
        "review_rating": "3",
        "review_title": "Even Wesley can't save it",
        "review_detailed_main": "A far cry from the first one. The only thing good about Coming to America 2 is Wesley Snipes. And what is up with all the songs? If I want to watch singers singing their pop songs, I would just watch them on YouTube. Skip it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "matthewcoutts",
        "review_rating": "7",
        "review_title": "Underrated",
        "review_detailed_main": "Don't go into it expecting to beat the original but it's a solid sequal with new characters and doesn't forget what made it special and its aged very well in modern culture"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "rjgrund-123-603438",
        "review_rating": "2",
        "review_title": "Painful",
        "review_detailed_main": "Painfully bad. Not funny. None of the wit or humor of the first one. None of the enjoyable characters. Caricature portrayals of wokeness that stab you over and over with their point. What a mess!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jtnharris",
        "review_rating": "9",
        "review_title": "More Family Friendly",
        "review_detailed_main": "No complaints here. I'm older than when I saw the first one. It should be geared toward a more family friendly plot line. It's very hard to do a fictional African nation and royalty after Black Panther. God bless James Earl Jones for doing his part AGAIN!!\n\nJames Earl Jones"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kabajaz23",
        "review_rating": "7",
        "review_title": "Remember the time",
        "review_detailed_main": "More than 30 years later, almost same jokes, same situations, but can't help to like it..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "wjxmjwn",
        "review_rating": "1",
        "review_title": "Physical Pain",
        "review_detailed_main": "This film actually hurt my soul to watch.\n\nIf you haven't watched it yet, avoid at all costs. If you're half way through and you've come here hoping the rest of the world feels the same way then don't worry, yes we do. Turn it off.\n\nIf you're like me and you reached the end then listen - we won't get that time back but that's ok. Some things in life come to test us, like this very, very poor part 2. It's made me a more humble and patient person. Thank you for that Eddie. But don't you DARE make a feature length sequel to Trading Places."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kcrateau",
        "review_rating": "7",
        "review_title": "A fun look back at an awesome original",
        "review_detailed_main": "This movie was fun. It wasn't hilarious, and certainly had the tone of a 2021 type of movie, but there was enough throwbacks to the original, inside jokes and nostalgia to make it just enjoyable enough to fill some big shoes effectively."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "doug-33267",
        "review_rating": "3",
        "review_title": "I watched it... It ended... I immediately forgot it...",
        "review_detailed_main": "I never expected it to be better than the original or even close. Even in today's movie world they could have done it better. Love the actors. Yet again I'm left asking myself, Am I the only one that feels that these money grabs take a little bit of the magic away from the originals?"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "deloudelouvain",
        "review_rating": "6",
        "review_title": "The first one is better, that's just a fact.",
        "review_detailed_main": "I rewatched the first one yesterday, just to set up the mood for this one and maybe to compare them both a bit easier. There's no question about it, the original was better. In this sequel, which has its moments, there is just too much dancing and singing. It looks like they tried to get as much as possible famous music artists to collaborate in this sequel. Now, not all the music scenes were bad, there was clearly some good choreographer appointed for those scenes, but at one point it looked more like a try-out for America Got Talent than a movie. The story is a bit similar to the first one, just the basics and then they added some new scenes. Eddie Murphy and Arsenio Hall both still play four different characters and they did a decent job with that. I watched Coming 2 America, had some mild fun, but I can't help to have that feeling afterwards that this movie wasn't really necessary to make. Eddie Murphy and Arsenio Hall did age well though, with 33 years between the two movies they didn't change that much."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "yaplex",
        "review_rating": "2",
        "review_title": "Can't watch this movie",
        "review_detailed_main": "It is not funny at all. Nothing comparing to the original movie. Jokes are stupid."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ruben_ramstien_ramirez",
        "review_rating": "7",
        "review_title": "Not as corny as originally thought",
        "review_detailed_main": "Movie was very entertaining do not read the negative press on this. Better that I expected it has its corny was but still very entertaining. Watch and give a chance"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "BlazingBolt",
        "review_rating": "1",
        "review_title": "A forgettable movie with bad plot",
        "review_detailed_main": "Eddie Murphy should have never made this movie. The plot is predictable, dumb and takes away from the original. I didn't laugh or even chuckle a single time. He should have just made a spin off movie about the barber shop.\n\nI am going to forget this movie exists and you should too."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sjworldwide",
        "review_rating": "8",
        "review_title": "Fun revisit, great for a long-delayed sequel",
        "review_detailed_main": "This is a comedy, not a superhero epic, thriller, or award-contender drama. Comedies are usually casual and surreal fantasies by nature. It's also a sequel, filmed like 30+ years later by a different, non-legendary director. If you keep realistic expectations and just want a nostalgic, slightly modern spin on the original silly story, you'll be entertained. Eddie is still funny, but he's playing a different role now that he's getting old. The idea is simple, but effective enough for an escapist comedy sequel. Don't take personal offense by the artists continuing an old story. Just have fun. Enjoy seeing so many cast members and silly characters return - they all do great. Lots of laughs all around. Awesome soundtrack. The CGI is fine, especially for a comedy. Some touching moments - yes, there is still some heart in this one, and just enough modern sensibilities to avoid getting too serious. But of course it's clearly not as good as the original - the original is one of the best comedies of all time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ollyfoister",
        "review_rating": "7",
        "review_title": "Loved it",
        "review_detailed_main": "Me and my wife really enjoyed this both being in our mid 40s watched the first and if you don't watch the first one you really won't understand about 50% of the jokes"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "asherrbh_15",
        "review_rating": "1",
        "review_title": "After the ending I was like: What was that?",
        "review_detailed_main": "It's just so bad, when you have a scene that rips off the original in every way and isn't even funny, you know you've failed, almost everything about this movie was bad, it's easily 20 minutes too long, the acting feels like it's a feature length infomercial, and boy was the story dull and predictable. All the bad reviews are correct, this movie is terrible."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "shanayneigh",
        "review_rating": "1",
        "review_title": "Has nothing to do with the original",
        "review_detailed_main": "Apparently IMDb doesn't like reviews longer than \"dis sux!\" or \"zomg best ever!\". I had written a longer analysis of the movie, but it got deleted, so here's a shorter one.\n\nThis movie is nothing but a lazy cash grab attempting to ride on a wave of nostalgia. Whereas the original movie was a smartly crafted comedy with a tight script and real characters, the sequel is nothing but a loud, obnoxious mess with a ridiculous story and cardboard cutout characters. The original was rated R, and the sequel is PG-13. The sequel has more to do with The Nutty Professor or any of the other lame family comedies Murphy started churning out in the late 1990's than the original Coming to America. It's a defanged Eddie Murphy with his hands tied behind his back. It doesn't help that loudmouth Leslie Jones is in this movie, playing the exact same character she did in Ghostbusters, shouting every single line.\n\nAnd then we get the musical numbers. This movie is more interested in shoehorning in washed up celebrities than telling a coherent story or crafting believable and relatable characters.\n\nAnd of course, since it's 2020 it must have lame girl power subplot, pandering to the Twitter patrol and making this movie essentially critic proof."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "godofodd",
        "review_rating": "6",
        "review_title": "Better than expected",
        "review_detailed_main": "The reviews seem overly harsh for a movie that's obviously going to be one callback after another. Thirty years on, the humour and talent of the original cast still hold up and the new actors fit in well. Leslie Jones has a subdued performance (for her) that works well and Wesley Snipes shines in a way he hasn't in many years. Maybe I'm easier to please than most, maybe I like terrible movies. Or maybe it's a funny movie and people set their expectations way too high. Go in for a couple of laughs and you shouldn't be disappointed."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mosurataksaichan",
        "review_rating": "3",
        "review_title": "Is this really a sequel?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "andymclennan",
        "review_rating": "7",
        "review_title": "Great sequel",
        "review_detailed_main": "This film is loaded with something that so many movies lack these days; a sense of fun.\n\nMurphy and Hall are on form and the newest cast additions fit in really well... and the return of some old favourites.\n\nIgnore the bad reviews, sit back and enjoy it. If nothing else you'll love all the excellent (and surprising) cameos and a great soundtrack.\n\nIt's hard to recreate the originality of the first film but it's a solid effort with a lot of heart and a whole lot of fun."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "osrbill",
        "review_rating": "1",
        "review_title": "Worst Sequel Ever !",
        "review_detailed_main": "Way too much time passed where this could have made any sense. The original movie was brilliant and they wrecked it for me. quit while you ahead ! Flat out too many cheap CGI effects. Story line sucked ! Watch it if you want to waste your time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "chrissyboywallace-31172",
        "review_rating": "7",
        "review_title": "Fairly decent sequel",
        "review_detailed_main": "I dont often write reviews but I feel this film is getting a bit of an unfair bashing. I am a fan of the original and felt this did quite well to capture the same vibe.\n\nIts not a great film by any means but I quite enjoyed it all the same and it made me laugh more than a few times. If you just want a nice easy to watch comedy then you cant go far wrong with this"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "shaynezbritt",
        "review_rating": "1",
        "review_title": "Couldn't even finish it",
        "review_detailed_main": "Cringy woke garbage and not even close to the humor and fun of the original."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ashikjohn2010",
        "review_rating": "9",
        "review_title": "One time watchable",
        "review_detailed_main": "Its a funny movie and you can expect to see everyone back in this movie. Watch it and have a good time!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Lestat_DeLioncourt88",
        "review_rating": "7",
        "review_title": "A lot better than I expected",
        "review_detailed_main": "There was some old school cultural humor that I thought was funny. The overall story was ok."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "garrettbaroni",
        "review_rating": "5",
        "review_title": "Tired. Mostly unfunny.",
        "review_detailed_main": "Very very disappointing. The son character is cringe worthy"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "custar55",
        "review_rating": "2",
        "review_title": "Dammit!",
        "review_detailed_main": "Only good part was the barbershop scene. This movie needed Darryl, soul glo, more McDowells and a different reason to come back to America. They were in America for 5 minutes. Looking so forward to this movie and it sucked. Leslie Jones and Tracy Morgan were not needed in this movie either. You screwed up Eddie. Arsenio's character was nothing like the first movie. More annoying that funny."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Paulowoo",
        "review_rating": "7",
        "review_title": "A solid 7 with some great nostalgia",
        "review_detailed_main": "So, I think we have all been waiting in anticipation for this to arrive, was it as good as the original...... no but it was definitely fun with some great cameos and a light sequel. I really suggest you watch this as what it is, a fun thing"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "dejhaki",
        "review_rating": "1",
        "review_title": "A peace of",
        "review_detailed_main": "I can't believe I watched this nonsense.\n\nIs there anything below one star which I can give this THING.\n\nFull of stupid ideas, stupid scripts, stupid acting, to name but a few.\n\nWhat is wrong with you people?\n\nTime and time again Hollywood is making us believe it can get even worse."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mflohr74",
        "review_rating": "7",
        "review_title": "Pretty Good",
        "review_detailed_main": "It was like, a funny Black Panther. Heartwarming, touching, and funny. The added characters were hilarious."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "missesluvjones",
        "review_rating": "7",
        "review_title": "Incredible Cast. Fun to watch!",
        "review_detailed_main": "This movie had flavor and what I enjoyed most is the thoughtful influence of nostalgia that was incorporated throughout the movie. It is not an easy task to pick up on a production 30+ years later and make it entertaining and fun to watch. Call it joy to see the likes of Eddie Murphy, Arsenio Hall, James Earl Jones, and Shari Headley return to join the addition of Leslie Jones, Wesley Snipes, Jermaine Fowler, KiKi Layne, and Teyana Taylor. Sequels in today's society hardly stand a chance to their originals, however if you're able to watch with a fresh pair of eyes and perhaps as a stand-alone, you can enjoy one heck of a ride. And, of course the music was incredible!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ducativiper",
        "review_rating": "1",
        "review_title": "This is the best they could do?",
        "review_detailed_main": "I give them credit for bringing back nearly everyone from the first one but that's about it. I don't understand why movies are lacking these days. It is completely forgettable and there's no worse way to describe a story than forgettable."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "russellhayse",
        "review_rating": "8",
        "review_title": "worth it",
        "review_detailed_main": "The majority of reviews hate it. Me, I thought it was great.... well the first act is fantastic. En Vogue, Salt n Pepper and Gladys Knight do this thing, it's awesome. Tracy Jordan is funny as, look, it's not brain surgery but it is better than most sequels."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Beckula182",
        "review_rating": "",
        "review_title": "Why are people so mad?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Top_Dawg_Critic",
        "review_rating": "7",
        "review_title": "This was more like a reunion party than a part 2",
        "review_detailed_main": "The first one actually had a story, it was heartfelt and well directed and written. This one hardly had a story, and what little story it had was a flawed version of the first film. It wasn't directed as well and it could've been edited better. It was however fun and funnier than the first one. It's like one of those high school reunions you attend 30 years later and still have fun and laughs like the old days. Wesley Snipes, Morgan Freeman, Trevor Noah and Tracy Morgan were an excellent addition to this film, as were the legendary musical talent, but Leslie Jones stole the show imo."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mikeadams-87293",
        "review_rating": "3",
        "review_title": "As expected.",
        "review_detailed_main": "Terrible sequel and an insult to the original. I only endured the full 2 hours as I was in hope it could redeem some value towards the end. Alas, I was not rewarded for this. It was all dreadful.\n\nThe best part of the movie was the small amount of outtakes during the end credits, they gave more joy than the movie itself.\n\nAvoid this and rewatch the original."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Smartfox32",
        "review_rating": "1",
        "review_title": "AWFUL!",
        "review_detailed_main": "This movie doesn't even deserve a review. Pure and utter trash."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jstanley-99134",
        "review_rating": "7",
        "review_title": "Simple Nostalgic Fun",
        "review_detailed_main": "It's nothing extraordinary, but it's not trying to be: just a fun movie to pass the time with. Great cameos and funny moments that mock times past and present without transgressing the times. Like the original, it doesn't shy away from America's flaws while also celebrating the freedom and opportunity the US has, which can in turn inspire others to incorporate some of it themselves."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "breadgunner-94454",
        "review_rating": "1",
        "review_title": "Leslie Jones ruined it.",
        "review_detailed_main": "The first movie was awesome because it had great flow so didn't need constant loud irritating jokes. This sequel is ok until Leslie Jones turns up to constantly interrupt it by being a vulgar loud mouth every 4 minutes.\n\nI waited 30 years for this movie and Leslie Jones ruined it in 60 seconds."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "karendenis-43957",
        "review_rating": "7",
        "review_title": "Coming 2 America...",
        "review_detailed_main": "I enjoyed seeing the references to the original movie. I don't get the negative reviews but to each his own. The original is usually the best in sequels and this was as expected. Many returning characters and quite a few cameos."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "nikmcrae",
        "review_rating": "2",
        "review_title": "Don't even bother.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Kmhapps",
        "review_rating": "7",
        "review_title": "Zamunda returns",
        "review_detailed_main": "I gave this movie a 7 cause I really just enjoyed seeing the old cast all together again. Might of lacked a bit of that Original movie humor that we love. But not many fun family movies around anymore to just enjoy. And enjoyed seeing some new faces."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fishybowl",
        "review_rating": "2",
        "review_title": "Straight to video",
        "review_detailed_main": "If this was the 90's , the only place you could find this ,is at the close out shelf at the video store ."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "bblbb",
        "review_rating": "8",
        "review_title": "Overhyped, but not as bad as you'd think",
        "review_detailed_main": "It's better than you'd expect from a sequel. It's not like the first one was up for Academy Awards.\n\nI went into it thinking I'll give it 5 minutes to say I gave it a chance. I stayed for the movie. The biggest surprise was they still had that woman jumping around on one-leg, barking like a dog.\n\nIt's as good or better than most movies out, now."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "strudie",
        "review_rating": "7",
        "review_title": "Ahh the memories",
        "review_detailed_main": "Brought back some brilliant memories. Actually enjoyed it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "drenglish",
        "review_rating": "2",
        "review_title": "Nostalgia doesn't make up for lack of story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "zsingerb-1",
        "review_rating": "",
        "review_title": "Racism still",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "gahdric",
        "review_rating": "7",
        "review_title": "Not that bad",
        "review_detailed_main": "Most of the reviews on here were very negative and I don't understand why. Was it a good as the first, not a chance, Was it decent.... actually yes."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "baumer",
        "review_rating": "1",
        "review_title": "Terrible sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "codefool",
        "review_rating": "7",
        "review_title": "Laugh! It's funny!",
        "review_detailed_main": "It's good to see Murphy returning to his roots. This film does not pretend to be anything it isn't - a fun romp filmed in bright colors with colorful characters and actors poking fun at themselves in the most undignified way possible. I laughed out loud many times and smiled the rest just to see something that was light, funny, a little heart, and didn't speak one word of political anything. Sure the plot is wafer-thin but that's not the point. It's good to see people fall in love and talk about their feelings again. Extremely refreshing. And after Murphy's fantastic \"Dolomite Is My Name,\" his triumphant showing on SNL, and this - hopefully one of Hollywood's funniest is staging a comeback from quite a few dry years in which nothing he did was funny. Here he does what he does best - entertain.\n\nSo, rather than listen to all the nay-sayers out there, give this a go. And laugh, it's funny!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cristineblackley",
        "review_rating": "7",
        "review_title": "Good sequel",
        "review_detailed_main": "Very good sequel and nice to see that they brought back so many characters from the original. Just wondering why the McDowell sister was left out..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ThunderKing6",
        "review_rating": "2",
        "review_title": "What happened?",
        "review_detailed_main": "Dude, that was horrible.\n\nProducers and actors should be ashamed of themselves.\n\nWhat can be learned? How to ruin a legacy.\n\nVerdict: Sickness."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fflegend",
        "review_rating": "10",
        "review_title": "About as good as one could expect",
        "review_detailed_main": "33 years later and a sequel to a classic American comedy! I reallly enjoyed it, admittedly I had low expectations but I was pleasantly surprised. I was smiling almost the entire time. They really did a great job recreating this masterpiece. Honestly on par with what Cobrai Kai did with Karate kid. Seeing Randy Watson be the singer at the wedding pretty much put me in tears. Great job, thanks for the effort, I loved this film."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ifeobi-07253",
        "review_rating": "7",
        "review_title": "They did their best",
        "review_detailed_main": "It was never going to be as good as the original. I had my doubts going in but as it turns out, it wasn't bad. Although they could have toned down some of the silliness but overall, I enjoyed it"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "LmH82",
        "review_rating": "1",
        "review_title": "Nope.....",
        "review_detailed_main": "Really disappointing, tried too hard to be something it could never be, looked really cheap and rushed..... thirty years later... the Lion says it all... So glad the cinemas aren't open here in Scotland, what a waste."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "helenduthie",
        "review_rating": "7",
        "review_title": "Sad there's so many bad reviews",
        "review_detailed_main": "I feel like people aren't taken this sequel the right way, it's meant to be tongue in cheek and wouldn't be the same without all the throwbacks to the first film that made us laugh, defiantly worth a watch and is a lighthearted reminder of the humour of the first film. Not something I watch more than once but great if you remember the first film."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tennym",
        "review_rating": "1",
        "review_title": "Such a disappointment",
        "review_detailed_main": "Watched the original and this back to back, which made it painfully clear how bad the sequel was. I was laughing throughout the original, I laughed once during the sequel. Watched it once and never again. I'm just going to pretend it doesn't exist during my annual viewing of Coming to America."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "stephenpaulgarsh",
        "review_rating": "7",
        "review_title": "Not That Bad! Come On!",
        "review_detailed_main": "We watched it and were thoroughly entertained. It was tough to top the original, but this was a good effort. Always amazed at the great character makekup and the multiple roles played by Murphy and Hall. Leslie Jones did a great job too."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "michealchristou",
        "review_rating": "1",
        "review_title": "WORST",
        "review_detailed_main": "This movie must me some kind of joke, but it ain't funny if you know what I mean."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cousy-27166",
        "review_rating": "7",
        "review_title": "It's a bit of fun",
        "review_detailed_main": "I liked it. God to see all the old cast. Not great story but it's fun. Time has changed. Can't expect to feel the same as original. It does create nostalgia though. Think I'll watch the first four the thousandth time now. Try not to watch with any expectations. Just enjoy!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "TheFearmakers",
        "review_rating": "2",
        "review_title": "Not Much Without John Landis",
        "review_detailed_main": "The original COMING TO AMERICA was no accident. It took experienced filmmaker John Landis to pull off what he did for THE BLUES BROTHERS, which came out before working with Eddie Murphy in TRADING PLACES: That is, blending music into comedy without it being a musical-comedy, and very few directors could pull that off, and this sequel is proof... they still can't.\n\nIt's understandable that the semi-retired Landis isn't on board, but in trying to recreate that same magic originally sparked by the collaboration of Landis and Murphy with only an older, overweight Murphy on board just doesn't feel or look right...\n\nThe biggest problem is his son from Queens, Jermaine Fowler, with a loud, annoying mother. Then again, their Bad Sit-Com style fits this contrived sequel more than the once-great Murphy, again alongside sidekick Arsenio Hall, who, like all the other familiar faces, seems to be going through the motions. The only new characters that kind of work, allowing Fowler's \"young Prince\" to stretch beyond the intentionally recycled plot, is KiKi Layne as his half-sister, reluctantly aiding in a dangerous task...\n\nAnd Nomzamo Mbatha as his royal hair-cutter and basically the new version of Sheri Headly: a free-thinking bride to change the age-old rules. Unfortunately, this love story is far too rushed to matter, inserted into the 11th hour what took the entire original movie to pan-out more naturally, and humorously."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "frozenburrito",
        "review_rating": "8",
        "review_title": "Good times were had",
        "review_detailed_main": "I consider the first one a 9.5, this is a pretty decent sequel. Really enjoyed watching and had some laugh out loud moments. Loads of nostalgia getting so many actors back. Don't know why there is so much hate in the reviews. Good movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jlplasencia",
        "review_rating": "6",
        "review_title": "Decent once-watch but was never going to match the original",
        "review_detailed_main": "It's an entertaining and fun enough film, enough to watch and laugh at least once. But it's nowhere near as good as the original. On it's own it's alright, I really enjoyed how they brought everyone back from the first film and then some. Ignore the haters, give it a watch and enjoy the silly, fun, witty, trip down memory lane."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jonreastwood",
        "review_rating": "2",
        "review_title": "Terrible. Even without Covid, this is straight to video/streaming stuff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hecklerandjokmm",
        "review_rating": "2",
        "review_title": "Wow I guess consent is one sided only",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "screensport",
        "review_rating": "6",
        "review_title": "A trip down memory lane",
        "review_detailed_main": "Hade huge expectaitions for this one. Eddie has not been funny in ages if you ask me. Maybe we would get lycky this time? Well, This was a \"breath of fresh air\". Yes, the plot is similar to the first one. But I surely had a smile on my face watching this, mostly for remembering how good the first one actually is. It felt like I was brought back in time to meet my old friends. The \"barbershop guys\" still rocks :) Not the best of movies, but a good trip down \"memory lane\"..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jacekkowalczyk",
        "review_rating": "4",
        "review_title": "Very disappointed",
        "review_detailed_main": "My high hopes were dashed with this unoriginal cliched poor story debacle . Should have been called Coming to Zamunda since the America clip was a few minutes long . Plastic acting and poor digital effects."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "katkapsz",
        "review_rating": "7",
        "review_title": "If you like Coming to America, you will like this",
        "review_detailed_main": "I used to watch Coming to America as a kid whenever it was on and in our home it is a classic. And yes, the sequel might not be a progressive update of the original, but rather a loveletter to the spirit of the first movie. Packed with cameos, you will enjoy this old school tribute to the original Prince od Zamunda. Relax, grab some popcorn and enjoy this pure escapism. Why not."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hfrqgac",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "This movie should not have been made.. didn't laugh once. Cringy woke parts. I was expecting a lot more since the original is one of my favorite movies of all time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "joeruffincanada",
        "review_rating": "7",
        "review_title": "Sequel to my favorite comedy ever",
        "review_detailed_main": "I'll admit my expectations were very high, but it doesn't touch the original. You know how some movies you love so much you almost learn it word for word? Unlike the original, it doesn't have that feel at all. I did enjoy it and am gonna watch again, but after this, I'm officially tired of the sequels and reboots."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sqpudm",
        "review_rating": "1",
        "review_title": "Really bad and boring",
        "review_detailed_main": "The first part was funny and fresh. The second looks as tired as Eddie Murphy in the role of a middle age king. All the characters who were funny or interesting, now are dull and boring.\n\nAvoid this flick!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cattecall",
        "review_rating": "10",
        "review_title": "So Much Fun!",
        "review_detailed_main": "So good to see everyone, whether live or in background photos! What a beautiful celebration & infusion of African American Pride! Great themes, costumes, cast, dancers, & songs! True to the spirit of Zamunda, and up-to-date, as well! Thanks, sincerely for the memories! I'm so grateful & happy for the Experience! Keep it coming!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "lisafordeay",
        "review_rating": "7",
        "review_title": "Well I enjoyed it. Welcome back Eddie Murphy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "matthewssilverhammer",
        "review_rating": "3",
        "review_title": "Snipes rules, though.",
        "review_detailed_main": "Almost every one of the (very few) laughs I got from this movie was based entirely on my knowledge and enjoyment of the original film. The massive cast is almost completely wasted, including a shamefully long middle-section where there's little sign of Murphy. It's a remarkably predictable movie that feels like a long-lost genre-curio of lazy \"comedic\" filmmaking from the 80s and 90s."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "itzthead",
        "review_rating": "2",
        "review_title": "Truly a disgrace to the film industry",
        "review_detailed_main": "It's hard to figure out exactly what makes this movie so horrible. There are so many things, and there's just no redeeming features whatsoever, so I think it's easier to sum it up that way rather than listing specific things. I guess there are a lot of terrible C movies like this, but it's notable seeing it come as a sequel to a pretty good movie, and to come from a well-respected actor. Otherwise I wouldn't be bothering to write this.\n\nAlso, the movie felt the need to jump on the social justice bandwagon, which I would have no problem with if it didn't seem so forced, or if the arguments they used actually made any sense. Apparently it's a travesty that the royal lineage only passes to males, and it should clearly pass to females instead. Yet no character in any part of the movie ever questions the existence of a ROYAL LINEAGE in the first place. Like hmmm, maybe we shouldn't have a throne at all? But no, the same way liberals talk about having more female CEOs or whatever, they're fine with these oppressive systems as long as the rulers are more equally distributed across identity groups."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jaimemedina-36288",
        "review_rating": "7",
        "review_title": "Simple movie from a simpler time. I loved it.",
        "review_detailed_main": "I made a bowl of pasta. Wrapped up work early and sat down to watch. I didn't have very high expectations to be honest. The first movie was a simple comedy, not The Godfather. So I had no illusions.\n\nBut the cast is great. It's not a laugh a minute. And to the extent every sequel is like it progenitor, this falls in line. And maybe, just maybe it's a story we need to hear again.\n\nI love it. Sentimentally I love it. It reminded me of my youth, of watching with my high school friends in the movie theater, of my fist car, of so many things that I found myself smiling the whole way through.\n\nIt works for me. Take it on its own terms. I thinks that supposed to be the point."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mattatthemovies",
        "review_rating": "1",
        "review_title": "One of the worst things I've seen in my life!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "misrey-67550",
        "review_rating": "7",
        "review_title": "Haters gonna hate...",
        "review_detailed_main": "How can any fan of the first film not enjoy this film? I absolutely LOVED it. Is it as good as the first? Maybe, maybe not. But it's great nonetheless. Eddie's still got it. The cast is incredible! I love that most of the cast came back for the sequel. The new characters added a lot of new laughs and the original cast members/characters were just as funny as they were all those years ago. I did miss Eriq, tho. The throw back clips to the the first film were awesome, timely, and a smart move. They even threw my very favorite line (is that velvet?) from the first film back in. Looooved the nod to the Dukes, too! I loved the costumes and the dancers made me feel like I was right there in Zamunda. This film is a class act and it's so much fun. It doesn't try to be anything but that. Don't listen to a thing the haters say, Eddie. You did the first film justice by making the sequel a blast to watch. It was a great time, often laugh out loud funny. I liked it so much, I'm watching it again. Queen Aoleon would be proud. Well done!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "statuskuo",
        "review_rating": "1",
        "review_title": "Horrid",
        "review_detailed_main": "Thanks to IMDB for reviewing my review and allowing me to change this to a 1 instead of a 2.\n\nA nice family reunion album but the lead young man is obnoxious. Why not make him sweet like Prince Akeem was in the first one? This is a writer and director that doesn't trust their modern audiences."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "does a disservice to the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sarastro7",
        "review_rating": "7",
        "review_title": "Haters be crazy",
        "review_detailed_main": "You gotta laugh (and I mean laugh hard and harshly and condescendingly) at the entitled, spoiled Covidiot brats who rate this movie 1 star. Okay, so it wasn't as good and original as the first movie. Who expected it to be? But it was perfectly fun and enjoyable. Like an amusing bit of extended extra material on the Blu-ray of the original. Like a very (very!) high-end fan production. Fun!\n\nThere's NOTHING that exposes a small mind as much as the tendency to only rate a movie a 1 (hate!) or a 10 (love!). A normal intellect will be more nuanced than that. Only idiots will rate a movie a 10 because they didn't HATE it and a 1 because they didn't LOVE it! Maybe IMDb rating skills should be a subject in school? No-brainers!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "randyfabiano",
        "review_rating": "1",
        "review_title": "I loved the first the 2nd was terrible",
        "review_detailed_main": "I turned it off. This is what happens when sequels dont have great writers. Total flop. Watched half way and was like what else is on. I truly loved the first the second was literally one of the worst eddie murphy films ever. Its almost as if CW said lets make another and try to be hip. Totally dumb and a waste of time and studio dollars"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kpanesar-49339",
        "review_rating": "8",
        "review_title": "Enjoyable",
        "review_detailed_main": "Just watched this film, could not wait for it to come out, The film was good enough, lots of music and pagentery, with some special guest singers, Akeem goes to find his son, then the story is about what happens to them. The film is good enough, there were some slow parts, its over all watchable and fun to see all the flash backs from the first film and good to see that they bought back Sexy Chocolate, and all the old characters."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "darkenedaze",
        "review_rating": "7",
        "review_title": "The movie you didn't know you needed",
        "review_detailed_main": "Let's not split hairs on this one - as a stand alone movie, a viewer may have some issues. But as a sequel, it hit all of the buttons it needed to, creating a warm reunion with old friends you realise you missed a lot more than you thought you would. Seeing Wesley Snipes and Eddie Murphy in top form just added to the fun."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "wesleyt-20639",
        "review_rating": "1",
        "review_title": "When you think of trash, think of Coming 2 America",
        "review_detailed_main": "The outhouses in Zamunda don't stink as bad as this movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "therealpeterchambers",
        "review_rating": "1",
        "review_title": "Coming 2 America : feminism strikes back",
        "review_detailed_main": "Sadly a massive disappointment, barbershop scenes aside a very painful viewing experience... You knew it was heading the strong female empowerment guff from the training scene with akeems daughters, forget the fictional history and tradition in the movie ... Let's wipe it out to appease feminism... Boring and political"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "MJB784",
        "review_rating": "6",
        "review_title": "Another unnecessary Eddie Murphy sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "corpse_man",
        "review_rating": "1",
        "review_title": "Predictably \"modern\" retread of the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jbarrientes-41680",
        "review_rating": "6",
        "review_title": "TIME CHANGES AS WELL AS PEOPLE",
        "review_detailed_main": "I'm seeing a lot of low ratings for this movie ranging from 4's & 5's to even some 1's and I think I know why that is it seems many people are going into this movie expecting it to be a pure outlandish with memorable character/personalities an a story like the last one and that's just the problem, if your judging this one by the first one then don't even bother watching it.\n\nThat was 1988, Eddie Murphy is at a different point in his life no longer that brazen, raw, NC-17 comedian that he was at the time so therefore it's only logical that this film would be different. DON'T go into this movie expecting that type of comedic film because your just gonna be disappointed and a movie like that like the previous in an of itself would be a tough act to follow. We're we all wanting that? Yes. Myself included.\n\nHaving said all of that judging it at face value; it's not a bad movie IMO sure it's more family oriented and tamed overall but I honestly wasn't offended by that since I found there to be a nice rounded mix of old and new characters with much care & personality fleshed into them as well as the story I thought the actors did a believable job playing it I even was surprised that there was actually some tears being shed in the dramatic scenes abd the comedy like I said it serves second to the story and while yes it tamed PG-13ish I laugh maybe not out loud hardcore rolling on the floor but certainly audible, an still found myself smiling and chuckling much\n\nFlaws? I wish the backstory of main villain and the girlfriend were a bit more fleshed out the main villain's character, and his evil agenda as well as the girlfriend of our leading actor. I was hoping her backstory was a bit more detailed since a good chunk of the plot revolves around her. Also I wish her & the rest of Akim's kids had more involvement in dialogue and attention. Lastly from the time the first one ended to now I wish I would've know about what happens during the 33 year span from the first one nothing too much but a little history and details here and there between the main characters and zemunda.\n\nOverall this movie felt like more of a stand alone than a sequel and I actually thoroughly enjoyed it. Not as memorable but a good film to watch with the family if you just wanna have some laughs and a lighthearted story. (:"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "olusina70",
        "review_rating": "",
        "review_title": "I knew it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jesselw",
        "review_rating": "7",
        "review_title": "Everything we wanted...",
        "review_detailed_main": "The ratings I have seen have been lower than deserved.\n\nYou should look at this sequel in a similar light to Cobra Kai Season 1 as a sequel; It gave us everything we wanted from a nostalgia sense.\n\nThis movie is very self aware. It knows what made it a cult classic and it pays homage to the fans' favorite parts. Fortunately, because there are so many favorite parts in the original, the result is a good amount of enjoyable content here.\n\nIt's a shame that I've seen ratings in the mid 5 range for this. Perhaps it's been reviewed as a standalone movie by a generation that isn't familiar with the original. Taken for what it truly is and for who it's really made for, this was a very enjoyable movie!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "pasha-93789",
        "review_rating": "2",
        "review_title": "Garbage!",
        "review_detailed_main": "Eddie just ruined one of his legacy movies.\n\nAbsolute abomination to watch.\n\nShame on everyone involved.\n\nI rarely write reviews but most warn you guys about the utter garbage here. Also if i could take it back i would not have ruined my memory of the first movie back in the days which was one of the defining movies of its time. All in all: stay away from this one especially if you loved the first one!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cjenkinson-66190",
        "review_rating": "10",
        "review_title": "Loved it!",
        "review_detailed_main": "Listen, it's not the best film ever made and I'm not sure what people expect these days?! It was everything I expected, cheesy, fun, entertaining and full of nostalgia which ticks all the boxes for me!! I thought the costume and set designs were extraordinary, terrible CGI but really who cares this isn't a sci fi movie. What I really liked was you can tell everyone making it was having a really good time and no one was taking it that seriously.. I thought it was hilarious 😂"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "DrAtelectasis",
        "review_rating": "7",
        "review_title": "I was so excited for this. But wow",
        "review_detailed_main": "I haven't even finished the film yet. I'm watching it as I type this on my phone. There is nothing funny or cool about this film. Eddie Murphy did AMAZING as the barber but did nothing as akeem. He was lifeless and not funny at all. Everything felt forced. I don't mind music with films like this but putting in \"pop\" music to make it appealing to the new generation just didn't work at all. This is one film I was excited for but expected it not to be good because I knew nothing could live up to the original. However, it was far worse than I ever expected"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Instant_Palmer",
        "review_rating": "2",
        "review_title": "Cringe! Awful (No) Script! What Were They Thinking?",
        "review_detailed_main": "There really isn't much one can say in a review of what is one huge movie bomb 💣. The concept was apparently to skip hiring a screenwriter, use the original movie's plot (that term loosely applied here), set up a story board, and ad-lib dialogue on the fly (\"ok Arsenio, why don't you say \"X\", and Eddie, you say \"Y\" and give us that Eddie Murphy forced smile look😬... Ok Action!\").\n\nNo creativity (\"oh wait, we can send a girl-power message this time - yea, let's add that!\"), nor much effort in developing comic moments.\n\nI cannot find one scene that works here - it is an embarrassment and I literally cringed watching several scenes.\n\nI'm being generous in rating this 2-Stars, and justify such for the costumes and make-up which were the only things that exhibited effort and quality.\n\nThe absence of Director John Landis in this sequel clearly made the biggest difference between this disaster and the original that did EVERYTHING better than #2.\n\n'Coming 2 America' sets the baseline for 2021's worst film. Let's hope there is not a worse movie ahead."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "domp-33430",
        "review_rating": "",
        "review_title": "Struggling for the right words.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cricketbat",
        "review_rating": "6",
        "review_title": "I didn't ask for this sequel, but I don't regret watching it.",
        "review_detailed_main": "Coming 2 America isn't particularly original or clever, but it is fun to see the cast from the original Coming to America back together again. The references to the first movie are what really hold this film up. In fact, the story gets weaker whenever they focus on the new characters. The plot isn't particularly original or clever, and it comes off heavy-handed at parts. I didn't ask for this sequel, but I don't regret watching it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "barrystoddart",
        "review_rating": "1",
        "review_title": "My mistake",
        "review_detailed_main": "I started watching this thinking it was the sequel to one of the funniest comedies of the 80's but it was just a woke/blm commercial. Seriously though,if you think this will be funny,it isn't"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "driftdog",
        "review_rating": "7",
        "review_title": "Classic sequel!",
        "review_detailed_main": "Well, it is a sequel and in my opinion it is exactly that. There are quite a few funny parts and many not so, yet unfortunately so, there are many cringe worthy moments. It feels like a real push to relive something that was once really good, unfortunately I would argue, it didn't really work to well. On the plus side there are some well known names and the acting is generally pretty good. I would say it's not bad but don't expect fireworks and cheers."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "vinylmixer",
        "review_rating": "7",
        "review_title": "I don't get the hate for this film!",
        "review_detailed_main": "I was sceptical of this sequel as I love the original movie and I had read the negative review's but thought I will check it out myself,I actually found it very funny and touching,was great to see the original characters of the first film and it looked like they had great fun making this film,people saying this film is woke compared to the original are wrong in my opinion,I found it fresh how it made the female characters strong compared to the first film,each to their own what people think of this sequel but I loved it and would happily watch it again!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "bhh-31955",
        "review_rating": "1",
        "review_title": "Predictable and boring. And why the politics?",
        "review_detailed_main": "Love the original Coming to America, but this movie was such a disappointment. I feel like Hollywood is more interested in pushing their political ideology then making a good movie. Woke and very few funny jokes. I think I laughed out loud 2 times, so there's that lol. Thanks Hollywood for making another sequel that should've never been made."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ocallaghan002",
        "review_rating": "10",
        "review_title": "Worth waiting for",
        "review_detailed_main": "Eddie murphy is a legend. This film is worth waiting for. I loved it. Watch it for you're self and judge. I through it was well worth the wait. I laughed a good bit at this film. Judge it for yourself and see."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "6",
        "review_title": "Coming 2 America",
        "review_detailed_main": "Coming 2 America has a joke of making sequels to old movies that nobody asked for.\n\nPrince Akeem (Eddie Murphy) returns to America with Semmi (Arsenio Hall) to find the illegitimate son that he unwittingly sired in the first movie. This is done by new scenes with the actors deaged.\n\nAkeem becomes king of Zamunda. As he only has three daughters, he needs to groom his new found son Lavelle Junson from Queens to be the new crown prince. This understandably upsets Akeem's eldest daughter as well as his wife Lisa.\n\nAkeem also wants Lavelle to marry the daughter of the bellicose General Izzi (Wesley Snipes) from a neighbouring kingdom. This way he will unite the families of both kingdoms.\n\nComing 2 America recognises that the world has changed since 1988 and has a more inclusive outlook.\n\nThe subtext being that it is Akeem's daughters who take on General Izzi. It still explores the themes of marrying the person that you connect with.\n\nIt is a fun filled sequel with plenty of nods to the original Coming to America and other Eddie Murphy films. There is a quick shot of a painting of the Duke brothers from Trading Places (as well as Coming to America.)\n\nJohn Amos and James Earl Jones are just few of the actors who reprise the roles from the original. New veterans include Tracy Morgan and Wesley Snipes who almost steals the movie in what is now for him a rare non action role.\n\nThis is still Murphy's and Hall's movie. They also reprise many of the other characters they played in the original such as the Barbershop characters who must be over a 100.\n\nIt is not as good as the original when Murphy was in his pomp but it has some heart and soul. It also has a fair few cameos including Morgan Freeman, En Vogue, Salt n Pepa and Gladys Knight."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "CriticsVoiceVideo",
        "review_rating": "1",
        "review_title": "Major drop in quality.",
        "review_detailed_main": "I probably chuckled four times. Major drop in quality in terms of performances, writing, costumes, and overall production. It felt cheap, too tryhard, \"woke\"(of course), and just plain boring. The barbershop scenes and the scene where Princess Lisa got drunk served as the only moments where the actors showed some of their old spark, but it's just not enough. No one had any presence. It felt like a parody of the original, \"Lion King\", and \"Black Panther\". Just skip it. It's really not worth it. It's just playing on blatant nostalgia with so many nods to the original that It's practically a remake, and a very bad one at that. It felt like the film was specifically designed around including as many nostalgic moments as possible, down to some of the same costumes but cheaply made this time. Just like the whole film. Total bomb. You've been warned."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "starksjason",
        "review_rating": "1",
        "review_title": "Woke trash...",
        "review_detailed_main": "It's painful to watch and does nothing but undermine its predecessor. I'm embarrassed I watched it all the way through."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "aryndar-622-43750",
        "review_rating": "",
        "review_title": "The worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tonyrstevens",
        "review_rating": "7",
        "review_title": "Why the hate?",
        "review_detailed_main": "So many negative comments and reviews!\n\nIt's a silly comedy movie not a biopic of Mother Theresa.\n\nSome funny jokes and some unfunny jokes. It's a movie to watch and wither a couple of hours away.\n\nI enjoyed it for what is was."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "scottberman-15-187262",
        "review_rating": "7",
        "review_title": "If you like the first you'll like the second...",
        "review_detailed_main": "Anyone overthinking the review if this movie did not get the first one. Sure the story is a bit thin and cliched but it is a pleasant reminder of how the original became forgettably iconic.\n\nWorth a watch."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "CINEMAS32345",
        "review_rating": "3",
        "review_title": "Overhyped, and there wasn't supposed to be a sequel.",
        "review_detailed_main": "This movie had soooooooo much hype over the last few months. It's good to see characters from the original movie come back, but this movie has been so corny, dry, cringey, and infested with played out corny jokes.\n\nI wanted to like this movie, but this sequel just wasn't it.\n\nEddie Murphy and Arensio Hall vowed NOT to do a sequel. They should have listened to their instincts.\n\nSuch a waste."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "marce29",
        "review_rating": "7",
        "review_title": "I loved it.",
        "review_detailed_main": "The barbershop scenes had me laughing out loud. Maybe it was nostalgia, but I loved it. Maybe it's not a masterpiece, buy I'll take that over the alternatives we have today which are apparently only superhero movies...."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "peter-45673",
        "review_rating": "1",
        "review_title": "One of the worst movies of the year.",
        "review_detailed_main": "They overdone every scene with this movie. Coming to America 1 was really good. This sequel is terrible. To much screaming, to much over the top singing, to much over the top dancing. Can it be to much? Yes! Everything was over acting."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "vader1948",
        "review_rating": "10",
        "review_title": "Nice job👍🏻",
        "review_detailed_main": "A fun sequel well done I enjoyed this. Lots of familiar characters and a decent story. Eddie did well with this film thanks I needed a good comedy. 😎👍🏻"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tafihove",
        "review_rating": "7",
        "review_title": "Eddie Murphy didn't write this",
        "review_detailed_main": "What do you expect when Eddie didn't write this. This is like copy my essay but change a few details. Gave a 7 because of the original cast."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kylehawthorn",
        "review_rating": "1",
        "review_title": "What a waste.....Terrible Unworthy Nearly Unwatchable",
        "review_detailed_main": "I will not even waste too much time reviewing this garbage disgrace. Just re-watch the original and know the best has already occurred and we will never recapture that magic."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jre1976",
        "review_rating": "1",
        "review_title": "Dreadful",
        "review_detailed_main": "Each person involved in this monstrosity should be ashamed."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Deelite2333",
        "review_rating": "",
        "review_title": "Don't!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "biancaygianna",
        "review_rating": "7",
        "review_title": "it wasn't THAT bad",
        "review_detailed_main": "Reading the comments im surprised. I thought they all would be between 5 and 8 but ...\n\nit doesn't have a plot, that's true, but it's still entertaining and funny. not my favourite movie of all times and not a perfect sequel. I understand why it would be less than expected but the movie is still watchable. I you liked the first movie, watch this one (specially if you watched it when it just came out); it'll bring nostalgia and be wondering which everyone looks so young yet so old at the same time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "essendon2009",
        "review_rating": "1",
        "review_title": "Very bad film",
        "review_detailed_main": "Absolutely awful iam sorry Eddie Murphy but the 1988 film by John Landis was epic of that era and I love it with Arsenio Hall, John Amos and co. In my opinion don't redo classic movies like this."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "rubendeetman",
        "review_rating": "7",
        "review_title": "idk what all the fuss s about",
        "review_detailed_main": "The movie aint that bad idk what yall whine about?? Its funny"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "highonphotography",
        "review_rating": "1",
        "review_title": "NO ONE ASKED FOR THIS!",
        "review_detailed_main": "Pure garbage, unfunny and it was filmed in ATL. This looks like it was written and directed by TYLER PERRY. I can see John Landis shaking his head. I guess what I'm trying to say is I HATED THIS MOVIE!!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kjohnson-21",
        "review_rating": "7",
        "review_title": "What's withe all the bad reviews? I think some people just like to complain about everything.",
        "review_detailed_main": "Great production, cast, music and some good laughs. Doesn't take itself too seriously. Perfect Saturday afternoon entertainment. Lighten up folks."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "marcobch",
        "review_rating": "1",
        "review_title": "If you liked the first movie do not watch the sequel",
        "review_detailed_main": "Terrible! A total waste of time!\n\nI finished the second movie just because I had nothing better to do but to be honest, staring at the TV turned off should have been better, more entertaining."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "roxylady_1977",
        "review_rating": "10",
        "review_title": "Nit disappointed in a sequel!! Love, love, love!!!",
        "review_detailed_main": "Everyone that knows me, knows that coming to America is my favourite movie of all time. I have no waiting for this movie to come out and I was a little bit nervous until I saw the trailer. Well let me just say that I was not disappointed at all. In fact it brought back such good memories I love that they had all of the original cast in the movie. I love everything about this movie. I love how they modernised it and made everything positive and And just really really funny! I laughed out loud. I even teared up here and there. I guess this one will now have to be my 2nd favourite movie of all time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "valleyjohn",
        "review_rating": "7",
        "review_title": "More fun than i was expecting",
        "review_detailed_main": "I'm not one of those people who adored the original Coming To America but I know plenty of people who did , so I wasn't particularly excited by the thought of a sequel but do you know what ? It was not bad at all and I enjoyed it.\n\nThe African monarch Akeem learns he has a long-lost son in the United States and must return to America to meet this unexpected heir and build a relationship with his son.\n\nUnlike the first film , most of this is played out on Akeem's African setting and it doesn't lose anything for the fact that there's not the \" In America \" situation.\n\nThis is a whole heap of fun . Not unlike one big party . There are lots of surprises and guest appearances from musical artist from the 80's and if you are as old as me it can't help but put a smile on your face .\n\nWe also see the same characters from the first film and it's great to see the old men from the barbers shop .\n\nThe star of this though is not Eddie Murphy or Arsenio Hall but Wesley Snipes who plays General Izzi, the rival of Prince Akeem . Never has man looked like he's enjoying himself as much as Wesley is.\n\nComing 2 America isn't a masterpiece. It's predictable and arguably unnecessary but it made me laugh quite a few times and that's all that matters ."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "airborne_trooper",
        "review_rating": "2",
        "review_title": "Coming 2 America IN NAME ONLY",
        "review_detailed_main": "I could kinda tell by the previews that this movie wasn't going to live up to it's predecessor. Being that the original was one of the greatest comedies of all time, I honestly didn't expect it to anyhow.\n\nEven though the original was a comedy, there was a level of seriousness to it, with good story telling, whereas this movie is just goofy. It's like a long SNL skit spoof about Coming to America. Even the original characters don't seem like their old selves. I'm currently an hour in and still not quite sure what the point is. It's just one disjointed scene after another. I tried, but no. It's trash."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Shire_Folk",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "If you loved the first film, don't watch this number two.\n\nThe overall plot (if you can call it a plot) and the cringeworthy try-to-hard acting especially by the new inclusions makes this movie pretty much unwatchable.\n\nThe only feel good part of this is that it has most of the original actors in."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "JonDymonds",
        "review_rating": "",
        "review_title": "Sacrilegious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "calicut110",
        "review_rating": "6",
        "review_title": "Holds up pretty well to the original",
        "review_detailed_main": "This could have been a disaster like many sequels after many decades. That said, it was quite good. Funny and silly just like the first one. All the same actors, it was great!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "flicklover",
        "review_rating": "1",
        "review_title": "Why Eddie? Why?",
        "review_detailed_main": "Coming to America is one of Eddie Murphy's most charming and funny films. The idea if going back to his character of Akeem and bring back most of the cast for a sequel sounds good right? But when I saw the trailer for this sequel I was not expecting much. Trailers, especially for sequels should make you excited to see them. This one didn't. And after enduring the hour and 45 minutes of this film I can see why the trailer was so bad. There was no good laughs to put in it!!!\n\nThis is one of the worst sequels ever made. I know that it was released straight to streaming but I feel that Paramount must have had no confidence to release this in theaters. Yes I know that theaters are virtually empty because of COVID but if this were released under normal circumstances I think it would have failed at the box office. I get that sequels are mostly cash grabs these days and are almost always inferior to their originals but the dip in quality of this film compared to the first one is gigantic!!! It is not only unfunny, it is aggressively unfunny!!! I might have chuckled once or twice, but it was seriously unfunny. It obviously banks on yhe nostalgia that people have for the original and tries to hit the same beats but fails miserably. They bring back just about every actor from the first film here, but it feels like it's just they were brought back so people could acknowledge that they came back, nothing more!!! But worse is Eddie Murphy and Arsenio Hall. All of the chemistry they had in the first film isn't here!!! They are just not funny. What they do is supposed to be funny, but it just isn't. They both play multiple characters again, many of the same ones they did in the first one liked the old guys in the barber shop but the scenes just didn't work for me!!! I wanted to laugh but just didn't. Eddie Murphy's performance seems phoned in. He doesn't seem to even want to be there. He can be so funny and in the case of the first film charming. There is none of that here. The supposed story here is that Akeem, now King, finds out he has a son in America. Akeem goes back to Queens to meet and bring his son back to Zamunda so he could become heir to his thrown. Also there is a plot point about a militaristic dictator of a neighbor nation played by Wesley Snipes demanding one of Akeem's daughters marry his son. All of this is more or less done like the first film but without any laughs or charm. I just don't get why so many funny and talented people could be so unfunny. It doesn't help that this sequel comes 33 years after the original film. Nostalgia could only take you so far. Last year Bad Boys For Life did what this film couldn't recreate the feeling and chemistry between its leads and deliver alot of good laughs. Unfortunately, Coming 2 America failed miserably in doing that. The first film is a very funny and charming fantasy. This has none of what made the Coming To America enjoyable.\n\nThe fact that almost everybody that was in the original is back and that didn't help says alot. Also, I think that the prior film being directed by John Landis helped. He was a very reliable director of comedies. The new director Craig Brewer doesn't seem to have the chops for this material. Bad script, lazy performances from your star equals disaster.\n\nI don't know why but Eddie Murphy sequels seem to just be bad!!! I think the only sequel to an Eddie Murphy hit that I've liked is Beverly Hills Cop 2!!!\n\nVery Bad sequel here, maybe the worst in his career!!!\n\nGrafe: F."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "CT-782",
        "review_rating": "7",
        "review_title": "enjoyable sequel, lots of fan service",
        "review_detailed_main": "The orig, 'Coming to America' was one of the funniest movies I've ever seen. This sequel was \"most enjoyable\" and definitely more than I expected from a 30-year follow-up. Lot's of negative reviews on here, which I'm gonna have to go ahead and disagree with. *I could care less about the quality of cgi in a nostalgic comedy that primarily focuses on dialogue.\n\nAs with many things, my advice would be to watch it and decide for yourself. My-T-Sharp scenes alone are probably worth your time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fvnurp",
        "review_rating": "1",
        "review_title": "Trash!",
        "review_detailed_main": "The original movie is definitely something that should not be touched. They tried way to hard to make this movie happen. The plethora of celebrity cameos was a bit too much. No need to watch this movie again"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "subxerogravity",
        "review_rating": "7",
        "review_title": "Solid Gold!",
        "review_detailed_main": "Big shoes to fill and they filled them nicely. A lot could have gone wrong waiting 33 years to do a sequel to one of the most iconic movies of all time. It would have been better to do a sequel two or three years after and have that fail, but 33 years, now that Coming to America is officially a classic!? People would never let that go.\n\nSo let's get this out of the way, Coming to America is a classic. You can't touch Coming to America. What you can do is make a really funny movie. I would expect this is what it would be like if Eddie Murphy actually started doing stand up again. We all worry if he could possibly top what he did 30 years ago and forget what we were talking about cause we are laughing too hard.\n\nFor someone like Eddie who was joined with a big ensemble cast of who's funny, I knew making us laugh could not be a problem. What did take me off-guard was how heart warming the film was. It's just like the first cause while the main story, or the one they advertised, was about Prince Akeem discovering he has a son back in Queens that is heir to his thrown (Despite fathering three more than capable daughters with Lisa McDowel), Coming 2 America has a similar love story to it's original. It also has a huge theme about the love of family which I dug.\n\nLike most sequels that come out decades after it's original, the movie is littered with references to the original, which did not wear me out as I thought it would as I was really happy to see so many faces from the first film. I will say all the jokes from the first film are in this film and are updated for 2021 (all except one bit that I guess makes sense cause it's just too 80s (you'll understand when you see the film).\n\nThey added all the old characters they could (Rest In Peace Marge St. Claire). I mean they even called back Garcelle Beauvais who was barely an actress when she had a small part as a flower girl in the original, just to be a full fledge actress now doing a cameo still tossing those flowers. All that and they had a big stable of new ones they had to put in the mix, but it works cause everyone was funny and charismatic.\n\nThe great modern day fairy tale did not even need and update but it got it and it was great!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "letande",
        "review_rating": "1",
        "review_title": "Didn't happen...",
        "review_detailed_main": "* SIGH * And here it is, the second \"blast from the past\" disappointment in a row... First, we've got Tom & Jerry with Spike crapping all over the place and now? Now we've got this. Like everybody else, I loved the original movie. Together with Trading Places, it was, like, one of the best comedies from eighties. So, even though I tried to keep my expectations here as low as possible to avoid being disappointed much, I still hoped for good. Like Agent Mulder? I wanted to believe. Unfortunately... yeah. You know how it is. Didn't happen. Like... at all.\n\nFirst of all, it's exactly as forced as you may expect. Every single scene and every single line here screams \"forced\". The original Coming to America was daring, it was fresh and, well, it was... you know... FUN. This? It's just a forced mess. One of those movies that you forget right after you're done watching. Heck, it was actually hard not to fall asleep here. The main idea wasn't really that bad (long story short, the new movie tried to focus on Zamunda instead of Queens), but writing is so terrible that... seriously, how many people worked on the story and screenplay here?\n\nComing 2 America (the one who came up with the title alone should be punished) is one of those movies where some random people talk about some random stuff and you just sit there, wondering why in the freakin' world should you care and when this torture will finally end. Watching this movie? It's like visiting your distant relatives. It's kinda boring, it's kinda awkward and you can't stop thinking about just how much you want to go home. And guess what? The movie is almost two hours long, so I'm really glad that I watched it at home where it was easy to take a break and do some more exciting stuff. Like watching the paint dry, for example. Watching this movie in one sit? It's plain boring. Sure, humor is a subjective thing, but while I laughed all the time while watching the original (still do), this time? I didn't even smile once. It's THAT uninspired. Every time there was an attempt for a joke, I was like \"good grief, seriously?\". The original impact so-o-o ins't here...\n\nAlso, it's a bit too woke. In a bad way. I mean, don't get me wrong. I like woke stuff. Adds quite a lot to the impact, as long as the writing is right. Then again, you know how it is. There are times when such stuff feels natural. When it does make you care. And there are times when it feels painfully forced, out of the place and actually plays against the writing. You can't just make things interesting and exciting just by saying the right things, you know? You need a good writing to make people feel involved. Here? It feels like nobody even cared. They took one of the most popular comedy movies from eighties, they've tried to re-create some of the most famous parts (like those scenes in the barber shop), they've tried to copy / past some of the old jokes (without much success since, like I said, the original impact is long gone), they've added some woke stuff just because it's a right thing to do and BOOM! Your new Amazon Prime movie is ready. Seriously, guys, those female Ghostbusters were more funny and exciting than this. And I never thought I'll say that. Like... ever!\n\nThe only thing I actually liked was Akeem's daughters (one of which is played by Eddie Murphy's real daughter, Bella), but guess what? They've barely used the characters. Seriously, even though there was, like, a ton of potential, the girls barely appeared at the beginning and near the end of the movie. While the rest of the thing was just our painfully generic stuff from all those Eddie Murphy movies nobody really cared about. You know, Dr. Dolittle, Nutty Professor... I really wonder if the man is cursed, or something. After the initial success in movies like 48 Hrs., Trading Places and Beverly Hills Cop, the movies with him started to feel EXTREMELY forced in uninspired. And this one? Heck, even Meet Dave was more funny than this.\n\nNot only Coming 2 America was unable to repeat the original success, it's also one of those sequels that actually ruin the original quite a lot. Not only it's forced and isn't funny at all, it ended up ruining good old characters. Lisa McDowell, for example, feels absolutely terrible now, while Cleo barely have a reason to appear. Not only this movie won't make you laugh, there's a big chance it'll actually make you feel sad. Just because seeing a great movie from your childhood being ruined in such a poor way? It's... you know... SAD. Dixi."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jennymariesanchez",
        "review_rating": "10",
        "review_title": "Stop hating",
        "review_detailed_main": "I thought this was great. If you liked the first one you'll like this. They brought back everyone they could from the original movie and the new cast worked well. Not an oscar winner, but fun. I really enjoyed it and I love Wesley Snipes!!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "structuresystemic",
        "review_rating": "7",
        "review_title": "A lot of fun.",
        "review_detailed_main": "I only gave it a 7 because I thought it could have used more action but all in all this movie is a rocking good time. The dance/music numbers are fantastic and the sets and costumes too. The comedy is ace. Give it a watch!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "flatnacker",
        "review_rating": "2",
        "review_title": "So disappointing.",
        "review_detailed_main": "I wanted to like this movie, I really did, but the negative reviews are right, it would be generous to call this a steaming pile of donkey faeces."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "dpenna3280",
        "review_rating": "1",
        "review_title": "I gave it a 2, but barely!",
        "review_detailed_main": "I loved the original so much with its fantasy feel of Cinderella meeting her prince. It had just the right amount of comedy, glamour, and just the perfect amount of humility. This was just a mess, and very little humor, and I excruciatingly watched it till the end!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "emmamad",
        "review_rating": "7",
        "review_title": "Can't believe what I'm reading!",
        "review_detailed_main": "I like Eddie Murphy and I like the first film. Yes they brought most of the original cast back. They kept the same comedy style and who cares about cgi. It's a sequel to a classic film which kept us laughing all the way through. Cheer up you miserable lot and give it an honest review."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "GilbertDrengot",
        "review_rating": "5",
        "review_title": "Coming 2 Amediocrity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "A-Ok_USA",
        "review_rating": "7",
        "review_title": "I'm here for it!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "superdave1225-1",
        "review_rating": "1",
        "review_title": "Worst movie I have seen in years",
        "review_detailed_main": "This is horrible and who ever gave the green light to this needs a new career along with Murphy."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jack-kelly15",
        "review_rating": "6",
        "review_title": "Fantastic Entertainment that will have you dancing on the sofa!",
        "review_detailed_main": "Firstly, I'm only writing this review as this film came out today and has only received negative reviews, which I find ridiculous. The film is very enjoyable. The plot is perfect for a sequel. The film has great nods to the original, and I think it says a lot of the film production and the reception of the original, that every single (alive) cast member makes a return (and the ones who sadly couldn't are spoke of with fondness). The film has so much energy it's almost like a celebration. The music is sublime, I was dancing along. And it was remarkable to see Murphy and Hall jump back into those character perfectly after 30 years! And the new addition of Wesley Snipes returning to a major picture was great too!\n\nIf you go in with the right attitude this film is the much needed celebration and light hearted entertainment that I certainly needed. Sure. If you compare it to the original you may be a little disappointed, but I'd suggest if you compare the original to the Ghostbusters or The Godfather you will also be disappointed.\n\nIt was great to see Prince Akeem bringing Zamunda to the 21st century, as it was great seeing this classic comedy being brought into the 21st century too. Also, I want to say this film was essentially free to anyone with Amazon Prime! If you're compare it to anything, compare it to the endless garbage titles on rental that you pay £9.99 for!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "lectra-43947",
        "review_rating": "1",
        "review_title": "Leslie Jones",
        "review_detailed_main": "She's terrible and tainted this whole movie. The plot was stupid and they were only in America for the blink of an eye"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mistergdskinner",
        "review_rating": "10",
        "review_title": "Zamunda Is Everlasting!",
        "review_detailed_main": "I found Zamunda to feel as pleasing to experience as I did Wakanda. Thank you King Akeem and Queen Lisa for letting us into your home!\n\nComing 2 America stirred within me some interesting questions about tradition vs modernity. I was pleasantly entertained by the cast of characters in their fantastic costume designs. I laughed, was moved at heart, pondered some things, and in the end felt good in spirit after watching Coming 2 America.\n\nIf not for anything else, do it for the heart and spirit within; joyfully experience some fine old friends and new for the gift that comes beyond the laughter. Zamunda is everlasting!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "osvaldoantunes",
        "review_rating": "6",
        "review_title": "A celebration to a classic, rather than a movie",
        "review_detailed_main": "This is more like an ode to Coming to America, rather than a sequel. It's worth of a couple laughs but don't expect anything remarkable here, except for seeing great black actors from the past and present in scene. But yes, it's a very silly movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "greg_loizou",
        "review_rating": "1",
        "review_title": "Did they even try?",
        "review_detailed_main": "Why wait 33 years to make a sequel and make it so badly. It's like a homage to the first movie but similar to your dad retelling an old Eddie Murphy classic joke. Seriously this is awful. I didn't expect a classic but this was so bad"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "youngcollind",
        "review_rating": "1",
        "review_title": "Ugh, just no.",
        "review_detailed_main": "I'm not even sure if I hold Coming to America 1 in that high regard, but I remember it to be at the very least, a comedy, like with jokes, that tried to be funny. This movie doesn't even swing for anything that could be construed as humour. The closest it comes is in casting Leslie Jones, as if to say, \"hey, she's a funny lady so her mere presence makes this a comedy, right?\" Wrong. The movie instead spends all of it's time on an inane princess and pauper plot line that strings together the worst Disney cliches. It did have a bunch of money put into it, which it wasted on grand opulent parties and dance sequences. Must have been a blast to shoot, but it's an absolute chore to watch."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "clottey",
        "review_rating": "7",
        "review_title": "Happy to have watched it.",
        "review_detailed_main": "Time has passed and the world has changed. It's no longer the 80's that for sure. You cannot bring back yesterday. So do not look for the exact same magic from the first movie. I liked it. It's fun and it was good to see the old cast back again. The story line is just for laughs. The references in it, will most likely not resonate with younger audiences. But for the likes of me when i was a youth, first seeing this movie. I'm not disappointed. Considering the really bad reviews so far. I dont understand it. Anyway enjoy this film. Have a few drinks before hand. Wakanda forever ;)"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "stevelivesey67",
        "review_rating": "1",
        "review_title": "Started off ok... then fell off a cliff",
        "review_detailed_main": "The opening was lovely trip down memory lane revisiting old friends.\n\nI gave it 1 star because.- *Lazy reverse story writing *Jermaine Fowler. Who is he and did he know this was a comedy. *White face *No diversity in casting *Leslie Jones doing her usual unfunny hoodrat schtick *usual woke politics as are prevalent in most films."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jnkiii",
        "review_rating": "7",
        "review_title": "Funny & Touching Tribute",
        "review_detailed_main": "There were plenty of hilarious moments in this sequel. I enjoyed the great tributes to the original. The first movie was a love story at its heart and this sequel remained true to the original."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "deanbeckton",
        "review_rating": "1",
        "review_title": "Unwatchable...",
        "review_detailed_main": "This movie is beyond terrible, we turned it off somewhere around the 30-40 minute mark as we literally couldn't take anymore, and we really really really tried to give it a fair chance. I don't want to get carried away, but it's hard to believe this actually got made. The story is so forced and disjointed and doesn't know what it wants to be that it's uncomfortably frustrating trying to figure out just what the point in this movie is, because it certainly isn't to make you laugh. Eddie Murphy is simply an empty shell of the comedy actor he was in the 80's, in fact, the whole cast are empty shells here; there's nothing behind their eyes except dollar signs... it's actually quite sickening to see them take advantage of their audience like that. I do get it, of course, it's easy money, and they'd be stupid not to take the gig, but at least put in some effort, ugh, why do I do this to myself?... Anyway...there's zero spark in any of the characters, and nothing is really driving them. There's no chemistry between anybody in any scene (that we saw), it actually felt awkward to watch the whole time. The actors are simply saying their lines like it's painful for them to speak, not one of them looks like they want to be there. Which brings me to the dialogue..... I'm not even sure I even want to go there because it's so cringe inducing. Nobody talks like that in real life. Well, they've already made their money, and it's pretty clear that's the only thing anybody cared about while making this embarrassment to cinema. It truly saddens me that this is the best they could come up with at this moment in time. I'll leave it there before I have a breakdown. PLEASE DO NOT TORTURE YOURSELF."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jessica81-1-188841",
        "review_rating": "7",
        "review_title": "The Prince of Queens",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "t-ktinney",
        "review_rating": "1",
        "review_title": "Eddie! Eddie! Eddie? Why?",
        "review_detailed_main": "This is one of the worse movies I've ever seen and one of the worse movies Eddie Murphy has ever made. Besides being boring, not funny, stupid, and just desperate, they brought back every previous character and shouldn't have. It seemed like filler to add time to the movie since there was a silly storyline that had nowhere to go or develop. Wesley Snipes' character is so over the top that I couldn't decide if it was bad or so bad it was good. And there's too much music and singing and dancing (ALL BAD TOO) that it also felt like movie filler since the storyline and characters had nowhere to go and nothing to do. Basically, a great classic movie, Coming to America, was given a lame, stupid, boring, and honestly a pathetic sequel that Eddie Murphy should be embarrassed to have made. SKIP! IT!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "michaelvanviersen",
        "review_rating": "10",
        "review_title": "No where near as bad as people say",
        "review_detailed_main": "Yeah it's not amazing but to come in an slam it with one star is a bit childish, it has its moments and it's a colourful movie and not a horrible watch, ten stars from me to even out at least one star that should have been a 5 making my rating a 5"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "alanngli",
        "review_rating": "6",
        "review_title": "It respects the original",
        "review_detailed_main": "This is not meant to be a masterpiece, so don't judge it as such. It needs to be entertaining and it did that for me, lesser so than the original but it was a very different time.\n\nI felt there was a few missed opportunities in bringing the sequel into modern times, but I think it made a reasonable attempt at that towards the end."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jscottmoss",
        "review_rating": "2",
        "review_title": "Why can't we leave politics out of comedies?",
        "review_detailed_main": "Not a week goes by that I don't reference a line from the original in some situation. It is a classic that is truly loved. Just like most, I really wanted to love the sequel that I waited for for all these years. People just want to laugh. We don't need Hollywood to tell us how we should think or believe. I gave it 2 stars instead of 1 simply out of respect for Eddie Murphy. He has given me so many laughs during my life. He just failed on this project."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "umadrfjnr",
        "review_rating": "2",
        "review_title": "Rather choke on ball of wool",
        "review_detailed_main": "Worst. Movie. Ever! Get a ball of wool and spend two hours choking on it. You will enjoy that more and you won't ruin and spoil the memory of one of the greatest comedy classics of all time. This one is so bad, we had trouble finishing it and we were cursing all the way through. Please make it stop!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "stescriv",
        "review_rating": "7",
        "review_title": "Grt to see original cast/characters",
        "review_detailed_main": "We enjoyed the film, yes it wasn't as good as the first BUT it had a lot to live up to and it didn't disapoint. Would definately watch 'making of' to see how many original cast were still alive to be in this movie. The true test of a film is Would I watch it again...yes!!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kaijaronson",
        "review_rating": "1",
        "review_title": "Nothing like the original",
        "review_detailed_main": "The original definitely 10 out of 10. This is not particularly funny has a very loose story and it's overall just kind of preachy.\n\nAn example of what happens when politics and social agenda replace quality and story.\n\nA real shame"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "rsteigman-173-79493",
        "review_rating": "",
        "review_title": "Had to stop watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Sexyjay71",
        "review_rating": "7",
        "review_title": "Likable",
        "review_detailed_main": "It's not a good movie and it's definitely not the worst movie. I have no idea what to expect because it's been more than 30 yrs since the original movie was released. I probably won't watch it again, but it is watchable with a few laughs."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "paulwattriley",
        "review_rating": "1",
        "review_title": "I had low expectations",
        "review_detailed_main": "I had low expectations but went far lower than I could ever imagine. It was total garbage and not all that funny.\n\nI shall end it there....."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "stlgem",
        "review_rating": "7",
        "review_title": "A Fitting Sequel",
        "review_detailed_main": "Enjoyable and worth the 30 year wait. It was great to see all the returning actors."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "aprilcary",
        "review_rating": "1",
        "review_title": "If I could give no stars I would.",
        "review_detailed_main": "Not funny, not original. I wish I could unsee it. Don't waste your time. All the reviews stating it's awful are TRUE"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "vivianlarbi",
        "review_rating": "10",
        "review_title": "Nostalgia at its finest!",
        "review_detailed_main": "They did a great job incorporating some old references in this sequel. Of course, it will never match up to the original, but it still made me smile seeing all the characters being brought back to the screen again. It's feel-good and family fun, and anyone that dislikes it probably takes it way to seriously. Relax, enjoy, and just soak in the nostalgic feels!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "andresfelipeml",
        "review_rating": "7",
        "review_title": "Enjoyable",
        "review_detailed_main": "I think that the first part of the movie, 10-15 minutes, is not good. But when the story started to be developed you can enjoy it and have a great time.\n\nIt's a light movie, with a simple and predictable plot but that doesn't make it boring.\n\nMaybe, the best thing of the movies are the customs. Ruth E. Carter made an splendid work here, beautiful."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "verbal-ken",
        "review_rating": "4",
        "review_title": "Dull and uninspired",
        "review_detailed_main": "Made me want to go back in time and watch the original one time less."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mbahar-37321",
        "review_rating": "2",
        "review_title": "Unfunny and unnecessary celeb camo",
        "review_detailed_main": "I found it difficult to have a good laugh with this movie. What made me snap is when I saw Trevor Noah playing a badly acted reporter .. It felt like they assumed it would be funny that a celeb is playing a role similar to his real life job.. haha not."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "lbowles-48048",
        "review_rating": "",
        "review_title": "Enjoyable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jjbuttons",
        "review_rating": "7",
        "review_title": "It wasn't as good as the original, but it wasn't bad...",
        "review_detailed_main": "It definitely wasn't as good as the original. But it's hard to make a sequel to one of the greatest comedy movies ever made, especially 30+ years later.\n\nI really enjoyed how they paid homage to the original, and how almost every actor returned, or made a cameo appearance. There was also a couple new actors who appeared.\n\nEddie Murphy was brilliant!!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "movieswithme",
        "review_rating": "1",
        "review_title": "God awful, overly modern PC BS excuse of a movie",
        "review_detailed_main": "This became nothing more than an overly slick, over edited, cartoonish version of the original with no clear lead character to root for, but even worse, also a PC fem statement movie like everything else made in the last 10 years. I've had enough... no more amazon for a while or maybe ever. Bring back risk taking film artists from the 70-80's please!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kirklaird-994-545537",
        "review_rating": "6",
        "review_title": "Of course it isn't the original",
        "review_detailed_main": "If you want to complain about it not being like the first one, just watch the first one again. It was a fun movie that aimed to please the fans. Love the first one, enjoyed watching 2. The cast was great, looked like they had a great time. Don't be stuck up and enjoy it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hassanmha-75894",
        "review_rating": "4",
        "review_title": "No plot no comedy and political",
        "review_detailed_main": "I am a massive fan of the first movie and I came with low expectations to this one considering it is made during the Covid period. I was hopeful that it will be decent in the light of the same cast. This movie is bulilt around positive messeges but it is simply forced and feels out of place in this movie. What makes things worse the comedy is just missing and dry. This movie does not have any of the magic and appeal the first one has."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jmartin-07717",
        "review_rating": "7",
        "review_title": "Don't listen to the hate. It's a solid sequel",
        "review_detailed_main": "Loved the 1st one, and this is a solid sequel with good acting and a good plot. As a caucasian American, I sense a lot of baseless white fragility in these reviews. Just watch it!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tecnicoobra",
        "review_rating": "1",
        "review_title": "One of the worst movies i have seen.",
        "review_detailed_main": "I only watched this movies because i have good memories of the first, but this one almost destroys a rest of respect i have to Eddie Murphy.\n\nSure one of the 10 worst movies that i have assit in my life."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ameshkov",
        "review_rating": "10",
        "review_title": "Uplifting while teaching movie",
        "review_detailed_main": "Comedy and satire for all of us to learn from and enjoy"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "lsb-39292",
        "review_rating": "6",
        "review_title": "Totally get the criticism but....",
        "review_detailed_main": "Yeah I get it, everything coming out these days has to be politically correct and it just takes away from the story but put that to one side, (like I find myself having to do on a frequent basis) this is a fine movie, it's a good laugh and should act as a nice little call back to the original. Lighten up and enjoy the movie for what it is."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kjproulx",
        "review_rating": "4",
        "review_title": "Another Late Comedy Sequel that's too Much of the Same",
        "review_detailed_main": "Coming to America was never a movie that I grew up watching, nor ever seen until fairly recently. Something about it just never appealed to me, and that's coming from someone who will watch anything. With that said, I thoroughly enjoyed watching the original film when I finally sat down to watch it. The goofiness along with a great comedic performance by Eddie Murphy is what held the movie together and made it so likeable. Well, 33 years after the first film, a sequel was just released on Prime Video, and while I have to admit that I laughed a few times, it's a very poor film overall.\n\nComing 2 America picks up in real-time with these characters, decades later. Prince Akeem (Eddie Murphy) is unimpressed that he has no son to be his heir once his newfound reign as King ends. Learning that he accidentally made a son of his very own while on his first trip to America, he ventures back to meet him and bring him home. This is also where today's lingo and humour are brought into the film tenfold, making for a very jarring experience in comparison with the first. I get it, the humour of the first film was very much of the time, as is this one, but it didn't click all that often for me. It felt more like pop culture references rather than legitimate jokes.\n\nEddie Murphy and Arsenio Hall are both once again very enjoyable here, trying to keep up with the times, and I even enjoyed Lavelle Junson as Akeem's son Jermaine. The biggest problem this film faces, however, is the fact that it feels like a copy and paste of the original film. Aside from a few side characters/plots that kept it from feeling identical, I honestly felt like I was watching the first film again, through the lens of 2021. It was like a blend of old and new, which has worked for some late sequels, but it didn't click here for me. That's a shame because this film has some very relevant underlying messages that are very well-done. I just wish they were in a better film.\n\nI truly believe the reason that so many people seemed to be looking forward to this sequel was the fact that Eddie Murphy has recently been appearing in more projects again. He definitely hasn't lost his charm, but just like the cast of movies like Anchorman or Dumb and Dumber, sometimes it feels like these actors are just trying to replicate the past. As I said, it has worked before, but it seems pretty rare at this point. I laughed multiple times, but only because of a few unexpected line deliveries from certain performers. There were a few scenes where it felt a little improved, and those were easily the best moments.\n\nOverall, the story plays out exactly how you think it will after watching the first 10-20 minutes. If for nothing else, it's good for a few laughs that are spread throughout the movie, but I just didn't connect with the story this time. I'm not saying late sequels to popular movies need to stop, but I believe they deserve more. This movie felt lazy to me, which was a huge disappointment. Coming 2 America is now streaming on Prime Video. Certain viewers will probably have a blast, but I personally can't recommend it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sanateam",
        "review_rating": "1",
        "review_title": "Embarrassing",
        "review_detailed_main": "Oh my goodness this whatever you may call it was embarrassing. The weird accents. So just throw together one continent with another, sprinkle in ridiculous accents and call it a sequel of a movie. No, no, no just no."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hanaahbraan",
        "review_rating": "",
        "review_title": "Disgusting parodies of 'African' culture part 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "gjramirezsr",
        "review_rating": "7",
        "review_title": "When you think of Garbage...",
        "review_detailed_main": "People will complain but I enjoyed the sequel. Always great to see Eddie and his characters from the past. Go with an open mind and appreciate the work that goes into bringing it all together for some family laughs and fun!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "bensentl",
        "review_rating": "2",
        "review_title": "Painful Money Grab Failure",
        "review_detailed_main": "Many years ago Eddie Murphy and Arsinio Hall starred in the original Coming to America. Is was fun and silly. The characters were well developed and I really enjoyed it. Then 30 years later they brought this sequel to the screen and it is a disappointing mess. They didn't even try. Coming 2 America is a cheap, painful money grab. Just horrible. The barbershop scenes are still the best part and if you enjoyed the those characters you will still enjoy this part of the show. The fun play on McDonalds and McDowells was still pretty cute, but those scenes are only small snippets. Everything else is so disappointingly bad."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sonofjorel316",
        "review_rating": "6",
        "review_title": "Look at it as a continuation and not a sequel",
        "review_detailed_main": "I've seen a lot of negative reviews on here for this film and to be honest, It's getting to the point I can't take any reviews seriously on here.\n\nHere's my completely unbiased take not expecting for one minute to live up to the original.\n\nIs the film funny? - Yes in places it is. I wasn't laughing the whole way through but, there was more than enough laughs through out this film to keep me entertained. I have no idea what viewers that have allegedly seen the film were expecting? On top of that It's Rated 12 in the UK so, It was never going to have the language or some of the jokes that were present in the original film.\n\nFor me, It was a nice little trip down memory lane. It was lovely to see how Akeem and Lisa were as King And Queen with Three kids in tow. In parts, Lisa handles being Queen a Lot better than Akeem does as King. Akeem is now a King, A Father, A Husband and Ruler of Zamunda and has a lot to juggle so for Akeem, a lot of the story has to do with rediscovering who he is.\n\nShari Headley As Lisa looks even better with age and the chemistry she had with Murphy in the first film is still there.\n\nWhilst we end up in familiar territory with Coming2America (No Spoilers) If you take this as a continuation of the story of Akeem then you won't be disappointed. If you are looking for this film to surpass the original then I would advise not to bother watching.\n\nI just like to add the supporting cast of characters especially Wesley Snipes as General Izzi were more than fine and competent in their roles and the return of some old favourites and a few surprises add a little bit more to the happy factor when watching.\n\nDon't get me wrong, In the middle of the film, I didn't find myself laughing as much but, The last 20 minutes, redeemed the film for me.\n\nIn closing, I don't think they ever set out to win any awards but the 1-3 star reviews it's been getting are rubbish. I've rated it a 6 because as I said, the middle of the film is a bit flat but, the beginning and end make that up for me.\n\nJust don't view it as a sequel, view it as a continuation to the original and you may be pleasantly surprised and, ignore any 1-3 stars reviews because they are fake."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jacobdulacrocks",
        "review_rating": "1",
        "review_title": "Who gave the OK for this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "colbymroberts",
        "review_rating": "6",
        "review_title": "6 stars for nostalgia",
        "review_detailed_main": "That might have been all they were going for, it seemed a little cheesy."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kftewmey",
        "review_rating": "1",
        "review_title": "Nothing More Than A Cash Grab",
        "review_detailed_main": "To put it in a single sentence: 2020 was almost as bad as this \"film\". Not only did it feel forced to me, but it also felt as though the cast wasn't really there, either (except for Wesley Snipes who was clearly just happy to be on screen again). I think James Earl Jones was held at gunpoint to do this. The storyline was lackluster at best. Bringing back the barbershop quartet (who must be 120 years old by now) was laughable in the worst way. I'm honestly surprised they didn't CGI Don Ameche & Ralph Bellamy to round out the idiocy... Or did they? I honestly made it 40 minutes in before I felt my IQ drop significantly.\n\nYou just can't make a PG-13 sequel to an R rated classic."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "patsfandad",
        "review_rating": "9",
        "review_title": "Ignore the negativity here its a great movie (No Spoilers)",
        "review_detailed_main": "It is a soft reboot of sorts it does at time step over places it did in the 1st movie.\n\nBut in a way that is enjoyable they hit all the nostalgic moments\n\nThey also have some of their own as well\n\nIt's a very well done sequel you rarely see after so long\n\nGood watch."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jose990",
        "review_rating": "7",
        "review_title": "Surprisingly good",
        "review_detailed_main": "Not sure what people people were expecting but just sit down and relax and enjoy it"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "shezza72",
        "review_rating": "1",
        "review_title": "Are you kidding me this fail of a film received an Oscar nomination!!!!!!",
        "review_detailed_main": "What is happening to the honest hard working film production companies. The first film was good and funny, but this film sort of blows bad acting badly timed jokes and as most agree not a patch on the first film. Yet it has now received an Oscar nomination. I'm speechless this pandering to the woke movement has too stop, we should be recognising hard work and talent as this is what the globe's and Oscar's were designed for. To celebrate artistic achievement, tenacity, commitment, talent and many more and now it's done as a token gesture. This ridicules these award ceremonies to be outdated out of touch and one heck of a joke lol cos someone is having a laugh knowing it is undeserved. The user and critics reviews on this page say it all. Just to be clear I've been brought up to treat every walk of life equal but this film is no way equal to alot of great films in the last two years that sadly didn't get a look in."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "dcperdew",
        "review_rating": "1",
        "review_title": "1398 reviews of 5 star or less of which 842 are 1-2 star, only 957 reviews are above 6 stars.",
        "review_detailed_main": "From the beginning this movie was giving off bad vibes, and it just kept getting more and more ridiculous as the film went on. Blatant politically fueled bs in a rancid package. Unbelievably, I did manage to make it all of the way through this farce. I was a fan of Eddie before this and actually laughed my way through most of Pluto Nash, while trying to ignore the warning Easter eggs that were everywhere in that film."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "suzysandor",
        "review_rating": "",
        "review_title": "Stale and tired",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "uncomfortable premise",
        "review_detailed_main": "It's the 30th wedding anniversary of Prince Akeem of Zamunda (Eddie Murphy) and Lisa McDowell. They have three daughters. King Jaffe Joffer (James Earl Jones) is dying. General Izzi (Wesley Snipes) is demanding a marriage to tie together the rival neighboring countries. Akeem needs a son to take over the country. Semmi (Arsenio Hall) reveals that he coerced Akeem into a forgotten sexual encounter with Mary Junson (Leslie Jones). Akeem and Semmi go back to America to find Akeem's son Lavelle Junson (Jermaine Fowler).\n\nThe premise with Leslie Jones is uncomfortable and very awkward. The movie tries its best to play it off as something funny. It's not funny. It's really not funny for Lisa and the rest of the family. As for the male ascension to the throne, the solution is obvious and the audience is forced to wait for Akeem to come up with the only right answer. I would suggest a different route for the initial premise. In between the two movies, King Jaffe could become a widower and he had a fling with a Queens woman. By this movie, his young son from that union would be the next heir but he's estranged and don't want anything to do with Zamunda. That's the cleaner and less yucky way to get to the same general location.\n\nAs for the rest of it, it's fun. One needs to ignore the uncomfortable premise. Just enjoy this for what it is. It's a bunch good people reuniting and having a good time. There is no meanness to anything. We're revisiting beloved old characters and everything works out in the end. It's fine."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "znytfwc",
        "review_rating": "3",
        "review_title": "Awful Attempt to Revive a Classic",
        "review_detailed_main": "They have made a poor attempt to try and revive a classic. With a lot of the original cast this just appeared to be a pay check with a desperate story line. I watched in hope only to be disappointed from a poor thrown out script that lacked any relationship (other than the characters) to the previous. The random cameos did not help or support this film but just added to the desperation for it to be liked.\n\nIt is just another obvious love story which you can guess the ending by less than half way in. I held on in hope for it to be a slow burner and get better the further you watched, this was not the case. This is certainly one that can be missed with poor attempts at comedy and writing."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jrclare",
        "review_rating": "6",
        "review_title": "It wasn't as terrible as everyone is making out.",
        "review_detailed_main": "Was it as good as Part 1? No. However it wasn't a steaming pile of zebra dung either. There weren't too many laugh out loud jokes but that's better than had it been peppered with over the top stupid humor (which sometimes happens).\n\nI just got compelled to write a review that at least paints a picture it was still watchable and enjoyable. Great to see most of the cast and characters back together."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "crush-727-179149",
        "review_rating": "1",
        "review_title": "Dont waste your time",
        "review_detailed_main": "Very bad movie, really disappointed me.\n\nThe first one was so good, but this is a crap. Sorry. It was a big mistake to make this movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ricrud76",
        "review_rating": "7",
        "review_title": "Not as bad as some of these reviews",
        "review_detailed_main": "It's ok, a good Saturday afternoon feel good film. No more than that.\n\nA few laugh out loud moments and that's it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "prewettegp",
        "review_rating": "2",
        "review_title": "What a disappointment.",
        "review_detailed_main": "This movie isn't a movie. It's a string of cameos. It truly is sad to see Eddie put this out with a stamp of approval. Don't waste your time. What a sh**ty \"movie\"!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "oboffa",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "I haven't laughed for a week but this movie just did me."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "UniqueParticle",
        "review_rating": "6",
        "review_title": "Solid for reunion and nice for Oscar nominated makeup",
        "review_detailed_main": "I understand the 5.3 rating there's nothing special just a solid Eddie Murphy and more goofy than previous one. Impressive how James Earl Jones was 88 during filming of this yet still reasonable health. Morgan Freeman's voice for announcements will remain legendary that's for sure! Also one of Louie Anderson's last roles rip. A lot of great cast carries on from a 37 year old classic and this one is pretty fun for what it is! The dialogue is mixed it has its moments, the acting is good enough, makeup is great even though it didn't win the Oscar, and I love soundtrack quite a bit. So good that barber folks are they were among the best in the original."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "denizjaffer",
        "review_rating": "2",
        "review_title": "Huge Letdown",
        "review_detailed_main": "I am a massive fan of the original but what the hell has happened to people who made this including Murphy. This movie has been made family friendly which has taken the edge of the whole thing. Murphy is just a side show in this & although it's nice see the gang back together this is a proper let down. The comedy is lightweight. Fans of the original won't be happy whilst some newcomers will probably like it. What a great opportunity wasted."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "AGood",
        "review_rating": "4",
        "review_title": "Leslie Jones Ruined the movie",
        "review_detailed_main": "Leslie Jones is not funny. She spends every role shouting and screaming her lines and just acting obnoxious and somehow this is classed as humour. It is not, she is irritating.\n\nThe premise of the movie is Leslie Jones character was supposed to have drugged and had sex with Akeem the first time around in the 80s and they had a baby he was totally unaware of. So in this me2 climate this is deemed a laughing matter to base an entire movie upon when its a women doing it to a man I guess.\n\nOverall this was an awful movie. It was unfunny and tiresome. I will say however I loved Nomzamo Mbatha as the royal Barber. She stole the film and made it a 4 as opposed to a 1. And John Amos is brilliant as Cleo McDowall as is Shari Headley's Lisa McDowell. They were the only sparks in a tired by the numbers movie. Everyone else, especially Arsenio Hall, looked tired and lacking any energy."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "MirellaStan",
        "review_rating": "",
        "review_title": "Exactly what it should be!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "loreliford",
        "review_rating": "6",
        "review_title": "It was cute",
        "review_detailed_main": "Is it Oscar worthy, no. Was it nice to see these characters again, yes. Was it a bit cheesy, yes. Did it make me laugh a few times, yes. It was cute."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "aliromario",
        "review_rating": "2",
        "review_title": "Weird pace, forced cringy hiphop soundtrack",
        "review_detailed_main": "Big fan of the original. This sequel is just embarrassingly bad. Extremely weird pacing with awful editing.\n\nDidn't anyone on the set yell out \"cut cut .. one more take\" ? Because the whole movie needs another take.\n\nHuge admirer of Eddie Murphy, loved his performance in \"Dolemite is my name\" and was hoping he would continue in fine form (also Craig Brewer the director). Sadly Eddie's performance is the weakest one in the movie. Can it be his worst performance yet?\n\nIn the lead up to the movie I watched Eddie's interviews where he claimed \"we have gone above and beyond with the sequel\". The end result couldn't be further from the truth. Awful direction, filled with lame and cheesy \"Kardashian\" type jokes just to keep up with the times. It just seem so forced.\n\nI wished they kept the R rating and the grimy, grainy dirty New York look of the original. This movie looks so crisp, almost like a HD soap opera tv show.\n\nThe original was such a classic because of the \"raw\" feeling that the supporting cast like Frankie Faison (it's a damn shame what the did to that dog) contributed with. Nothing like this in the new one.\n\nFeels like a bad SNL sketch. Clean, lame, weird and without charm. I felt robbed."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "batata-21368",
        "review_rating": "6",
        "review_title": "Horrible story. Great costumes.",
        "review_detailed_main": "The story line was just a sad excuse to make a movie, but the costumes were spectacular. Thank goodness this movie moved at a very fast pace, otherwise I would have baled very quickly."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "YRLY59E",
        "review_rating": "4",
        "review_title": "Blown opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tcozartbosley",
        "review_rating": "6",
        "review_title": "Wesley Snipes...thee best!",
        "review_detailed_main": "Wesley Snipes demonstrates his comedic chops. I loved his accent. His acting was most vivid and entertaining via his non verbals from dancing to facial expressions. I enjoyed the movie most whenever he was on screen."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "crisafi_tony",
        "review_rating": "1",
        "review_title": "When is enough, enough?",
        "review_detailed_main": "We get it! White people suck, men suck, girls are awesome! Writers have have given up... I was so hopeful for this sequel, I thought Eddie would have the guts to stand up to bad writing because he doesn't need the money, guess I was wrong... is there another place that is able to make movies other than woke political Hollywood? I'd like to be entertained by them. Thanks for ruining a classic. Shame on you Eddie for letting this happen under your watch. Sheer and blatant GREED is shown all over this film."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tonyw-16090",
        "review_rating": "8",
        "review_title": "I don't get all the hate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fishnmamaof",
        "review_rating": "6",
        "review_title": "Loved the costumes!!!",
        "review_detailed_main": "This was a fun movie. All the political stuff is just a play from the first movie! People need to chill out these days and not take everything so seriously. It was a sweet movie and loved seeing all the old characters. I do think Leslie Jones was a bit much and my goodness does Lisa ever age? She is stunning! I found it enjoyable. Just remember, don't expect an oscar winning movie. 😉"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sam-carter180",
        "review_rating": "1",
        "review_title": "Cheap and pathetic.",
        "review_detailed_main": "I'm 18 minutes in. Cheap and pathetic. If this movie was written at all, it was 'finished' in less than 5 minutes. An insult."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "wtoolen",
        "review_rating": "1",
        "review_title": "This officially replaces \"Pluto Nash\" as Eddie Murphy's WORST movie.",
        "review_detailed_main": "It's so bad it made me dizzy. I can't even begin to express my hatred for this awful movie. No script, just a mish-mash of bad musical and dance numbers, flashbacks, lingering reaction shots (raised eyebrows, mouths agape, and \"oh DAYUM\"s) and way too many actors with nothing to do. Mix in a GENEROUS amount of woke, PC trash and you have this movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "brettlerickson",
        "review_rating": "6",
        "review_title": "Simm'r Down Now",
        "review_detailed_main": "Is it great? No. Is it entertaining? Yes. Definitely rough around the edges. But there is still charm underneath those rough edges. Yes the plot is thin. But it's effective. And I'm not sure why there's so much hate around Leslie Jones and Wesley Snipes? Both were funny and neither distracted us from the larger story. But that's just my two cents..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "melvynsibson-48083",
        "review_rating": "1",
        "review_title": "Dull and predictable",
        "review_detailed_main": "What a waste of money, acting talent and my time. Don't waste yours by watching this drivel."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "brandy1179",
        "review_rating": "6",
        "review_title": "Hmm",
        "review_detailed_main": "Was this an unnecessary sequel? Yup\n\nBut here's what I did like about the movie\n\nI love how they had a bunch of the original cast in this movie, and I loved seeing Eddie Murphy and Arsenio Hall playing the multiple characters, though when you look at it how in the heck would these people be still alive lol.\n\nLeslie Jones and Tracy Morgan playing brother and sister was perfect, they definitely look like they could be related just based on their personalities. Loud and obnoxious lol.\n\nOther than that I thought this was decent, not better than the original or even equal to the original, but this was still entertaining. Most sequels (with the exception of the Lethal Weapon franchise and the Back to the Future franchise IMO) don't do well to impress the original audience.\n\nIt's great to see these characters back on the screen, but this sequel probably would have been better if it came out 10-20 years ago."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "stuartabrowne",
        "review_rating": "4",
        "review_title": "Disappointed",
        "review_detailed_main": "Where has all of the talent gone? The original Coming to America was an instant classic. Eddie at his finest. So why make this remake? Did they not know it would fall short of everybody's expectations? They must have. It's the end of an era. Or did that end years ago. I believe the later.\n\nEnjoy at your own risk."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sanchandi37",
        "review_rating": "7",
        "review_title": "Great fun 👍",
        "review_detailed_main": "Never going to be as iconic as the original but still a good laugh"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jam-72884",
        "review_rating": "1",
        "review_title": "Oh Hell Naw!",
        "review_detailed_main": "The first movie is one of my favorites. This movie was a total cringe fest and painfully unfunny. Zero thought went into this and it shows. Eddie is fat and old and showing his age badly and should have said no to this. The Magic is lost and long gone. They waited way too long to make this. The one good thing about this movie is Beyonce wasn't cast in it. Yuck."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "phqegmt",
        "review_rating": "10",
        "review_title": "Excellent sequel!",
        "review_detailed_main": "Excellent, very well done! Bravo! Enjoyed the cameos and blend of new and old characters, great refreshing story as well, I need more of these type of films"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "rickhollandrah",
        "review_rating": "6",
        "review_title": "Not the Original but okay",
        "review_detailed_main": "It was never going to be a classic like the OG , but it is a celebration of the original and looks like the cast are having a laugh making it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Sadistic_undertone",
        "review_rating": "3",
        "review_title": "I don't want to be too harsh in my review...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Little-c",
        "review_rating": "1",
        "review_title": "Pure cringe.",
        "review_detailed_main": "Just awful. Yet another sequel for the sake of a sequel, even the title is daft, they're in America for about 8 seconds! As usual Eddie gives us his cartoonish over acting making us think it's supposed to be a comedy with just one problem, it isn't funny!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "S-t-a-t-i-x",
        "review_rating": "",
        "review_title": "Empty husk",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hosamalhajaj-94665",
        "review_rating": "7",
        "review_title": "So funny!! Not an Oscar type but funny!",
        "review_detailed_main": "First mind my language I'm not a native speaker but I will try my best...\n\nWhen I saw movie's bad reviews and rates I thought I'm gonna see a very bad movie but actually it wasnt! The movie was funny not the Oscar type of course but funny made me laugh a lot it's worth watching it's better than the first one.. Well done.\n\nPeople should not judge a movie to be always amongs the best.. As along as it's funny had perfect characters different storyline.\n\nLeslie Jones and Jermaine fowler had played a perfect role in the movie they were enjoyable.\n\nThere are of course a Few parts of the movie which it shouldn't exist but in general it was not as bad as most people judged in the reviews section."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "danielsageenc",
        "review_rating": "1",
        "review_title": "Makes Dumb an Dumber sequel Oscar Worthy",
        "review_detailed_main": "I lasted watching this for 7 minutes and had to turn it off. I couldn't ruin the original for myself that was an all time classic"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "rayberny-30677",
        "review_rating": "6",
        "review_title": "I liked it",
        "review_detailed_main": "I may be the only one, but I found the movie funny and true to the original. What was anyone expecting? It was a goofy premise to begin with. The silliness continues in the second movie. I was impressed by the cameos and great costumes. It's tough to come back 30 years later with a sequel. There were plenty to smile and enjoy about this movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "HorrorFan6969",
        "review_rating": "1",
        "review_title": "Mehhhhh. Really not good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "andiroids-1",
        "review_rating": "6",
        "review_title": "Great Cast terrible movie",
        "review_detailed_main": "After Eddie Murphys recent renaissance with his last couple of movies being pretty good I had hopes for this sequel. Then the cast list was announced and my hopes got higher but hell this was a difficult watch. I just about made it to the end but I don't think I'll be rewatching it any time soon.\n\nPoor."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tmed-81353",
        "review_rating": "3",
        "review_title": "Worth it... barely",
        "review_detailed_main": "Was excited to see this. It did have its moments, but in the end seemed like more of a cash grab. They put actors in it just for the audience to say \"hey I remember them.\" Al's a tad predictable. Saw the ending coming a mile away."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "helenderbyshire",
        "review_rating": "10",
        "review_title": "Great feel good",
        "review_detailed_main": "Just what you need In lockdown a good feel good movie to cheer you up. Am a massive Eddie Murphy fan so love his films. Wesley Snipes is ace too. Plenty of laughs and all good fun. Glad we had a part 2 even if it was a long wait. Cheers guys"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sidelo",
        "review_rating": "7",
        "review_title": "Good for what it was.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "janpanten",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "If you were afraid of a cheap, lame cringefest after the brilliant first part, you were right. This film is so bad on so many levels, just don't. Unwatchable."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "daniandrageorge",
        "review_rating": "1",
        "review_title": "No diversity.",
        "review_detailed_main": "That's a bad movie.... Nothing to make worth your time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "phollyjunk",
        "review_rating": "",
        "review_title": "Holy ish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "TigerTamer",
        "review_rating": "7",
        "review_title": "Not perfect but a fun nostalgia trip",
        "review_detailed_main": "I'm seeing lots of negative reviews, don't let others sour your own experience. I found it to be a solid enough sequel story with some funny callbacks and enough enjoyable moments of its own. It's worth seeing just to revisit the old cast and characters. Eddie and Arsenio have still got it, and it's supported by some great performances from the original and new cast, especially Wesley Snipes, who clearly loved flexing his comedy chops here, with that despotic charisma he gave us back in Demolition Man.\n\nI was wondering how woke they'd take this sequel, understandably some people could find the first movie to be problematic 33yrs later, (mostly the gender inequality and outdated African stereotypes) but the sequel does a good job of keeping enough of the same humour for modern audiences. The CGI animals were not good, at all, and tbh it probably could be 10-15 minutes shorter, but I enjoyed it, and you might too. 7/10"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "saucie",
        "review_rating": "1",
        "review_title": "Possibly the worst move I have ever seen",
        "review_detailed_main": "Terrible story, terrible acting, terrible everything. I would actually give negative stars if I could. Absolutely awful. Awful Awful Awful"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kenrichorton",
        "review_rating": "6",
        "review_title": "I'm ok with, wanted more, but I'm ok",
        "review_detailed_main": "I did find myself wanting more from this movie, more laughs. I know we came with high hopes, and that's why this film didn't go well with most people. Yes It should have been better after all these years. But our mind frame was different back then. Remember how cheesy horror films were back in the day, we wouldn't dare watch them today. I just looked for heart in the movie, and I believe they tried, they had more than enough time. I'll watch it again see what I missed. Black women were beautiful in this film"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "TheEnglishChap",
        "review_rating": "1",
        "review_title": "\"What A Girl Wants\" verbatim",
        "review_detailed_main": "I gave this a one star as I could not give it a negative-star rating. Why? Has more product placements than a James Bond movie. McDonalds (in multiple scenes), Crown Royal, Bulgari, Pepsi, Spotify, Friskies, Puma, Nautica, Coors Light, Chevrolet (Malibu), Lyft, Bose, Apple, and Tesla to name a few of the blaring obvious. Then there was the multi-punch cameos of En Vogue, Salt 'n' Pepa, Lil Kim, and Gladys Knight. I think John Legend whined a song during the credits. The jokes fall flat. As one reviewer wrote, the film gives viewers the impression that black culture is about weird phrases and hip-hop music. Frustrating and vastly self-depreciating. Every major black actor had a role, and yes, even Morgan Freeman. I was half expecting to see Denzel Washington or Jamie Foxx pop up. The only two white characters in a speaking role were a dithering tit for the 'McDonalds\" corporation and an accused business owner who was being accused of being handed everything. Very cringe-worthy. And by far the worst part, is that this is almost a carbon-copy of 2003's \"What A Girl Wants\". Not seen it? Amanda Bynes and Colin Firth. Much better story line, warm-hearted, far funnier and charming all the way. Eddie, I am stunned by this movie. You were epic in \"Beverly Hills Cop\" trilogy and many other after... but this is a super-low point. I wish I could unsee this."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "johnadjepong",
        "review_rating": "7",
        "review_title": "It was OK",
        "review_detailed_main": "I love the cast it gave the whole movie a certain level of satisfaction but the story line was too predictable..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Surreptitious_Vin",
        "review_rating": "1",
        "review_title": "A deluge of moral lesson classes",
        "review_detailed_main": "I miss the days of swiss family robinson, canonball run and Jaws when adventure films meant adventure and comedy meant comedy ONLY.\n\nNow, almost every film has to have some moral lesson weaved into it like womens rights and women empowerment, right versus wrong, good versus evil, and these mid budget films is no different. Even a childrens film like Godmothered cannot be enjoyed without a ubiquitous lesson in good and bad. Really miss the 70s & 80s films."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Trupiaar",
        "review_rating": "10",
        "review_title": "Political Rage has Jumped the Shark, I'm done",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Coolunclemike",
        "review_rating": "7",
        "review_title": "I liked it a lot!",
        "review_detailed_main": "Not sure why the other reviews were so negative. I thought it was clever, especially how they incorporated the many characters played by Eddie and Arsenio."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "maurice-murage",
        "review_rating": "1",
        "review_title": "Yeah.. NO",
        "review_detailed_main": "Just ruined this perfect classic with this remake mistake."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sidz79",
        "review_rating": "1",
        "review_title": "Don't even bother",
        "review_detailed_main": "I feel like woke feminism has robbed us out of many a great HW movies and all we're going to see now is political agenda and extreme left wokism in the films.\n\nRIP Hollywood. It was good while it lasted."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "richardjtracey",
        "review_rating": "7",
        "review_title": "A worthy sequel",
        "review_detailed_main": "Woke weirdos will say its not forced enough, but an organic core of modernism within Zamunda with a splash of nostalgia made for a good wholesome laugh. Eddie, Arsenio and Wesley did great. I was wiping away tears of laughter."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "aseven-18331",
        "review_rating": "1",
        "review_title": "Not Good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "DaneliusUK",
        "review_rating": "7",
        "review_title": "Recommended",
        "review_detailed_main": "Fantastic and same spirit as the first.\n\nIf you're a film junkie like myself then you'll appreciate the time and effort that Craig Brewer and everyone else put in to make this happen.\n\nI enjoyed it. Not my place to say where it could have been improved. It is what it is.\n\nThank you."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "rcopenhaversr",
        "review_rating": "1",
        "review_title": "Pure Garbage!",
        "review_detailed_main": "Coming to America is a true classic. Coming 2 America is just pure garbage. They focused on agendas more than making a quality movie. There was not one single funny thing about this movie. Even Eddie has gone woke...Wake up Hollyweirdos! This sucks!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "catkins777",
        "review_rating": "6",
        "review_title": "Please just leave comedians alone...",
        "review_detailed_main": "Let them do what they do! Whether is was the direction or the writing, it's hard to tell, but they tried to make this movie too PC and meaningful...that's when the story got tiresome. The audience doesn't want to be preached at, we get it already.\n\nThe son's storyline was extremely boring. During several of his scenes we left the room, got more drinks and returned when his dialogue was over.\n\nHowever, Arsenio Hall, Eddie Murphy, Wesley Snipes, Lesley Jones (and the characters they played) made us laugh out loud several times. Those laughs along with the incredible costumes and music made me give it a 6.\n\nPlease, for the love, bring back true comedy."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "edmo66",
        "review_rating": "5",
        "review_title": "Not the worst sequel ever.",
        "review_detailed_main": "The storyline is very weak and not very believable. It was nice they brought back so many of the old characters but personally I would have rather seen Allison Dean (Patrice) and Eriq La Salle (Darryl) more than some of the others. Unlike the original, there aren't many memorable scenes or lines that become instantly classic. Disappointing yet I watched the entire movie, the outtakes at the end were ok yet even some of them seemed staged."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mbrunner-98239",
        "review_rating": "8",
        "review_title": "Don't Trust the Bad Reviews",
        "review_detailed_main": "I don't understand why people are giving some terrible reviews. Before watching it, don't expect it to be better than the original. Just sit back relax and enjoy the references to the first one. There were a lot of funny moments. Wesley Snipes was hilarious as well."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "clifrun",
        "review_rating": "6",
        "review_title": "Okay",
        "review_detailed_main": "This isn't a bad film or a good film. It's just fun but it could have been better. It had too many characters for there to be character development. It's great that they gave new talent a try. It is very funny.\n\nComing 2 America is somewhat an action film. Leslie Jones, Jermaine Fowler, and Kiki Layne shine in the film. For a sequel, it had a pretty good reason. It feels too late in modern day cinema to have. Some of the actors look really old, no offense.\n\nThe film is fun and that's what most important. However, it does not feel like that great a film. Some people might forget about it. At least it's decent."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "imendi",
        "review_rating": "2",
        "review_title": "Painfully boring",
        "review_detailed_main": "What were they thinking??? There is not a singe good thing in the movie. Too obvious.. too simple.. too boring."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "nick-04980",
        "review_rating": "1",
        "review_title": "One big advert",
        "review_detailed_main": "Terrible, soo disappointing. Never should have been made."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jasonhadlow1",
        "review_rating": "7",
        "review_title": "Wasn't that bad",
        "review_detailed_main": "It was cheery, an enjoyable rehash of a familiar formula. Don't believe the haters, get a Pizza, gather the family up and enjoy!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "toddg-473-289818",
        "review_rating": "1",
        "review_title": "Political messaging ruined an otherwise somewhat funny movie",
        "review_detailed_main": "Coming 2 America did a few things correctly, being a sequel to a very funny and very successful movie a generation ago, in 1988. The nods to the previous movie with flashbacks, music, and the secondary characters created by Eddie Murphy and Arsenio Hall were all very entertaining. And the brightest spot was Wesley Snipes as General Izzi, trying to marry off his daughter to Murphy's son as a way to prevent war between neighboring nations. Snipes' comedic timing and talents were unbridled and on full display, in contrast to the many serious dramatic and action roles he has played for decades.\n\nIn the sequel, Eddie Murphy rises from prince to king of Zamunda, and comes back to Queens to seek out a son he didn't know he had, as the laws of Zamunda only allow a male heir to eventually take the throne. After finding his son, he brings him and his family from Queens to Zamunda to prepare for an arranged marriage. The clash of cultures has some funny moments, and Murphy as king must now decide whether to allow his son to marry the woman he chooses, or the woman arranged for him. The makers of this movie should have stopped there.\n\nInstead we got a steady stream of lecturing on how men are sexist and misogynistic, weaved into each of the plot turns. Every few minutes. Nonstop. OK, we get it. It completely sucked the fun out of the movie. But this is 2021, and if you are going to release a movie in 2021, you WILL bow down to the woke gods of political correctness. And you will do it early, and often."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Abdulxoxo",
        "review_rating": "6",
        "review_title": "Nowhere as good as the original, unfortunately",
        "review_detailed_main": "Celebrating his 30th anniversary with Lisa, Prince Akeem is visited by the military dictator, General Izzi, of neighbouring Nextdooria, who, due to the fact Akeem does not have a male heir, threatens to invade Zamunda after the passing of King Jaffe Joffer. When Akeem conveniently learns of a son back in Queen's, he travels back to America to find him with the intention of bringing him home and teaching him what he needs to know to one day rule Zamunda.\n\nThe main function of a comedy is to be funny, right? To be honest this film didn't make me laugh as much as I'd hoped. There were a few giggles, but compared to the original this film does struggle to deliver the humour. One of the reasons for this is that they try too hard to reuse gags from the first film. I guess the thought process being if people found it funny the first time, they'll find it funny again. Doesn't work that way. And any of the riskier jokes in this either had a quick retort or were fully explained to make sure we as an audience were in no doubt that it was only a joke.\n\nAnd narratively this film is also way too similar to the original. Everything there is in the original is also in this sequel, which made me cringed at the lot of the scenes. It's like the whole thing or movie became self-aware/too conscious of itself, \"hey we are making a sequel to a classic comedy movie after 30 something years why don't we just put everything in the original in this and also get every black actor/celebrity there is on the planet to also act in the movie\"\n\nHowever, while the similarities are apparent, that actually wasn't that much of a problem. I quite enjoyed the story. The beats may have been predictable, but the way it was filmed and performed was sufficient to exceed my low expectations. Performance-wise, I thought Murphy and the returning Arsenio Hall still had good chemistry. They brought back many of the original characters which was nice. The new characters are also a bit likable. Jermaine Flowler, who plays Akeen's son Lavelle Junson, was good but I'm not a fan of his character, the character totally lacks any kind of personality, he way too 'comedic' to be taken seriously. He pales in comparison with Murphy's Akeem in every way. His mum and uncle played by Leslie Jones and Tracy Morgan respectively were funny but only for a short amount of time. Akeem has three kick-ass daughters, the eldest, Meeka, was played brilliantly by KiKi Layne. Wesley Snipes, who clearly had the best time making this. Every time he enters a room and the way he walks was funny. Then when he spoke he was pretty funny too.\n\nSomething else I didn't expect from this film was the amount of singing and dancing there was, not a fan of that, as I found most of them to be cringey but there were a few sequences; a couple of bigger ones at the beginning and end that were quite fun. We got a few decent musical cameos. There was also a well choreographed fight scene in here too.\n\nAside from a slightly unconvincing CGI lion, visually, this film was nice to look at. The costume design I think was award-worthy. Same could be said for the hair & makeup. Even the production design was fantastic. The use of colours in this film was also good.\n\nOverall, Nowhere as good as the original, and like they said if it ain't broke, don't fix it, but nevertheless 'Coming 2 America' is a slightly enjoyable film if taken for what it is."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jadepietro",
        "review_rating": "4",
        "review_title": "Going Nowhere",
        "review_detailed_main": "IN BRIEF: An unfunny comedy that wastes the talents of Eddie Murphy and company.\n\nJIM'S REVIEW (NOT RECOMMENDED) It saddens me to say that Eddie Murphy is a tired retread of his former comic self in this tired retread of his former hit comedy from the late 80's, Coming to America. The title upgrade is more clever than this sequel. Yes, it took over 30 years for this second coming. One can only hope that another installment of the Coming to America franchise remains on the drawing boards permanently and the third coming is past gone.\n\nThis labored sequel has an intriguing premise that never comes to fulfillment. Prince Akeem of Zamunda has no male heir to the throne and his kingdom is being threatened by a military dictator, General Izzi (Weslie Snipe). So he goes off to America with his trusty aide Semmi (Arsenio Hall) to locate his recently discovered male successor Lavelle Johnson (Jermaine Fowler), a product of Akeem's drug-induced one night stand, Mary (Leslie Jones) from his previous coming in America.\n\nThe screenplay-by-committee is evident from the start with only fitfully funny moments on display. Blame can be aimed squarely at the movie's writer team of Kenya Barris, Barry W. Blaustein and David Sheffield. They abandon the stranger-in-a-strange-land formula that made the original so delightful and instead focus on the story of the newly found prince and his formulaic romantic coming-of-age journey back in Africa. It's all smutty innuendoes and well-worn gags despite some engaging performances.\n\nMr. Murphy can also take some of the blame as the film's main producer. This movie need a lot more than major rewrites; it needed major re-thinking. This is the type of movie where the crew must have had more fun making than moviegoers will have more fun enjoying. Director Craig Brewer assembles his large cast, many whom reprise their roles, and puts them through the paces once again, but his own pacing is off this time around.\n\nMost of the cast is waylaid by the material it was given. Some actors were unharmed in the making of this movie: Mr. Fowler has a nice screen presence as the Lion King, Nomzamo Mbatha is a fine love interest, and the aforementioned Ms. Jones and Mr. Snipe try to breathe some life in their one-dimensional characters. As Akeem's wife, Shari Headley has her moments and John Amos is solid as Akeem's father-in-law. The esteemed James Earl Jones has a short but sweet role reprising Akeem's father. As Princess Meeka, the eldest daughter and real heir to the throne, the talented Kiki Layne is wasted in her underdeveloped role. However, there is some truly cringe-worthy acting from Tracey Morgan as Lavelle's uncle and tons of cameos by many Black entertainers that pad the story with lavish musical interludes and no real humor.\n\nGranted, a few scenes which do provide some entertainment value and hint back to the earlier more successful predecessor that involve Mr. Murphy and Mr. Hall's multiple supporting performances, under heavy layers of prosthetics. Their comic talents shine in these sequences. (The make-up department does wonders too.) But they and the majority of the ensemble are adrift in this alleged comedy that settles for the predictable and unfunny.\n\nWhen the costumes upstage the actors and the story, one knows something is terribly amiss in the disappointing comedy, Coming 2 America. The sumptuous costume design by Ruth E. Carter deserves a better film. So do we. (GRADE: C-)"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jeroengilissen",
        "review_rating": "7",
        "review_title": "Funny movie",
        "review_detailed_main": "I don't get the bad reviews here at all. I thought the movie was very funny. Sure the first movie was ground breaking at the time. Considering this movie never went to the theater I enjoyed it alot"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "AnnieCassy",
        "review_rating": "1",
        "review_title": "Awful!",
        "review_detailed_main": "Watched 10 minutes. Bored. Watched another 10 minutes. Started checking emails. Watched 5 minutes...asleep. It's a Festival of Mediocrity. But it's a good thing, all the sequels destroyed and the original ones as a comparison. This is what culture wars get you, let's hope that losing money will follow. I went back to watch the original one and I was delighted."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "loripinklady",
        "review_rating": "10",
        "review_title": "Don't believe the negative reviews",
        "review_detailed_main": "I really enjoyed this movie. Lots of fun seeing all the old characters. Just a really fun piece of fluff to take your mind off the pandemic. Why people are so negative about this movie is beyond me. Watch and just enjoy"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tim-stjames",
        "review_rating": "6",
        "review_title": "You'd have to place it somewhere between pleasant time-killer and missed opportunity - mileage may vary.",
        "review_detailed_main": "It is more of a nostalgic celebration than a winning comedy. Laughs are occasional. In the space between, we have time to reflect on what has changed since the '80s and what has not. Nobody will agree that this will outlast its predecessor (not by a long shot) but for a 33-year old sequel to a beloved property, you could do a-lot worse."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jscop-11764",
        "review_rating": "2",
        "review_title": "Don't listen to the critics",
        "review_detailed_main": "For as good as the original was, this sequel was bad. Really bad. Of course, most of the\"critics\" gave it a good rating. There are a few reasons for this, most of them self-serving. If you want legitimate assessments of movies, ignore the critics; get \"real people\" feedback."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cooldyl",
        "review_rating": "4",
        "review_title": "Coming 2 America (for 10 minutes)",
        "review_detailed_main": "To prepare for the highly anticipated sequel release I spent my Friday evening watching Coming to America, the original. A friend of mine cooked some amazing Fu Yung Hai which we enjoyed eating while watching the absolute 80s Eddie Murphy experience. He forgot part of the recipe and made a plate that could have easily fed 6 people instead of the four it was meant for, but it was delicious nonetheless.\n\nOwing to the COVID-19 lockdown we couldn't really finish the movie before our 9 P.M. curfew kicked in. But as we've all seen the original countless times before we knew how it ended and so we felt reasonably refreshed and confident going into the sequel.\n\nFlash forward to Saturday evening. The beginning of the film was quite promising. It was good to see most of the original cast reprise their roles over 30 years later. Quickly Eddie finds himself having to journey once again to Queens, NY. However, to much dismay, barely 10 minutes of runtime later he takes the plane home. This is when the movie falls apart.\n\nSlowly the viewer realizes that the rest of the movie is going to play out not just -not- in America, but also not with Eddie Murphy and Arsenio Hall as the lead players. Instead this movie turns into a vehicle for Jermaine Fowler and Leslie Jones, and it does not work.\n\nIt is very much a shame, having to give this film a 4 out of 10. They had only one requirement that this movie should have covered: Eddie as an African King in the US.\n\nHow in the lord did they fail to do that?"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "weblogintnljba",
        "review_rating": "7",
        "review_title": "Wonderful feelings and enjoyment few dissapointments",
        "review_detailed_main": "Loved this wonderful farewell from one the most iconic comedians from my youth, loved most of the film loved the different take on humor. dissapointment was lacked depth of the son of Akeem story amd character rushed and thin."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "robin-couzins",
        "review_rating": "2",
        "review_title": "Woke lefty feminist clap trap",
        "review_detailed_main": "Yes the cgi wasn't the best, but hey ho I didn't mind the \"new\" characters like others. But the story was meh, the pace was meh, as with everything now days, why can't you just make a film without an obvious forced agenda. Pointless on every way. 1 star for the cast 1 star for the very occasional smile (which was on reflection just a re hashed original film joke)"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "maurs-10854",
        "review_rating": "7",
        "review_title": "Made me smile",
        "review_detailed_main": "My goodness Eddie Murphy and Arsenio Hall have aged really well. They are great together and the film is light, corny and silly. But hey I love that. Just fun with an ok plot. I couldn't wait to see who the son was going to be. Not disappointed. I enjoyed it. Give it a go you will get some laughs. We need more of Eddie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "shortcircuittwo",
        "review_rating": "1",
        "review_title": "The King is dead.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "fadylove",
        "review_rating": "7",
        "review_title": "High on emotions. Nice Comedy",
        "review_detailed_main": "Good it has positive vibes. Eddie and his team r back. Thank you Zamunda."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "5",
        "review_title": "Guess who's back?",
        "review_detailed_main": "Right from the start, 'Coming 2 America (2021)' is markedly worse than its predecessor. Most of its humour misses the mark, its plot is all over the place and it generally just feels a bit subpar. It's almost like two or three movies shoved together, with its attention torn between Murphy's newly crowned King Akeem and Fowler's newly discovered Prince Lavelle. Yet, it still manages to remain relatively engaging and, once it's properly underway, even quite enjoyable. This is mainly because it brings back the original's likeable cast while also successfully implementing some new players. When it comes down to it, it only works as well as it does because of its well-performed characters. Its call-backs are frequent but not bothersome; it doesn't feel like a quick nostalgia-based cash-grab or anything like that. There's the sense that everyone involved had a great time on set and this actually makes it easier to forgive the thing's shortcomings. Don't get me wrong, it isn't great. I mean, it's not even as good as it should have (and could have) been. It's decent enough, though. It's also never even close to boring. 5/10."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "didcrywolf",
        "review_rating": "8",
        "review_title": "Good light fun!",
        "review_detailed_main": "Don't bother reading the negative reviews of the haters. As usual they don't get the product so they decide to write a label. This Murphy produced movie is beautiful visual candy with some nice dance numbers and production values. If you need a tight script and a plot, get a book! Enjoy!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "xillib",
        "review_rating": "",
        "review_title": "Very Fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "Twice the fun (?)",
        "review_detailed_main": "Actually the majority of the movie plays in Zamunda. Which is an interesting break from the original, where it was the other way around. What is amazing, you get everybody back from the original movie - everyone that was available and had a role in the script. And then you get some more people! Like Tracy Morgan and Wesley Snipes to name but two.\n\nReally well cast all around, with Eddie and Arsenio playing multiple roles all around. And they don't seem to have aged that much to be honest. New York doesn't seem to have changed much either - except from the hairstyle thing. And while you may be asking yourself \"how are those people from the Barbershop still alive, 30 years later?\" ... the obvious answer is, because they are played by Arsenio and Eddie ... but if that is not enough ... remember: this is just a movie - and a comedy at that.\n\nIt has its own sets of rules sort of. There are things here that do not work as fine as they were in the original. There is also the being aware element that plays more into the cards of those who don't like the movie: talking about sequels and how they mostly don't work. But for every such moment, you have another great moment or dance from Wesley Snipes ... or any scene with Tracy, if you are a fan of course.\n\nThe flashbacs work at first and I even thought they included some deleted scenes. But it becomes evident quickly that they just use a deaging software, similar to the one I reckon that they used at the Irishman. Unfortunately it becomes especially evident with Eddies face, where it looks weird to say the least, when he has to do expressions.\n\nIt may be flawed and predictable, but it also is quite fun, if you let it. You can either roll with it then or just hang onto the original. The choice is yours. The callbacks make it a fun ride though"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sp4wn3r",
        "review_rating": "1",
        "review_title": "what the hell?",
        "review_detailed_main": "The original is one of my most loved movies from the old regime, but this? what the hell? i had to stop the movie 45 min in it, could not go thru with it, sorry but this is pure ..... compared to the 1st one"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "purviseddie",
        "review_rating": "1",
        "review_title": "TRASH",
        "review_detailed_main": "Wow...forced humor and horrible cast. Coming to America 2 and they were in America for 2 minutes. some movies shouldn't have a sequel...this is one of them."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "joscon-16616",
        "review_rating": "7",
        "review_title": "A worthy successor",
        "review_detailed_main": "I like sequels which wrap up the storyline while being nostalgic, thats exactly what this movie was. It was great seeing the old cast back as well as the new faces. It was exactly what you'd expect from a sequel to an all time classic."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "sdotjean",
        "review_rating": "2",
        "review_title": "No",
        "review_detailed_main": "No. Just no. It was not naturally funny. They tried tooooo hard. And I tend to like cheesy movies. This was cringe worthy. Ugh! So disappointed."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "alpmulla",
        "review_rating": "6",
        "review_title": "Good funny light hearted movie",
        "review_detailed_main": "It's not been made to wow the audience with its story lines and plot twisting drama but rather as a light hearted comedy, not a remake but an update to the original, if your a fan of the first movie it's good watch for nostalgic reasons as well as wanting to watch a comedy. At first I thought it was trying too much to be funny and was too wacky because the original wasn't like that, but then again nothing can really best the original type of films\n\nAnyway dont expect too much but enjoy the watch it's fun entertaining and colourful with some fantastic African wardrobes"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Shaun_of_the_Dude",
        "review_rating": "5",
        "review_title": "Coming 2 America will forever be one of Covid's miracles.",
        "review_detailed_main": "Considering that this film's post production and launch coincided with COVID 19, it's surprising it got released at all. Kudos to Paramount for completing it and selling it to Amazon.\n\nI'm 30 minutes into this film as it has just been released and I've been happy all day knowing it was to be released. However, not only is this a nostalgia fest from the off (which has both good and bad emotional effects on the viewer), but it also heavily relies on a lot of CGI and you can tell that a lot of the scenes were filmed very, very, very socially distanced and simply cut into the edit. This zaps all of the enjoyment out of the room as what comedy relies on is people in the room.\n\nI get the whole Covid socially distancing thing, and agree - but this was filmed before Covid and whilst you can forgive James Early Jones for doing his parts remotely (as most of the cast too to a degree), there are some scenes where the comic timing is off and you can see it is down to differential directing.\n\nUnfortunately, this film adds to a long succession of films which prey upon your nostalgia without really whetting its appetite. From a personal perspective, it's good to see Eddie Murphy and the cast again - but Paramount were right to flog this to Amazon; I'd probably have never paid my hard earned cash to see this and wait for it to hit TV (which is has - it Amazon Prime the 'New' Direct-to-Video?).\n\nOkay, so after the full viewing I'm quite happy with my original rating. It is nowhere near as bad as some of these reviewers are making out. Not by a country mile. But what it is is a pastiche of everything that made the original what it was. Everyone is in there and everyone plays their part - it's deftly cringe at times, and quite amusing in others. It isn't as funny as the original, but what are you gonna do?\n\nHowever - In Retcon City, the walls are wide and diverse and a lot of this feels like rewriting ones memoirs.\n\n5/10 - Eddie and co all look good for their respective ages - with respect.\n\n-1 - Whoever told Paramount that 'Arnieing' Eddie Murphy and Arsenio Hall was a good idea?"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "quailpat",
        "review_rating": "7",
        "review_title": "Well made nostalgia but terrible plot",
        "review_detailed_main": "Almost the entire cast from the first movie makes an appearance and Tracey Morgan is an excellent edition,there are some great multiple uses of Eddie and Arsenio are different characters.Some of the jokes hit and some miss,the real failure of the movie is the addition of the younger family members and the plot.Most the film in centered around the mythical kingdom in Africa,they spend at the most 15 minutes in America.So it's not much of a sequel.Outside of the eighties nostalgia,don't get too excited for a great film."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "e-lisboa",
        "review_rating": "2",
        "review_title": "Big time disappointment",
        "review_detailed_main": "Flat jokes, terrible acting, bad bad script. This sequel simply offends the first movie. Do yourself a favor and don't watch it, keep the good memories from the original film. When Morgan Freeman appeared in the beginning I was \"yes, here we go\" but his character was blank as everything else in this movie. Actually I still don't know what in heavens he was doing. It was painful to watch until the end."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "umax1200",
        "review_rating": "8",
        "review_title": "Pure Fun!",
        "review_detailed_main": "Why do people continue to not give Eddie his due? Dreamgirls, Dolemite, and now Coming 2 America. This movie was great! I liked the music, the story, and how they mixed in the original characters with the new generation and made it all work. Mister Brewer has become one of my favorite directors in the way he tells a story.\n\nWesley Snipes was hilarious, as was Leslie Jones, and Tracy Morgan! It was great to see James Earl Jones, Gladys night, and Morgan Freeman among others add their chops in their brief cameo appearances. Of course, Eddie and Arsenio reprising their multi-character roles from the original was almost mandatory and it fit seamlessly. This movie deserves a much higher rating IMHO. It was well worth the wait."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "telkeebs",
        "review_rating": "6",
        "review_title": "Be open minded",
        "review_detailed_main": "Was as good as the original? No. Was it ever gonna be anywhere near as good. No. The original is one of the best films ever for me. But I went into this open minded. It could of been a lot worse. It was saved by seeing the barbers, Randy Watson and the Reverend. There was also some very funny lines in there too and great references to the first movie. It was light, silly, made me smile and feel extremely old. Now there's my review. Imma now put some Soul-glo in and eat my McDowells."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "don_emiliano",
        "review_rating": "5",
        "review_title": "Beautiful looking movie, terrible writing",
        "review_detailed_main": "The movie looks beautiful, cinematography and costume design specifically is at the highest level. The biggest problem of this movie is the script. It lacked focus and charm that the original movie gave us. Akeem is not the protagonist of this story even though he is presented as one and the actual protagonist is not very interesting. There are way too many side characters that are over the top and also very distracting. I have seen the original over 20 times, I don't know if I'll see the sequel again."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jchristo-35761",
        "review_rating": "1",
        "review_title": "Today's industry killed my old favourite",
        "review_detailed_main": "The positives that are often spoken of in these reviews are correct in that the return of familiar faces is nice initially. But that's pretty much where the positives end I feel as if the new industry took the greatest American comedy film ever and turned it into hot garbage After half an hour the warmth faded and then the poor plot, half baked humour and overdone unnecessary callbacks incorrectly utilised killed some of the memory of the original If you love the first film, really love it, then you might do best to avoid this"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Wuchakk",
        "review_rating": "6",
        "review_title": "Fun reunion, but pales in comparison to the first movie",
        "review_detailed_main": "Three decades after the original film, Akeem (Eddie Murphy) discovers that he needs to go back to America with Semmi (Arsenio Hall). The principal cast members return with some new characters played by Jermaine Fowler, Tracy Morgan, Nomzamo Mbatha and KiKi Layne.\n\n\"Coming 2 America\" (2021) is nowhere near as good as the first movie (which is probably my all-time favorite comedy), but it is fun to see where the characters are at after over thirty years, not to mention what they look like.\n\nThere are four things that hold the flick back: It seems like it's in a hurry, peppered with music videos, not to mention it's noticeably goofier than the original. It's afraid to slow down for some compelling or heartwarming drama. When they do, like with Lavelle (Jermaine) and Mirembe (Nomzamo), it works and you start get drawn into the characters, but then it cuts to another crazed scene.\n\nSecondly, Akeem isn't as likable or funny here, whether that's because of Eddie's low-energy, mediocre writing or simply Akeem being stifled by tradition, I don't know; probably a combination. Thirdly, the trip to New York City comes and goes so this isn't really much of a Coming to America 2. The focus is on Zamunda, which is fine, but the story needed more interesting ideas and writing.\n\nLastly, I liked Jermaine Fowler as Lavelle Junson; he has charisma, but he pales in comparison to Murphy as Akeem in the first movie. The creators needed to spend more time fleshing out the potential of Jermaine and his character.\n\nDespite these shortcomings, \"Coming 2 America\" is still worth catching if you're a fan of the original flick. It's great to see all the old characters and there are some amusing and entertaining moments; for instance, the early bit with Bopoto (Teyana Taylor), which made me bust out laughing.\n\nThe film runs 1 hour, 48 minutes, and was shot in Atlanta, Georgia, and New York City.\n\nGRADE: B-/C+"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "plottingaway-20402",
        "review_rating": "1",
        "review_title": "Turned if off after an hour",
        "review_detailed_main": "I tried. I gave it a shot, but I couldn't take it any longer. The plot was a mess. Disappointed. Come on Paramount Pictures.Do better."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hammer_life",
        "review_rating": "7",
        "review_title": "Decent",
        "review_detailed_main": "Sequels are always going to be difficult but even more so when it's 30 odd years since the original. This was a throwback; a nod to times before when people could make jokes and if people didn't like them, they moved on rather than take offence at everything. The first scene in the barber shop was an example of that.\n\nIt's a comedy and despite the jokes being a bit predictable, like the bathing scene, it's still funny. When you go to see a band in concert you expect them to play songs you know so what's the difference with watching an actor/film doing jokes you expected.\n\nToo many people have slated this film but for me, the nostalgia is good enough to make me enjoy it. I laughed and smiled throughout because it took me back to being a teenager when I watched the first film.\n\nDon't take it too seriously."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jack-15394",
        "review_rating": "1",
        "review_title": "Sadly just another preachy movie",
        "review_detailed_main": "As much as I wanted to like Coming 2 America. I just didn't. It had its moments which made me laugh and get doses of nostalgia, but it's not something I would want to watch twice. The script was unoriginal and instead of being a fun entertaining movie it became just another Hollywood movie trying to force social issues down the viewers throat. I wish Hollywood would make a movie that's just entertaining without all the preachy politics. It's not even close to being as good as the original coming to America."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "setokaiba238",
        "review_rating": "7",
        "review_title": "As usual, people's expectations were too high",
        "review_detailed_main": "It's a fun film. It's just meant to bring the old cast together so we can all have a little nostalgia. If you were expecting it to be as good as Coming to America that's on you. You should have known it wasn't going to be the same quality when you saw who some of the new cast members were. Plus it was free with my Prime membership and it discussed class discrimination among black people and the tension that often exists between black Americans and Africans.\n\nI came in with no expectations, had a few laughs, got a few warm fuzzies, and left feeling about the same as I felt after watching the Fresh Prince and Community reunions. Sure the plot was done do death and Semmi was underutilized but this is really less of a movie and more of a reunion show."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "vkrup",
        "review_rating": "1",
        "review_title": "complete disappointment",
        "review_detailed_main": "Coming 2 America is terrible\n\nBeverly Hills Cop 4 - PLEASE DON'T"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "nelrac",
        "review_rating": "10",
        "review_title": "What a joy!!!!",
        "review_detailed_main": "I loved every minute of it - the throwbacks, the cameos, the jokes and the story. Gonna have some chilled ciroc and watch it 45 more times. Smiled the whole time thru!!! Cheers to happy, fun movies!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "prussiantechnologies",
        "review_rating": "",
        "review_title": "Nah fam, just nah.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "huntergirl-13189",
        "review_rating": "6",
        "review_title": "Enjoyable if you turn off your brain",
        "review_detailed_main": "And can tolerate Leslie Jones. But seriously, \"Next-door-ia\"? FFS..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "parkerrodney",
        "review_rating": "1",
        "review_title": "Watch it, but not for the story",
        "review_detailed_main": "I suppose my first review was too gritty, because it didn't make it past the censors, for reasons. This movie speaks volumes of what is wrong with Hollywood and how people are willing to exploit negative imagery. Done. Let's see how this one goes."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "AloneMaster",
        "review_rating": "2",
        "review_title": "My eyes are bleeding",
        "review_detailed_main": "Very disappointing movie. They should stop after first part."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "paudieconnolly",
        "review_rating": "6",
        "review_title": "The prince is back",
        "review_detailed_main": "Very enjoyable first half seems to loose direction in the second half. worth watching for some great cameo appearances and trip down memory lane as Eddie gets the band back together . More time in the barbershop would have been good. But worth a look for fans of the original."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "hucknfrex-78586",
        "review_rating": "3",
        "review_title": "Please, just put me out of this misery!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "bangel3322",
        "review_rating": "7",
        "review_title": "Ignore the hate..it's not a bad film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "drleerdixon",
        "review_rating": "1",
        "review_title": "Astonishingly poor.",
        "review_detailed_main": "As the first movie is one of my all-time fave comedies, I expected much more from this attempt. It was clearly never going to be as funny, given snowflakes attitudes these days, but it was just plain awful. Like a badly arranged carnival of noise and colour. Avoid."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "kenzibit",
        "review_rating": "7",
        "review_title": "For the family",
        "review_detailed_main": "Entertaining and fun to watch for the whole family. Great casting, good performances, beautiful costumes, and funny..... Movie had a weak plot but sure is a good way to spend time with the family and waste some time. Has some good african themes too to relate to. A must watch."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "monsieur_raimu",
        "review_rating": "2",
        "review_title": "How to make a terrible movie with great actors",
        "review_detailed_main": "I gave 2 stars for the great acting, especially Wesley Snipes. Storyline must have been written by a middle or high schooler."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "secollins75",
        "review_rating": "8",
        "review_title": "Not as good as the original, but not as bad as everyone says.",
        "review_detailed_main": "I knew that a sequel to a 33 year old movie wouldn't quite live up to the original, but I thought it was entertaining with some truly funny moments. If you temper your expectations going in, I think you'll enjoy it. A lot of the bad reviews I've seen appear to be politically motivated, but this movie wasn't as bad as many would lead you to believe."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "RosanaBotafogo",
        "review_rating": "7",
        "review_title": "But adorable...",
        "review_detailed_main": "Running for the Oscar for Best Costume, this was one of the factors to watch the film, since the plot and genre I don't like... I don't know if because of the thematic similarity, but it surfed the Black Panther wave, but surprisingly I found the cuter movie than I thought, the criticism of the patriarchal regime, in a comical and highly exaggerated way... But adorable..."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "judywalker2",
        "review_rating": "5",
        "review_title": "a missed opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "martinvant",
        "review_rating": "2",
        "review_title": "Cringe!!",
        "review_detailed_main": "Honestly, it felt super cringe from start to finish. Wasted time watching this garbage of a sequel. What a stain on the great first movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "iamtheonewhoknockss",
        "review_rating": "",
        "review_title": "THEY DID IT, CONGRATS!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tigerlily-78145",
        "review_rating": "7",
        "review_title": "Not as bad as everyone is making it",
        "review_detailed_main": "It's SUPPOSED to be cheesey like the first one!\n\nThe politics are not as bad as everyone had made them out to be. The storyline was cute. Eddie Murphy was not as funny but whatever 🤷 and the women's rights aspect was not blown out of proportion. But negative minded people will always see it in a negative light. Just give it a chance and make a decision for yourself."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "panchoasno",
        "review_rating": "3",
        "review_title": "They did Eddie Murphy so bad.",
        "review_detailed_main": "It is pretty obvious when you watch this movie that he is watered down by a lot, his comedy is so dilluded that its almost inrecognizable, where is the funny man bro 😔... for once i would have liked for something i wanted to not actually happen, i knew he got outed from the industry for a while cus of his \"offensive\" humor, but that was the fun part of everything he did back in the 90s, poking fun at bad things is what comedians do. I don't know if it was amazon or Eddie himself who watered his comedy down, probably a mix of both, but he should have stayed out of making more movies after seeing the dissaster this one was.\n\nOn top of that the plot is a \"nothing\" sequel plot, it tries to justify itself by tieing itself to the previous movie but the tone is nothing like the previous one, it feels more \"comercial\", I know movies are made for profit not for the love of art, what i mean by comercial is that is devoided of any soul.\n\nIt is waste of your time."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "MissaMelissa22",
        "review_rating": "6",
        "review_title": "It really wasnt that bad",
        "review_detailed_main": "I honestly didnt think it was that bad. It was the same characters playing the same parts as 33 years ago. The movie back in 1988 would never have ben called corny and seeing it in 2021, yes of course its corny. WHAT DID YOU EXPECT!! I laughed quite a few times. Maybe they had too many musical artists yes, but overall not a terrible movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tatner",
        "review_rating": "2",
        "review_title": "Desperate and pathetic",
        "review_detailed_main": "This film feels like a shoddy attempt to rekindle a masterpiece all in the hope of making money. It's desperate and pathetic!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Marco-1984",
        "review_rating": "7",
        "review_title": "Some silly light-hearted fun - I enjoyed it",
        "review_detailed_main": "Having watched the original for the first time as a kid and many more times in the years to come, I was hoping not to be disappointed as many sequels do (and which is ironically mentioned during the movie). I wasn't. 33 years later 'Coming 2 America' proved to be quite enjoyable! Using some similar plot pieces and an ensemble that obviously was having a good time during filming they put together a movie that is both light-heartedly silly and just overall fun to watch. Sure, the plot is formulaic but: How good is it to see Wesley Snipes indulge in his role as General Izzi? The over the top spectacle with just the right amount of irony? I had a few good laughs and a smile on my face when the credits were done. And I think this is exactly what they set out to achieve: some easy, silly light-hearted fun. Nothing more - but nothing less either."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "bhh-34094",
        "review_rating": "1",
        "review_title": "don't spend time or money on this!!!!",
        "review_detailed_main": "I really liked to first one, and I was looking forward to watch this, but is was our right horrible!!! it is NOT funny, I simply don't understand that anybody cam preview this movie, and agree to send it out!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "roger_skillin",
        "review_rating": "8",
        "review_title": "Ignore the haters",
        "review_detailed_main": "Firstly this was never wanted but they did it anyway, it was never going to be as good as the original. All these reviewers were expecting it to be. Its still an entertaining film and great to see all the cast they managed to get back . Forget about the original to a certain extent and just enjoy, don't be like all these moaners, half of which probably weren't old enough to watch the first one when it was released ."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "brchthethird",
        "review_rating": "6",
        "review_title": "Completely dependent on nostalgia",
        "review_detailed_main": "Well... It is 2021 and a belated sequel to 'Coming to America' exists. And not one that I can imagine people clamoring for either. But returning to the well of nostalgia is almost a perennial activity, so not really surprising. Was it funny? Yes, in parts. Those parts happened to be callbacks to the first movie, though. It was enjoyable to see these people doing these characters again, like trying on outfits you haven't worn in years. The new additions were just that, although I can't really say that they really did much for the story, which was basically a rehash of the original. But the film acknowledges this in a meta/postmodern way, so it's ok? Kind of? I will say that I laughed and had a decent time, but this will be a one-and-done. I wouldn't have bothered to see it had it not been part of my Amazon Prime subscription. Just add it to the growing list of self-referential pop culture ephemera that will not be remembered for half as long as the initial film that spawned it."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "laciwinter",
        "review_rating": "1",
        "review_title": "script changed during production?",
        "review_detailed_main": "Hm, I've waited with high expectations for this release.\n\nAnd became the first one in decades I actually misread while watching:\n\nWhen Lisa said she also had \"other men\" reacting to Akeems bastard son situation and then when Lavalle was getting closer to the Zamunda beauties I had a hunch that the best twist in the making that one of the royal cousins were actually Daryls daughter in reality! - hence they could actually marry against the will of just about everybody even war etc...\n\nBut then seems that this track has been derailed perhaps by the fact that Darryl playing character Eriq La Salle hoped but then turned out not available for the project?...\n\nToo bad otherwise it could have been a... Hell no. Please do a remake. I mean a totally revised version.\n\nOne other note: How come with this star studded cast the show came up with a Lavalle who is while being an adult already not only shorter than his mom Mary but also not really resembling anything like Akeem... Somehow the daughter of Izzi Bopoto really doesn't feel credible with this \"I like what my king likes\" lines, I would have rather expected a disconnect between them because of Bopoto giving an indication of being some predator herself rather the same as her father...\n\nAnyway, please take another shot at it. Thank you."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mrcowdenbeathfc",
        "review_rating": "1",
        "review_title": "Absolutely horrible",
        "review_detailed_main": "The worst sequel I think I've ever seen . Horrendous acting and completely unfunny. How can this be so bad and who is responsible for this garbage"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "MoviesforRelaxation",
        "review_rating": "7",
        "review_title": "Good movie. Lots of laughs.",
        "review_detailed_main": "Overall it was decent. It had a solid plot and the characters were well developed. Casting was great. Wardrobe was beautiful.\n\nHonestly, given that the first movie was such a classic I guess I was expecting a bit more. I don't understand why the idea of this one didn't go to the big screen. Im sure it would have done well. This sequel definitely doesn't have any elements of the original. It lacked a certain elegance and I felt that there were scenes in there that didnt need to be there (mainly a lot of the music scenes). The character that played Meeka was very strong and if the movie centered around her more maybe it would have given it that original feel.\n\nAt certain times it felt like a mockery of African culture and some character's accents were on and off like they'd have the Zamunda accent and then it would be an American accent and then back to the Zamundan accent and so that took away from the authenticity. I cringed a bit at Leslie's character but then grew to love her in the end. I especially loved Wesley Snipes' character.\n\nLastly there seemed to be a fusion of Black American and African culture which was nice to see."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "thenza",
        "review_rating": "5",
        "review_title": "Not TERRIBLE but pretty boring",
        "review_detailed_main": "Granted this movie doesn't follow the most obvious plot points of a terrible remake or reboot it starts to unfold into those schemes three quarters in. I personally think the cinematography is great, the set design and costumes are AMAZING but this movie lacks a lot of charm. Akeem doesnt seem as wholesome as before and the buddy concept to Simi was thrown out which is disappointing. Akeem's bastard son is not likable in the slightest and overall for a comedy I laughed at like three jokes. But I dont think the script is awful it just is very singular minded no real twists or arches but just one big issue. I appreciate they used basically all the original cast but the movie didn't have the soul that made the first one good, but I guess you cant make a fish out of water story twice."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "bowen101-160-829536",
        "review_rating": "7",
        "review_title": "Idiots love to review bomb. All negative review it's have garbage taste in film and garbage takes.",
        "review_detailed_main": "Not a single one of the idiots giving these low ratings had to have watched the original film recently. Like do they understand that the first movie was a barrage of silliness? As an actual black person who understands the nuances of the comedy of the first film and the culture of the time, I have seen very few sequels that could amount to the homage this one paid to the tone and pacing of the first film. The first film wasn't some paragon of cinema, and neither was this movie. It was supposed to be a lighthearted and relaxing ride, and that is exactly what it achieved. People can be totally useless when judging literally anything, and that's why we ended up with several stupid things happening in this world caused by lots of idiots. This was a fun film and the writers did the old movie proud."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "milosmicovic",
        "review_rating": "1",
        "review_title": "Dont ruine memorie on first one.",
        "review_detailed_main": "Garbage movie....this is not funny, stupid movie. 1% of the movie that is good is the same actors. Embarassing."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "themazster15",
        "review_rating": "7",
        "review_title": "Overly harsh reviews attacking what is a fun film",
        "review_detailed_main": "It was always going to be difficult to follow the original which was a well thought out, planned story with fantastic comedy and just made you feel good. I've got to say, the story that they were going for here has potential, but I think they got lost somewhere in the middle and the plot feels to advance somewhat unnaturally. On top of this, some characters felt a little forced and just weren't needed which could have allowed more time for nostalgia trips. Having said that, I very much enjoyed the start and I feel the ending was a really great celebration of the film and cast and ultimately just felt like everyone was having a fun time which made me have fun too. Its definitely not the perfect film, but it has some great nostalgia, brings back some fantastic characters, I was definitely laughing and at the end of it and I think the actors did a really good job.\n\nSo, definitely not as good as the first, but it's a fun, easy watching film which has some good laughs and really celebrates the original and its cast."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "xpat-55192",
        "review_rating": "1",
        "review_title": "I really had to give it one star.",
        "review_detailed_main": "After looking forward to watching this follow-up to the first entertaining film, I cannot honestly write one decent word of praise for this appalling narcissistic tribute BY Eddie Murphy TO Eddie Murphy.\n\nAlthough as a habit, I normally copy movies to my personal movie drive, but having watched it, I found I could not conjure up even the slightest desire to put it alongside my really good entertaining collection of films.\n\nActors like James Earl Jones and John Amos were as professional as usual, but oh dear, I do not believe they could have been flattered by the lame duck of a story.\n\nI say that if you enjoyed the first movie, let this sleeping dog lie to scratch its own fleas."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "matthew-c-anstie",
        "review_rating": "10",
        "review_title": "Excellent Movie!",
        "review_detailed_main": "Died Laughing the entire movie! Honestly, not sure why there is so many haters! This movie has it all! It's hilarious, touching, and inspirational! Great job to cast and crew! A++++"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "d_penn",
        "review_rating": "7",
        "review_title": "Coming 2 America Duece",
        "review_detailed_main": "Everyone knows the first movie overpowers (damn near) every sequel. This one is no different. Still some good actors/actresses in this film. Production and writing is not bad as it keeps up with the times."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mastermp25",
        "review_rating": "1",
        "review_title": "What a dissapointment",
        "review_detailed_main": "This is literally the worst piece of censured, feel-good piece of garbage i've seen to date.\n\nThe first movie was a masterpiece, this one, not so much."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "earlfargis",
        "review_rating": "4",
        "review_title": "Deserves more than all the 1s but not very good",
        "review_detailed_main": "People are upset with this sequel and I get it. So uninspired and ordinary following a classic.\n\nThe plot really goes nowhere and ends with a plop. The movie feels stuck in the 90s. It's basically a class reunion feel good movie. Not funny particularly. No laughs, maybe a few feel good smiles.\n\nI found the 1st half somewhat boring so I stopped watching midway. A few days later I finished it. The 2nd half went faster but is very predictable."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "skispeed69",
        "review_rating": "",
        "review_title": "5 minutes of funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Thanos_Alfie",
        "review_rating": "6",
        "review_title": "Nice sequel...",
        "review_detailed_main": "\"Coming 2 America\" is a Comedy movie and the sequel of \"Coming to America\", in which we watch Prince Akeem going to America again in order to find his long-lost son. He has to build his relationship with his son and control his kingdom.\n\nSince I had already watched the first movie I knew what I was about to watch and expect by the second. In comparison with the first movie, this one is less entertaining but still funny and watchable. The direction which was made by Craig Brewer was good and he followed the pattern of the first movie and he succeeded on connecting them very well. The interpretations of both Eddie Murphy who played as Prince Akeem / Clarence / Saul / Randy Watson and Arsenio Hall who played as Semmi / Morris / Reverend Brown / Baba were very good for one more time. Some other interpretations that have to be mentioned were Jermaine Fowler's who played as Lavelle Junson, Wesley Snipes' who played as General Izzi and Nomzamo Mbatha's who played as Mirembe. In conclusion, I have to say that \"Coming 2 America\" is a nice sequel and I recommend everyone to watch it but first I suggest you to lower your expectations otherwise you will be disappointed."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "HvS5",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "The whole movie is full of little cheap gags, mixed with intermissions of ceremonious music and a whole host of celebrity cameos. It feels like I'm watching a costume party held in a mansion somewhere in LA . Completely devoid of the charm of the original movie. As I expected, this proved to be an uneeded and pointless sequel."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "drpainters",
        "review_rating": "6",
        "review_title": "Very tame",
        "review_detailed_main": "Just ok. Why make it your not going to be anything close to the original one. Very noticeable that it's PG-13 as the joke are just meh and not very funny. The plot is kind of tired having been done several times already in 2020. Just ok, would suggest just watching the original and trading places or 48hrs."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "teolupu-65954",
        "review_rating": "1",
        "review_title": "Wasted 2 hours of my life watching this so you dont have to.",
        "review_detailed_main": "Wasted 2 hours of my life watching this so you dont have to. Just do something else, avoid this movie."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "masonsaul",
        "review_rating": "6",
        "review_title": "Good but flawed sequel",
        "review_detailed_main": "Coming 2 America is a good but flawed sequel. The narrative is a predictable, unoriginal rehash of the original with some extremely questionable decisions but it's still an enjoyable sequel with good intentions and an impressive amount of callbacks. Eddie Murphy and Arsenio Hall are both reliably perfect in their multiple roles. Jermaine Fowler, KiKi Layne and Nomzamo Mbatha are all really good and Wesley Snipes is a scene stealer. It's reasonably funny with quite a few good jokes but nowhere near as funny as the original. Craig Brewer's direction is good, it's well filmed and well paced."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "mikebee-12893",
        "review_rating": "1",
        "review_title": "Meh",
        "review_detailed_main": "Movie was \"alright\" but if getting one star for making that awful, cringe-worthy scene about plant based burgers. What century are these people living in?"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "timthelightguy",
        "review_rating": "10",
        "review_title": "Just as funny as the Original",
        "review_detailed_main": "Its frustrating to see a mediocre score from some people who just don't get it. I have shown the original film to my kids a while ago. We sat down today and watched the sequel and all of my family members were busting up laughing just as much as the first film. If you understand the comedy in the first film, then you know it was spot on in the second film. The only thing I different I could say is what took you all so long for the second film?"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "snootsncoots",
        "review_rating": "7",
        "review_title": "Better than most comedy today",
        "review_detailed_main": "The first Coming to America was hilarious, and almost perfect. The sequel is not as funny, but I laughed out loud several times. It's hard to compete with the original.\n\nMost of the well loved characters are back, and it's great to see them. A few of the new characters are very \"New millennium\". Of course, there is girl power, the overdone theme of so many movies today. The now standard CGI is plentiful. I'm not a Tracy Morgan fan, he strikes me as abrasive rather than funny, but to each his own.\n\nIf not compared to the first movie, this is very good. To get all the jokes, you really need to have seen the first movie before watching the sequel, although it can stand on it's own.\n\nThe movie has a good family message and is enjoyable. It's not as funny as the first movie, but not many movies are. It's nice to see the characters back again."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "SimonEricAlexius",
        "review_rating": "2",
        "review_title": "Just disappointed.",
        "review_detailed_main": "Not much to say. If you like unfunny comedies without a story, this is a movie for you."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "dfywubu",
        "review_rating": "1",
        "review_title": "Sad",
        "review_detailed_main": "Corny and like all things today they had to Get political on the Barber shop The first one was a serious movie just felt more like Joe dirt style"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "enterlexx",
        "review_rating": "",
        "review_title": "More like Coming to Zamunda",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ricardoleffering",
        "review_rating": "6",
        "review_title": "It's okay",
        "review_detailed_main": "The movie is mostly a re-run of the previous movie, it has some fun moments but nothing to remember."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "tony-561-931314",
        "review_rating": "1",
        "review_title": "Stupid AF - Don't waste your time",
        "review_detailed_main": "This is one of the worst movies in the history of cinema."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "jamesmcaleese",
        "review_rating": "7",
        "review_title": "Ignore the negatives. Nowhere near as bad as they make out",
        "review_detailed_main": "If you enjoyed the original like most people did, give it a go. Make up your own mind. Too many critics on here giving derogatory scores put me off watching a lot of films.\n\nIt may not reach the heights of the original but it's still fun and enjoyable. All the old characters are back minus Daryl and his soul glow.\n\nIt does capture the spirit of the original which is great. Give it a go."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "seratt-50460",
        "review_rating": "1",
        "review_title": "Horrible and Embarrassing....",
        "review_detailed_main": "I was truly hyped about this one coming out. After making sure the kids were in bed, my wife and I sat down to enjoy this sequel. The feelings that followed were, I'm not sure... surprised? lol...\n\nThis may be the worst movie Eddie Murphy has ever done. I can't decide which one should hold that honor. Coming 2 America or Vampire in Brooklyn.\n\nIt wasn't funny, it wasn't witty... it really was just downright embarrassing. I'm sorry, but I feel bad for each and every actor that starred in this movie. This flop will follow you for the rest of your acting careers. That is, if you have one after this."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ellenmaze",
        "review_rating": "7",
        "review_title": "Come on, it's not that bad.",
        "review_detailed_main": "Folks expected too much. I expected just the right amount and I like it! I forgive them for getting old and less funny, but to get all those actors back?? It's worth a watch. I laughed at Snipes the most. He makes this movie as far as I'm concerned. Watch it but don't expect it to measure up to the first movie. Just watch it to have fun!!\n\nDon't miss the woman he left at the altar 30 years ago. She's been under that Royal canine curse ever since! Watch what happens!!"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "magpie1717",
        "review_rating": "1",
        "review_title": "Awful.",
        "review_detailed_main": "I am sad to report just how awful this movie is. I have been looking forward to seeing this sequel for a long time, but it might actually be the worst movie I have ever seen. My expectations were way too high. 😞"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "Courtlin2be",
        "review_rating": "10",
        "review_title": "Brilliantly Done",
        "review_detailed_main": "After 30 years and still can pull off not just 1 character but 3 different characters is simply amazing. The same with Arsenio Hall. If people are down playing Coming 2 America they are a hating. I enjoyed it 30 years ago & I enjoyed it today. Hat is off to this legendary Artist name Eddie Murphy"
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "cescfabregas-50996",
        "review_rating": "7",
        "review_title": "Geez, folks are harsh on this movie......",
        "review_detailed_main": "The first one was a delicious popcorn eating adventure and the second, another yummy popcorn eating comedic and nostalgic soiree. The movie obviously wasn't made as a testament to \"deep, philosophical nuances and to discuss afterwards, for hours and hours the meaning of life\". This movie is for \"throwing off your shoes, grabbing a cold one, and laying back on your chair, feet up on an ottoman, or in your recliner, in bed, on your couch or amongst your lounge suite. Enjoy."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "ian-579-225883",
        "review_rating": "1",
        "review_title": "Oh what a disapointment",
        "review_detailed_main": "Genuinely the the first film of all thelockdowns we've watched and had to turn off before it completed. We don't ever do this, just too clanky and really really not funny. Just dire. What a shame."
    },
    {
        "movie_id": "tt6802400",
        "movie_name": "Coming 2 America",
        "movie_rating": "5.3",
        "review_username": "philmcollins",
        "review_rating": "1",
        "review_title": "Don't waste the battery on your remote",
        "review_detailed_main": "I have seen some bad films , but this beats them all"
    }
]