[
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "MartianOctocretr5",
        "review_rating": "3",
        "review_title": "Fossilized dino deposits",
        "review_detailed_main": "This movie makes an awkward attempt to stay faithful to the spirit of the cartoon. It has moments, but far too few of them.\n\nThe few things done right first: Jane Krakowski makes a wonderful Betty; why couldn't she have been in the first movie? She makes the silly dialog somehow sweet and fun. The dating sequence is cute and the Vegas arrival scene has some clever sight gags, but these were fleeting montages. Harvey Korman is wasted in a throw-away role with few lines; instead of voicing Gazoo (as he did in the original cartoon), and the guy they use for Gazoo sounds like slate grinding on bedrock.\n\nJoan Collins is obnoxious enough on her own; this movie has her play a wrenching stereotypical loudmouth mother-in-law who you want to feed to the nearest T-Rex you can find. And the guy that plays Barney? What the heck is he doing? His entire performance looked like a rejected audition for a junior high school production of \"Bill and Ted's Excellent Adventure in Jurassic Park.\" Fred? The guy had a voice almost as nasally as Joan Collins. Wilma is cast as a 7-foot-tall giraffe. Fred goes gambling: Gee, what's gonna happen there? Fred and Barney dress up as dancers: they even manage to ruin this classic comedy routine. A poorly done triangle story falls flat.\n\nThis petrified fossil of a film does little justice to the Modern Stone-Aged Family. Rent some of the original cartoons, instead."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "lvalyani",
        "review_rating": "3",
        "review_title": "I Kinda of like this",
        "review_detailed_main": "This is garbage. I kinda of like it. Everything is bad. The plot starts 2/3 of the way into the movie. The writing is horrendous. The acting is god awful. Visually the movie is incredibly ugly. It has some of the worst sound design I have ever heard. Honestly, the best part of this movie (other than Dementia Dad) is the god damn CGI. Also, I still have no idea how old they're supposed to be in this thing, they look 40, they act 40, but they're just graduating college?"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "The Flintstones in Viva Rock Vegas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "A Sequel That Is a Prequel That Is Not Equal to the Original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "MovieAddict2016",
        "review_rating": "2",
        "review_title": "Truly Awful...I Had a Hard Time Watching it...",
        "review_detailed_main": "\"The Flintstones in Viva Rock Vegas\" is one of the poorest excuses for a family film I've seen in a long time.\n\nThe original remake with John Goodman was at least decent, but this flop has not only an awful cast, but awful dialogue, filming techniques, jokes...it's straight out of a made-for-TV sequel. Only one thing: It's even worse.\n\nIn this live-action prequel to the 1994 comedy hit, Fred Flintstone (Mark Addy) and wife Wilma (Kristen Johnston) go to Rock Vegas along with the Rubbles, Barney (Stephen Baldwin) and Betty (Jane Krakowski), where Wilma is pursued by playboy Chip Rockefeller (Thomas Gibson). This is the setup for a bunch of tiring gags that also have to do with a little green space alien coming to earth to see how humans mate, or something as such.\n\nThis has to be one of the worst comedies I've seen it a while. It was actually painful for me to watch. There really are no redeeming values whatsoever, and I don't think I'd like it even if I was a five-year-old. It treats the audience like dirt, and it obviously seeing if there's any juice left in the audience to pay for another \"Flintstone\" flick.\n\nInstead of trying to improve upon the first film--which was a bit underrated--this film seems to go for the bare minimum in an effort only to draw money from the audience. I have to ask myself, if they knew the first was so critically-declaimed, why release another awful flick? Try to improve and get good reviews.\n\nBut nope, no luck here. Instead we are treated to a truly awful and hard-to-watch comedy with no redeeming values whatsoever.\n\nAvoid at all costs.\n\n0.5/5 stars--\n\nJohn Ulmer"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Tiger_Mark",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I cannot imagine in a million years how this thing got the go ahead. The first one bombed with major talent in it. So, why would you make a sequel to a bomb with lesser actors? I guess they thought kids would like it. Well, kids might be immature but they are not stupid. As foul as a dinasour terd, avoid at all costs."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "darbylong",
        "review_rating": "1",
        "review_title": "A real yabba dabba dud",
        "review_detailed_main": "The headline for my review is all you need to know. Thank you."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "cwolf10",
        "review_rating": "5",
        "review_title": "I dont see the reason for reviews to trash on the film.",
        "review_detailed_main": "It's just a fun movie. Not all that big, once in a lifetime, classic type.\n\nI found it fun - but not as good as the 1st one."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "Yabba Dabba Poo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Nik-14",
        "review_rating": "3",
        "review_title": "Why wasn't this a straight to video release?",
        "review_detailed_main": "This film was bad. In the past these sequels have been delegated to video only.\n\nThe acting wasn't bad. Joan Collins was superb as Wilma's rich mother. A couple of jokes were great. But it was slow.\n\nMy 8 year old son loved the film. I would've walked out if I could. I think I would rather watch The Pokemon Movie again."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Victor Field",
        "review_rating": "4",
        "review_title": "Spare us \"Yogi Bear: The Movie.\" Please.",
        "review_detailed_main": "\"The Flintstones in Viva Rock Vegas\" is actually slightly more bearable than the truly horrible 1994 movie, but that really isn't saying much. Where the previous one suffered from chronically bad casting for the Flintstones and the Rubbles (except for Elizabeth Perkins as Wilma), this benefits from Stephen Baldwin and Jane \"Best reason to watch 'Ally McBeal' not called Lucy Liu\" Krakowski making a far less annoying Barney and Betty than Rick Moranis and Rosie O'Donnell (the latter the only major cast member to return here, in voice mode only). The movie also has a few nice little touches like pictures of the cartoon Fred and Barney handed out to people, and the specially modified Universal logo with the Earth only showing one continent behind the word \"Univershell\" (\"Did anyone else see those giant letters out there?\").\n\nAlan Cumming as the Great Gazoo (and a Mick Jagger-type rock star) is also one of the movie's pros... and indicative of its cons. Writers Deborah Kaplan & Harry Elfont (\"Can't Hardly Wait,\" \"Josie and the Pussycats\") and the late Jim Cash & Jack Epps, Jr (\"Top Gun,\" \"Anaconda\") go for too many cheap gags, have a wilful disregard for the show's mythology - Gazoo didn't arrive until Fred and Barney were both married with children, for starters (and as another poster rightly says, he crashlanded as opposed to being sent) - and don't really have much of a plot going for them. The movie's all as silly as that episode where the boys befriended \"Ann-Margrock\" without knowing who she was.\n\nSpeaking of which, Ann-Margret (who guested on the TV show) returns to Bedrock to sing \"Viva Rock Vegas\" in a montage and over the credits, but her take isn't a patch on the BC-52's version of the theme song in the first one, and indeed the overall feeling of going down a level is everywhere - not just in the plot of Wilma's mum wanting her daughter (a miscast Kristen Johnston) to marry an uppercrust type (Thomas Gibson from \"Dharma & Greg\"), but from the cast to the visual effects (Rhythm & Hues aren't quite up to Industrial Light & Magic's level) to the music (song-wise, that is; David Newman at least tries), the movie fits in all too well alongside the other losers directed by Brian Levant, he of \"Problem Child\" and \"Jingle All The Way\" infamy. And I still think James Belushi, not John Goodman or Mark Addy, IS Fred Flintstone.\n\nAt least the first one had Halle Berry and some puns in the credits (though this does have Jane Krakowski - hubba hubba). And no Joan Collins..."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Chiller7",
        "review_rating": "10",
        "review_title": "Silly fun",
        "review_detailed_main": "I had the VHS of the original live action Flintstones movie as a kid and watched it many times. But I never did see the sequel. By the time it came out years later, I was at that age where I was too old to want to see it.\n\nFast forward to 2016, currently I've been really into DC's great new Flintstones comics series (It's hilarious. I highly recommend it.), so since I was in the mood for all things Flintstones, I just rented this movie to watch it finally.\n\nThis movie was silly enough to keep me amused throughout. Yes, the story is dumb and all the characters are idiots, but they're lovable idiots - all the actors clearly had a good time - and it's all so bright and colorful and cheery that you can't hate it.\n\nI laughed aloud at enough of the ridiculous scenes throughout the movie, such as Dino's big moment, or the prehistoric TV remote control, that I can't rate this movie any lower than a 10 out of 10. I enjoyed this silly movie.\n\nSurprise cameo: Not exactly a \"cameo,\" since he wasn't famous back then, but it was funny to see John Cho in an early tiny role as the valet who gets beat up by Fred and Barney."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "planktonrules",
        "review_rating": "6",
        "review_title": "Why all the hate towards this film?!",
        "review_detailed_main": "When both Flintstone movies came out, my daughter wanted to see them, so we did. I was not especially impressed by the films...but I thought they weren't bad. Well, apparently I am not the typical viewer, as both films (especially \"Viva Rock Vegas\") have very low scores on IMDB...and \"Viva Rock Vegas\" now made the Bottom 100 list following the recent changes to this list (increasing the minimum number of votes greatly impacted the list....and about 2/3 of the films are new to the list). Because of this change, I decided to try seeing the film again....and perhaps I was mistaken the first time.\n\nThe first thing you'll notice is that although the look of the film is great (much like the first film), all the principal actors are different. Apparently, the studio had a hard time getting the old actors to commit to the film...so to try to get around this, the movie is supposed to be a prequel which occurred long before the Spielberg film.\n\nWhen the story begins, Gazoo is being punished for some unknown mistakes. His punishment is to be banished to Earth to observe human mating rituals. Not surprisingly, he picks Fred and Barney to follow...as the boys have not yet met Betty and Wilma. Once they do, they all fall in love but it doesn't go THAT smoothly. First, Wilma comes from a rich and snooty family...and they have no interest in low-brow Fred. Second, Wilma's old boyfriend invites the four of them to Rock Vegas....and he obviously has some underhanded scheme in mind for them. Third, once in Rock Vegas, Betty mistakenly thinks Barney is chasing another woman and she ends up being one of Mick Jagged's entourage.\n\nSo was I wrong the first time? I don't think so. While the film isn't exactly brilliant, it is what it is supposed to be...a live action version of a cartoon...no more, no less. And, despite me not seeing it with my daughter this time, I had a fine time watching the film. Pleasant and adequate...and not at all deserving all the hate it's received. Believe me...there are many, many, many worse kids films, such as \"Santa Claus Conquers the Martians\", \"Baby Geniuses\" (1 and 2), \"Son of the Mask\" and most of the \"Land Before Time\" films (they made 14 of them!!!). Don't be afraid to buck conventional wisdom, as I think this film is enjoyable and a decent story to watch with your kids."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Beta_Gallinger",
        "review_rating": "4",
        "review_title": "Even weaker than the mediocre 1994 movie",
        "review_detailed_main": "I saw the 1994 live action \"Flintstones\" movie on video for the second time in 2000, about 4 ½ years after I first saw it, and thought it was great during my second viewing. That was shortly after this prequel, featuring a different cast, came to the silver screen, and I remember hearing about this film around that time. Since I was not nearly as impressed during my last couple viewings of 1994's \"The Flintstones\" (both many years after my second), I was in no hurry to see \"The Flintstones in Viva Rock Vegas\", especially since I knew it had an even worse reputation than its predecessor. It's been over 2 ½ years since I last saw the first live action \"Flintstones\" effort, and I've finally seen this second one, which is unsurprisingly not good.\n\nThe Great Gazoo is an alien who is sent to Earth by his species to learn about human mating rituals. Back on Earth, in the prehistoric town of Bedrock, Fred Flintstone and Barney Rubble are two best friends who are both in search of girlfriends. They are the first ones Gazoo sees after he lands on the planet, so he decides to follow them around, even though he annoys them. Meanwhile, a rich young woman named Wilma Slaghoople is fed up with the snobbish people around her, especially her mother, and runs away. She goes to a restaurant and meets a waitress named Betty O'Shale, and they quickly become friends. Fred and Barney go to this restaurant and meet the two women. Fred gets a date with Betty and Barney gets one with Wilma. When the four of them go out together, Fred and Barney end up swapping girlfriends, but both of them are successful with their romance. Both couples are invited by Chip Rockefeller, Wilma's rich and arrogant ex-boyfriend, to his resort in Rock Vegas, but what they don't realize is that this is just a cruel scheme for Chip to win Wilma back!\n\nThe main problem with the 1994 film is that it simply isn't funny, and that's most certainly a major issue with this prequel as well. The only part of this film I couldn't keep a straight face while watching was the \"I'm ignoring you\" part. There's one memorably lame moment with a farting dinosaur, and most of the other gags are just mediocre. I was also not impressed with many of the performances here. Mark Addy may not be bad as Fred, and I guess Stephen Baldwin isn't that bad as Barney, though I definitely preferred Rick Moranis' portrayal of the character in the first film. These performances certainly aren't great, however, and I certainly didn't care for Kristen Johnston and Jane Krakowski as Wilma and Betty respectively. Also, Alan Cumming plays two characters, which are Gazoo and Mick Jagged (obviously based on real-life Rolling Stones frontman Mick Jagger), and both his performances fail, especially the former, I would say. At the beginning, showing Gazoo with other members of his species on a spaceship before he is sent to Earth, it already looks like this is going to be a very unfunny comedy movie, and unfortunately, that beginning sequence doesn't lie.\n\nThe first live action film adaptation of \"The Flintstones\" was a critical failure but a box office success, whereas \"The Flintstones in Viva Rock Vegas\" was both a critical AND box office flop. After watching it, that doesn't surprise me. I can't really think of anything wrong with the 1994 release other than the absence of laughs, but I would say that REALLY brings it down if quality, since it is supposed to be a comedy. Just like its predecessor, this prequel failed to make me laugh even one time, but this second film of the two also has inferior cast performances, and maybe a slightly more boring plot as well (I'm not 100% sure about that, as it's been a while since I last watched the first film), which makes it even worse. I only found it a BIT worse than the 1994 film, and don't absolutely hate it like many others clearly do, but some could find it a LOT worse, including some of those who like the first film. If you don't like 1994's \"The Flintstones\", you probably wouldn't like this prequel. If you do like that movie, there's probably STILL a good chance you wouldn't like \"Viva Rock Vegas\"."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jrb1802",
        "review_rating": "",
        "review_title": "Mark Addy's Fred Flintstone is better than John Goodman's.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "duffyboy666",
        "review_rating": "1",
        "review_title": "Yabba Dabba Don't",
        "review_detailed_main": "Since the 60's/70's, Flintstones has always been one of the top cartoons. I mean all the kids love it, it's on Cartoon Network all the time and it's a true classic. It's great.\n\nThe trouble with a franchise like this is that there will be some companies that exploit a craze such as this and find ways to sneak you out of your money and rip you off. One such example is Flintstones Viva Rock Vegas.\n\nIt's released in the summer of 2000, and it's a terrible film. It's tacky, lacking in plot, miscast & just truly awful. Now I know that bad films like this are released all the time and that's nothing new. However what's so special about the Flintstones VRR more than anything else is that upon it's release over here, it cost £20.\n\nThat's right folks. Us punters in the UK had to fork out 20 notes for this prehistoric guff. Now here's the worrying part. A lot of Flintstones fans just looked at the box and said \"Wow! Flintstones movie!\" And they bought it and obviously they regretted it soon enough. So I now am going to show you how to have an infinitely better Flintstones experience.\n\n1) The Flintstones series on video: If you are a Flintstones fan you probably already own one, but if you want to give it a rent now, it is priced about £1:50 tops.\n\n2) Fred Costume: You can pick these up in just about any car boot sale for about less than a fiver.\n\n3) Action Figures: There's plenty of them about, and they cost not even £3:50 in Toys R Us store.\n\nSo what does that bring us up to? £10 max. For £10, you have all of these three things, and you're having a great Flintstones time. But for £20, you're having an awful time with VRR.\n\nI think I've made my point clear enough.\n\nDon't Watch This Film."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "filipemanuelneto",
        "review_rating": "1",
        "review_title": "A movie that isn't worth the price of DVD's plastic.",
        "review_detailed_main": "I always liked the \"Flintstones\" cartoon and I was able to appreciate some aspects of the 1994 live-action movie. However, this movie was a disgrace in every details. Running as a prequel to the first film and the cartoon itself, it shows how the four main characters (Flintstones and Rubbles) met and married, after a trip to the city of Rock Vegas (the equivalent, in the movie and Flintstones world, to the city of Las Vegas, of course). But the thing that really make me mad in this movie, personally, was that silly, green character, that seems to have come out of the \"Jetsons\" (another Hanna-Barbera cartoon). He was permanently out of context, his existence has been poorly explained by the plot and he only served to try to make totally empty jokes. I wanted to drown that alien several times while watching the movie.\n\nIf the 1994 movie had already revealed several fragilities, beginning with an all-too-adult plot for a children-oriented film, this movie completely misses any attempt to improve these faults. The plot is miserably poor, which is probably the result of poor scriptwriting choices and the subliminal, lousy, intention of extorting some more box office money (we cannot forget the huge box-office success that the first film was). A bad choice: the public wisely didn't pay to watch this piece of trash. Dried jokes, a bad plot, poor acting, bad construction of characters, far-fetched props and sets, a tiring cinematography and a cast that did an absolutely painstaking job. For all this, this is one of the worst family movies I've ever seen."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "studioAT",
        "review_rating": "2",
        "review_title": "Why a prequel?",
        "review_detailed_main": "The first Flintstone film was enough of a hit to warrant a second attempt and oddly the powers that be opted for a prequel rather than a sequel.\n\nThe big problem that this then creates is that there is little or no drama to be had in this film because we all know perfectly well that Fred and Wilma will end up together.\n\nQuite where the martian coming to earth to learn about courting came from I don't know, but it adds very little to the film.\n\nAll that remains then is a film that feels like a straight to DVD attempt and although Mark Addy and especially Kirsten Johnston do their best, this film is pretty pointless."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "chipbrill",
        "review_rating": "1",
        "review_title": "Words fail me...",
        "review_detailed_main": "Words fail me. I do not possess the proper powers of verbiage to fully communicate just how terrible this tripe is. If there are any saving attributes, they are masked by the thoroughly inane entirety of this mess.\n\nThere is little, if anything, that has the humor of the original cartoon. The casting of Fred and Barney is, at best, awful. I suppose the actors portraying Betty and Wilma are somewhat grace-saving and Dino, well, what can you say about Dino that hasn't been said before.\n\nThankfully, Pebbles and Bam-Bam were not yet around to have to endure this."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "geatornez82-202-283937",
        "review_rating": "1",
        "review_title": "Was This Trip Really Necessary?",
        "review_detailed_main": "This is a prequel to the first live action Flintstones movie, which I didn't think was that good. This tells how the Flintstones and the Rubbles first got together, and they changed it from the original cartoon, and I really don't understand why they did that, other than it makes it more dramatic, or something along those lines.\n\nThe casting wasn't all that great, either, in my opinion. Mark Addy and Kristen Johnson were only okay as Fred and Wilma, but Stephen Baldwin made Barney look like an idiot, and I found Jane Krakowski's Betty to be a bit annoying. Then, there's the Great Gazoo, who originally came into the picture in the cartoon in the last season. Here, Fred and Barney meet him before they even meet the girls. It would have been much better if they did a CGI Gazoo that looked more like the original character, and got his original voice, Harvey Korman (who did appear in this movie as Wilma's father, actually) to do the voice. Alan Cumming's head on a CGI body was kind of off-putting, and maybe it would have been better if the body was a bit more proportionate to the head.\n\nI think the only thing I liked about this movie was Harvey Korman as Wilma's slightly senile father, and Dino as a baby dinosaur (so cute!), as well as using archived vocal effects from the late, great Mel Blanc (Dino's original voice actor)."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Tak005",
        "review_rating": "1",
        "review_title": "A Prequel to a Sequel that should never had been made.",
        "review_detailed_main": "The previous movie on which this prequel was based was just a blatant attempt to milk the success of the original Flinstones cartoon. It was bad all around and should never have been made. Then for some unknown reason they have decided to make this prequel, about which there is nothing good to say, which is even worse."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "mcomer",
        "review_rating": "3",
        "review_title": "Made to sell lunch boxes.",
        "review_detailed_main": "In essence, I didn't really like this one. There is only one facet that is better than the original, the rest of the movie doesn't even come close to being as good as the original.\n\nThe one facet that is better than the original is the actress playing Betty. This actress is a MUCH better job than the other actress that acted in the original Flintstones movie.\n\nBuy it? Ha! \"absolutely not\".\n\nRent it? A VERY remote \"maybe\"..."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "bettyz24",
        "review_rating": "8",
        "review_title": "Spectacular in the support",
        "review_detailed_main": "I know a lot of people hate this movie and it's rated ridiculously low but it has always been a favourite of mine.\n\nBright colours and goofy pre-historic puns make it easy for the whole family to watch, and if you have to get up to do something, you won't miss any crucial plot points.\n\nThere may be some casting that you didn't like but Jane Krakowski is perfect as Betty and Alan Cumming is always perfect, he plays great as Great Gazoo AND Mick Jagged (\"snag m. Even Joan Collins was outrageous as mother Slaghoople, but who else could bring glam to a time without modern techniques?? And, as reminder, she was a prequel version of Liz Taylor from the original. Special mention to Thomas Gibson as the handsome villain.\n\nI'm no movie producer or whatever but the sets looked mostly real, unlike most movies now filmed almost exclusively in warehouses, and the effects they do use are better than some I see now, 17 years later. Sure, if you look closely, the lighting is off or poor depth perspective on some of the fast-moving effects, but this was the show based on a cartoon style that repeated it's backgrounds while eyes and mouths basically had two positions, open and closed.\n\nThe music is rompy and fun, classic style meet-cute and Vegas tunes. And who doesn't love an origin story? And I can't resist a Vegas movie. Hello? Ann Margrock seeing a stone-age Elvis cover? EPIC!\n\nFlintstones (this one and it's predecessor) are among the first of the live-action cartoon revivals, I cash cow that Disney is now suckling to.\n\nI haven't noticed any of the older reviews on here point out specific issues, so I would argue they weren't open to liking the movie in the first place."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Allan-14",
        "review_rating": "7",
        "review_title": "It's not that bad!",
        "review_detailed_main": "Jeez, it ain't THAT bad! 3.8? Maybe the original, MAYBE, but this is a substantial improvement over that, and the original has like a 4+ rating. I don't really give this a 10, I give it more like a 7.5, but I gave it a 10 because I found the ratings to be well, WAY OFF. This one had decent performances, really excellent art direction, and some really cool FX. I especially liked the Bronto-bridge and the Great Gazzoo. Unlike the first Flintstones, this prequel is smart, fun, and the actors truly become the characters they play. The story? LAME. The first 60% or so of the film DOES CLICK. But the rest, when they arrive in Rock Vegas, is pure dreck appealing to the lowest common denominator. But the film is so fun to look at, you really don't care. There are a lot of films to love to hate but this one really is NOT it. It's an adult Flintstones, if you can imagine that, and it's a small but cute treasure to behold."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Merrie117",
        "review_rating": "5",
        "review_title": "Good, clean, family movie.",
        "review_detailed_main": "No, this movie isn't great. But movies that you can take the whole family to see are getting fewer and fewer. This is an entertaining, fun, family movie. Give the kids an appreciation for the funny cartoon characters so many of us grew up with. I think this one is better than the first live-action Flinstones movie."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "observer8",
        "review_rating": "",
        "review_title": "Decent sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jeffreyharanvezina",
        "review_rating": "4",
        "review_title": "Why does it exist?",
        "review_detailed_main": "What was the point of this movie? Hollywood must have been missing ideas because a sequel to a movie that was already poorly received in the first place is pretty lazy so those this movie improves over this one? No not really the story is a standard love story thats predictable and the only difference is that it has the Flintstones name attached to it. This is a prime example of a movie that just sits there and hopes it will make just by its name. Now to be fair the movie is not awful but its just of poor quality to a point that you wonder if it was worth putting money on this project and just by the way the movie ended up being a commercial failure and getting razzie-nominated."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "mwcanadian",
        "review_rating": "5",
        "review_title": "Better than the first one...",
        "review_detailed_main": "This movie was better than the first one was. The issue with the first one was how Bam Bam was (sorry, but the strongest boy in the world shouldn't be captured unless he's unconscious).\n\nAs for this movie, the characters are good. I like the story of how they met and what Wilma leaves behind for her friends and future husband. It's not a great movie and Gazoo is all of annoying, but at least the actor didn't do everything bad as he did a great impression of Mick Jagger. All in all I call this a middle of the road type of movie."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "micahmann22",
        "review_rating": "1",
        "review_title": "Worst Movie Of All Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "JR-59",
        "review_rating": "3",
        "review_title": "My kids loved this film, but parents should have something along to pass the time.",
        "review_detailed_main": "It's your usual derivative live version of your usual derivative Hanna-Barbera cartoon (did those guys ever have an original idea?).\n\nYou know that you're in trouble when the funniest thing in the film is a dinosaur (shall we say) borrowing from the campfire scene in \"Blazing Saddles\". Hopefully, there aren't any more sequels coming. Can \"The Jetsons -- The Movie\" be far behind?"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "shelly-93078",
        "review_rating": "1",
        "review_title": "Wtf",
        "review_detailed_main": "Whoever green-lighted this should have been fired immediately"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "michael120274",
        "review_rating": "1",
        "review_title": "what a great movie to",
        "review_detailed_main": "smoke a bowl to.wow i mean if you watch it any other way your gonna want to anyway. this is garbage everyone knows it even those of you who gave this movie a 10.so with that being said anyone who did like this movie please do yourself a favor and go get bedrock bowling for the playstation youll probably think its good too.everyone who took part in making this thing of a movie should be blacklisted from hollywood for at least the next five years as punishment for this crap called cinema ;)~~~"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "travism-44784",
        "review_rating": "1",
        "review_title": "Typical Rosie Flop",
        "review_detailed_main": "I had never seen this movie until the other day and wish now I hadn't. It was a complete train wreck from the get go. No creativity and horrible acting."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jjs402",
        "review_rating": "8",
        "review_title": "Lighten up, Francis. It's a cartoon sequel.",
        "review_detailed_main": "Way too many critical comments. This is a cute family movie with just enough humor and tensions and moral to suit all viewers regardless of age. The special effects are good and the cinematography is actually interesting.\n\nSome of the double entrendres are cute, but they harmlessly go right over the kid's head. (Remember, the theme song says \"...They'll have a gay old time.\")\n\nThere's a couple of clever buried jokes. (Did anyone else catch Gazoo's \"Klaatu berada niktor\" comment?)\n\nAlso, Kristin Johnson is quite easy on the eyes.\n\nRemember, it's a MOVIE based on a CARTOON. Set your expectations accordingly. Enjoy."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "ragman-7",
        "review_rating": "7",
        "review_title": "Lighten up harsh reviewers.",
        "review_detailed_main": "This movie is not for the uptight movie viewer. Those who need a great plot and a message and theme and all the other tenets of good cinematography. And I can be one of those at times. I can hate a movie that tries too hard to be great cinema in stead of great entertainment. The movie is not great cinema, but is great entertainment.\n\nThis is just a fun movie. Mostly pointless, except if you just want to have some fun and not think a lot. What I really enjoyed was the sets and costumes. I love bright colors and this movie was Awesome on my 40 HDTV. And because the Movie is in 1:85 aspect ratio, It wasn't panned and scanned, which I hate. Best of all, I am a huge Jane Krakowsi fan. I find her gorgeous. Her playing the brunette Betty Ruble, vavoom. I couldn't take my eyes off her when she was on screen. I give it 7 stars for plan simple fun, great sets, costumes and vibrant colors. And of course my girl Jane."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Movie-12",
        "review_rating": "1",
        "review_title": "One of the most horrible comedies in years. 1/2* out of ****.",
        "review_detailed_main": "THE FLINTSTONES IN VIVA ROCK VEGAS / (2000) 1/2*\n\n\"The Flintstones in Viva Rock Vegas\" reminds me of edible substances that have no taste, no texture, no nutrition, but are very colorful and you can chew on them. This movie has no depth, no purpose, no meaning, but it has prehistoric set creations, big sound effects, imaginative costume designs, and colorful makeup contributions-all of which may capture the attention of the film's target age group. This contraption absent of intelligence, flavor, and just about everything else.\n\nThis immature prequel to the 1994 comedy hit based on the popular TV cartoon series, \"The Flintstones,\" is so bad none of the previous performers have faithfully returned for seconds. The replacement for John Goodman is Mark Addy, the obese male stripper in \"The Full Monty.\" Rick Moranis' replacement is with Stephen Baldwin, whose most profound acting experiences uphold on the M&M's commercial. Kristen Johnson and Jane Krakowski substitute for the much funnier Roise O'Donnell and Elizabeth Perkins. Not coincidentally, these new actors, especially Addy and Baldwin, fit their dumfounded characters perfectly.\n\nThe film details the fossilized lives of best friends Fred and Barney before they marry and conceive children. The two meet their future wives, Wilma and Betty, at a fast food restaurant. Conflicts evolve when Fred falls in love with Wilma and her filthy rich mother (Joan Collins) requires her daughter to romance playboy ex-boyfriend (Thomas Gibson) and skip poor Fred. Another subplot involves an alien (Alan Cumming) being sent from another planet to observe human mating rituals. Of course, Fred and Barney are right in the middle of the creatures' mishaps.\n\nI never cared about any of the characters in this movie; none of them have any motive or brains outside of the script. There is no effective tension contained in the love story either. The production dim-wittily attempts to portray suspense and involvement with romantic competition Wilma experiences. The \"Rock Vegas\" blackmail scheme contributes brief uptightness in the audience, but its conclusion will leave you laughing with pity.\n\nAs far as humor goes, \"The Flintstones in Viva Rock Vegas\" is lacking of any funny material due to incredibly poor writing. There are dozens of slapstick jokes about dinosaurs, rocks, style, aliens, obesity, and clumsiness, but none have any life. At least similar comedies \"My Favorite Martian\" and \"What Planet Are You From\" were appropriately wacky. \"The Flintstones in Viva Rock Vegas\" is too corny for its own good. There were a few scenes that were so pathetic I could not hold my laughter back, but I was laughing at the movie, not with it. Several of these horrible sequences transpire through ridiculous dialogue. Here are a few examples:\n\nFred complimenting Wilma in a love scene \"Your eyes are like two big eyes\"\n\nWilma to her family who is disbelieving of her passion for Fred \"They love me for who I am\u0085not who I am.\"\n\nAs bad as the original \"The Flintstones\" was, \"The Flintstones in Viva Rock Vegas\" is a whole lot worse. Perhaps there is no coincidence the two movies acquire the same director, Brain Levant. This man has created bad films before (\"Problem Child 2,\" \"Jingle All The Way\"), but never anything as putrid as this pile of bones. After reading this critique, I fear you may misinterpret my implication; this movie is not so bad that it's funny, it is so bad it's bad."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "robertjdrury",
        "review_rating": "",
        "review_title": "Don't even waste your time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "TeddSaidHi",
        "review_rating": "1",
        "review_title": "DO NOT spend your time watching this sorry excuse for an attempt at a film",
        "review_detailed_main": "I really can't say much about this travesty... but even if I could, I'd probably refuse to give this movie anything else. I'll elaborate SLIGHTLY on the sad butchering of the Hannah-Barbarah classic... THEY DIDN'T ACT LIKE THE CHARACTERS. THEY DIDN'T ACT AT ALL. THEY LOST THE FOCUS OF THE PLOT. THEY DIDN'T KNOW HOW TO EDIT EVEN....... aaaaaaaaaahhhhhhhhhhh! (okay, I'm done)"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "barns-70831",
        "review_rating": "4",
        "review_title": "Falls short from first one, but clever in other ways",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "carchero",
        "review_rating": "4",
        "review_title": "A Poor Excuse For A Flintstone Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Quinoa1984",
        "review_rating": "1",
        "review_title": "What was I thinking?",
        "review_detailed_main": "I just saw this movie again on tv, and I realized, hmm maybe it does suck. Of course I could be wrong (I gave it props in the original review), but I think not. This is a film that repulsed me, and keep in mind this is a prequel, to a film that was a remake of the tv show based on the classic honeymooners, and that type of chain can create foulness as I now realize.\n\nThe so called plot follows Fred and Barney, younger here, search for love and find it in Wilma and Betty and of course the rest is ancient (and not too good) history. Not even the great gazoo can bring this film from the muck that it is. D-"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "TuckMN",
        "review_rating": "4",
        "review_title": "A big, bright, noisy, colourful mess.",
        "review_detailed_main": "This second live action rendition of the animated cartoon by Hanna-Barbera seems to be uncertain of whom its audience is -- there is scatological humour for the kids (and like-minded adults), romance, song-and-dance routines, a Mick Jagger impersonator -- but the whole melange didn't really mesh into a cohesive whole.\n\nThe story of how Fred (Mark Addy) and the perfectly cast Barney (Stephen Baldwin) meet, woo, and eventually conquer the hearts of Wilma (Kristen Johnston) and Betty (the incomparable Jane Krakowski) is over-involved and too convoluted for small children; but the bright colours and action kept the kids at the matinee we were at quiet -- for the most part.\n\nJoan Collins as Wilma's scheming mother (and her FABULOUS costumes) was an absolute delight to the eye. Harvey Korman as her father did little more than grunt occasionally.\n\nThere were some good sight gags and jokes, and the inevitable stone and rock puns, but they were all aimed at the adults.\n\nKids raised on Pokeman and Nickelodeon are not going to really enjoy this movie -- but they will probably beg their parents to take them and Mom and Dad will enjoy it more than the kids will."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "mattoid-45605",
        "review_rating": "3",
        "review_title": "Dino Good",
        "review_detailed_main": "I gave this thing 3 stars for Dino! Best character in this absolute disaster of a movie. Dino actually made me kind of chuckle. Why, oh why did they bother?"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "matthewssilverhammer",
        "review_rating": "4",
        "review_title": "Yabba Dabba Bad",
        "review_detailed_main": "The design is still impressive, and the story is much more in the vein of the show...but this new casting is embarrassing. The four leads look like they're being held hostage; it's never a good sign when Stephen Baldwin is the standout. Rosie O'Donnell returns, but doesn't get to reprise her solid performance as Betty. And why did Hollywood put all their chips on Alan Cumming at the turn of the century? No one won from that bet...including Cumming."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "ThomasJ101",
        "review_rating": "10",
        "review_title": "a great, fun little movie",
        "review_detailed_main": "In reading a few of the negative reviews of this movie, I'm wondering if certain detractors actually even watched it. It's too easy for some people just to dis a flick because it is a sequel, or because it went straight to video, or because it's expected to be bad, or whatever. Don't let that happen with \"Viva Rock Vegas\": it is a fine little movie: fun, funny and visually rich in cartoony colors, costumes and sets. The acting (and voices) are top notch: Stephen Baldwin's \"Barney\" and Mark Addy's \"Fred\" are just fantastic; voices, mannerisms, etc. Jane Krackowski is spot on as Betty, (ditzy-ness and giggle-wise). Alan Cumming as \"The Great Gazoo\" is perfectly sarcastic and wise-ass. The CGI is very good, considering, as are the sets and costumes. The storyline makes sense, is plausible, and even engrossing (again, considering). For what it is, this is a great little movie, and compared to the first one (sheesh) it TOTALLY rocks (\"rocks\". get it?). I defy anyone who can actually tell a good movie from a bad one to watch this movie IN FULL, ALL THE WAY and TO THE END, and tell me that they weren't entertained by it."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "Better than expected prequel, and a decent movie",
        "review_detailed_main": "I came on here to review this movie, and I was really surprised at the rating. I didn't think the movie was that bad. It is flawed in a lot of ways, but there is some fun embedded in the film. I am stuck on whether it is better than the 1994 movie or inferior. If I were to be picky, I would say better in some areas, inferior in others. My main flaws were with the script and some of the plot. The script is weak in places, but has some funny moments, mainly with the little green alien. The plot I think is stronger than the one in the 1994 movie, but slower in pace and does suffer from one or two hasty and over-familiar subplots like Chip stealing Wilma's necklace and framing Fred. I liked it though that it detailed of how Fred and Wilma met, and the scene at the bowling area was sweet with the Nutcracker serving as background music. Mark Addy looks more the part of Fred than John Goodman, but I felt that he slightly underplayed, and I did find Stephen Baldwin too tall and too gormless as Barney. However, Kristen Johnson is wonderfully voluptuous as Wilma and Jane Krakowski, what can I say, better than Rosie O'Donnell. As much as I like O'Donnell, she wasn't quite right for Betty in the 1994 film, Krakowski was perfect. In terms of supporting actors, Alan Cumming is amusing as Mick Jagged and even better as Gazoo and Joan Collins is a sheer delight as Pearl. Thomas Gibson has his moments as Chip. The soundtrack is great, and the scenery, costumes and design of Dino were spot on. Plus that little alien is cute, and the dance routine at the end was lots of fun. All in all, has its flaws but it's a fun prequel. 6/10 Bethany Cox"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "TOMNEL",
        "review_rating": "3",
        "review_title": "An insult to the series, and even the original movie.",
        "review_detailed_main": "\"Flintstones in Viva Rock Vegas\" is a downright stupid movie. The sets in the first film made it very fun to watch. This has some cool looking sets, but relies too much on bad computer animation. Of course, that's not the worst part. Everything else is quite bad too.\n\nFred Flintstone (Mark Addy) and Barney Rubble (Stephen Baldwin) have met the girls of their dreams, Wilma (Kristin Johnston) and Betty (Jane Krakowski). This movie sets up a stupid back story for Wilma as a rich girl, and features a very annoying character. Remember the Great Gazoo? He's the little annoying alien that was added as a character when the show was almost over in it's last season. The introduction of this character in the show was it's final desperation to not be canceled. So why did they figure Gazoo would be a good idea for the movie? I have no idea, but it wasn't. The acting is OK, at least Betty Rubble was played by somebody who fit her in this one, unlike the first film. So, other than a few cool sets, this is an easy movie to skip.\n\nMy rating: * 1/2 out of ****. 85 mins. PG for mild language."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "scoobydoo2000ms",
        "review_rating": "",
        "review_title": "excellent movie for all ages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jtrkan",
        "review_rating": "2",
        "review_title": "Uninteresting even to its core demographic.",
        "review_detailed_main": "When I was a kid, the TV channel I used to watch had a showing of this movie what seemed to be every other night.\n\nAlthough that might have been just a slight exaggeration, they actually must have got a really cheap licensing agreement, because I have some scenes burned into my retinas.\n\nI actually do like the animated Flintstones series. But 'Viva Rock Vegas' just plays like a barebones-structured, full-lenght feature movie. This might have worked as a 30-minute short or direct-to-DVD, but when it hits the 90-minute mark it already is too overdone.\n\nBeing live-action is not doing this any favors. Addy and Baldwin aren't nearly as charming as the animated Fred and Barney, and the creativeness of the drawings is poorly substituted by props and some amount of early-2000's CGI.\n\nThe writing is plain bad. It fails to entertain an undemanding 6-12 year old. Forgettable jokes, boring deliveries and a frankly uninteresting story. I also was forced several times to either see this or turn off the TV."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "gummitch-2",
        "review_rating": "5",
        "review_title": "Now I know....",
        "review_detailed_main": "I've always wondered why the prequel to the successful Flintstones movie ended up as straight to video stuff. The plot itself was utterly dumb, and the \"SFX\" quite laughable. I would have thrown the VHS out of the window, were it not for the girl who played Wilma (I think she was pretty good), and most of all Alan Cumming. OK, Mr Cumming is definitely the best thing in this wreck of a movie: he steals the scene playing the Great Gazoo...and he completely revives the last part of the movie playing Mick Jagged (a kind of cross between Austin Powers and Mick Jagger). He was the only reason I didn't fall asleep."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "MagnumPI",
        "review_rating": "2",
        "review_title": "Yabba-Dabba-DUD !!!",
        "review_detailed_main": "This film pales to the original. I gave it a '2' because the movie previews before the feature attraction were so good. The cast wasn't all that great. The plot and story line were weak. The special effects were right out of \"The Muppet Movie.\" Save your hard-earned \"clams\" and take Bam-Bam and Pebbles to see \"EL DORADO.\""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "lartola",
        "review_rating": "5",
        "review_title": "Entertaining but not as good as the 1960s series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "timmsy1986",
        "review_rating": "2",
        "review_title": "ruined the 1st and killed Flintstones films",
        "review_detailed_main": "the first films was perfect, great actors for each role, the Fred as John Goodman and barney as rick moranis was perfect, and the proportions are correct, Barney was always short and smaller then Fred who was big and well built due to working at the quarry.\n\nthis one the actors are poor nobodies (except Joan Collins who disappear from the acting world and only appear for bad films such as this.\n\ni don't even understand the need for the casting change? unless no one liked the film? i mean Stephen Baldwin as barney? and an English comedian as Fred? big voiced American Fred? WILLLMMMAAAAA real let down and not worth watching, just watch the first it will make you so much happier on its own"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "willowcobb",
        "review_rating": "1",
        "review_title": "Crap movie- poor casting",
        "review_detailed_main": "The first movie was okay but my biggest gripe with this movie is the poor casting. I think that maybe if they would have been able to get more of the original cast the movie could have been considerably better. I grew up on the cartoon and I just can't see any of these actors as the there cartoon counter parts. In the first live action movie the casting was far better and I'm sure it had a higher budget. This second one feels like an extremely low budget knockoff movie. My wife put this on to entertain our toddler. I think he was mildly amused but unfortunately I felt like I was being tortured having to sit through this. This movie gets two big thumbs down in my book 👎👎"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Drake-Z",
        "review_rating": "2",
        "review_title": "A Pay-Per-View I Wished I Didn't Get",
        "review_detailed_main": "I am usually not harsh... but this movie was just horrible!\n\nIt's as if the set designer made no attempt to try and fool us. At least with the first one the set had more of a realistic feel if you will. The set designers took a vacation with this one. It was so horrible.\n\nThe story line was... I can't even waste my time typing how bad it was as well.\n\nI truly counted the minutes till it would end. I wanted to change the station so badly, but I paid 2.99 for it and darn it.. I will get what I paid for. (Tho I think I overspent on this one)\n\nHOWEVER....\n\nI always try and find something from a film that was positive and in this film I will say it was Alan Cumming. His Gazoo & Mick Jagged gave me my only smirk from this film.\n\nAlan is extremely talented, and I am sorry he was attached to such a horrible film, but had it not been for him, I would have been in a coma....\n\nThis one isn't even worth watching on HBO... and I hope it never goes on Network TV, because they'd be hard pressed to get advertisers....\n\nThank you ALAN CUMMING...."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "isabelle121",
        "review_rating": "8",
        "review_title": "Was very cute and had a good flowing storyline",
        "review_detailed_main": "Very cute movie for the whole family to go to. Had a lot of entertainment for the children audience, for it added a lot of need computer graphics that were fun to watch. They also through in a few jokes for the adults, that only the adults would understand which made it quite funny.\n\nThe cast worked really well together. Stephen Baldwin did the perfect Barney Rubble, much better then Rick Moranis played it in the 1994 Flintstones Movie. Stephen actually played the character like Barney was in the cartoon, kind of brainless but adorable, not foolish and clumsy. It was great entertainment and an altogether winner."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "lesleyharris30",
        "review_rating": "7",
        "review_title": "I don't care what anyone else says,I think this is better than the first live action Flinstones movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Wes54",
        "review_rating": "3",
        "review_title": "Bam! Bam! Bam bam bam!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "cdugger",
        "review_rating": "",
        "review_title": "Excellent!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "About as Stupid as Viva Las Vegas.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "lisafordeay",
        "review_rating": "4",
        "review_title": "Not as good as the original 90s film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "mpopy1",
        "review_rating": "3",
        "review_title": "Good movie for children under 10 years old",
        "review_detailed_main": "Jane Krakowski as Betty O'Shale is pretty good. Mark Addy as Fred Flintstone is decent. Kristen Johnston as Wilma Slaghoople is bad. I didn't watch the flintstones (1994). I just watched this because of a IMDb bottom 100 challenge but, I didn't get bored which is really good. I recommend it to children younger than 10 years old.\n\nYabba Dabba Poo is so cringe as this is my first time consuming the flintstones movies/series."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "marazion1010",
        "review_rating": "4",
        "review_title": "Worse than what I thought it was going to be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "bigverybadtom",
        "review_rating": "4",
        "review_title": "Actually Better Than The Original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "PJS-5",
        "review_rating": "10",
        "review_title": "***** A perfect 5 stars:An excellent underrated \"simple-gag\" comedy that slightly surpasses its original.",
        "review_detailed_main": "The Flintstones in Viva Rock Vegas (2000)\n\nDirected by Brian Levant (Beethoven)\n\nStarring: Mark Addy (Full Monty), Stephen Baldwin (Fled), Kristen Johnston (3rd Rock from the Sun), Jane Krakowski (Ally McBeal),Thomas Gibson (Dharma & Greg), Alan Cumming (Goldeneye), Joan Collins (Dynasty), Harvey Korman (The Original Flintstones series)\n\nFeaturing voices of: Mel Blanc (Jetsons the movie), Rosie O'Donell (The Flintstones)\n\nRated PG: Light Adult Content, One swear word. (Yes, that can happen because that is the reason why the 1998 film \"Madeline\" got a PG rating)\n\nGenre(s): Family, Comedy, Romance, Based on a TV show (The Flintstones animated series of the 60's)\n\nSummary: It is basically a prequel of the 1994 underrated hit. (The Flintstones starring John Goodman). Fred (Addy) and Barney (Baldwin) just got their jobs in the rock quarry. Barney is feeling highly in content of his life although Fred is unsure of his future. Yet they'll meet \"The Great Gazoo\" (Cumming) for the 1st time soon enough. Meanwhile Wilma (Johnston) despite her financially wealthy life is feeling rather bored with her glamorous but rather humdrum life. After all she has her overbearing mother (Collins) her ex-boyfriend soon to be suitor for financial reasons of course Chip Rockefeller (Gibson) and who is trying to win Wilma's heart for financial reasons only, but at least she had her senile but good-hearted father (Korman). Wilma tries to escape her wealthy but unhappy life. So she runs away and gets a job at a local fifty-ish fast food place. Soon she meets with Betty (Krakowski) after trying to give a reason why she came there in the first place (but failing because Betty wouldn't let her completely explain) Betty gets Wilma a job at the fast food place. (Known as \"Bronto King\" gee try to guess what product plug in joke that was suppose to be.) Soon Fred and Barney meet the girls and you pretty much have an idea what's going on here.\n\n\n\nThe good: If it weren't for the fact that this was a prequel the casting would look downright absurd. (I mean c'mon a Baldwin Brother as Barney Rubble? I don't hate the Baldwins but still). The special effects are first rate. Yet despite the special effects and the gags this isn't just \"eye candy with simple gags\" the movie was well made as itself. The cast did well & the performances were well done too. Despite the fact that this is a PG film this is perfectly fine for the whole family. And I can easily recommend this to any Flintstone fan. (Although I am not a Flintstone fan, I did enjoy the show and the movies though). The animals were a really nice touch such as dino (Blanc) a massaging squid (O'Donell) and more. From start to finish this film plays out really well. Overall this is one of the best \"gag\" comedies I have seen for a while but so far the animation world is on a winning streak this year I hope the simple gag comedy world can do the same. (Although it's rather unlikely)\n\nThe bad: The humble morality element in this is a bit schmaltzy, but that is no big deal. But if you don't like comedies that its humor is mainly simple-gags then you may want be careful.\n\nQuote: \"You think you're tensed I just found out what Calimari means\". -The massaging squid of the hotel in Viva Rock Vegas."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "bellino-angelo2014",
        "review_rating": "6",
        "review_title": "Unfairly hated, just like the first one",
        "review_detailed_main": "Since I grew up as a child in the 2000s I saw almost all the good movies based on classic cartoons (such as the GARFIELD ones, the SCOOBY DOO ones and of course THE FLINTSTONES ones). I must have seen the FLINTSTONES movies at least 3 times during my childhood and when I looked about them on IMDB I was shocked at their appalling scores (and this one has also made the new Bottom 100 at #87 at the moment as in 2018 the Bottom 100 changed the criteria for including movies in its list, so increasing the number of votes up to 10,000 for being eligible greatly impacted the list, and almost all of the movies in it are from the last 21 years.\n\nThis film isn't really a sequel of the movie with John Goodman and Rick Moranis as apparently the studio had an hard time in calling back the actors for the previous movie so, for getting around this, this is a prequel about what happened before the events of the 1994 movie hit.\n\nIn the beginning the alien Gazoo (Alan Cumming) is banished from his planet for some unknown mistakes and he has to go to Earth to follow the humans' mating rituals. Quite coincidentally, he picks as his subjects Fred Flintstone and Barney Rubble (played this time by Mark Addy and Stephen Baldwin) as they are freshly graduated and began to work in the quarry. After a while they meet Wilma Slaghoople and Betty Rubble (played this time by Kristen Johnston and Jane Krakowski) and they fall in love and they go on Rock Vegas, but soon trouble follows; Wilma comes from a rich and spoiled family and they are not really interested in low brow Fred; her former boyfriend Chip Rockfeller has a scheme for them when they go to the casino; after some misunderstanding Betty ends up in Mick Jagged's tour.\n\nSo it really deserves its bad score and reviews? I don't think so. While the movie isn't a masterpiece it's good in what it is... a live action version of a cartoon. And despite having a different cast and a different story, I enjoyed it on the same level of the predecessor. It has the same colorful sets and funny looking dinosaurs and prehistoric animals from the first movie. The cast has improved a little bit; while Stephen Baldwin was a bit better than Rick Moranis in the first one as Moranis was less clueless, I prefer John Goodman over Mark Addy as Fred Flintstone. While Kristen Johnston is gorgeous just like Elizabeth Perkins (and even a bit taller), I think that Jane Krakowski was a cuter choice for Betty Rubble as she is less fat than Rosie O'Donnell. Thomas Gibson as the villain looked a LOT like Kyle MacLachlan for me.\n\nIn substance, I'll simply suggest to don't be afraid to buck conventional wisdom, as this is a very cute and harmless family movie that can be enjoyed by both adults and children."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "rossrobinson",
        "review_rating": "10",
        "review_title": "When Fred Met Wilma",
        "review_detailed_main": "The Flintstones: Viva Rock Vegas i think is a good movie but not as good as the orignal one (The Flintstones (1994) The movie is based before the original, and to me it's an idea just like the 2nd movie to Dumb and Dumberer: When Harry met Lloyd. In this 2nd movie of the flintsones, it's based on with Fred meeting Wilma and Barney meeting Betty. They all set off to Viva Las Vegas, to enjoy themselves and to do whatever they want to do. When Fred proposes to Wilma, they both find a house (That white rock house, in the original movie) In this movie, there were actors who i haven't seen before, the one that played Barney, i've never ever seen him in any other movies, i the only actors in this movie who i've seen before is Joan collins who played Wilma's mother, the guy who played Fred, he's comes from York which is a place i know so well, the woman who played Wilma, i think she was from the series 3rd Rock From The Sun. Those are the actors who i know. I give this movie 10 out of 10."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "rdoubleoc",
        "review_rating": "7",
        "review_title": "Never change a GOOD CAST.",
        "review_detailed_main": "They went wrong when they didn't get/use Rick Moranis and Goodman. If you can get past them not being the lead roles, it's actually not a bad movie (can be nice to watch in the background, especially since it's on HBO right now)."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Wuchakk",
        "review_rating": "8",
        "review_title": "A prequel to the first movie with a different cast and almost as good",
        "review_detailed_main": "While critics love to bash the two live-action versions of \"The Flintstones\" and the ratings at IMDb are surprisingly low, the first film was a huge hit in 1994 and fittingly so because it's a great movie for what it is. The second one came out six years later in 2000 and features a different cast, which is appropriate since the story is a prequel, taking place when the four main characters are in their late teens or early twenties and romance blossoms between the couples.\n\nAlthough Mark Addy as Fred isn't as good as John Goodman, he's a more-than-acceptable substitute and, besides, Fred is much younger here so it's fitting. Stephen Baldwin is even better (slightly) than Rick Moranis as Barney. Jane Krakowski is also better than Rosie O'Donnell as Betty, not to mention one of the most beautiful women to walk the planet. As for Wilma, Kristen Johnston isn't technically as good as Elizabeth Perkins because the latter had Wilma's 'look' to a \"T\" and Johnston is noticeably too tall, but she makes up for it with her goofy charisma that can't be beat. Lastly, who better to replace Elizabeth Taylor as Fred's stepmother than Joan Collins?\n\nBoth Flintstones movies are easy prey to incessant panning because they're based on a 60's cartoon. So freaking what? The question is, do they work for what they are and the answer is a resounding \"yes\"! Movies must be critiqued and graded according to what they are and aspire to achieve, not according to what they aren't. For instance, \"Ace Ventura: Pet Detective\" is a goofy comedy and should be reviewed on that level. Compared to the original \"Apocalypse Now\" it's a throwaway flick, but how does it stack-up to other silly comedies? It's the same thing with both Flintstones movies – how do they stack up to other live-action versions of cartoons? Are they amusing?\n\nI always loved Gazoo and he's effectively brought to life in \"Viva Rock Vegas.\" The sets and F/X are top-of-the line and hold up to this day. Being a prequel, it's natural to think that the producers lowered the budget, but this wasn't the case at all. The original cost $45 million while this one cost a whopping $83 million; but, while the first film raked in $360 million worldwide, this one only made $60 million.\n\nLike the first movie, the story has warmth and offers realistic and worthy themes. Take, for instance, Fred and Barney's bond. They're best friends and their personalities balance each other out. You'll see this in real life. My best friend, for example, is similar in some ways to Barney while I more fit the Fred role.\n\nThe first two acts of \"Viva Rock Vegas\" are just as entertaining as the previous film, but there aren't as many laughs in the third act as the plot busily ties things up. Don't get me wrong, the third act is eventful and amusing, but there simply aren't as many laughs as the first two acts. Nevertheless, \"The Flintstones in Viva Rock Vegas\" is entertaining from beginning to end as a live-action cinematic rendition of the cartoon and wisely doesn't overstay its welcome at 91 minutes.\n\nThe film was shot at Vasquez Rocks, Santa Clarita and Parmount Ranch, Agoura, California, and Page, Arizona.\n\nGRADE: A-"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Ken-208",
        "review_rating": "7",
        "review_title": "Was actually very good..I was surprised and enjoyed it",
        "review_detailed_main": "When I saw the low score on the Internet Movie Database for this movie I was expecting the movie to be a dud...but I went anyway because I liked the cartoon when I was a kid. After I saw it I think people have been too critical. I really enjoyed the movie. There were numerous parts where myself and the audience laughed. I'd give this movie a 7 out of 10.\n\nThe props and effects were very creative and it was funny and enjoyable seeing how they tried to make a live action movie mimic the television cartoon. The movie had a lot of cleaver inventions that used animals or stone age technology.\n\nPerhaps some people rated this low because they went to the movie expecting something other than the Flintstones. This a movie based on a cartoon and therefore it should be the way it is. The movie does a good job of providing light-hearted and cute humor like what was done in the television show.\n\nIf you liked the Flintstones television cartoon then I think you'll like this movie."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Wookiee-Monster",
        "review_rating": "9",
        "review_title": "Entertaining Family Film",
        "review_detailed_main": "Although I missed this film on the silver screen, I did happen to see it on video and was thoroughly impressed.\n\nThe sets and props alone were well done and all characters were convincingly played in the Hanna-Barbera cartoon style.\n\nSurprisingly enough, too many have rated and criticized this film as though it were in competition for the Oscar with heavy-hitter dramas, forgetting that, to put it quite redundantly, it's The Flintstones!\n\nHonestly now, there's no need to go overboard with the Siskel & Ebert-esque scouring of this piece and just sit back and enjoy it. Whether or not children are present, I'd easily give it \"two thumbs up.\""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "atlihafsteinsson",
        "review_rating": "7",
        "review_title": "Give this one a chance",
        "review_detailed_main": "I really don't understand what most of the reviews here were going for. The movie doesn't make sense? It's the Flintstones, it has never existed to make sense! To be fair, many big-name sequels are dreary affairs with no heart, especially when they're prequels. But that is definitely not the case with Viva Rock Vegas.\n\nViva Rock Vegas is the story of when Fred and Barney met Wilma and Betty. Frustrated with her oppressive mother (Joan Collins playing a b**** like only she can), upper-class Wilma Slaghoople runs away from home and meets Betty O'Shale at a diner, who takes Wilma under her wing under the impression that she's poor. Fred and Barney walk into their lives and soon sparks are flying. That is, until Fred discovers what a rich background Wilma really has, one that he intends to impress when the four of them are invited to the Rock Vegas casino of Chip Rockefeller, Wilma's shady suitor. Overseeing all of these antics is the futuristic alien Gazoo, sent to Earth to oversee humans' mating rituals and having the bad luck of taking Fred and Barney as his objects of study.\n\nI was not at all expecting to like Viva Rock Vegas, but I did, and it's a joy to watch every time it comes on TV. The cartoon atmosphere works pretty well in live action, and the actors are even improvements on the original live action cast. Mark Addy makes a much better Fred, and Jane Krakowski is a particularly excellent Betty. Stephen Baldwin captures the innocent slow-wittedness of Barney well. Alan Cumming (\"I am INVINCIBLE!\") seals the deal in two very different but equally hilarious roles as Gazoo and the rock star Mick Jagged.\n\nThe movie is very entertaining and very funny. It doesn't try to be anything more than that and it succeeds admirably. It seems there is no place for innocent comedies on the internet these days, but you could do worse than give this one a chance. Much, much worse."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "settember",
        "review_rating": "8",
        "review_title": "Yabba Dabba Do!",
        "review_detailed_main": "Funny, cute, witty, with great sets and costumes! I was skeptical after the awful 1994 version, but found myself very pleased with this version. It has a great cast that are very much like the cartoon characters, even their voices and laugh. The plot is better too, it held both my mother and grandmother's interest as well. It takes place before the cartoon, when and how Fred and Wilma met. Also includes Gazoo (Alan Cumming), the 3rd rock from the sun girl (Kristin Johnson as Wilma), the younger Baldwin, Joan Collins and more. Go see it, it's great for ALL ages, you'll have a gay ole time."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "crippler_p",
        "review_rating": "6",
        "review_title": "Better Than I thought",
        "review_detailed_main": "This movie was much better than the first one (with John Goodman). It was surprisingly funny with jokes for both kids and adults. It has the same feel as the original cartoon - but a little updated. Baldwin does a really good Barney."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Nice",
        "review_detailed_main": "Pretty decent movie. I especially love the script and the stellar cast"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "moviewiz-4",
        "review_rating": "7",
        "review_title": "Good fun and enjoyable",
        "review_detailed_main": "I like this movie because of it's props and character's voice which close to the one in the cartoon. Stephen's character is the most true and imaginative, superb.\n\nMix and match, Fred Flinstones is not suitable for Wilma because of the height. Wilma's character is too tall and looks much mature than Fred himself. The Barney's character is also too big compare to the cartoon version.\n\nI can say this movie 80% perfect in the props and ideas but the story can be make better."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "OBehaveWanKenobi",
        "review_rating": "8",
        "review_title": "The Version of the Flintstones was Spot On Like the Cartoon from My Childhood, I loved it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "sportskid1164",
        "review_rating": "7",
        "review_title": "3.9/10?",
        "review_detailed_main": "The Flinstones in Viva Rock Vegas: 3.9 out of 10? This sequel to the 1994 hit The Flinstones, actually takes place before the first one. Fred and Barney havn't met Wilma and Betty in this movie. It starts off as Fred & Barney single, and later, they meet Wilma and Betty. They start dating and after a while ,they become GOOD \"friends\". At Wilmas dads birthday celebration, the people are xtremly rude. So Wilmas old boyfriend, Chip Rockifellar, offers them a trip to Rock Vegas. He ends up using Fred and makes it look like he stole Wilmas Pearls. This sequel was supposed to be not very good and a lot worse than the first. It was good and it wasn't as good as the first ,but it was still cute. A very fun family/ comedy that everyone can enjoy!\n\nFun! 7/10\n\nThe Flinstones 2 wasn't a bad PG. Their wasn't any innuendo except for maybe a little crude humor and their wasn't any profaintity."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "kathygrinagain",
        "review_rating": "8",
        "review_title": "So much better than the other one",
        "review_detailed_main": "The Flintstones in Viva Rock Vegas \"accidentally\" came on after a different movie, while my HULU was in autoplay... and I must say, that after years of avoiding it... I'm really glad that I ended up watching it.\n\nI went years without watching it, just because I hated the first one so much... A fat Betty was a total deal breaker for me... not to mention that they got two of the ugliest little kids to play Pebbles and Bam Bam, that they could have possibly found... (they were drawn absolutely adorable for the series, and an attempt SHOULD have been made to stick to that)... but thank goodness THIS movie had NONE of those terrible casting flaws... plus it did an awesome job of portraying Gazoo.\n\nI found this one very enjoyable."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "richardchatten",
        "review_rating": "6",
        "review_title": "Lively Prequel",
        "review_detailed_main": "Since most Hollywood 'family' films look like cartoons anyway these days this prequel to 'The Flintstones' (which wasn't much cop in the first place) with its saturated colours and hyperactive performances passes the time pleasantly enough (although the addition of a 'funny' little green alien played by Alan Cumming smacks of desperation).\n\nMark Addy struggles gamely with an American accent, while Kristen Johnston is as usual charmingly ungainly costumed as Wilma; and it's fun to see Harvey Korman and Joan Collins as her parents whose daughter has married beneath herself."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "yabado22",
        "review_rating": "10",
        "review_title": "ANOTHER YABBA DABBA DELIGHT!!!",
        "review_detailed_main": "This is one brilliant and enjoyable film, despite what a lot of narrow minded critics say. Mark Addy is magnificent. He is as close as your going to get to the cartoon. And Jane Krakowski IS Betty Rubble. Stephen Baldwin is good as Barney Rubble. He plays him as a bumbling idiot, which for Stephen Baldwin comes naturally. Who was Kristen Johnston trying to be, herself? If that is true, she did a fine job. If she was trying to play Wilma Flintstone, she has a long, long, LONG way to go! The script is brilliantly written and is a very funny and touching story. The special effects and production design are amazing. Brian Levant(the director) should be very proud. This is quite an accomplishment. I watch it and I have a Yabba-dabba-doo-time!!!"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "rastaban3",
        "review_rating": "7",
        "review_title": "Surprisingly good.",
        "review_detailed_main": "I saw the first live action Flintstones film and I did not like it at all. It was completely unoriginal as it took directly from one of the episodes of the cartoon. So when I heard the prequel was coming out I did not want to see it. However, my wife brought it home as a rental for the kids and they wanted me to watch it with them. So I did. I have to admit, this film surprised me. It had a very original plot and a different view of how they all got together. I found that very refreshing. Granted, this one did not follow the original cartoon series story line too well but that is forgivable when you begin to realize what this film is about, finding the right person you should marry.\n\nThe plot line is solid and is generally presented well. There are a few painful spots in the film and there are some good comedy scenes as well. The oversized props are generally good and Dino as a puppy just remined me of my Labrador when she was a puppy. Full of life and hyper!! Just the way a young puppy is. The other special affects were also rather good.\n\nHowever, the choices of Mark Addy as Fred and Kristen Johnston as Wilma I have to question. They did not seem to have the personality to match their characters. John Goodman did a better job as Fred Flintstone and I feel would have been a better choice. On the other hand, the choices of Stephen Baldwin as Barney and Jane Krakowski as Betty were excellent!! They seemed to fit their characters well.\n\nI was also surprised as how low this film was rated by other users. I thought this to be disappointing, considering how bad the first one was. This prequel was far and above superior to the first.\n\nOverall, worth your while (7 out of 10)."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "MemphisGuy",
        "review_rating": "8",
        "review_title": "Very funny movie.",
        "review_detailed_main": "When I first started watching the movie I thought, \"geez this is stupid\". Then I realized that I needed to see what the movie really was, a cartoon. After realizing that, I came to appreciate it. It was wonderfully silly. The addition of Joan Collins in the cast was hilarious. I highly recommend the movie, just have a light hearted attitude when you watch it. The gadgets are a hoot!!! :)"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "mfellipecampos",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": "I love this movie. It gives me a nostalgic feeling of childhood. It shows how it all started between Barney and Betty, Fred and Wilma (although there are some inconsistencies in relation to the animated series)."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "deltoro-14393",
        "review_rating": "8",
        "review_title": "I live it and don't know why.",
        "review_detailed_main": "I understand why people don't like this movie because of the B list actors and they're really cheap filters that it has to make it look the way it does but I think it's really a great movie because it really looks like a cartoon and yeah the first movie was perfect with Moranis and Goodman but these two have chemistry as well so I think overall it's still an eight as well as it's nostalgic because let's face it there's never gonna be another Flintstones movie."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "I_Ailurophile",
        "review_rating": "7",
        "review_title": "Flawed, but way better than I assumed for so long",
        "review_detailed_main": "Let's be honest: For better and for worse, this is a lot to take in.\n\nI genuinely admire the production design and art direction. There was a tremendous amount of hard work that went into creating the costume design, set pieces, props, puppets, and the fundamental look and feel of Bedrock. It all pays off, because on even a basic level the movie looks great. The CGI is more of a mixed bag, ranging from the notably distinct but good (extra large dinosaurs that are effectively stand-ins for tangible fabrications), to good but overt (overlaid cartoon effects like hearts or thought bubbles), to garish (Gazoo and his brethren). Still, even the post-production visuals are reasonably decent in general. On top of all this, I honestly like the cast. Though the A-list stars from the 1994 movie have been replaced, their substitutes are a lot more solid than I ever would have anticipated. Mark Addy, Kristen Johnston, Jane Krakowski - and, yes, even Stephen Baldwin - are fantastic as they lean into the simplistic silliness we recognize from the classic Hanna-Barbera animations to realize the chief characters.\n\nTo be sure, there's an unmistakable ham-handedness that characterizes the feature from top to bottom - the ending is frankly cringe-worthy, no matter how well it's executed. Some inclusions are too straightforward, over the top, or outright juvenile to be palatable - trying too hard to cater to the intended youthful audience. At the same time, there's a certain level of sophistication to some jokes and dialogue, aiming to please those adults watching with their kids, that while pleasing nonetheless feels out of place. In no small part 'The Flintstones in Viva Rock Vegas' is uneven in the weirdest of ways. We get a tired fart joke a few minutes in, for example, while the overall plot is just about as by-the-numbers as a romantically-inclined comedy could be, yet some lines and scenes are so sharply written that they earned some real laughs.\n\nFor all this, though - even minding all the worst faults (including a scene that's bizarrely indelicate in broaching gender, and is not just sexist but borders on transphobic) - overall the movie is a whole lot stronger than I ever would have guessed. I admit I'm unsure why the reception has been so poor as it is. This is a kids' movies, after all, and even so: It's wonderfully well made from a technical standpoint, with fine work from those behind the scenes. The cast embody their characters with marvelous personality and physicality, and there are some surprising names appearing here, including Joan Collins and Harvey Korman (and, for a scant few seconds, 9-year old Kristen Stewart in her feature film debut). Though the very appearance of Gazoo is a bit much, Alan Cumming is a true delight in bringing the diminutive extraterrestrial to life. And if imperfect, there's some welcome intelligence in the dialogue and scene writing that goes a long way in making up for the inadequacies.\n\nAnyone who can't abide family-friendly pictures won't find anything here to change their minds, and even for those who can, this is far from perfect. However, I started watching with decidedly low expectations, and ultimately those were handily surpassed. 'The Flintstones in Viva Rock Vegas' had a lot working against it, but the heart poured into it from all involved does a lot to outweigh the deficiencies. One doesn't need to go out of their way to watch it, but truthfully, if you happen to come across it, this isn't half bad!"
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "thundergo",
        "review_rating": "",
        "review_title": "Great Movie for the family",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "lukebenson-19887",
        "review_rating": "9",
        "review_title": "A solid film that manages to catch the magic of the series",
        "review_detailed_main": "Growing up with a classic cartoon is something that everyone can relate to. It forms a pretty solid memory in your mind and any adaptation that comes along is going to go up against that nostalgia-tinted view.\n\nThis journey into the very beginnings of Fred and Wilma's marriage is no exception, but I can say with glee that it more than meets the challenge for me personally. Not only is it funny and heartfelt, but it retains the comedy of the original series without losing that spark.\n\nNot to mention, Alan Cumming is just a pure joy as Kazoo.\n\nI wish they'd made more than just two of these."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "griggsda",
        "review_rating": "6",
        "review_title": "good cartoon fun",
        "review_detailed_main": "This film is good cartoon fun. No wasted scenes; it is short enough that it never drags. Harvey Korman gives the movie a connection with the original series (1960s). Joan Collins and Jane Krakowski brighten up any movie. The character Gazoo helps to solidify the plot. The humor is cute and in good taste. The set designs are colorful and clever; they keep every scene lively.\n\nI have only two criticisms. The resolutions to the main conflicts are a little too easy.\n\nAlso, they should have let Jane Krakowski sing (perhaps instead of Mick Jagged). Jane is an excellent singer; she is probably the biggest talent in the cast. Jane K. has an on-camera charisma that begs comparison to Marilyn Monroe, and her body language is always flawless and engaging."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "michaelsibley416",
        "review_rating": "",
        "review_title": "funny and smart",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "SaintNinja",
        "review_rating": "10",
        "review_title": "Another Feel-Good summer movie that was dumped by critics (casino owners and members of The Rockefeller family clan, I guess!))",
        "review_detailed_main": "As an old Flintstones fan I was impressed by the first film adaptation in 1994, but this one works even better for me. This time the cast is not as expensive, but the actors are likeable and effective. The sets, the costumes and stuff are fantastic. And even CGI is good (I don't care about good CGI though, bad CGI has more heart in my opinion). The original Flintstones series were a TV product and it (Viva Las Vegas) has TV program rhythm and dynamics. I don't know how it would look on the big screen, but it looks and feels great on the cozy coach with my wife, cat and some fried chicken. I wish there were more series with this cast. I rate it 10, and I mean it. Maybe I would rate it 5/10 in the year 2000, but today it's 10. You know what I mean: look out the window and then watch this."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "rlcsljo",
        "review_rating": "7",
        "review_title": "This prequel is better than the sequel(in most respects)",
        "review_detailed_main": "I don't recall if they ever showed how Fred and Barney met up with Wilma and Betty in the original TV series, but like the \"Honeymooners\", I was always curious how an overweight blustering blow hard and his shrimp schlemp of a friend both ended up with a couple of babes for wives.\n\nFred was obviously thinner and arguably better looking, but was Barney any taller?\n\nThis light hearted introduction to the world of the \"Flinstones\" very capably filled in a big gap in the original series and the previous movie (with a little (literally) alien intervention thrown in)--has anyone ever shown people in outer space visiting earth during the caveman era?\n\nFred this time was not as good as in the prequel, but Barney and Betty were orders of magnitudes better. Since Joan Collins lost out to Elizabeth Taylor for the role of \"Cleopatra\", and they competed again, I must say, I thought Joan Collins did a better job of Wilma's mother than Liz did."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "poopsiy",
        "review_rating": "6",
        "review_title": "Not that bad.",
        "review_detailed_main": "This movie isn't as bad as people make it out to be, but it isn't great either. The movie was made for children, not adults, so keep that in mind when watching it.\n\nFor me, it would have been a tad better without the incredibly lame fart jokes, but thats just me."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "PaulW-7",
        "review_rating": "6",
        "review_title": "The actors are truer to the cartoon originals.",
        "review_detailed_main": "I was disappointed with the 1996 film, I felt that the Betty, Wilma and Barney characters were too far away from the cartoon characters. This has largely been put right in \"Viva Rock Vegas\". Apart from this the prequel is inferior to the 1996 film. The plot is not as good, and you are always aware that what you are watching as a film set, something which I don't remember feeling about the 1996 film."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "mikec-19",
        "review_rating": "",
        "review_title": "My Fun-Filled Experience with The Flintstones",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "gjack33",
        "review_rating": "",
        "review_title": "Enjoyable Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "kadler",
        "review_rating": "6",
        "review_title": "Take the good with the bad",
        "review_detailed_main": "This movie was really hard to rate. At times I could easily have given it an 8 because of the fantastic sets, effects, costumes, acting, and dialogue. Of course, I could also drive it down at times because of all of those same reasons. Either way, much better than the original (even without Halle Berry) and much more to the original series."
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "frosty77",
        "review_rating": "",
        "review_title": "Unique in its TREMENDOUS little way!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "erminahotmail",
        "review_rating": "7",
        "review_title": "lower than first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "gsvnj",
        "review_rating": "",
        "review_title": "Fine for kids and Flintstone fans, BUT BEWARE OF THE GREAT GAZOO!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "Only for 'dumb dumbs'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jmcool5164",
        "review_rating": "",
        "review_title": "Good but screws up Flintstones history",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jumaward",
        "review_rating": "",
        "review_title": "Yabba Dabba Doo What Thou Wilt!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "maks_87",
        "review_rating": "",
        "review_title": "what the !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Even die-hard Flinstones fans won't like it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "MichaelOates",
        "review_rating": "",
        "review_title": "funny and smart",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "fjustice1988",
        "review_rating": "",
        "review_title": "I'm disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "jmatrixrenegade",
        "review_rating": "",
        "review_title": "Ok Cable Fare",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "sixstringscouser",
        "review_rating": "",
        "review_title": "The First Movie Sucked! But This Sequel ROCKS!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "scoobyg69",
        "review_rating": "",
        "review_title": "Enjoyable, but for the FAMILY??????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "curtis-8",
        "review_rating": "",
        "review_title": "Not as good, not as bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "alansands",
        "review_rating": "",
        "review_title": "Surprisingly Good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "thisisaj-2",
        "review_rating": "",
        "review_title": "First time I ever walked out of a theater",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0158622",
        "movie_name": "The Flintstones in Viva Rock Vegas",
        "movie_rating": "3.7",
        "review_username": "The Peacemaker",
        "review_rating": "",
        "review_title": "Mmmmmmmmm.....it's OK",
        "review_detailed_main": ""
    }
]