[
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "planktonrules",
        "review_rating": "5",
        "review_title": "Don't believe anyone when it comes to this movie! Of course, you might wonder if you can trust me as well!",
        "review_detailed_main": "\"The Adventures of Pluto Nash\" was made and shelved for two years....a clear sign that the studio knew they had a box office bomb on their hands. The picture ended up costing $100,000,000 to make and earned back only a little over $11,000,000 worldwide! Because of this, it's the biggest financial disaster in film history. However, after seeing it I realized that is not that bad...even if it is on IMDB's infamous Bottom 100 List...and has a horrid overall score of 3,8!!\n\nAll this being said, I don't think it's really that bad a film. I think the problem, more than anything else, was that according to some sources, the star, Eddie Murphy, really burned a lot of bridges while making this film...insisting on re-writes and overruling the director repeatedly. And, it seems that the studio got sick of him and the controversy...and word of this leaked out and killed the movie. And, so, as often happens with movies like \"Gigli\", people just start getting on the bandwagon...and heap tons of hate on the picture. However, after seeing it, I thought the movie was actually not bad. Would I pay to go see it? No. Would I pay to rent it? No. But if it was available to see for free on TV, then it's worth seeing.\n\nSo apart from its horrible reputation, there is one big problme with the film....it's not a comedy. Now perhaps it was intended as one....but there isn't a laugh in the story and it's more an unusual action/adventure film....and I can enjoy it on that level. It also doesn't help that it's very obvious that the film was written and re-written and edited and re-edited...with entire story lines dropped and inexplicably so!\n\nThe story is set in the future ...a future when the moon is colonized and is a nice place to live...unless you are Pluto. This is because some mobsters want to take his successful nightclub...and they offer him a fraction of what it's worth. He rejects their offer...and they almost immediately blow the place up and try to kill him. Most of the film consists of Pluto and his companions (Rosario Dawson and Randy Quaid...who plays a robot) on the run until the final boss battle.\n\nSo what did I like about it? Well, the film looks nice for 2002 with decent special effects, costumes and CGI. Compared to today's CGI it's kinda shabby...but that is to be expected after 17 years...technology simply improves and improves over time. Also, the story isn't terrible and the acting is generally decent.\n\nSo, on whole, the story just isn't funny, parts are obviously missing due to hack editing and re-writes but it looks good and isn't annoying or hellish....like a Bottom 100 film should be. Watchable.\n\nBy the way, a couple final comments. First, I saw a review which said that they 'laughed from start to finish'. I can only assume this person laughs at ANYTHING....funerals, dramas, Coke commercials, etc....as the film simply isn't funny and doesn't look at all like a comedy. Second, it's become in fashion to hate Eddie Murphy in recent years. While he has had some serious box office stinkers, he's STILL amazingly talented. See \"Dreamgirls\" or \"Bowfinger\" and you'll know what I mean. But I also think he'd benefit from realizing that he alone cannot make a great film...it takes teamwork and a good script."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ADG-81",
        "review_rating": "5",
        "review_title": "Great fun",
        "review_detailed_main": "I've seen this movie twice within a few days, and I might see it one more time before this week ends... Sure, Eddie Murphy doesn't play tons of roles as usual, but he's great... as are all actors in this movie... specially the Bruno character is very funny! The story of this movie might not be the best story ever, but it's still interesting, but it's the comedy this movie's all about! The box-art looks very cheap, but the effects in this movie is well done, doesn't look cheap at all..!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ReelCheese",
        "review_rating": "4",
        "review_title": "Not Great, But Not A Total Loss",
        "review_detailed_main": "There's maybe one laugh (if you're lucky) in this universally-panned disaster, but that doesn't mean THE ADVENTURES OF PLUTO NASH is a complete loss. Eddie Murphy is the title character, a reformed felon operating the most successful club in the \"Little America\" part of the Moon. But after he turns down an offer to sell to a shyster for $10 million, the laser bullets begin flying in his direction. Now he and gal pal Rosario Dawson, along with robot bodyguard Randy Quaid, are on the run.\n\nMurphy is generally appealing, but his comic touch just doesn't jive with the sci-fi environment. The plot is at times incoherent and suffers from trying to roll comedy, action and excitement all into one. It's kind of amazing this clunker ever made it beyond the idea phase, particularly with talents such as Murphy and director Ron Underwood (CITY SLICKERS) involved.\n\nWhat does PLUTO NASH have going for it? Though it's supposed to be a comedy, it actually works to some degree as a sci-fi adventure. The massive $100 million budget and futuristic setting make for some interesting visuals. And the picture moves along at a fair pace, with a tidy running time of 95 minutes.\n\nFor all its flaws, I would not use the term \"boring\" to describe PLUTO NASH. Hollywood has done much better, but it's also done far worse."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "kathmandu",
        "review_rating": "",
        "review_title": "Old Fashioned Sci-Fi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dmann73",
        "review_rating": "5",
        "review_title": "I have seen worse",
        "review_detailed_main": "I just saw this movie for the first time on TV. and it I did find it as bad as the box office made it out to be.Now don't get me wrong, this was far from the best movie. One thing I would like to say is that just in resent times (the last 4 month (date Nov, 27, 2005)) I can name 2 movies that were worse BY FAR!! Stealth and JarHead have to be 2 of the worse movies that I have ever seen. Anyways, I do see some of the points that people have made about this movie. I grew up in the 70's and 80's and like some one said this would have been a better success then. My main point is if I were to judge this move on the basis of the movies I have seen in the last year or so I would have given it a 8 out of 10."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Surprisemayo",
        "review_rating": "1",
        "review_title": "Shiver",
        "review_detailed_main": "I can't even decide how to begin this. This movie was one of two movies that almost ruined my life (the other was a \"Lifetime\" movie called \"Cloned\", in case you're interested). To be perfectly honest, I cannot even write this review without getting worked into a frenzy of anger. This movie was quite possibly the worst excuse for a film-making venture that I have ever encountered in my entire life. If you can gain anything from this short rant, please: 1) Don't rent the movie 2) Don't look at the box 3) Don't read plot summaries or spoilers 4) Don't rent movies containing the featured \"Pluto Nash\" actors within a radius of 1 year from it's production.\n\nTo gain some idea of how I feel, imagine having just watched that videotape from \"The Ring\". I know my doom is coming soon, I cannot prevent it, and there is only one certainty: This film can only do harm."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "rosscinema",
        "review_rating": "2",
        "review_title": "Poor Randy Quaid!",
        "review_detailed_main": "This is just another example of the continuing downward spiral of Eddie Murphy's once exciting career. Murphy will always have scripts handed to him and he'll always be working in films but the once edgy comedian has lost his edge a long time ago. This story takes place in the future where Earth has populated the Moon and a former smuggler named Pluto Nash (Murphy) takes over a nightclub from a friend and Nash makes it a big success and moneymaker. A young woman and aspiring singer named Dina Lake (Rosario Dawson) asks for a job but all Nash gives her is the opportunity to waitress. Some mobsters have been buying up the local business's and they want Nash's club but he won't sell. So they blow the place up and try to kill him but Nash, Dina and a robot named Bruno (Randy Quaid) escape and the mobsters try and find him. This film was directed by Ron Underwood who is usually reliable with lightweight comedy like this but this film fails from the outset. The special effects are adequate but not overly impressive. Many of the scenes are clearly filmed on a soundstage and in one shot Underwood resorts to actors being hoisted by wires for the gravity effect. Didn't they stop doing that in the 60's? And poor Randy Quaid has to play a horny and overly sensitive robot. Were we really suppose to find it amusing that he tries to get it on with other robots? But the big flaw comes from Murphy himself. This once exciting comedian use to be so reliable for edgy performances but here he plays his character totally straight. As you watch this you keep waiting for Murphy to say something witty and off the cuff but it never happens. It looks like Murphy has decided to try and be an action star or be the romantic lead. Murphy has become boring to watch and its sad to watch his films now. Pam Grier pops up as Murphy's mother but she has nothing to do. She has maybe two scenes and then she runs off (Literally). This film wastes opportunities and the script has nothing new to offer. Along with Murphy's boring and drab performance this film was dead on arrival!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "BadWebDiver",
        "review_rating": "2",
        "review_title": "Yup, it's an irredeemable flop!",
        "review_detailed_main": "And to think my all-time fav genre is sci-fi comedy! Here's a prime textbook case at how not to do one.\n\nIt's a comedy with only a microscopic trace of humor, a sci-fi that really could just have easily been set in present-day Earth with no sci-fi elements at all, and an action film that contains only the standard D-grade action story setups and climaxes - and done at a lackadaisical by-the numbers contract-delivery pace.\n\nThe only element that has the slight bit of remote interest is Randy Quaid as a rather quirky bodyguard robot. At least it's an interesting exercise at how to play a totally fanciful out-of-this world concept with no real-life equivalent. Yeah - the sort of role that your standard modern drama school graduate would be scratching their heads trying to get a grip on; and your academic drama scholar would be tearing their hair out till they looked like Homer Simpson over the fact \"its not the type of role -or story for that matter- that has any credibility or truth to the human experience\" (blah blah!) The fact that he is even a tiny bit watchable in that deserves a bit of a finger-clap - maybe.\n\nIt could have been so much better - a few puppet-type aliens hanging around, a bit more showing of the light gravity bits, a dig at your serious Arthur C Clarke space drama like MOONDUST - anything at all to make this remotely interesting as a cinema experience - or even a storyline.\n\nBut what we actually get is the real sort of movie that the conservative critics have accused all summer-style movies of being: brainless formulaic uncreative popcorn entertainment plying to the lowest common denominator that is churned out when the bloated Hollywood studio system is working on autopilot.\n\nActually - this is the movie that makes the normal summer blockbuster movies look like works of literary genius. The critics should have been aware of the old saying: \"Be careful what you wish for - you just might get it.\""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "robo8",
        "review_rating": "4",
        "review_title": "Weak script and big budget handed to an incapable director!",
        "review_detailed_main": "See a lot of guys giving this a one out of ten, not really fair I feel. To me there are lots of worse movies in all categories. But that said - it's not a top notch movie.\n\nI've never been a fan of director Ron Underwood - he might be decent for TV but features aren't his strong side in my opinion. You'll notice best when it comes to the comedy parts (the attempts I should say) and the actions sequences.\n\nAs for comedy, the directing does nothing to enhance the seemingly weak script. Since comedy seems to be what this movie was to be about and the pace seems intended to be rather fast - maybe they should have gone for a director who could make something out of it? The action sequences are incredibly lame. It resembles grown people playing war without saying \"pow pow\". Here the director's at a loss as well, which shows in sequences as when Randy Quaid's robot character is taking out his two canons for guns. I take it, this is supposed to be a \"cool\" shot but the angle of camera, timing and pace makes it about as cool as when your dad hangs up his coat upon returning home from work.\n\nThe budget ($100 million allegedly) didn't seem to be a problem and the special effects as well as the sets seem pretty well done, along with a pretty nice cast (even tiny sub-minute parts are mostly done by actors you at least recognize). This must be seen as further critique of the director, since he seemed to have all the necessary tools at hand.\n\nThe actors put in from a half-hearted to a decent effort. A lot of great character actors (Joe Pantoliano) didn't get enough space to be interesting and there is a lot of untapped comedy resource in both Jay Mohr and Eddie Murphy. Though it has to be said \u0096 Pam Grier put in what has to be her worst performance ever as the mother of Eddie Murphy's character. One you can always trust to give his spirit is Luis Guzmán, and he doesn't disappoint in this one either.\n\nAll in all I would say there was a weak script to start with, that grew even weaker when it was handed to a director that couldn't handle the sort of comedy it was supposed to be, nor the action it was supposed to contain. Probably actors underachieved, especially in the comedy department, due to this directing. The end result was nor a comedy, nor an action \u0096 simply a bleak sci-fi that was one of the biggest net-losses in movie history if I got it right. My guess is that the guys at Warner Brothers probably are killing themselves for not picking a more suitable director."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "7",
        "review_title": "I was prepared to hate this... But \"The Adventures of Pluto Nash\" was a Pleasant Surprise!",
        "review_detailed_main": "3.7. A 3.7 out of 10. As I sit here, writing this review, this film has a user-average rating of 3.7 out of 10. I'm going out on a limb here, and assume that there are many people who blindly voted low scores to bring down the rating, based solely on the negative publicity. Because, I honestly can't believe that they all witnessed the same film I did. (Not to mention, mass negative voting from people who haven't seen the film is a problem here for movies with hype or notoriety.)\n\nI knew the story, I heard about it all. The film was shelved for two years, didn't get much publicity, and was released August of 2002. Releasing a major comedy with a huge budget 2 years after completion, with little publicity on almost the exact date of the 1-year anniversary of one of the biggest tragedies to ever hit the US... Seriously, did the studio even think when they tried to push this film out? I can only assume not. Critics crucified it. Audiences ignored it. It was a flop.\n\nI went along, blindly following the notion that because it flopped, it sucked. (Although, I have found out that many great films flopped, among them \"It's a Wonderful Life.\") Finally a few months ago, a friend of mine said: \"Hey Adam, let's watch 'Pluto Nash'! It's on NetFlix!\" I scoffed, but after he persisted, I agreed.\n\nI'm glad I did.\n\n\"Pluto Nash\" was refreshingly entertaining, and in no way was it the abysmal slight against cinema I had been told it was.\n\nThe film centers on Pluto Nash (Eddie Murphy in a fun performance), his sidekick robot Bruno (Randy Quaid in perhaps my favorite performance in the film) and Dina Lake (the astonishingly beautiful Rosario Dawson), with numerous other actors in supporting roles. Nash is the owner the nightclub \"Club Nash\", on the moon, some time in the future. He bought the club to save the life of a friend (Jay Mohr), who has since become a famous \"singer\" in a snazzy upscale part of the moon, leaving Nash behind. Dina arrives, hoping to work for Nash in order to earn money to buy her way back to Earth.\n\nSoon, henchmen sent by the mysterious Rex Crater arrive, interested in buying Nash's club. When Nash turns them down, they destroy the place. Nash, Dina and Bruno vow to discover who this Rex Carter is, and stop him.\n\nAnd so begins this fun action/comedy/sci-fi feature. In all honesty, the story is cliché, but it actually works quite well. This isn't supposed to be a revolutionary masterpiece, it's meant to be a fun good-guys-VS-bad-guys-buddy-movie type film, only set on the moon in the future. The characters are quite endearing and likable as well. They feel like people you'd want to hang out with.\n\nThe special effects (which were unfairly criticized at the time) are surprisingly good, considering they were from 2000 (remember, the film was finished but shelved for two years), and the direction of Ron Underwood is quite nice. Visually, the film is a treat.\n\nThe cast works. Murphy, Dawson and Quaid are all great in their roles, and supporting characters are played very well by some big names, such as Peter Boyle, Pam Greir, Burt Young and even a cameo by Alec Baldwin.\n\nThe music is fun, the editing is great, the set design is exquisite, the acting is generally very good, the direction is fantastic, the story is decent enough. I really can't say much. The craftsmanship is very competent. It's not a bad film by any stretch of the imagination from any conceivable way you look at it. Is it a particularly strong film? No. But is it a halfway decent film with some laughs and some heart? Yes, it is most definitely. I also admire the fact that this film isn't ashamed of being light-hearted and positive. A lot of films (especially these days) try to be dark and gritty. It's nice to see just a positive, fun film.\n\nI honestly can't understand how this was so hated by critics upon release, and so ignored by the general public. It's a very fun movie, and I had a blast watching it. I will gladly be buying this flick sometime soon, and sharing it with others, so they can finally see this treat they missed out on.\n\nI give \"The Adventures of Pluto Nash\" a good 7 out of 10. It's lighthearted fun."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Neal19",
        "review_rating": "1",
        "review_title": "Pluto Nash, more like Pluto A**",
        "review_detailed_main": "I am a projectionist at a theater in my home town. The night before a movie comes out we are forced to watch them to make sure nothing is wrong with the print. I've seen some bad ones in my day (i.e. Pokemon, and Battle Field Earth), but this one takes the cake. I am convinced that this is the on-flight movie on the plane to hell. As funny as Eddie Murphy is the writers could not find a way to make this movie at all humorous. As an Eddie Murphy fan I hope this movie does not damage his legacy. What an awful, awful movie."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Kunovega",
        "review_rating": "8",
        "review_title": "Better than the ratings would imply",
        "review_detailed_main": "This is a movie full of cliché and predictable twists. But it's still Eddie Murphy being funny and filled with cute little moments.\n\nI'm not sure why this film attracts so much hate, it doesn't bother doing anything so terrible that it deserves the vitriol level of criticism that seems to be thrown at it.\n\nIt's at worst a movie that's easy to classify as \"average\", but personally I actually really enjoy this film. It's a non offensive, straight forward sci-fi comedy that doesn't require any deeper understanding or intellectual delving.\n\nThere's no deeper meaning here than some funny people having an adventure on a future moon city. You could do a lot worse with your time than to sit back, turn off your brain for an hour and just enjoy the show.\n\nHonestly this is one of my go to movies for multitasking, something funny on in the background that doesn't require my 100% attention to still make me laugh while I'm doing other things. And it ends up getting watched more often than some of the \"better\" movies that I would rate at 10 simply because those are often a chore to watch and require actually thinking to understand them.\n\nYes if you understood that correctly: I do enjoy a deeper movie and would rate them higher, but it's also not what I would typically grab from day to day when I just want to laugh while getting through the grind: The Adventures of Pluto Nash \"is\"."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "VisionThing",
        "review_rating": "7",
        "review_title": "Not that bad",
        "review_detailed_main": "As everybody and their dog seemed to be absolutely certain that The Adventures of Pluto Nash is a steaming pile of excrement, I would have never come to watch it if the DVD hadn't been forgotten on my table by a visiting friend. The next day I had conveniently a couple of hours to kill at home, so I thought I might as well check whether Pluto Nash was just bad or a real turkey.\n\nMuch to my surprise I sat through the entire movie mildly entertained. Certainly anyone expecting a movie where Eddie Murphy makes faces, laughs like a horse and tells immature vulgar jokes is indeed in for a sore disappointment, as this film gracefully lacks all those clichés. In fact all kind of humour is scarce, jokes are few and far between and -- frankly -- vacuous at best. However, The Adventures of Pluto Nash is not half-bad as a sci-fi adventure. Effects are quite nice, and although the script does not blow one's mind with innovativeness, it keeps the story flowing fluently with no dead moments. 7/10."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "mockturtle",
        "review_rating": "1",
        "review_title": "Wanna see what $90 million WB ain't gonna see again looks like?",
        "review_detailed_main": "\"Pluto Nash\" really should have been advertised as \"From the director of 'Mighty Joe Young' and the writer of 'Mystery Men'\" It would have had the same effect as WB's war of malaise against this excavation from development hell. This is a movie that does everything wrong. But the most offensive thing is how needless profanity is injected into what could easily be a PG movie in order to make it barely PG-13, in fact it should have been given an R. Without the profanity this might have made a less grating $90 million dollar babysitter at least, but some smart guy decided to add completely unmotivated cursing to every scene, how many movies that you watch with your five year old have people dropping things and yelling \"Sh$T!\" And some of the violence didn't need to be so realistic. They could have had another good kids movie here, albeit a horribly scripted one that would have annoyed the sh$T! out of babysitters for years to come, instead they had a $2million opening weekend on a $90million budget. Cheers."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "maestro-20",
        "review_rating": "",
        "review_title": "Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "kidcontra1",
        "review_rating": "1",
        "review_title": "This is the WORST MOVIE EVER! PERIOD!",
        "review_detailed_main": "This is the WORST MOVIE EVER! PERIOD! There isn't much more to be said about the worst movie of all time. I have never seen anything this bad and I couldn't imagine anything this bad ever being made again. What makes this debacle of a film ever worst, is the fact that it has, what should be a great cast. Eddie Murphy and Rosario Dawson star in the Misadventures, oops I mean the Adventures of Pluto Nash, which is a movie that was dead in the water before it ever came out. The release date kept getting pushed back, I guess someone actually saw the finished product and tried to delay the inevitable, but once it was realized that the movie had to eventually come out, it crashed landed into theaters more than a year after its scheduled release date and was headed toward DVD a week later. Its not even cheesy bad, its not one of those movies that you and your friends and sit back and watch and laugh at how bad it is. It is a train wreck that should be avoided at all cost and will forever be synonymous with the term \" box-office bomb.\""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Rooster99",
        "review_rating": "2",
        "review_title": "Absolutely awful, forgettable comedy",
        "review_detailed_main": "It really is too bad. The sets looked great, the special effects on the moon were well done, it's just that the film has no soul at all. Nothing. The script was brutal to put it kindly. It is kind of like what Beverly Hills Cop 7 would have been after they had started to go downhill after the first one. Murphy tries to make it humorous, but there was no humour in any of the lines. They were just frustratingly moronic. It was 3's Company type action, with many bug-eyed looks at other characters, pratfalls, ludicrous plot holes, and juvenile humour. There are no redeeming qualities at all in this movie apart from the set design. It is really sad that a studio would waste that kind of money (100 mil) on garbage like this when the set could have been put to much better use.\n\nThere are very few highlights, one in particular involving John Cleese as an automated chauffeur. But that is about it. All of the cast members are wasted in this lackluster effort, including Eddie Murphy himself. He has proved he can carry a film (Beverly Hills Cop, 48 Hours, Trading Places), but it has been a long time since he has appeared in anything decent. This could have been it, however the director went for a 3 Stooges approach instead of a much grittier and darker 48 Hours. If this movie had any of 48 Hours grit, or BHC's humour, it might have been halfway decent. Instead it is nothing more than smarmy, predictable, dull, and annoying. The fight between the Murphys at the end was very well done graphically, it wasn't possible to determine exactly how they did it (Murphy fights himself), except of course it was the type of fight that would have been more at home in an Ernest movie. All the special effects are therefore completely wasted, along with the 100 mil some studio sunk into this dog. What were they thinking? 2/10 (I gave an additional point for the sets, NOT for the movie)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "numberonecubsfan",
        "review_rating": "4",
        "review_title": "The only laughs didn't come from Murphy",
        "review_detailed_main": "I really don't know why Eddie Murphy signed on to do this movie. The script was terrible, and he didn't seem to be trying in the least. When I'm watching a movie that tries to be funny and fails, I can usually at least see where they were trying to make me laugh. He, however, I couldn't see one instance where Murphy was trying to be funny. I did laugh a few times, but it was at the surprisingly funny Randy Quaid as his robot Bruno, and the brief apperence of John Cleese."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "loki564",
        "review_rating": "3",
        "review_title": "95 minutes of my life I'll never get back",
        "review_detailed_main": "I should have known with this movie being shelved for two years, plus the fact that it lost something like 96 million dollars at the box office that this movie was going to be bad. Maybe that's what made me hit the 'buy' button on the dish, I just wanted to see how bad it was.\n\nNeedless to say, I wasn't disappointed, bad acting, lame plot, lousy special effects, and those are the good points!!! Being a HUGE John Cleese fan, even his little part couldn't save this wreck. So where did the 100 million they spent on this flick go? It sure as heck wasn't on the script. Eddie, please, we need a good movie from you soon, I'm sure the only reason they decided to release this was due to your outstanding performance in \"Shrek\", now that was a good movie. Save your money, and go buy a bucket of paint so you can watch it dry, at least it's more entertaining than any given minute of Pluto Nash.\n\n3/10, only because of John Cleese and Ralphie from The Sopranos"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "malevolentmuse",
        "review_rating": "1",
        "review_title": "Abysmal",
        "review_detailed_main": "When I write reviews I usually prefer to delve into what I liked or didn't like about a film, but I cannot bare to talk about this horrific piece of junk. I found myself looking at my watch every 5 minutes. Warner Bros. stole part of my life (not to mention my money) and I want them both back. The people who claim to like this movie? Either brain-dead or moles for WB trying to make the film look like less of the total bomb that it is. Remember \"Bonfire of the Vanities?\" That deserved Oscars compared to this."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "berht-2",
        "review_rating": "7",
        "review_title": "Good...not bad...and not great...murphy does it again! 7/10",
        "review_detailed_main": "Kids( 11, 9, 7 ) and I enjoyed this this afternoon and must agree with others that tghe critics have this all wrong. The special effects are top class and the CGI workers deserve kudos. Sure the plot was holywood boiler plate but it really surpassed Total Recall and Mr. Murphy was still able to project his exceptional talent and gift for dramatic comedy. Why didn't Warner Bros. plug this better? Why the release delay? Obviously putting it on DVD/VHS there was somebody with brains, sense, and guts to know it had quality. Bad rap and poor business judgement are it's only shortcomings. (7/10)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "elroy_geronimo",
        "review_rating": "1",
        "review_title": "Pluto Nash.....Did Eddie need cash ???",
        "review_detailed_main": "The worst Eddie Murphy movie ever. Set in the future. But why ?? I don't know, probably to let us believe this is an original movie, completely different from his other movies, which it isn't. Same old story; Bad boy (again?)/ex-space smuggler Pluto opens a Night Club (like in Harlem Nights), which gets wasted by some Russian gangsters and Pluto wants revenge`(again!?). Oh and there 's a girl at first reluctant and later deeply in love(again!!?). Boooooooooooooring. A waste of time for everyone involved. Don't walk away.....Run ! Run !! Run !!!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "madkaugh",
        "review_rating": "8",
        "review_title": "I like this movie. Hence, I will doubtlessly never be employed as a professional movie critic.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "tymedindin-77518",
        "review_rating": "6",
        "review_title": "Not as bad as they say!",
        "review_detailed_main": "My husband and I never heard the bad reviews before watching Pluto Nash...and it has become one of our favorites! Certainly not Eddie Murphy's best film, but no less enjoyable in my book!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ImmortalCorruptor",
        "review_rating": "2",
        "review_title": "so much wasted",
        "review_detailed_main": "Every now and then, a movie will make fun of the formula Hollywood action/comedy movie. You know, a short scene from a terrible movie inserted into another movie. For example, the commercial in 'Scrooged' for the Lee Majors movie, or 'Good Will Hunting 2' in 'Jay & Silent Bob Strike Back.' Well, this is the kind of movie they're making fun of.\n\nIt has good special effects. That's about the only good thing I can say. They're not great, but good. The rest of the movie was horrible and cliched. I laughed once, but that's because I started daydreaming and thought about something funny one of my friends said earlier that day.\n\nBe sure to watch this to get rid of those annoying excess brain cells."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "imdb-906",
        "review_rating": "",
        "review_title": "laughed from start to finish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "freak-12",
        "review_rating": "5",
        "review_title": "i laughed once...but it was a good laugh",
        "review_detailed_main": "This movie is terrible. Not in the \"house of the dead\" \"alone in the dark\" sense of the word - those movies should have their negatives burned and all copies destroyed because i think there is a significant connection between the decline of western civilization and the proliferation of Uwe Bolls career. Rather, this movie is a sci-fi-special-effects laden comedy that isn't funny, has no plot, no character development and less than impressive special effects (actually this would be a great stupid kids movie if it wasn't for the language as there aren't enough movies out there for stupid kids). There are moments where its entertaining and I enjoyed some of the banter as well as some of the effects, but the sum was far less than the parts. The one scene that I laughed at was when Jay Mohr was explaining his escape plan to Eddie, one of the dumbest escape plans in the history of bad escape plans, and Eddie just looks at him like he's a moron, not looking away for what seemed a solid 60 seconds. This joke took time to set up and someone talented to pull it off. Eddie is still talented in that he knows comedy and what can make people laugh. But for some time now all he has done are movies that are less interested in taking the time to make the joke work and more interested with throwing as much slightly amusing trash-talk at the audience as they can in 120 minutes and hope enough sticks to call itself a good comedy. If its on HBO and its raining and nothing else is on, watch and kill two hours. or don't. you wont miss much."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "claudio_carvalho",
        "review_rating": "5",
        "review_title": "A Movie with Great Budget, Actors, Actresses and Effects, Which Unfortunately Does Not Work Well",
        "review_detailed_main": "Pluto Nash (the decadent Eddie Murphy) is the owner of a successful club in the moon in 2080. A mobster wants to buy his club, threatens him exploding his club and trying to kill him. He will look for this gangster in another city in moon. This movie is amazing: a great budget, for the futuristic scenario (similar to Total Recall), special effects and good actors (Randy Quaid, Joe Pantoliano, Jay Mohr, Luis Gusmán, James Rebhorn, Alec Baldwin, Peter Boyle, John Cleese among others less known) and actresses (Pam Grier, Illeana Douglas, Rosario Dawson), mixes adventure, comedy and science fiction... but unfortunately it does not work. It is boring, the plot is terrible and full of clichés. The action in this flick is not exciting and only Eddie Murphy laughs of his jokes! A complete loss of time and money. My vote is five."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "A Hated Joyride!",
        "review_detailed_main": "'The Adventures Of Pluto Nash', I know this movie for being one of the biggest box office bombs. The long-ago released never gained popularity even it's DVD/video release, I know people who dislike this movie like anything.\n\nHonestly, 'Pluto Nash' is not as bad as people say it is, it's a okay one time watch. There's really nothing to write about this flick, it's a film where nothing stands out, it's just passable stuff. The bashing it received was way to gory to see. All I can say is watch this flick, keeping it's disastrous history behind.\n\nEddie Murphy delivers a fine performance, so does Rosario Dawson. The actor who plays the robot Bruno is hilarious! Alec Baldwin is there in a miss-a-blink appearance.\n\nAll said n done, 'The Adventures Of Pluto Nash' is an average watch. No Thumbs Up, No Thumbs Down Either!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "KingofCarrotFlowers",
        "review_rating": "3",
        "review_title": "Time Waster",
        "review_detailed_main": "This movie was so savagely criticized that I desperately wanted to like it, to prove everybody wrong and to claim that Eddie Murphy was back with a bang and with his funny bones throbbing like they never had. I wanted all that badly...until I got to see the movie and got sourly disappointed at such flagrant waste of resources.\n\nNot that E.Murphy's name is a guarantee of quality cinema anymore but at least he used to have some dignity, usually top notch character actor Joe Pantoliano(just watch\"Memento\") also sets something close to a career low here. The visual side of the film is occasionally spectacular but nothing can overcome the increasingly frequent hollywoodian syndrome of having scripts and dialogs that look as if they were written by drunken apes, I mean zero intelligence, zero subtlety, zero coherence all amounting to one gigantic mess of half baked concepts that never gel into anything resembling a decent film.\n\nTo top it off for an action comedy the action part is feeble at best and the least said about the jokes the better(oh the endless horny robot jokes). It flopped for a reason, nobody in a right frame of mind would want to repeat his dose of Pluto Nash."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "chicacubs",
        "review_rating": "1",
        "review_title": "awful",
        "review_detailed_main": "Pluto Nash: Spaced-out junk Shallow plot and boring dialogue fail to impress\n\nDirected by Ron Underwood, The Adventures of Pluto Nash bears some resemblance to the 1960's cartoon, The Jetsons. While Pluto Nash has an impressive cast, including Eddie Murphy, Randy Quaid, Jay Mohr, Pam Grier, and Alec Baldwin in a cameo appearance, it lacks good writing. In fact, a rerun of The Jetsons would be more entertaining.\n\nThe year is 2087, on the moon, in a full gravity town called Little Americ a. Pluto Nash (Eddie Murphy) plays an ex-con turned nightclub owner. The local mob offers to buy Pluto's successful club (`Club Nash'), but after he refuses to sell, the mob blows up the joint, and the chase begins. Pluto and his beautiful waitress/singer Dina Lake (Rosario Dawson), and his Robot (Randy Quaid) are chased by the gangsters, while they try to find and confront Rex Crater, the head of the mob.\n\nPluto's attitude-filled but hilarious mother (Pam Grier) could have added some more humorous moments to the movie, but she only appeared in a few minor scenes.\n\nRandy Quaid, (Bruno the bald-headed Robot), is not nearly as funny as his other witty characters of past movies (my all time favorite - Cousin Eddy- National Lampoon's Vacation movies). His performance was adequate, but repetitive lines and tired jokes got old very quickly.\n\nThe only scenes that made me snicker were the ones that featured the goofy, 1950-ish B-movie spacesuits. They reminded me of sci-fi parodies from Mystery Science Theater 3000, and Spaceballs.\n\nThe genre for this film says comedy/action/sci-fi. If this is so, then it's a comedy that has no funny jokes, action that has cheesy scenes, and a sci-fi with untasteful and unrealistic effects.\n\nThe uncreative and lame scenes seem to jump around with confusing transitions, giving the feeling that there was some serious cutting going on in the editing room.\n\nRon Underwood, (Tremors and City Slickers) didn't have much of a story to work with, however, there were some clever sight gags. For instance, Hilary Clinton's mug showing up on a $10,000 bill, Trump buildings, and a frozen dog that can be thawed in a microwave. Writer Neil Cuthbert, (Mystery Men and Hocus Pocus), could have taken his futuristic story line, and created the funniest movie of the summer; however, on film the story was `lost in space'. Having said that, it makes sense that Warner Brothers shelved this project for two years after filming.where it should have stayed.\n\nThere is no doubt that this would have been a hit in the 70's and 80's, but in 2002, its simply dated!\n\nExpect to find Pluto Nash on the $1.99 clearance table at your local video store very soon.\n\nRated PG-13 for violence, sexual humor and language. Running Time is 95 minutes."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "mobadizhere",
        "review_rating": "7",
        "review_title": "Way better than a 3.8 out of 10.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "starving_college_student",
        "review_rating": "1",
        "review_title": "Not good, not bad, simply \"there\"",
        "review_detailed_main": "I went in to watching this movie expecting to get cheese and crony-ness, but this movie failed to deliver even that. But that's not to say this was really bad, the movie failed even on that account. This movie is simply....there.\n\nTo start, I actually liked the colorful sets and whimsical settings, I was thinking \"oh maybe this'll be something like The Hitchhikers Guide\" But unfortunately not. The main problem in this movie is: it doesn't know what it is. Everything in the movie stays in a wish-washy middle ground. There were jokes, but they weren't pushed to the point of being funny, making this a comedy. There were moments of action, but it wasn't pushed to the point of being cool, just the few moments of very generic gun fire. So this wasn't an action movie. And there was an attempt at a mystery story here, but it wasn't pushed to the point of really being interesting. It was incredibly underdeveloped and no suspense was built up as things were supposedly \"revealed.\" So this wasn't a mystery. So then what was it? So while this isn't a \"bad\" movie, it's definitely not a \"good\" one either. Unfortunately the makers left the slider bar somewhere in the middle."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "cedrickroberts",
        "review_rating": "8",
        "review_title": "A fun and enjoyable surprise.",
        "review_detailed_main": "I am an Eddie Murphy fan, but I did not go to the theater to see this movie because of the horrible reviews that I read about it. My feelings after catching this movie on HBO are clear, don't necessarily base all of your decisions to watch a movie or not on highly publicized reviews. The fact is, that I enjoyed this movie. I thought that the cast was attractive and talented; and that there were some credible laughs. But most of all, I thoroughly enjoyed the way the movie looked and how it was filmed. This film was simply not as bad as the critics said it was. It is possible that because the critics criticized the movie so much, that when I finally saw the movie, and was not repulsed by it, that I began to relax and enjoy it. I think that many of the critics were expecting a Beverly Hills Cop-type laugh fest, but that is not a comedy that's really an action-drama with a few laughs. This is strictly a sci-fi comedy, as such, it does not take itself seriously; and neither should you if you decide to watch it. Just see if you enjoy it. I sure did."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "A cryogenic chihuahua....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Old Crow-2",
        "review_rating": "3",
        "review_title": "Eddie Murphy in a really bad movie! How original!",
        "review_detailed_main": "It´s not a good sign when a movie´s been shelved for two years before it´s finally released. And when it actually premieres it´s not even shown to the critics. Studio executives say that the special effects needed fixing until the very last minute, but people know the truth. The product sucks big time.\n\nPluto Nash is an awful comedy. Behind the polished and fine-looking surface there´s a crappy movie that wants to be so much, but ends up being a total flop. When Eddie Murphy´s good he´s really good (\"the Nutty Professor\", \"Bowfinger\"), but when he´s awful he really sucks (\"Pluto Nash\", \"Metro\"). I haven´t seen \"I Spy\" or \"Showtime\" yet, but being a movie fan I know those two considerably big movies flopped as well. Poor Eddie has now scored three back-to-back flops which isn´t a good thing in Hollywood.\n\nThe (Horrible) Adventures Of Pluto Nash is said to be a comedy, but I didn´t find myself laughing while watching the movie. On the contrary. Few amusing lines don´t make a comedy and even good actors can´t be funny if the script and the characters are simply not funny. Even John Cleese has a small part in this turkey... How on earth did they get him aboard? All the cast members can do a lot better, I presume they all just lost their judgment for a minute when signing to do Pluto Nash. That can be forgiven with time and a lot smaller salaries for their next projects would be a suitable punishment.\n\nPluto Nash takes place in the Moon and that would actually be the only correct place for a movie like this: far from the civilization and fans of good movies."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jellyneckr",
        "review_rating": "",
        "review_title": "Ron Underwood's best picture yet!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "oneguyrambling",
        "review_rating": "3",
        "review_title": "Sure it's awful, but that's not the end of the world - unless you were the guy who financed it...",
        "review_detailed_main": "The Adventures of Pluto Nash isn't the worst film ever made. It just might be the worst value for money though, with a reported budget topping 100M and a box-office of less than 5 it makes Jonah Hex look like a wise investment. But despite this it is more sad than bad.\n\nI can't possibly see where they thought the laughs were going to come from\u0085 I can't fathom which parts were supposed to be entertaining\u0085 Worst of all I can't really see where the money was spent\u0085\n\nI just sincerely hope it wasn't Randy Quaid's salary.\n\nPluto Nash was made by the same guy that made Tremors which is the inverse if Pluto Nash, a low budget / high entertainment affair that is remembered fondly by all that have seen it. Pluto Nash wants to be quirky, cool, edgy, funky and hip but is really none of these things.\n\nIt is 2080 and the Moon has been made hospitable for humans. Pluto Nash (Eddie Murphy) is the guy who everyone on Earth's satellite adores – except the bad guys who want to force him to sell his bumpin' club to them.\n\nAfter a run in leaves his club a smouldering pile of rubble (like this film) Nash sets off with waitress Dana (Rosario Dawson – who obviously spent her paycheck on implants after filming ended) and his faithful robot Bruno (Randy Quaid).\n\nThe trio traverse the moon trying to lay low out of the gunsights of the bad guys while working towards finding who is ultimately responsible for their situation. Along the way they encounter many recognisable faces that add nothing to the film, Jay Mohr, Peter Boyle, Pam Grier, John Cleese and Alec Baldwin among others.\n\nI think the aim was for Nash to be cool and likable, Dana the cute love interest and Bruno the comic relief. All fail. As does everything else in the film.\n\nBut again Pluto Nash is as harmless as it is pointless, unlike the braincell shattering Tank Girl it made me want to sleep more than vomit – admittedly neither is an endorsement for the film – but the issue remains how could something cost so much look so ordinary?\n\nNow I know how the Miami Heat must feel.\n\nA big budget light comedy set on the moon and featuring its own fading star in Murphy was never going to be a big hit. This can't be the fault of director Ron Underwood but the big-wigs who greenlit it and opened the coffers. The absolute ceiling for this film was Demolition Man, itself decidedly average. The floor was Tank Girl, which Pluto managed to avoid but just barely.\n\nNow you tell me; is a ONE HUNDRED MILLION DOLLAR investment worth making for a film that at best could end up mediocre?\n\nFinal Rating – 3.5 / 10. Pluto Nash sucks, but it is isn't the end of the world\u0085 unless you happened to be the one who covered the budget."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Spanner-2",
        "review_rating": "5",
        "review_title": "Technicaly good, story awful",
        "review_detailed_main": "This is a sci-fi/action/comedy starring Eddie Murphy (who kinda sleepwalks through his role) as a nightclub owner on the moon who winds up running from the mob, who wants to turn his club into a casino. Th storyline is really rather silly and pointless and the performances range from dreadful (Murphy, Joe Pantoliano as a mob henchman) to embarassing (Randy Quaid as a robot!) to almost decent (Rosario Dawson as the love interest, Jay Mohr as a lounge singer). For a comedy, the jokes are few and far between, with only Quaid's impossibly bad performance and hamming providing any kinda of humor. The action pieces are also kinda weak.. On the plus side however, the film looks great. The production team did a fabulous job of creating the future world of the moon and they throw in a lot of nice little jokes into the sets that those bored with the main story might enjoy. The visual effects are also impressive, for the most part. So you could enjoy the film on a technical standpoint. It isnt an awful movie and is certainly watchable but it is not very good either. GRADE: D+"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Ron-256",
        "review_rating": "3",
        "review_title": "UG",
        "review_detailed_main": "A Review? That's Easy. One word:\n\nPOINTLESS!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Baldach",
        "review_rating": "4",
        "review_title": "3 stars for Babette the Robot Maid.",
        "review_detailed_main": "I had expected Eddie Murphy and Randy Quaid to deliver outstanding performances in this movie since they are both experienced talented comic actors, wrong. Instead I was more impressed by the performance of Jacynthe Rene' who played Babette the french robot maid. Her performance reminded me of the creative performers of Cirque' du Solei, who use actions rather than words to entertain. Although,her performance consits mostly of dropping her feather duster, bending over, and saying \"Oops\", it is the most entertaing part of the movie i.m.h.o. The worst part of the movie, Jay Mohr trying to perform as a Frank Sinatra lounge singer. So 3 stars for Jacynthe Rene' and and 1 star for the special effects of the movie. Watch this movie only if you receive a free movie coupon, enjoy campy sci-fi jokes, or are passionate for french maids."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "bullions27",
        "review_rating": "1",
        "review_title": "One of the few movies I walked out of",
        "review_detailed_main": "It takes something \"Jurassic-ly\" abominable and monstrous for me to get up and walk out of the theater room and you know, Pluto Nash did just that. All I can deduce from what I've seen is Eddie Murphy refusing to sell his club to the local Lunar mob (who also has some grandiose plan to takeover the Moon or whatever), and as a result, he and company are chased around for about 2 hours (I assume 2 hours). Add to it some of the lamest jokes ever exposed to celluloid since Carrot-Top and many eye-gouging, sleep-inducing twists and we have here a total disaster. No big surprise considering this was never screened for crtitcs, and shelved for about a year.\n\nOh well, I'm sorry if I can't divulge anymore info for you. My eyes and ears can only take so much.\n\n1/10 for the first hour or so"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Filmreader",
        "review_rating": "7",
        "review_title": "I had a good time with this film.",
        "review_detailed_main": "I enjoyed the film. I had a good time and it was funny in many parts. I think the people that put low rating didn't see the film ! or just they hate Eddie Murphy !"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "tosinner",
        "review_rating": "1",
        "review_title": "If you like your brain, don't punish it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dude-281",
        "review_rating": "8",
        "review_title": "Entertaining",
        "review_detailed_main": "Randy as Bruno was awesome, Murphy was solid as always, the story was fun and with music from outcast makes this just a great space comedy! Best comparison is Fifth Element mixed with Total Recall but it's not a rip, I get annoyed when people can't look at a movie and enjoy it for what it is which is a fun family movie for everyone! Playing Frank Sinatra was also adorable, love the touch and the hole robot theme. The music is just great too, I love the sound track! If I would sum this movie with one word it would be \"Happy\" because that's how I felt after seeing it! =D Only negative would be the story as a hole but I figure it's made for everyone including a young public and a bit predictable but other then that there's nothing I can complain about."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Cornelus",
        "review_rating": "7",
        "review_title": "People who are cutting-down this movie never saw it!",
        "review_detailed_main": "The movie is fine for a matinee comedy ... the story's a little weak, but I dare anyone who expects each action-comedy to be sidesplittingly funny to check out some of the \"classics\" from the 70's, and not come away disappointed. In the hands of a better screenwriter & director who know how to keep audiences from getting bored, this movie could've really had potential. As it stands, it's still better than most teen-oriented drivel coming out.\n\nKudos to Randy Quaid, who's about the only one entirely believable in his role (and to think he had the toughest part!). Eddie Murphy does an OK job, but its clear his best part is as a character actor, or someone a little more interesting (like Jay Mohr's character). Easily a 6, and I'll probably vote a 7 just to balance out those cast votes to movies sight-unseen."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Seth-12",
        "review_rating": "1",
        "review_title": "Dreadful",
        "review_detailed_main": "Local radio station gave away free sneak preview tickets. Went with friends. We all agreed it's easily the worst film we've seen in a long time. Sure, we got in free, but we still want to bill Eddie Murphy for wasting our evening. What a turkey!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Iconoclaus",
        "review_rating": "",
        "review_title": "This show is much more entertaining than one is led to believe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Improv Eyes",
        "review_rating": "1",
        "review_title": "Pretty Much, The Worst...",
        "review_detailed_main": "Eddie, I'm sorry if you read this. The movie was just plain bad. It was boring from the beginning. It looked like a poorly planned high school theater production of a poorly written high school play...just with a little more of a budget. The only redemption lay in John Cleese, and every time he spoke, and Jay Mohr, and...I think...one little elevator hopping explanation. Don't see this movie, unless its free to you...then maybe check it out, so you know where I'm coming from. Wow, I wish they'd just given that money to me."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Jexxon",
        "review_rating": "1",
        "review_title": "Pluto Nash cost a lot of cash, but ended up a tired mish-mash of old trash...",
        "review_detailed_main": "Pluto Nash is one of those films that wouldn't have been so bad - if it had been done 25 years ago with no stars and a smaller budget.\n\nNow we have Eddie Murphy and a whole bunch of, albeit not A-list, solid supporting actors (Rosario Dawson excluded) aimlessly wandering about from one pointless scene to another. Part camp, part thriller, part adventure, part comedy, part sci-fi, part action part romance... and it still amounts to nothing.\n\nEverything just falls flat, and when you see the result you can't help wondering what the actors were thinking as they acted out their scenes. Obviously, it must have been a case of monetary issues - and there's nothing wrong with making money, but it doesn't make it a good, or even entertaining film.\n\nEddie Murphy seems determined to ruin his career with utter crap like this. I mean, here we have a film that decides to take time out from the action to let the audience gawk at a french maid robot getting gradually undressed. If only the same level of attention had been given to the script as to the aforementioned robot's knickers and bra, then maybe it would have been less pointless. Still, the music was kind of catchy... [1/10]"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "proinfo",
        "review_rating": "1",
        "review_title": "Absolutely Awful!!!",
        "review_detailed_main": "This was absolutely awful! I think I broke a tooth from clenching my jaw to much. I went with a friend that really wanted to see this film. The only possible verdict is terrible! 0 out of 5 Stars!!!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Capteggman",
        "review_rating": "1",
        "review_title": "Phooeey",
        "review_detailed_main": "Thank God that the people who produced this bomb are not working for the Taliban. This movie would be a Daisy Cluster. I feel bad that in our economy, which is always growing, I had to spend the equivalent of $5.00 US dollars. Next time I will log on and see the review first."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "januaryman-1",
        "review_rating": "5",
        "review_title": "Temporally displaced; entertaining",
        "review_detailed_main": "Which came first Independence Day or The Adventures of Pluto Nash? Independence Day was released six years before Pluto Nash. The connection between the two? James Rebhorn appeared in both. Seeing him looking younger in Pluto Nash than he did in ID added to my sense that Pluto Nash was a late 80s or early 90s film. It just has that look and feel to it. Pluto Nash resembles 1986's Howard the Duck more than its 2002 brethren Star Wars Episode II, Lord of the Rings II, Spider Man, or MIB II (which also included Rosario Dawson). The reason that Pluto Nash seems out of place is that its genesis came in the mid-80s. For some reason, no one stuck a fork in it. Going into production 15 years (in 2000) after its conception is odd to say the least. The mid-80s were not the early 2000s. What might have been entertaining in 1985 wasn't so in 2002. The 80s were just a very different time. Pluto Nash has such an 80s feel to it that I distinctly remember watching it repeatedly on HBO while in my apartment. The thing is, I had moved from that apartment in 1988. Freaky false memory, huh? Other 80s features of Pluto Nash are its dialog, sets, coloration, and special effects. Cheesy is the word that describes the general feel of Pluto Nash. What perplexes me is that this movie cost about $125 million dollars. I could not see anything or any combination of things in Pluto Nash that should have added up to $125 million. A fifth of that? A fourth of that? Maybe. Maybe Eddie Murphy made a killing with his salary. Maybe Warner Brothers worked with the federales to funnel cash to the NSA, and Pluto Nash really cost only $1 million to make. The extra $124 million would buy a lot of flash drives.\n\nAs cheesy and unbelievably expensive as this movie is, it is still moderately entertaining. Eddie Murphy (who hit his stride in the 80s and probably peaked just before this movie) is an entertainer through and through. I can't think of many roles where I haven't felt good from watching him work. (Delirious is one funny standup performance with him in that red leather jumpsuit and all.) Rosario Dawson spent a lot of the movie doing nothing but looking cute, and she excelled in that. (She's another performer who seldom disappoints.) Randy Quaid made a good performance as an outdated android. The part didn't have much depth or opportunities, but he scored some of the movie's best lines. All of the humor in Pluto Nash was subtle. Very subtle, but there nonetheless.\n\nPluto Nash is a good movie to have on as background stimulus. Maybe at a family holiday gathering when the movie is secondary."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dbs-2",
        "review_rating": "6",
        "review_title": "Not a bad B movie",
        "review_detailed_main": "I saw Pluto Nash for the first time on HBO and really enjoyed the move. It is a great B movie, cheesy plot and acting, but good action and great visual effects. It just didn't come together how I would have liked as Pluto was too much of a good guy to be a bad guy. But, there are certainly much worse movies that have been made like the Italian Job, but watching Pluto Nash, I never wanted to turn it off and watch a blank screen instead. Critics be damned, this is a good movie to watch on a rainy day. I wouldn't say to make a sequel, but the premise was solid, the lead actors good, the visuals excellent, but there is just a lack in general direction in the movie, but each scene is fun to watch. Give it a chance, don't expect a lot, and enjoy."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Son_of_Mansfield",
        "review_rating": "4",
        "review_title": "The Misadventures of Eddie Murphy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "wpmcg",
        "review_rating": "8",
        "review_title": "Well I liked it...",
        "review_detailed_main": "This is a silly, goofy movie that doesn't try to pretend it's not. Just enjoy it for what it is. Good cast and plenty of laughs."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "JERICH9478",
        "review_rating": "7",
        "review_title": "How was that a bad flick exactly?",
        "review_detailed_main": "Pluto Nash, i thought too myself I'm never going to watch a film that has gotten terrible reviews but then i changed my mind, while watching TV i thought i might as well give it a chance i mean it can't be all that bad right? i was proved wrong, many say this film is the downfall of Eddie Murphy, I Strongly disagree, sure it's a kid's film and defers's from his usual Axel Foley i'm a cop who's going to laugh himself to get out of troubled situations but i found myself stuck to the screen highly enjoying this. Give it ago, just because a movie gets a bad review doesn't mean it's going to be bad, Day After Tomorrow got more rave reviews then Pluto Nash (but then every film has) i found myself enjoying this film more then i did with that, it has some funny humour moments in it and is a well entertaining popcorn flip if thats what your looking for"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jamesrl48",
        "review_rating": "3",
        "review_title": "Nothing to get excited about",
        "review_detailed_main": "There is absolutely nothing special about Pluto Nash. I was wondering for a time if I was going to run into the Mario Brothers as the set looked awfully familiar. The plot was poor, or maybe just nothing special. The sex jokes old, he saw her with big breasts and buttocks, why not give him something big? The only surprise in the whole thing was when Pluto Nash found out who he was up against. The movie was just Eddie Murphy doing the same old thing again. He could have just as well done it on earth in the 21th Century. At least he would have saved us a trip to the moon."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Cliffotchka!",
        "review_rating": "",
        "review_title": "Best Eddie Murphy Movie I Think I've Ever Seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Agent10",
        "review_rating": "3",
        "review_title": "And this was shelved for ONLY two years?",
        "review_detailed_main": "With fear and apprehension of losing 98 minutes of my life, I was somewhat surprised by this film. Yes, I will admit this was a fairly bad film, but that was only in the fact it was NOT FUNNY! Technically, comedies have a certain degree of humor, yet this one seemed to lack in that department. Eddie Murphy was at his worst, and his lack of passion for the film seemed to spread to everyone else. While the CGI and set design was excellent, that seemed to be the only saving grace. I admit, it was not a total waste of time, but if it had been funnier and released last year, it might have made some money. At least it wasn't as bad as films like Cutthroat Island and The Postman in regards to box office intake."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "mackdaddyspliffs",
        "review_rating": "1",
        "review_title": "One Question??",
        "review_detailed_main": "I finally caught this mess on cable, and if i were to run in to Eddie murphy i would have one question...How could someone as funny as you, make such garbage, then watch it.. and still release it?? I guess it has to do with investors and stuff, but you had to know this movie was horrible..you had to... Every bit as bad as reviewers said it was, it was painful to watch."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "eminkl",
        "review_rating": "1",
        "review_title": "It's just so uninteresting and meaningless",
        "review_detailed_main": "So insultingly phoned-in it takes almost more effort to talk about how awful this movie is than how much effort was made to produce it. The characters are weak, the plot is boring, there is very little \"adventure\" in it - it's just so uninteresting and meaningless about this film, you'd swear they made this movie in a weekend."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "One of Murphy's worst",
        "review_detailed_main": "I do not hate Pluto Nash because it was a box-office failure, even if it was, I don't consider that a valid enough reason to hate on a movie. I hate it because it is for me simply not funny and wastes a cast that I think are talented and deserve better.\n\nGranted the special effects are elaborate and really quite good and I did like the music, however that is all I have to say that was good. Don't get me wrong I do like Eddie Murphy and his films, Beverly Hills Cop, 48 Hours, Trading Places and Shrek and classics and I liked Coming to America and Bowfinger too.\n\nHowever, when it comes to talking about his films, the only movie of his I consider worse than Pluto Nash is the atrocity that is Norbit. Murphy is a funny and likable actor, but he is very bland here. He does make too much of an effort to stop his character from being bland and ends up over-compensating.\n\nThe rest of the cast are wasted. John Cleese phones in, Pam Grier is saddled with tired material and sadly it comes through loud and clear in her performance and Rosario Dawson struggles with a clichéd character in the form of a wannabe singer. Worst of all is Randy Quaid, who not only has some of the film's worst dialogue and gags but his performance is just awful.\n\nThe cast are not helped by a truly tired and unfunny script, lazy direction from Ron Underwood(was it really the director of Tremors and City Slickers?) and a rushed and predictable story that is filled with poor characters and trite and disconnected scenes.\n\nSo in conclusion, a very poor film and one of Murphy's worst films. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dolbyboy",
        "review_rating": "1",
        "review_title": "Pluto Nash is trash",
        "review_detailed_main": "This has to be the worst movie of 2002. As much as I like Eddie Murphy, I was very disappointed by this film. Pluto Nash should have stayed on the shelf and never come out. Stay away from this bomb at all costs."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Philip Nicholls",
        "review_rating": "7",
        "review_title": "A fun way to spend an hour and a half",
        "review_detailed_main": "Though no Eddie Murphy finest hour this is still a very enjoyable film, Don't expect it be a full on comedy and you will enjoy it. Though there are some very funny moments, watch out for John Clease's cameo. Eddie Murphy plays it straight for a change and isn't trying for laughs all the time which would have spoiled it."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "LivingDog",
        "review_rating": "1",
        "review_title": "Pluto Nash is P.U.",
        "review_detailed_main": "This movie is so bad it can't even be used as a kiddie movie. Pure stank. 1/10 was the lowest I could give this ... thing.\n\nEddie Murphy is singularly so unfunny that I would swear he was never a comedian before.\n\nRandy Quad puts in a decent performance as Eddie's (Pluto's) robot aid. But the script is so weak not even his decent performance can hold it up.\n\nThis movie is so bad that the beautiful Rosario Dawson is plane and almost unattractive. (See her in MIB2 for her beauty to shine.)\n\nThe mat scene during the drive on the highway was excellent.\n\nAvoid this movie like the plague - even if you're bored - boredom is better than watching this movie.\n\nI think a high school student wrote the script.\n\n-Zafoid\n\nPS: John Cleese, Alec Baldwin, Joe Pantoliano, Illeana Douglas, et. al. appeared in this ... mistake. Unfortunately it brought out their weakness as stars making this movie truly worthwhile for the barnfire! (I laughed twice - once at a Randy Quad line, and once at a John Cleese line.)\n\n-Z"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "XweAponX",
        "review_rating": "10",
        "review_title": "The \"Bringing Up Baby\" of it's time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "I remember watched this as a kid, I am thankful for that. I couldn't stop laughing! This film is funny and stupid! But never mind that, it is greatly entertaining. In this movie, you don't need to pay attention to anything because the acting is the same - LAME! The costumes are the same - PLASTIC! The jokes are the same from every other lame space comedy. The action is fast, sometimes too fast, actually. I have never understood the idea and concept when it comes to the design of robots in this film. But that's passable, I shall leave that alone. This story is dumb and average. This film is one big circus act! Murphy, stop making movies, you were once great!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Pluto Nash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "It got better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "This Was the Reason We Temporarily Lost Pluto as a Planet",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jessegehrig",
        "review_rating": "1",
        "review_title": "similar to bodily waste",
        "review_detailed_main": "I own this movie, I purchased it for a dollar and I feel overcharged. Have you ever wanted to make a movie? Have you ever wanted to make something beautiful and amazing, y'know, make something that means something, actually means something? And, O.K. strange twist of fate you are given the actors, sets, and resources to make a movie, why why why make an Eddie Murphy movie, why make this Eddie Murphy movie? You can make a movie that walks across the earth like a giant neon Aztec god puking concentrated sulfuric acid, who ever you are please make that walking god-like movie, watch The Adventures of Pluto Nash, pay very close attention to the failure then go out into this dark world and give us the light of much much better movies!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Murphy's Spaced Out Decision.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "davidm-14",
        "review_rating": "5",
        "review_title": "like most overblown films, it's fascinating",
        "review_detailed_main": "Ever since i came across \"it's a mad mad mad mad world\" when i was a kid, i love huge why-did-they-make-it, over the top movies (think \"1941\" \"can't stop the music\", \"stepford wives\" remake, etc). movies that leave you feeling there was a good motive at the start, maybe, but it got lost someplace along the way. you know there were actor/director clashes, scenes missing, that were reshot, and, overall, there's likely an even more interesting story about the making of the movie, and the movie itself could never compete.\n\npluto nash is a futuristic tale about eddie murphy's character running a casino on the moon, and getting into trouble with the mob. the additional stories about it sitting on the shelf for years, reshoots and eddie hijacking the production are fascinating. it's visually quite interesting and the performances are definitely over the top. it actually makes a fun double feature with arnold's \"total recall\", as far as the visuals and performances. i never pass it by when i come across it."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "fiftycentqueen",
        "review_rating": "7",
        "review_title": "I enjoyed it",
        "review_detailed_main": "I found this movie to be quite entertaining. Not sure what everyone was expecting, but I wasn't expecting much and I think that made the difference. I was pleasantly surprised by this little sci-fi comedy. 6"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "johnmkirby",
        "review_rating": "3",
        "review_title": "Doesn't quite hit the mark",
        "review_detailed_main": "I think this movie is poor, but not as bad as many of the reviews. (I am also surprised at the high number of people who praise this movie.) I find it difficult to say where this went wrong. The best I can figure is that it is stuck between a sci-fi movie and a comedy, and in doing so it fails at both. The comedy is not strong enough to support the movie. And the sci-fi is likewise not strong enough to keep the viewer's attention. Many people praise the sci-fi aspect of the movie, but part of the problem is that the attempts at comedy tend to detract from creating a true sci-fi tenor. For example, Quaid's performance is decent as a comedic part, but he is just goofy and so it's difficult to take the plot or the movie seriously. By comparison, Total Recall has some comedic parts, but they are effective and brief enough to not affect the sci-fi tenor. On the other hand, something like Spaceballs (or Dark Star) doesn't take itself too seriously and works as a comedy. Perhaps another matter is that we have high expectations for Eddie Murphy, and thus we are more critical of his work. Also, perhaps we have seen and heard his mannerisms so many times that the humor has worn off (e.g. Eddie's classic laugh)."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "daworldismine",
        "review_rating": "8",
        "review_title": "a great eddie murphy movie, delivered everything i expetected it would",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ink2quill",
        "review_rating": "6",
        "review_title": "This is a fun film...",
        "review_detailed_main": "This is a fun film that does not take itself too seriously. It´s dopey, simple with likeable characters and fun. I enjoyed it."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "inkpen-30556",
        "review_rating": "4",
        "review_title": "A Very Lightweight Affair",
        "review_detailed_main": "I saw this film in a second hand shop, and knowing that it had acquired poor reviews I wanted to see what constituted a 'bad film'. Well, the film has a very polished look about it. Although some of the moon scenes had a Total Recall look to them. The background artists were quite stilted and didn't look at all 'natural'. Back to the film. There was not much to the film. Characterisations were very simplistic, and the 'robots' were very curious in their presentation. It was quite a violent film, and what there was did not appear as comedic violence. One of the villains was especially ugly in a fashion which I suspect was comedic - cross eyes, curious gate etc. Murphy didn't add anything at all to a fairly limp script, and the Nash character was hard to pin down. There were a number of car chases 'on the moon', one featuring John Cleese, but any comedic angle to this went over my head. The end was very light - seeming to lack any sense of threat/urgency/difficult job well done etc. All in all, this was a poor film with what seemed high production costs but had neither any sense of originality, urgency or character empathy. All in all, it just seems boring."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Jneil",
        "review_rating": "",
        "review_title": "Time will tell on this minor classic ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "gigamath2",
        "review_rating": "5",
        "review_title": "Miscast characters",
        "review_detailed_main": "An interesting and creative concept that was sadly doomed by lackluster writing, poor dialogue for Quaid, miscasting, and bad editing, or perhaps nothing to edit well. The primary problem with this film is that its characters are miscast and this places the entire burden of the film on the writers. The premise and sets and the atmosphere they created were great, but the miscast girl-next-door character opposite Murphy did to provide him with enough of a straight-woman to launch his comic talent. Randy Quaid was miscast as the robot. He's too tall and imposing to be a subservient geeky robot. Although there were some good moments, he has no comic delivery or timing-especially for the kind of quick-witted comic style of Murphy. Substitute a Robin Williams, Steve Martin or Jim Carrey type for the robot, make the robot gay with a unrequited love interest in Murphy, and then, finally, dump the trite and time worn clone idea and make Quaid the Howard Hughes villain. Much much better. Next, the Frank Sinatra character. Very good idea but the guy couldn't sing and looked like a grocery clerk. Get someone who can sing, wear a fedora, drape a sport jacket over his shoulder, and do the Las Vegas thing.\n\nIn short, the film had mega opportunities to comically exploit hilarious stereotypes in a creative setting but then completely and mysteriously missed the boat. And it looked like Eddie Murphy knew, as he was almost reluctantly reciting this lines, that the movie was going to be a flop. Five out of 10."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ETZ_Critic",
        "review_rating": "1",
        "review_title": "A Review Written on Behalf of Roger Ebert",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "vogueman",
        "review_rating": "5",
        "review_title": "Not a great film, but not bad, either",
        "review_detailed_main": "I don't know why this film has been getting such bad buzz. It's the standard \"wise-cracking protagonist on the run from the mob, trying to get to the bottom of things\" plot, no more hackneyed than any number of other films which audiences have responded favorably to. It's got an amiable performance from Eddie Murphy, plus amusing support from Randy Quaid, Luis Guzman, and John Cleese. And, even though they're given little to do, it's good to see Peter Boyle, Burt Young and Pam Grier working. I though the cluttered design of the film, which reminded me a bit of Matt Groening's \"Futurama\", was well done, and I was pleasantly surprised that the design team and special effects team got most, but not all, of the sci-fi-geek details right (they still included an audible explosion in a vacuum). All in all, it's not a great movie, maybe not even a good one, but it's certainly not a bad one."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "LoganWeasel",
        "review_rating": "2",
        "review_title": "This movie sucks",
        "review_detailed_main": "In my whole honest opinion this is one of the Eddie Murphy movies no one remembers or likes such as a lot of his stuff in the 90's Pluto Nash disappoints left and right,also on that note when it comes to Eddie Murphy its either a really good movie or a movie you want to use as toilet paper when you have diareah,i only paid 80 cents but it was the worst 80 cents i ever spent, Pluto Nash was a terrible...TERRIBLE! movie don't watch it unless your a fan of bad movies (im looking at you m.night shamalon fans)it spits in the face of good movies and if you thought signs was crap than OH BOY! wait until you watch Pluto Nash its the WORST ABOMINATION IN CINEMA HISTORY AND FEEL BAD FOR ANYBODY WHO HAS WATCHED THIS TERRIBLE CATASTROPHE OF CINEMA! ~Logan.V"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "leoxatzian",
        "review_rating": "3",
        "review_title": "Oh how the mighy have fallen.",
        "review_detailed_main": "If you search the phrase career killer in the dictionary, a picture of this movie is going to be found under the description. A movie that has Eddie Murphy's humour at it's lowest point, characters that are more one-dimensional than a piece of paper and a plot that somehow makes a story about an illegal casino conspiracy by gangsters on the moon boring. This is an adventure that should be passed."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "layer8",
        "review_rating": "7",
        "review_title": "Enjoyable.",
        "review_detailed_main": "I think the problem with this movie is that having Eddie Murphy as lead raises expectations in the audience that it's going to be a full-blown comedy.\n\nThe simple fact is that while the movie has plenty of funny moments, it is at heart a sci-fi action B-movie - and a pretty good one at that. Think more along the lines of \"Total Recall\" but less harsh. Hardly Oscar material, but it's not trying to be.\n\nThe robot sex jokes do get a bit tiresome after a while, but otherwise the movie has no real weak points. The CGI is more than passable, the acting is surprisingly solid, and the plot, though not particularly serious, moves the action along nicely.\n\nI recommend this movie for a rainy day or lazy evening at home. Just remember that this movie is action first, comedy second.\n\n7 out of 10"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "PatrynXX",
        "review_rating": "4",
        "review_title": "Bizarre! Why would any top star want to be in this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Mr_Jackhammer",
        "review_rating": "10",
        "review_title": "Adventures of Pluto Nash, not Humor of Pluto Nash!",
        "review_detailed_main": "It seems that a lot of people went into this movie expecting a sidesplitting comedy. That was not the point of the movie. This movie was rocking good sci-fi action, with just enough humor to keep it fun without degenerating into the usual slapstick retardation. The plot was fun and interesting, and I really liked the way the movie had an atmosphere that melded the future with the past. Notice in particular the cool looking vehicles. It was a little like Total Recall, and also like The Fifth Element, but this doesn't mean it stole from either. It was quite original I think. I recommend this movie, it is fun and exciting. Just don't expect a total comedy and lots of dirty jokes or you will be disappointed. Expect some good science fiction, with some genuinely funny moments. I enjoyed this movie a lot. Give it a chance, don't decide what it is and then think it sucks because it's not what you expected."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "H3lix",
        "review_rating": "7",
        "review_title": "Some of the best...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ericstevenson",
        "review_rating": "4",
        "review_title": "Bad enough to hate",
        "review_detailed_main": "This movie at least managed to be better than \"The Master Of Disguise\" but it's still bad. It seems like this film has a hard time deciding whether or not it wants to be a bad comedy or a bad action movie. It looks like the main focus wasn't even on jokes here. There's this obnoxious robot named Bruno. There's also these jokes involving an erotic French robot maid. It goes practically nowhere.\n\nIf nothing else, this movie was clichéd. We get clones in space and laser guns. What's so unique about that? The plot revolves around Pluto Nash getting in trouble with criminals with the place he owns. This might be a reason why Pluto is no longer a planet. Well, this took place on the Moon anyway. *1/2"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "fitzvizion",
        "review_rating": "",
        "review_title": "Not as bad as you've heard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "pkzeewiz",
        "review_rating": "3",
        "review_title": "Biggest flop of all time, but hey its not that bad!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ejonconrad",
        "review_rating": "1",
        "review_title": "Where did $100M go?",
        "review_detailed_main": "I'm not sure what this movie was even trying for. It's set up like a comedy, except that not one funny thing happens, and it's just too goofy to be considered an adventure. Basically it's just a mess.\n\nThis movie was released in 2002, but people were trying to make it since 1987, and it looks like all the sets were designed at the beginning. The whole thing looks like an 80s music video. This movie cost $100M (!) and it looks like cheap made for video junk.\n\nFirst of all, it takes place on the Moon, but that's not really relevant at all. I don't expect a movie like this to get the physics right, but they seem to believe gravity is related to air pressure. When people are outside in space suits, they float around in slow motion, but when they're inside, everything behaves like they're on Earth.\n\nThere are lots of cameos, from Pam Grier to John Cleese, and they all looked like they waited for the check to clear before showing up and lazily reading their parts. I honestly believe John Cleese recorded his part from home.\n\nThere's a plot of sorts, but it's really just an excuse to have people chase Eddie Murphy and Rosario Dawson.\n\nNot so bad it's good, just an hour and a half you won't get back. Skip it."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Quinoa1984",
        "review_rating": "3",
        "review_title": "A very uneventful comedy",
        "review_detailed_main": "Despite having an ideal cast and a bit of imagination on its side, Pluto Nash gets a toes down from me since the parts are usually funnier than the whole, and even when the laughs come around they are meagerly delivered by the cast, inparticular by Murphy, which isn't a good sign. Here, he plays an ex smuggler who gets his own club on the moon, gets threatened to sell, and then goes on a trek to find the man trying to snuff him out. Usual cool guys like Jay Mohr and Randy Quaid do what they can, but it's barely a wait for video, or TV, comedy. C+"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "nateman-2",
        "review_rating": "4",
        "review_title": "Gangster moon movie failure.",
        "review_detailed_main": "I went and watched this movie because of its reputation as a giant dud. It was kind of suprising given the talent that was in this film. The special effects of living on the moon were not as stupid as I was expecting them to be. This is why it got a 4 from me.\n\nMost people go to an Eddie Murphy movie expecting it to be funny. I don't think I laughed once but I do seem to remember a few attempts at getting a laugh.\n\nThe plot was not even close to real. Eddie Murphie is taking on the Moon's Mob almost by himself. Apparently there is no law on the Moon and you have to take such matters into your own hands.\n\nWhile I would not reccomend this movie . I won't go as far as saying don't see it."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "uniquehoo",
        "review_rating": "1",
        "review_title": "Eddie Murphy's worst movie ever",
        "review_detailed_main": "Bad acting, bad scripts. Underlying political agenda, and racial slurs. Murphy's slow dimwit servant is white. Everyone one the low end of the mentality scheme in the movie is white. At the same time Hillary Clinton is intentionally photoshopped onto the money used, intentionally shown to the camera for delay so as it is not missed of point."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "SporkBoy",
        "review_rating": "7",
        "review_title": "Silly, yet satisfying",
        "review_detailed_main": "My father's birthday was today, and he wanted to see a movie that was lighthearted and didn't require too much thinking. Pluto Nash fulfilled on all accounts. It was very silly; we were laughing pretty often, which is always a good sign. Eddie Murphy once again showed his command of both comedy and action, giving us a performance that, though not Oscar-worthy, was nonetheless very enjoyable. There were several interesting casting choices, of which I heartily approved. Randy Quaid was very odd but very funny as Bruno, the bodyguard robot; Joe Pantoliano looked odd with hair and a mustache; and Alec Baldwin had an uncredited cameo which was classic Baldwin. All in all, a good time for a relaxing Friday evening."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "fishwhisperer-31845",
        "review_rating": "5",
        "review_title": "Had to check it out",
        "review_detailed_main": "For years I had heard what a horribly irredeemable flop this movie was. A blemish on Eddie Murphys career. You know. You've heard the digs. So I eventually decided to check it out.\n\nNow going in with absolutely no expectations may have helped, but this wasn't the worst movie I've ever seen and certainly not deserving of all the negative reviews it's gotten. Is it a great movie? No. Not by a long shot. But it's watchable. Which is more than I can say about some of his other movies for sure.\n\nRosario Dawson was just fine in this, and as attractive as ever. Randy Quaid...well he got screwed here. His character was awful. They definitely could've done something there."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jay_brown71",
        "review_rating": "8",
        "review_title": "Lower expectations",
        "review_detailed_main": "This is one of those movies that you read about here on the IMDB, and find that everyone pans. So you go to see it at the dollar theatre not expecting to be entertained, but just for the popcorn and pop and to smooch with your girlfriend. When you do that, you could be pleasantly surprised. This movie is fun, not fantastically funny, but entertaining. Kind of a cross between The Fifth Element and The Milagro Bean Field Wars. Visually, big screen presence reminiscent of Total Recall. Go in planning not to like it, and you will probably end up buying it on previously viewed DVD or video someday."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "6",
        "review_title": "Decent, nothing more, nothing less",
        "review_detailed_main": "This is a little worse than your everyday Eddie Murphy comedy, with a little added action, and the result is, as the one line summary states, decent, nothing more, nothing less. This movie is nothing special, but it isn't the worst movie ever, either. I don't think there are a lot of people who could love this movie, but I don't think it entirely deserves its horrible reputation either. It features some of the best parodies on modern world, and a decent amount of talented actors: Eddie Murphy, Rosario Dawson, Joe Pantoliano, Pam Grier, John Cleese... John Cleese surprised me actually, I didn't expect to like his character, since I usually don't like him, but was really a great parody of the British butler/chauffeur stereotype. It has a normal amount of Eddie Murphy's typical humor, and that is pretty much what one can expect of any of his films. This is not Eddies best film, but by no means his worst either. Big fans of Eddie Murphy might like this, or people who love sci-fi comedy. As this is *slightly* above average, I gave it a 6/10."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "phubbs",
        "review_rating": "4",
        "review_title": "The Adventures of Pluto Nash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "nicenin",
        "review_rating": "",
        "review_title": "After Spider-Man, the best movie of the summer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ArtVandelayImporterExporter",
        "review_rating": "1",
        "review_title": "Pluto Trash",
        "review_detailed_main": "I don't care whether this garbage cost a dollar or a hundred-million dollars, it's terrible at any price.\n\nIt begins interestingly enough, with Eddie Murphy saving his pal from a mobster. Then we're on the Moon 7 years later and it just gets worse and worse with every scene. At first dragging. Then eye-rolling. And finally yelling at the screen. It actually got painful near the end.\n\nJohn Cleese phoned in his performance from a studio in Shepperton. Randy Quaid and Peter Boyle, among others, soiled themselves. Rosario Dawson comes off best in this mess. She can actually act plus she's super-hot. Oh, and noted mouthy leftyst Alex Baldwin provided the only genuinely funny moment playing a mob blowhard. I esp enjoyed when he shoved the cameraman down the stairs.\n\nMurphy deserved the Razzie for the movie, and the Razzie of the Decade they handed him at the end of the Oughts. I'd like to think this is his worst movie but let's be honest, he's made some of the worst movies of the past 25 years. This garbage stands out because it lost so much of the studio's money. I assume it got released only so that the writeoffs could be legally claimed."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "RightOnDaddio",
        "review_rating": "5",
        "review_title": "Sofa Surfing Streams of Cinema on Small Screens In The Summer of 2024",
        "review_detailed_main": "It's bad. It is. But it's hard to tell why, and then at times, its weakness plays in its favor, weirdly. Like, a kind of it's so bad it's good kind of vibe. And you can't blame all the actors that showed up here. You can almost get it and understand why.\n\nEven the bit actors are instantly and totally recognizable at first sight. Like you've seen them a million times before in a million other movies.\n\nLike, who wouldn't want to be in this?\n\nA space comedy with Eddie Murphy at the turn of the century.\n\nWritten by the guy who wrote Hocus Pocus and Mystery Men.\n\nAnd directed by the guy who made City Slickers. Heart and Souls and Tremors.\n\nSo what happened?\n\nI really have no idea.\n\nI know getting stuff from the page to the screen is difficult.\n\nTo look right.\n\nAnd I can't tell if the movie looks this way because so many others do from this era or it's a lack of funds.\n\nAnd Rosario Dawson just seems too young to be a love interest or if any interest to Murphy's character.\n\nThat doesn't work either.\n\nI've always had a morbid curiosity to see this film, even when it was out.\n\nIt definitely plumbs the depths.\n\nIt's not a good movie.\n\nBut I sort of like it anyway.\n\nThe way it looks.\n\nThe horrible acting from just about all involved.\n\nThis movie suffers the most from identity conflict.\n\nIt just doesn't know what it wants to be.\n\nA comedy, you would think.\n\nBut it also wants to be some sci-fi thriller which seems totally strange.\n\nBut it should be viewed just for that.\n\nBecause it is so bizarre.. I can't look away."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "AngelHonesty",
        "review_rating": "5",
        "review_title": "Not Gritty. Not Goofy. A little creative. Mostly Average",
        "review_detailed_main": "It's not that bad, but it's definitely lacking. They have a great cast, many familiar faces. I found this the most uplifting part of the movie. So the question is, why is it so bad with such a good cast? It lacks in emotions, jokes and all around a mind blowing plot. Everything about it hits the average wheel. For being on Mars in the future they should have had more cool technology. More creativity. The plot is down right simple. You can tell they were trying to go for a Fifth Element, Total Recall, Judge Dredd feel, but the movie lacked in the creativity those films had.\n\nThe movie is still fun. And Eddie Murphy is great as always. Lots of good faces. And there are a few jokes that might make you chuckle. I loved the robot guy. He was my favorite character in the whole thing. The only one with a memorable personality. And the robot jokes were awesome. But overall the movie is very simple, very toned down for a futuristic film Not a lot to it. They toned Eddie Murphy and his funniness down too much. And didn't give the gorgeous Dina Lake much of a role. Not much grit to it and not cheesy enough to be a comedy."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Kamurai25",
        "review_rating": "6",
        "review_title": "\"Moon Fun with Pluto\"",
        "review_detailed_main": "Good watch, might watch again, and can recommend.\n\nIt's a little silly, but it's fine for an action comedy. The only weird thing, really was setting on Luna. Having on the its moon instead of on Terra didn't really add a lot to the movie except to facilitate a flimsy backstory and some scenes where people required environmental suits, and that had little payoff.\n\nThe benefits of being a sci-fi action comedy is to have laser effects for the blasters, and androids, which are used to various levels of humor.\n\nEddie Murphy is great, and he plays well with Rosario Dawson, and if nothing else, you have to admit Randy Quaid is funny: the character would have been much different in someone else's hands. I'll have to admit I thought it was Terry O'Quinn (\"Lost\": John Locke), which made even funnier at the time, but it's a good job done.\n\nHonestly, Eddie Murphy and Rosario Dawson feel a little big for their roles, but the story is good: a former smuggler turns legitimate business owner has to find the mob boss behind the people trying to kill him.\n\nWhile I do think this is an average movie, it is solid, and I don't think I would go changing a lot to it. I could see a couple versions of a reboot, but in 2020, they'd probably put it in the MCU."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "brunovanael",
        "review_rating": "3",
        "review_title": "Save time!",
        "review_detailed_main": "I didn't know anything about this film, but I was like \"Eddy Murphy?, this can't go wrong. But it can! Next time save money on names and stars and invest in scripts, directing, vision and schwung. In the mean time, watch \"coming to America\" yet again and discover new layers off brilliance."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Austin_Powers-1",
        "review_rating": "8",
        "review_title": "A great comedy",
        "review_detailed_main": "I don't get it. Why did Eddie Murphy's \"The Adventures of Pluto Nash\" get so much beat up? I see the screenplay is thin, but anyway I think they managed to make this a great movie with some beautiful special effects. I've seen A LOT of movies in my life time, and I've definitely seen much more worse comedies than this, ex. WILD WILD WEST, BOWFINGER and BOAT TRIP (not that there is any comparison).\n\nIt is GREAT that there is no dick-, tit- and most of all Uranus jokes, the humor is much more sophisticated and sarcastic. By the way, Eddie Murphy does a SUPERB acting job, he is real and sympathetic.\n\nUnfortunately this movie has been a huge fiasco worldwide, which means that we most likely never get a sequel :-( Whatever the critics say about this movie, I say \"JOB WELL DONE!!!\"."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "calirachela",
        "review_rating": "7",
        "review_title": "I don't get the hate",
        "review_detailed_main": "After seeing the reviews I put off watching for year only to be surprised by a very enjoyable show."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "madsdrum",
        "review_rating": "2",
        "review_title": "Not good",
        "review_detailed_main": "This is garbage.. I feel bad for Eddie Murphy. I used to like Eddie Murphy's films, but this just seems like meh..... do it for the money."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "qxjqhywdy",
        "review_rating": "7",
        "review_title": "Fun movie",
        "review_detailed_main": "The movie is fun and funny. Is it award winning no. But it's better than the ratings I've seen"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "saarvardi",
        "review_rating": "10",
        "review_title": "I loved every second of it (this is not a typo)",
        "review_detailed_main": "You can stop rubbing your eyes now, this is not a typo. Sure, The Adventures of Pluto Nash is a notorious bomb, a devastating box office debacle and a frequently bashed film in general. But guess what? I loved every second of it.\n\nCall me a masochist, but sometime during mid to late 2003 I decided to locate and watch all of this decades' biggest cinematic flops \u0096 just to see if they were really that bad, or perhaps they were just poorly released with zero studio back up. After literally puking my guts out upon watching such horrors like Battlefield Earth (ugh) or Gigli (barf), I finally stumbled upon the Summer 2002 misfire that is Eddie Murphy's The Adventures of Pluto Nash. What I feared would become another celluloid travesty at first, slowly turned out to be a fun, campy and harmless sci-fi ride, with neat special f/x, imaginative settings (you can easily notice that someone put a lot of thought into this) and hilarious dialogs all packed into one. So OK, it's hardly a masterpiece, but I oddly found myself watching it again and again, until I finally purchased the damn thing on DVD.\n\nThe playful plot is set in a future where man settles the moon, there we meet Pluto Nash (Eddie Murphy), a successful night club owner whose club is burnt down in flames. Determined to figure out who's sabotaging his business (and trying to make him take the fall), Nash embarks an across-the-moon adventure with the help of his loyal robot Bruno (Randy Quaid) and female protagonist, Dina (Rosario Dawson) \u0096 only to find out the startling truth behind the lunar mafia forces. Along the way, we also meet some wonderful actors in the likes of John Cleese, (the late) Peter Boyle, Joe Pantoliano, Jay Mohr, Luiz Guzman and others.\n\nWhile you won't find a solid moral value at the end of the road \u0096 this film delivers the goods (and then some) on the pure old-fashioned entertainment field. If you give it a chance, you might easily find yourself humming \"fly me to the moon\" once the final credits start rolling."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "elshikh4",
        "review_rating": "7",
        "review_title": "Better Than The New Star Wars Trilogy !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Drake_Clawfang",
        "review_rating": "6",
        "review_title": "Murphy tries a Smith role",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "zeroic",
        "review_rating": "10",
        "review_title": "Highly positive",
        "review_detailed_main": "First of all, I am one of those people who heard the rumour about Murphy's \"Pluto Nash\" being a flop and a disaster from miles away. So I didn't go out and see it instantly. At some point though, I just had to see this, because I wanted to know how bad can it be then.\n\nI was stunned. The movie was fast, had a quite cliche, but a working storyline, EXCELLENT sets and subtle humour here and there. This definetly ain't a comedy, if that's what you're looking for, but a full-scale oldskool adventure film! The theme music is kickin', and the sets and the whole movie is so colourful, you'd think it was actually made in France (Just watch i.e. Vidocq). It was like experiencing some mid-90's computergame in a movie.\n\nI think Eddie did a good job in his role of Pluto Nash, other actors were also high quality, but perhaps a bit shaded by Eddie, not because he acted better, but because of more screen time. I love to see this movie over and over again, everytime I get happy when I've watched it, and everytime I feel like I've seen one of the greatest space-adventures ever. I highly recommend if you like cool characters, fast action and extremely nice sets.\n\n(BTW: There was a MOMO logo on the moon, I'm 100% sure I saw it!)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "randomStuff101",
        "review_rating": "7",
        "review_title": "Spectacular. Eddie Murphy is cool. Rosario Dawson is hot. Art direction and effects very good.",
        "review_detailed_main": "Whatever this movie might lack in story, acting, or general depth, it makes up for with the bold and creative set design, art direction, effects and style. There is a lot to look at and appreciate. I was surprised as I knew nothing about this movie - I just rented the DVD on a whim.\n\nI enjoyed it all thoroughly. It doesn't try to take itself too seriously. There is nothing wrong with the story or acting. Sure I could find negative things to say, but why bother? This is light entertainment. No morals, no thought provoking material - just a lunar-futuristic eye candy sometimes-funny movie.\n\nThere's laser guns, robots, hover-car chases, lunar landscapes, purple space suits, moon mafia, even a high-tech cabaret show. And to top it off, Eddie Murphy whose screen presence is undeniable. Much imagination has gone into this movie, and that's more than I can say for a lot of others.\n\nMy Vote: 7/10"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "hu675",
        "review_rating": "6",
        "review_title": "This might be one of the biggest flops of all time but this isn't as bad as i thought it would be.",
        "review_detailed_main": "In the future... people have been living in the moon for work for building cities, starting businesses and it is the only place, where the moon has legalized gambling. A smooth fast talking ex-con turned business man Pluto Nash (Eddie Murphy) owns one of the best clubs in the mood. When mysterious gangsters starts showing up to visit his club, who they wants to buy his successful nightclub turned it into a casino. When Pluto says no to these gangsters, now Pluto finds himself on the run along his out of date robot bodyguard (Randy Quaid) and an young woman wannabe singer (Rosario Dawson). Who been trying to kill him and the others, who are involved with him. Now Pluto has to find out why these gangsters wants to murder him before they find him.\n\nDirected by Ron Underwood (City Slickers, Heart & Souls, Tremors) made an watchable, sci-fi/comedy/adventure that turned into one of the biggest flops in motion pictures history. The premise isn't bad but there's an lack of energy from the direction and the script that could have been better. Director Underwood manages to get a good cast like Joe Pantoliano, Jay Mohr, Luis Guzman, James Rehborn, Peter Boyle, Pam Grier and more. The supporting cast has little to do here expect for Quaid and a bit part by John Clesse have the best moments in the movie. Murphy has some good moments here, Dawson is extremely likable but the last act of the film is a major disappointment. It is probably why that this movie flopped. Special Visual Effects are a mixed bag here. If it had re-shoots and a better third act, this feature could have been saved. There's worst Eddie Murphy movies than this one. It is mostly for die-hard fans of Murphy's work. Alec Baldwin appears unbilled. (** ½/*****)."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "TheDimReaper",
        "review_rating": "10",
        "review_title": "A funny no-brainer worthy of any evening at home with a six-pack",
        "review_detailed_main": "I saw this for the first time while at home and with my fiancée. After reading all the reviews I was prepared for the worst. Much to my delight we were both giggling all the way through.\n\nAs a rental, Pluto Nash is actually a brilliant evenings bit of entertainment.\n\nI can understand anyone who forked out to go to the pictures to see this, feeling a bit let down. Don't let the comments of these people put you off renting it, it is a helluva lot better than some of the titles I have been duped into renting by a flashy box cover!\n\nI give it a 7*/10 for any wet and miserable evening when you want to have a giggle and switch off your brain at the same time."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "EmperorNortonII",
        "review_rating": "7",
        "review_title": "Bad, But Not So Bad",
        "review_detailed_main": "\"The Adventures of Pluto Nash\" isn't the best movie Eddie Murphy ever made. It's little better than the standard classic science fiction B-movie. Still, I found it enjoyable, certainly not Eddie Murphy's worst. Sure, it's a silly movie, and the big talents featured (Murphy, John Cleese, etc.) deserved better. But it has its moments. I guess movies like \"Pluto Nash\" are just an acquired taste."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Assembly",
        "review_rating": "7",
        "review_title": "Was surprised that I actually liked this movie.",
        "review_detailed_main": "I was surprised that I actually liked this movie. I think it started when Randy Quaid came out as the antiquated robot bodyguard. I know this movie flopped but it is definately worth a watch. The movie is witty, surprisingly action packed, and all and all a intresting story line that throws you for a loop at the end."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "rock31620",
        "review_rating": "10",
        "review_title": "NOT As Bad As Most People Say",
        "review_detailed_main": "Before I saw this movie, I read some of its reviews and they were not pretty. So, I walked into the movie theater with very low expectations, despite the fact that I am a huge Eddie Murphy fan. However, I came out of the movie theater feeling like I didn't waste my money. In my opinion, \"Pluto Nash\" is a very entertaining film. It has its funny moments. Enough that I would go see it again. It also has a very talented cast. Along with Murphy stars Randy Quaid, Rosario Dawson, Joe Pantoliano, Jay Mohr, Burt Young, Pam Grier, Alec Baldwin, and Peter Boyle to name a few. I would recommend that you go see it. It is a shame that this movie didn't receive a whole lot of promotion. Go to the theater and have a laugh with Pluto nash."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jonathan-pilkington",
        "review_rating": "7",
        "review_title": "Far better than most make out",
        "review_detailed_main": "Having seen watched this film last night, with a preconception of an all out dodgy sci-fi comedy I was pleasantly surprised to find that 'Pluto Nash' was actually a good movie. Much better than I originally expected and far better than some of these other reviews make out. The jokes aren't all that crude, the acting isn't too bad, and there are some good action sequences. The visual effects and sets are very good. Very Bladerunner/Total Recall in style. If you haven't got anything to do for about 90 minutes, I suggest going to see this enjoyable futuristic, comedy romp. It will have you laughing, for all the right reasons."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "andrew-254",
        "review_rating": "6",
        "review_title": "Not bad if you haven't seen the trailers",
        "review_detailed_main": "I'm so glad i bought this DVD site unseen, if i had seen the preview i would have seen the twist at the end ( obviously they didn't think the show needed a twist? ) who knows, I think the people marketing the film are the ones to blame for the poor reviews and revenue return.\n\nNot the worst thing Eddie has done."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "qarliv",
        "review_rating": "10",
        "review_title": "A good entertaining movie",
        "review_detailed_main": "I've read the no so complimenting reviews, and I have no idea what in this movie is bad. I go to a movie to enjoy myself, and this movie was indeed a good surprise. It has visual effects, music not so bad, good actors, and a usual story but in an interesting environment. The movie tried to bring a popular script to the future. I enjoyed the movie, much better, light, then other movies today. Eddie Murphy is not disappointing as always, his movies as well as this one are a all family movie to go and just enjoy it. In my opinion, even the robot scenes are somewhat novel, in contrast to other reviews."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dromasca",
        "review_rating": "6",
        "review_title": "Fading Eddie",
        "review_detailed_main": "Eddie Murphy's comic appeal is fading out, and if he will not do something special soon, his carrier will be over. The problem may be in the scripts and directors he is picking. 'Pluto Nash' is not much more than a TV pilot, but you will not see the series soon, because they did not catch with the audience. Effects are like Star Trek in the 70s. The only bright spots are Rosario Dawson - better and more beautiful in each movie, and Randy Quaid, acting good, though his robot humor is quite expected. But so is the humor in the whole movie, and you do not get much more cinema satisfaction than you do watching some TV comedy. Actually I saw many better TV ones. 6/10 on my personal scale."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "pywrit",
        "review_rating": "6",
        "review_title": "Campy sort of fun",
        "review_detailed_main": "While there have been better movies, there have certainly been worse. This movie is a reasonably harmless way to kill a couple hours and, considering what has been on TV and cable lately, it might well be worth your while to rent this one. Besides, any time we get the chance to see the lovely Pam Grier (I still can't believe she's been around Hollywood for 30 years now!) it's worth the rental fee. Pywrit scale of 1-10, I give this one a 6."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "kevinpowell265",
        "review_rating": "10",
        "review_title": "Crazy but great!!",
        "review_detailed_main": "Wow what a great laugh . what wrong with it some critics need to have laugh"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "bauhaus-80370",
        "review_rating": "7",
        "review_title": "Great Movie!!! :-)",
        "review_detailed_main": "WTF 3.8 in Ratings for this great movie!? I voted a 7 and i think its fair! its a movie to enjoy with Friends or Family, i dont spoil anything but: it got good Music too :-)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "heshootshescores",
        "review_rating": "7",
        "review_title": "Shoot me if you must, but I liked the movie.",
        "review_detailed_main": "Ok, let's face it, it's not an Academy Award winner, but Pluto Nash was a fun movie (catchy theme music too). I can't believe all the bashing this movie has taken, for a goofy fun movie...lighten up people and enjoy. Pluto Nash may not be Gone with the Wind, but it's also not Dude Where's my Car :-)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "pilon-34719",
        "review_rating": "10",
        "review_title": "One of my favorite movies",
        "review_detailed_main": "My wife and I love this movie and have watched it many times. Good clean action the whole family can enjoy. This movie has a great story and characters that are easy to like and root for. I would love to see another movie or TV show of Pluto Nash. If you liked,Princess Bride,5th Element or StarDust you will enjoy this movie."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "shortc-85671",
        "review_rating": "6",
        "review_title": "Why is on the top 100 worst?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "brad-kruse",
        "review_rating": "7",
        "review_title": "A fun flick",
        "review_detailed_main": "I liked 'Pluto Nash'. The soundtrack was catchy and enhanced the story, the old-time gangster B-movie treatment of a moon base, complete with 40's and 50's inspired car styles, was great. The science of the story was interesting, and appropriate to the story, with nothing wild thrown in (well, maybe the highway port-o-let in vacuum in the first moon surface scene was a bit much).\n\nThe shootouts, the chases, and the robots (gotta love a bald Randy Quaid and 'Babette' -- \"Oops!\") If you want a gritty vision of future crime, check out 'Judge Dredd' -- for the 'Nuns on the Run' type criminals, Pluto is your man!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "zimmerblake",
        "review_rating": "9",
        "review_title": "A film ahead of its time",
        "review_detailed_main": "The Adventures of Pluto Nash are exactly that, an adventure. You have action, you have romance, and you have beautiful acting from the comedic genius Eddie Murphy. Randy Quaid as a robot was a lovable and heart wrenching addition to the film. I felt his pain at not being appreciated. I understood his loyalty and celebrated his triumphs. The technology and culture of the futuristic period was dead on with risky yet probable decisions by the producers. This film is clearly geared toward the highly intelligent. It took me several viewings to truly absorb its depth and message."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dr_freak2000",
        "review_rating": "",
        "review_title": "Totally bad !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "eivindespenes",
        "review_rating": "7",
        "review_title": "I liked this movie, it entertained me",
        "review_detailed_main": "I found this movie to be thoroughly entertaining. I have no idea why this movie has such poor ratings. Maybe you just have to be a science fiction fan to enjoy it?\n\nI like the entire outer space thing. Then there's the vehicles. The robot thing going on. I also don't think the acting is as bad as some people will have you believe.\n\nI think it's a brilliant movie and I would gladly watch it again. I'm confused why this movie has such bad reviews. And according to the internet it was a bomb at the box office? Maybe people have no taste.\n\nOver time maybe this can be considered a cult classic. Much like other entertaining films like Lifepod."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jedi jus",
        "review_rating": "",
        "review_title": "One of the worst films I've ever seen, it's just embarrasing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "maynardd-00805",
        "review_rating": "7",
        "review_title": "Good Movie",
        "review_detailed_main": "I thought it was under rated. I enjoyed it. It was no blockbuster but absollutley entertaining."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "PHASEDK",
        "review_rating": "10",
        "review_title": "What is wrong??",
        "review_detailed_main": "Watched this through tonight on UK's ITV1.. and thoroughly enjoyed it. Box office flop.. cost $100M to make, took $4.4M over what period of time.. the introduction makes you wonder, but once it gets going, its a romp!! Yes, many ideas stolen from other sci fi pics but then what film doesn't copy some things. Total Recall/Blade Runner came to mind. What new ideas are there anyway. The money must have gone on effects, and I thought they stood up very well. Yes, its a family film, don't remember any bad language in it, but this was a TV cut. Some great ideas in this,no mention of John Cleese in the write up, but its a cameo. By the end I realised I have seen it before. So I've forgotten it, enjoyed it all over again. Flop, well, many people seem to expect blood and gore now, shame. Is it the age group? Not funny? 'Humour chip' missing is it? Maybe its too subtle. Its a very sad state when people couldn't enjoy such a well made film.. as another comment said, accept it for what it is. Don't expect. So many good bits in it..some set pieces. Yes, Fifth Element as well to a degree.. I like Eddie Murphy as an actor, I love sci fi, whats wrong?"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "clarks58",
        "review_rating": "8",
        "review_title": "Guilty pleasure",
        "review_detailed_main": "I love this movie. I don't understand the hate. It's an enjoyable Saturday afternoon movie. Anytime i come across,I have to stay till the end. Definitely a movie not to taken seriously. Just dumb fun,with a great sci-go bent. Even the movie doesn't take itself seriously. Dawson plays a character very similar to her role in Men in Black 2. Definitely not her best work but gets the job done. It's nice to see someone make a movie that breaks the norm and almost reminds of the old serials they played before the movie when I was younger,or should I say young. Lol. The old Flash Gordon and such. Would really recommend that they should make a big bowl of popcorn and give it a try. Maybe by themselves if their afraid of being teased. Give it a try,don't get all snobby and just have a dumb laugh."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "eric-wallis",
        "review_rating": "8",
        "review_title": "I like this movie! Better than the bad ratings would lead you to believe!",
        "review_detailed_main": "If you like comedies and movies that you can just relax and not take seriously, this might be for you! If you like movies such as \"Hudson Hawk\" you might want to give this a look."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "jakenicholls-71779",
        "review_rating": "10",
        "review_title": "Don't believe the bad reviews!",
        "review_detailed_main": "I avoided this movie for so long based on the fact that I'd heard so many critics panning it. Being an Eddie Murphy fan, and having seen every other film of his, curiosity got the better of me. I can confidently say, having now seen the movie, that while it isn't Murphy's best work, it's certainly far from his worst. Sure it's not the usual joke-a-minute Eddie Murphy affair, but does every Eddie Murphy movie have to be? This was a great little action sci-fi film with a suitable amount of comedy on the side. I encourage anyone who likes Eddie Murphy to give this film a shot, you'll be pleasantly surprised!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "FirstShirt",
        "review_rating": "9",
        "review_title": "Innovative Sci-Fi of the Future",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "anthonynat",
        "review_rating": "10",
        "review_title": "It was great!",
        "review_detailed_main": "I really enjoyed Pluto Nash - Eddie Murphy was great! It had Randy Quaid and even Jay Mohr. It was funny and action-packed, and the effects/sci-fi were terrific. The jokes were NOT juvenile - they were wry and sometimes silly, but I don't remember any \"Uranus\" joke or other lame jokes. Even if there were, they were less than a handful, compared to the entire film which both entertained and had realistic Moon/sci-fi action. The director and special effects people did their homework. There were some weak points in the plot, such as some of Pluto's motives, but I understood the entire story. It's almost Beverly Hills Cop combined with Total Recall (and direct reference to both a Star Trek episode and Star Trek movie regarding identical people) but set on the Moon."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dcorr123",
        "review_rating": "8",
        "review_title": "ignore the bad votes, this is actually a good movie",
        "review_detailed_main": "** Contains spoilers ** I don't know why so many reviewers are giving this movie such low ratings, including those cretins that give out the Razzie awards. Some of them obviously have no idea what movie they're reviewing. This movie actually has good performances, good dialogue and very good visuals. It's certainly an order of magnitude better than puerile junk like \"The Spy Who Shagged Me\" which seems to get lots of high ratings.\n\nThere are, contrary to what some say, quite a few fresh ideas, e.g.: the guy who created a whole basketball team, by cloning one old player, called the Air Jordans or: if you're getting a body alteration, you get scanned and then pose in front of what looks like a mirror, with various new bodies or: illegally imported freeze-dried chihuahuas. Also, if one payed attention, the gravity situation is \"explained\" up front: the \"Welcome to Little America\" sign also notes \"Prepare for Full Gravity\". This is at least better than the apparently universal one-G gravitation found on every planet or moon in \"Star Trek\" or \"Star Wars\"."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Kobaltblitz",
        "review_rating": "8",
        "review_title": "The movie was really fun to watch...",
        "review_detailed_main": "Many people said that the movie has bad jokes or a weak story.\n\nI don't think so. The jokes were great, the action cool, and the story twists unexpected.\n\nI give it 8 out of 10.\n\nGo and see for yourself. You won't be disappointed..."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "vmajor",
        "review_rating": "9",
        "review_title": "We thoroughly enjoyed this movie!",
        "review_detailed_main": "I heard only bad things about this movie so when it was showing on cable several months ago, my wife and I took no interests but got drawn in nevertheless.\n\nThe movie was a lot of fun! It was light, funny and full of clever small details about life on the Moon.\n\nIt is a shame that it was panned by the critics, the studio and the marketers. They were very good at destroying any chance of this entertaining movie succeding with the audience when the movie was finally released.\n\nIt is an absolute BS to say that this movie is bad. If you are seeking a bad movie go and watch \"The League of Extraordnary Gentleman\""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "FIVEDOLPHINS",
        "review_rating": "8",
        "review_title": "A Movie That Is Ahead Of Its Time.....",
        "review_detailed_main": "Feels like a simple case of \"POLITICS AS USUAL\", when it comes to this movie. Looks like the critics and the \"REALLY SENSITIVE\" took this flick way too personal, because the only thing I see with this movie is teh \"BALANCE OF POWER / CONTROL BASED ON ETHNICS\".\n\nA good movie, with an odd premise, but funny just the same. I would easily closely compare this one to the likes of \"THE FIFTH ELEMENT, DEMOLITION MAN or TERMINATOR SERIES\".\n\nAll of these movies have rediculous, or unbelievable subject matter, but entertaining just the same.\n\nTiming also played a big part in this movie. I truly believe that had this movie been released at the right time, it could have made all the difference.\n\nThe entire cast and crew were GREAT! I especially enjoyed the little things, (details that mattered), which laced the entire movie together.\n\nThe only thing I see here is that prevous movies Eddie Murphy starred seemed to shoot for a younger audience, where as this movie was set in the future, it used a number of actors from an older age group. (That is probably what attracted me).\n\nI guess if its all about the bottom line, ($$$ Cha-Ching $$$), one must be more aware of the market they are targeting by using newer names (perhaps), while also being aware who has the power or control in the movie.\n\nIts all good! All about \"Entertainmant\"..... (Just a movie). Some day there might become a time when our society, as a whole, can actually complete a movie that would meet or exceed the sensitivities of at least the majority of its viewers.\n\n;<)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "savageangel-1",
        "review_rating": "8",
        "review_title": "One Of My Favorite Fallback Movies Of All Time",
        "review_detailed_main": "I can not tell you how many times I have watched this movie! is it Eddie Murphy of old (when he had to prove himself?) No! (do you really think an actor should limit himself to what people want him to be?) Is it Eddie Murphy entertaining himself? well... it quite possibly could be! in any case, stop looking at his movies for what he used to be, and appreciate the man for what he is!! this movie was brilliant in a lot of different ways that simply are not \"Eddie Murphy\" I for one am glad he got rid of that old personification and made movies like this and Coming to America! (I think the world is much richer with them) and it's marvelous to watch an actor grow! (even if you don't think its what he should be growing into)"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "flehmen",
        "review_rating": "8",
        "review_title": "I was surprised by how much I enjoyed this movie!",
        "review_detailed_main": "Pluto Nash is not for the brainiac in us.I did find it an amusing and playful movie that I would recommend seeing.\n\nI read the reviews in the papers and on the web and I can tell you that the critics who get paid are wrong again. They seem to have gotten their noses bent out of joint by not being allowed to screen the movie before everyone else.\n\nFor those of us writing reviews on the web, we seem to be a confused lot. Half of us like it and half don't. I went expecting a B grade Sci-Fi with cheesy Eddie Murphy jokes and enjoyed myself throughly. It's actually one of the better movies I've seen recently, believe it or not, mostly because it's not pretending to be something it's not, and then failing miserably.\n\nI wouldn't recommend this one for the kids, not that there is much sex/violence, but more for the fact that the humour is just stuff that kids won't find funny. (I must be feeling my age. :)\n\nDon't go to this movie if you want great Sci-fi, don't go if you want great comedy, but I recommend it for those of you who just want to be entertained without a lot of thought!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "yoursuicidexxx",
        "review_rating": "8",
        "review_title": "Don't judge this movie by the rating",
        "review_detailed_main": "Seriously, it doesn't suck. Somehow I missed seeing this when it came out, I would have been into it. I really enjoyed this movie and for it being 18 years old already, it holds up for the most part. Classic feel good Eddie Murphy paired with Rosario Dawson and a touch of Randy Quaid... yes please. I will probably watch it again on a rainy day."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "stephenchase-63504",
        "review_rating": "10",
        "review_title": "The funniest sci-fi movie that starred Eddie Murphy!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "machrf",
        "review_rating": "10",
        "review_title": "Absolutely a fun movie",
        "review_detailed_main": "It is chock full of great actors and actresses that compliment Eddie Murphy in this fun romp on the moon. It is not as risque as his other movies of the time. It is toned down a bit which makes it a bit better. It is a great movie that has never received its due."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "pats_sox_bsandcs",
        "review_rating": "8",
        "review_title": "Really???",
        "review_detailed_main": "This movie was no where near as bad as the ratings say. Very clever with many very funny situations...plus some good one liners. Well worth the time to watch. I thoroughly enjoyed it"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "FIVEDOLPHINS",
        "review_rating": "8",
        "review_title": "One of the FEW Major Black Actors in a Sci-Fi, KICKIN!",
        "review_detailed_main": "As a long term fan of Eddie Murphy, ( From SNL ), It was a great thing to see him take on a diverse role, especially in a Science Fiction Movie.\n\nWith Sci-Fi Movies being my favorite genra, right next to comedy, It was great to see many of my favorite actors, ( Even the new ones ), bringing it all together, but this time in outer space.\n\nCannot unterstand why the movie did not do as well as it did in the theaters. Feels like \"politics\", but perhaps it could have been \"Timing\".\n\nEddie playing \"a suave and sophisticated bar owner on the moon\", seems like a pretty cool foundation a movie, especially when you add a razy side kick like \"Randy Quaid\" as a robot.\n\nThen the movie takes it back to more \"old school\" with the infamous \"Blacksploitation Actress\", PAM GRIER. ( Looking as good as ever ), and especially tough while helping to run down the bad guys. (Pam is still all that)!\n\nMy first introduction to Mr. Boyle was in the De Nero movie, (Taxi Driver). Through the years he has done an awesome job in both areas of comedy, (Gege Wilder / Mel Brooks), to dramas.\n\nThe casting was like something sent down from \"The Movie Gods\". Not to mention that \"Whacky Assed Jay Mohr\", who played behind a Celebrity name I have not heard of since the 60s, (Tony Francis)..... Heh, Heh...\n\nOver all, the movie did well! My perspective is from looking at black actors from the \"Stepin' Fetchit\" era, up to present. I view this movie as \"A DEFINITE STEP FORWARD\", and perhaps with a different chemistry, (Viewing the down falls of this movie), one should take all elements into consideration, and just \"DO IT AGAIN!!!!\"\n\nHats off to all involved in this venture. Lets, again, contribute an even larger positive lead by evolving the acting spectrum, as a whole!\n\nAlso, would love to see Jacynthe Rene` (Babette), again but in an expanded role. She has a lot of potential acting in American movies;<)\n\nFrom the words of Eddie Murphy himself: \"Its All Good\"! My favorite saying, only because its true.\n\nTony M. FiveDolphins"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "vsantiago5",
        "review_rating": "9",
        "review_title": "The sets, the goofiness, the lines, the story are all very good.",
        "review_detailed_main": "I watched this movie on TV on demand and thoroughly enjoyed it. Eddie Murphy, as usual, was excellent and the rest of the cast was just as good. I loved the sets, the goofiness, the lines, the story. Since I found myself wanting to re watch the movie I bought the DVD and the movie now stands on my shelf, next to my other favorites. Critics can be wrong. For example, back in the 1950s, \"Imitation of Life\", now recognized as a cinematographic masterpiece, was unanimously panned by the critics! This is just one example. Personally, I make it a point never to read them before watching a film. Instead, I check out the director, the cast and maybe the story. If I know neither director nor cast I use my own critical judgment based on the story, what my movie - savvy friends say and a general feel based on trailers. I might read the critics after seeing a film to see who I agree with or rather, who agrees with me. By unanimously panning The Adventures of Pluto Nash the critics have committed another Great Critic Blunder. The movie is really very good."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "pacmanfever",
        "review_rating": "10",
        "review_title": "Awesome Movie",
        "review_detailed_main": "This was a great movie. I don't know why everyone gave it a harsh review. It had action and comedy, a perfect mix. The robot was hilarious. The jokes went great along the story. A masterpiece waiting to be watch. 10/10."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "tbmichael",
        "review_rating": "",
        "review_title": "Excellent movie, lotsa fun. Really.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "clsjessicawilde",
        "review_rating": "10",
        "review_title": "Why I hate movie critics",
        "review_detailed_main": "This movie, like Battlefield Earth and Speedracer are just unfortunate victims of groupthink stupidity. One idiot says its bad on their sad little blog and every other critic wannabe just hops on board and slams it for no reason. I missed seeing this in theaters because I only heard how bad it was. I saw it years later on tv and loved it! Its FRESH and ORIGINAL and FUNNY. I completely loathe critics now. Especially these days when the brain dead lemmings will rant and rave about the stupidest crap (like some dumbass muscle heads strapping rockets to a car and going into space, or a bunch of lame cgi super heros jumping around in slow motion). Its why movies these days just suck!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "filmfreak-5",
        "review_rating": "",
        "review_title": "Kinda funny movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "robtadrian",
        "review_rating": "8",
        "review_title": "This took 2 years to release?",
        "review_detailed_main": "Advance comments would have you believe this is some horrid\n\nhybrid of Holy Man and 2001:A Space Travesty. It's actually a pleasant action movie with comic tones, sly touches and a nice\n\ntwist.. The trailer doesn't do it justice. I mainly went to see the\n\npairing of Eddie Murphy and John Cleese, two comic geniuses\n\nwith different approaches. I suppose if Jack Black was the star it\n\nwould be hailed as a comic masterpiece by those who think\n\nhearing the word \"Malkovich\" over and over again denotes genius. A good Saturday afternoon escapist feature and I did not hear the \"Uranus\" joke so take that to mean what you will."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dletter",
        "review_rating": "",
        "review_title": "The problem with Pluto Nash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "shanephonex",
        "review_rating": "10",
        "review_title": "Add cheesy luv sick teens and ppl would love it",
        "review_detailed_main": "One of the best feel good movies I've ever seen. Set in space which I love, a space hustler / club owner has a series of misadventures. They actually used some imagination for this film, cool characters and different future techs. I loved the advanced Moon Cadillac lol just awesome. Not sure what ppl expected with this movie I'm guessing it's just because Eddie Murphy was in it that ppl must have expected some huge belly busting block buster. That is not what this movie is, it is a light hearted comedy set in space (the Moon). I really liked the original characters with the quirky personality's of the machines (IE robot, Cadillac) If your looking for a sci-fi scene with some good laughs and funny characters this movie is for you!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Unassuming Local Guy",
        "review_rating": "",
        "review_title": "I was pleasantly surprised for ONE reason...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "drewmerkle",
        "review_rating": "10",
        "review_title": "Lunar Las Vegas With Fun Science Fiction",
        "review_detailed_main": "Fun theme music and some playful thoughts about life in the future (the Lunar Grand Hotel, instant plastic surgery, the hillarious [sic] new face of money, and so on) punctuate this action adventure. Pluto Nash (Eddie Murphy) is the owner of a nightclub on the moon which has apparently been settled Las Vegas style by the time the movie begins. His adventures occur as he goes about protecting his interests and his existence from the underworld figures who are trying to muscle in on his turf. Dina Lake (Rosario Dawson, also seen in Men In Black II) makes for an attractive cohort. Bruno (Randy Quaid) is an unexpectedly sympathetic android character. Some will appreciate the rather enjoyable exterior scenes of lunar habitats and Earthrise moonscapes. It's just a movie, folks, but if you're in the right mood, it's entertaining."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "TexasRedge",
        "review_rating": "",
        "review_title": "Not really that bad, but still a long way from great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "fung0",
        "review_rating": "8",
        "review_title": "All about expectations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Not a single laugh to be had, leaving the clunky and unengaging plot exposed throughout",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "bradatharpe",
        "review_rating": "9",
        "review_title": "I thought Pluto Nash was a great movie!",
        "review_detailed_main": "I honestly don't know why all these critic \"SNOB'S\" get listened to.? Judge the movie on your own! Let no one tell you how you should feel about The Adventures of Pluto Nash. I Honestly thought it was unique, light hearted, inventive, yes a bit silly, but SO what? It was a lot of fun and it had a very good ending. I think all of you out there giving this movie such a hard time need to stop taking yourselves entirely to seriously. Lighten up!:) I have read a lot of comments, and reviews on movies such as Megaforce. This movie was the same as Pluto Nash. fun, Unique, and after all is said and done light hearted. Like Puto Nash it had a great if a little over the top story line. You should look up some of the reviews. However I suggest you see the movie for yourself first. Remember It was made In what 1979-80? movie technology wasn't quite where it it today (except for the Lucas's and Spielburg's) of the world, but they did the best with what they had. I Just believe most of these movie critics are just venting their own frustration at having nothing better to do. So there being as mean as they possibly can."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "a disaster of seismic proportions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "tourmaline-39137",
        "review_rating": "10",
        "review_title": "Great Rainy Day Movie",
        "review_detailed_main": "I don't know why this movie got such horrible reviews. True, its not Oscar worthy, but still I enjoyed the movie for what it is; a ridiculous cheesy comedy. But I enjoyed it and whenever I'm feeling down I watch it. That's all I have to say on this movie."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "Not horrendous but definitely not memorable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "essentialparadox",
        "review_rating": "9",
        "review_title": "Best future since Back To The Future part II",
        "review_detailed_main": "This has got to be one of the only movies I've seen (aside from Back To The Future II) where the future is portrayed in a fun and exciting way, rather than the more common dark future, such as Minority Report, Blade Runner, etc. Just the sets and technicalities of the movie are worth seeing it on alone.\n\nBut I also found some parts absolutely hilarious! The whole thing wasn't a laugh a minute, but I'd definitely recommend it. Heck, just writing this makes me wanna go see it again.\n\nIn short, this is a fun movie, which you should catch if it's ever on TV. The story isn't bad either, it really reminds you of the family movies made in the late 80s early 90s. If you're looking for some excellently written piece of bore, then you won't enjoy it. But if you wanna see a hilarious, colorful adventure in space, definitely see it."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Jennings",
        "review_rating": "",
        "review_title": "Not too bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "munky-62444",
        "review_rating": "10",
        "review_title": "Pluto Nash, The Jesus Christ of Our Times",
        "review_detailed_main": "The Adventures of Pluto Nash has simply been the most influential movie that I've ever seen. I had depression when it came out, it cured it. My dad had stage four testicular cancer, it cured it. Me and my wife couldn't get it on, and Eddie Murphy personally came to my house, in character, and done did my wife. Needless to say, we haven't been happier since. I can't even begin to describe what Pluto Nash has done for my life. I hope and pray to god that everybody watches The Adventures of Pluto Nash in their lifetimes."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Gildas",
        "review_rating": "",
        "review_title": "Eddie Murphy himself panned this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "irooshka-1",
        "review_rating": "8",
        "review_title": "Exceeded my expectations",
        "review_detailed_main": "i got this movie on the discount shelf because the cast seemed promising. i expected it to be pretty trashy and was pleasantly surprised. it was a fun science fiction, some interesting visuals like the grime, the cars, the interior spaces, the moonwalks and the city. i also liked the way that the artificial moon life was represented in opposition to the natural earth (reminded me of a low budget Bladerunner). I thought that the humor was amusing if not always funny and the dialogue pretty good. i also liked the role reversals such as the kick ass Pam Grier mom and for once, a black character plays a hero in sci-fi instead of just being some mechanic or sidekick or the first-to-die victim.\n\nas some other commenters have written, if you're expecting eddie murphy to be the clown, you'll be disappointed. expect low budget, entertaining, slightly transgressive, sexy eddie murphy sci-fi."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Thun",
        "review_rating": "",
        "review_title": "Not nearly that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "stephenhughes-42765",
        "review_rating": "10",
        "review_title": "This movie is simply a masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Oakley_the_Chronicler",
        "review_rating": "",
        "review_title": "Terrible, terrible, terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ionmachine",
        "review_rating": "10",
        "review_title": "Soundtrack is the best thing here",
        "review_detailed_main": "10 out of 10 - But only for the soundtrack!!!!!! That is..\n\nThe soundtrack (by John Powell) is the only good thing about this movie.\n\nAnd guess what.....WB won't release the license for the release of the Score because it WAS such a FLOP!!!! That really is a SIN.\n\nY the hell sacrifice an absolutely WICKED Score just because they think the film wasn't viewed by enough people (at the cinema maybe) but general viewing over the airwaves, cable and DVD....there must be more! I'm also sure that Mr.Powell wasn't too happy about the S.track not getting a release either.\n\nI want to see a RELEASE A.S.A.P.\n\nor even a bootleg...does not bother me!!"
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "boopme",
        "review_rating": "",
        "review_title": "Hysterical",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Jonathan_Hammond",
        "review_rating": "10",
        "review_title": "Refreshingly Underrated Space Gem!",
        "review_detailed_main": "In 2002, Eddie Murphy delivered one of his most polarizing performances in the science-fiction comedy \"The Adventures of Pluto Nash\". Hailed by some as a major misstep, and universally panned by critics, the film has since developed a cult following of those who believe it to be a misunderstood gem.\n\nMurphy's eccentric style was in full display in his portrayal of Pluto Nash, an ex-smuggler turned nightclub owner on the moon. With an intricately woven narrative that dives into themes of economic manipulation and artificial intelligence, the film boldly confronts complex topics through a comedic lens.\n\n\"The Adventures of Pluto Nash\" indeed suffered from a severe disconnect with audiences at the time of its release, making it a significant box-office flop. However, the film's ambitious approach to comedy and storytelling, set against the backdrop of a futuristic moon colony, sets it apart from the traditional comedy fare.\n\nOne of the film's defining features is its refusal to take itself too seriously. From the tongue-in-cheek future tech to the moon's multicultural denizens to the unabashedly campy special effects, it all adds up to a film that's more farce than hardcore sci-fi, which may have rubbed some viewers the wrong way upon its initial release.\n\nHowever, the audience is rewarded when they approach the film with an open mind, free from preconceived notions. Despite its commercial failure, \"The Adventures of Pluto Nash\" features a standout comedic performance from Eddie Murphy and a unique blend of humor and sci-fi that is truly its own.\n\nIn conclusion, \"The Adventures of Pluto Nash\" is an underrated and delightful film that balances its eccentric comedy with unexpected depth. Its initial box office failure should not dissuade potential viewers from giving it a chance. Over time, it may just prove to be a hidden treasure in Murphy's illustrious filmography."
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "K-Liz",
        "review_rating": "",
        "review_title": "UGH!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Mheywood",
        "review_rating": "",
        "review_title": "...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "brianscot",
        "review_rating": "",
        "review_title": "NOt at all THAT bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "brownghost",
        "review_rating": "",
        "review_title": "What happened here Eddie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "PlutonicLove",
        "review_rating": "",
        "review_title": "Forget the movie, watch it for the score",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "sk8alwayz",
        "review_rating": "",
        "review_title": "pfft comedy?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "A financial disaster, but not the worst Eddie has to offer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "G-Man-25",
        "review_rating": "",
        "review_title": "Pluto Nash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "THE MOON REALLY IS MADE OF CHEESE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "MLDinTN",
        "review_rating": "",
        "review_title": "Lame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "dj_bassett",
        "review_rating": "",
        "review_title": "Painful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "raysond",
        "review_rating": "",
        "review_title": "The rise and downfall of Eddie Murphy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "Pluto Nash is a hash!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Iceman-15",
        "review_rating": "",
        "review_title": "They sure know how to bury a film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "slightlymad22",
        "review_rating": "",
        "review_title": "Worst Flop Of Murphy's Career",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "gatti-87451",
        "review_rating": "",
        "review_title": "lol",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "simon8020",
        "review_rating": "",
        "review_title": "Has visual echoes of 'Blade Runner'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "LittleLamie",
        "review_rating": "",
        "review_title": "Rosario needs acting classes!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Shicca",
        "review_rating": "",
        "review_title": "Sometimes funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "The Misadventures of Nash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "ersbel",
        "review_rating": "",
        "review_title": "A sad Eddie Murphy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0180052",
        "movie_name": "The Adventures of Pluto Nash",
        "movie_rating": "3.9",
        "review_username": "CitNancy",
        "review_rating": "",
        "review_title": "Don't get me wrong...",
        "review_detailed_main": ""
    }
]