[
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Movie-12",
        "review_rating": "2",
        "review_title": "One of the worst film's of 1999. 1/2* out of ****",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "drow",
        "review_rating": "2",
        "review_title": "Why?",
        "review_detailed_main": "Who's the greater fool, the fool who came up with this, or me, the fool who actually went to see it. It was a late night showing and my thinking was blurred by a flask of moonshine, that's my excuse. But the makers of this film have no excuse for this mess. Why? That's what I want to know? The effects that made these babies do what they did were good,\n\nBUT IT'S CREEPY TO SEE BABIES ACTING LIKE THAT!!! so I give it a 1, which is fitting because it is around the average age of the actors and actresses, and not far behind the IQ's of those who actually made this film."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "chatykat",
        "review_rating": "4",
        "review_title": "Oh my God!",
        "review_detailed_main": "Don't even get me started on this one. I mean talking babies, it was okay in Look Who's Talking, but come on babies that are geniuses. So what they can spell their ABC's early, my niece can spell her's and she's 2 years old. Just when you're in the movie station just pass by it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "zabouke",
        "review_rating": "",
        "review_title": "Oh man, greatest movie of all time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "brightfamouscucumber",
        "review_rating": "5",
        "review_title": "Not so bad.",
        "review_detailed_main": "Okay, I finally made it through the comments of hundreds of my fellow contributors, the vast majority of whom thoroughly disliked this film, blasting it and saying it deserved to be on the bottom 100 worst films of all time. I disagree.\n\nI agree that it isn't the best film in the world, but I've seen so many which were so much much worse, on so many different levels.\n\nI could see what it was that the director and the producers were aiming for.. and they came so very very close... unfortunately, because they came close in almost everything, they didn't have anything that turned out very good. And this, I'm sure, is the reason so many people don't like it and don't think it has any redeeming qualities.. because nothing was done excellently.\n\nIn my opinion, John Wayne's first thirty or so films are all worse and less entertaining than this. But, you don't get to see them very often nowadays, so people who haven't seen them don't realize just how bad, in comparison to today's special effects, they were.\n\nSure, the acting was less than stellar, which would be surprising from an all-star cast of adults. And so many people try to compare this flick to Baby's Day Out and Look Who's Talking... but in this flick, unlike those others... the main characters are the children, not the adults, so it only makes sense to have all the adult actors tone down their performances... and since it's so hard to get toddlers to do anything on cue, the adults needed to tone down their performances just that much more.\n\nIt was a very ingenious concept, that unfortunately was much less well received by it's overly picky audience.\n\nSure, there were some less-than-stellar special effects, too. So many of my fellow contributors cued in on the fact that the kids' lips weren't properly synching to the dialog, but not many noticed that in the vast majority of those shots, the babies' lips and facial expressions were computer generated... so, apparently that effect pulled itself off adequately.. just not superbly, or there would not have been the synching problems.\n\nIf you're the kind of person who can enjoy a story without having to base your enjoyment on stellar performances, you'll be able to enjoy this flick, too."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "LebowskiT1000",
        "review_rating": "5",
        "review_title": "Yeah...don't bother.",
        "review_detailed_main": "I saw that this film had such an unbelievably low rating on IMDb, so I had to see for myself what was so bad about this film. I figured it couldn't possibly be that bad. Well...I think I spoke too soon, cause it was REALLY BAD!\n\nThe story is really bizarre. No, make that freaking stupid!!! I can't imagine that child would get enjoyment out of this movie. I'm sure that kids would laugh at a little bit of the stupid humor, but not a whole lot.\n\nI find it physically painful that Christopher Lloyd agreed to do this movie. Why Chris, Why? I was also a little surprised to see Kim Cattrall in the film too, I think she can do much better than this. I do like Peter MacNicol (TV's \"Ally McBeal\"), and he did a pretty good job with his role. Kyle Howard's character was quite bizarre, if you've seen the film, I think you'll know what I'm talking about. But...he did a pretty good job with his role. Dom DeLuise was another good addition, but not enough to make this film worth watching. I did like seeing Jim Hanks in the film, brother to a certain other famous Hanks (Tom Hanks if you can't figure it out), although he has a very small role in the film. It's amazing how much Jim looks like Tom.\n\nOne other thing I have to vent out that really angered me. The cover to this movie shows the little kid with glasses on. I don't think he EVER had glasses on in the entire film!!! Perhaps I missed it, but I sure didn't notice them. Strange huh?\n\nAll in all, I would definitely recommend staying clear of this film, unless you're curious like I was. If you do end up seeing this film, I hope you enjoy it more than I did. Thanks for reading,\n\n-Chris"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "May I ask a legitimate question- whose idea was it to use the talents of Kathaleen Turner and Christopher Lloyd and waste them?",
        "review_detailed_main": "I will give some credit to this otherwise awful film, that it is better than its abysmal sequel Superbabies:Baby Geniuses 2. On paper, it doesn't look so bad, it has a great cast including beautiful Kathaleen Turner, Christopher Lloyd who is a lot of fun in pretty much everything he's in and the late Dom DeLuise. If only, if only it had a decent enough script and a good enough plot. However, the film is severely lacking in both areas, and makes a waste of those truly talented actors.\n\nThe script is just awful, and doesn't give anyone enough to work with, and there is no originality or sophistication. The story is one that has been done before and better about a nasty children's magnate who is carrying out tests on a host of brainy little children on the premise that they can speak in a secret language. Bob Clark's direction is very unfocused throughout, and doesn't improve whatsoever. The camera-work is rushed, and the slapstick is uninspiredly staged. In fact, if there was a redeeming quality, the soundtrack was okay to say the least.\n\nThe performances are disappointingly poor, and they are not helped by the lacklustre direction and the witless script. To be honest I found triplets Leo, Myles and Gerry Fitzgerald very irritating as the twins who try to outmatch Dr Kinder. As for Turner, this has to be a career low for her. This is a shame, because she is so beautiful and talented, but her strengths aren't even put to use here and she does overact quite wildly. Christopher Lloyd usually excels in roles similar to the one he has here, but he looks embarrassed here and looks as though he wants to get it all out of the way. And Dom DeLuise? For such a talented and versatile actor like DeLuise, you would expect a lot from him. But his part is so badly underwritten that he comes across as wasted.\n\nAll in all, sorry but I didn't like this movie. Even with such a wonderful bunch of actors, their talents are all gone to waste with poor writing, direction and plot. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "claudemercure",
        "review_rating": "1",
        "review_title": "diaper gravy",
        "review_detailed_main": "Just what I always wanted: to hear babies recycle stale catch-phrases from other movies (if you just can't get enough of the words \"show me the money\", this is the movie for you).\n\nIt would be a waste of time for me to describe what is bad about this movie, because EVERYTHING is bad - the writing, the directing, the acting... This is the only film I know that causes actual physical pain. Don't be surprised if viewing of this film is followed by repeated fits of vomiting. By the time the phrase 'diaper gravy' was used for the third time, I realized that that's exactly what this movie consists of. The worst film I have seen in my life. And yet... as the worst movie ever made, it holds an undeniable fascination.\n\nI give Baby Geniuses a 1, only because zero isn't an option"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dwainegibson",
        "review_rating": "1",
        "review_title": "It makes me hate myself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Torgo_Approves",
        "review_rating": "1",
        "review_title": "Pain",
        "review_detailed_main": "Some people think they have experienced pain. They think their twisted ankle, broken jaw, urinary infection, or whatever petty affliction they're suffering from, is what pain really means. How I admire these misguided, blissfully ignorant fools.\n\nI can tell you without the slightest doubt that I'd rather have twelve urinary infections, both my legs broken and my nasal cavities filled with sharp, rusty needles that swung up and down every time I breathed, than watch the almost obscenely idiotic mess known as \"Baby Geniuses\" again. Ever had one of those days when you woke up to find that you had the bad hair day of the century, were late for an extremely important job interview, accidentally flashed the landlord and was evicted, and got dumped by your girlfriend? Watching \"Baby Geniuses\" is like that day - on drugs.\n\nDoes anyone with a three digit IQ actually find talking babies funny? I just think it's disturbing! I don't need to see some dude who has barely learned how to walk cracking pop culture jokes or repeating the term \"diaper gravy\" over and over again. Yeah, really great joke guys, gets better every time I hear it. I think \"diaper gravy\" #451 was my favourite. Baby Sly told it with such passion and intensity, I got chills.\n\nI swear, some day those poor baby \"actors\" will find out that their parents let them be cast in this torture device, track them down, put them in a nursing home and never speak to them again! So not only will \"Baby Geniuses\" by default ruin your evening, it may also have ruined many people's lives. Two birds, one diaper, you might say. I can only hope that the people who actually saw the SEQUEL to this crime against mankind and all that is holy were mentally stable enough to not break down completely. I swear one viewing of \"Superbabies: Baby Geniuses 2\" would undoubtedly send me straight into some padded room somewhere in a fancy jacket. There's only so much a man can take.\n\nIf you have an acquaintance you really, really, REALLY hate, this film is the perfect Christmas present. Christopher Lloyd must have been on drugs when he signed on. One more thing - if I never see anything as revoltingly disturbing as that giant baby robot again, I will die happy. Avoid."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dylman91",
        "review_rating": "1",
        "review_title": "It's all true...",
        "review_detailed_main": "Everything you have ever heard about this movie is true. It deserves to be on the Bottom 100. The acting sucks, the plot sucks, EVERYTHING sucks! It's one of those things where it's unexplainable. When you watch a movie, you want to feel satisfied. You want to have a good time. There are a million movies that will give you this feeling. Baby Geniuses, however, is NOT one of these movies. It will make you feel ripped off and you will want an hour and a half back on your life. To keep it short: DON'T WATCH THIS MOVIE. You'll thank me. You will also thank the other one million people who told you not to watch it.\n\n1/10."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Nishtha-7342",
        "review_rating": "10",
        "review_title": "I just want to get the rating higher up",
        "review_detailed_main": "This movie is not great but it is funny and light. It is watchable and basically I am really attached to this and Baby's Day Out because of fond childhood memories. So I am trying to take a stand for the 90s kid who loved Sly and thought he was the coolest dude in the world, followed by Baby Bink who is NOT A REGULAR BABY. The movie isn't all that bad I don't know why it rates so low. It isn't anything spectacular but it is nice."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "EmperorNortonII",
        "review_rating": "7",
        "review_title": "Silly, But Not That Stupid",
        "review_detailed_main": "\"Baby Geniuses\" is a movie that can be best described as a live-action cartoon. It's certainly not cinematic perfection. Some people have said it's idiotic. But in my opinion, it's not that stupid. It's just very, very silly. You just have to enjoy this sort of movie to not hate it. There are several big name actors appearing; Kathleen Turner, Christopher Lloyd, Dom DeLuise and Kim (\"Sex and the City\") Catrall. There aren't any memorable performances, though. The main characters are the babies, and their cartoonish hi-jinx (even if the hi-jinx doesn't always work). \"Baby Geniuses\" is clearly not for everyone. It's just for the few who can appreciate it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "This movie is pure diaper gravy...",
        "review_detailed_main": "The film is about a crazy lady and her henchmen who are trying to create super-genius babies in controlled laboratory conditions. At the same time, identical twins are being raised outside the lab in order to determine if Dr. Kinder's (that's a subtle name) teaching methods create significantly smarter babies. But, one of the babies in particular is a lot smarter than the Doctor and her henchmen and spends much of the movie hiding or attacking these folks--in a much-dumbed down version of \"Baby's Day Out\". And, when the super-genius baby meets up with the identical twins, he mobilizes them into an elite fighting force.\n\nThere are several types of bad movies. One are the Ed Wood-style bad movies such as \"Manos Hands of Fate\", \"Eegah!\" and \"The Beast of Yucca Flats\". They are ultra-low budget and can't help but suck. With absolutely nothing going for them, you expect these movies to be terrible and usually they're a lot of fun to watch because they are so ineptly made. The second are movies that are vacuous but have reasonably large budgets, such as the awful \"From Justin to Kelly\", \"Car 54 Where Are You?\" and \"Disaster Movie\". These are occasionally watchable but generally hurt your brain with the stupidity of it all...and they can't blame the budget for the film being that bad! The third type, and \"Baby Geniuses\" is chief among them is like the second--there is a reasonable budget BUT the films manage to do something normal bad movies don't--they are so annoying, so grating that you want to hurt those responsible for making them (please don't...no matter how tempting it might be)!\n\n\"Baby Geniuses\" is a terrible film that made me ill just to watch it. About the only film that caused as intense a visceral reaction was Jerry Lewis' \"Cracking Up\". With respected and semi-respected Hollywood talent in the film, the only thing that might explain their being in this crap-fest is if the film makers had kidnapped loved ones in order to force people like Kathleen Turner and Christopher Lloyd to star in the movie! Why? Because the basic idea is so dumb and so appealing, you can't see how the actors would have agreed to be in the film (as for Peter MacNicol and Dom DeLuise, this IS a story right up their alley and I can see why they appeared in this film). Plus, even if the actors weren't turned off by the story idea, the dialog must have shouted \"Suck-Fest\" as soon as they saw the scripts! Phrases such as \"diaper gravy\" (poop) pepper the film in a pathetic attempt at humor. And who could think that the following dialog is funny or remotely appropriate for all audiences?\n\n1st Baby--\"Take off your clothes\". 2nd Baby--\"Well at least you can buy me dinner first\".\n\nHowever, if you think watching toddlers do kung fu, punching adults in the crotch (too many times to count), dancing to disco tunes, or many pop culture references, then this film is for you--as is it's 'hilarious' sequel (yes, there IS a sequel--making me wonder a loving God could allow such a film to be made). Imagine, if you can, \"Look Who's Talking\", \"Baby's Day Out\", \"The Great Escape\" and \"102 Dalmatians\" all merged into one film and written by particularly stupid and obnoxious 6 year-olds--this is \"Baby Geniuses\"--and it clearly has earned its place on IMDb's esteemed \"Bottom 100\"--the 100 lowest rated films of all time.\n\nBy the way, although this was far from the worst part of the film, if you saw this pile of diaper gravy, didn't you wonder how it was that the super-super genius baby was able to make all these pop cultural references? How could a kid raised in perfect conditions in the lab know about the Three Stooges, \"The Jerry Springer Show\" or \"Terminator\"?!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Writer_Commentary",
        "review_rating": "",
        "review_title": "I Liked It",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ghoul-3",
        "review_rating": "1",
        "review_title": "I wanted to feed these babies one by one to a Great White.",
        "review_detailed_main": "The guy that gave us the wonderful \"Christmas Story,\" the absolutely terrifying \"Black Christmas\" and the rollicking \"Porky's\"offers up a big piece of post-holiday sludge about experimental babies and the evil high-tech scientists that are raising them. The premise is that babies speak a language that if deciphered would provide the answers to the universe. While the adults on the screen are spared the thoughts and clever dialogue of the little tykes, the movie audience isn't afforded the same luxury.\n\nMovies about babies aren't supposed to make you hate the babies, but in Bob Clark's new comedy that combines the worst elements of \"Look Who's Talking\" and \"Home Alone,\" I began to truthfully despise the wise-cracking karate-kicking diaper-clad little urchins within three minutes of the opening credits. In all fairness it's not the babies fault that they're about as lovable as a hang-nail, it's an absolutely inane script filled with stupid dialogue, tired slapstick and over-driven campy performances by the likes of Kathleen Turner, Ruby Dee and the always exciting Dom Deluise. Those factors and digitized little mouths spewing cliched movie dialogue, statements like \"ooh...diaper gravy!\" and yes even some bad words, makes for the most agonizing 94 minutes I've ever spent in a movie theater. There may be something far more unsettling and scary in the upcoming new millennium than just the Y2K bug...\"Baby Geniuse's 2!\"'"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "susanbassplayer",
        "review_rating": "1",
        "review_title": "On a Bet!",
        "review_detailed_main": "Much has already been said about how truly rotten this movie is. So I'll spare you details in my review.\n\nI watched this movie on a bet. That is to say, I bet my twin brother $20.00 on something unrelated and lost. I was broke at the time and couldn't pay him until payday. So my twin bro offered me this: Watch BABY GENIUSES 1 AND 2, back-to-back and start-to-finish and he would forgive me the debt.\n\nI should have paid him the money. I could have stretched my grocery money and ate noodles the rest of the week. See, I adore my bro. He's a great guy, but he's awfully slick with things like this and I should have known better. These two movies were the most appalling things I have ever scene (and I'm a HUGE fan of PLAN 9 FROM OUTER SPACE)."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Wulfstan10",
        "review_rating": "1",
        "review_title": "This is really bad.",
        "review_detailed_main": "I can freely say, without reservation, that this movie is simply dreadful. It is among the worst out there, and I have seen some pretty bad films.\n\nThe whole premise is cretinous and it is executed very, very poorly. The acting, along with everything else, is terrible and the \"humour,\" such as it is, is mostly moronic. There are occasional flashes that try to approach slightly entertaining humour, but overall it is all so cretinous and poorly done that that it is not even funny. The result is excruciatingly tedious. Even as a kids' film it is worthless.\n\nI can't imagine why Christopher Lloyd, normally so good, would have done this film. But, even the greatest actors sometimes get involved in utterly terrible films."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Baby Geniuses",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "About as awful as you'd think",
        "review_detailed_main": "This is one of the most legendary bad movies ever made. It's become iconic with how terrible it is. The good news is that at least it isn't worse than what most people say. The downside is that that's still very low. There was ONE good joke in this movie about how they make the police come to Babyco and that's IT. This was made by the director of \"A Christmas Story\" and it just so happens this one takes place around Christmas too.\n\nThis movie tells the story about these evil scientists who discover that babies have their own language. After awhile, they \"cross over\" and lose all of their genius. The most insane thing is that there is one scene where a baby is actually able to speak intelligible English as babies apparently know every language out there or somewhere. A main conflict is that they can't talk to their parents, even though they SHOWED that they could speak the same language as adults! Babies are apparently also able to hypnotize adults in their sleep. You have to admit that is completely stupid.\n\nIn about six minutes, they literally say \"Diaper gravy\" four times and there is absolutely no variant said at all. This is easily the worst movie for Channel Awesome Month and it's a shame it came out shortly after \"The Big Lebowski\". That's a better movie to show to your kids and that has over 200 f-bombs in it! There's like six minutes of nothing but babies just jumping around as they are apparently training. There's a baby that wanders onto the road with cars and nobody notices, yet when the baby wears a disguise on the street, somehow everyone notices him. It's hard to even believe this movie even exists, as I couldn't see how anyone would ever find this entertaining. 1/2*"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ArchieLaSalles",
        "review_rating": "1",
        "review_title": "Stupefyingly bad",
        "review_detailed_main": "I took my then 6-year old son to see this as part of a kids' summer movie series. Five minutes into this movie, and I could literally feel my IQ falling and that I was slipping into a coma of stupidity, but I thought, if he likes it, I'll stay here and sit through it for him. Maybe this humor is perfect for a preschooler.\n\nA little farther in, I started to worry that the movie might be damaging his developing brain, so I kept an eye on him to see his reactions. It turns out that he thought it was awful too. I asked him if he wanted to leave and go somewhere (anywhere!) else. To my relief and pride, he said \"yeah, this movie is really dumb.\" We escaped with our sanity intact, and I vowed never to watch another movie with the word \"baby\" in the title for fear that it might even be 1/100th as bad as this one.\n\nThis is truly the WORST.MOVIE.EVER."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "BevansDesign",
        "review_rating": "1",
        "review_title": "What crap.",
        "review_detailed_main": "I don't really feel like saying too much about such an awful movie, so I'll just say this:\n\nDo NOT rent, buy, go out and see, or otherwise view this movie in any way. It is PURE CRAP. Not even Christopher Lloyd was good in this movie. That says a lot in my mind. He's supposed to be a HERO, not a villain. Like in Back to the Future.\n\nI repeat: AVOID THIS MOVIE."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "bbwoof9",
        "review_rating": "10",
        "review_title": "Adults shouldn't be rating kids films",
        "review_detailed_main": "I remember watching this movie as a kid and I loved it.\n\nDo adults not realize that kids films should be held to a different standard? Or are the people who gave this movie a poor rating have a bad childhood and hate this film for reminding them of it? If so, I'm so sorry."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "sportsloverlane",
        "review_rating": "7",
        "review_title": "Pretty good film",
        "review_detailed_main": "I liked this film for the most part. I did think that the plot was kind of weird, but the babies were really cute. I didn't like the fact that the two year old babies swore, but they did a great job on the special affects. It was a pretty good movie. 7/10."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "rgachile-1",
        "review_rating": "1",
        "review_title": "the first time that I had to GET OUT of the cinema room before movie end",
        "review_detailed_main": "the first time that I had to GET OUT of the cinema room before movie end!!\n\nI was late for a movie, and my friends and I have not other option that this movie.\n\nI just resisted 15 minutes of this \"movie\", and...\n\nI had to run outside the room with my friends!!! WORST FILM EVER WATCHED BY ME IN A CINEMA ROOM!!\n\nThe best part of the movie were the trailers!!!\n\nNow, before going to the cinema... I read the comments about the film.\n\nThat's the better way to enjoy a movie.\n\nBest regards"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "wobert12",
        "review_rating": "",
        "review_title": "Don't hate me, but I liked it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "MovieAddict2016",
        "review_rating": "1",
        "review_title": "Maybe Not So Genius After All?",
        "review_detailed_main": "\"Baby Geniuses\" catches a rare glimpse of Christopher Lloyd in a bad acting rut. I never would think it possible after watching \"Back to the Future\" or \"Taxi,\" but 'tis true.\n\n\"Baby Geniuses\" is one to miss. If you liked this movie, you'll lo-o-ove \"Kazaam\"!\n\n1/5 stars -\n\nJohn Ulmer"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "himikey",
        "review_rating": "2",
        "review_title": "\"Howard the Duck\" of the 90s",
        "review_detailed_main": "This movie is painfully unoriginal and sickeningly unfunny. Your bucket of movie popcorn will draw more laughs, while also being less irritating. Only for the very young and/or the easily amused. My vote? 2/10"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "donlhumphries",
        "review_rating": "3",
        "review_title": "Boring...zzzz",
        "review_detailed_main": "I bought this movie (unseen) cos my favourite actress, Kathleen Turner is in it - but I've only managed to see half-way through, up till now. It's so boring! I'm usually easily pleased where movies are concerned, and hate to condemn any film, cos I know how much work is involved by well-meaning people. It may be that the rest of the movie is alright, or improves; but maybe not. My ex-rental version's price went down from $14-95 to $7-95 to $4-95 - and that says it all! Score: 3 out of 10 (and that's pushing it!)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "walter-17",
        "review_rating": "3",
        "review_title": "Wake me when it is over",
        "review_detailed_main": "My 9 year old liked it. I fell asleep several time in this movie.\n\nThis was one of those movies where everything that you saw in the commercial (trailer) was all that the movie had to offer.\n\nIt's like the TV version of Honey I Shrunk the Kids, but more boring.\n\n3/10"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Newsense",
        "review_rating": "1",
        "review_title": "Baby Idiots",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Quinoa1984",
        "review_rating": "3",
        "review_title": "Stand in awe",
        "review_detailed_main": "I say stand in awe, because every film student will want to see this. Not because it's entertaining or humorous or will help them out, it's because this film stinks like the babies diapers. I don't think a worse film has come around in quite a long while. But, for film people, this is good so people will know how to learn from their mistakes (or want to see Dom DeLuise). The plot is ridiculous, the characters are stupid, and the script has more flaws than Mickey Rourke. Don't get me wrong, I liked Bob Clark's Porky's (it's one of the funniest teenage films ever). Kids will hate this, parents will throw up after seeing this, and film students will think this film is a brilliant example of how they can make their s***y films better after seeing this piece of crap. F (lowest rating)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "mattb-8",
        "review_rating": "1",
        "review_title": "Baby Geniuses is one bad movie",
        "review_detailed_main": "Baby Geniuses is an utterly charmless movie about babies who talk in smart-aleck sound bites and take on adults in physical action scenes. It's neither genuinely funny nor entertaining, unless babies left unsupervised to run amock with digitally-altered potty-mouths is your kind of entertainment.\n\nThe story plots good against evil, but even the standard Disney-type formula outclasses this witless flick by light years. This is a bad movie.\n\nBaby Geniuses is about 18-month-olds, played actually by three- or fouryear-olds, and voiced-over by six- or eight-year-olds. It might have been a much better movie simply if adult actors had voiced the baby characters, either in adult voices, or adults doing children's voices, ala The Rugrats. The young voice `actors' are a terrible choice, given that the voices-which emerge from bizarre, special-effects mouths- have to deliver the dialogue that awkward toddlers can't possibly otherwise emote.\n\nIn a real movie, focusing the camera on the reactions of the supporting actors in a scene might propel the story as well as well as the actor who's speaking. Baby Geniuses attempts to pass off this technique, as the majority of the talking-baby scenes show the back of the talking toddlers' heads. But the other children in the scene who are supposed to be listening and reacting are looking around puzzled and distracted, just like real toddlers do.\n\nThe real reason we see the backs of so many talking heads undoubtedly was to save the effort of having to create the digital mouth movements for those lines. Unfortunately, the shortcut is painfully obvious.\n\nSome of the movie sets, especially the indooor theme park created by the villains, (played by Kathleen Turner and Christopher Lloyd) to prove their superior `Kinder' child-rearing method, look high-budget indeed.\n\nBut despite slick sets, the movie was technically awful too. I noticed the same extra (an easy-to-spot, attractive blonde woman wearing the same outfit with purse on her right shoulder) walk through scenes in the same shopping mall again and again, even though the scenes span two separate days!\n\nThe acting of the `adults' was just as atrocious, especially the dim but psychic father played by TV's Ally McBeel co-star Peter MacNicol, speaking via mobile phone to a brainwashed employee who had kidnapped the children of their family-owned day care facility, instead of being outraged or even alarmed, he courteously sets the phone down in dumb silence.\n\nUnless you or I were drugged up to obliterate the talking baby voices in our heads, we could have ad-libbed something for better effect in that scene, which was just one of many bad ones for MacNicol. This kind of bad acting reminded me of a twenty-some year-old B movie called H.O.T.S., where the lame plot and worse acting at least more honestly served up that movie's real purpose, which was campy T&A. This movie doesn't have as good an excuse.\n\nBut let's get real: this movie wasn't made to please critics, it was made to appeal to the 10 year-old and under movie-going crowd. And to be fair, the eight year-old boy we saw the movie with walked out of the theater saying it was as good as A Bug's Life, and his high bar for kids movies, The Rugrats Movie.\n\nBut any conscientious parent should be offended by the several scenes of adult humor in Baby Geniuses. In one scene the baby hero needs a new disguise, and he instructs a baby girl in her stroller to take her clothes off. She says something like `Couldn't you at least buy me dinner first,' and the scene plays out to where he's wearing her clothes, she's smoking the cigar from his previous disguise, and she pleads `Please call me. I'm listed.' Is this kids' humor?\n\nBad movie stats start to pile up: Christopher Lloyd's character hardly shows up as the mastermind Kinder. More time must have been spent on his unusual hair and makeup than he is on screen. Any washed-up character actor would have been more right for the part of Kinder as played to Turner's empty villainness.\n\nAnd what's going on with Lloyd's carreer when his considerable talent (think Taxi, Back to the Future, even his manic My Favorite Martian) is wasted on those omnipresent 10-10-fillintheblank long distance telephone commercials, and now this movie.\n\nFinally, the movie includes an inexplicable salute to country singer Randy Travis, who sticks out like a sore thumb (or perhaps steals the scene, I'm not sure which) in a cameo appearance, and then reappears at the end of an already too-long movie (almost two hours for cripe's sake) to sing a sweet song about kids, over insufferable slow-motion clips of the movie we just saw, which isn't even over yet. You could almost hear the collective gasp of frustration in the theater as this weird music video unmercifullly delayed the ending credits.\n\nSave your money, rent an old Star Wars movie, or better yet, stay home and have game night, and wait for Star Wars Episode One to come out this Spring."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "joseph.kelly2",
        "review_rating": "10",
        "review_title": "Kid proxy vote",
        "review_detailed_main": "First of all, let me just say that these comments are via my 7 year old son who didn't appreciate the fact that Baby Geniuses was on the list of the 100 worst movies -- and he figured that the vote tally was largely a reflection of adults who just didn't get it!\n\nAccording to him, Baby Geniuses is funny and he likes funny stuff. So it's one of his favorite movies. It's a good story."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "srmccarthy",
        "review_rating": "6",
        "review_title": "Stupid? <yes> -> INTENTIONALLY!!!",
        "review_detailed_main": "I saw this movie on the big screen and had no opinion one way or another about it. After 3 years, while searching for the work of \"Seth Adkins\" I came across this movie, and the many negative comments about it! So, I rented and watched the video to see what I missed that so many found to give it such a bad rating and review. My findings are as follows:\n\nThis movie is exactly what it is presented as!\n\nPlease note the following:\n\nIt was presented as a comedy. (Is is not?). It was presented as a silly, slap-stick comedy (Is it not?). It was NEVER presented to be an academy award winner!\n\nI personally do not care for slap-stick humor, but I have to admit that this movie was somewhat enjoyable to me.\n\nI respect Leonard Maltin's opinion about movies, as most of the time he is right on the money. However, this is one of the few times I have to disagree with him! Why did Leonard Maltin give the movie \"Fire Down Below\" 2 stars and this one BOMB status?? \"Fire Down Below\" is supposed to be a \"serious\" action/drama and Leonard Maltin himself admits that it is \"Laughably bad\"! However, here is a move that is supposed to be funny, silly, stupid (whatever way you put it), and he dumps all over it for being exactly what it was promoted to be!!!!!!!!!\n\nNo, I do not believe this is one of my favorite movies, but I believe that it has been given a very poor review, based upon many people who desire a more mature script. It is as entertaining as just about any Slap-stick comedy I have ever seen!\n\n(Please note: There is some language and (very little (almost un-noticeable)) sexual suggestion that you might find objectionable or object to allowing young children to witness)!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Tardis1977",
        "review_rating": "1",
        "review_title": "Bad! Bad! Bad!",
        "review_detailed_main": "Awful! Bad! Awful! Terrible! Mon Dieu! Sacre Bleu! Horrible! Upchuck! Why did Kathleen Turner do this movie. She must have been really desperate to take this one. So must have Christopher Llyod, Do Not! see this movie. I repeat if someone has this playing Run! don't walk but Run! to the nearest exit before you shoot your eys out! I can't believe I had to sit through this piece of garbage my little cousins love this piece of sh*t, tg their parents unplug the TV whenever this is on and blame the cable company. I don't have anything else to say about this crap but I have to make 10 lines!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Bsbgirl7",
        "review_rating": "",
        "review_title": "Hey I love this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "howgooey2000",
        "review_rating": "3",
        "review_title": "A terrible TERRIBLE movie",
        "review_detailed_main": "the only reson they made this movie was to show off their special effects which suck now compared to anything else basiclly a scientest finds out babys speak their own language and are actually smart but this scientest is DUN DUN DUUUUN EVIL so the babys have to stop them (by the way now suddenly the babys can talk to the adults some how) which they do in some stupid unbeliveable way that would only happen if the \"evil scientests\" were the stupidest pieces of crap ever to walk the face of the earth and I almost forgot Once you turn 2 or 3 or something you forget about having your own language and everything of so all in all:\n\nno plot + no effects +no acting= DON'T SEE THIS MOVIE\n\nPS. I saw this movie 4 years ago so I might have been going a little easy on it\n\nPSS. I dont like saying PS. so im never going to say it again\n\n\n\nwho the hell says ps anyway"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "octave99",
        "review_rating": "1",
        "review_title": "zzzzzzz! Don't wake me, so I never have to see this dreck again.",
        "review_detailed_main": "This movie does not deserve a rating at all. Well, maybe negative infinity or something.\n\nI fell asleep several times during this movie (must be a light sleeper to have actually awoken at all from this Baby Geniuses invoked comatose state).\n\nThe theatre ushers were gracious enough to sweep me out with the half empty popcorn and drink containers. Shudder to think what might have happened if I awoke during a second consecutive screening of... AAAAAAAACK!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "chet19",
        "review_rating": "1",
        "review_title": "What a terrible piece of crap",
        "review_detailed_main": "I took a date to see this piece of crap movie because my friends worked on it. I made my friends give me my money back. Nuff said? There were 6 people in the theater at the beginning. 2 of them left after 20 minutes. My date and I and the other 2 leftover people stayed and laughed...at each other's jokes. We did out own personal MST 3000 on this movie"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "kyle2k",
        "review_rating": "1",
        "review_title": "Ouch!",
        "review_detailed_main": "This film was very painful to watch. And to think it actually made money. I took my 9 year old daughter to see it in the theater so I was completely captive throughout the entire movie. This may be one of the worst movies ever."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "montanaj0e",
        "review_rating": "1",
        "review_title": "Who allowed this movie to be made?",
        "review_detailed_main": "Seriously? Who? Its about abunch of \"Geniuses\" that happen to be babies saying cheezy one liners. The only part that was funny was......well now that I think about it, there is no funny parts! I'll tell yah \"Lobster Man From Mars\" was 20 times better then this."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Bobox",
        "review_rating": "1",
        "review_title": "My wife owes me big time",
        "review_detailed_main": "I went to see this because it was her turn to pick and she owes me big time. I think an equivalent payback might be Jerry Springer's Ringmaster or anything with Bruce Willis (she hates Bruce Willis). It should be allowed to cast negative votes for this. What was Christopher Lloyd THINKING????"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "vincent_schawl",
        "review_rating": "1",
        "review_title": "Baby Crap",
        "review_detailed_main": "We had to watch this movie for the end of the school year, and we'r in 8th grade, what was our teacher thinking putting us through this crap they call a movie, I couldn't look at the screen without getting a quivery stomach from its stupidity, I tried to sleep during it but the words were so annoying all I could do was clench my fists and think about how horrible the movie was, the lipsyncing was horrible, and the computer generated dancing baby was pathetic, Christopher Loyd has a lot more potential then this crap. The jokes the babies always said were horrible, and the stupid way the babies could hurt the adults was completely dumb. No one in my class could keep their heads up long enough to watch this crap, I'm glad the bell rang before the movie even ended because i think I would have keeled over, this movie almost made me sick. Two thumbs down, Way Down!!!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "yomama_movieman",
        "review_rating": "9",
        "review_title": "I loved this movie!",
        "review_detailed_main": "I don't understand why people hate it! I enjoyed it! I thought it was funny when the baby did the Disco dance. I laughed! And i though SOME of the effects were OK. Some were fake but I still enjoyed it. I would rate it a 4 1/2 out of 5, I thought it was a good family movie also."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "AmysLand",
        "review_rating": "7",
        "review_title": "Slightly Surreal - Cute Comedy",
        "review_detailed_main": "Although this movie was surreal in many respects I found it very funny. It is a cute movie about what a babies life might be like. Don't take it too seriously, it does have its bad points. For example, the beginning was a little like Toys, but it got better. Overall it's a good movie to see if you are looking for an escape from reality. Don't analyze and enjoy!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "No Genius Behind This.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Ms. R",
        "review_rating": "",
        "review_title": "\"Cute\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "rcolgan",
        "review_rating": "2",
        "review_title": "This film was painful...",
        "review_detailed_main": "Well, if you're reading this you've already read the title of the film. Do you honestly need anymore to tell you how bad this film is? Just in case you weren't tipped off by the title, it sucked. But in fairness how do you make that premise work? Baby Geniuses is never going to be the next Citizen Kane any time soon is it. It sounds more like a writer wanted to make his child into a movie star and used this film as an excuse. I largely watched it because I had a morbid curiosity to see it. It was that same kind of curiosity that makes me wonder just what it would feel like to put my hand on an open flame. I knew I would go through pain but it will give me something to talk about to you psychiatrist.\n\nJust like any film, this does have a plot. A dumb plot, but a plot none the less. It follows the premise that all babies are born with intelligence far beyond that of any adult, but that they lose this intelligence when they get older. (I said it had a plot, I did not say that it made sense\u0085) In one evil lab then they are doing tests to prove that babies can talk by separating twins with one being raised in a lab and one being raised in a regular home environment but are never allowed to meet as it would tamper the experiment. But through the power of bad story telling the child escapes and the wrong twin is brought back to the lab.\n\nFrom this premise alone I begin to wonder what producer saw this script and actually wanted to spend money to make it. As it turns out it's Steven Paul, who is also the writer of the film and the same producer who helped us see Ghost Rider: Spirit of Vengeance. He seems to specialise in films that must be trying to be bad. But the problem is that his films are not \"so bad they're funny\" where you laugh because of how stupid the film is. Instead they're just very unpleasant films to watch. In fact, watching this film I didn't laugh once. Not once. It seems to have confused the idea of being annoying with that of being funny. Otherwise I would have no idea of why they would put so much noise of baby giggling in the film. When it's your child giggling you may enjoy it because it's your child, but on screen it is a hair pulling annoyance for all ages.\n\nAdded to this is that the film is also very creepy, with the babies lip syncing in this being comparable to the last Twilight film (not quite as creepy as that one but we're in the same area of creepiness). And that isn't the only off putting element of this film. When you watch it then you have to witness the awkwardness of extreme close ups, a baby dancing like he was in a 70's film and terrifying giant robot mechanic babies. For the most part a lot of the film could probably be cut out of the film and put into a horror movie, because I certainly felt closer to being frightened then I was to laughing.\n\nAnother annoying thing that this film has is Christopher Lloyd. In the film he is neither good nor bad. But I know Lloyd and he is capable of doing so much more than some of the garbage films he's done. The thing is this isn't even the worst film he's been, also appearing in Foodfight and Piranha 3d. I'm guessing he gets paid for it, but he's Christopher Lloyd god damn it! He's the Russian who tried to kill Anastasia! The scientist who created time travel! The killer who framed Roger Rabbit! He can play so many memorable roles, but keeps wasting his talent on films that are beneath him! He's a great actor and I can only hope that he will stop choosing such awful films...\n\nBut Lloyds presence in the film is not the most upsetting thing. The saddest part about this film is that, adjusted for inflation, it earned over 50 million at the box office. People paid money to see this in a cinema. I get watching a film to laugh at how bad it is, but I really question the human race as a species when in a month where films like Lock Stock and Two Smoking Barrels and Analyze this come out people pay this much money to see a film like this. Worse yet because it did well at the box office, this film got a sequel. Yes, we live in a world where Dredd is a standalone film and Baby Geniuses gets a sequel. I have yet to see Superbabies: Baby Geniuses 2, but somehow people say it is worse than the first.\n\nBut I'm getting off track, so I'll leave you with this warning. This film was painful to watch and exists for no other reason than to be creepy and annoying. And if you have a twisted mind and get a kick out of listening to babies scream and laugh for an hour and a half then this could be your film. But if not, the only way you could possibly gain pleasure from this is by mocking it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "bobbyt",
        "review_rating": "1",
        "review_title": "Not a kids movie",
        "review_detailed_main": "I'll start with the positive. Watching the facial expressions and movements of the kids was unreal. How did they get kids so young to cooperate and play out these scenes? How much of it is CG and how much is luck of the shot? Impressive if you have never seen such a thing before.\n\nI began to watch this movie with my nephew on DVD. He definitely didn't see the rest of it. The crude dialog coming out of baby's mouths and the endless amount of foul language in the film from the adults-- including scenes in the presence of the children forced to me find something more suitable. It was just crazy. The story line that revolves around children and random jokes for kids clearly isn't aimed at adults. But the dialog is no where near suitable for kids. The other reviews go in depth about the script flaws more...\n\nBut the disappointments began before the movie even started. The first thing I noticed off the bat after hitting play was the film transfer was extremely bad. Washed out with film scratches and flaws galore. The compression on the DVD was the worst of it. I have honestly never seen such a poorly compiled DVD before. Fade to black moments in the film showed random huge purple pixels shifting at every key frame on a plain black screen. Some scenes looked soft almost to the point of being out of focus, audio was a bit over-compressed and very boomy sounding. How can a 13 million dollar film backed by tristar have this poor post production, not to mention who would pay 13 million to have this film made? Like all bad movies if you know what you're about to watch and are up for a cheesy flick it just might work. But consider this review a warning to parents and those who find mediocre quality DVDs unwatchable. Not what you'd expect to find on the shelf of a big name video rental store."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "mxw",
        "review_rating": "1",
        "review_title": "Taste precludes my using the appropriate words.",
        "review_detailed_main": "This is the most cynical, abusive, manipulative, poorly executed, trite piece of garbage I have ever seen, bar none. And I include Jaws the Revenge. Pause. You may now pull yourself up off the floor -- I know that's a shock to your system.\n\nThey substitute A MIDGET'S BODY and superimpose a BABY'S HEAD to show a baby \"dancing.\" They use a midget's hands to simulate the supposed dexterity of the main genius baby. Dirty AND poorly manicured, I might add.\n\nThis move is scarier than any other I have ever seen. The baby talking effects make Keanu Reeves look positively lifelike. (Another shock, I know. Take a deep breath, and continue if you dare). It is horrible, unfunny, and -- as previously pointed out, the worst crime of all -- not even interesting as camp.\n\nI am very worried that this got such a high rating (2.8 as I write). I am curious as to how IMDb could allow a selection as *high* as 1 (must be a bug, folks, please check this out). The upper range of this movie can only start at the kind of negative numbers more usually associated with the ambient temperature of Pluto, as measured in degrees Fahrenheit.\n\nI grieve that I also inflicted this abuse on my innocent, unsuspecting children -- whom I have since carefully observed for any symptoms of Traumatic Stress Disorder. So far, so good. I am surprised at their (children's) resilience. I have not fared so well."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dgs",
        "review_rating": "2",
        "review_title": "Huh?",
        "review_detailed_main": "Is this movie supposed to be a joke? Or just a mean trick on the unsuspecting audience? But believe me, i have seen worse than this moronic combination of Look Who's Talking and Baby's Day Out. Like we needed another one."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "foxxesp",
        "review_rating": "3",
        "review_title": "Didn't age well...",
        "review_detailed_main": "I used to like this as a dumb kid. But now viewing this mess of a movie as an adult, it's infuriating. I don't know how a few people I've seen defend this with \"It's just a kids movie!\" when there are many superior kids movies like Pixar movies and Dreamworks movies.\n\nDon't show this to anyone above 5 years old."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "superracingriley",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "I really don't understand why people actually like this movie. I mean, it's full of dumb and uninspired bathroom jokes that fall flat on their face! and why does one of babies tell a female to take her clothes off? that is unnecessary and disgusting. Never watch this movie"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "OriginalMovieBuff21",
        "review_rating": "1",
        "review_title": "Now I have never seen that bad of a film",
        "review_detailed_main": "Baby Geniuses is by far one of the worst movies I have ever seen. Why would any director want to make a film like this and then make a sequel. He should be fired. They should get Donald Trump in there and fire him. This movie was so terrible. The acting, the dialouge, and definitely the plot was terrible. I can't stand this film. I'm never going to see this movie again in my life. Terrible, just terrible. Write me a ticket when were done with these pathetic films. Sometimes, directors are going to have to realize what there doing to their films because if they are trying to make movies like these there never going to big directors. These movie was flat out worthless and neck grabbing!\n\nHedeen's outlook: 0/10 No stars F"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "alicecbr",
        "review_rating": "9",
        "review_title": "YOu've got to have babies to love this",
        "review_detailed_main": "Maybe I'm addled, but I wasn't expecting \"Julius Ceasar\" and Laurence Olivier. This was hilarious, especially since I have a bunch of baby grandchildren, some in that 'before we cross over' area. Jung thinks we do have a collective unconscious, as there is some idea that pre-literate babies have knowledge that the conscious suppresses once they start to speak. This movie explores that premise, but in a hilarious over the top way. Katheryn Turner makes a great baby abuser, tyrant, villainess: Cruella de Ville of the psychology world.\n\nGet it and let the little toddlers watch it. Watch THEIR expressions as the babies talk to one another. That's an event and a great interactive situation in itself. A lot easier than talking with a teen-ager.\n\nJust don't expect great writing or great acting and you won't be disappointed. The special effects are GRRRRRREAT, though."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "fullhouseo",
        "review_rating": "6",
        "review_title": "You people never get it!",
        "review_detailed_main": "See, I watched this movie when I was a kid and loved it. I watched it again today with the full knowledge that everyone hates it. The first review I saw on here, this guy was watching it with his girlfriend that he said broke up with him after seeing this. Was that a joke? This is a children's film! FOR KIDS! You can't compare it to Oscar winners, you can't even compare it to movies you like. Are kids shows actually crap or are you just not their target audience? Should Blue's Clues be compared to The Sopranos? Use your heads, people! This movie was cute. Nothing special, but certainly not the worst. My opinion: either think like a child when you watch this or leave the criticism up to your kids. I thought that was obvious, guess not."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "unforgivenmaster737",
        "review_rating": "1",
        "review_title": "I actually puked while watching this film.",
        "review_detailed_main": "Sure, you could add the fact that I was sick too, but seriously... this movie sucks.\n\nTo tell you the truth, I had some doubts about even writing this... I still have inconceivable nightmares about just how bad this turkey is. And to top it off, they actually had the balls to release a sequel.\n\nI've seen some terrible movies in my life... \"Super Mario Bros.\" comes to mind instantly... but this is the one film that I could never conquer. I still to this day cannot for the life of me watch this film under any circumstances. It really is the worst movie ever made. That's the most honest statement I've ever made in my entire life, and I wholeheartedly mean that.\n\nAnyways, \"Baby Geniuses\" has four... count 'em, FOUR washed up actors. Not only that, they were actually good actors at one time. Christopher Lloyd, Kathleen Turner, Peter MacNichol and Dom DeLuise all showed up, but somehow forgot to act. Wow, and I thought \"Rat Race\" had it bad...\n\nYeah, so the entire movie revolves around the evil corporation that Lloyd and Turner run. Apparently, all babies can talk in a secret code, and it's their job to try and break it. They have a baby, nicknamed \"Sly\", I believe, and he's apparently really super smart. Well, security's not so good around the corporation, so Sly escapes and uses his - i'm not joking here - mad karate skills to finish his victims off. And, SURPRISE! He has a twin, whose parents are MacNichol and Kim Cattrall.\n\nHoly crap, it BURRRRRRRRNNNNNSSSSSS!!!!!\n\nAnyways, yeah, you already know the ending. MacNichol and DeLuise stink up the rest of the movie with bad acting. Of course, with a script this bad, they could have done a lot worse. And, like there was any doubt, the obnoxiously stupid parents beat the obnoxiously stupid evil overlords. Jesus Christ, avoid this movie just like your mother-in-law: at all costs."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Kris-11",
        "review_rating": "",
        "review_title": "Wonderful for kids and adults!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "creepy giant baby is only the start",
        "review_detailed_main": "Twins Sylvester and Whit have been separated since birth. Sylvester is raised in the lab to be a super baby under Dr. Elena Kinder (Kathleen Turner)'s method. He makes a break for it out of the underground militaristic Babyco lab but he is caught by Dr. Heep (Christopher Lloyd). Meanwhile, Whit was adopted by normal parents Dan (Peter MacNicol) and Robin (Kim Cattrall). Dan is researching baby talk but Robin suspects Kinder of stealing from his work. Lenny (Dom DeLuise) is the bumbling handyman.\n\nWOW! That giant baby is incredibly creepy. Testing on babies is as disturbing as it sounds. I'm sure everybody on set knew how stupid and problematic this concept could be. The problem is that nobody figured out how to make it work. In fact, it seems they actively made it worst. Certainly, talking baby has worked in the movies before. This one makes no sense even with the simple movie concept. Tonally, it is both serious and stupid with non of it being funny. The most impressive part is making the kids talk. The CGI baby work is pretty good considering the era and eventually it becomes a thing in commercials. Overall, this is terribly misguided."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "A_Kind_Of_CineMagic",
        "review_rating": "1",
        "review_title": "Far from Genius!",
        "review_detailed_main": "This film is an embarrassment.\n\nTo see some cast members like Christopher Lloyd reduced to this is sad. The concept is dumb and badly executed with unfunny, silly and dull script.\n\nThe performances and the talking babies themselves are bad and overall this is worthy of its very low rating.\n\nNot genius, completely stupid."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ryangavalier",
        "review_rating": "1",
        "review_title": "This movie is terrible",
        "review_detailed_main": "I don't know how movies could possibly be so bad. I think this is probably in my top ten of the worst movies ever. The jokes are lame, the acting is terrible, and the lip syncing is horrendous. I think they did a better job making the animals talk in the live action Jungle Book. There should've at least been some clever lines of humor to make up for the other crappy things in it, but that was nonexistent. It is so bad it makes one want to die while watching it. Christopher Lloyd is also pretty awful in it, and he's usually a pretty good actor. The director was obviously not caring about quality at all when he made this movie. He figured the kids who watched it would be as dumb as the script. But that isn't true, because ever since I was young I found this to be horrendous. This movie should be much farther than 80 on the Bottom 100. I'd say more like five."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "SusieSalmonLikeTheFish",
        "review_rating": "1",
        "review_title": "Bad 90's movie to make fast cash off tacky kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Bingo84",
        "review_rating": "1",
        "review_title": "Inappropriate language ruins this movie, big time!!",
        "review_detailed_main": "Some puzzling questions about this piece of junk....\n\nAside from the horrible acting and awful plot, who was the 'genius' who decided to keep in all of the foul language? Do they know that 4 and 5 year olds will be coming to see this movie? Do they actually think that these kids and their parents approve of such words as 'ass', 'hell' and 'damn' all the time?\n\nCome on - who do they think their target audience is going to be for this film, teenagers and college kids??!!! These words could've been easily cleaned up with softer, more appropriate words. But nooooooooo.... they have to ruin it by leaving in all the 'potty mouth' words.\n\nYeah, I know the movie's rated PG, but the swearing in this film was fairly excessive for pretty young children. I've seen other PG movies with my 5 year old daughter, and they were never as bad as this.\n\nBEWARE>>>"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "_IG_Reddog",
        "review_rating": "1",
        "review_title": "Bring this sucker down. It doesn't deserve to be above the WORST MOVIE EVER!",
        "review_detailed_main": "Why? Because it IS the worst movie ever. This is only one of two movies I have walked out on. I was forced to sit though it. I left at the last 30 minutes without any notice and went downstairs to play sonic. Horrible effects, too much overacting, and terrible editing. Whats something good about this movie? Well, it is in color. WAIT, no! Psycho is in Black and White, and so is Young Frankenstein. O well, this move would get a 0/1 if possible. I give it a 1/10, cuz thats as low as it goes."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "gmberclark",
        "review_rating": "1",
        "review_title": "I want my 94 minutes of life back,",
        "review_detailed_main": "Sadly, i can't get that back. The movie was boring with its childish brand of humor and terrible acting. I watched this movie in school as a award for the students who got 4.0. Ironic, isn't it? The movie insulted my intelligence along with every kid in the room. I knew it was a family film so i was amazed at the amount of swearing in the film. It just goes to show how far our culture has gone below typical American values (now dead) I would suggest this movie to kids 8 and under, otherwise, just don't watch it!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "schellhammer_sean",
        "review_rating": "10",
        "review_title": "All I can say is WOW!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Caine-2",
        "review_rating": "7",
        "review_title": "An interesting failure",
        "review_detailed_main": "Christopher Lloyd, as usual, is in top form. The rest of the cast is good as well, but that's not where Baby Geniuses fails. It's main problem is that the script just isn't funny enough. The film has moments of zany humor and a few laughs, but nothing here is that memorable...except the interaction between babies. These kiddies really appear to be communicating with one another. There are elements in this film that may help it achieve cult status in the near future. As it stands now, Baby Geniuses is an interesting failure. It entertained me until the end, but I just didn't laugh enough. See it for the novel plot and Lloyd's over the top performance. If you don't expect too much, this may be a guilty pleasure.\n\nA 7 or 6 out of 10 (depending on my mood)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "tjw1973",
        "review_rating": "1",
        "review_title": "toxic waste from hollywood",
        "review_detailed_main": "This movie is one of the most horrible peaces of sludge to ever make it out of hollywood. It is so bad it is not even funny. In the 50's Ed Wood created some brilliant masterpieces compared to this diaper waste. Parents should avoid letting their children watch this for fear of warping such young minds."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "soranno",
        "review_rating": "",
        "review_title": "An interesting film idea with several key scenes of cute slapstick comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Criz",
        "review_rating": "1",
        "review_title": "The Most Dangerous Film of the Year",
        "review_detailed_main": "\"Baby Geniuses\" poses by far the greatest threat to moviegoers in 1999, Annette Bening's \"In Dreams\" notwithstanding.\n\nFirst, this pseudo-comedy possesses a heretofore unseen capacity to completely waste your time--two perfectly good hours that you could have spent on something far more constructive for society, like playing video games. Second, \"Baby Geniuses\" is basically completely inane fluff that makes \"BASEketball\" look like a brilliant exploration of the human condition. Consisting of tired Culkinesque \"kick the adult in the groin\" sight gags, \"Baby Geniuses\" is embarrassingly unfunny. Third, and most worrisome, this flick has the potential to create havoc with population control. After enduring two hours of these insufferable little brats, most viewers will opt for immediate tubal ligation. On the other hand, the tiny Carrie Robbins character (played by the most adorable little twins imaginable) was SO SWEET I decided to run out and impregnate my girlfriend.\n\nThis is an AWFUL, PAINFUL film, and I just hope I've been able to warn you in time. With so many drawbacks (lame plotline, silly dialogue, Kathleen Turner and Peter MacNicol as main characters, poor special effects: the babies' computer-simulated mouths are completely out of sync with their words) it's amazing this film got made at all. Oh, wait, it's a Sony picture. That explains everything."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "billy-7",
        "review_rating": "1",
        "review_title": "The pits",
        "review_detailed_main": "Seldom if ever has a star of the magnitude and demonstrable talent of Kathleen Turner appeared in a worse film than this execrable \"comedy\"--or given a worse performance than Turner's obviously embarrassed and unfunny turn."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "The Jolly Fat German",
        "review_rating": "1",
        "review_title": "When I watched this movie, a small piece of me died.",
        "review_detailed_main": "DO NOT GO SEE THIS MOVIE. My family rented this movie a few weeks ago and I am still having nightmares about how worthless this \"movie\" was. I still to this day don't know how it ends because I SHUT THE MOVIE OFF 1/2 of the way through it! I don't know how I made it that far in the first place. Please save yourselves and DON'T SEE THIS MOVIE."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "shorteze",
        "review_rating": "1",
        "review_title": "Disgusting.",
        "review_detailed_main": "Rant: If you were to go back in time a hundred years ago and tell people about what film making would become, then you would certainly destroy a lot of hopes.\n\nI really cannot understand how this got the green light,its really that awful. Everything from acting to special effects is just poorly done.\n\nThe Plot: A big corporation plans to harness the power of the infant intellect. Ridiculous? Sounds it. Heres the catch: apparently every infant is a genius before a certain age(think its 3 years old). Sounds like it could have potential. One baby,Sylvester or \"Sly\" breaks out of the labs and tries to tell people about the...or does he want to find his brother? I don't know.You see,the plot is that forgettable. Its just incoherent and the baby dubbing makes you wonder again and again if this was some cruel joke by an evil film company.\n\nNot recommended unless your children were bad...real bad...like wreck your 1960s convertible bad."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "LVWolfman",
        "review_rating": "1",
        "review_title": "So bad, it was the first movie I ever turned off before the end",
        "review_detailed_main": "We last ten minutes into this movie, hoping that it'd get better. Some friends with similar tastes (any taste) didn't last that long.\n\nEven Kathleen Turner (We love you Kathleen!) couldn't save this stinker.\n\nAmazing as it seems, someone was brave/stupid enough to make a sequel."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "DirkVW",
        "review_rating": "1",
        "review_title": "One of the WORST Movies Ever Made",
        "review_detailed_main": "\"Plan 9 From Outer Space\" was a bad movie, indeed, but at least it was fun to watch and fun to laugh at. \"Baby Geniuses\" was so gosh darn awful that I felt squeamish the entire time, waiting for the film to be finished... no, I wasn't just bored, I was also infuriated that such a film was even made!! I am insulted that Hollywood as sunk so low as to put this piece of garbage out for the rest of us to see.. I'm so glad that Entertainment Weekly gave it an F... though there's not a grade low enough to describe this stupid, insultingly dumb trash!!!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Markus58",
        "review_rating": "1",
        "review_title": "Save your money....",
        "review_detailed_main": "I took my son to see this movie, not knowing anything about the story. As a parent who cares about what goes into my children's brain, I cannot recommend this movie. For a \"G\" rated flick, the language was not appropriate and the adult sexual innuendos are going to be over the kid's heads. Pass on this one folks. There's much better entertainment to put in your children's brains."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "oldblueliveson",
        "review_rating": "10",
        "review_title": "greatest movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "shneur",
        "review_rating": "6",
        "review_title": "A fun romp",
        "review_detailed_main": "I didn't think this movie was as bad as apparently most IMDb viewers did. It's based loosely on a folk belief that babies really know everything, but forget it as they learn how to talk and therefore can never communicate the \"secrets of life\" to others. The film obviously is intended for an audience of very small children, and the characters and plot are all one-dimensional and exaggerated, but allowing for all that the story made a sort of sense, with definable good guys and bad guys. The computer graphics were just amazing: making the babies' mouths talk, having them walk and dance and show appropriate expressions and emotions. After a while, you simply forget that BABIES CAN'T DO THAT! I found myself laughing out loud and had a thoroughly good time."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "rravenous3",
        "review_rating": "1",
        "review_title": "Total Rubbish",
        "review_detailed_main": "This is one of the worst films of the century.It definitely ranks with the likes of Battlefield Earth and Judge Dredd.What is even more scarier than the film is that the producers decided on a sequel!! My sister loves this movie - You guessed it - she has bad taste in movies"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "movies2u",
        "review_rating": "",
        "review_title": "Completely Terrible!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "thedegenerate",
        "review_rating": "1",
        "review_title": "This Movie Caused My IQ to Decrease",
        "review_detailed_main": "Unfortunately, I've sat through this movie on more than one occasion because of my kid brother. There is nothing... I repeat... NOTHING entertaining about this movie. Nothing. It's not funny, it's not cute, it's not exciting... Well, here's a good comparison. It's like gum after you've chewed the flavor out of it. Bland, bland, bland. The acting? Terrible. The action sequences? Terrible. The jokes? There weren't any jokes in the movie, don't look for any. Don't see this movie. I'm sure it has some sort of lasting effect upon the brain."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ijtfalcon",
        "review_rating": "1",
        "review_title": "Dare I say Genius?",
        "review_detailed_main": "I think not. This, by far, is the worst movie I have seen in my entire lifetime. There is not one single funny moment in the entire film and it tries......and tries......and tries. But it only gets worse...and worse...and worse. How could Christopher Lloyd subject himself to this trife? The answer alludes me. There simply aren't enough words in the English language which can describe the crap that is Baby Geniuses."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ilcd",
        "review_rating": "1",
        "review_title": "Don't rent this movie",
        "review_detailed_main": "I love being around babies & watching movies that include babies/toddlers. But this movie is at the bottom of my list. I hated the way this movie exploited the toddlers like lab rats. Also, it had toddlers cursing at adults which I found offensive. Not only that, but it also had toddlers doing violence acts against others which I found not funny at all. Please, if you care & love children, don't rent this movie. In my opinion, the storyline wasn't good & the acting of the characters were poorly done."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ThunderKing6",
        "review_rating": "5",
        "review_title": "It's not that bad. Sometimes you need a goofy movie to be relaxtained.",
        "review_detailed_main": "It wasn't that bad. It was just an innocent flick about smart babies going on an adventure. Still, it has some elements that put current family movies to shame. 1999-2001 were interesting times for movies now looking back. From the golden age 90s to an okay 00's to today. You gotta ask what happened to the geniuses in hollyweird?\n\nLast Words: A fun goofy movie for the children and Fam."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ShadowGal",
        "review_rating": "4",
        "review_title": "Not a great movie, but passable",
        "review_detailed_main": "First off, I have to say that I watched this movie when I was about 14 years old, either in '99 or 2000. That probably affected my rating of it, as I was in an off-and-on \"adults suck\" phase. I haven't watched the movie since, which explains why I can't go into any detail.\n\nOkay. I gave this movie a 5 out of 10. It wasn't a great movie. But in the mind of a young teenager, at least, it didn't *suck* either. I remember being amused by the attitudes of the babies, and I'd always believed that infants and pre-speech toddlers are a lot smarter than any of us adults (or even other kids, for that matter!) give them credit for. So the dialogue wasn't great, I remember that much. I do remember, however, laughing at quite a bit of what the main little baby said. I felt bad for this one little baby that got trampled on (figuratively, that is) by babies and adults alike. And I felt bad for whomever had to clean up the house those kids were in.\n\nI don't remember anything specific about this movie, good or bad. That's why I gave it a 5. It's nothing special, but I don't remember it as being horrible either. I'll never watch it again, though. Basically, I guess it'd be worth a watch if nothing good is on and you're curious to see just how bad a movie this was.\n\nThinking about it, I maybe should have given it a 4 of 10. Oh well."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "thefluffymaid",
        "review_rating": "1",
        "review_title": "This movie is the opposite of smiles.",
        "review_detailed_main": "YIKES. There is nothing good or likable in this whole film. Nothing. There is something so painful about bad comedy. When a movie tries to be funny, but is terrible at it, it makes you HURT. Baby Geniuses hurts.\n\nLet's start with the premise: Babies who are 'geniuses'. Well, there's your first problem. Babies are not smart. \"Oh, but you just have to be imaginative and have suspension of disbelief\" Blah, blah, blah, suspend yourself over a gorge, you supporter of horrible films. I'm the kind of person who can enjoy a ridiculous premise. I loved Babe, and I readily accepted the premise of sentient farm animals. Do not tell me that I'm just too cynical to appreciate a goofy movie. No, the problem lies in centering your movie around the idea that not only do babies speak perfect English to each other, not only are they incredibly smart, not only can they flip around and do stunts, but they forget it all when they turn two. Freaking HUH?!? That makes no sense. It doesn't even make MOVIE sense. And the whole nudge-wink at the audience that babies just keep up the pretense around adults- OH PLEASE. So, babies crap their pants, wander around blank-faced into furniture, and obsessively chew on my hair or car keys every time I'm around, but they're secretly super-duper smart ninjas? No.\n\nAnother problem with this should be readily obvious to anyone who respects acting: Babies cannot act. It's at best awkwardly cute. But, in most movies (especially GOOD movies), scenes with children are minimal and designed with a children's limitations in mind. The audience will tolerate a few seconds of little Billy reading off his cue card before running off the stage back to his mother, and everyone can go back to enjoying the scene. But this is a movie of nothing but that! So while the movie is trying to set up these kid characters as smug, intelligent, witty spies, all anyone with half a brain is seeing is awful CG mouths and lame dubbed in lines pasted over a drooling, completely-oblivious toddler. It's not cute or funny.\n\nAnd the terrible computer effects are one of the many things that makes this movie INCREDIBLY dated. Remember how awkwardly shoe-horned special effects were into every 90's film? Baby Geniuses seems to be an exercise in studios pandering to people who are so amused by special effects, that it doesn't matter how poorly done they are. The baby effects are TERRIBLE. The mouths just kind of wriggle around out of place on the babies faces, and all of the \"action\" scenes look about as real as the spaceships in Plan 9 From Outer Space. I have a vehement loathing for the scene that was quite obviously created to be put in EVERY TRAILER: the Saturday Night Fever parody where one of the babies disco dances in the trademark white suit. Not once do the body or face of this character seem like they have any connection to each other whatsoever. It's not well done, it's not funny, it's just lazy and can't even pull off a cheap laugh correctly.\n\nAs for the script? I'm going to be as lazy as the screenwriters for this one: It sucked and was bad and I hate it.\n\nThis movie was made to cash in on one of the most easy to pander to groups imaginable: Families. When you have kids, your sense of humor turns to crap. Yes, I know all of you are already arguing, but kindly stop. To an extent, I understand why people (especially moms) suddenly become unfunny after you have kids: They take over your life, and all that is in it. For a time, you will be forced to watch what they watch, listen to the jokes they tell, and generally alter the way you talk and behave around them. That's just a part of being a parent. It's only logical that after being exposed to all of their content you would eventually build a tolerance to it, maybe even develop an appreciation for it. Maybe some of you were unfunny to begin with. But there it is.\n\nBaby Geniuses was made for families. Specifically, the average, unfunny ones that find only the most bland, dated, and cutesy crap enjoyable. Every joke and moment was crafted for them. This movie is basically every thing my grandmother would find hilarious. I could practically imagine her excitedly repeating the repulsive \"diaper gravy\" \"\"\"joke\"\"\" and thinking it's hysterical. The Austin Powers quote made me want to send every network consultant to bottom of the ocean. It so perfectly encapsulates what this film is. It's a template for every \"funny\" scene in this horrible film: Baby does something babies do not normally do + probably a baffled adult somewhere + baby uses slang or quotes something currently famous. The Austin Powers joke doesn't even make sense within the context of the scene, they just threw it in there because oh look, the baby is talking like Austin Powers, isn't that just hilarious????? To sum up. This movie has mom humor, it's not well made, and anyone giving it ten stars should not be trusted EVER. And no, I'm not just saying that because I only like \"mature\" films with violence. I LIKE a lot of kids media. I think babies are adorable when they AREN'T being scripted to be so. Hell, I have LaLa-freaking-loopsy on my DVR right now. So don't tell me I'm just a grumpy adult who can't stand innocence and silly fun. I just can't stand movies made with such calculated marketing as this, and so poorly done to boot.\n\nIf you want to see an enjoyable kid-friendly movie, watch Babe. Or Toy Story. Or Willy Wonka. Mrs. Doubtfire. Harry Potter. Or really ANYTHING BUT THIS MOVIE. There ARE kid-friendly movies out there, and some of them ARE well-made. It doesn't have to be a trade-off, I promise."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "pgr-fw",
        "review_rating": "1",
        "review_title": "Spectacular! (ly awful!)",
        "review_detailed_main": "Stunning! Agonizing! Painful! I didn't think it was possible that there was a worse movie than \"Manos: The Hands of Fate\". I was wrong. \"Manos\" has an intelligible story arc. \"Manos\" has characters I care about a little. \"Manos\" left me with at least a little admiration for the producer/director/star for having the guts to make it despite having no budget and no talent. Campy, and you can at least have fun laughing at it.\n\n\"Baby Geniuses\" on the other hand, has none of these redeeming qualities. Full of producers, directors, and stars who know better, along with a multi-million dollar budget. Blech! Makes my brain hurt. I don't think it can even be enjoyed with excessive quantities of intoxicants.\n\nWhat's really astounding is that they had the nerve to make a sequel! As much as I enjoy rotten movies, I'm not sure I have the guts to watch \"Superbabies\". A man has to know his limits."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "nyarnebbanot",
        "review_rating": "9",
        "review_title": "This movie is weird and that's good.",
        "review_detailed_main": "The overt tone of this movie is quite overly bright and strange but hey, at least the babies are cute. There is a lot of gross out humor so you might be detered.\n\nHowever Baby Geniuses 1999 has Crash Bandicoot on PS1 demoed in a mall scene. So 9/10 this game has Crash Bandicoot. Go Baby Geniuses"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "3pigs",
        "review_rating": "6",
        "review_title": "Great Special effects and witty one liners from movies couldn't save this movie.",
        "review_detailed_main": "The special effects, making the baby's talk among many things, among others made this film somewhat interesting. It got kind of boring after a while with all the \"One Liners\" from other movies... and the plot was non-existent. I gave this movie 6 of 10 stars because it was a good idea and had good effects. The plot and acting kept this from being an 8 or 9 star movie."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "idonotexist",
        "review_rating": "1",
        "review_title": "can it get any worse",
        "review_detailed_main": "Yes it can. On top of it being the worst plot in recent human history, that movie was incredibly annoying. It was like the entire cast was there just to create an incredibly annoying movie that I am not sure anyone who doesn't operate a daycare will be able to stomach. I almost threw a hammer at my screen 20 minutes into that movie, but decided to live through it. It's so bad it doesn't even warrant a full review. Save yourself."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ajc899",
        "review_rating": "",
        "review_title": "So babies can kung fu fight and understand quantum physics?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "cinecism-2",
        "review_rating": "1",
        "review_title": "A dirty diaper is more appetizing",
        "review_detailed_main": "Oh, how the mighty have fallen. Kathleen Turner used to be the most exciting actress in Hollywood. From \"Body Heat\" to \"Peggy Sue Got Married\" to \"The War of the Roses,\" Turner starred in one great film after another in the 1980s. She closes out the \u009190s, though, with her worst film ever. \"Baby Geniuses,\" a supposed comedy about genetic superbabies who communicate brilliance through baby talk, is a new low for the family film genre. It's not cute, it's not clever, and it's sure as hell isn't funny. It's absolute sewage."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "vwl",
        "review_rating": "1",
        "review_title": "This movie is AWFUL",
        "review_detailed_main": "Hey- just because we have the technology to make it seem like babies can talk, does that mean we should? Not with this movie as an example, no. This movie is so bad, it gave me a headache. It wasn't cute; in fact, it was a little scary. Babies cannot and should not be manipulated like that. It's icky. DON'T SEE THIS MOVIE. Save yourself the pain."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ShancyShance",
        "review_rating": "1",
        "review_title": "Give me Rugrats instead anyday...",
        "review_detailed_main": "The idea of babies speaking adult language had not been a fresh and original idea since Look Who's Talking, which did it right. This movie did it wrong, and ranks amoung the most horrible movies I've seen outside the world of MST3K.\n\nThe jokes are funny, but not in the way they were intended to be. They are funny in their attempts to make you laugh and fail so miserably. Ha ha ha."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "oreokitty",
        "review_rating": "1",
        "review_title": "im going to throw up",
        "review_detailed_main": "I seriously think i threw up watching this \"movie\".It was so outrageously ridiculous. Just the fact that there are people in this world who enjoyed this movie makes me feel queasy inside. Nobody wants to watch small babys crawling around in a crib while horrible voiceovers who sound about 40 try and act like babys.Thats nooot disturbing or anything. That alone is a recipe for a disastrous movie. But to top it off lets make these Babys SPYS. are you serious!. Ewwww!.Baby geniuses. More like retards. Because not once in the movie does one of the babys actually talk for themselves. And leave the spying or whatever that bull.... was. Because nobody but pedofiles will enjoy that!.\n\nand im just going to say that making a baby geniuses 3 was probably the stupidest idea you could think off. If one and two bombed. what makes you think we want to see that again."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Thornfield2",
        "review_rating": "1",
        "review_title": "Yikes!",
        "review_detailed_main": "I was flipping through some channels a couple of weeks ago and stumbled onto this one on cable. What was this film? Who came up with it? Yikes!I coudn't even watch this whatever it is for 15 minutes! I normally like to see what happens at the end of shows I find on cable, even if I vow to never see them again. Who came up with this? Normally I don't like to slam movies, because I hate antihype, but this movie really was lame. Who came up with this? All the talking babies really did was kinda give me the creeps. Ick."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dsbell",
        "review_rating": "1",
        "review_title": "Awful. Just awful.",
        "review_detailed_main": "Saw it at my in-laws. A terrible waste of time. The gag lost any potential by the \"Look Who's Talking\" sequels. The poster alone was enough to keep me away from the theatre for a while. I can't imagine how a non-Julia Roberts movie could be worse."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "rooboy84",
        "review_rating": "1",
        "review_title": "Possibly the worst movie of all time",
        "review_detailed_main": "I mean, come off it, babies talking to each other in a secret code? This movie is so bad words can't describe how bad it is. The whole concept of the movie is retarded!\n\nI can't believe Kathleen Turner and Peter MacNicol actually were in this film. If I were them I'd be embarrassed.\n\n10%"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "LaoagMikey",
        "review_rating": "10",
        "review_title": "Excellent little silly comedy",
        "review_detailed_main": "I find this movie funny. Maybe not side splitting, laugh out loud funny but it has a story and it has some good ideas and will tickle you a bit.\n\nI don't agree that it is the worst movie of any year as some have said. You have to watch it for what it is. It is simply a little story held together with some nice performances by some kids who probably did not know what they were doing most of the time. I expect it took a lot of editing time to make this happen with the right expressions and timing by the kids. The story holds together, although there is some fantasy in it and at least one hard to believe plot point. I have watched it twice. Once, some years ago and I accidentally watched it again tonight. I thought it was something else (a documentary on smart babies) And I made it all the way through, both times. I don't always make it through movies with no story or bad acting. But this has a good cast, including the twin baby leads (played by triplets), some good lines and it holds together.\n\nHow bad could it be. There was a sequel and that means that it did make some money and there was some thought by someone that it would make more with the sequel.\n\nSo take it for what it is. A cutesy little movie with a plot, some evil characters and some fantasy plot points to hold it together and it will be enjoyable. I do not work in the entertainment industry and certainly don't work for any entity connected with the movie but I do think it is not nearly as bad as most here say. Maybe they were embarrassed in some way and were afraid to admit liking it. Whatever! Just see it and judge for yourself. I think you will be pleased at the time spent.\n\nmiKe"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "mark.waltz",
        "review_rating": "7",
        "review_title": "I laughed a ton, so that's all that matters to me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "gameengineer",
        "review_rating": "1",
        "review_title": "Grasping for superlatives",
        "review_detailed_main": "OK, I got had. I was pursuing a doctorate in Slavic Languages when I rented this. A friend of mine told me that this move contained a musical routine entitled \"Putin on the Ritz\" (as in Vladimir Putin).\n\n\"It's basically a send-up of all the ex-KGB types who reconstituted themselves into pro-democracy reformers after the fall of the Berlin wall,\" he told me. \"Don't let the animatronic baby crap fool you- it's really quite insightful. They rhyme 'class war' with 'passifier' - I almost had a cerebral hemorrhage, I laughed so hard!\"\n\nNeedless to say, I awoke an older and wiser man the next morning. And A Certain Someone will never, ever get my help translating dirty jokes from Croatian again, I don't care how @#$!-ing late his thesis is or how his stupid wife feels about it. Yeah, that means you, Arshad. Never again, dawg. Baby Geniuses indeed!\n\n\"Putin on the Ritz\" indeed!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "It's as bad as you've heard!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Theraxorterminate",
        "review_rating": "1",
        "review_title": "Who keeps up-voting the positives reviews?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Keyser Soze-12",
        "review_rating": "1",
        "review_title": "Without a doubt, the worst movie I've ever seen.",
        "review_detailed_main": "Why did they make this movie. WHY! I have never hated a movie before, but now, now things have changed. This isn't a family movie. This isn't a funny movie. It is stupidity at its lowest level. Here is the plot: scientists uncover that babies are actually geniuses. The babies the are studying rebel. And that is it. Sounds stupid? IT IS! I must warn as many people as I can. NEVER SEE THIS AWFUL THING. (Note: this is not a movie. This is a monster that must be stopped and destroyed)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "blanka-2",
        "review_rating": "1",
        "review_title": "Razzie Awards here we come!",
        "review_detailed_main": "This will definitely be at the Razzies. I just know it. Watching wall paper peel for 20 years is way more entertaining then this."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Jonesgrl5",
        "review_rating": "3",
        "review_title": "It depends...",
        "review_detailed_main": "I was eight years old when this film came out in 1999 and back then I absolutely loved it. Just recently, after remembering how much I loved it then, I thought it would be fun to watch it again.\n\nThat was a mistake, because everything about this movie is purely idiotic. What was I thinking? The acting is almost indescribable and the plot is a train wreck.\n\nMy advice to those out there is that this movie should only be watched by children at the absolute most. Young children and hope that the parents don't have to watch it with them.\n\nKids will love the goofy moments while the parents will cringe. So it depends on your perspective... If you've made it to junior high school, then you'll hate this movie."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Ilovepornoandwomenveryverymuch",
        "review_rating": "1",
        "review_title": "This movie is very bad and more bad than anything else.",
        "review_detailed_main": "Do not see this very very bad movie!. I am very very happy that all people hate this very bad movie.I am very very happy all people vote 1 * for this very very bad movie. I advise you all to vote 1 star*.Only stupid people and crazy families vote 10 for this very bad movie. I am very very very sure this movie will go back and back to be at the bottom.Why they make a very bad bad movie like baby geniuses?.Do not buy this DVD!. Do Not Be Crazy!.Vote only 1 * and open your mind and you must hit your kids if they buy this very very very bad movie . This movie has very much violence and very very bad. Do not waste your time and see it.Only smart people vote down for this movie and only crazy people vote up for this very very bad movie."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "sanddog2",
        "review_rating": "1",
        "review_title": "BBBBOOORRRRRRRIIIIIINNNNGGG",
        "review_detailed_main": "THIS MOVIE WAS SO BORING. i fell asleep twice in this movie, it had no key parts, no funny parts, and it was totally stupid. I hated it. this has to be one of the worst movie of any year. i hope my vote put this movie down to - 1,000 (if there was one)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "purserbj",
        "review_rating": "10",
        "review_title": "This is sneaky good",
        "review_detailed_main": "Wow. When I read the reviews here I nearly fell off my chair! This quintessential 90s flick is like the pigeon lady from Home Alone 2 - scary, but ultimately misunderstood. The fact that lead baby #1 didn't get any academy award love is a travesty. Please, if you do one thing this Christmas - give this movie a chance... you won't regret it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "singingangelugod",
        "review_rating": "7",
        "review_title": "Sweet, silly, nostalgic",
        "review_detailed_main": "I was shocked to see this made the worst rated movies. Not because it was some crazy great movie, but because it was sweet and silly, and the story line could have been FAR worse than it was! It also has some great comedic moments AND some songs that are top notch. I remember watching this as a child and sure, maybe that creates a sort of bias, but as an avid movie watcher now, I still hold the same appreciation towards this fun flick. We need easy and light movies like this! Forever a childhood favorite I still commonly think back on."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "DarkSchumyFan",
        "review_rating": "",
        "review_title": "Awful on every level imaginable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "KryptonIsMyEvilFriend",
        "review_rating": "1",
        "review_title": "How dare you!",
        "review_detailed_main": "For all of you who didn't like this movie, I say 'screw you'. I was the stunt midget in this movie for baby Sly. I am proud of my work in this fine cinemagraphic acheivement. Without me scenes such as the modeling dance scene and all the fight scenes. Not many of you out there can say I was in a big budget movie or say I worked with fine actors like Dom DeLuize. I even got my own chair with my name on it. How many of you can say I was what made baby Sly sassy and spunky. I worked hard everyday to make it look like that really was a baby dancing and fighting grown men. I think this is one of the funniest movie I have seen. It is right up there with Free Willy. At the end of production I thought, it is great to be a stunt midget in this town we call Hollywood."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "trhendricks1966",
        "review_rating": "1",
        "review_title": "Rotten but funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "PinkBubbles",
        "review_rating": "1",
        "review_title": "CAUTION: Do not enter \"danger zone\"",
        "review_detailed_main": "I'm lucky I only payed $2 to see this movie. Then again, I could have spent my $2 a bit more wisely, maybe by slipping one dollar coins into those candy machines in the mini-mall that give out rotton little bubblegum balls. It would have been a better use of my money.\n\nThis movie even makes Flipper (the modern version) appear to be the next Titanic.\n\nIts target audience is the little ones, yet it still uses lines like \"d**n\" and \"s**t\".\n\nA tagline for this movie was \"A live-action Rugrats\". However, Rugrats goes beyond the world of talking babies and their parents' lack of awareness, and manages to explore the imaginations of babies and toddlers, and have the scene suddenly turn into their fantasized adventures, which caught my interest. When did this ever happen in Baby Geniuses?\n\nThere is not a single moment in this movie where I hadn't wished to walk out of the theater, I wasn't ever even scarcely entertained.\n\nThis movie was also over-advertised where I live, since people were wise enough to avoid it.\n\nMy rating:... I won't even bother.\n\nThis is the single worst excuse for a movie I have ever seen."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "tommiller247",
        "review_rating": "1",
        "review_title": "the people who financed this film are failures, working outside the standards of Hollywood!",
        "review_detailed_main": "It was so TERRIBLE, so AWFUL, so EXCRUCIATING, that something was very clear: The people who financed this film (whoever they were, I don't want to know), are failures! They are clearly not knowledgeable about how to make a 2 minute video and are clearly not knowledgeable about anything in life: in other words, they don't belong in Hollywood.\n\nWho on earth, in all the years it has been here, would possibly consider being a part of this movie?\n\nWell that questions is answered: People who try to succeed in film, but failed miserably and all wound up together, financing this film. Whoever payed money for this film are washed up failures, who are working outside of the Hollywood standards.\n\nA terrible FIlm.\n\nThat's it.\n\nNothing more.\n\nIf you see it, I'll pray for you not to lose your mind!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "mcjonmor",
        "review_rating": "1",
        "review_title": "Baby geniuses is for baby's who aren't geniuses",
        "review_detailed_main": "Newsflash: baby's aren't typically good actors. getting them to TALK is even more disastrous. either the baby's are prompted to move their mouths up and down, which then has audio poorly synced up to it later, or their mouths are animated using CGI(I warn any passerby, that this movies CGI is Horrendous. it even looks creepy when they try to animate the baby's performing even simple actions) May I add that the baby's have stunt doubles that are about a foot taller than them?\n\nthis movie tries to be a comedy. and the jokes they use? that good 'ol unfunny, lowest denominator, focus group approved Sh*t we all know and hate. the plot revolves around a secret organization called \"baby co\" who's goal is to prove baby's have higher intelligence than adults.(the movie makes it painfully obvious that these are the \"bad guys\") one of their baby's, Sly, escapes, and hi jinks ensue as sly is mistaken as Wit, another baby that a regular suburban family recently lost track of. that's all you need to know. the ending doesn't make much more sense.\n\nIf you need any more reason why not to watch this movie, I would like to inform you that there is a scene in this movie where they defile the BeeGees"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "kylehaines96",
        "review_rating": "1",
        "review_title": "Why Did Bob Clark Ever Think This Was A Good Idea?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Babies are not cute enough to validate the existence of this film.",
        "review_detailed_main": "This movie is based around the concept that babies are (supposedly) cute and therefor, if the audience is shown enough cute babies, the film will be good by association. Sadly, for both filmmakers and audience, this is not the case; shoving scene after scene of \"cute\" babies down our throats does not make your movie good. There has to some form of content other than cuteness to create a movie, otherwise it might just as well be a series of Youtube clips of toddlers. Admittedly the film makers have attempted to add some kind of plot, characters and dialog but it is all so lackluster it might as well not be there. The tired old jokes, the more-flat-than-cardboard characters and the nonsense plot do nothing but annoy me further. A night in front of the computer checking baby clips on Youtube is much more rewarding than this."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Jigglypoof",
        "review_rating": "8",
        "review_title": "In defense of this film... it's not THAT bad...",
        "review_detailed_main": "I think people are coming down entirely too hard on this film. Granted, it's no Look Who's Talking (1 or 2) or Baby's Day Out. It wasn't intended to be. It's a fantastical way to bring \"thinking\" babies back into the spotlight. Look at how much we all love Rugrats, not to mention the aforementioned films. The main goal is not about content, but the \"aww\" factor or just sheer enjoyment of cute toddlers. This is not a film that should be picked apart. It was more than likely made just for fun.\n\nMaybe babies don't know the secrets of the universe. But it's something silly to think about. Why argue about it?"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "erminahotmail",
        "review_rating": "7",
        "review_title": "a great genius",
        "review_detailed_main": "Then This film was very much hated. In the end it only received a score of 2.7 but for me despite this the things it has I quite liked it as a film for children And then I don't even deny that this film has a lot of defects instead instead there was as everyone didthese children are super intelligent and then apart from the children they are very beautiful in motion how they behave and then how they think is really fantastic however the very wasted actors of acting are the two villans who are the directors of the secret laboratory really wasted in that themgold But I tell you that I haven't seen the sequels because everyone says it's very bad and I will never see it and neither will the others. Just this film is enough for me to conclude with a rating of 7."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "GravityLoudHouseLover1",
        "review_rating": "2",
        "review_title": "This Movie is Bad But Not one of the Worst Movie I Have Seen",
        "review_detailed_main": "Hello There Everybody & Today I'm reviewing the Family Comedy from 1999 called Baby Geniuses. This Movie is about this Secret Company called Baby Co. where two Scientist Heep (Christopher Lloyd) & Dr. Elena (Kathleen Turner) hold these Super intelligent babies and the Babies Talk in this Movie which is weird and This is a really Stupid Movie. The Movie also has weird moments like this one scene where I think it was Sly who tells this girl baby to take her clothes of but she will only do it if he takes her out to dinner & this other scene where these Goons From Baby Co. come to take Sly and he sets up this \"Home Alone\" Trap & both Goons both explain the joke & that was Stupid. This Movie is Really Stupid & it also has very foul language like one baby says A** & Yeah This Movie is bad but not the worst 2/10 p.s. I forgot to mention the soundtrack is really good I mean you Have Taco's \"Puttin on the Ritz\" & the Bee Gees \"Staying Alive\" which was Good. I also think I saw this Movie growing up because this Movie came out in March 1999 when I was 2 Years old & I know I Definitely saw this Movie back in 2010 in the Hospital."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Lacking in any wit or value",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "fanofmoststuff",
        "review_rating": "1",
        "review_title": "Do not believe anything the reviews are saying about this movie!",
        "review_detailed_main": "THIS MOVIE IS UTTER TRASH! It's unfunny, boring, offensive, and terrible! This is why there are still terrible kids films. Do not show your kids this movie. It'll only make them stupid and not grow as people. It may seem like an innocent, funny kids movie but IT'S NOT!!! If you want to show your young kids a movie to keep them entertained, show them something that'll feed their minds!\n\nHere's a few movies that'll do better to your kids than BABY GENIUSES: -Any Disney princess movies. -Any Pixar film -The Lion King -Shrek -Kung Fu Panda And if you want some dumb fun for the family go for the Madagascar movies and Megamind. Any of these movies are 100 times better than BABY GENIUSES!\n\nThink that this movie is \"underrated\" for a reason!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Etoile",
        "review_rating": "2",
        "review_title": "Don't bother. No, really.",
        "review_detailed_main": "I am currently serving as a camp counselor for 25 kids, all ages 11 and 12. We wanted to rent a movie for them, so we checked out \"Ever After\" and \"Baby Geniuses.\" The kids unanimously voted for the latter (apparently they'd all seen the former already, as had I -- twice), so we put it in the VCR and lit up the big-screen TV.\n\nThat was our mistake. The film is horribly, terribly, revoltingly bad. It's almost entirely generated through special effects, as was \"Titanic,\" but that film won several awards for the effects -- and this is the opposite. The film's sole redeeming feature is that it could be used as an example of what NOT to do with your fancy special effects technology.\n\nI logged onto IMDb while the kids were watching the film because I was curious about the age of the actor playing the main character -- the kid in the movie is about 18-24 months old, but I was sure the actor was between 7 and 10 years old. The only information I found was that the one actor was actually a set of triplets, but of course there was no further information on them.\n\nThe kids seem to be enjoying it enough, though. It's keeping them quiet, and that's why we rented the film. I had better make sure they're not throwing popcorn at each other, though."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "squirrel_burst",
        "review_rating": "1",
        "review_title": "A load of diaper gravy",
        "review_detailed_main": "'Baby Geniuses' wasn't necessarily a bad idea. The conceit of the movie is that babies are born intelligent and speak a language that only they can understand and that as they grow older the forget it and become like us. A scientist has discovered this and tries to prove it, while some bad guys... OK maybe the plot sounds idiotic, but I have the feeling that something interesting could be done with completely physically inept heroes trying to get away and outsmart the adults that are out to get them. You just need a smart writer. Unfortunately, this movie is extraordinarily stupid. It's like the idea was \"babies are cute, seeing them do non-baby things will be hilarious\" was all of the thinking they did before making the actual film. \"Baby Geniuses\" doesn't show any inventive thinking, The same jokes get repeated over and over, the unfunny satire makes you wish it would simply go away and nonsensical plot drag this quickly into a near unwatchable mess. To make it even worse, the director knew this movie was complete junk and decided to throw in a last minute music video at the end in the hopes that seeing babies laughing at the sound of \"Gift Of Love\" by Randy Travis would make you forget how terrible the movie was. (VHS, January 2012)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "comedyguy95",
        "review_rating": "1",
        "review_title": "This is pure garbage!!",
        "review_detailed_main": "This very movie is probably one of the worst movies I've ever seen in my whole life! In fact, this movie made me dumber and dumber with each minute I had watched! And now, I have an hour and a half of my life that I can never get back! And why, you may ask? Because of this foul smelling, vomit inducing, putrid chunk of diaper gravy!! The only good thing about this movie was when the end credits popped up! Sure, there was good actors like Kathleen Turner, Christopher Lloyd, and even Dom faffing Deluise; but I wouldn't have guessed that the director of this movie, Bob Clark, had directed The Christmas Story. What would drive oneself to make such a horrible movie? Bob Clark should've realised that the general plot was too dumb to make it as a whole movie and scrap the entire project! That way, he wouldn't have made Baby Geniuses 2 (which was the last movie he ever made), and Baby Geniuses 3 (which I think was made by Jon Voight). I would rate this a zero out of ten, but this rating system only goes as low as one. All I can say is stay away from this movie at all costs!!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Beta_Gallinger",
        "review_rating": "2",
        "review_title": "A strange movie, and not in a good way!",
        "review_detailed_main": "What can I say? It appears this movie has been in the IMDb Bottom 100 for quite some time! Some films are in there for a while, but then drop out, as their rating increases slightly, not that I'm saying that means they're any good. However, \"Baby Geniuses\" is one of those films that seems to remain up there (or down there). I may not dislike this total flop as strongly as many do, but like the vast majority of people who have ever seen it, I got absolutely nothing out of it!\n\nDr. Kinder and Dr. Heap are members of a company called Babyco. They are secretly studying babies and their communication, so they can learn the secrets of the universe! After a highly intelligent baby in their secret lab named Sly manages to escape, he goes out to form an army of babies from outside the lab to help free those being held captive inside!\n\nThis is supposed to be a comedy, but since I didn't laugh or even smile once, I can't give it any credit as such. Now, I will admit that I thought it could have been worse. I think the \"diaper gravy\" part grossed me out a bit, and still does when I think back to it, but also feel that this movie would have been worse had the excretion jokes been more extreme, like the ones in a rightfully obscure cartoon show called \"Mega Babies\". Unfortunately, I sound like I'm defending \"Baby Geniuses\" now, but I can assure you, just because I say it could have been worse doesn't mean I'm saying it's not bad! So many others have criticised it for being stupid and boring, as well as having a bad script and bad acting, and I certainly can't deny any of these things! I also think it's a bit strange, in a way I can't really describe.\n\nAs displeased as I was by this film, it wouldn't feel right for me to go with over 50% of the other IMDb voters and give it a 1/10, as it was a tad too forgettable to be my worst movie experience. I'm not even sure about my 2 rating, and might be able to give it a 3. However, that's still far from a positive rating, and I can say without ANY doubt in my mind that it was NOT worth it! Should kids watch this film? That's debatable, but since I'm not a parent, it's not my decision. I feel I should just mention that it's not 100% clean. For adults, however, \"Baby Geniuses\" is hands down a must-see! Just kidding. It's pretty much the opposite, so I strongly advise you to steer clear!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "harybobjoebob",
        "review_rating": "2",
        "review_title": "I can't believe this movie",
        "review_detailed_main": "As a child, this was one of my favorite movies, I loved it. What was wrong with me? I'm not sure, I must have been a stupid kid. The only reason someone would watch this is for the giant scary baby, that thing is nightmare fuel. The main dad actor I really like for some reason, I feel like I've seen him in other things I actually like but I dont know what they are right now, maybe he just looks like someone else, I dont know. Dont watch this or show it to your children, please"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jego-30529",
        "review_rating": "1",
        "review_title": "If you haven't seen this movie, I am telling you NOT TO.",
        "review_detailed_main": "This is just a disgusting and disturbing movie. I wish people can avoid this movie at all costs. I want to watch a better movie. I would recommend Toy Story 2, not this movie!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "JTowle",
        "review_rating": "10",
        "review_title": "Oh, What a movie!!!",
        "review_detailed_main": "I know that many critics say this movie is \"bad\", but they are must be watching with their eyes closed, do they not see the detail, and the amazing effects, not to mention the dead on acting from Lloyd and Turner. Technology like this has not been seen since Forrest Gump, with the mouth moving detail, it'll blow you're mind. And what a story, it really shows what a little imagination and two separated twins can do. Without even going into the \"Mall Montage\" I'll just say that this movie is a MUST SEE for any discriminating movie-goer."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "catfarmer1358",
        "review_rating": "6",
        "review_title": "Guilty pleasure",
        "review_detailed_main": "I really don't get why I'm so fascinated by this movie. It's pretty bad. I would definitely consider this movie to be a guilty pleasure. Also this is probably the type of movie you would watch on a sick day under the influence of NyQuil. I can imagine that then this movie would be quite something!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "IonicBreezeMachine",
        "review_rating": "1",
        "review_title": "Ill conceived, poorly made, and without any charm Baby Geniuses is a creative misfire on all levels",
        "review_detailed_main": "Two twin boys, Sylvester and Whit (Leo, Gerry, and Myles Fitzgerald) were born via surrogacy at the request of conglomerate Baby Co., a company manufacturing various baby products and services, for the purposes of testing a method of child rearing created by Baby Co. Head Dr. Kinder (Kathleen Turner). While Sylvester was raised in the Baby Co. Habitat to be raised with the \"Kinder Method\", Kinder arranged Whit to be placed with her niece Robin (Kim Cattrall) and her husband Dan Bobbins (Peter MacNicol) who's performing his own research that suggests babies may have their own language and untapped knowledge. However when Whit uses his genius level skillset to escape Baby Co. This jeopardizes the experiment.\n\nBaby Geniuses comes to us from Steven Paul's Crystal Sky Pictures. The project was conceived by Paul when two babies in a Barney's having verbal exchanges in Baby Talk and believed the concept had promise as a mashup of Look Who's Talking and Babe. Making a crude promo using mouth morphing technology, the low budget genre label of Sony, Triumph Films greenlit the project shortly before their closure and the actual release went through Sony's Tristar label. While the movie was a minor hit earning back $36 million against its $12 million budget, the movie was subject to critical panning and was also not well liked by audiences and maintains a spot on IMDb's bottom 100 list, and was labeled the worst film of 1999 by Roger Ebert who also placed it on his \"Most Hated Films list\". In the years since its release Baby Geniuses has maintained a level of presence in the minds of people as an example of bad films (only cemented by some also inferior sequels) and rightly so because it's hard to recognize any merit to Baby Geniuses on any level.\n\nThe movie tries to one up the Look Who's Talking films by replacing the inner monologues of those films with the illusion of mouth movement from the babies and that's a major reason why this movie doesn't work. While one of the few positive reviews compared this movie to a live-action version of Nickelodeon's Rugrats, there's a major difference in that Baby Geniuses is not a cartoon and it's trying to cater to a broader audience than Rugrats (and failing miserably). When Babies talk in animation there's a certain amount of leeway afforded such an outlandish concept because animation allows you to bend and break the laws of reality as needed so long as you create your own internal logic. The babies in Rugrats acted like regular babies only with the roles that they could speak to each other and not the adults and their understanding of the world was limited.\n\nWhile I'm not the biggest fan of the Look Who's Talking series, those films also followed their own internal logic and let the babies act natural with most of the humor coming from John Travolta or Kirstie Alley interacting with them while the inner monologue gave vocalization to simple thoughts. Baby Geniuses doesn't work because it's a very sloppy film that has a very confused logic with the whole \"Kinder Method\" plot not all that well explained, the characters of Robbin and Dan Bobbins are very clunkily written with Dan portrayed as this over-the-top milquetoast doormat, and Kathleen Turner almost does her performance to Cruella de Vil levels of over the top without any real logic motivating her character. The whole concept behind babies having this secret language and understanding the mysteries of the universe is pretty stupid even by the standards of a comedy, but as a comedy it commits the number one mortal sin of comedy: not being funny. Most of the jokes are hackneyed puns, slapstick, or pop culture references with Sylvester playing the 90s greatest hits as his character is voiced (in his baby language) as though he's a Bart Simpson/Johnathan Taylor Thomas-esque wiseass, only without the comic timing and writing needed to pull it off. And to add insult to injury, the movie is loaded with product placement as Baby Geniuses features prominent displays of Macy's, Baskin Robbins, Baby Guess, and Playstation so not only are you watching a bad movie, you're watching a bad movie that's trying to sell you stuff.\n\nBaby Geniuses is a creative void in which imagination, charm, and humor go to die. There's plenty more I could discuss that's wrong with this film from awful special effects that range from unconvincing to unnerving to the nonsense logic of Baby Co.'s plan, but I'm sure others have said as much more eloquently and thoroughly than I can. Just don't watch it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "uds3",
        "review_rating": "",
        "review_title": "Why don't you all get off its case and get real!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "worldsworstwryter",
        "review_rating": "1",
        "review_title": "Awful in every way imaginable.",
        "review_detailed_main": "Awful in every way imaginable. Strangely inappropriate for kids too despite it being about babies.\n\nWhile watching the bizarre recap montage at the end I started sneezing, so I think I might be allergic to this film."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "treakle_1978",
        "review_rating": "1",
        "review_title": "One of the worst films of all time.",
        "review_detailed_main": "This by far is one of the worst movies I've ever watched and along with grease 2, Halloween 3 season of the witch and more. Holy crap who thought this was a good idea? To make it worse it got a sequel! I would never subject anyone to this movie unless I wanted to torture them lol. Definitely skip it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "iremsturk",
        "review_rating": "1",
        "review_title": "What is going on",
        "review_detailed_main": "It deserves a -10 for that stroller scene where the literal babies flirt."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "yellowzebra-24592",
        "review_rating": "1",
        "review_title": "O...M...G",
        "review_detailed_main": "I remember seeing this years ago with my kids in the theater. I don't mind kids movies aimed at kids and for kids, but this was the most god-awful worst movie I've ever seen in my life bar none."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "injury-65447",
        "review_rating": "1",
        "review_title": "An unholy abomination",
        "review_detailed_main": "I thought I might enjoy this as a joke but it's actually terrifying and unwatchable."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "vip-danii",
        "review_rating": "5",
        "review_title": "Come On!",
        "review_detailed_main": "Seriously, it looks like people either really love or really hate this movie. It has an extremely low rating on IMDb (currently 2.5), which, in my opinion, it doesn't deserve.\n\nAlright, so it's a dumb movie. But, come on, it's a comedy... for kids! It's not supposed to be serious or realistic. It's supposed to provide entertainment. And it does... to some extent at least. It does have a few funny moment, you have got to admit.\n\nKathleen Turner is miscast, though. She makes a terrible antagonist. Her performance was weak to say the least. Then again, the same can be said about most of the cast.\n\nI did find the sex joke between two toddlers amusing, but yeah, it WAS kind of inappropriate, as many reviewers have pointed out already. Not a big deal to me personally, as long as it's funny, and it was.\n\nSo no, it's not \"the worst movie ever made\". I thought it was watchable, and, in fact, somewhat entertaining.\n\nThen there's those, who have left raving 10 star reviews, saying that this is this movie is \"genious\"... you guys must be out of your minds.\n\nIt is nowhere near \"good\", let alone \"genious\", but, like I said, it's a dumb comedy for kids, that some adults might find mildly amusing at times. Nothing more, nothing less."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "BandSAboutMovies",
        "review_rating": "1",
        "review_title": "Hate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "sarah23s",
        "review_rating": "10",
        "review_title": "Defintely not WORST",
        "review_detailed_main": "I was shocked to see that it wass listed as so, We are very fond of it and the kids have a ball watching it. What is wrong with not being all blood or about car chases.Come on people, there is more to movies the special effects.Many should rewatch the movie and see the charm it truly holds.\n\nAny more movies are all about violence, while this has some of what could be termed mild violence, on the whole it is a film the whole family can enjoy. It is a movie that we will watch over and over. While I wouldnt reccomend making a sequel to it. I would reccomend to my friends and family to watch it. The idea that it is somethign that COULD really happen as far as babies being raised and studied, not the being so intelligent part. You just never know. Give it a chance it doesnt derserve to be on the WORST list."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "delfinhatt",
        "review_rating": "6",
        "review_title": "Rock'n'roll",
        "review_detailed_main": "Good movie but ugly babies! 6/10\n\nWho is the big guy in overalls? At first I thought he was their plumber, but they were weirdly close to their plumber. Is he a relative to the babies? Is he a farmer?"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "bellino-angelo2014",
        "review_rating": "1",
        "review_title": "Truly deserving of its status as one of the worst movies ever made",
        "review_detailed_main": "The movie is about a laboratory called Baby Co where some scientists led by Elena Kinder and Heep (Kathleen Turner and Christopher Lloyd) keep super-genius babies in safe laboratory conditions. In the meanwhile the geniuses' twins are raised in a kindergarten facility led by Doctor Dan Bobbins (Peter McNicol) and his wife in order to determine if the teaching methods of Baby Co create smarter babies. One of the babies, Sly (most likely a reference to Sylvester Stallone) is much smarter than the doctors and spends most of the movie hiding and attacking those folks in a much dumber version of HOME ALONE, and, when one night finally manages to escape the laboratory and after a series of events meets the identical twins, he organizes with them an attack to the doctors.\n\nThere are three types of bad movies. One is the super cheap bad movies such as MANOS THE HANDS OF FATE, KING DINOSAUR and ROBOT MONSTER. These have incredibly low budgets and can't help but stink, but they are a lot of fun to watch because they are so poorly made. The second are movies that are vacuous but with a good budget, such as ED, CHAIRMAN OF THE BOARD and KAZAAM. These are a bit watchable but generally are a bit insulting towards your intelligence... and you can't certainly blame the budget for being that bad. The third type, and BABY GENIUSES is the king of this type, is like the second: they are made with a huge budget but they manage to do something bad movies normally don't do; they are so annoying and worthless that you feel like all your braincells vanished!\n\nBABY GENIUSES is a horrible movie that made me feel dumber and enraged after watching it. About the only movies that caused me such a visceral reaction were SANTA WITH MUSCLES, BEWITCHED and DADDY DAY CAMP. The more and more you watch the movie you really wonder how the mighty such as Christopher Lloyd and Kathleen Turner have fallen for being in such a movie (and this movie killed Lloyd's career forever), while for Peter McNicol and Dom DeLuise... they were right in their element. You wonder that because the premise is so dumb, the humour so crass and the movie is full of jokes that are only desperate attempts at humour.\n\nHowever, if you think watching babies severely injur adults, kick them in the forbidden zone (too many times to count), making adult jokes or many pop culture references, this movie is perfect for you just like its sequel (and it makes you wonder how on Earth is allowed to make such movies). Think, for a second, of JINGLE ALL THE WAY, BABY'S DAY OUT, HOME ALONE 3 and BABE PIG IN THE CITY all merged in one film and written by incredibly stupid and talentless 10 year olds... this is BABY GENIUSES and it truly deserves its place on IMDB's Bottom 100 (the list of the 100 worst rated and reviewed major movies of all time). Avoid it at all costs like poison, and if you have someone who would force you to watch it... RUN!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "Not the kind of bad that makes you smile. This is numbing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "steven-richards4",
        "review_rating": "2",
        "review_title": "Meh",
        "review_detailed_main": "As far as kid friendly movies go. This isn't the worst. But it's definitely close. I might be expecting too much because the average kids movie these days has plenty to keep adults entertained but even compared to its 20 year old peers this is bad."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Sheol1812",
        "review_rating": "5",
        "review_title": "Listen",
        "review_detailed_main": "For what it is worth - and given the target audience - this is your run of the mill family action film. It's not Spy Kids but it's also not Disaster Movie.\n\nIt's about babies. And these babies are geniuses. About the only reason I'd expect this low a score is the forced \"intellectual\" conversations between the babies."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "travis010",
        "review_rating": "1",
        "review_title": "Cute Movie",
        "review_detailed_main": "Despite what everyone else is saying, I liked this movie. I am a fan of the Rugrats and this is like the live - action part. The special effects are great and the movie is funny. I would suggest this movie to most people."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "sfumatosprocket",
        "review_rating": "2",
        "review_title": "Big Baby Trump Robot",
        "review_detailed_main": "In 1999, Trump ran for POTUS; yes, really. This movie is full of subliminal warnings of having a Baby POTUS. But like the real thing, this movie is terrible. Especially because we missed the warnings, which included this bomb...yet it worked in 1999. What changed Mitch? Nothing. $$$$"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dbarr123",
        "review_rating": "4",
        "review_title": "Not terrible.",
        "review_detailed_main": "Enjoyable to watch. Only problem was there wasn't much of a plot. Still a decent movie."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "juicy_watermelon52",
        "review_rating": "10",
        "review_title": "Very Good Movie",
        "review_detailed_main": "Hello everyone, Now first of all i'd like to say that this movie was fabulous and all you reviewers should think so too.\n\nEven though most parts of the movie were obviously fake i still thought it was hilarious to see a group of toddlers talking like adults in a way that only they could understand.\n\nOK so yes the acting wasn't very good but who cares if it can make at least one person laugh then the director should be happy.\n\nI think that the movie reviewers are too old to be reviewing a movie of this kind. See this movie is for kids not for adults and adults probably won't understand it as well as kids.\n\nNext time choose reviewers who have humors!!!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "LetsReviewThat26",
        "review_rating": "6",
        "review_title": "silly family fun",
        "review_detailed_main": "I was surprised with the low rating on here. Sure the movie is a little stupid but that's the fun of it. Its like look who's talking mixed with a little bit of Garfield 2. I liked how the babies were well trained and actually worked well in the film. The cast were all good with fun people that were relevant back then, and still are today. Overall it was just a fun little family film that doesn't make you think to hard."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "AngelHonesty",
        "review_rating": "3",
        "review_title": "Great Movie for Kids. Horrible for Adults",
        "review_detailed_main": "The movie was meant for children to watch. Just like those days when we used to put a child in front of the TV to watch Teletubbies, this is almost the same thing.\n\nWatching it from an adults point of view its very boring. And not entertaining at all. There is next to no plot. The kids who are supposed to be all knowing, you would think that would be the main focus of the movie. About how smart they are and what they can do. No. Instead it's about a kid trying to escape scientists and the scientists trying to catch him. It's more of a run away and hide or beat them up if you have to situation. Over and over again this seems to be the plot of the movie. Also the two year old's are six in real life. Im not sure why they would try and convince us that a six year old could be a two year old. The mouth CGI is also really bad. And it should be easy for an adult to catch a two year old. I don't care if he knows kung fu. There's no way a baby could kung fu himself out of a situation with a trained adult. And it makes no sense why anyone would let a two year old wonder the streets at night. Someone would have grabbed the kid.\n\nBut again, it's all very silly. And very G rated. Meant for little kids to watch. \"Every baby might know the secrets of the universe\""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "99 Dalmations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "olalara",
        "review_rating": "10",
        "review_title": "An Under-rated Great Family Movie.",
        "review_detailed_main": "Wow what an excellent movie!. I could not believe why it has been extremely under-rated. It is so amusing,funny and witty. Critics are sometimes narrow-minded and unfair in their reviews. Most kids all over the world will enjoy watching a fantastic comedy movie with superb action and great cinematography.\n\nPlot of Baby Geniuses: Two scientists, Dr. Elena Kinder (Kathleen Turner) and Dr. Heep (Christopher Lloyd), use genius-baby studies to fund BabyCo's theme park \"Joyworld\". According Dr. Kinder's Research, babies are supposed to possess vast, universal knowledge and speak a secret yet impossible-to-translate baby prelanguage called \"Babytalk\". At age two, however, the knowledge and language are lost as the babies \"cross over\" by learning how to talk. Most of the babies that were raised in Dr. Kinder's vast, underground research facility were adopted from the Pasadena orphanage, transformed into geniuses through use of the Kinder Method, and then used in experiments to decipher the language used by the baby-geniuses.\n\nOne mischievous toddler, Sylvester (AKA Sly), makes repeated attempts to escape Dr. Kinder's research facility and one night, Sylvester goes into a dirty diaper truck and he actually succeeds. The next morning, one things Sylvester does not expect is to run into his twin, Whit, in a mall playground. Although Sylvester and Whit share a telepathic bond, they have no idea of each other's existence. While the guards from Dr. Kinder's research facility capture Whit, mistake him for Sylvester, and take him back to Dr. Kinder's research facility, Sylvester is taken home by Whit's adopted mother, Robin (Kim Cattrall), who is Dr. Kinder's niece. After Dr. Kinder is horrified that Whit and Sylvester switched at the mall, she decides to do a cross evaluation on Sylvester and Whit. However, when she comes to Dan Bobbin's place, she realizes that Dan Bobbin can understand babies. After the attempts to retrieve Sylvester fail, Dr. Kinder decides to move the research facility to Lichtenstein, so that they can transform Whit into becoming a genius thanks to him getting bred by the Kinder Method (thus erasing his memories about his foster parents, foster brothers and foster sisters) and use him as an experiment to crack the code to \"Babytalk\".\n\nThe babies at Bobbin's place hypnotize Lenny (Dom DeLuise), the bus driver to drive to Dr. Kinder's research facility. Once at the research facility, Sylvester goes to the control room to set the robots from the theme park on the lab scientists. When the Bobbins return home, their natural daughter Carrie tells her father that the children are in Dr. Kinder's research facility. At the end of the fight Dr. Kinder captures Whit and takes him to the helicopter pad on the roof. Robin and Dan chase them to the roof, where Dr. Kinder reveals that she and Robin are not related, and that Robin was adopted at age two. After Dr. Kinder got arrested by the police, Sylvester and Whit come together on the roof to cross over.\n\nDan and Robin adopt Sylvester. Dan is still curious of the secrets of life, but as the twins have crossed over they no longer know those secrets. Carrie, their sister, doesn't reveal anything (just gives her dad a sly smile) because adults aren't meant to know their secrets.\n\nBuy This DVD!. It is GREAT!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "michael-kamison",
        "review_rating": "10",
        "review_title": "Visually-striking Genre bender that's fun for all ages.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "patrick-61",
        "review_rating": "10",
        "review_title": "Look Who's Talking meets Babe",
        "review_detailed_main": "I wasn't sure what to expect when I saw this movie (I went to a sneak preview) and boy was I pleasantly surprised! Forget Star Wars, this movie has some of the most amazing technology I have ever experienced! And the concept of talking babies - it's funny! I don't often leave a movie wanting more but I can't wait to see the sequel!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "healingruby",
        "review_rating": "10",
        "review_title": "Amazing Movie!",
        "review_detailed_main": "I don't get all the bad reviews, I thought this was an amazing movie with tons of stars who actually blended so well together, which is rare in movies! The Babies were adorable and so believable the special effects for the time were done so well! I thought this Movie was charming, creative, inventive, heartwarming, and all around entertaining! My 8 yr old daughter now in 2018 can't stop watching it!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jdhorne50",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "I love both movies baby geniuses 1 and super-babies baby geniuses 2 I have both on DVD and their both excellent movies I watch both movies a lot and their both really great movies sly and whit and Carrie are awesome from baby geniuses 1 and in baby geniuses 2 kahuna is my favorite character both movies are the best that the movie industry ever came out with and I can't wait till they come out with baby geniuses 3 that movie is going to be totally awesome. every on just wait till baby geniuses 3 comes out I'm telling everybody it's going to be the sweetest movie that they ever come out with I hope they come out with three or four more baby geniuse movies after the third one."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Smile!",
        "review_detailed_main": "You're watching a very cute, very family, very baby-safe motion picture with your family right now! What a clever idea - Baby Geniuses! Ha! I hope when I have a baby in the future that he is a genius when he's like 10 minutes old! Then, he'd go to elementary school when he's one, middle school when he's two, high school when he's three, and Harvard when he's four! Then he'll go to Cambridge when he's five, and at age six? He'll have all the time and money he could possibly want for all the cartoons and toys in the world! Man, if that dream became a reality...(And for most of you average joes, you'll wish that was the whole premise of this movie!)"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jgm7683",
        "review_rating": "9",
        "review_title": "Hilarious, and stunningly true",
        "review_detailed_main": "Before ever seeing this movie, I believed babies were capable of a lot more than what we're led to believe... for example, one baby starts crying in a crowded store, and suddenly babies are crying throughout the store. I dubbed this \"sympathy crying\" where they're all telling each other how bad they have it. (\"My mom didn't change my diaper for three hours! By the time I got her to change it, I had a really bad rash!\" \"Oh yeah? Well my dad forgot to feed me at six! I had to remind him for over a half hour before he finally brought in a bottle!\")\n\nSince I've seen this movie, I find it much easier to get babies to smile, and usually give them a knowing look when they start to fuss up... only to have them stop! It's amazing!\n\nThe movie is hilarious... Some people apparently think it's a little corny; these people are the same ones who can't watch a comedian without getting bored. The antics, and pure comedy, of this movie makes it worth a watch... I'm still trying to buy a copy; they say it's available, but try to find one for sale!\n\nEDIT: I've since gotten a copy and can watch the Diaper Gang all I want!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "spankyfry",
        "review_rating": "10",
        "review_title": "Get a grip!!!",
        "review_detailed_main": "Reading through the comments, it's obvious to me that a lot of people just take movies too seriously and have NO imagination at all. People, I don't really think the people who made this movie really intended it to be taken so seriously. it's FICTION. I thought they did a really good job with the special effects. I don't think they could have casted a group of cuter kids (except maybe Sly and Whit). And I stayed entertained through the whole movie. Why? Because I know the difference between fact and fiction."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "laxfreak98",
        "review_rating": "8",
        "review_title": "Why so harsh ?",
        "review_detailed_main": "This movie was made in the late 90's which already should tell you it won't have the best film editing and all those details that make movies now. We can't expect it to be a film genius. The movie was made to entertain 10 years old kids who have a wild imagination. I for one think it's hilarious and love to relive the childhood memory watching it and believing it completely. I think everyone needs to calm down and be more fun, live a childhood. Before I even read the reviews on here, I was thinking this was an amazing movie about babies that just made you laugh so much. Reading a few of the reviews I still don't get the complaints, if you don't have an imagination or never saw this as a child you should just stay away from this movie and any like it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "kody_elrafihi",
        "review_rating": "8",
        "review_title": "This Is Suppose To Be A Movie For Kids Not Adults.",
        "review_detailed_main": "i rate it 8/10 because if you think of it as a child and watch it you'll love it. i used to have the DVD when i was a little baby.. i used to watch it each day, because its a movie for kids, not adults.. so you can rate it as an adult. but you also gotta think about the kids side. its a fantasy for kids. its something funny to grow up on.\n\nits a great movie for kids, not that great for adults, but for kids its actually one of my favorite kids movie.. don't watch it. something called, if you got nothing nice to say, don't say anything at all! this movie was made for kids not adults, and the best idea is to buy it for your kids, not for you."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "pinkyy5",
        "review_rating": "10",
        "review_title": "Comments on the baby movie",
        "review_detailed_main": "I thought Baby Genii was a wonderfully sophisticated movie. Those babies are smarter than most people, no wonder all those jealous adults were upset with this movie. These verbally eloquent children were obviously cultivated for this movie; and one can only rave at the professional display of martial arts. Perhaps most people are not used to being babied but I'm sure these kids will be the future philosophers and stars of this planet. This show reflects the prenatal in everyone and our um-biblical connection to womb-ever it may concern. I thought dom Deluise was himself and the other actors were also quite convincing. The baby bashers who don't like this movie are probably a little too long in the tooth and may not actually recall the diaper decades. So, I'd like to recommend this show for all immature viewers of any stripe."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jakeamstrong",
        "review_rating": "8",
        "review_title": "Good fun, my kids liked it.",
        "review_detailed_main": "Kids found it entertaining, need I say more. I laughed too. Much better than bang bang shoot them ups; that we used to watch as kids. The conceptual basis was delightful. The actors were convincing and I liked the gags."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jennifer_ranson",
        "review_rating": "10",
        "review_title": "Don't take it so seriously",
        "review_detailed_main": "Look, when adults watch this it may seem stupid but I saw this movie when I was 5 and I loved it.\n\nDon't listen to what the critics say if you just want to watch a light hearted movie with your kids.\n\nI would fully recommend Baby Genuises.\n\nAfter all its a kids movie and kids will enjoy it.\n\nFor Gods sake lighten up! If you agree with what I have written please comment, and rate higher.\n\nthis movie does not deserve to be in the bottom 100 movies of all time.\n\nJenny Ranson thank you for reading."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "zakityzak",
        "review_rating": "8",
        "review_title": "This movie is cute",
        "review_detailed_main": "Anybody who is a mother will like this film, it is made to be cute, and that is what it is, cute. I love the babies, and the commentary, my two year old also loves it, he always asks for the \"baby movie\", those who enjoy feeling good, will like this movie, the ending is warm. The teen in there yeah he was weird but look at him at the very end. I do highly recommend this to others, and moms who have other videos about to burn out because of over use and something different than the same old bright colored characters. This movie is sooooo cute. I look forward to seeing the sequel, I sincerely hope it is a feel good as this one. Rent this movie and enjoy!!!\n\nI hope this comment is useful to you :-)\n\nMelissa"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "tsundae",
        "review_rating": "10",
        "review_title": "What film was created for...",
        "review_detailed_main": "For those not initiated in the BG Fanclub, Baby Geniuses is one of the best movies ever filmed since the invention of motion pictures. Shunned by certain members of the Academy in 1999, Baby Geniuses failed to be nominated for any Oscars due to too many dried up, haggard, pro-choice members who were terrified of the children in this film. Otherwise, this movie would have been awarded the highest honors for its superb acting, special effects, direction, and choreography. \"Puttin' on the Ritz\" anyone? One day, like Citizen Kane, this movie will be respected for the absolute genius it is and take its place as best movie ever. Suck on that, Ebert."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "UniqueParticle",
        "review_rating": "8",
        "review_title": "Kinda like someone else don't hate me but I love it!",
        "review_detailed_main": "Despite being a 2.6 rating among the lowest rated films of all time, I'm 27 and think it's heartwarming! Independent, super-duper precious and jolly fun. Haha the kid said \"Who designed this dress? Larry, Moe, and Curly\" The Three Stooges are awesome. Endearing and sweet 90's cheesy music, I recommend Baby Geniuses for great mindlessness."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "infinnitor",
        "review_rating": "10",
        "review_title": "bruh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "adamwilliamson-66919",
        "review_rating": "10",
        "review_title": "THIS MOVIE IS AMAZING AND A MUST SEE",
        "review_detailed_main": "If you like babies than this movie is for you it's funny and has a great cast of characters the plot makes sense makes you wonder what a great film it is please go see this film it is amazing so amazing u want to to go see it support the babies today"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "stalwar-14392",
        "review_rating": "10",
        "review_title": "Hamzah",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "zpwqfsf",
        "review_rating": "10",
        "review_title": "IGN review",
        "review_detailed_main": "This is one of the most underrated films of ALL TIME. this can be compared to Will Smith Wild Wild West. The story is simple but very compelling, this movie will make the strongest of men (and women) cry, laugh and smile\n\n\"everyone who has ever lived needs to watch this\" 10/10 -IGN"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "GarretMGreviews",
        "review_rating": "10",
        "review_title": "I can't believe the rating",
        "review_detailed_main": "Wow. I absolutely cannot believe it doesn't even have 3 stars, barely 2 1/2! This was a childhood favorite of mine. I'm a 90s kid (born '89). Of course it's not an Oscar nominated, blockbuster film or anything. It's meant to be silly but fun. This is exhibit A on why I don't ever judge a book by its cover, or in this case, a movie by its IMDb rating. Kid movies often get unfairly rated and this is a perfect example. It's got a pretty decent cast and the acting is surprisingly on point. The kid, oops I mean BABIES, are adorable like most are in kid movies. I definitely recommend it, especially if you have kids. They will love it."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jacobanersonboi",
        "review_rating": "10",
        "review_title": "Truly a masterpiece in cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "wolfmoon2",
        "review_rating": "10",
        "review_title": "Low ratings are bogus!",
        "review_detailed_main": "This movie does not deserve the low rating it is getting. It wasn't perfect, but it was really good. I haven't been through the ratings to see why, but I can only imagine that it must be something political. It is a fun story that talks about the intelligence children have before the \"cross over\" right around age 2 and become regular babies. Until then, they carry some universal knowledge. There is nothing about this film that could be worthy of the 2.5, or the bad reviews. Watch it for yourself and you be the judge. I have never seen a movie with this many major actors that received a rating thos low. I loved it!\n\nEdit: I started noticing consistencies in the low ratings. They came in in batches and contain a lot of the same dialog. Either they are bots, or some coordinated effort. Who knows why, but if they dont like it, they can eat sh... diaper gravy!"
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "chilefonee",
        "review_rating": "8",
        "review_title": "Don't take it too seriously...",
        "review_detailed_main": "I don't know why everyone and their cousins think they are expert critics while critiquing Baby Genius's of all movies but I guess here we are talking about this silly kids movie.\n\nIt's a movie about talking babies and weird deep state baby experiments that ponders on the idea of reincarnation with babies....it doesn't take itself too seriously so why should the viewing audience. It's a harmless late 90's family movie that kills time and has a few good laughs.\n\nI believe a grand majority of people need to just get over themselves and just let these films sit were they belong on the list of nostalgia and silliness."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dzieger",
        "review_rating": "",
        "review_title": "Take a ritalin folks...it a bad movie, but not _that_ bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "oligrettir",
        "review_rating": "10",
        "review_title": "This movie changed me for the better!",
        "review_detailed_main": "So i was dealing with crippling depression and sat down on my couch in my sad apartment and saw this movie on \"top movies on itunes store\" so i decided to watch this utter masterpiece. And let me tell you i looked at the world at a whole new perspective, this movie single handedly cured my depression. So i think i speak for everyone when i say this is the best movie ever conceived. Thank you for making his movie."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "ryan_mccarthy90",
        "review_rating": "9",
        "review_title": "Why Do Adults Rate Adults Rate This For Adults?",
        "review_detailed_main": "I was just a kid when I first saw this movie. I thought it adventurous, fun, and hilarious. You have a bunch of babies who are taken from orphanages and used as science experiences by evil scientists who want to learn more about how toddlers communicate.\n\nIn one of the toddlers, they find he's a genius and manipulative. He also has karate skills equal to a mix between Charlie Chaplin and Jackie Chan. Kids don't pay attention much to dialogue on an academy award level. They pay attention to characters that they wish they could be and story lines they wish they were a part of.\n\nSee what impression this has on your kids, not your high and mighty critique. I watched it a few years ago when I was feeling down. It was very nostalgic, because it made me want to fight the bad guys and watch Jeopardy."
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Brave Sir Robin",
        "review_rating": "",
        "review_title": "Horrific!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "jake-87",
        "review_rating": "",
        "review_title": "BABY... You don't have to be a GENIUS to hate this one!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Robo-18",
        "review_rating": "",
        "review_title": "There were cute and funny moments, but wait until out on video.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "blackdog3000",
        "review_rating": "",
        "review_title": "Warning:This movie may cause serious illness or death.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Starlights1987",
        "review_rating": "",
        "review_title": "The director of this film isnt a genius!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Victor Field",
        "review_rating": "",
        "review_title": "PLEASE tell me they aren't making a sequel to this...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "screw_loose2003",
        "review_rating": "",
        "review_title": "OH MY GOD!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "dagooch",
        "review_rating": "",
        "review_title": "An insult to crappy films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "aimeeault",
        "review_rating": "",
        "review_title": "Just something to impress ignorant people",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "This movie has birth defects . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "DoctorSkyTower",
        "review_rating": "",
        "review_title": "OH. MY. GOD.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "Painful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "great_sphinx_42",
        "review_rating": "",
        "review_title": "Baby Poo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "russellholmes",
        "review_rating": "",
        "review_title": "Better to skip this and watch Babe instead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "The Story Just Never Had a Shot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "sourapple",
        "review_rating": "",
        "review_title": "hardly entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Michael-113",
        "review_rating": "",
        "review_title": "My four-year-old said it really dragged.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "Crowbot-2",
        "review_rating": "",
        "review_title": "Congrats.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "SanDiego",
        "review_rating": "",
        "review_title": "Baby Geniuses is like soiled Pampers.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "RunningFromSatan",
        "review_rating": "",
        "review_title": "Didn't strike me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118665",
        "movie_name": "Baby Geniuses",
        "movie_rating": "2.6",
        "review_username": "tuttle183",
        "review_rating": "",
        "review_title": "Movies must be judged be its intended audience",
        "review_detailed_main": ""
    }
]