[
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "deepak-gang",
        "review_rating": "7",
        "review_title": "Fresh faces might have ruined it a bit",
        "review_detailed_main": "I have watched the original Tamil 3-4 times so far and I like most of the one-lines , subtle and non-gross humor. Also the fantastic music.\n\nBut the Hindi version might have lost something in translation. I watched it but its not a bad movie. I agree that the supporting cast has done a better job than the new hero-heroine. And the ending makes all the twists and turns pointless. But I guess Gautam menon was not sure if the Hindi audience would accept the same Tamil ending. I hope that someone who has fallen in love with a girl and lost her would be able to relate to the story. For the same reason, I urge all to watch the director's cut version with the alternate ending.\n\nBut still the movie is not as bad like the critics have reviewed. The whole point of the movie is that this is a story about a 22 year old boy who is acting like a 19 year and a girl who is confused and prefer to suffer than go against her parents. Don't expect super melodrama or cheap comedy or item numbers. I have lost count of friends who have told its their story.\n\nI give 7 stars because of the dialogs, music, camera, good performances by support cast."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "It doesn't offer anything new but isn't that bad at all as rated in the review market.",
        "review_detailed_main": "The latest offering from Bollywood once again reveals the dark side of today's \"Review Market\" prevailing in the Industry. Where last week's EK MAIN AUR EKK TU didn't really deserved the 3-4 stars ratings given by many, the current week's EKK DEEWANA THA also doesn't deserve the 1-2 star ratings by most of the critics, stating it as a very poor film. So there is evidently a huge imbalance in the reviews which largely get influenced by the production house and stars in the film instead of the product's actual content.\n\nComing to EKK DEEWANA THA, it certainly isn't any great piece of art or path-breaking film with some fresh ideas. It talks about the same ages old love story between two young souls, who not only have a slight age difference but they also come from two extremely diverse regional & religion backgrounds causing all the problems. The script can easily be called predictable as we have already seen the same emotional drama umpteen times before on the screen. But still EDT isn't a complete washout as being written in many reputed reviews. It's a sweet film with a refreshing first half which keeps you engaged and entertained till the interval. Plus it also has its moments post intermission resulting in an above average film far better than many craps churned out by some big production houses in the name of Love Stories.\n\nFollowing the current remake trend EKK DEEWANA THA is the Hindi version of director Gautham Menon's earlier 2 hits namely VINNAITHAANDI VARUVAAYAA (Tamil) and YE MAAYA CHESAVE (Telugu). In the initial reels it even reminds you of Kamal Hassan-Rati Agnihotri starrer EK DUJE KE LIYE which also revolved around a love affair in some similar circumstances. But as it progresses it moves on to a different path involving an interesting marriage sequence and its loving results. So what's watchable in this routine love-saga? The answer comes in the form of Amy Jackson, Manu Rishi and to a certain extent Prateik too.\n\nHowever the sole charmer in the film remains Amy who looks stunningly gorgeous especially in the Indian outfits. Though she doesn't get a well defined character (who remains confused) along with a poor make-up in many scenes, still she keeps the viewer hooked on to her innocent beauty till the end and acts well. The second reason why EDT rises above a routine love story is Manu Rishi, who holds the film together with his natural style and entertaining one liners particularly in the first half. But if only he had something more to do in the script, it would have resulted in a much finer product for the audience.\n\nPrateik manages to impress in his casual approach towards the role but the boy seriously needs to work harder on his dance and emotional scenes. At times both his body language and dialogue delivery goes in an awkward zone which hampers the impact of his otherwise fine performance. In the supporting cast Sachin Khedekar performs the best as Prateik's friendly father.\n\nApart from the actors it's the Cinematography (taking you on to a Kerala tour) and few songs by A. R. Rahman which raise the standard of this routine love story. Yet the maestro isn't in his full form in the movie as he once again gives a soundtrack below expectations with traces of \"Kabhi Kabhi Aditi\" (Jaane Tu Ya Jaane Na) in his \"Hosanna\"\".\n\nActually EDT is a fine film till the intermission and it doesn't disappoint the viewer despite of having a routine storyline mainly due to its fresh pair and Manu. In fact this is the reason why Love Stories have always been there in every decade featuring two unknown faces since they can easily make an instant connection with the public and can deliver a Hit.\n\nBut EDT is not able to reach that crescendo due to its pretty weak second half and a prolonged climax which eventually ends on an \"All is Well\" note unexpectedly. It would have been a different film altogether if it had a more realistic climax where there was no re-union of the lovers but they still remained friends living their separate lives in two different parts of the world.\n\nThe writers falter in a big way as they are not able to define the character of the girl in a justified manner. Yes a girl in love remains always in a dilemma to choose between her boyfriend and her parents. But the writers here give no proper justification for their parting away from each other all of a sudden. Moreover it all starts dragging in the last 30 minutes without any purpose, which fails to leave any kind of loving impact on the viewers.\n\nIn my opinion the love-affair in the film should have ended right there in the Taj Mahal corridors showing a married Amy saying good bye to Prateik and the film should have ended with everyone praising the directorial venture of Pratiek being loudly cheered by Manu Rishi standing along with him in the theater. That would have been a more ideal and realistic ending of a tragic love story as I see it.\n\nAnyhow, in its present version EKK DEEWANA THA is a sweet film with a fine first half and a beautiful Amy which surely can be watched once without any doubt. So if you are really interested in love stories, then please forget all the negative reviews you might have read about the movie as it certainly isn't that bad at all as being projected in those well publicized write-ups."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "shamimriaz",
        "review_rating": "7",
        "review_title": "Good romance with very good music...",
        "review_detailed_main": "Another remake of Gautham Menon from his own Tamil movie. A Telegu version was made after the Tamil one. So, this Hindi version is the 3rd version or 2nd remake of the original one.\n\nNowadays, a lot of Hindi movies are being remaked from Tamil originals. And, people who follows Tamil movies believes that Tamil movies are big time ahead of Hindi Cinema. So, we see a lot of frustration from those audiences who watched either of the two early versions of Ekk Deewana Tha!\n\nHowever, I will recommend to those who loves romantic bollywood films and hadn't seen any of those early two versions, should watch. I really loved the movie, though it have some technical issues. Pratiek Babbar did a really nice job with the leading role of Sachin, a wanna be film maker who makes himself a successful one at the end of the story. He falls in love with his neighbor Jassi and chases his love with the struggle of being a filmmaker. The movie has lots of good music by A R Rahman. Amy Jackson played the role of Jassi and did an OK job with her Bollywood debut. She is a stunning British beauty and its really a treat watching her on screen! Kerala is another beauty of the film with some lovely cinematography.\n\nDirector Gautham Menon did his job handsomely keeping a good slow pace without any monotonous pause till the end. Overall a good 7/10 romantic bollywood film with some good cinematography and music!"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "lokender-kumar",
        "review_rating": "",
        "review_title": "Truly amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "assasinator_m",
        "review_rating": "6",
        "review_title": "story good but could have been better.nice movie in spite of its a remake of \"Will You Cross the Skies for Me?\" a south Indian film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "darshancruz",
        "review_rating": "2",
        "review_title": "The director got the title wrong; maybe Ek Deewani thi would have made more sense.. well, never mind!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "dr_hgj-48231",
        "review_rating": "6",
        "review_title": "A new love pair thinking also",
        "review_detailed_main": "A romantic films must have objections! Here culturally, religiously and geographically diff origins. Love birds are strict south keralian Christian girls Dad, with Bombay Marathi boy. They are recent graduates strictly and happy go lucky, young man rush all included. Chasing the girl, hitting the girls brother in afight added hurdles! Some how girl sent to Kerala where wedding in community planned. Boy also visits church ceremony with a friend! Girl says NO to wedding too! Boy is now deeply touched by the bold attitudes. The boy likes a career in film photography. Mr Ramesh Sippy guest appearance knitted! Boy has dreams ideas and hard work away from routine and a foccussed life again few twists turns leading to end with a good using a brain simple steady protocols. A fresh feeling in Pratik Ami with many new decorative pieces film gives a satisfying out come."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "nikhil-damodaran",
        "review_rating": "5",
        "review_title": "BAD!....No story",
        "review_detailed_main": "Ek Deewana Tha\n\nThere is nothing to make you fall for this one!....if you are not already tired of watching boring big Bollywood cinema, you would certainly be after this one... Not to be too cynical about the movie, but it doesn't really live up to its make! In fact why did they remake this movie at all? And if it was hit in Tamil and Telugu, it would have surely better written dialogues.\n\nThe script - is by far the most annoying! Not only does it not have any coherence, the story is also story less. There are other films which do not have a story ( Chalo Dilli), but have had better outcomes in terms of the dialogues and the direction. But this one fails in all counts. The boy falls in love with just one look, and chases the girl. She being Christian and a Malayalee, the boy ( a Hindu, from Mumbai) chases her to Allepy and witnesses her rejecting her marriage. The idea behind it was that she had something towards the boy, which she couldn't express. Finally the expression comes, and this is the part which is the most 'not thought' after. There could have been better dialogues at least. The effect of a Bollywood 'romanc-a-tainer' is just not there in this one.\n\nThe Actors - are as fresh as new college students needed training. They sure light up the space, cause there is nothing else to the movie that keeps me tied to it. Pratiek has done reasonably well, and given that he is starting his career is worth the shot. Moreover, fresh faces are welcome. But fresh faces just for namesake are where the movie again fails. Amy is not at all a 'Malayalee'. She was searching for expressions the entire movie. This was not a movie where her charms would work through her super model figure! This needed expressions, and dialogue delivery. The role of Manu Rishi was refreshing and was the only well-tailored character.\n\nThe direction - Barring the scenery in God's own Country, the film has little directorial skills to offer. A director's vision is something which comes out of the movie. Rather than aping the previous movies, if he would have added something which has a better context, it would have been better. If on the other hand he was not interested to change it, he could have still checked whether it is still coherent and the story flows! Alas, nothing was done, and nothing came out! For me the film has no other layers to figure out. The story could have made better sense, and had the intentions of bringing out a familial aspect to love stories, but it never reached its own aspirations. We would have to wait for 2 states adaptation for this issue to be re- screened again! Lets hope they treat it well next time.\n\nWatch More movies for now!...Don't give up so soon!"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "tjvyas83",
        "review_rating": "10",
        "review_title": "Just as the tagline states: A perfect romance ... more or less",
        "review_detailed_main": "In all honesty I've not seen the Tamil or Telugu version of this movie. But it seems people that have seen them don't seem to like the Hindi version.\n\nI was awaiting this film before even seeing the trailer. Once I saw the trailer I got even more excited. Loved most of the songs and finally went and saw the movie 1st Day 1st Show. Unfortunately I was the only person in the movie theater. That was kinda odd but cool at the same time.\n\nThe 2hr 45min film's biggest flaw is it's slow pace. But it makes up for it thanks to the super awesome songs, Kerala has been shot wonderfully, Prateik Babbar's brilliant acting. I hope he becomes the industry's biggest star. Amy Jackson did really well considering she's a first timer and looked gorgeous. The story was beautiful as well.\n\nOn the whole I'm happy with the product. The film failed at the box office which is quite unfortunate. I hope Gautam Menon continues to direct Hindi movies in the future. If you haven't seen the Tamil / Telugu version, watch Ekk Deewana Tha. If you have seen the Tamil / Telugu version ... no comments."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "aniket-com",
        "review_rating": "5",
        "review_title": "Direction, screenplay, editing really bad",
        "review_detailed_main": ".. so does the acting. Amy had a impressive presence and a great freshness throughout the movie. But other than that, the direction, screenplay and editing was really bad.\n\nWith a better actor and better technicalities, the movie could have been a super duper romantic flick.\n\nOnly good thing about the movie is amy's presence and kerala shoots. Nothing new in the story as well. Music was bit good, hosana is the song keeps lingering in mind all the time.\n\nI seriously wish, someone should do a better remake of the movie keeping Amy and kerala intact.\n\nFive * only for Amy and Kerala"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "mahi_born_beauty",
        "review_rating": "9",
        "review_title": "Gr8 movie my favourite of recent times",
        "review_detailed_main": "A movie for all the lovers....people who are passionate,enthusiastic and have an emotional side.The movie reminded me of old beautiful legends of Hindi which were truly based on love.Today love stories are not LOVE STORIES only...they have a mixture of comedy,action ...and thats why people dint like this movie.\n\nacting:superb !! storyline:emotional and realistic.\n\nAmy was stunning !she has a great career ahead!\n\nall those scenes when the guy is spellbound by the girl's charm are treat to the eyes.you remain on the edge throughout the movie although its a romantic one.\n\nThe movie made an after effect which today's movies lack totally! i highly recommend dis movie..go watch it with your love u'll enjoy it sincerely!"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "superindrajit",
        "review_rating": "5",
        "review_title": "Routine Love Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "himdesai",
        "review_rating": "",
        "review_title": "Gautam Menon, you have just lost a loyal fan of yours!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "ragneshjani",
        "review_rating": "5",
        "review_title": "Tollywood remakes can not attract Bollywood audience always... Here is an example !",
        "review_detailed_main": "About Ekk Deewana Tha(EDT): The film is  a remake of Tollywood hit \"Vinnaithandi Varuvaayaa\" ...but climax plot is inspired by  \"Ye Maaya Chesaave\".\n\nRHTDM fame Guatam  Menon may be  successful director of Tollywood but for bollywood   you will have to wait Mr. Menon\u0085\n\nA slow pace movie \u0085.. Which has  surfeit of Rahman's song\u0085.  Aaaahhhh ! Love at first site .... And romance in the film can not convince you in Toto.. Few plots are nice to watch... And rest of them are dragging the movie...\n\nPrateik  is getting better as an actor but still he needs to improve to carry entire film on his shoulder ! \n\nGorgeous Amy Jackson looks magnificent in the saree with her contours ! That is the only best part of hers in the movie !\n\nMaths of Amy Jackson may be good   In EDT  but chemistry and physics with Prateik  is not admirable ! \n\nSupporting actors have done better than the leads !\n\nTo conclude :  fresh bachelors, true Tollywood fan and few others who can correlate ..   May like the film..... Watch once if you really want to...or can be avoided !"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "haris-ali",
        "review_rating": "8",
        "review_title": "Its a very light film to watch...with amazing soundtrack",
        "review_detailed_main": "Prateik Babbar is an outstanding actor whose got a lot to offer. He proves in this film that he can do what ever a hero is supposed to do ACT, DANCE and FIGHT. His character in this film is a true depiction of how 20+ guys act these days. Props to the direction as well for highlighting that so well. Also Amy Jackson's performance was notably well seeing that she hasn't really done any Hindi bollywood films before.\n\nThe story on the other hand is pure yet simple love story with regular issues people face and the pace of the film matched the plot. Though I would have loved to see a bit more drama.\n\nIf your looking to see a light relaxing sort of film, this definitely falls into that category."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "royalroys99",
        "review_rating": "10",
        "review_title": "An Immortal Love story at least for me",
        "review_detailed_main": "I have seen mixed comments on this movie - I have not seen it's Tamil Original but personally I'll rank it among one of my bests. I have a reason to do so - I could relate every bit of it to my own love life (needless to say it was in total mess at that time). Feeling it personally makes a movie good or bad to watch. For me - it touched me. Other than that - this movie has an excellent couple of good songs. Prateik and Amy have given their bests and were totally into it while shooting. Specially the scene on the park of Taj Mahal - deep down into it, Prateik have given it a real touch. Prateik danced wonderfully great, but Amy lacked in this part. Worth a watch."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "abhimanyusagar",
        "review_rating": "9",
        "review_title": "A great love story",
        "review_detailed_main": "A very good love story with good acting..... And perfect music makes it more lovabale."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "iamjacksparrow",
        "review_rating": "8",
        "review_title": "A must watch Love Story",
        "review_detailed_main": "Probably the most underrated Love story in Bollywood bcoz it does not have a superstar running the show like bhai who has mere skills On the other hand the Real actors here have done a great job , the female character has portrayed a perfect role & the direction is at its best 1 must not miss a movie as thi 1 herw"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "umertanweer",
        "review_rating": "8",
        "review_title": "A simple, feel good and realistic love saga true to it's cultural roots as well as modernism",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "vishal-lovelorn",
        "review_rating": "",
        "review_title": "luckily ekk hi deewana tha",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "officeabhinav",
        "review_rating": "10",
        "review_title": "Amazing storyline",
        "review_detailed_main": "Its a feel good movie and it was really great to watch this movie."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "jmeena-42580",
        "review_rating": "10",
        "review_title": "Lovely Story, Must Watch",
        "review_detailed_main": "I am here to write this review because It was fantastic romantic movie, good story, Music and direction.\n\nI have watched this movie multiple times and It relate a lot with everyone at some point of time, Location and songs are good in movie and Indian family touch also there which is very relatable.\n\nIf you are at under 25 then you will relate a lot with this movie.\n\nI am very critical reviewer about movies, And do not give much rating to even for good movies (leave space for some improvement) but I will rate this 9 out of 10.\n\nDo not Read much review, Just Watch it and I promise, You would love it."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "ankitkumarparte",
        "review_rating": "10",
        "review_title": "GREAT, BEST ROMANTIC, AWESOME MOVIE",
        "review_detailed_main": "\"Great\" romantic movie, and music by A. R RAHMAN sir javed akhtar sir excellent work. The story is awesome. Direction & cast is awesome, I've seen this movie many times 😍"
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "abhishekexess",
        "review_rating": "10",
        "review_title": "Great work done. Realistic Relatable hoping for the same ending as the movie got... loved it",
        "review_detailed_main": "Any indian adult can feel the movie just felt the movie based on reality of most of the couples. Enjoyed alot."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "saidurdhkbd",
        "review_rating": "10",
        "review_title": "i love this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "adityaydv-52001",
        "review_rating": "10",
        "review_title": "Underrated ..My favourite",
        "review_detailed_main": "Far far better than current bollywood movies.. Best romantic movie in bollywood.. I am falling for Amy...kua acting ki hai.."
    },
    {
        "movie_id": "tt2126282",
        "movie_name": "Ekk Deewana Tha",
        "movie_rating": "6.1",
        "review_username": "kontactalok",
        "review_rating": "10",
        "review_title": "One of my favorite love story in bollywood",
        "review_detailed_main": "I don't know why people have rated is low it should be atleast more than 7.5 stars.\n\nThis is an amazing love story full of emotions I have watched it more than 5 to 10 times since 2012."
    }
]