[
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "fillerruth",
        "review_rating": "3",
        "review_title": "From 1997 to 2017, what has not changed at all in this film is its inherent misogyny and racial jokes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ironhorse_iv",
        "review_rating": "3",
        "review_title": "Please, don't activate in your DVD Player! It wasn't wonderful! No twin magic can save this Bollywood film. This movie was awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "vigesh",
        "review_rating": "4",
        "review_title": "copy and paste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "saketsaurav-86828",
        "review_rating": "",
        "review_title": "Bollywood is not progressing because of this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "chinu-97000",
        "review_rating": "1",
        "review_title": "this is the kind of movie because of which people think Bollywood sucks.",
        "review_detailed_main": "a guide on how to make a Bollywood movie.\n\n1) take a guy (who thinks he can act but in reality a goat can act better then him) he must be son of a director or an actor. 2) take some hot girls(acting skills not required coz no one gonna watch there acting anyway) 3) copy script from Hollywood or tollywood.\n\n4) take old songs n put some shitty music in it(lets call it remix) 5)make girls dance to those shitty songs in short skirts n let the guy show his abs.\n\n6)go to every accessible place on earth for promotion.\n\n7) cross your fingers and hope for stupid people to watch your movie.\n\n8)profit."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "kimmyf-63773",
        "review_rating": "1",
        "review_title": "Rubbish and crap",
        "review_detailed_main": "Don't watch this really stupid movie, even if you get free tickets. Acting is pathetic, story is crap, the only thing good is Jaqueline Fernandez only because she looks good. If you have watched the first part, there is absolutely no difference just additional stupidity. There is unnecessary fight scenes and overacting. Even the jokes are not funny. Watch this movie if you want a free headache. Still recovering from mine."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "DeadMan66",
        "review_rating": "1",
        "review_title": "Movie gave me Cancer.",
        "review_detailed_main": "I thought the 90s were already over. Don't know why they choose to remake the movie and call it \"Judwaa 2\". Everything was same like the early movie \"Judwaa\" then what's the point in making remake. I think Bollywood is running out of story.\n\nThey just copied everything don't know what to watch. Movie made me sick can't tell about acting also when all frames are cliché.\n\nIf you know this is a remake you are old too. I could write better stories than this in my sleep. Call me Bollywood."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "jebaanika-04006",
        "review_rating": "1",
        "review_title": "Awful CopyPaste",
        "review_detailed_main": "Varun dhawan doesn't know how to act still he tries... I don't know why This is so awful I don't understand why do opeople make such brainless films...it spoiled an iconic film like Judwaa with full on copy paste...with this film its clear that David dhawan has made it only for his son but the son of nepotism tried to copy salman by acting like Govinda...its name should Bhaadwa2 not Judwaa2 this film doesn't deserve the iconic tittle judwaa...wastage of money and time... Now give me my money back"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "sahilsharma56",
        "review_rating": "1",
        "review_title": "Why would you still go to watch a movie in 2017 which has a story used in 90's.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "gokulchandanirinkesh",
        "review_rating": "6",
        "review_title": "Not Bad!",
        "review_detailed_main": "I had a good luck with this because I haven't seen Judwaa 1 and the fact that max. of the movie is copied didn't bother me.The movie is entertaining and enjoyable. Varun Dhawan is the pillar that holds the movie and keeps you entertained.A good movie but nothing special.You will surely enjoy it if you haven't watched 1st part."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "martin_paes",
        "review_rating": "1",
        "review_title": "don't waste your cash",
        "review_detailed_main": "dint understand why do Indian producers waste money on stupidity VD the actor seems like the most stupidest actor of Indian cinema 2017\n\nand to add this film , nothing compared to J 1\n\njust non sensible movie . all actors look desperate to shine but none did.\n\ni can just rate its time waste and 1 star"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "akshat-43690",
        "review_rating": "10",
        "review_title": "Review",
        "review_detailed_main": "Very good, awesome majedaar movie. I think old people who have watched judwaa 1 doesn't found it interesting but I loved this movie. Nice acting by my lovely Tapsi pannu nd mah bro Varun Dhawan."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "nitish-thebest-191995",
        "review_rating": "7",
        "review_title": "Not up to the mark but still enjoyable !!",
        "review_detailed_main": "No logic, no story....Just nonsensical entertainment,few really laughable scenes,cliché action sequences,old yet enjoyable songs, fun-filled acting by the 2 actresses & an energy-packed performance(including over-acting) by Varun Dhawan sums up Judwaa 2 !! I knew the sort of movie I was going to watch so I enjoyed it thoroughly,apart from some boring portions. :) Having watched Judwaa previously, this one brought back some good old memories of it's predecessor, with certain scenes almost completely copy-pasted, including the dialogues.Varun has tried to pull this off extremely well and almost carries the entire movie on his own shoulders !! Some people might literally find the movie nothing less than a disaster....but if you know this kind of cinema,if the masala entertainers are your thing, you won't be that disappointed. Leave your brains at home & dance to the \"tan tana tan\" with the Dhawans, provided mindless entertainment amuses you."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ketgup83",
        "review_rating": "1",
        "review_title": "Garbage !!!",
        "review_detailed_main": "20 years back David Dhawan made the comic caper Judwaa, which was illogical, but still a light entertainer with rib-tickling comedy scenes and good performances. Push forward button to 2017, Judwaa 2, made by same director, same premise, same scenes and even same background, yet to fails to deliver.\n\nJudwaa 2 tells the story of twins who gets separated at their birth due to unusual circumstances and meet each other in their adulthood.\n\nSometimes I wonder whether Bollywood prepares any script before directing any film. Spending so much on location, songs and dance would not give inception of a good film unless script is thoroughly worked upon. There is no definition of Story, Script and direction tin Judwaa 2. The main drama unfolds in the later reel which again is intolerable with screenplay written by a school kid. Editing is horrible. The torture goes on for almost 2.25 hours. Art direction is good. Cinematography is nice. Songs are tuneful (again all the songs. baring one, is lifted straight from the original. Dialogues are less-impacting. Performances are over- top\n\nOverall, a pathetic film in every sense. Poor- 1/5"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "herculesthelegend",
        "review_rating": "1",
        "review_title": "worst movie of 2017",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "rahulpadhi91",
        "review_rating": "1",
        "review_title": "An irrelevant ignorant failure",
        "review_detailed_main": "Other than the awful script the only thing which is worse in the movie, is that you have to bear the awful overacting of VARUN DHAWAN....the only good thing about the movie was cameo of Salman khan and surely that say's a lot about the quality of the movie...wouldn't recommend it to even ISIS"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "arpit_gupta",
        "review_rating": "1",
        "review_title": "Horrible Movie",
        "review_detailed_main": "There is nothing to special to write about this movie. Even if I write the most negative review, that will also be nothing in the honor of this movie. bad acting, bad direction. They din't even tried to create a new story with the concept of twins. Same old movie with new characters. Even songs are same. Pathetic. And that pathetic acting by that so called actor Varun Dhawan. Nepotism sucks. Tapsee Pannu ready to ruin her career from this bad movie. Stay away from this movie. Or the choice is yours. Your money your time."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "mangbho",
        "review_rating": "1",
        "review_title": "Usability Suggestion to IMBD : Please include minus rating . :D",
        "review_detailed_main": ":D I am not able to find minus rating , and this movie does not deserve even 1 rating ..it's unfair for this movie and Varun Dhawan . Please add minus rating so we viewers can give - rating to these type of great movies ."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "Rahul143125",
        "review_rating": "1",
        "review_title": "Judwaa Rebooted.",
        "review_detailed_main": "Trying to create the same magic after 20 years, David Dhawan makes a disaster known as Judwaa 2 which stars his son Varun Dhawan in a double role.\n\nDavid Dhawan directing a film after 3 years and that too a remake of one of his own films which was a hit in 1997 seemed to be exciting before it's release but eventually it lands up becoming a mindless entertainer.\n\nSachin Khedekar who plays the role of a father of twin sons who helps the police to catch a smuggler, gets in trouble when that smuggler takes one of his twin and keeps him on the railway track. But that child is saved as his brother turns on the right side and as they both have a reflex action the one on the railway track also turns. I laughed sarcastically at this scene and this same continues throughout the film and makes me get irritated.\n\nThe twins Raja and Prem are played by Varun Dhawan, his performance is like a toothache. Varun has delivered the same performance which was in Main Tera Hero. Varun's SRK mimicry is also preposterous.\n\nScreenwiter Yunus Sajawal has written a horrible screenplay, which should be avoided these days. Actually I can't get it that even after 20 years, such kind of screenplays are written and are also accepted. The dialogues are penned by Sajid - Farhad which are partially funny, the dialogues like \"Ammi jaan kaha karti thi.....\", are contempt. Thus by writing such screenplays and creating no logic makes the Indian audience's mentality the same as it was 20 years before.\n\nIf I take a film like The Terminator (1984) as an example, that was written and directed by Cameron and was really nice. But in 2009 he made Avatar which was also good but better than his previous films. That happened because he didn't try to create the same magic. Over here the writers have written the same cliché screenplay and the director has directed in the same manner which makes me bored. In one of the scenes while diffusing a bomb Raja says that he should cut the red wire as red was lucky for him. This scene makes me completely baffled and later becomes terribly annoying. Thus the screenplay and direction lacks innovation.\n\nSomething that I liked in the film is Ayananka Bose's cinematography, which is top-notch. The frames are really impressive. Also the editing goes well.\n\nI really don't get one thing that what are actors like Pavan Malhotra and Sachin Khedekar doing in such a film? Such great actors in such a film! I really didn't like it.\n\nComprehensively, this cynical film has a lot of funny scenes that make you laugh for no reason as it's a film which makes no sense. I'm going with one out of five stars.\n\nRATING: 1/5"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "g_aparna",
        "review_rating": "",
        "review_title": "Judwa 2 – Film defies astrology so totally!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "stefan-526-296130",
        "review_rating": "7",
        "review_title": "This is a funny movie and yeah the have to be there dances are not that awkward",
        "review_detailed_main": "For starters the locations were chosen well and are a good appetizer.\n\nWhen I wrote this review there were hardly any votes and the rating was 3.7. Well, it is definitely an above 6 for me, and for some funny scenes it jumped just over 6.5, so I could give it a 7. I don't regularly watch Hindi movies, but I have seen good ones and bad ones. This one was more towards the refreshing ones.\n\nIt got all the needed distractions like the BMX chase, some roof and street jumping, so it never really got boring. Some nice action scenes which could have done with a bit less violence. So please do not take your one and two year olds like the guys next to me in the cinema.\n\nThe main actor, Varun Dhawan did a solid job, playing these two different characters, Jaqueline Fernandez seemed to enjoy the dance lessons before and was in sync with Varun, and Tapsee Pannu, well, she is just gorgeous.\n\nAll together a nice comedy with some sidekicks to other movies like Three Idiots. I enjoyed it. I tend not to over analyze movies."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "aesaansheikh",
        "review_rating": "1",
        "review_title": "Worst Movie of the Year",
        "review_detailed_main": "*This movie is a Ctrl C + Ctrl V of the classic Judwaa.* Varun Dhawan proves to be an annoying on screen presence while his so loving dad (David Dhawan) centers the whole movie on his son. I feel sorry, but I can't stop myself from taking crap about this film, because it is CRAP, and so I'll save my energy and another dose of mental illness trying to recall this movie."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "diyaurbaatihum",
        "review_rating": "10",
        "review_title": "very good film by David DHAWAN",
        "review_detailed_main": "I went to see this film when it came out and I really enjoyed it because of the cast and story line . I like David DHAWAN film a lot but found this one very funny and catching . The cast is very good and even though varun dhwan is my favorite actor and jaqueline fernadez and tapsi pannu is my favorite Actress I really enjoyed this comedy Romance film"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "anupapu8",
        "review_rating": "7",
        "review_title": "This had the same Soul as the Original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "rai-15799",
        "review_rating": "1",
        "review_title": "Poorest sequel in Bollywood History",
        "review_detailed_main": "Poorest in all categories. Weakest acting, poor direction, no screenplay, no story, bad music mix and there is nothing at all to it. Hoped for some really great comedy of the year from super hit comedy director \"David Dhawan\", but he fails in all areas.\n\nDirector just ruined the classic super hit Original Judwa with Salman Khan. I am more disappointed about that actually. Original judwa was and still is fantastic flick to watch but this remake/sequel ruined not only itself but the original one.\n\nMay be one day these comedy makers would reLearn how to make a comedy, not giving hope on that so far."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "vaibhsri",
        "review_rating": "1",
        "review_title": "What a Crap - come out from movie hall in between",
        "review_detailed_main": "Why you make this film? No story line, No Acting ... Why Why WHy... Anyone can do better this director."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "arjunkamatmi",
        "review_rating": "3",
        "review_title": "Varun carries this terrible story on his shoulders",
        "review_detailed_main": "Judwaa 2 is an Indian Hindi film directed by David Dhawan starring Varun Dhawan, Jacqueline Fernandez and Taapsee Pannu. It can be called a Slightly Twisted Remake of 1997 film 'Judwaa' With very few changes in the story, this movie is very predictable for the people who have watched the prequel. This movie has very rare laughs unlike the prequel. The story seems to be illogical at so many parts. This movie does a decent job for the young viewers who just want mindless entertainers but for the elder or logical audiences, this flick is just a mess!\n\nPerformances - Varun Dhawan is good in his role of Raja and Prem. He does a good job in differentiating the characters of Raja and Prem and carries the burden of whole movie on his shoulder.\n\nJacqueline is simply an attraction for the male audience. She looks hot throughout the film. Her acting is definitely poor in this movie but even a good performance from her wouldn't make a difference to this terribly scripted film\n\nTaapsee tries her best to make this film a good one, she acts really well and looks hot.\n\nMusic - This Music Album is given by Sajid Wajid, Anu Malik and Meet Bros. The Iconic Song 'Chalti hai kya 9 se 12' and 'Oonchi hai Building' entertains. The lead casts dance really well. 'Aa Toh Sahi' is a good and entertaining song with good music. ' Suno Ganpati Bappa Morya' is a good tune with horrible and senseless lyrics.\n\nSummary - This is a below average movie with a good performance from Varun and Taapsee, a few laughs, a good looking cast and fantastic music.\n\nShould I Watch this? Varun fans and people expecting a mindless entertainer with glam and good songs might like this one but for the rest of the people, it's better if you stay away from this!"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "sat-austin",
        "review_rating": "1",
        "review_title": "UTTER NON-SENSE",
        "review_detailed_main": "The last one was dumb..the new one dumber....mainstrean bollywood commercial movies are just money-making,audience fooling business oriented movies...no use of a healthy brain to see these movies..."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ankit_mhaske",
        "review_rating": "1",
        "review_title": "Forget this movie exist.",
        "review_detailed_main": "If I could, I would rate this movie somewhere distant at minus infinity. I would be sleeping peacefully, had my friends not urged me to go along with them to watch this movie. MOVIE? No, it's one of the biggest stain on bollywood. What's that dirty smell? It's Judwaa 2. Yuck! That acting, that script, every effing aspect. I waste my time every now and then but then I'll forever regret I wasted my time on this whatever. If you've not watched this yet, count yourself blessed."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "anitij",
        "review_rating": "1",
        "review_title": "Nonsensical movie",
        "review_detailed_main": "Bollywood - pls stop making non sense movies. Nepotism will take bolllywood deep down the path of self destruction"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "kazihaque",
        "review_rating": "7",
        "review_title": "Fun-derful, brains switch off Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "rawatankit-19088",
        "review_rating": "1",
        "review_title": "Nothing but garbage",
        "review_detailed_main": "What is wrong with this film?the whole film is full bad jokes,I don't understand how anyone was laughing watching this movie.this movie is purely nothing but 100 percent grade A piece of monkey bile."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ishitaarora-72072",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "I love this movie it was superb varun dhawan done superb acting in this film he is the best actor"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "kutekrish",
        "review_rating": "6",
        "review_title": "Entertaining and fun movie - just don't ask too many questions !",
        "review_detailed_main": "Entertaining remake of original Judwaa which was done by Salman Khan. Varun Dhawan plays a dual role (Raja / Prem) with Jacqueline Fernandez (Alishka for Raja) and Taapsee Pannu (Samaira for Prem).\n\nPrem's father meets a person (the villain) on his flight from London to Mumbai. Upon landing, the villain keeps a water bottle filled with smuggled goods in his co-passenger's bag so that he comes out clean when Airport police checks him.\n\nPrem's father rushes to hospital to know that he has twins and the villain visits him in the hospital (how !?) so that he can take the water bottle. But, Prem's father has already intimated the Police and they catch the villain. When he tries to escape, he takes one of the twin babies (Raja) and leaves it near train track, runs to a godown, and blows it by opening a gas cylinder making the police and Prem's father believe that Raja was inside and is dead (due to the blast). Villain is presented to court and is sentenced to jail. Due to villain's strong network, Prem's father is advised by the Police to go elsewhere. Prem, his father and mother go to London, settle and he is raised there while Raja is raised in Mumbai.\n\nAs the story unfolds, all the characters travel to / meet in London\n\nFun concept is that when the twins are in nearby, each others are connected and action done by one are mirrored by the other\n\nPlot holes:"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "mihir2312",
        "review_rating": "1",
        "review_title": "Ruined a 90's favourite for me",
        "review_detailed_main": "There isnt much to say about this boring two hour film, it's simply a remake if you can call it that of the original Judwaa. If you've seen the original and even if you don't like it as much you'd have to admit it is better than this piece of junk.\n\nAnupam Kher is a legend in my eyes but he couldn't replace the original comedy of the great Kadar Khan, those scenes with the \"wrong number\" dialogues cannot be reused with feeling forced and they weren't even funny.\n\nI could not watch this film without remembering scenes from the original at least Salman played both characters with a bit more finesse, Varun copying Salman's style just makes him look silly. Mannerisms that cannot be repeated and dialogue delivery that makes you slightly sick. I personally enjoyed the original there's a lot of nostalgia behind it. The last fight scenes cannot be matched and shouldn't have been. I am really surprised that Salman Khan endorsed this second film and even made a cameo, what a wasted scene that was. Anyone who's considering watching Judwaa 2 don't bother just watch the original again."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "fati88",
        "review_rating": "2",
        "review_title": "So bad that couldn't be good",
        "review_detailed_main": "I really had hard time watching this movie, it's sooo bad and not coherent at alll, the plot the acting, the supposed to be \"comedy\" scenes, even the \"action\" scenes everything was really awful and it's really disappointing that BW continue to make such bad films, i gave it 2 stars because of the songs and the dance performances they're the only enjoyable things in this movie."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "namashi_1",
        "review_rating": "4",
        "review_title": "Double Is Indeed Trouble!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "5",
        "review_title": "Lavish but doesn't hit the right chords like the original one.",
        "review_detailed_main": "JUDWAA 2 REVIEW : I hope whoever is reading this review might have seen the 90's Judwaa film, because anyhow even if you don't want to, somehow comparison will obviously be made with the remake and i think it will be unfair to the new film as we all know film-making has changed so much in last 20 years. Same story which looked logical and interesting in 90's would look illogical in Today's internet generation. So i'm bit confused about reviewing Judwaa 2 cause i have seen 90's Judwaa many times and i enjoyed it lot so comparison is obvious and that's unfair. Let it be, i don't want comparison but somehow it will be made so, let me try to balance both the things.\n\nJudwaa 2 has same basic story of original Judwaa but has got different screenplay and few changed characters. Not a single character hits the old films characters magic. Not even Varun, he tries but fails to match Salman's one of most memorable characters, not his cup of tea. Even on individual level, he's not much impressive, Decent. Lead actresses got only hot chicks and thighs to show rather than showing acting talent. Music is disappointing and too loudy, sounds irritating at some moments. For e.g. Prem's ragging song and Rocky's defeat song was completely useless and highly irritating. Screenplay is fairly good in first half and too stretched in second half. Few illogical moments such as Football scene and couple of more scenes could have been removed or could be done in logical way. Even when The End was looking perfect it was again spoiled by Bomb scene. Even most anticipated Salman's cameo too looks completely needless, it comes at the End when there was no need of that scene, and even that scenes wasn't much good. Cinematography is Below Average overall but too bad in that 'Beach Song'. Only plus thing about the film has to be it's production value. Judwaa 2 holds upper hand in lavishness compared to Judwaa. Varun's clothes, actresses dressing, cars looks too lavish and posh. Direction looked confused and tricky. I can't believe the last film of David Dhawan was a good entertainer but despite better story, goodwill of Judwaa's popularity and high scale production value David failed to match his own last film Main Tera Hero? I mean, how much disappointing it is. He tried too much to make it a complete money making entertainer but ignored basic things like making a decent watch for audience, Or may be there was a pressure of recreating old magic again in different era, for different audience. Hence proved, old good films shouldn't be touched, let them remain Old and first of it's kind, people say Old is Gold for some reasons mate, you don't listen to people and ruins old ones just for the sake of money and lose your standard.\n\nOverall, Judwaa 2 is Strictly Average film and can be watched once with family in this festival weekend. But i personally don't see this (don't deserve) film in 100cr club, or may be it can touch it by the help of Holidays and enough mass elements in the film. A potential Blockbuster is ruined by Director's typical money making film and trying to be in a safe zone vision. Sorry Varun Dhawan but you have to wait more for your First Blockbuster. I give 5/10* to this one."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "binducherungath",
        "review_rating": "4",
        "review_title": "Judwaa 2 is not a great entertainer in spite of Varun Dhawan's terrific performance.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "oazam",
        "review_rating": "5",
        "review_title": "Very incoherent jokes with over-acting and the music is the only highlight.",
        "review_detailed_main": "Somehow I don't understand why Bollywood insists on making sequels or remakes but I guess the producers are just on the verge of saving their production houses like NHG who are responsible for average films like Rangoon and Housefull 3.\n\nI always found David Drawn to be a cheesy filmmaker but some of his films really do make you laugh like Partner, Maine Pyaar Kyun Kiya, and Mujhse Shaadi Karoge. Even the first Judwaa was funny and hilarious especially when Karishma Kapoor was a legendary actress back then.\n\nSo the movie revolves around Prem and Raju, twin conjoined brothers who were separated at birth by a gangster. Prem is based in London with a high-class status but his weak and geeky motives leads him to a big problem especially with a split personality where he shows off these unusual reflexes like kissing a girl or slapping a person for no forsaken reason. Raja on the other hand lives a low class life in Mumbai working for a fisherman and he is strong and the bravest of one the twins. How these 2 encounter each other and fixing the past behind them is basically what this film is about.\n\nQuite frankly, this movie is constantly below average. The trailer was something I had zero expectation in as well. Although Main Tera Hero was disappointing, I still liked some of the comedic factors in that film and it was sort of a delight to watch but this one tries really hard. The writing is the terminated achievement in the film. The script was too clichéd and I felt some of the scenes were just modified to look like the original film.\n\nThe acting was like somebody came on set just to make a quick buck.\n\nThe six pack abs on Varun's body managed to outdo him in terms of performance. This guy just doesn't want to leave his comfort zone.\n\nJacqueline Fernandez isn't really known for her acting and putting her in a film like this speaks volumes for itself. Even Taapsee was somebody I didn't like in the film although she was attractive, but still she lacked the justice she had in Pink for Judwaa 2.\n\nThe cinematography was absolutely cartoonish. Ayananka Bose has trouble picking the right camera for such films or is it the editor using a cheap software in a scene where Varun falls on the roof of a building.\n\nThe music is outstanding and gives you the nostalgic feeling Anu Malik managed to give. Oonchi si Building and Chalti Hai Kya 9 to 12 were modified nicely and brings back that vibe from the previous film.\n\nOverall, this movie is quite a disappointment. Very clichéd script along with mediocre performances also lets not forget the underwhelming cinematography and eating but despite a few laughs and good music, Judwaa 2 is worth watching but on Netflix or a T.v Broadcast.\n\nQuite some hype was created for this film. So the box office will be good surprisingly the theater during the 2:45 pm show was 75% full.\n\n2.75/5- Just save your money this weekend and wait for Chef which looks overwhelming but a remake is a skeptical factor for every film like this one."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "MuviFan73",
        "review_rating": "4",
        "review_title": "No such remakes please!",
        "review_detailed_main": "Tone & Story: Remake of Judwaa where the brothers get separated and later get together is what the story is based on. Along they even find a villain and take over. The scenes are full of humor but lack sense most of time. It's not new with David Dhavan movie. Synapses connected between the twin pair is really an interesting concept (half mark for that), but no justice is done, still to the story (0.5/5).\n\nDirection, Screenplay, Cinematography: (1.5/5).\n\nMusic: Most of the songs are remix from the songs in original version (2/5).\n\nActing:(2/5)\n\nFinal Verdict: Light comedy that most of you would enjoy [(1.5/5)(6.5/10)]."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "kas27",
        "review_rating": "8",
        "review_title": "Watch with right expectations",
        "review_detailed_main": "One cannot judge a fish by its ability to climb a tree. Or, choose a dessert from the restaurant menu and then complain why it does not have salt and pepper. That, is the problem with most of the reviews here. If you don't know what to expect from Judwaa 2, the problem lies with you and not with the movie.\n\nNow, I am all for movies with intellect, social message and creativity - loved the ones like Dhanak, Trapped, Bareilly ki Barfi, Newton, Nil Battey Sannata etc. These movies are a fresh breeze that has rejuvenated Bollywood but one cannot carry the same expectations to Judwaa 2.\n\nJudwaa 2, pretty much delivers what it promises - decent action, mindless comedy, peppy songs, bollywood grooves and mild emotional scenes. Anyone who has directed as much as a street play, would know how difficult it is to make audience laugh. This movies does that well enough for a large target audience. If that was not the case, finer comedies like \"Bareilly ki Barfi\" or \"Dum Laga ke Haisha\" would have earned more than one-fifth of Judwaa 2's collections.\n\nNow to prove yourself an intellectual - try finding a cancer cure, build some artificial intelligence programs or write a Booker winning literature piece - don't take the shortcut of hollow and misplaced criticism."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "pantaman-58502",
        "review_rating": "7",
        "review_title": "pesa wasool movie, very entertaining",
        "review_detailed_main": "illogically humorous, nice content, and light movie which you may enjoy without thinking too much on story part.\n\nDirection, Screenplay, Cinematography: (6/10).\n\nMusic: Although the songs are remix from the songs in original version, they are foot tapping numbers, you enjoy hearing them. (8/10).\n\nActing: Varun dhawan is good in both the roles of a goon and a weak and simple guy. Both lades are good in the part that is offered to them. Rest of the cast is OK as they have nothing much to do.(7/10)\n\nFinal Verdict: Light comedy,illogically humorous, gave you laugh here and there, but bit of a caution, don't try to put your brain in film reasoning else you may get a headache. [(7/10)]."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "merrieberrie",
        "review_rating": "1",
        "review_title": "Why why",
        "review_detailed_main": "Why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why. This review here is more original and creative than the waste of a movie this whole thing is. I just found it on Netflix and played it. Why was this movie made? Why did they release it? Why is Varun trying so freaking hard to be so abysmal? So many why's that will never have an answer."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "shivamkansal-93398",
        "review_rating": "1",
        "review_title": "Varun davan plz leave the bollywood industry",
        "review_detailed_main": "Most disgusting movie of the year why u are in bollywood after kalank and judwaa 2"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "thakurpratt",
        "review_rating": "1",
        "review_title": "WORSE MOVIE EVER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "WasiReviews",
        "review_rating": "5",
        "review_title": "They Made the Same Film with the Same Scenes 20 Years Later...",
        "review_detailed_main": "What can I say at least the songs are good but they copied that as well from the original movie. The villains were awful the acting was ok but I mean its the same film with literally THE SAME DIALOGUE! Are you kidding me? This is what people spend their money on. I feel like this would be 6/10 or 7/10 if it was even in least bit original but I can't promote this scam save your money for a better film or just do something else. Heck it isn't worth illegally streaming just watch the original film if you want a good, original and decently acted film."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "laaazm",
        "review_rating": "1",
        "review_title": "Complety bad movie",
        "review_detailed_main": "Why reuined the orignal. Just over acting varun Total Garbage movie"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "control-buch",
        "review_rating": "2",
        "review_title": "Don't bother",
        "review_detailed_main": "Ugh, what a complete waste of time! I watched Judwaa 2 thinking it would be a fun, lighthearted comedy, but boy was I wrong. The movie is a lazy rehashing of the original 1997 film, with none of the charm or wit. The plot is ridiculous, with two twin brothers who are separated at birth and then reunite years later, leading to all sorts of predictable and cringe-worthy misunderstandings. The acting is subpar, with the usually reliable Varun Dhawan struggling to elevate the bland script. The worst part is the music - the soundtrack is annoying and forgettable, with one ear-piercing song after another. And don't even get me started on the \"comedy\" - it's all just cheap gags and slapstick humor that fails to elicit a single laugh. It is a disappointing and uninspired sequel that fails to deliver on its promise of fun and entertainment. If you're looking for a good Indian comedy, look elsewhere!"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "manikantabhogi",
        "review_rating": "7",
        "review_title": "Average movie",
        "review_detailed_main": "Time pass movie , good acting by stars and commerical movie"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "JokerMichel",
        "review_rating": "2",
        "review_title": "Bad",
        "review_detailed_main": "First the idea got my attention , but after some time the movie gets awful with a lot of plot holes and lack of acting I couldn't even continue watching the movie"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "chaipatti",
        "review_rating": "10",
        "review_title": "love this movie Varun Dhawan and David Dhawan Many more movies I want from you guys like this. Storyline acting and comedy actions I like it and I love it david Dhawan movies",
        "review_detailed_main": "I love this movie Varun Dhawan and David Dhawan Many more movies I want from you guys like this. Storyline acting and comedy actions I like it and I love it david Dhawan movies are always awesome in hindi. Songs are awesome and dance set perfectly. Marathi language roles are awesome varun Dhawan love you every minutes used. Double roles acting was awesome . Js Allan khan entry is really awesome missing old judwa now this movie for 10-15 times I watched movies . Waiting for judwa 3 movie with Salman khan .. shooting is done in mumbai locations that is really awesome all actors did great role. I really love it coolie movie was also awesome keep it up Varun Dhawan."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "chanishaj-26377",
        "review_rating": "6",
        "review_title": "Judwaa 2: Half the fun, half the excitement.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "avinash-18397",
        "review_rating": "1",
        "review_title": "Bollywood is the most dried place on earth",
        "review_detailed_main": "Lame old stories where the hot guy hookes up with a hot girl. do some romantic love songs, and then some extra characters to be seen as comedic pieces. dont forget about the girlfriends dad who is the main villain . which the hero has to punch his way through to win the love , and finally a happy freaking ending. not worth the money really."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Not Recommended",
        "review_detailed_main": "The Worst movie I have ever watched, better if I would have taken a sleep for 2hr -_-"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "pkt-73005",
        "review_rating": "1",
        "review_title": "What the hell did i just watch",
        "review_detailed_main": "Absolute rubbish! These people can't even copy properly. I was cringing throughout the entire film. Pathetic acting by VD & Sara. This just made me realise that it's not worth it to waste your money and time on Bollywood movies."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ramkumar-28288",
        "review_rating": "1",
        "review_title": "Salman's Judwaa was better",
        "review_detailed_main": "Judwaa 2 is a pathetic film...Now I know that Salman is really good. Varun is not even 1% of Salman"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "pujanano",
        "review_rating": "1",
        "review_title": "I don't like the acting of Varun Dhawal. He did overacting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "Tejas_Vinda_AITS",
        "review_rating": "1",
        "review_title": "Worst copy-paste,, n varun is no way near to young salman..!!",
        "review_detailed_main": "Judwa 2 is one of the worst movies I have ever seen which moreover is like a movie with no bind to the storyline..not for a single moment I felt glued to the movie..it felt like hundreds of bits and pieces joined together but no genuine storyline in it..and comedy wise it looked like there's no continuity..the characters were appearing and throwing punch lines of the great indian comedy show.\n\nAlso Salman Khan's cameo in the end was like a forced special appearance which didn't make any sense.It's nowhere even near to the original Judwa.\n\nTapsee n pawan malhotra,,oh plzz dont be part of such movies..,!!"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "1",
        "review_title": "How can anyone appreciate such cheap films",
        "review_detailed_main": "David Dhawan will test your patience level with Judwaa 2. It is filled with crass jokes and cheap humour. Women are treated as objects. I don't know how the girls working in it accepted their roles. Varun Dhawan's character spanked their asses and they really don't have any problem.\n\nVarun Dhawan was all about jumping and dancing. There is not a single dialogue which he delivered normally. As if two Varun's were not enough, both girls behave as puppets, only dancing to his tunes. Tapsee Pannu was comparitively less irritating,but her mom? She was happy when Varun's character forcedly kissed her daughter. And that idiot doctor, even his name(Surname) is a hindi expletive and he spoke that in an ugly manner. Can it get any cheaper than this?\n\nJokes are terrible. Varun Dhawan in an emotional mood says, 'Ammi jaan kehti thi,... Chittian Kalaian ve'. Who writes dialogues like this. Atleast half of the jokes are sexual.\n\nCensor board can cut a few swear words matching the situation from Masaan, but they allow disgusting films like Judwaa 2 for some reason."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "smrawat",
        "review_rating": "10",
        "review_title": "I thought it was a crap movie but it wasn't it",
        "review_detailed_main": "Judwaa 2 is a really funny romcom and action movie it has all the elements that Bollywood needs. The songs are brilliant they make you wanna dance to the music or at least tap your foot to the beats. Varun dhawan did a very nice job acting in a double role film his comic timing was amazing and also Jacqueline Fernandez did a really good job and her comedy was much better than in A Gentleman, Tapsee Paanu hands down she did a really good job specially in a comedy movie which she hasn't done. I would really recommend this movie your going to laugh a lot if you like comedy, action, and romantic movies."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "M-a-shazaib",
        "review_rating": "1",
        "review_title": "What the ffffffff did I watch",
        "review_detailed_main": "Now I would want to watch Judwa (original) to get this crap out of my head, what a terrible movie. This dude is what he is because of his name, terrible actor."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "riteshgupta-41243",
        "review_rating": "1",
        "review_title": "Pathetic movie",
        "review_detailed_main": "This is a real garbage of a movie. Just trying to seduce with those heroines not wearing enough clothes but that attempt also falls flat."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "survesudeepsudip",
        "review_rating": "1",
        "review_title": "Worst acting by Varun dhvan",
        "review_detailed_main": "This film has huge fan base but for legndery Govinda not for this star kid with 2 rupees acting skill"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "sahil_shah-53365",
        "review_rating": "1",
        "review_title": "Bekar",
        "review_detailed_main": "I dont understand why Varun Dhawan is considered a good actor. With rubbish and nonsense acting he does."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ashokkk-02581",
        "review_rating": "1",
        "review_title": "A disaster of a movie",
        "review_detailed_main": "One of the worst movie till date. Aak thuu. Waste of time"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "ashmitagarwalpsaa",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Totally worst boring movie Varun Dhawan is over acting and story was not good 😠"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "rajiv_master",
        "review_rating": "2",
        "review_title": "Watch the Original",
        "review_detailed_main": "Even by David Dhawan standards this is a bad film. According to me one should remake a film only if one can improve it or add something good otherwise they should be left as it is. The original Judwaa which is in itself an average film has now been further downgraded to Judwaa 2. No logic,No story,only scenes put together. Everything is lacking in this film.\n\nEven if you watch all the movies in a year skip this one. Watch Original Judwaa instead.\n\nTwo stars only for Jacqueline and Tapsee."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "pratikzaveri",
        "review_rating": "8",
        "review_title": "Excellent remake and stress-reliever",
        "review_detailed_main": "WORTH A WATCH ONCE! Varun Dhavan may not be a Salman but brings an equally good performance in this remake of the classic Judwaa. This is a great movie to watch after a stressful work week without worrying about anything. Some comic scenes are noteworthy. Besides Varun, Rajpal Yadav, Johnny Lever and other characters have at least one \"bring the house-down\" scenes. If you are in the mood for good, clean comedy, great songs, visuals, FUN, and are wanting for or OK to \"leave your brain behind\" typical David Dhavin-style, this is a must watch."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "munalama",
        "review_rating": "1",
        "review_title": "horrible",
        "review_detailed_main": "Overacting, zero creativity .Horrible horrible.i hate it."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "Okabe_yagami",
        "review_rating": "1",
        "review_title": "Crap !!!!",
        "review_detailed_main": "Who ever giving 10 ratings to this movie really need to go mental hospital . What a crap really one of worst movie it is even more bad than the prem ratan dhan payo"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "dicksongomes",
        "review_rating": "1",
        "review_title": "Film makers of this movie should be jailed.",
        "review_detailed_main": "One of the worst movie ever seen, utter garbage. David Dhavan should be ashamed of himself."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "pranavkamdi",
        "review_rating": "3",
        "review_title": "Why did they even made this😑",
        "review_detailed_main": "What's Good: Varun Dhawan What's Bad : Varun Dhawan, David Dhawan even a senior actor like Anupam Kher overacts Don't watch it.. go watch hera pheri again and again"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "c-74756",
        "review_rating": "1",
        "review_title": "Waste and garbage",
        "review_detailed_main": "This is a waste product which shouldn't be recycled."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "drppdave",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Somebody please explain Varun that no mater how hard he tries he can do only Overacting. Aur ye judwa 2 ko Twins 2 kaun likha he be??"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "jennyraval",
        "review_rating": "1",
        "review_title": "Please Improve your Storyline as well as Casting",
        "review_detailed_main": "They might have thought that Taapsee has lost some weight so she was perfect for the role but when will you understand that it's all about acting not only looks and figure. So disappointed with Taapsee's role."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "dimplepatelnw",
        "review_rating": "10",
        "review_title": "Amazing!!!",
        "review_detailed_main": "Surprised at how good this movie turned out. Seen Judwaa from '97 many, many, many times, but (don't taser me bro) I enjoyed this new version a LOT more than the old one. Judwaa 2 is very bubbly, vibrant, colorful. Anupam Kher, Tapsee's mom, Varun, Tapsee, Jacqueline, and Rajpal are ALL amazing gems. Plus the songs in this movie are gold. Yes the movie 'borrows' gags from other comedy/drama flicks, but I thought these running jokes enhanced the plot! Raja is probably the BEST character next to Anupam Kher's Bakshi."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "dkdeepakhatri",
        "review_rating": "1",
        "review_title": "Huge Banner film fails again to impress",
        "review_detailed_main": "Totally Illogical story , overacting by lead actors & actress . No comedy timing at all . Disappoints all the audiences . Waste of time & money"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "dy38493",
        "review_rating": "3",
        "review_title": "Not so good movie",
        "review_detailed_main": "Not so good movie to watch especially the old one was better the songs are pretty good but movie fails to impress the audience."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "rahmatullah-92812",
        "review_rating": "3",
        "review_title": "Totally Rubbish !!!!!!! Please Don't watch this🙂",
        "review_detailed_main": "Varun Dhawan's acting as prem in this movie is gerbage. How an experienced actor can act like this. Even hero Alam can do this better than him🙄🙄. Story is also not stron."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "raj_paswan_in",
        "review_rating": "1",
        "review_title": "Faltu",
        "review_detailed_main": "Faltu movie..if I could I would hv given in -minus for this movie"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "JamesWilkin55",
        "review_rating": "8",
        "review_title": "Fun, goofy entertaining film!!",
        "review_detailed_main": "There is a user named Takethispunch who is clearly an Indian trying to look cool by going around on IMDb and trashing every single Bollywood film on its release day (often without even watching it)... this has to be spam? Either delusional or extremely try-hard for attention but unfortunately people like this hamper the film discovery experience for Americans like me.\n\nAnyway:\n\nHad a fun time watching this one. Varun Dhawan is a great performer, both on the acting front and the dancing front, and has a strong screen presence. The film is quite silly, so leave your seriousness at the door before coming in. The songs are really catchy! And the girls (unfortunately are pretty dumb characters) do provide added eye candy and silliness.\n\nWatch to chill out"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "albishaju",
        "review_rating": "9",
        "review_title": "A One Time Watch",
        "review_detailed_main": "Lets make it clear.If you are going to watch a Varun Dhawan film do not care for logic.The film is just a commercial potboiler to be watched if you are bored. The movie has comedy and action which is enjoyable. It is the exact copy of the original.Coming about acting there is not much acting scope The film entirely lies on the shoulders of Varun. The heroines don't have any role in movie and there is a cameo by Salman Khan.The music department disappoints and especially watch out for the climax. Overall it can be watched as a stress reliever. A one time watch"
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "rianazarine",
        "review_rating": "8",
        "review_title": "Entertaining and Action Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "sanjusupercool1",
        "review_rating": "8",
        "review_title": "Very enjoyable flick",
        "review_detailed_main": "Judwaa 2 is the sequel to judwaa which released in 1990s . Varun dhawan playing the double role is awesome and is quickly becoming one of my favorite actors . Jacqueline Fernandez and taapsee pannu are good . The supporting cast is all good . The direction is Great. The screenplay is clever and witty and at times makes very clever jokes . The music is good and the movie is overall a very good time . Judwaa 2 is a definite recommendation from me and try to see it in the theaters because this movie deserves to be seen on the big screen."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "gspbfbwm",
        "review_rating": "10",
        "review_title": "entertaining!!!",
        "review_detailed_main": "It's a good movie if you have watched the franchise!!! If you didn't like the first one and came to watch this one then idk what were u expecting because it's a remake."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "labeebster",
        "review_rating": "8",
        "review_title": "Thourghly enjobale movie",
        "review_detailed_main": "The movie was actually enjoyable. I thought this was going to be a modern crap but I'm glad they stuck to the roots. The movie isn't too westernized as the Bollywood music can be most of the time nowadays. I was actually happy to find out that it had a lot of 'desi' masala in it. Not every modern movie has to be made in western style. There are some that are good. Then I also hate some 'desi' stuff in some movies. It can be annoying at times. But this movie being a sequel needed to be this way. It was thoroughly enjoyable."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "fozankhan-21170",
        "review_rating": "8",
        "review_title": "\"Judwaa 2\" (2017) - A Lively Remake Packed with Humor and Nostalgia",
        "review_detailed_main": "\"Judwaa 2,\" directed by David Dhawan, is a colorful and energetic remake of the 1997 classic \"Judwaa.\" The film brings back the beloved twin-brothers formula, with Varun Dhawan playing dual roles and infusing the characters with his own brand of charm and comedy. With a mix of humor, romance, and nostalgia, \"Judwaa 2\" delivers a feel-good Bollywood entertainer.\n\nStory and Direction: The film follows the misadventures of twin brothers, Raja and Prem, separated at birth due to unforeseen circumstances. Raja grows up on the streets, becoming a carefree tapori with a heart of gold, while Prem is raised in luxury, becoming a suave and sophisticated NRI. The story takes a hilarious turn when fate brings the brothers together, leading to a series of comic misunderstandings. David Dhawan's direction, known for his flair in comedy, shines through, maintaining the lighthearted tone throughout the film.\n\nCinematography: The film's cinematography, captured by Ayananka Bose, complements the vibrant and light-hearted mood. The picturesque locations in London and Mumbai add to the film's visual appeal, while the dance sequences are shot with flair, capturing the energy and enthusiasm of the performers.\n\nActing: Varun Dhawan excels in his double role as Raja and Prem, showcasing his versatility as an actor. His comic timing and enthusiasm bring life to both characters, making them endearing in their own unique ways. Jacqueline Fernandez and Taapsee Pannu add charm and sparkle as the leading ladies, complementing Varun's performance with their own on-screen presence.\n\nSupporting Cast: The film boasts a strong supporting cast, including Anupam Kher, Rajpal Yadav, and Pavan Malhotra, who deliver entertaining performances that add to the comic elements of the story.\n\nMusic and Choreography: \"Judwaa 2\" features a mix of peppy and nostalgic songs, including revamped versions of the original \"Judwaa\" tracks. The music, composed by Sajid-Wajid, Meet Bros, and Sandeep Shirodkar, adds to the film's festive and vibrant atmosphere. The choreography, led by Ganesh Acharya and Ahmed Khan, enhances the entertainment quotient, making the dance sequences visually appealing and enjoyable.\n\nDialogues: The film's dialogues, written by Sajid-Farhad, are witty and packed with humor, evoking laughter throughout. The playful banter between the characters adds to the film's light-hearted charm.\n\nNostalgia Factor: \"Judwaa 2\" incorporates nostalgic references to the original film, paying homage to its predecessor and giving fans of the 1997 \"Judwaa\" a sense of nostalgia.\n\nIn conclusion, \"Judwaa 2\" is a lively and entertaining Bollywood remake that successfully captures the essence of the original while adding its own modern flair. With Varun Dhawan's double dose of charisma, an enjoyable supporting cast, and foot-tapping music, the film is a joyous ride that appeals to audiences of all ages, making it a delightful watch for fans of the genre and lovers of classic Bollywood comedy."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "raviraval_007",
        "review_rating": "9",
        "review_title": "Good fun and goo work",
        "review_detailed_main": "Defiantly better movie than Judwaa 1. Good acting by Varun and co stars, good direction. Defiantly good jokes made my whole family laugh in whole movie. Could have made it more interesting by changing the story a bit but not a bad attempt. I would consider this movie batter then what currently Bollywood movies has offered."
    },
    {
        "movie_id": "tt5456546",
        "movie_name": "Judwaa 2",
        "movie_rating": "3.7",
        "review_username": "vission-96629",
        "review_rating": "",
        "review_title": "0⭐",
        "review_detailed_main": ""
    }
]