[
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "nadkarnisumeet",
        "review_rating": "4",
        "review_title": "An okey dokey debut - Deepa Sahi is better actor than director.",
        "review_detailed_main": "Tere Mere Phere review :\n\nDeepa Sahi's directorial debut was a rom com cum road movie featuring two newbies - Jagrat and Sasha - alongwith Vinay Pathak and Riya Sen. With a wafer thin plot (written by Deepa herself), the film was more situational in approach relying on the wonderfully shot scenic Himachal locales.\n\nNeither too bad not too great, Tere Mere Phere was an okey dokey fare. Of the cast, only Vinay Pathak left an impression. The newcomers disappointed big time. As for Maya Memsaab Deepa Sahi, she is a better actor than a director if one goes by this film. I wish she had acted in it.\n\nRegards, Sumeet Nadkarni"
    },
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "rokmar",
        "review_rating": "",
        "review_title": "A Fun Farce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "kabeerghosh",
        "review_rating": "9",
        "review_title": "Tere Mere Phere - An Entertaining Affair",
        "review_detailed_main": "A great fun film capturing the eccentricities of men and women who somehow seem to get into knots the moment they fall in love. How many times have we seen around us our Moms and Dads, sisters and their husbands, brothers and their wives behave irrationally the moment they are married!! The film is shot beautifully in the ever changing drama of the great Himalayas. And the journey in the motor van makes you long to go on one such trip (minus the warring wife of course). The director has created all the aspects of love, jealousy, sarcasms, yelling's, cryings, break ups, make ups that men and women go through in their journey of love\n\nSet amidst the changing landscape of the mountains, the gurgling streams during the early love phase and the torturous paths of their relationships and the pitfalls during the fights all add to the highs and lows of the relationship. And the small town dynamics of the relationship which are so different from the urban couple ( Vinay and Riya in a cute pairing) is refreshing. Breaking the cliché that only pretty boys can get pretty women!!! Witty repartee adds to the fun. It has much needed spoken language rather than bombastic dialogues we are used to hearing and specially impressive are Darshan Jariwala and Sushmita Mukherjee with their old world man - woman wars. The best part is that the director does not wallow in sentimentality with those irritating violins and choir singing in the background which we are customer to seeing in most love stories. The climax of the movie had everyone falling off their chairs with the Pheras and the Jhagdas happening simultaneously and yes the best part is that as we all know that though the leopards do not change their spots , life goes on\u0085 !!!"
    },
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "bobbysing",
        "review_rating": "",
        "review_title": "Unexpectedly, an awful debut from Deepa Sahi.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "suite92",
        "review_rating": "8",
        "review_title": "Bickering newlyweds encounter man determined to win back his girlfriend.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "spinoza_lb",
        "review_rating": "10",
        "review_title": "I have never enjoyed a Hindi movie so much",
        "review_detailed_main": "This movie is spectacularly directed, acted and funny. All the actors are wonderfully chosen for their roles. Photography is great. I never enjoyed a Hindi movie as much as I enjoyed this one. I have yet to see a Vinay Pathak movie that I have not enjoyed but this one is by far the most enjoyable.\n\nAdd an enjoyable screenplay to the beautiful scenes from Himachal Pradesh , there is not a moment when you feel bored. The leading pair of Jagrat Desai and Sasha Goradia are refreshing new faces with a natural style of acting. I look forward to more wonderful movies from them.\n\nThe members of the Bhasin family are a riot - especially Rohan Shah. I do recall seeing Maya directed by Deepa Sahi many years ago. After seeing this movie, I must catch up with all her other work of the ensuing years."
    },
    {
        "movie_id": "tt1696191",
        "movie_name": "Tere Mere Phere",
        "movie_rating": "5.4",
        "review_username": "happy_peace_2004",
        "review_rating": "10",
        "review_title": "A great comedy",
        "review_detailed_main": "When I first read the storyline I was a bit sceptic, but given that Vinay Pathak was in the cast I thought I would give it a go - and I'm glad I did. I loved the movie! It really goes to show that a brilliant movie can be made even on a low budget. The storyline is average, but its the way the movie has been fleshed out that gives it a high rating.\n\nThe new comers Jagrat and Sasha did an excellent performance as the newly weds. The problems in the relationship are gradually brought out where neither wife nor husband think they are doing anything wrong. Vinay Pathak was great as usual, making you laugh even with his simple expressions. Raima did well as the supporting actress. Nobody did any OTT acting, and the background scenery was beautiful. Would highly recommend to watch."
    }
]