[
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "bobbysing",
        "review_rating": "3",
        "review_title": "Another inspired revenge drama progressing from average to ordinary, weird, boring & then funny.",
        "review_detailed_main": "One of the most popular facts of Hindi films market is that here other than the star system the one element which can easily bring in the crowd into the theaters is Sex or Erotica. And since 70s there is a certain section of film-makers who have always kept this basic fact in mind before making their irrelevant films just to earn some quick money from the box office and nothing else. In other words a market where a porn star can so easily be transformed into a television celebrity reaching your whole family in the evenings and also manages to generate a decent amount of fan following without doing anything significant on the screen in terms of acting. It is pretty obvious that sex based films remain a hot property for the distributors as well as for the producers, with a minimum risk factor and a high repeat value ensuring some safe returns.\n\nSo no points for guessing that HATE STORY 2 is also one of those deliberately made business products just in search of the viewers willing to see another naked body on the screen of a known face instead of cinema. Plus it's once again a sequel which has nothing to do with its first part. But does follow the same pattern of presenting a sexy girl who can bare it all, gets exploited before the intermission and then goes on to take her revenge in the second half displaying the inner power of a woman (to put it in some respectable words).\n\nHowever where the formula did come up with something watchable in its prequel, the second part falls way short of that already achieved mark, basically (again) due to its pretty ordinary second half executed in a hasty & repetitive style by the director Vishal Pandya.\n\nThough it all begins with an inspired sequence straight away reminding you of Uma Thurman, still the progression holds your interest nicely before it all becomes easily predictable heading towards the interval. The early part of the script borrows heavily from Quentin Tarantino's cult revenge thriller KILL BILL and once it tries walking on its own, the film falls completely flat and goes even beyond the level of bearable in its final moments to say the least. In short, HATE STORY begins well, becomes average in the first 40 minutes and then simply slides down towards the bottom becoming plain ordinary, boring and even funny ruining all the hard work done by its actors in its first half.\n\nInterestingly where the sex factor did have a steaming impact in its part one (due to Paoli Dam), the sequel surprisingly remains a non- performer in that particular aspect with nothing exciting or engaging in its revenge drama too in the later part. The erotic sequences fail to impress due to an almost none chemistry between the on screen pair and further all comfortable killings of the main targets simply ruin the expectations raised earlier.\n\nTo give them their deserving due, a few sequences in the film have some well written dialogues in its initial hour and the two lead actors Surveen Chawla and Sushant Singh do leave a mark in their opening scenes emoting well. Yet Surveen questionably uses the film as her do or die attempt following the easiest path of taking her clothes off, which unfortunately is not going to yield some great results for her as it seems. The girl has been around for a while doing some regional films, music videos and few anchoring assignments too. But I really wasn't expecting her to dive down to this level of desperation quite frankly. Plus she still has to look a lot into her styling and make-up urgently as her face does appear to be entirely different in some casually chosen costumes & hairstyles in an uneven manner.\n\nSushant, as mentioned above plays it tough enough to make a decent impact at first, but is reduced to a repetitive clown towards the end spoiling the good build-up. Jay Bhanushali gets limited scope in his small role whereas Neha Kaul is terrific playing Sushant's suppressed wife having no voice of her own. The supporting cast performs OK and cinematography captures the essence of the movie rightly but background score tries too hard to make it sound like a great revenge thriller post intermission.\n\nMusically other than the pathetic 'Pink Lips' featuring Sunny Leone (jumping out of nowhere into the film post interval), the soundtrack also comes up with an average new-age version of the late 80s path breaking track \"Aaj Tumpe Pyar Aaya Hai\" from DAYAVAN (1988). And as history repeats itself, even after the gap of 25 years the fabulously composed song once again becomes famous more for its visual content only instead of the melodious musical notes, unfortunately (which inspires me to write a focused article on the same in the next days). Apart from the above two, few other songs in the film do appear to be soothing at their first listening. But their unintelligent timing in the script (one also coming in the climax), doesn't allow them to make any kind of impact on the viewer, whatsoever.\n\nIn all, there is no Paoli Dam here to say it indicatively and the film is nothing but an exploitive attempt just interested in en-cashing the curiosity generated by its steamy promos at the earliest. And if you still wish to see this empty tin making some good noise, then the choice is all yours."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "Uriah43",
        "review_rating": "5",
        "review_title": "Lost Momentum After First 30 Minutes",
        "review_detailed_main": "This film begins with a woman by the name of \"Sonika\" (Surveen Chawla) being buried alive in a coffin and placed in a cemetery to slowly suffocate to death. Fortunately, the groundskeeper there hears a noise and digs her out just in time. Naturally, in a state of complete shock she is taken to the hospital and put in a room that is closely guarded until the inspector on the case, \"Anton Varghese\" (Siddharth Kher) has a chance to obtain a statement. However, what Inspector Varghese doesn't quite realize is that Sonika's attempted murderer is an extremely well-connected politician who essentially owns every crooked cop in Mumbai and he has no intention of allowing her to talk. Now rather than reveal any more I will just say that this film had a really good start but seemed to lose its momentum after the first 30 minutes or so. Likewise, when it finally got back on track some of the scenarios lacked the necessary realism. Having said that, while I don't believe that this was a bad sequel by any means, it wasn't nearly as good as its predecessor and for that reason I have rated it accordingly. Average."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "rakibulalamdolon",
        "review_rating": "5",
        "review_title": "Interesting and Boring",
        "review_detailed_main": "The 1st half of the movie was nice and interesting. But the 2nd half was all about killing for revenge which became boring very quickly."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "dineshprakash",
        "review_rating": "2",
        "review_title": "All reasons to hate this film",
        "review_detailed_main": "First fifteen minutes of film is interesting. I was sure that at least I am going to watch an above average film for sure but my expectation got crushed. Story offers almost nothing new. Screenplay is only about happening rather than reasoning or highlighting the mood. Dialogues by Girish Dhamija are good. Trailer of this film was clearly indicating that this one is going to offer thrill with seduction coating but there is no thrill and seduction is as much as shown in trailer and in song. A person escapes form a high security hospital very easily, even being wounded badly and Police combing operation is going on? When girl wanted to take vengeance, where did she get lots of money and other resources? She knows everything for granted, where is the person, when he is going to out? Her escaping and follow up scenes are full idiotic. Even her love track should have been intense but gradually it started sounding funny. Where her grand mother went after helping her? Why did villain could not try to find out her? There are lots of unanswered incidents. They are placed because they had to happen. Performance wise Sushant Singh is impressive. Surveen Chawala is good. Music is OK. \"Aaj Phir Tum Par Pyar Aaya Hai\" is melodious."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "mohitrulesunderworld",
        "review_rating": "4",
        "review_title": "Sluggish script with less eroticism makes this story hateful.",
        "review_detailed_main": "Hate Story 2 : Revenge drama is one of the most common and popular genre in Hindi cinema. But female revenge drama's are very few which are remembered till date, most popular female revenge drama's are ZAKHMI AURAT, KHOON BHARI MAANG and BANDIT QUEEN.\n\nSome of them are B-grade flicks with A-list actress, not required to named them. Director Vishal Pandya tried to live up to that expectation but failed miserably.\n\nComing to performances, Surveen Chawla(as Sonika) she fails to deliver the hotness quotient which Paoli Dam made a trademark of this franchise. Jay Bhanushali(as Akshay) he is wasted and fails to impress, he was just a mannequin and hearing the directors call. Sushant Singh(as Mandar Matre) he was outstanding and probably the shinning star of this drama, after long time making his presence with a mass villainous role and stealing the show.\n\nStory was sluggish with no twists and turns just simple revenge drama. Screenplay was inspired from some of previous female revenge drama's especially first half was almost similar to KILL BILL but second half was much better than first half where in the first half they were trying to setup the plot. Hotness quotient is the trademark of this franchise, but it was hardly 3 minutes and that to be not intense. Songs are already ruling the charts. Sunny Leone \"Pink Lips\" made a sudden appearance from nowhere.\n\nOn the whole, with less hotness quotient and sluggish script. It dint live up to that expectation where the makers concentrated more on the story rather than eroticism. Sushant Singh was the best thing happen in this flick, if he would have not been there then it would another B or C grade film. I would better prefer Sooraj Barjatya family drama rather than this Revenge Drama."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "saadforever890",
        "review_rating": "4",
        "review_title": "Hate Story 2 is a shaky mess of a film",
        "review_detailed_main": "Well, its totally no connection prequel wasn't a great film either, but frankly it had its moments, while this film has nothing going for itself except a couple of performances & music! The plot is predictable from the word go, & serious standing ovation to the writers!! They made sure the actors had unintentionally the funniest lines in the most intense sequences. The direction is fine, but with the such predictable plot, the over toned violence could have been easily cut down. The only saving graces of this film is the soothing music & the exceptional performances from Sushant Singh & Surveen Chawla. Jay Bhanushali is likable but has a very minor role, no idea why he signed up for this as his big screen debut. Overall Hate Story 2 is a shaky mess of a film riding heavily on its exceptional performances & popular music."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "silvan-desouza",
        "review_rating": "5",
        "review_title": "Old wine in new bottle minus the spice of the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Hate Story 2 does have few moments to keep you engaged",
        "review_detailed_main": "Bhatt camp had successfully launched franchises of erotic-sex thrillers like Raaz , Jannat , Murder and now Hate Story. The combo of skin-show, melodious music and powerful performances gives Hate Story 2 an extra edge over others.\n\nAn young and innocent photographer, Sonika, is trapped and being abused by a powerful politician, Mandar. She heaves a sigh of relief after one of her co-worker,Akshay, rescues and takes her away from the wing of dirty politician. However, their happiness is short-lived as the politician discovers their hide-out and strangles them to death. Luckily , Sonika survives the attempted murder and avenges the killing of her boyfriend.\n\nFirst time director, Vishal Pandya does a fine job in keeping audience on their toes with Hate Story 2. What works is the cat-mouse game between Surveen Chawla and Sushant Singh and engaging moments in the film along with melodious music and commendable performances. The romantic track between Surveen Chawla and Jay Bhanusali is half-baked with less-impacting climax which could have been better. Screenplay is average. Cinematography is good. Art direction is decent. Surveen Chawla gives a brilliant performance as a woman who wrecks vengeance on so- called godfather. Sushant Singh is outstanding as a corrupt and selfish politician.\n\nOverall, Hate Story 2 does have few moments to keep you engaged. Decent 2.75/5"
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "dreamshivani679",
        "review_rating": "10",
        "review_title": "hate story 2 movie this is so nice and awesome..",
        "review_detailed_main": "A sequel to the erotic thriller that created ripples in Hindi cinema. A young photographer boy from the city of dreams plays mind games with a Rightist Hindu leader that leads to another Hate Story unfolding. The theme remains the same, what changes with this film is the treatment of the subject\n\nAwesome movie with breathtaking revenge scenes, Dialogues are upto the mark and story goes in a flow. this movie has done perfect justice\n\nHate Story 2 is a tale of Sonika (Surveen), the mistress of a brutal politico Mandar Mhatre (played by Sushant Singh). He has controlled her body, mind and spirit. Going against the rules of Mandar, Sonika falls for Akshay (Jay), her classmate from a photography school. An agitated Mandar gets Akshay killed and Sonika buried alive. Sonika, however, manages to escape from the coffin and seeks revenge with the help of an honest police officer played by Siddharth Kher. Mandar's wife (played by Neha Kaul), also troubled and ill-treated by him, hits the final nail in the coffin helping Sonika kill Mandar\n\nHate Story 2 is a mix of sensuality and revenge drama weaved in a good story. So if you are a revenge saga fan, you shouldn't miss this one. Great Work By All Actors Especially Surveen Chawla Sushant Singh And Jay Bhanushali.\n\nI would like to suggest you go for this movie this is very very entertaining and awesome Movie and you will definitely like this..."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "deathraga",
        "review_rating": "6",
        "review_title": "This will not disappoint you...",
        "review_detailed_main": "If you are expecting a movie like Ragini MMS 2 then Im afraid your expectations will not be fulfilled.\n\nThe entire movie revolves around Surveen Chawla & Sushant Singh. Surveen has given her best shot & has shown signs of being a good actor.\n\nSushant is one of the finest actors Bollywood has ever produced. He has done a terrific job. Jay Bhanushali is pathetic.\n\nSongs are OK but better than most of the other Bollywood Flicks.\n\nIts definitely a one time watch.. Don't watch it for the songs, watch it for Sushant Singh."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "AnotherMovieFreak",
        "review_rating": "7",
        "review_title": "Surveen Outshined Paoli: The Tale of Vengeance continues...",
        "review_detailed_main": "THE SAGA OF Vengeance continues.....Spoilers first....Unlike the First part which had a very gripping story...This tale of Seduction, drama and revenge was lacking in that department slightly...Although the story was not good as the first part...But it was way better than the first...Surveen chawla out shined Paoli Dam....Surveen was the ultimate seductress, a girl out there with a mission to destroy everyone who ever attempted to spoil her life....\n\n...The actors acted almost perfectly, every emotions starting from Seduction to Rage played very well. From a Sultry Bomb in flaunting Shorts to a gal in leathers carrying a gun, Surveen was eye grabbing...Sushant played an excellent Antagonist...Jay Bhanushali with his chocolaty romantic avatar complemented Surveen nicely....The Revenge murder Sequences were well planned and cold blooded....as if it was her only objective....The Girl who saw death so closely, was way above fear and pain; and surveen fitted in that role with an ease....\" Sapne ko Haqiqat banane ki Izazat bhi hai, Jaroorat bhi aur Chahat bhi\"---Best Dialouge...The Music Score is Good..\n\nN.B: Sunny Leonne and Pink Lips both were trashy...\n\nGo and watch it for performance once...Its Indeed An EROTIC THRILLER....all PRAISES for Surveen.."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "naaman-1997",
        "review_rating": "10",
        "review_title": "Amazing Film and Heart Touching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "TheNonSmoker",
        "review_rating": "7",
        "review_title": "Recommended 👍",
        "review_detailed_main": "This series of movies is not just about luring people and gain profits, this series of movies also has some good storyline too :)"
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "iamkaushalmodi",
        "review_rating": "6",
        "review_title": "Watchable Romantic Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "ravinderk1222",
        "review_rating": "9",
        "review_title": "Good showcase of personal battle",
        "review_detailed_main": "The sexuality and politics aside, this movie showed typical modern kids that learned what love is, the ending is sometimes a big no, but this movie showed the continuous inside battles of strong bond or love. Never understand these reviews."
    },
    {
        "movie_id": "tt3619772",
        "movie_name": "Hate Story 2",
        "movie_rating": "4.4",
        "review_username": "sarandivyam",
        "review_rating": "8",
        "review_title": "Honest Review",
        "review_detailed_main": "Hate Story 2 released on 18th July 2014. It stars Surveen Chawla, Jay Bhanushali and Sushant Singh. This describes the hate between Surveen Chawla and Sushant Singh and how Sushant Singh destroys the life of Surveen Chawla and how the rest of revenge forms the crux of the story. This film also has a very simple storyline but the presentation is very good. The music is very good. Direction, screenplay, cinematography are fine. I give this film an above-average rating."
    }
]