[
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "danielsummers519",
        "review_rating": "5",
        "review_title": "Unclear moral to the Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "stefgrig",
        "review_rating": "4",
        "review_title": "Someone dropped the ball....",
        "review_detailed_main": "De Niro , Norton and Jovovich . Quite the cast I'd say , but thats all there is to it .\n\nThe start is really interesting , both De Niro and Norton giving top notch performances . But then everything is lost as the movie looses focus and struggles to define itself . What starts of as a thriller goes nowhere trying to answer existential questions . No character is developed enough , the background stories clumsy and incomplete and thats in my opinion what killed this movie . No cohesion and a weak ending is the coup de grace .\n\nEdward Norton is one of my favorite actors , so is De Niro . Im so disappointed that this didn't work out ."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "ferguson-6",
        "review_rating": "6",
        "review_title": "A Vegetarian Tuning Fork",
        "review_detailed_main": "Greetings again from the darkness. Psychological Thrillers have long been my favorite genre of film. The best ones cause us to examine our own thoughts while analyzing the actions of others we probably don't quite understand. Unfortunately, most scripts fall short in complexity and stimulation, and leave us with a half-empty character study. Director John Curran (The Painted Veil) and writer Angus MacLachlan (the superb Junebug) offer up a just-miss.\n\nRobert DeNiro plays a parole officer on the brink of retirement. He is the guy that lives and works by the book to suppress his inner demons of which we get a glimpse in the film's opening. Despite the horror, he and his wife stay married for decades ... the relationship is built on a false worship of scripture and plenty of nerve-deadening booze. DeNiro decides to finish out his current files, one of which belongs to Edward Norton. He is an 8 year convict, serving a sentence for a crime that ended with the death of his grandparents.\n\nThe real fun begins when Norton enlists his schoolteacher wife, played by Milla Jovovich, to invade DeNiro's cold facade. So really what we have is: DeNiro trying not to feel anything, Norton trying to pull one over on DeNiro either by himself or with his wife, and Jovovich trying desperately to obey her husband while playing evil mind and body games with DeNiro. This is the point I like to call \"the table is set\".\n\nUnfortunately, none of these story lines really go deep. The best seems to be Jovovich and DeNiro, but even that falls short of real grit. So much potential here and the actors all seem up for anything. It's just the script lets them off easy.\n\nFrances Conroy is excellent as DeNiro's wife whose had her soul locked away. We never really get the full scoop on the Norton/Jovovich connection, but by the end, that doesn't seem to matter. Is the film watchable? Yes. Could it have offered more deliciously evil interaction between these characters? Absolutely."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "thpgmc",
        "review_rating": "4",
        "review_title": "Slow Drama With Awesome Actors",
        "review_detailed_main": "I have never heard of this movie until it came to my local theater. With a A-list star line up such as DeNiro, Norton and Jovovich how could this movie miss. I was wrong. It did. Those who appreciate great acting in a movie won't be disappointed. (Did you ever see a movie Edward Norton was in that he wasn't absolutely great..well, maybe a couple that he may have did for the just the money..lol. His absolute best was \"American History X\") The movie itself moved along a pace that one keeps looking at his/her watch waiting for the ending. And the ending, again, is the latest Hollywood type...it sucks. Storyline was interesting but never got you interested to a point where one found it entertaining. This was a 98% dialog movie. You could be listening to this entire movie and never watch the video portion and understand the entire script. I am a big fan of Norton and Jovovich but this movie I could have passed on."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Made my eyelids as heavy as stones",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "TheGOLDENWALRUS",
        "review_rating": "6",
        "review_title": "yes, ed norton has a cornrows",
        "review_detailed_main": "Deniro and Norton, back together again. Stone's first two acts are great. You're intrigued, it's unpredictable, and interesting. But the third act leaves you confused and almost unaffected by the story at the end. Stone (norton) is up for parole and wants to get out. Why not throw his sex-crazed wife (jocovich) in front of Jack's (Deniro) feet. But one of these three is starting to see life under a new life. How will this play out? Norton was great but nothing spectacular. Will remind you of his primal fear days. But what makes his performance so good is how he makes his character so likable considering the ridiculous offensive lines that come out of his mouth.\n\nI don't think they went far enough with Deniro's character. It wasn't written well enough. It starts off with a flashback on his broken relationship with his wife and what extremes he goes to keep her. But this ins't really paid off well in the film.\n\nInteresting film. Not predictable. Good performances. Less than mediocre writing.\n\nMy verdict B/C"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "SaMoFilmGuy",
        "review_rating": "4",
        "review_title": "Disappointing, genre-confused story",
        "review_detailed_main": "Filmmaking 101 has a rule; wait, Art 101 has a rule: Know your genre. A drama can have comic relief, but that works only in the framework of the genre that's been established. Comedies can have their dramatic, emotional moments, but if they then turn into dramas, audiences are confused and disappointed. If a screenwriter and director can't even tell their story competently within the confines of the genre they first set up, their movie will fail.\n\nYes, Stone is well acted. So what? Do you go to the movies to see good acting class exercises? If so, check this movie out. Norton and De Niro are entertaining, early on at least, and there's sharp dialog they have to work with (how else could they do their jobs? Don't you love people who praise the acting without acknowledging the script?)\n\nBut the story – the real reason most of us venture out to see a film – in Stoner is a mess. The movie starts off essentially as a thriller. The plot sets up a con working a con, with his sexy wife, on a prison case officer. But after putting the movie is thriller mode the movie then tries to be a drama about the meaning of life and presence of God. The movie tries to turn its main plot with the wife into a subplot, and then pretend that fun, salacious venture wasn't really what the movie wanted to deal with. No, let's talk about the meaning of life.\n\nStone, then, is a disappointment. Even as a drama it fails: the story dissipates into ambiguity with regard to the final action. POVs have jumped around all throughout the movie but in not showing us the final resolution between Stone and his wife, the whole fulcrum of the movie is left blank. As for the transformation of Stone – something Norton tries to act by occasionally calming his voice and widening his eyes – it's unbelievable, not fully formed or demonstrated and, like the rest of the movie, a pretentious attempt to take a fun dime-store novel's story and make it profound.\n\nDon't waste your time or money with this one. If you have to see it, wait for video. The movie is shot in TV-like close-ups for the most part and it will play just as well there."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "7",
        "review_title": "A promising script that is less than the sum of it's parts",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nParole officer Jack Mabry (Robert De Niro) is very near retirement and certainly has no longing for anything that could upset his system too much. So it's unfortunate for him that he crosses paths with Gerald Creeson (Edward Norton) a convicted arsonist coming up for parole after serving a long stretch for manslaughter. Creeson takes him on a journey of awakening and enlightenment with his attempts to improve himself and things are further complicated when his lover Lucetta (Milla Jovovich) approaches him and they find themselves embarking on an affair.\n\nHere's a sleek, glossy looking film with a big name star list that's found it's way straight to DVD. Not a fate it's fully deserving of, but Stone is still an anti-climactic none event of a film, unsure of the direction it's heading in and unable to engage as fully as it should as a result. Despite reliably stellar performances from lead stars De Niro and Norton (you wish they could have worked together in something more dynamite) and a quiet, haunting atmosphere and use of slow motion camera shots and the sound being drowned out, the film meanders uncertainly between drama and thriller territory, leaving the viewer without a clear narrative to follow and having less of an impact as a result. A number of sub plots are left undeveloped, which could have given the film more background and depth, and so the end impression does feel a little sloppy and messy. Which is a shame, as this really isn't a bad film, just one that never allows itself to develop into the sum of it's parts.\n\nDe Niro is making far worse stuff than this nowadays, but it seems even when something that sparks of quality comes his way, it never manages to come off like it would of in his heyday. ***"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "napierslogs",
        "review_rating": "5",
        "review_title": "I wish I got a story rather than messed up characters and a meaningless climax",
        "review_detailed_main": "\"Stone\" is a messed up film. I would like to say that I don't know what the story was about, but that's not really true as it was a very simplistic plot. Edward Norton is a convicted criminal up for parole, overseen by parole officer Robert De Niro. It's not so much that the story is hard to understand, more so that nothing actually happens.\n\nIt's dialogue-heavy as Norton philosophizes his way to freedom, and it's supposed to be character-rich as we watch De Niro try to remain sane as both Norton and his wife Milla Jovovich work their angles on him. But these are just messed up characters that I knew less about at the end than I did at the beginning. The film has clear problems when the only somewhat likable character is the guiltless criminal Norton. But I would say it's bigger problems are with the fact that it's supposed to be a thriller, but all you have is De Niro and Norton jabbering back and forth until nothing is clear and very little of consequence or action occurs. There is even a religious undertone to the whole film, but I have no idea what they were trying to say with that.\n\nI'm sure De Niro and Norton deliver great performances as they always do, but when their characters are poorly written and make no sense, you can't watch a film for the acting. The director was overly concerned with detail, framing every scene and adding nuance to each shot, which is great in some films, but in \"Stone\", it would have served him better to just try and tell a story from beginning to end."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "gavin6942",
        "review_rating": "6",
        "review_title": "Pretentious and Slow, Not a Thriller",
        "review_detailed_main": "A prison psychologist (Robert DeNiro) has the final interview of his career, with a man called Stone (Edward Norton). Things get more complicated when Stone starts finding religion and Stone's wife (Milla Jovovich) uses her charms to influence the psychologist.\n\nOther reviews have called this film \"pretentious\" and I am going to follow their lead. I feel like the story was going to go somewhere and just did not go there, or the writer had a message to share with us, but it was either missed or not as big as I expected. So, maybe pretentious is a harsh word, but until shown otherwise, I am going to go with it.\n\nMy other big problem with the film is that it is clearly called a \"thriller\" by pretty much everybody, and I do not know how that was placed on it. There are no thrills to this film. Suspense maybe, tension maybe... but no real thrills. It is a pretty tame film, more a drama than anything.\n\nI feel that the film tries to explore spirituality and fails. There is a background of church radio, Stone's search for understanding, and some Bible passages... but I was waiting for it to come together and it really just did not ever do it. There was no firm Christian or anti-Christian message. There was some talk of morality, but it was very jaded.\n\nDeNiro gives a great performance, Norton's is not top-notch (I never really believed he was what he appeared to be). Milla is tough to pinpoint. Some have called her performance \"raw\", but I think that is just a polite way of saying she gets naked. She plays her character well, but it is a shame to see her so dumb-down when she can play such strong, independent women.\n\nI think this film meant well, and they gave it a good shot, but it just fell short in a bunch of places. The performances were not what I wanted to see, the story has enough holes that I do not feel it is complete or tells a story that goes somewhere. In the end, I felt empty inside. Whatever I was supposed to get out of this, I did not get."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "sinkell",
        "review_rating": "5",
        "review_title": "excellent performances in a very weak story",
        "review_detailed_main": "This film has: an extremely convincing performance of nearly all of the main actors. Particularly noteworthy is Bob de Niro \"comeback\" after all the despicable \"lati-grobman\"-produced mediocre disappointing films, he finally managed to give a performance of his Golden Years. Lee Strasberg could have been proud of him here. De Niro's acting in this feature can be put in line with all his major dramatic achievements (Deer Hunter, etc). The main problem with this film is what I call the \"no-story-thing\". The script is so weak as if non existent. I'd like to pose the obvious questions: *Who* the de Niro's character is? What was the historic psychological dramatic crime he had committed in his younger years that made his wife wanting the separation? I am 100% sure that de Niros' character is in no way \"accomplished\" in the film. It is simply too inconsistent and unconvincingly odd. The same goes for Mila Jovovich character. Mila delivered here one of the best dramatic performances in her entire cinematic career, that is true. But Mila's character is also remarkably unclear, it is far too contradictory and inconsistent as well. We do not understand *why* she behaves the way she does, we do not understand what she feels about her troubled husband. If she is a psycho-prostitute or a cheap call-girl, that should have been stated more clearly. The film lacks any message, any consistent line or a well-elaborated \"story\". The script seems to be too poorly orchestrated. There are too many unexplained details that are altogether \"too odd to be missed\" and at the same time clearly do not indicate anything meaningful. Like, why the wife of de Niro's character must have \"different-sized\" eyes; does this \"eye disease\" connote something particular, or is just another accidental sloppy \"oddness\"? The film leads its viewer nowhere, the director has no message to tell to his viewers, and the way the movie ends only strengthens the feeling that the scriptwriter and the director simply did not know what to do with it, the ending is a CLEAR regrettable fiasco."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "ritaokla",
        "review_rating": "8",
        "review_title": "It's a film about religion",
        "review_detailed_main": "How do we make sense of our lives and keep going despite all the bad things that happen to us? Most people find the answers to those questions in religion, and the characters in this film line up like a rainbow of answers: Jack (DeNiro), a prison bureaucrat, is agnostic; his wife Madylyn (Conroy) is a mainline Protestant; Stone (Norton) is a convict but also a seeker who finds his answers in a New Age religion; his wife (Jovovich) is an unabashed atheist. Throughout the film, evangelical radio frequently plays in the background, another stripe in the religious rainbow.\n\nAs a miserable young Madylyn hints to the viewers in the first scene of the film, the prison setting is a metaphor of the dungeon of the soul. For these four characters, loveless marriages, life work that seems futile, and memories of violence are their dungeon walls. Jack, Madylyn, and Stone all struggle with depression. Stone's is so deep that he edges toward suicide, but he searches for answers among the religious readings in the prison library and finds one that makes sense, especially after he witnesses a brutal stabbing at a range so close that the blood spatters his own face and he sees the murdered man eye to eye.\n\nJack seeks pastoral counseling after church one Sunday, admitting finally that the Episcopal framework of his life has never made sense. The minister quotes the Bible to him, \"Be still and know that I am God,\" that is, listen for the answers that God provides. Oddly, that is exactly the prescription that Stone gets from his new religion too. It teaches that \"God\" or Truth speaks to us through everyday noises – insects buzzing, the voices of a prison exercise yard, talk radio, or a spoken mantra – if we just listen to the universe.\n\nStone does listen, and he begins to change. His new hairstyle, speech, and demeanor all signal to the viewer that he is a man reborn. The prison walls within Stone's mind fall away so that by the time his parole is finally granted, it hardly matters to him anymore.\n\nJack, meanwhile, hears nothing in the noise of his troubled life, nor can he makes sense of what Stone tries to share with him. As his retirement nears, he grows more and more reckless. Blind to the transformation that Stone has undergone, Jack suspects that he is being played. To the end, Jack remains suspicious and fearful of Stone who has come to terms with this past and feels only gratitude toward the aging jailer.\n\nIf you are looking for a conventional action flick with good guys and bad guys, this is not it. If you want an intelligent film about how desperate people search for faith and solace, you will not be disappointed."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "great actors in interesting roles",
        "review_detailed_main": "Jack Mabry (Robert De Niro) is a complicated man. As a young father, he hangs his daughter out the window to force his wife Madylyn (Frances Conroy) to stay. He has a few weeks before retirement as the prison parole eligibility officer. One of his last cases is Gerald 'Stone' Creeson (Edward Norton). He's combative but also demanding to get out early. He gets his wife Lucetta (Milla Jovovich) to seduce Mabry.\n\nDe Niro and Norton get a couple of interesting characters to work with. This seems to be set up for some great acting and intense character drama. I do like the interactions between the two leads. Jovovich is able to keep up. It stumbles here and there. I don't really get the mishmash of religion in this. I think this could have been award winning performances if the movie is better written."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jozzev",
        "review_rating": "1",
        "review_title": "This is possibly the worst movie ever made",
        "review_detailed_main": "This is possibly the worst movie ever made. Imagine how bad it must be if I say that even though actors as Robert De Niro, Edward Norton, and Milla Jovovic are in it! It is absolutely about nothing,there's no plot whatsoever, Edward Norton plays an annoying and not very believable character, Robert de Niro a depressing and depressed old man, and Milla just flashes her tits and that's it. It's a 2 hour torture to sit down and watch this movie. It is sooo slow that you just can't help but drift off. I seriously have no idea what the point was of this totally worthless movie, why people invested money in it, and more than anything, why normally great actors choose the roll! Do not go and see this, ever!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "ankitgoyal7",
        "review_rating": "",
        "review_title": "The rare film and a good story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rdoyle29",
        "review_rating": "5",
        "review_title": "What a terrible movie",
        "review_detailed_main": "Robert De Niro is a prole officer living his life completely by wrote, afraid of his internal violence. (We kind of see this in an opening scene with younger stand-ins for De Niro and his wife Frances Conroy). He goes to church regularly and does Bible studies with Conroy, and the two quietly drink themselves into a stupor every evening.\n\nDe Niro is nearing retirement, but one of his last cases is Edward Norton, a convict serving a 10 year sentence for involvement in the murder of his own grandparents. Norton is more than a little slick and tries to play De Niro, but can't get through his \"by the book\" exterior. He sics his wife Milla Jovovich on him to attempt to seduce and compromise his integrity.\n\nThis is a frustrating film because it has something like the makings of a really good film, but it just fails to deliver on pretty much anything. It has SERIOUS THEMES. It has more SERIOUS THEMES than it knows what to do with. At the heart of the film is the suggestion that ... perhaps ... people with deep spiritual holes try to fill them with religion of some sort, but halfhearted religious observance does nothing for them. (Or it thinks that all religion is an attempt to fill spiritual holes ... hard to really say.) What the film really fails to do is anything beyond raising themes and then letting them just kind lie there flopping around.\n\nIt doesn't help that neither De Niro nor Norton are very good here. De Niro is walking through the motions of playing someone walking through the motions. Norton's performance feels like an imitation of a prisoner he met somewhere. I'm not certain if it's really their fault, since the movie really just gestures at the interiority of it's characters, so it's unclear if they really had anything to work with."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "sol-kay",
        "review_rating": "6",
        "review_title": "Stone Cold",
        "review_detailed_main": "***SPOILERS*** In what seems like a replay of his role as Adam Stampler in the 1996 thriller \"Primal Fear\" Edward Norton, no relations to Ed Norton of the 1950's \"The Honeymooners\" TV series, plays convicted arsonist Gerald \"Stone\" Creeson who's now up for parole after serving 8 of his 10 to 15 year sentence. Creeson's parole Officer Jack Mabry, Robert De Niro, is about to put in his retirement papers and this is just, that's what he thinks, another menial case for him as he goes through the motions in processing it. As things turn out this nothing of a case will end up screwing up Mabry's life big time! In it bringing out all the skeletons he's been hiding in his closet for the last 40 some years.\n\nCreeson at first giving no intentions to parole officer Mabry that he's interested in being released soon starts to change his mind when he presses a few of his buttons about his shoddy and forbidden past. Knowing that Mabey has far bigger problems then he does Creeson starts to dig deep into his troubled life that makes the whole parole hearing about himself totally insignificant! It's now Mabry that's on the hot seat not convicted arsonist Creeson and what's even worse Mabry knows it! Getting his child like and very sexy wife Lucette, Milla Jovovich, involved Creeson opens up an two front attack on the clueless Mabry who, despite his some 40 years experience as a parole officer, naively falls for it!\n\nIt's when Mabry gets romantically involved with Lucette that her imprisoned husband Gerald, who's insists on being called Stone, finally gets the goods on him. Having sex with the wife of a man that he's to judge if he's eligible for parole or not is a big \"No No\" in the prison system and that's exactly what the not so bright Mabry has been doing! It can not only get him fired and lose his pension but thrown behind bars as well! Finally knowing that he's been had Mabry has no choice but to recommend Creeson's parole in him feeling that he's not really ready to be free in a society that he so skillfully manipulated both in as well as behind bars!\n\n***SPOILERS*** There's still more to this movie then what you've already seen in how Jack Mabry's life as well as abused wife Madlyn, Frances Conroy, completely go up in flames. Madlyn a church going bible toter loses it and starts to swear like a drunken sailor out on shore leave. And later, even though it's not exactly proved,sets the house on fire feeling that it's the Lords work to punish both her and her husband Jack! As for Jack Marby he also completely loses it and tried to get even with Cresson, who's now out on parole, by cornering him in a dark alley and trying to blow his brains out! As we see it's Mabry who needs help, serious psychiatric help, not Gerald \"Stone' Creeson who's now a completely rehabilitated law abiding citizen. But all that at the expense of the total mental breakdown of his now committable parole officer, as well as his wife Madlyn , Jack Mabry!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "cesarbau",
        "review_rating": "4",
        "review_title": "Religious themes mere decoration for flawed script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jotix100",
        "review_rating": "6",
        "review_title": "The parole officer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "mayorbob",
        "review_rating": "5",
        "review_title": "The Good News Is That It Stars DeNiro & Norton",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "mbs",
        "review_rating": "6",
        "review_title": "reasonably well done, but i kinda wished it focused much more on Ed Norton's Stone and much much less on De Niro..",
        "review_detailed_main": "Stone has a very intriguing first act--carefully setting up its characters and situations--leading into a very interesting development in its second act--only to completely blow its momentum by shifting focus completely away from Stone in its third act. (why would a movie called Stone not be about the character who's named Stone???)\n\nEd Norton as the cornrows wearing ex-con seeking spiritual enlightenment is actually pretty believable once you get past the fact that its Ed Norton (which i didn't have any trouble doing past the first scene--i thought he was fine.) Robert De Niro seems to be sleepwalking yet again at first, but in this case its his character who's sleepwalking as that seems to be his default setting in life. His performance isn't bad either--and the early scenes of the 2 men playing off each other hold a lot of promise...even if De Niro's character is more or less the kind of character he used to play a lot more often\n\n(it actually reminded me of Robert Duvall's character in Get Low--De Niro's character is a hermit here too, defined primarily by the guilt he may or may not feel over an act of seeming violence he may have committed as a young man--which is incidentally the opening scene of this film--again mirroring the opening scene of Get Low which also features an act of cowardice that comes to define Duvall's life of solitude--- De Niro's character doesn't really communicate with many people--even the wife he lives with--and the movie's content and pacing isn't unlike Get Low either as its essentially about the re-awakening of an old hermit to his life--although this is certainly a much more pessimistic movie overall...much more so.) So the first act is mostly De Niro trying to figure Stone out--and Stone tries to assess what De Niro's weakness might be...and how he can try and exploit it. These scenes are solid..and leave you wanting more--and soon we get the introduction of Norton's wife who seems like she'll do anything to help her husband get out....and its here where the film's first problem pops up---how exactly does Mila Jovovitch manage to coax De Niro out of his shell again?!?!?!? we see scenes of her frantically trying to get his attention and him actively resisting--but then before you know it--he's engaging with her--and maybe i missed how she got to him--but i didn't quite understand what or how De Niro finally got coaxed out of his shell...or what it is that sends him fleeing right back into it more then halfway through. Meanwhile the film has had a recurring shots of De Niro listening to this religious radio station on his car on the way to and from work--and we hear the DJ talking about sin, and salvation, and what a person can do to try and salvage his prior acts to make himself whole again...it makes sense within the film as De Niro and Norton have been almost exclusively talking about Norton's shame and any possible sense of remorse Stone may or theoretically should feel if he really wants the parole he's seeking.\n\nFilm then tries to pull everything together by having Stone actually attain the religious enlightenment he had actively been seeking out (!!!!)---much to De Niro's confusion, and increasing anger. This is a very interesting development- both for the characters and for the film-and the handful of scenes that focus on Norton's new found enlightenment are very interesting to observe--and personally i felt that the film should have really dug deep into Stone's new found sense of self more then it does. The film kind of takes it for granted that Stone is more or less comfortable in his newfound sense of self worth and more or less spends the rest of the film with De Niro's increasingly agitated parole officer. Stone's serenity is very much aggravating De Niro and the third act seems to be about how De Niro reactions to Stone's personality seems to change his own life for the worse.\n\nOnce again sadly for a film titled Stone--the movie doesn't seem to focus too much on Stone--choosing instead to try and go overly in-depth on the only major character in the movie who's not named Stone. I don't want to say that this is a mistake--as De Niro's character is the one with the more potentially bottled up rage inside him--but i feel as a character---De Niro's corrections officer is just not all that interesting enough to sustain viewer interest. The character is kind of rock stubborn and resistant to any change whatsoever--so in a sense he is the stone of the title as well--but this idea of De Niro's character being the one that really needs the enlightenment and failing to achieve it never quite comes off as being anywhere near interesting or moving enough the way that it should in order for the actions De Niro's character takes towards the end of the movie to really land. De Niro's character's actions make sense emotionally, but not so much logically--which may in fact be the point the film's trying to make altogether but by this point--the film's already lost me to questions about what happened to Stone and how come he's suddenly not on screen anymore? Its a very nice mood piece overall--and the 2 leads are fine and all--but as the film goes on and the focus shifts more and more towards De Niro's parole officer (which to be honest it pretty much has been for most of the film already) and less and less on Norton's unique prisoner-dropping him from long stretches in the last half hour altogether-the film gets more and more problematic--and less and less interesting. See it if you like either of the 2 leads for sure, but otherwise you might be disappointed."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "bb-938-618357",
        "review_rating": "3",
        "review_title": "Stone, how to lose 100 minutes of your live.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Dexter22",
        "review_rating": "10",
        "review_title": "\"Stone\" The overlooked film of the year",
        "review_detailed_main": "When reading the ratings and reviews of this film I believe that some viewers went in expecting something different. I can fully understand that it wasn't for everyone. The film surprised me as to how non typical it was in its plotting but it was the best character study in a long time.\n\nJack(Deniro) is about to retire but requests that he can finish his final convicts paroles. Stone(Norton) is one of those convicts. Stone starts as a character who wants out of prison but not for the reasons a parole officer would want. The plot is seemingly straight forward in its setup. Mila Jovavich gives a wonderful performance, most notably because the audience is never really clear on which direction she is taking in her motivation. Its not a trait to make her more of a suspenseful character, its to show how one dimensional her relationship really is with Stone.\n\nThe essential plot setup is Jovavich and Stone decide on a plan to seduce Jack so that the parole is a must. The problem is that once this starts, Stone begins to experience change. As does Jack. I will not go into it much more. The film relies on the characters emotions rather than intense cat and mouse games. The film sets the audience to follow the \"good guy\" (Deniro) but it challenges the audience later to decide really who to trust.\n\nThe most interesting aspect is that Jack is content when listening to Stone's problems but when Stone begins to change, Jack is not alright with it. The years of holding back his darkness cannot stay contained when he is not judging others.\n\nThe film is definitely one to be analyzed. This could be why the reception is severely mixed. It had a profound effect on emotion. No specific type except dread and in some cases, familiar motives.\n\nThe film cannot be reviewed without a depth of character discussion, so in this case check the film out. Just do not expect typical suspense thrillers Hollywood has given. Ignore the rating until you view it yourself. And if nothing seems to get your interest, just expect great performances for Deniro, Jovavich, and Norton."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "MikeyB1793",
        "review_rating": "7",
        "review_title": "Great Acting and dubious ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "intelearts",
        "review_rating": "5",
        "review_title": "My 356th Review: As honest an assessment as I can make as to why this fails",
        "review_detailed_main": "Director John Curran missteps here. Like his previous film, The Painted Veil, there is too much emphasis put on being smart here and what should be a clear and strong story of a parole officer and a prisoner and the prisoner's wife and their relationships is over-confusing and frankly, dull.\n\nOne sees influences, for example Malick, particularly in the contrast of spaces, and Altman in the use of sound, but it is in both these areas where Stone is at its weakest. Sound in particular is over-over- edited in Stone - we go from no sound at the Maybry house to constant overlapping tracks at the prison, which should work well, that seems right, but instead detracts. The viewer is assaulted constantly by devices that disorientate. In addition the constant use of close-up, with little or no medium shots in the conversations becomes deadening.\n\nWriter, Angus Machlahan, who wrote the excellent Junebug, has conversations that are good but where is a rigorous editing process - at an hour and 45 this stretches the goodwill of even the most attentive viewer- we are really watching theater and not film here.\n\nIt is the performances that should shine and to an extent they do - but, we are mainly left, frankly, bored. I was waiting to understand how a man of 43 years marriage would fall for Milla Jovovich's Lucetta - and I, for one, couldn't make the leap. Sexy just wasn't the quality that I suspect Robert De Niro's Jack has in his top 10 list of what to look for in a woman. In addition, De Niro lacks gravitas here and Norton is clearly the better actor - and that maybe heresy - but we all felt the power lacking in De Niro's performance acutely. The strange thing is that we all recognized that there is more going on here from De Niro, but for all of us, it still was just not a good, let alone great, performance. Norton gets the character with all the ticks and of course that's easier but here just seems more committed to the process.\n\nAll in all, a disappointment - the film opts for busy when simplicity would suffice, and when being simple and meditative fails to do more than intrigue. Above all it is over-edited and post-produced - so that the performances are sublimated by the after thoughts of the directing team.\n\nStone is simply a mess - too much script and way too much in the directing - it wants to be more but manages the awesome trick of making simple both overcomplicated and boring at the same time - and here the difference with Malick is obvious - Stone needs clarity to be clearer, to not try to fill in all the gaps with information - it needs to allow the viewer less interpretation in the mediative stretches, and needed less in the conversations - there are some excellent lines that are then spoiled by just going on and on.\n\nStone really needs to just get on with rewarding us with a film worthy of such a fantastic cast."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "tieman64",
        "review_rating": "",
        "review_title": "Good material ruined by inept direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "claywork59",
        "review_rating": "7",
        "review_title": "Unique drama.",
        "review_detailed_main": "It's not epic, but it's definitely different. Given that DiNiro needs to get away from stupid comedies, this was a much more adult movie. Definitely not a shoot em up or a high action film. It's slow and quiet, meditative. I liked it, though I watched it on DVD. I probably wouldn't have liked a quiet drama like this very much in the film. It's kind of intense, but also kind of quiet.\n\nI liked it because it's intelligent and different. I thought DiNiro and Norton were both great. Norton may need to watch out; many more of these sorts of roles and he's in danger of becoming officially typecast. DiNiro was strong and the female lead walked a good line between sexy and dangerous."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "montera_iulian",
        "review_rating": "5",
        "review_title": "Another dull and uninspired De Niro movie... When's the loss streak gonna end?",
        "review_detailed_main": "What is \"Stone\" about? It's about manipulation? Is it about deceiving? Is it about blackmailing? Is it about a guy who wants to get out from prison or it's about the bad things done in order to do good things? Obviously, John Curran, did not find out the best way possible to deliver the right answer nor he managed to balance the movie properly. We completely forget about the purpose because the movie drags too much around some characters that don't have a good chemistry nor a powerful or intelligent story to be connected with each other. The storytelling gets pretty messy at points, a lot of awkward moments and useless pieces of dialogue but most of all the \"path\" or pattern could be seen by the beginning. This movie lacks in consistency, balance and character development. It becomes dull and nothing really keeps you interested, sometimes you wish you could have seen it home so you could have the possibility of skipping a few minutes here and there.\n\nThe casting was not that great even if all main actors are known for their career or potential. De Niro, specifically was not meant for this role or this movie perhaps. His role was not that boring but not interesting and his character portrayal was to me a simple routine for him. No soul into it, no hard work just... acting routine. Milla Jovovich on the other hand was a perfect choice because she really fits the role of a gorgeous, easy and weird woman. She delivers that strange sexual behavior very good so choosing her for this role was a good option. Edward Norton, who we all know mainly from Fight Club and American History X, impersonated the desperate but meticulous convict pretty well. He added nothing outrageous to his character but he didn't had the courage or inspiration to make it appear more convincing.\n\nTechnically, another disappointment. The cinematography was not that good, the lens were too grey on moments and I really felt I was gonna fall asleep especially because of the editing. So many useless shots, so many silence moments, so many points where I was like sitting in my chair, looking in my left and my right, looking back to the screen and tried to remember what movie is that I'm watching right now. I felt really disappointed.\n\nOverall, this movie lacks in about everything that is needed for a good movie to be made. It's not a great time at cinema and I honestly don't recommend it unless you're a fan of dull movies. I guess for a rental it could be good but otherwise I cannot support this movie in any way. I am still counting the days till a good De Niro movie..."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "secondtake",
        "review_rating": "6",
        "review_title": "Mind games and bed games and end games and a tantalizing flop",
        "review_detailed_main": "Stone (2010)\n\nA long look at a interesting but fairly simple scenario: a clever prisoner and his seductive (and even more clever) girlfriend on the outside play a mindgame on a prison release officer, to try to get an earlier release.\n\nThere are three actors who carry the whole load, and all three range from wonderful to stellar (I'll let you decide which is which). Robert De Niro is the prison official, about to retire, and he has no need to take a chance or bend the rules in the waning days of his career. But Edward Norton is no ordinary prisoner, and he plays with De Niro's head a little, mostly setting him up for an encounter with his complicit (we think) girlfriend. This woman is played by the extraordinary Milla Jovovich, who works on De Niro outside the prison walls.\n\nIf this were all it, and the movie was cut in half (literally, in half) it would be a fantastic film. But it drags out every aspect of these cunning and seductive interactions (in several senses of the word) to the point of just being tiresome. This is purely director John Curran's fault (assuming he has some sway over his editor, Alexandre de Franceschi, which he should--they have worked together often before).\n\nThen there is a second level to the plot, and the theme introduced (almost inexplicably) in the first scenes. I won't spoil anything here except to say that this secondary plot is sensational, superficial, tacked on, then forgotten for an hour and a half, then tacked on again in a sensational and superficial ending. It's supposed to add an intense, personal, even psychologically probing aspect, but it is just cheap and dumb. Sorry to be blunt.\n\nI'm blunt because it's a shame. The core of the film is actually brilliant, and brilliantly executed. See this movie forewarned, and yet with some appreciation for the best of it."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "saadgkhan",
        "review_rating": "2",
        "review_title": "Really Confusing, Whether its a thriller or a religious movie about Zukangor Aka. Eckankar?",
        "review_detailed_main": "STONE – TRASH IT (C-) Stone is all over the place and director is really confusing whether he is making a thriller or a religious spiritual movie about Zukangor Aka. Eckankar. Mixing up the whole thing together was utterly disappointing. I actually fell asleep during the movie because whatever was happening was not making sense at all. There were so many things which till the end were not clarified, which was annoying. I just couldn't get how they got Robert De Niro and Edward Norton to do this movie? Maybe they paid lots of money. Although, their roles were confused but their acting was defiantly better. Milla Jovovich was Incredible; she looked Stunning and acted really well. Overall, it was a big disappointment like \"The American\", which leaves you wonder, how the script got approved? And how they got Big stars to sign up?"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "christophe_vdh",
        "review_rating": "6",
        "review_title": "Not what I expected",
        "review_detailed_main": "I thought this was going to be a cat and mouse game type of psycological thriller but it turned out to be something else. It turned out to be about losing and finding religion, about spiritual birth and death. It did nothing for me as I'm neither spiritual or religious. The radio playing in the background, talking about God and gun laws aren't relevant to me personally either. The characters in the movie seem lost and the conclusion rather dissapointing. Like the only ones getting something out of this, are the characters and not the viewer. A movie not for everybody but perhaps for some..."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Caribstu",
        "review_rating": "2",
        "review_title": "Stone sinks like a rock",
        "review_detailed_main": "Staring the highly promising cast of Robert De Niro and Edward Norton, Stone is the story of a prison inmate and the relationship between himself, his wife and the parole board officer in charge of his release.\n\nNorton is as thorough as to be expected and provides a convincing performance as the incarcerated man. De Niro is solid and dependable in his portrayal of the complex correctional officer. These two established actors are the films saving grace. The script is mediocre, the film itself drags and leave you with that familiar taste in your mouth, It's not sweet, it's not savory, its not even umami, it's one of \"well that was a waste of time\".\n\nBasically it's very disappointing and to quote Shakespeare \"much ado about nothing\".\n\n2/10"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "QuickFlixster",
        "review_rating": "8",
        "review_title": "A good story made up for by phenomenal acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "sauravjoshi85",
        "review_rating": "6",
        "review_title": "Good plot but slow execution spoils the film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "perseas02",
        "review_rating": "2",
        "review_title": "Why Robert?",
        "review_detailed_main": "Well, I waited a long time for a De Niro-Norton duet and having seen the film I feel it is a bomb. The plot is not bad, but the ending is powerless and it all feels like a play rather than a star feature. Jovovitch is disappointing, I don't even know why she was considered for this role, next to these magnums (talk about lucky!). Her acting is almost amateur if not just bad. Her role is the main link in this movie and she gives a very weak impression that would be good enough for 12 Monkeys 15 years ago. De Niro's performance was captivating, but I didn't like the sex scene - this is something not expected from De Niro. I can't help wondering, couldn't both De Niro and Norton find a better script? Director John Curran is not known for any real hits, so how did both actors risked like that?"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rudolfo-silva",
        "review_rating": "3",
        "review_title": "garbage...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "ACarringford",
        "review_rating": "7",
        "review_title": "Should Have Been Great -- But . . .",
        "review_detailed_main": "Since no one got it, let me explain this to you. This is an attempt to adapt the theme of a 1966 movie that Ingmar Bergman made called, Persona. In that movie, a prominent actress has had some sort of mental breakdown, becomes unfeeling and has retreated from communication with the world. A maid is hired to take care of her who is healthy, vibrant, carefree. As the two characters develop a connection they start to rely on each other for validation and emotional support, eventually the characters reverse roles. The actress returns to the top of her professional and it is clear that she has drawn energy and emotional power from the maid. At the same time the maid has been left an enervated mass of self-doubt and paranoia. The artist transformed herself by art, but accomplished that by sucking the life out of the original youth and vitality of her companion.\n\nThe same thing happens in this interaction between a prisoner (Ed Norton) and his case officer (Robert De Niro), or at least that is the idea. In the beginning, the prisoner is vengeful, paranoid and self-destructive. At the same time, the case officer is a religious man with a settled working class existence, apparently respected in his job and a tranquil, picturesque family life.\n\nThe scenes of interaction between Ed Norton and Robert De Niro are of the essence because we see the case officer slowly become more manipulative and hostile, at the same time that the prisoner becomes more natural and willing to let go to the extent of acceptance if he is denied parole.\n\nThe problem is that beginning with what must have been a masterful script, somehow the director, and most especially the film editor, never got the message and apparently never knew what their own movie was about. As a consequence they tried to twist into a straight thriller with ambiguous motives, artificial tension as we follow closeups of the officer's gun and phone calls to the officer's home that might or might not be threatening.\n\nBoth of the characters have a guilty secret from their pasts that they are attempting to deal with. The prisoner finally recognizes his guilt and puts it in perspective, and at the same time he derives a sort of spiritual sustenance by a direct connection to the sound current of the yogis. The case officer never deals with his guilty and it isolates him from his wife and the religious aspects of his life that ultimately give him no spiritual sustenance.\n\nIn the end the two characters have reverse positions. The prisoner is both free and healthy. The case officer is trapped in own sickness of guilt and paranoia. The final confrontation that takes place in an alley does not work because, apparently for Hollywood purposes, the case officer has a gun in his hand. You now understand this movie better than the director did. Too bad, because it could have been great. Can you imagine, Persona accessible to American audiences? It could have been a classic."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "tpwjjcbbv",
        "review_rating": "4",
        "review_title": "Odd Movie",
        "review_detailed_main": "Okay, so first off ill give my props where they're due. Even in old age(67) De Niro can still act well. Edward Norton deserves slight props for his role. He acted it well, but i was not a fan of his voice constantly breaking and cracking.\n\nHere's the reason this movie is only 4 stars on my scale. Milla Jovovich. Now, we all like an attractive actress who shows some promiscuity, but she completely over sexualized the character to a point where its not sexy at all. She was unbearable to watch. I skipped all the scenes with her in them after about halfway through the movie. Saved me some valuable time."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "stathisvoukelatos",
        "review_rating": "6",
        "review_title": "A very interesting movie yet not a masterpiece",
        "review_detailed_main": "Firts of all i have to declare that Stone is a movie that in order to be enjoyed,the watcher must have the proper expectations of what he is going to see.My point is that if you expect that this movie is a flawless masterpiece you 99% are going to be disappointed,but if you expect this movie to be just good you definitely are not going to be let down.Because that's what this movie is,just a good film with a common mediocre scenario and two huge actors that save the day.De Niro and Norton are as always perfect on their roles but that does not simultaneously means that this movie is an epic.Something else that should be noticed is that Milla Jovovich is surprisingly good,of course she is no great actor but she surprised me pleasantly.Actually,if the actors that are in the leading roles were unknown,the movie in my opinion would get a lot more credit.Anyway Stone is a nice and enjoyable film that is not going to make you bored and disappoint you,except if you expect it to be magnificent,because despite the fact that Robet De Niro and Edward Norton are two of the greatest actors of all time, this movie is not magnificent..."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "sp1063",
        "review_rating": "1",
        "review_title": "Another pretty bad De Niro flick",
        "review_detailed_main": "I was really disappointed with this movie which is surprising especially with the cast that's in it. Horrible script, storyline drifts, and you don't ever really begin to care about any of the characters.\n\nMaybe it's just time for De Niro to hang it up."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Deliberately inaccessible and unworthy of the rather deep and meaning airs and graces it suddenly puts on",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "cosmo_tiger",
        "review_rating": "6",
        "review_title": "A retiring parole reviewer gets tangled up with a parole's personal life. De Niro and Norton, always good. Jovovich, WOW! I say B+",
        "review_detailed_main": "A month away from retirement, Jack (De Niro), is handed the parole request for the inmate \"Stone\" (Norton) who wants out so bad he enlists the help of his wife (Milla Jovovich). I will warn you, the opening scene of the movie is a tad disturbing, but is needed to understand the characters. Jack is a pretty routine guy and wants to handle the \"Stone\" situation before leaving. Trying to convince Jack he is a changed man, but not willing to risk being turned down, he asks his wife, Lucetta, to talk to Jack and convince him that he should be free. I've heard actors talk about \"character arcs\" before, but never understood what they meant by one until this movie. Much like \"Jack goes boating\" this movie is better then it is because of the acting. De Niro and Norton you know what your gonna get, but Jovovich breaks out of her \"Resident Evil Bad-Ass\" role in a big way and holds her own against these two. I really like movies that make you thing about them when they are done, this is one of them. There are no loose-end tie ups, and like \"Inception\" you are left to draw your own conclusions. I give it a B+"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Thanos_Alfie",
        "review_rating": "5",
        "review_title": "Not as good as it should be...",
        "review_detailed_main": "\"Stone\" is a Drama - Thriller movie in which we watch a parole officer getting tricked and manipulated by a convicted inmate and his very beautiful wife in order to receive his parole.\n\nI have to admit that I expected more from this movie because it had a very good cast with well-known actors and a simple but interesting plot. I am not saying that I did not like it because I did but I believe that it could be a much better movie than this with a few changes in the plot and a better direction. The interpretations of the main actors remained in a basic level and I believe that Robert De Niro who played as Jack, Edward Norton who played as Stone and Milla Jovovich who played as Lucetta, did not reach their potential. I also believe that if they were reaching their potential, this movie would be extremely different. \"Stone\" is a good movie if you want to spend your time but do not expect much from it because otherwise you will be disappointed by it."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "economically_deficient",
        "review_rating": "10",
        "review_title": "An interesting film, grows on you",
        "review_detailed_main": "Going to the theater, my expectations of \"Stone\" were rather typical of any thriller produced nowadays. Reading the (somewhat misleading) synopsis and looking through the cast, I couldn't set my hopes up to anything far beyond \"ordinary thriller with a decent cast that probably won't outdo a potentially blunt story\".\n\nKeep in mind: this is NOT a thriller, at least in the conventional sense of the word. It's a heavy drama with extremely minimal undertones of suspense.\n\nThe basis of the story is quite simple (read the synopsis), but the majority of the film's focus is in its character study. This is where the actors seriously shine. That seems to be the issue with most of the negative responses the film received. Yes, it is slow paced. Yes, there's a lot of religious jargon thrown around. Yes, it is quite the anti-climactic film. But isn't that the point? De Niro, who I haven't seen in anything memorable after Jackie Brown (okay, I'll exclude The Good Shepherd), is marvelous as the underplayed Jack Mabrey. The subtle nuances he gives to a character so burned out of work, marriage -sidenote: Frances Conroy was amazing-, and life in general (the speech he gives at his brother's funeral in the beginning comes to mind) are nothing short of astonishing. I can't stress on how great the performance was, De Niro has definitely gone back on track.\n\nEdward Norton is equally terrific. I could go on and on about his perfect use of mannerisms, facial gestures, and especially the accent to formulate an interesting character. What I found interesting, and fortunately detracted any notions of the film being one-sided religious crap, was the contrast between Jack and Stone's religious beliefs/endeavors; Mabrey, for instance, sitting in the porch with his disturbingly delusional wife, discussing religion and the existence of God, while shunning its very purpose during situations of danger and conflict (the seduction, and another scene towards the end which I won't spoil). Stone, on the other hand, a misguided delinquent with strange views of death, forms an epiphany on the purpose of his existence at a more realistic - another good word is unconstitutional - level during his stay in prison, confusing the hell out of everyone due to his inability of expressing it on a more intellectual basis. This probably makes one very lucky case of ignorance being bliss.\n\nThe biggest surprise, however, was Milla Jovovich. I honestly did not see that coming from her at all. Her previous attempt in handling a serious role in \".45\" only came off as an attempt, with clunky overacting that I guess can be forgiven due to the frigging horrible writing and direction of that film. But she does extremely well here as Stone's wife, the sexy seductress with a personally agonizing struggle of commitment. With her loyalty to Stone becoming blurred through the sexual encounters with other men and her general flirtatious attitude, it was mesmerizing to see Jovovich pull it off so well. She was simply dynamic in this film.\n\nAs the credits started rolling, I could hear many people in the theater ranting about how their time has been wasted. Lots of \"what the hell?\" came up, too. I'll admit that it came off as a surprise to how it just abruptly ended, but I eventually managed to appreciate the artistic integrity of the film. One reviewer here commented: \"Stone is well acted. So what? Do you go to the movies to see good acting class exercises?\" I can't put myself to agree with this, the film's got far more that just \"acting class exercises\". It is a sharply written, well directed film that I plan on watching again.\n\nIt sure got me thinking, and that seems to be what many others don't expect anymore."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "gerhardt52-290-408650",
        "review_rating": "6",
        "review_title": "A Study In Disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jordondave-28085",
        "review_rating": "5",
        "review_title": "The message is there but fails to deliver",
        "review_detailed_main": "(2010) Stone PSYCHOLOGICAL DRAMA/ THRILLER\n\nAt the first few minutes, has a very young wife telling her young husband that she wants to leave him. He then goes berserk and runs upstairs straight to their first born child before threatening to drop it down below, telling her that if she leaves him, he's going to drop the baby down below since he won't have anything else to live for. Scared out of her wits, she reluctantly agrees, and makes a promise that she'll never leave him. Then the movie jumps several years later, and it appears that this very same couple have now aged 40 years older. The person that had once threatened to kill his first born daughter by dropping it out of the window has now grown up to be Jack Mabry, played by movie veteran Robert DeNiro, and his wife is Madylyn Mabry (Frances Conroy). Jack's been working his whole life as some sort of parole officer who has the authority to grant a hearing for convicted convicts. He also happens to be close to retirement. One of those inmates he had to speak to is Gerald Creeson (Edward Norton), but nicknames himself to be called \"Stone\" hence the title. There's a reason why he calls himself that, and it was during this time the movie 'stalls' viewers by subjecting us to listen to this ridiculous analogy by suggesting that he is no different than Jack. Gerald even sends his young skanky girlfriend, Lucetta Creeson (Milla Jovovich) to do whatever it takes to convince Jack to grant him a hearing, by not following proper protocol and just cut corners. At this point, I'm thinking how did Lucetta even get Jack's home phone number and find out where he lives in the first place? The movie never answers. We're also subjected to witness Jack's boring life, who we later find out that he only goes to church by principal, and upon listening to Bible passages quoted on the radio and on TV, he hears them but totally ignores them. His wife even made attempts to start a discussion with him about the passages and ignores her too, exactly like he's been doing with her while living with him, which is why she wanted to leave him in the first place. The director by the name of John Curran tries to convey a point to the audience, but it somehow gets lost somewhere down the line since none of the characters or it's situations are unrelatable - he does this by adding uncommon situations and expect viewers to overlook it, but you can't because it's there and is also defined as a drama movie."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "birdieleigh",
        "review_rating": "",
        "review_title": "Great acting wasted on a murky story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "memento-christo",
        "review_rating": "6",
        "review_title": "Stone: Faith and Religion in a psychological thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "mauvemoonlight",
        "review_rating": "1",
        "review_title": "Complete crap and nonsense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "UNIVEXatAOLdotCOM",
        "review_rating": "7",
        "review_title": "What fly?",
        "review_detailed_main": "Milla never looked better! Stream it today! A little confusing at the end but the acting is superb by all 4 main characters. I still cannot figure out the fly. HELP!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "allan_mckie",
        "review_rating": "1",
        "review_title": "Worst Movie. Ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Hellmant",
        "review_rating": "7",
        "review_title": "Convoluted and unintelligible but the story is full of a lot of great ideas as well as powerful performances.",
        "review_detailed_main": "'STONE': Three and a Half Stars (Out of Five)\n\nEdward Norton re-teams with director John Curran (after starring in his last film 'THE PAINTED VEIL') as well as Robert De Niro (the two also co-starred together in the 2001 caper crime drama 'THE SCORE'). Milla Jovovich also co-stars in this psychological thriller and each of the three leads are outstanding. Angus MacLachlan wrote the screenplay (MacLachlan also wrote the wonderful and critically acclaimed 'JUNEBUG') and Maryse Alberti did some beautiful cinematography on the film (other credits on his resume include 'THE WRESTLER' and 'HAPPINESS'). The film as a whole is a little convoluted and unintelligible but the story is full of a lot of interesting ideas, the acting is powerful and the scenery is beautiful.\n\nDeNiro plays a parole officer set to retire in a few weeks named Jack Mabry. Norton plays a convicted arsonist named Gerald \"Stone\" Creeson and is one of Mabry's last cases. Knowing he has little chance of convincing Mabry that he's served his due time and deserves to be released Stone convinces his wife Lucetta (Jovovich) to seduce him. Stone also takes up reading a great deal about religion and appears to have a spiritual epiphany. Mabry's life quickly begins to spiral out of control as he gets more involved with the intelligently manipulative Lucetta and can't tell what's a con, what's the truth and what Stone or Luctta's true motives are. The film builds to a somewhat sudden and indecisive conclusion.\n\nThe movie is captivating and intriguing at first but it kind of loses it's way going into the third act and things drag on a little too much at a little too slow a place, especially for an inconclusive and somewhat anticlimactic conclusion. The film explores a lot of interesting ideas though about God, spirituality and the difference between right and wrong as well as judging others and what it is to take responsibility for your actions. Like I said the performances are all outstanding and really drive the film. De Niro plays a slightly different role than his usual, Javovich is surprisingly good in one of her best performances to date and Norton adds another classic performance to his diverse and astonishing resume. Despite it's flaws the movie has a lot going for it, which is the reason it's flaws are that much more glaring. It could have been a really great film!\n\nWatch our movie review show 'MOVIE TALK' at http://www.youtube.com/watch?v=Q4rYA-j3f3c"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "NickCageLover",
        "review_rating": "1",
        "review_title": "I could hardly watch this mess!!!!",
        "review_detailed_main": "This movie is NOT worth seeing. There is absolutely no plot. The movie is supposed to be an action/thriller but quickly turns into a boring slow paced train wreck about religious transformations. Edward Norton's character is intolerable. The dreads,the crying,the whining, the strange southern/thug accent, and the fake scratchy voice was insanely irritating!!!! Jovovich is awful in this movie. Her character is more annoying than Nortons. De Niro seems to have just showed up and read a script out loud. There are several sex scenes that are absolutely unnecessary in making the movie more entertaining or developing the characters and plot. DO NOT WASTE YOUR TIME ON THIS FILM!!!!!! There is nothing about this film that is worth seeing."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "10",
        "review_title": "Great Movie. Not much action.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "6",
        "review_title": "Was \"Brick\" taken?",
        "review_detailed_main": "Oh, I get where they got the title from. It's merely an inferior symbol of just how drab and boring this is. Stone is in jail and seems like he may be losing it, and then his wife starts trying to convince the prison psychologist to let him go. Well, they say that's what it is... personally, I think they just want to prove that even DeNiro *is* only human. It's Milla Jovovich, come on! She's incredibly hot as usual(she was why I watched this at all), and in a good portion of it. Anyway, in spite of being a mere 97 minutes sans credits, this drags along at a snail's pace. It seems like there might be a message, and it may be to just accept what happens to you, which is tantamount to religious propaganda(certainly when not tempered with \"if your situation is below any defensible standard, fight for your rights\"). Granted, the characters are fine, the acting is great and this is mostly filmed well. I don't know why that doesn't make this more tolerable, but that's how it works out. Dialog is OK, a lot of slang. There is a bit of disturbing content, nudity, sexuality and strong language in this. I recommend this to anyone else who has a crush on the Ukranian sensation. 6/10"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "akphidelt-1-702910",
        "review_rating": "1",
        "review_title": "This movie is so bad I signed up for IMDb",
        "review_detailed_main": "Alright, I never participate in these community message board things, but an event happened that made me have to share it with the world. I typically love all sorts of movies and am not a harsh critic. And I'm a huge fan of Norton and De Niro. But this movie was so God awful that I can not allow them to get away with it! It was horribly written, horribly acted (except for De Niro), and absolutely mind boggling boring. This isn't one of those pathetic movies that you can watch while drinking with your buddies, such as Jennifer's Body, and have a few laughs. This is like elevator music of movies!!! I will never in my life get back the 100 minutes I spent watching this movie! If you do not believe me, please watch it for yourself and share the pain I currently am feeling!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "wootg001",
        "review_rating": "1",
        "review_title": "wow just wow.. crap?",
        "review_detailed_main": "wow really probably the worst films ever. i love watching films.i think i enjoyed pushing the eject button more than i did in the whole time watching it. first 10 minutes i thought what the hell is this. then i thought well some movies just start crap and end good. i thought i must get better throughout the whole way , i was stupid enough to not read the review before doing so, was decision ever..this was just boring.not confusing just boring the whole way through.just no point making the film. i have watched some rubbish films however this must to be the worst. when the creater thought of this he must of been on his death bed"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "the_weirdo",
        "review_rating": "7",
        "review_title": "The Cold Stone",
        "review_detailed_main": "Well, when a trailer of a movie would have Robert De Niro and Edward Norton sitting across a table, background score of a thriller, naturally the expectations from the flick would be so high, that anything lesser than 'great' is going to doom disaster for it. And that is precisely what happened.\n\n'Stone' is not a bad movie even if not a great one. But the trailer promised a psychological thriller with an adultery angle, and when midway the movie took a de-tour along the philosophical path dealing with existential angst of a reformed prisoner, most of the audience felt betrayed. That is why there are some rave reviews about the movie. Not the best movie of Norton or De Niro.\n\nI liked it.\n\nAt one point two sequences were juxtaposed - a gruesome murder and an erotic act of adultery - diluting the intensity of both with each other - that is the best scene of the movie according to me. Good direction."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "nfwzkxwb",
        "review_rating": "1",
        "review_title": "A Horrific WASTE of Film",
        "review_detailed_main": "No wonder it got pulled from theaters before it grossed even half its budget. The basic premise is so implausibly ridiculous from the outset that it's unwatchable. DeNiro must have been desperate for cash to take part here. Someone please burn the master copy."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "karl_consiglio",
        "review_rating": "7",
        "review_title": "The Shaman",
        "review_detailed_main": "I thought it was a great come back for Norton. Stone is the Shaman of the entire prison, this ain't spoon fed in the film. Its just the sense I got. The radio is always on the Existence debate channel. There is a lot about passing judgment, forgiveness. Forgiveness of others as well as self. Its a very religious film, spiritual, meditative. Not just in the Catholic sense at all. It deals with conscience and guilt. DeNiro should never have slept with the guys wife. But don't expect an action film. Because he forgives him. I mean who can blame him, Jovovich is downright hot. A somewhat slow film. But it makes sense. Loved the stuff Stone was saying about the fire taking over."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "treeskier802",
        "review_rating": "5",
        "review_title": "Stone Not Nearly As Good As The Score",
        "review_detailed_main": "I absolutely loved The Score starring DiNero and Norton; the heist film set in Montreal where Norton was at his best as an actor. Norton is still a fine actor, but his film choices have been lacking over the past few years. I had never heard of Stone before, but because I saw Dinero and Norton in the lineup, I'd thought I'd give it a try. I wish I had passed.\n\nThere is nothing interesting whatsoever going on in Score. DiNero and Norton both act very well, but the script is pretty much rubbish. The only thing this film has going for it is that Milla Jovovich is completely sexy in it. If seeing her in this capacity turns you on and you want to waste 2 hours watching a lame movie just to see her do her stuff, then go for it. Otherwise, find something else to watch. Rating 5 of 10 stars."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "eryui",
        "review_rating": "6",
        "review_title": "So and so",
        "review_detailed_main": "If there wasn't an excellent cast this drama movie would be a completely waste to me. Indeed the only thing I enjoyed was the acting because the plot is really simple and its moral pretty obvious. We are all sinners despite having or not faith, and everyone have some skeleton in the closet, the prisoners so as the guards, the judged and the judges, and everyone is naturally, by our same nature, led to sin or in any case the desire of.\n\nThe only interesting part, i do repeat, is the good acting, and the part were the keeping older husband (De Niro) do realize his mistake, calls into question his same faith, and the loses chances (as his wife) to change, for the fear of break the pattern, trapped, the first by a false morality, the second by the fear of her husband.\n\nIn any case this movie is a really forgettable one.\n\n6/10 just for the acting that made it not so boring as might have been."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "ralfberserk",
        "review_rating": "5",
        "review_title": "I wouldn't watch this movie again.",
        "review_detailed_main": "My vote is divided here, because for actors performances i would give them a 10, DeNiro and Norton play their roles greatly and you couldn't expect less of such fine actors.\n\nThe plot of the movie... well.. i would hope the director put a legend at the end of the movie explaining what the hell was the whole thing. Because i didn't get it. The plot is very slow, predictable, and has no sense... if you liketo watch a 90 minute drama of some wasted life's go on... if you have better things to do with your time... go and watch something else. Definitely not the best movie for any of the involved actors."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jzappa",
        "review_rating": "10",
        "review_title": "That Rare Film That Gives You a Fresh, Different and Challenging Experience",
        "review_detailed_main": "Norton plays Gerald Creeson, incarcerated for his part in a fire connected to the slaying of his grandparents. De Niro is Jack Mabry, who behaves and works on the nose to keep himself from bleak basal personality trends. He's a dedicated Christian prison P.O. outrun by the decades of deceit he's heard from offenders, always swearing they're innocent, they're sorry, they've found God. He maintains the ever-weakening scaffold with an inexhaustible watercourse of fire-and-brimstone talk radio and a few whopping bourbons between dinner and bed.\n\nDe Niro's a veteran at playing characters who obsessively struggle to compensate for debilitating inadequacies. Here it's rage, which perchance brings about lust. Unflinching and talented director John Curran and shrewdly insightful writer Angus MacLachlan's spare, melancholy drama opens with a younger Mabry playing out a shocking scene with his young wife and baby. Years later, they're still married, in a forsaken bottleneck anchored in interpersonal obstruction. He does nothing \"immoral.\" It's his obligation to remain married. His wife Frances Conroy, whose understated performance stabs you in the heart, looks stooped against swipes that never come. But Mabry just keeps on unconsciously nursing whiskey and gaping at the TV, the wall, whatever.\n\nIt's time for his retirement. He could forward his case load on to his legatee, but no: He'll fulfill his responsibility to the final T. That involves managing a parole plea by Creeson, who's dreadfully clever, an emotional conspirator, whose wife Lucetta is such a woman that such a man might exploit and be exploited by. Creeson intuits that Mabry, the obliged square-shooter, might be susceptible to certain inducements. Lucetta is sharp enough to undertake, not an intrepid come-on, but a psychological enterprise in which Mabry more or less does the tempting himself.\n\nThis is a scenario which cannot be organized into a tidy prison thriller. It entails maneuverings as regards not just behavior, but the messily impalpable hidden drives behind it. Mabry spots in Creeson all the treacherous whims he fears in his own id. Mabry's fiction about himself is that he's a virtuous man, committed to responsibility. However, through that prologue, we know he's in systematic denial about his own devastating compulsions. Lucetta has a crucial part in unearthing and stage-managing a path through Mabry's resistances. How does Creeson feel about the prospect that she'll get carnal with Mabry? How does he feel about her sex life by and large? Is her lechery handy to him? If so is she aware? Stone could've been the standard genre sequence of technical detail, a clear-cut crime movie, but it's too intricate for that. It's truly keen on the psyches and inner lives of these characters, and how they greet a precarious state of affairs, a three-way personality study, as each participant plans, responds and develops through burden from the other two. Each personifies several contradictions, and the film keeps us speculating and paying close attention. De Niro is so uncannily realistic at playing a man who's effectively enfeebled himself owing to apprehension about his resentment, so that sexuality and rage may be harnessed in exactly the contrary way, as in some of his pinnacle characters.\n\nAs in all commanding dialogue-driven films, talk totals action, and it feels like it. The exhilaration here is incited by the vocal and physical mutualism between the uniformly riveting actors, and the dramatic characterization they're given by the sensitive camera and the drum-tight cutting. De Niro's performance is some of the most gripping work he's done in a decade, honest, emotionally alive, and a powerhouse refresher of his gift for devoting extraordinary amounts of preparation and research into a performance the nevertheless in effect feels uncannily moment-by-moment. In his agonizingly jaded domestic scenes with Conroy we see another breed of life sentence, two strangers chained together, lumbering the lingering ultimate lap. He inhabit's an unblinkingly realistic union of spiritual fatigue and shrouded malice.\n\nNorton's Creeson exudes misleading geniality in his early scenes. We watch him think as he psychologically tilts his way through the consultations right in front of us. Then he starts to internally transform, and it's not merely his corn-rowed hair that disentangles. But the pleasant surprise is that Milla Jovovich's unpredictably bizarre pussycat Lucetta's just as captivating. As with everything in this film, she's difficult to peg, and that gives the movie its admittedly uncommon intensity. She sometimes appears like a rag doll in her husband's ruse, and conversely an eerily blissful doxy entertained by her control over men.\n\nStone is a fresh, different and challenging experience as each divulges a benevolent side and a malicious one. Scene after scene is a tractor pull as the disparate clique strive for control and preservation instinct. The story dwells in instability, in uncertainties that proliferate without remedy. The technique of the film's sound design is one of the most striking elements of Stone. Secondary reverberations, for example the buzzing of a bee, are drawn upon to enhance the film's intimate probing of obscure, indefinable themes."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "mapienkowski",
        "review_rating": "",
        "review_title": "Great movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "brenttraft",
        "review_rating": "7",
        "review_title": "Pay Attention to the Buzz",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Urantia",
        "review_rating": "5",
        "review_title": "The Stone that Triggered Ripples of Chaos",
        "review_detailed_main": "Although one man's spiritual rejuvenation was the prominent thematic thread that attempted to hold everything together, this movie's plot still seemed to slowly unravel before my very eyes and ears until all I was left with at the end was the torn fabric of fragmented thoughts (accompanied by a vivid reminder that the natural charisma of talented actors can breathe Life into scripts that lack any flaming sparks of vitality other than those that can be simulated by pixel-manipulation techniques). Does that mean I didn't like this movie? No, I actually DID like it overall insomuch as it dealt with thought-provoking material in an entertaining way even though it left too much to the imagination for my tastes (too many missing details that remained undisclosed even after the final credits rolled making me wonder if a gag-order had been imposed on the answers to some of my questions after they were clicked into the forgotten oblivion of the editor's Trash Bin). I haven't encountered many movie references to reincarnation lately. This was one of the diverse beliefs creatively referenced more than once in this movie. But rather than preach that one belief is right and all others are wrong (the biggest problem with most modern-day religions that seek philosophical uniformity instead of spiritual unity), I did find it refreshing that various belief systems were dramatically conveyed without attaching any discriminating conclusions leaving audience members with the freedom to make up their own minds about what may or may not ring true (with or without the mystic chant of HU). As for myself, I just can't see God creating me in some past life as a fruitfly or a platypus or a pebble. But neither would I throw a pebble at a fruitfly who was frolicking festively on the face of a playful platypus if I was in the presence of someone who actually believed these might all be distant relatives of theirs."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "watcher2019",
        "review_rating": "2",
        "review_title": "dreadful",
        "review_detailed_main": "3 top names here for what? I have given it 2 stars only because of the names not the film. Corn rows for Edward. Really? Wouldnt that be classed as cultural misappropriation if it had been anyone else. It was totally unneccessary for this role. And what was wrong with his voice ? Was it breaking while he was on set? It was like nails on a blackboard it was so high. Squeak squeak. Milla was totally miscast. The scene at the prison where she was pouting and crying was laughable. I am sure the crew almost fell over her bottom lip. One of the worst films i have seen this year. Was there really a story in there? No. Dont waste your time. Total rubbish."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jseagles",
        "review_rating": "7",
        "review_title": "Very little action, a lot of existential questions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Leviathan696",
        "review_rating": "1",
        "review_title": "Snooze vile",
        "review_detailed_main": "If you're having trouble sleeping put this on.\n\nOMG ITS SOOOOOO SLOW. really wanted to enjoy this because of the names in it but I just couldn't bring myself to watch more than 15-20mins.\n\nCome on what were you thinking starting a movie as pants as this. Terrible."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "bcw-3",
        "review_rating": "7",
        "review_title": "Very Good Acting... if a bit depressing",
        "review_detailed_main": "Very good acting in this movie by Edward Norton, Robert De Niro, Milla Jovovich (who played Norton's seductive wife) and Frances Conroy (who played De Niro's wife, and was the funeral home mom in Six Feet Under). De Niro plays a parole officer, a man with no soul and no center. I thought it was a good character study, and the contrast between the final redemption of Norton's character and the growing stink of De Niro's was fascinating to watch as it unfolded. But I thought the incredible distance between where Norton started and where he wound up a bit of a stretch. In the end, it was a depressing movie, so don't watch it if you've had a bad day. If you do watch it though, you may find it's one of those movies that grow a bit after percolating."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "drklabs",
        "review_rating": "5",
        "review_title": "Piracy killed cinema...3 Movie Big Stars and a ...Bee !!! Deniro still great!",
        "review_detailed_main": "I think this is the characteristic answer of Hollywood to piracy , you copy movies we don't making movies anymore we just making money traps and we still got our money back.Three big names starring at this film but there's no film in my opinion if you want to know the truth .There's nothing absolutely nothing to see just the faces of the three big names constantly on the screen one after the other and here we go they got their money without music without script ,without story ,without direction without photography they selling just 3 big stars and you know something people will bite it since i bite it.I almost have forgotten to mention that on this parody co-starring a bee.I believe that Robert Deniro after the Taxi Driver or the Deerhunter cant act anymore on other movies , this happens to a lot of great actors that a great success on a famous film of them is gonna be a symbol of their life career and is gonna ruin their life in the good way.Many actors happened to be victims of successfulness they acted so well that they even started to think they are the hero of the movie in their real life they were affected so much , the truth is that after scripts and films like Taxi Driver and the Deerhunter or The Godfather everything else is like bullshit to me .God can tell me a lier but i see that when acting in modern films he is trying to act suddenly for clips of the eye as he acted in the famous movie ,at this film watch him when he is in the car driving and you ll see for a moment that he tries to act as in the taxi driver but suddenly he changes his movement and his face becomes sad .In every detail of his face you ll see the scars of those famous past movies as the taxi driver and the deer-hunter .Basically some actors become so famous with some films that it is good not to act anymore same happened i think to Al Pacino.The thing is that people loved them so much that will pay even with crappy movies like this to see them as a tribute to their fame but i think Hollywood can make a try and give us something better those actors worth it. Applauses for Mr Robert Deniro please a really Big Star ,he is the movie ,dont ask for more this face really worths a lot of applause's. A real actor destroyed by the commercialism of cinema and the pirates. 10/10 for Mr Robert Deniro as the Taxi Driver , everything else on this film is bullshit for me...even the tit-ties of Jovovitch 5/10"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "joshwapp",
        "review_rating": "7",
        "review_title": "A film that makes you think.",
        "review_detailed_main": "Not your run of the mill suspense thriller. More of a psychological drama, really. It's a good movie in the sense that it makes you think afterwards about universal themes of morality and what role of religion is, could be, or it's shortfalls.\n\nNo big complaints, just that it tends to drag a little here and there, since it seems to lead us down one path but... I don't know; maybe that's a good thing?"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "headly66",
        "review_rating": "3",
        "review_title": "Huh?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "moux",
        "review_rating": "10",
        "review_title": "Excellent acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "fernandoschiavi",
        "review_rating": "6",
        "review_title": "Despite the rythm and pretensious plot, \"Stone\" is ambitious, full of symbolism and has an open ending, making it stimulating discussion",
        "review_detailed_main": "In his previous work with Edward Norton, director John Curran delivered a sensitive and beautiful romance called \"The Painted Veil\". Repeating the partnership with the actor, Curran presents to the public this \"Stone\", a film that intends to be a parable about the right we have to judge others, but ends up being swallowed up by its own pretensions. The reunion of Robert De Niro and Edward Norton, two extraordinary actors and exponents of their respective generations, is a treat for any movie buff. \"Stone\" lives up to the caliber of these actors by developing an ambitious story that, although it fails occasionally, uses spirituality to draw a parallel between different men and criticize the monopoly of religion that believes it has the right to be the only and exclusive link of Man with God.\n\nThe main character is Jack (Robert De Niro), a prison officer whose job is to evaluate the behavior of prisoners and recommend them or not for parole. The public is already led to feel disgusted by the protagonist due to the fact that the film shows him, in his first scene, committing one of the worst acts of blackmail that I can conceive. Years later, Jack and his wife Madelyn (Frances Conroy) live a miserable life, punctuated by boredom and quiet desperation. Jack, austere and religious, seems to just live, and the testimony he makes at the funeral of his brother \"who lived a good life\" sounds more like regret for the life he let slip away. Gerald, in turn, appears on the scene for the first time with braids, a loudmouth and a foul mouth. His spiritual epiphany and the agent's downfall will emanate from his interaction with Jack.\n\nThe film's synopsis may suggest a banal thriller, but Curran and Angus MacLachlan's script invest in the characters, their fears, their fears and their concerns. Opposing a man seeking parole (Edward Norton) and the agent responsible for analyzing it (Robert De Niro), Curran exposes two men tormented by the past and an existential void. On the menu for the day are discussions such as religion, ethics, faith and the intersection between these aspects. The female characters in the film (played with commitment by Mila Jovovich and Frances Conroy) are valuable mirrors of the ghosts that torment these men. In this sense, and in the crystallization of Curran's comment that emerges at the end of the film, the female characters are important catalysts for the direction these men's lives take.\n\nJack is perhaps the most detestable character in Robert De Niro's career. Over the decades, we have seen the veteran actor embody complex figures with more than dubious morals, such as psychopaths, thieves, murderers... But Jack is an extremely petty and selfish man, who hides all of this behind a facade of religiosity, something which is extremely commonplace, which makes it, paradoxically, even more frightening. Without a doubt, this is Robert De Niro's best work as an actor since his appearance in \"The Good Shepherd\". Instead of investing in the palpable characteristics of the characters, the script by Angus MacLachlan (who wrote the efficient \"Family Portraits\") gets lost in bar psychology and religious rhetoric that simply doesn't go anywhere, portrayed in long and slow sequences throughout filmmaker John Curran, with the director simply failing to give any rhythm to the plot.\n\nIt is the cast that manages to make the film stand up. MacLachlan's pretentious text combined with Curran's uninspired direction simply prevents us from delving deeper into that world and those characters. There are some strong moments, such as the murder in prison, but there is no cohesion between them, something that keeps the viewer in the chair between the tense dialogues between those characters. The dramatic impact is in the exchanges of glances and, mainly, in the soundtrack, which goes from hums that are just there to set the mood to something much more important to the plot. What may be brilliant to some people will be seen by others as presumptuous. And the film is like that. By not providing answers to all the questions, it leaves room for viewers to create their own outcomes. In many cases it is commendable. But the way the story develops, creating enormous suspense in Stone's epiphany and Jack's depression, it can leave the audience feeling like something is missing. And at least this time it wasn't a good performance from De Niro.\n\nThe script also proves to be more pretentious than efficient, resulting in a film that leaves the viewer feeling cheated all the time, even if their preference is not for a film in the police or action genre. Because Edward Norton composes a prisoner who resembles Robert De Niro himself in Cape Fear (second version) in his attitude, and there are a series of anticipations of more violent scenes and the clash between De Niro and Norton's characters, but which rarely come together. Realizes. It is not a problem in itself that a film surprises by a reversal of expectations, preferring a philosophical, theological and/or psychological discussion about the good and evil that dwells in human hearts: the problem is how this is developed. The slow pace (or lack of pace) anticipates an explosion that falls short of what can be expected and the essential performance of the excellent actors presents inconsistencies typical of the characters in a more verbal than physical duel and how they are worked on by the script and direction. . The traditional game of showing one and the other on the field and against the field could be an interesting option in the way it is done: Norton speaks to the camera as if he were \"eye to eye\" with the viewer. But there are so many conversations and long dialogues that using this type of framing becomes tiring and loses its strength. In his first scenes Norton falls into a certain degree of overacting, although he does very well when the character crosses the barrier into a psychotic break relatively unnoticed by the others.\n\nBut in many moments, we have a good construction of the narrative by director John Curran. In the first scene, we follow the frustrated attempt of a bee to escape through the pores of a window screen. Used as symbolism to present a young Madylyn, suffocated and trapped in married life with Jack, the fate of the poor bee is not only depressing but also a portrait of the life the woman lived alongside her husband. This element will become recurrent in the formidable and unsettling soundtrack, which invests in sharp and uncomfortable sounds (the buzzing of a bee, the noise of a lamp bulb turning on). The director also adopts a deliberately contemplative pace, although Geraldo's presence on the scene never ceases to be truly threatening. This even logical choice by the director requires commitment and patience from the viewer for the events that will unfold in the third act. Added to this is the (correct) choice by director of photography Maryse Alberti to use frames that emphasize the close-up looks that reflect the isolation of each character. Featuring brilliant elements, the story presents the religious advice that Jack hears on the radio, but does not absorb it, and the analogy to blind religious fanatics, who with their Bibles under their arms and the Word of God on the tip of their tongue, end up not reaching the peace that other marginalized people in the church find in themselves.\n\nBut the film seems to intend to leave doubts and questions open to the public, including whether Stone was faking in some of his strategies to deceive 'Jack' and obtain parole. And then, there is no doubt about the errors in the script and direction, because when Stone \"freaks out\", even the desire to get out of prison seems to take a back seat within him; but as the actor, even in scenes involving his character alone, appears to be so delusional, any subsequent relativization of his state remains as an error of minimum likelihood: either before, in the outbreak, or later (when it is more likely to be pointed out the flaw in the dramaturgy and/or the character's psychopathology).\n\nAs already mentioned, the quartet of actors deliver competent performances. Although the film belongs to De Niro, Edward Norton is also not far behind his colleague, creating a complete persona in Stone. The mannerisms and diction created by the actor for the prisoner, which change over time, perfectly match the character, in a superb characterization work carried out by the actor. Interpretations of such caliber, in fact, are already routine for Norton. Milla Jovovich appears seductive and enigmatic as ever, and her work here is surprising, considering her already known limitations as an actress. After years of living solely as action heroines, it is incredible to see the beautiful Ukrainian taking risks in a figure as complicated as Lucetta who, thanks to the actress, has an air reminiscent of old femme fatales. Frances Conroy, on the other hand, has the most complicated task of the endeavor, managing to express all of her character's despair even with very few dialogues. In mere moments, Madelyn's gaze reveals to us a woman on the edge of a precipice, something that is not only moving for the audience but also helps us realize how harmful Jack is to that poor person.\n\nCurran flirts with cinema noir in several sequences, in the few moments in which the film takes a step further towards the viewer, especially in the scenes involving Jack and Lucetta. Without the public's immersion in that universe, we only have talented actors on stage playing characters that we barely recognize as human beings. A greater investment in the question asked by Stone to Jack (\"who are you to judge me?\") would perhaps bring more humanity to the film. \"Stone\" is ambitious, full of symbolism and has an open ending, making it stimulating discussion. The flaws arise from the desire to aim too high, but they help to create a faithful portrait of imperfect human beings played by exceptional actors."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "michaellimb",
        "review_rating": "1",
        "review_title": "Stone - that's what you'll turn to",
        "review_detailed_main": "I hear this film is now shown at the Dignitas Clinic in Switzerland to remove any final remains of the will to live from its visitors.\n\nAT first you might think, ah, here goes Bob again with his Dwight character from This Boy's Life with a bit of Awakenings thrown in. In fact if all the dialogue in this film had been conveyed via an Ouija board it would have been more interesting. Sadly, it seems that action flick Ronin was the last watchable performance De Niro had in him back in 1998, and Stone makes Analyse This/That and Meet The Fockers seem like career highlights of the last 10 years.\n\nSo after the film imitates paint drying for an eternity of 10 minutes or so, Ed Norton comes on to get your hopes up that we may be going somewhere. But no. Watching Ed, the eponymous Stone, is like being cornered by a man on a train who has just read Zen And The Art Of Motorcycle Maintenance and wants to tell you all about it. Many years on, we're still waiting for the kind of performance promised by Fight Club and even Rounders.\n\nSo maybe sex can save the day? Welcome Stone's wife Milla Jovovich who brings to this film the kind of acting integrity that marks her out in the Resident Evil franchise. After appearing in Wim Wenders woeful Million Dollar Hotel you would have thought she could sniff out another bomb but apparently not.\n\nThe only person perfectly cast here is De Niro's broken whisky-and-bible clutching wife Frances Conroy who was at least familiar with such deathly material from her days on Six Feet Under.\n\nIt is agonising to have to knock down a film that someone obviously thought was a brilliant mind play, and then complain that the cinemas are full of blue wall action for the kids. But Stone is not art-house niche, so clever and intriguing that the peasants don't get it. It's just depressing and boring and pointless.\n\nThe public voted with their feet, returning less than a third of the production cost, and for once they were absolutely right."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Movie_Viking",
        "review_rating": "1",
        "review_title": "God awful mess with no meaning at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "neil-upto11",
        "review_rating": "6",
        "review_title": "Intentionally slow-paced. Quite interesting subtext",
        "review_detailed_main": "The cast is great: good actors doing a good job.\n\nThe film is often enjoyably tense but I wouldn't describe it as a thriller. I don't want to sound too pretentious but the film is very much an existentialist discussion centred on the value of man, aspirations and despair along with related themes.\n\nI was very pleased that the radio-based, evangelist drivel was woven into Stone's own, self-serving ramblings - demonstrating that the sea of so-called spiritualism and organised religion is all one, great morass of ignorance, superstition and manipulation. At least, that was my understanding of the script.\n\nA moving film with some thoughtful ideas."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Matt_Layden",
        "review_rating": "4",
        "review_title": "Stone is Slow & Boring",
        "review_detailed_main": "A convicted arsonist looks to con a parole officer into getting him out early, with the help of his sexy wife.\n\nThe premise of this film is pretty lame if you ask me, but it seemed to draw some talent so I gave it a chance. The talent this film got must have been because of the dollar signs because Stone is a boring, tepid film that goes nowhere and entertains no one. The film tries to be more important and self righteous than it actually is and this is where it falls flat.\n\nDeNiro hasn't been in a good film in years, to me his last decent one was with his co-star of this one, ironically. The Score, even then he seemed on auto-pilot. Here he shows no signs of caring for the material as he goes through the motions of spewing out the dialogue and hitting his marks. Edward Norton, upon first glance, makes you giggle. His character has cornrows and speaks like a thuggish kid. Norton somewhat pulls it off and he has the more interesting role of the two. His character goes through some kind of epiphany, or doesn't. It's not really clear, neither is how the con actually worked or why.\n\nThe con was to get his wife, Milla Jovovich to 'convince' DeNiro in helping him get out early. After one chat with him he becomes a horn dog and sleeps with her. The con was lame and uninteresting, nor does it explain how it works. My interest level faded fast with this one. The story was as dull as the characters. Even the subplot involving DeNiro and his unhappy wife was a bore. I wanted the film to end sooner than it did.\n\nMost of the film is simply the two characters talking. So Stone is a character driven piece and not some kind of thriller as the trailer would have you believe. Character driven movies have to be careful, because in order for you to want to finish the movie you need to have some sort of emotional investment in these guys. Stone gives you no reason to care or to even finish the film.\n\nEveryone involved, even Jovovich, can do better. The writing here is below par and the performances, while decent, do nothing to draw you in. The film is confused as to what genre it wants to be in. Stone leaves loose ends everywhere and the final act seems out of place. It ends on a weird absurd note that finally manages to ignite some kind of emotional response from the viewer....it's anger."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "mammaldan",
        "review_rating": "7",
        "review_title": "Makes you question Morality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Meven_Stoffat",
        "review_rating": "3",
        "review_title": "If only Nathan Fillion had starred",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "anitalansing-40-581915",
        "review_rating": "7",
        "review_title": "Manipulation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "zidane_mohmad_1991",
        "review_rating": "3",
        "review_title": "One of the worst film for Robert De Niro",
        "review_detailed_main": "The plot is weak, i just was waiting to finish the film, I think one of the worst film for De Niro, I am so disappointed, the only thing that I like in the film is Milla performance."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "lbolton78",
        "review_rating": "8",
        "review_title": "This is a good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "FrankNSteinSinatra",
        "review_rating": "7",
        "review_title": "The majority of us are small",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "David_Brown",
        "review_rating": "1",
        "review_title": "A Waste Of Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "nedpredgrupa",
        "review_rating": "2",
        "review_title": "Waste of time...",
        "review_detailed_main": "...well, this movie was waste of my time and waste of Edward Nortons talent. Categorized as \"drama\" and \"thriller\"? I would add new category for it : \"boring as can be\". Nothing happening, full of religious nonsense, you just hope for it to end. It's almost never that I force myself to turn off the movie before it ends but I have barely endured this one. Total, but really total waste of time. I have no idea who makes a movie like this, or even worse - who enjoys it? Robert De Niro is making some bad movies lately, right? I mean, OK, you can act depressed and guy with inner conflict but come on. What has become of once such a great actor? The only reason I am giving it 2 stars is Edward Nortons performance...and yeah - Millas appearance :),I'm just weak for her :)"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "lorriebeauchamp",
        "review_rating": "6",
        "review_title": "Powerful acting - puzzling plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jplvvhisnixjbsxcxk",
        "review_rating": "3",
        "review_title": "Good Actors or Bad Script",
        "review_detailed_main": "These are two of my favorite actors in a terrible movie and it starts with Ed Norton with the cornrows and miss representing black culture. I hope these actors got paid on the front because anyone who paid to see this got screwed on the back end."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "yvettea3605",
        "review_rating": "7",
        "review_title": "A Window",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "thebogofeternalstench",
        "review_rating": "3",
        "review_title": "I felt tranquilized",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "btzarevski",
        "review_rating": "6",
        "review_title": "*sigh* Disappointing",
        "review_detailed_main": "I like many here hadn't heard about this movie until I saw it in my video store, and when I saw Norton & de Niro I thought \"this looks intriguing\". And it was; a con (Norton) is trying to get his parole officer (de Niro) to put in a good word with the Parole Board and get Norton an early release but without making any headway himself, he gets his sexy wife (Jovovich) to try and seduce de Niro to...'help' him make his mind up.\n\nThe movie starts off really promisingly; we get shown a flashback of a young de Niro go to extreme lengths to convince his wife not to leave him and the movie takes on a suspenseful, interesting tone as we get introduced to Ed Norton and his ploy and...that's where it sort of ends.\n\nThe acting is fantastic; Edward Norton is magnificent as usual and Robert de Niro was equally convincing, Mila Jovovich had some irritating scenes but on the whole she did a good job too. So my beef isn't with the acting.\n\nIt's with the script. Like I said, it starts of well; good verbal banter between de Niro and Norton, suspenseful music all had me expecting the thriller this movie allegedly is. And yet as we get to the halfway point, the movie is suddenly pottering along slowly and then even threw religion into the whole mix. Then there's more suspense to tease us into expecting a thriller and then the ending comes and it's just...bleh.\n\nThe movie simply didn't know what it wanted to be and at the end of it it the only thing it accomplished was being a mess. The movie is dialogue heavy and I don't mind that but as long as it went somewhere but in Stone it just never did. None of the intriguing plot points we get shown in the opening 30min are ever explored further, other bits of plot are picked up and left unfinished and at the end of the day the biggest mystery is how a fantastic cast and promising synopsis can be so badly wasted. It's a shame; I love Norton & de Niro and while they deliver, the movie doesn't."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "styxrox69",
        "review_rating": "3",
        "review_title": "Boring",
        "review_detailed_main": "This movie was almost as boring as watching water boil. If you didn't know the plot from the get go, you are in need of a brain. If you enjoy hearing people stutter and stammer out dialog, you will like this movie. Seriously, listen to the actors. It was quite pathetic, and very boring. I am one who enjoys character development, to see a story grow. This movie was a good excuse to see nudity, infidelity, a lot of profanity and not much else. The ONLY reason I watched this movie was to see one of my friends in it, and he didn't appear until the end of the movie. Sadly, he didn't get enough screen time to make the show remotely interesting, or redeeming. Save your money and go rent Good Will Hunting."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "gmgregmao",
        "review_rating": "8",
        "review_title": "Was put off by the IMDB score of 5.3 but this is brilliant",
        "review_detailed_main": "Human frailty. DeNiro fell for the sexy woman and it cost him his job, his marriage, his house. How fast life can just fall apart with poor judgement. There is a warning in this story. It's a common story which repeats everywhere for eternity. DeNiro took the low hanging fruit and paid the price. Sad what happened and an interesting ending which caused me to think about that for some hours. Hence my score of 8"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "merylmatt",
        "review_rating": "7",
        "review_title": "Character Movie, surprise ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "barbted1",
        "review_rating": "2",
        "review_title": "Left me Stone-Cold!",
        "review_detailed_main": "Is it really acting to see Edward Norton playing the same obnoxious jerk he always seems to play? I see other reviewers who consider him their favorite--I guess this really just speaks to, HOW DIFFERENT, opinions can be. Honestly, I didn't get past Norton and DeNiro's first scene together. I dislike \"that guy\" as represented by Norton, that much. I just have no interest in spending any time more with him. So for those who get what I mean, and share that opinion about Mr. Norton, save your time...for those who disagree....good luck."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "meydanbenm",
        "review_rating": "2",
        "review_title": "Couldn't make it past 1/2 film",
        "review_detailed_main": "Maybe it has a good ending, I don't know, because I value my time too much to cut my losses after some time.\n\nHalf a movie past, nothing, literally, nothing happens.\n\nThe texts are dumbed down to a child's level with boring content.\n\nHorrible movie, but 2 starts because Edward Norton does a funny accent."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Shantalecinematicexpresso",
        "review_rating": "7",
        "review_title": "It was actually good",
        "review_detailed_main": "I mean, didn't expect anything at all. But it was : a psychological film who beats up a character that is alcoholic and religious, and that was a good certain combination.\n\nSo sad that there was no a good last point.\n\nUnderrated film"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "malagant11",
        "review_rating": "4",
        "review_title": "lost it somewhere at the end !",
        "review_detailed_main": "they started off pretty well but lost it somewhere around the end\n\ni think we've seen some really good acting by Edward Norton and Robert Deniro but that all what we've seen, i wish i could say the same about Milla but i just think she cannot act at all !! i think someone Latino would have shined more in such role,\n\nanyhow the director takes you slowly to the peak and surprise you right there, but i couldn't help it feeling that this is a TV movie and dose not present it self cinematic\n\non the other hand the End did not make any sense for me! i was expecting that Deniro will be exposed naked before everyone and will live in shame for the rest if his life after retirement or something like that... anyhow as i mentioned earlier i think we've expected much more from this movie,\n\nalso i would like to highlight the fact that the production was just lame, and if it wasn't for Norton & Deniro the movie would have been a total bust.\n\nMuhannad Kalaji"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "MediaMuseum",
        "review_rating": "7",
        "review_title": "Deniro, Norton & Jovovovich - Gotta see it.",
        "review_detailed_main": "Not sure I could resist a movie with Ed Norton, Robert Deniro and Milla Jovovovich - no matter what I had heard. I can say that they didn't disappoint me. I had mixed feelings going into this movie - I hadn't really heard good or bad about it - but then again, there was never any hype so something must have happened. For a film that takes place in a prison - I have to say they did a GREAT job of putting a new face on a well worn film cliché. The scenes that take place in the prison are unique and different enough to make me pay attention. While Ed Norton plays a character you've seen him play before (violent lower socio-economic criminal) - it's a character he plays well. Deniro surprised me - I didn't think he had anything left in him. But his character ends up seeming real and well rounded. And I have to say - I think Mill actually acted in this film. I was disappointed with the final few scenes - the end seemed awkward and clumsy. While the entire film focuses on the relationships of the main characters - the ending just doesn't give us anything. Maybe that's their way of not giving in to the typical Hollywood ending. Overall, I would say it's a movie to put on your list. But don't watch it on a date - it's a bit of a downer."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "agnieszkaszypula",
        "review_rating": "2",
        "review_title": "I didn't get it",
        "review_detailed_main": "Maybe I am not spiritual enough, not clever enough or maybe I just thought all De Niro mov8ies are good.....not sure what was the reason but this is by far the worst film I have seen recently, shame. I gave it 2 only because of good acting .... Nothing else to say- bad, long, boring and kid of not finished movie. I will definitely not recommend that one :("
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rickgmurphy",
        "review_rating": "7",
        "review_title": "IT'S A PHYCO MINDBINDER!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "reymond810",
        "review_rating": "5",
        "review_title": "Not sure what to make of it !!",
        "review_detailed_main": "First of all I must add that I was impressed by the casting of Edward Norton. I think this is the kind of role that fits him best. It is a role which merges the characteristics of the characters he has played in the films 'American History X', 'Down In The Valley' and 'Primal Fear' and in my opinion it is another strong performance from him.\n\nThe overall story was not as much a thriller as I may have preferred and did not carry the sense of excitement or any spark. The story was begging for a twist which never came. It was rather monotonous and lacked genuine sense of direction.\n\nBut, the situations of the characters was well drawn out and their genuine sense of helplessness was well encapsulated by back stories. The film has a very dull feel to it and seems to lack some energy and seemed to rely too much on incoherent background speech snippets to fill the voids left by the lack of dialogs.\n\nFor a story about a convict trying to get out this was a disappointment and I thought it could have been told much better."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rdoubleoc",
        "review_rating": "9",
        "review_title": "Great acting.",
        "review_detailed_main": "You can't show me better acting than this, besides for maybe Charlize Theron in Monster, and a few other people.\n\nNobody got anything on Ed Norton, still."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "riotnuts",
        "review_rating": "7",
        "review_title": "Edward Norton, Milla Jovovich, Robert De Niro -all at their Prime- what' s not to like..",
        "review_detailed_main": "I Know , i know- it has low review score- almost unwatchable , right ?so . which one of the 3- Edward Norton, Milla Jovovich, Robert De Niro -acted badly- none in my option. Just that...its has no thrilling actions nor any digital special effect, the story is not extraordinary ,so the new I-phone generation would Never have the patience to withstand 1hour and 45 minutes of true documentary; in the sense that if it happen to you; you would end up the same way..The is more of a Thriller psychological Type 90's popular flake type- like Silent of the Lamb without the Violence(oh- Milla J went naked !!)"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jdkraus",
        "review_rating": "5",
        "review_title": "\"Stone\" is one of the movies where you find yourself looking at your watch more than your TV screen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "tomtpcarpe",
        "review_rating": "4",
        "review_title": "Mumbling, Whining Waste of Time",
        "review_detailed_main": "I have to wonder if DeNiro and Norton were forced into these roles at gunpoint. There isn't a single likable character in this film. The dialog is forced and sometimes incomprehensible. The story begins well, but starts to fall apart as soon as it moves out of the past. As it crumbles under its own weight, the characters become as interesting as stickmen. What a waste of time."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "hall895",
        "review_rating": "4",
        "review_title": "Great actors largely wasted",
        "review_detailed_main": "Robert De Niro and Edward Norton have long since established that they are great actors. Unfortunately Stone is a movie which pretty much completely wastes their talents. The plot does not engage, moves too slowly and quickly becomes repetitive. This is a movie which gets stuck in a rut that not even the greatest of actors can pull it out of.\n\nDe Niro plays Jack, a prison officer who is soon to retire who evaluates prisoners who are up for parole, recommending whether they should be released. Norton plays Stone, a prisoner who will test Jack, tempt him, make him question things about himself. Used as the object of temptation is Stone's wife, Lucetta, who is given a mission to seduce Jack so that he may look upon Stone's case more favorably. Jack's moments with Lucetta add a little something different to a movie which otherwise is just De Niro and Norton sitting on opposite sides of a desk jabbering away at one another. Lots of talk, very little action in this movie.\n\nStone is the convict but Jack clearly has some serious inner demons. There is an anger boiling inside him. If he ever had any faith he seems to have lost it. Stone meanwhile finds some new spirituality. Or maybe that's just a ploy to make him seem a better candidate for release. Jack's wife is deeply religious. Stone's wife most certainly is not. Spirituality hangs over the whole picture. The film appears to be trying to tell us something important. But it never gets the message across. Ultimately it all fizzles out with an ending which is not much of an ending at all, this is a movie with no real resolution to it. It is a movie which never comes together properly. With De Niro and Norton on board, playing off one another throughout, there was great potential. But that potential is wasted. Great actors let down by a lousy script. De Niro seems a little bored at times. Can't blame him really. But by and large he and Norton, as well as Milla Jovovich who plays Lucetta, make the most they can out of the material. The performances are fine. But the material is just not good enough."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "DJ-Ren",
        "review_rating": "2",
        "review_title": "Pointless and boring",
        "review_detailed_main": "Maybe I \"missed the point\" or \"didn't analyze the character's actions enough\" or didn't go out and discuss the movie with friends over cherry pie. I don't know. Here's what I do know - I was looking forward to this film BIG TIME! I'm a fan of the 3 main actors; and considering what Edward Norton pulled off in American History X (the scene where Norton surrenders to the police, and he's all buffed out/shaved head/goatee... and then does that grin/eyebrow lift... scarier than anything \"Hannibal Lecter\" ever did!), I was more than eager to see him in another prison movie. But a movie about emotions and redemption and whatnot... some movies pull this off beautifully. I just saw an indie flick called \"I Melt With You\", and I recommend it for any male out there. A synopsis would sound dumb, but any guy who is reaching 40 and realizes his life isn't what he thought it would be when he was 20 will be able to relate to all 4 main characters. But \"Stone\"... none of what the characters did seemed at all realistic, and their \"personality changes\" seem based on nothing at all. Like I said in my title, the movie was incredibly boring, and when it was over, all I could think of was, \"What was the point of that??\""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "InakiArias",
        "review_rating": "4",
        "review_title": "A big farce.",
        "review_detailed_main": "This is the typical movie you watch by chance in TV. There are two great actors (not in their best times) and an interesting actress (Jovovich)and you give it a chance.\n\nAfter the introduction the spectator at least thinks that he's going to watch an indie, alternative film full of deepness and complexity.\n\nOK, there is none of them. The plot tries to be complex and you spent the whole time waiting for something that doesn't appear. We don't have to mix a strange, non-clear message with a complex one. About the deepness or the finality of the story, the same. A bit of new age, a bit of cheap psychology, a mixture of religious and ethics content, you mix everything and you get a cocktail from which we get this ridiculous movie.\n\nI'm sure that there is someone who will defend this movie because of the characters's ambiguity and something like that, but don't be fooled, the characters personality, actually is very bad written.\n\nFollowing with the acting, the overall isn't as bad as other points of the movie but it isn't remarkable. De Niro is such a genius that even doing the minimum effort he success in being enigmatic but, on the other hand, he's very far from him best moment. However, after having such a great career it's forgivable for a near to 70 years old man to be just the shadow of what he was. It's worse if the situation is the same, but being only 40 and doing the same performance again, again and again... but worse than ever. Very bad for you Norton, I think if you keep on like this, you're finished. Milla Jovovich, on the other hand makes a unexpectedly solid interpretation, congrats for her.\n\nIf you want to watch a solid psychological thriller, this isn't your movie. This is a bad experiment and a big loss of time."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "matvej-kazin",
        "review_rating": "10",
        "review_title": "Question of existence",
        "review_detailed_main": "Hard to review such a movie but I will try. This movie did to me what nothing else does in our society anymore and that is bringing up the question of our existence, right or wrong, God etc. And the best part is it is not trying to answer those questions but is revealing the lack of understanding of what life is in life. What seemed to look like another mediocre movie about prison and cons, come up as a great surprise of a movie. And in the end it is hard to rate it because you go through one hour and fifty something minutes with the same questions in your mind as the characters and it is just way to hard.\n\nThis movie was good."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "spinsterdish7",
        "review_rating": "2",
        "review_title": "Slow and boring no real plot",
        "review_detailed_main": "Movies got to either be entertainment or needs to be deliver a message this does neither"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "winstonaugusta",
        "review_rating": "2",
        "review_title": "A slow drone",
        "review_detailed_main": "Was difficult to stay interested. Just droned on and on. Norton came across more as an actor than believable. Maybe it was the writing or story. Not a memorable movie"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "billio_g",
        "review_rating": "4",
        "review_title": "So and So",
        "review_detailed_main": "Great Casting.(Couldn't expect something more from Norton, De Niro or Jovovich.)The point of this movie is that everyone makes mistakes, others admit them & others don't. So, according to that they're trying to say how to reach God through some weird kind of religious beliefs. Can somoene tell me, why every time someone wants to sell something; like an idea or religious beliefs, they make a movie with no point in our lives with great casting?? Do you people think I'm buying it because you paid Jovovich, De Niro and Norton?? No I'm not. I'm giving a 4 out of 10. 1 for the Crew, 2 for not having gaps in between with great movie flow, 3 for the budget and 4 for the music background \"mood creation\"."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "jbisme880",
        "review_rating": "4",
        "review_title": "Norton the corn rowed street rat",
        "review_detailed_main": "Norton is a foul mouthed criminal who looks like street trash. He is married to a hot crazy lady. They have a plan to get him out of jail. Poor story and unbelievable."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "asahiggs",
        "review_rating": "4",
        "review_title": "Very Poor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "LiamBlackburn",
        "review_rating": "10",
        "review_title": "You can't see forever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "donahueinvt",
        "review_rating": "2",
        "review_title": "Almost two hours I will never get back",
        "review_detailed_main": "I gave this movie two stars because I felt like the acting was OK.\n\nThe story is everywhere and is never developed into anything. If IMDb did not require ten lines that would be all that I would need to say.\n\nThe storyline is promising but the movie follows no sort of line. The best description is that it is all over the place with no focus on back story or follow through on promising stories.\n\nI found myself checking the time multiple times and just wanting it to be over. When it was finally over ( with an absurdly lackluster ending)I was shocked at the amount of loose ends that were left. If you choose to watch this movie, drink heavily and forget that you have wasted a large chuck of your night."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "JoeB131",
        "review_rating": "3",
        "review_title": "Mila Whatshername is movie poison",
        "review_detailed_main": "I think that this woman is only allowed to make movies so directors can see her naked. It's the only rational explanation I can find.\n\nOnce again, she manages to mangle a script and drag good actors down with her, no less than Edward Norton and Robert DiNiro.\n\nThe plot is that Norton is an arsonist trying to get out on parole, while DiNiro is a parole officer with a screwed up life and a lot of hypocrisy, and they put Mila in there to seduce him and who cares? The setup drags on for so long you don't care about the conclusion. A sign of a turkey- I had to keep stopping it because it bored me and then going back to it. A movie with ROBERT DINIRO. Even in bad movies, the guy can hold my interest, but not here."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "digital_mixtape",
        "review_rating": "1",
        "review_title": "Waste of time. *Spoiler*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "carlos-pires",
        "review_rating": "4",
        "review_title": "Worth a watch for the cast, and for the urge to view \"Anatomy of a murder\" once more",
        "review_detailed_main": "I guess the title for this review says it all. I don't know if this is an homage to \"Anatomy of a murder\"... or a rip off. Anyway, it's mildly entertaining and this cast can't fail. Go ahead and watch it. Then go watch that gold nugget, the original."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "spookyrat1",
        "review_rating": "4",
        "review_title": "A Huge Movie Non - Event!",
        "review_detailed_main": "Now I know why I'd never heard of this film starring Robert De Niro and Edward Norton no less, in what what was entirely erroneously promoted as some sort of crime thriller. It was of course because it sank like the proverbial stone at the box office, getting very much what it deserved.\n\nStone is one of those cinematic examples which demonstrates that it doesn't matter how good the acting is (it is extremely serviceable), how good the production standards are (again, extremely sound), if the story and direction aren't up to scratch, its commercial and critical prospects are simply dead in the water.\n\nIt's a sort of three and a half (Frances Conroy playing Madylyn, the arguably most intriguing character, gets far less screen time, than the other three) hander, which just completely loses its thematic way, in an unhappy mixture of unlikeable characters, unlikely events and dead-ended storytelling, all saturated with a continuous cacophony of annoying religious radio commentary.\n\nEpisodes occur which don't seem to have a great deal of relevance to the central narrative (what that actually is, itself could be debated). There's a graphic murder witnessed in a prison ... with zero repercussions or follow - up. What are viewers supposed to infer from that? Robert De Niro's parole officer Jack, appears to be very disinterested in religion, compared to wife Madylyn, yet listens to religious commentary all the time. Why? The film never appears interested in examining, these questions. Neither does it offer any reasons why Jack and Madylyn have remained in an entirely loveless marriage for such a long time (Certainly well past the time their daughter grew up). Both Norton's titular character Stone and Milla Jovovich's Lucetta, Stone's wife, also seem to undergo inexplicable behaviour transitions and changes during the film that just mystify, rather than engage us in the story. The film drags on to a third act, couldn't care less type of ambiguous semi - twist, and then just stops.\n\nStone just seems like it was a story way beyond the reach of director John Curran. For awhile, he appears to create an expectation of some explosive revelations or dramatic happenings, none of which ever occur. So then he appears happy to let things peter out to a thoroughly unsubstantial conclusion. His failure to establish a strong narrative foundation condemns Stone to the unbridled commercial and critical failures it suffered. A thoroughly wasted opportunity!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "carlosemcampos",
        "review_rating": "8",
        "review_title": "It's a movie for a \"thinking mind\"",
        "review_detailed_main": "First of all the trailer is indeed misleading, it isn't a thriller or a fast-paced movie but it is a very good movie.\n\nIn my opinion this is a movie for a \"thinking mind\", it may look superficial but if you look to it closely and try to read between the lines there's a lot more to it.\n\nGreat acting job of Robert DeNiro and Edward Norton in a very envolving story. I almost gave up of the movie after I saw the 5,7 here in the voting poll but I decided to give it a try and I'm very glad I did, I believe it grows on you after you see it. It is a very \"real\" movie with very \"real\" issues and subjects.\n\nIf you like to see movies just to see action and rushing camera angles go somewhere else, but if you like to go beyond of what's in the surface make yourself a favor and watch it."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Cinemaniac1984",
        "review_rating": "4",
        "review_title": "A dour and disappointing Thriller/Drama.",
        "review_detailed_main": "Robert De Niro and Edward Norton were a great pairing in the underrated thriller The Score (2001) and seeing these two reunite for Stone had me interested. Ultimately the film was a total disappointment and I wanted to continue to persist with this however I found myself wondering why did I continue to do so. It just seems like the glory days for Robert De Niro and Edward Norton are well and truly behind them.\n\nRobert De Niro is parole officer Jack Mabry who is heading towards retirement and is aiming to finish the cases he's been assigned, one of them being the case of convicted arsonist Gerald \"Stone\" Creeson, played by Edward Norton who is up for parole. Jack ignores Stone's pleas for an early release from prison and in order for Stone to get out, he arranges for his wife Lucetta played by Milla Jovovich seduce Jack and try to convince him to release Stone from prison. From there, the mind games start.\n\nI just couldn't feel like I was engaged and interested with this movie. I just felt that it was too slow and disjointed.\n\nRobert De Niro's glory days seemed to have ended with The Score (2001) being his last decent movie. Since then, a lot of his movies have been met with little success. Perhaps he should look for better roles or even smaller roles. His role as Jack Mabry seemed like it could have been played by an actor 20 years younger than him.\n\nEdward Norton is another quality actor who has been better. He made a huge impact with his first role in Primal Fear (1996) which netted him critical acclaim as well as a Golden Globe award and an Academy Award nomination. Other movies such as American History X (1998), Fight Club (1999), and 25th Hour (2002) without a doubt are his best movies to date. I couldn't help but constantly expect that his role in Stone was going to be similar to his role in Primal Fear.\n\nMilla Jovovich as Stone's wife Lucetta was nothing special and I had the \"I've seen it before\" feeling when seeing her in this movie.\n\nStone was a dour Thriller/Drama and as much as I wanted to see the movie unfold, I couldn't get into it.\n\nUnless nothing else is on, give this a miss.\n\n4/10."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "drjgardner",
        "review_rating": "2",
        "review_title": "Waste of talent",
        "review_detailed_main": "This film has some really good actors whose talents are wasted on a dull and predictable plot."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "flemur13013",
        "review_rating": "1",
        "review_title": "We quit watching after about 20 minutes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "adamj432",
        "review_rating": "5",
        "review_title": "De Niro shines in a otherwise disappointing & disjointed movie",
        "review_detailed_main": "Stone is nothing more than a bog standard,run of the mill film which has been done time & time again really once you've seen one film like this you've seen them all. The only saving grace for this film is Robert De Niro who out-acts every other person in this film,his talents are truly wasted with this script. Along side De Niro is Edward Norton an actor that to me has always been a poor & very overrated actor but in Stone he is surely at his worst where he plays an predictable character which has been seen in films for years,he plays a prisoner who is so unconvincing its painful. I'm not sure if it is Norton's poor acting or the abysmal script that makes the character Stone just so unbearable. The directing is another low point of this film, the directer John Curran is trying to be smart & clever with his directing of Stone but ultimately ends up with a disjointed mess where at times some of the scenes are just totally out of place. Lastly the religious meaning to the film & the attempts to be profound are so terribly forced its unreal.\n\nI give this film 5/10 which is very kind as the film itself is only worth a 3 but I've given it an extra 2 stars simply for De Niro's performance which simply carries this terrible film"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "policy134",
        "review_rating": "4",
        "review_title": "Somewhat good idea squashed by poor execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rb-66",
        "review_rating": "10",
        "review_title": "Ignore the stupid reviews this film is fantastic",
        "review_detailed_main": "The problem with IMDb's reviews is that if a film attracts the wrong audience it gets unfairly panned. This film is a perfect example. Most of the reviewers must be people who like Transformers and The Fast and the Furious and so because this film doesn't have an explosion or car chase at least every three minutes it gets described as 'slow' or 'pretentious'.\n\nThis is an excellent film. Great writing and direction and superb performances from the whole cast, not just De Niro and Norton, Milla Jovovich and Frances Conroy are fantastic as well. It reminds me the films De Niro made years ago like Jackknife and the Deerhunter, no heavy handed direction or clumsy over-writing. A fascinating exploration of faith, guilt, desire and tragedy that poses more questions than it answers.\n\nAction blockbusters have their place, but if that's all you like this film is not for you. But if you like intelligent understated films definitely check it out."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "arsith",
        "review_rating": "4",
        "review_title": "Disappointing....",
        "review_detailed_main": "Well, when i read the star cast of this movie, people like Robert De Niro, Edward Norton, Milla Jovovich, i expected it to be a better movie but its not.\n\nThe story is about a parole office , a con and his wife. The story is very slow,it just did not pick up pace. Honestly I kept waiting for some kind of twist in the story but was disappointed. The climax is very week.\n\nThe performance of Robert and Norton is phenomenal but the movie lacked a good story to back it up.\n\nMy verdict: Not good enough."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "JSplend954",
        "review_rating": "5",
        "review_title": "On The Fence On This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "mmmiiiaaauuu",
        "review_rating": "2",
        "review_title": "save your time",
        "review_detailed_main": "The first 10 minutes are the best part of the film, then it´s just pointless, weak story, you could skip 20minutes and still not miss anything important."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "allanmichael30",
        "review_rating": "5",
        "review_title": "Annoying voice",
        "review_detailed_main": "Edward Nortons voice is just annoying but the film is o.k, the film could have been better."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "c_j_williams",
        "review_rating": "2",
        "review_title": "Flip...FLOP",
        "review_detailed_main": "This movie was a complete disappointment and nothing that I would expect from Robert De Niro. I feel as though I wasted most of my time watching it in hopes that it would go somewhere but it never did. Let me save you some time by suggesting that you find something else to watch."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "omfgitsrohit",
        "review_rating": "9",
        "review_title": "Some people tell lies. Others live them.",
        "review_detailed_main": "Jack Mabry while appearing to live the life of a 'good' human being is confronted with thoughts that aren't supposed to occur to such a person. He's been married for over forty years, has never broken the law and works as a parole officer trying to reform people. But what does that do to him? There isn't a soul he trusts; he's carved that way. Prison inmates are trying to keep up with him by creating an impression and get him to believe that they've turned over a new leaf. With all the experience he's had, he sees through all of it. Not for long.\n\nGerald Creeson better known as 'stone' is under the supervision of Jack. Empty and pointless is what he believes his life is as long as he's in prison. There's desperation to break free. He believes he deserves it. Attempting to needle the vulnerable side of Mabry by sending his sexy wife, Lucetta, to meet with him, he hopes to be released. How long could that last?\n\nLucetta is no femme fatale, as the trailer would have you believe. A buoyant, effusive, middle-aged nymphomaniac is what she is. Stone tells Jack that she's an 'alien'.\n\nMadlyn, Jack's wife is like stone. Jack has threatened her before and the memory of the experience doesn't fade away. She's stuck in a loveless marriage and doesn't have the nerve to raise the issue about her 'soul being kept in a dungeon'.\n\nThere're some interesting issues raised by the film, and without being answered or taken a stand for or against, are put in front of us through the characters. Does sin come naturally to human beings? Does being physically imprisoned mean no freedom? Are we all hypocrites after all? Is it foolish to sought after the righteous path? Is there a definite righteous path? Is there a higher power watching over us and our actions?\n\nJack is the lead character and it's his perspective that is the focal point of the film, which is why we don't know what's happening. Like him, we don't know whether to trust the characters or not because clearly they all have their own motives. The narrative doesn't intend to spoon-feed its viewers. You have to see the film again through the eyes of each character, pay attention to their reactions and understand their motives with which you determine whether they have done what Jack believes they did, or not. This is no ordinary thriller. It's heavy. It's complex. It's an in depth character study. John Curran's real deal is in displaying these characters, how they feel. What's going on inside their heads.\n\nActing is first rate. Robert Deniro, a name that echoes unforgettable characters- Jake Lamotta, Travis Bicke, Jimmy Conway, Vito Corleone and a lesser known Rupert Pupkin, has shown that even at this age he's capable of doing much more than what he's been doing for the past ten years- frowning, cursing, head tilting and spastic nodding. Edward Norton, who has proved time and again that he's not merely an actor with expressions but a character artist, delivers a gritty performance. This one's nothing like his other characters. People have complained about this role being similar to Primal fear and American History X particularly because all three of them are prisoners but that's just being myopic. That's like saying Robert Deniro is not versatile because he's played only gangsters and tough guys, or even more abstract- in almost every movie of his, he's malicious. It's not what viewers choose to reduce those complex characters to, with a word or two. It's the way the characters are played. Vito Corleone and Jimmy Conway are both Italian Mafiosos but are their characters similar? Not at all. In spite of all the praise I've given these two actors, it is Milla Jovovich who steals the film. Her performance is something that I'd characterize as a combination of Karen Black in Five easy pieces and Uma Thurman in Pulp fiction. She's the soul of the film. Frances Conroy is spot on with the character. She doesn't have much screen time but when she's on screen, you see her dying within and losing hope, shred by shred.\n\nThe director, John Curran and the screenwriter, Angus Maclachlan have made an original film that works only because the actors understand its subtleties. The other elements although unable to atomize themselves on independent merit are all appropriate. The sound design is at a strangely different frequency focusing more on background noises, the score is haunting and the cinematography, I have to point out, would've really enriched the feel of the film had it been shot in black and white with low key lighting- in the realm of film noir. What's left at the end is an incomplete puzzle of a film that you're expected to finish. Stone doesn't go easy on you. It is a film of major distinction that made me feel privileged as a film viewer. For my intelligence was not just respected, but trusted.\n\nRating-9/10"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "5",
        "review_title": "slow paced, somewhat interesting, but the ending ruined it",
        "review_detailed_main": "This movie was OK till the final 10 minutes. I don't like it when a movie ends with no explanation and just leaves the viewer to guess what happened. Did Jack's wife Madlyln have anything to do with what happened or did the ex-con do something? But why would he do something when Jack recommended his release? And why do we see the ex-con, Stone, just walking down a street?\n\nBut back to the beginning, the performances were pretty good. Robert De Niro, plays Jack, someone whom goes over parole cases and gives his recommendation. He is close to retirement and likes to drink a lot as does his wife Madlyln, whom is very religious. One of his last cases is Stone, played by Ed Norton, whom does a great accent as someone with little education and past drug use. Stone gets his hot wife, Lucetta, to make contact with Jack and play mind games. She acts like she's really interested in Jack, so he starts meeting her and it leads to more. So, the question is does Stone get out of prison? The movie was pretty good leading up to this, but as I mentioned before it just goes off grid for the final 10 minutes.\n\nFINAL VERDICT: Worth seeing because most of the movie is good."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "garnermcculloch",
        "review_rating": "5",
        "review_title": "Good actors, good set up, no payoff",
        "review_detailed_main": "I don't need movies to wrap up everything in a nice little package, but this one leaves a lot unanswered, and not in a good way. It just seemed like all the characters instead of coming together for the final act, just slowly drifted away from the central theme and then it ended. I swear the last look taht was given before the scene goes black is exactly the look I gave my wife when the credits started to roll."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "KineticSeoul",
        "review_rating": "5",
        "review_title": "Didn't gain much at all from this flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Jerique",
        "review_rating": "5",
        "review_title": "Underwhelming...Limited.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "aaronfbrown",
        "review_rating": "1",
        "review_title": "Embarrassed for Deniro and Norton",
        "review_detailed_main": "The movie has an intriguing plot and great cast...but it is Edward Norton's acting is so bad, they should have casted someone else for his role, and saved him the embaressement. Deniro does some subpar acting too..very unorganized plot and too many themes going on in this movie."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Epicurean080",
        "review_rating": "9",
        "review_title": "A excellent psychological thriller.",
        "review_detailed_main": "It's really a shame that most people can't appreciate the depth and intelligence of this film. The actors, and mostly De Niro and Norton, gives a fantastic performance. Many reviews before speak about the story but I think that the substance of the film is the interaction among the 2 male characters. Maybe the story could go feather deep in the psych of the characters, and this is my only complain and possibly weak point of it, but the epic acting makes for it. And for the people that are frustrated because they cant see the movie as a clear thriller or drama, maybe they have to open their mind and look beyond the lines of the conformity with the conventional patterns."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "dennis-18-36076",
        "review_rating": "5",
        "review_title": "Good recipe . . . Under cooked!",
        "review_detailed_main": "As a fan of DeNiro and Norton, the film automatically caught my attention and created a very high level of expectation. However, I was left disappointed. I had concerns with several undeveloped parts of the film. Jack's selfish nature, and failure to concern himself with his wife's feelings, which was a constant through out the film, one that was touched upon but never fully addressed. The film's poor attempt to dramatize the age old issue of good vs. evil leaves me thinking what insight did that explanation (Jack's temptation) bring to the situation? . . . NONE! The gospel radio shows playing in the background, during Jack's ride back and forth to work, failed to give me anymore information than the average Bible thumper would, but did provide a little insight as to what the intended purpose of the \"Good\" Christian should be. The psychological struggle between DeNiro, Norton and Jovovich was interesting, but very predictable (didn't think DeNiro's character would fall for it but did), no one is safe from their demons. Somewhere along the line, I believe Norton became less interested in the deception and Jack ended up getting his feelings involved. However, that just proves another point of the good vs. evil issue, it's hard to hide from yourself. Finally, the film was anticlimactic, there's this incredible build up and then nothing! Overall, it was a good recipe of actors and possibly subject matter, it was just terribly undercooked!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "bob-rutzel-1",
        "review_rating": "4",
        "review_title": "I am waiting for Part 2",
        "review_detailed_main": "Prisoner Gerald \"Stone\" Creeson (Norton) wants Parole Officer Jack Mabry (DiNero) to give him a good recommendation to get out of jail on parole and has his wife Lucretta (Jovovich) put the moves on Jack to help that effort along.\n\nThis must have been in 2-parts and I only saw Part 1. The ending needed resolution or something and we didn't get it. The story was fine up to the end, but we were left with tooooo many questions. Make up our own ending? Been there. Done that. Doesn't work.\n\nNorton used a voice reminiscent of Walter Brennan (google him) and sounded every bit like him. Kind of comical coming from a 40-something guy. But, I did enjoy that.\n\nNot enjoyed were the sex scenes with Lucretta and whoever that was somewhere in the beginning and with Jack later on. We didn't need to see all of that. We get the idea. Hey, the 1980s are over.\n\nThe acting by all was great, really great. Nice to see that DiNero is going back to drama as comedy wasn't working for him, in my opinion. Yes, I know I am in the minority. But, he had some funny lines in this drama and funnier than in any of the comedies he was in. Check it out.\n\nAnd, many parts of the story seemed disjointed but when you looked at everything you saw, you understood it all. Now we just need to see Part 2 to get the resolution to really understand it all and have everything come together. Still waiting. Where is Paul Haggis (directed CRASH) when you need him? Sigh!\n\nViolence: Yes. Sex: Yes. Nudity: Yes. Language: Yes."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "papon-40681",
        "review_rating": "8",
        "review_title": "good enough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "arthurmarquezusa",
        "review_rating": "8",
        "review_title": "I loved this film, even with it's challenging flaws.",
        "review_detailed_main": "Somehow this was poorly edited, and lacked better connections between (earlier life events) and relationships between characters.\n\nThe real victim, Stone, has a sincere personal epiphany of life, and as important as this is (for everyone living), is diminished in its importance. This, in contrast to Mabry, who has a lifelong aversion to introspection.\n\nThis is a powerful film, sadly flawed in presentation.\n\nMy rating (8) is for addressing the overall topic, one all too common in the world."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "george.schmidt",
        "review_rating": "9",
        "review_title": "Sterling DeNiro/riveting Norton & a ripely seductive Jovovich = compelling psychodrama.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "kellyrned",
        "review_rating": "8",
        "review_title": "Manipulatively Intense Acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "classicsoncall",
        "review_rating": "8",
        "review_title": "\"Well, happy day.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "gradyharp",
        "review_rating": "8",
        "review_title": "Seduction in Multiple Forms",
        "review_detailed_main": "STONE is a complex film, perhaps too complex to create the impact that the story seems to be taking as writer Angus MacLaughlin and Director John Curran seduce us into this study of manipulation, age versus youth, religion versus atheism versus spirituality, and crime in all its permutations. That is a big load of topics for one film to handle but thanks to a quartet of fine actors the film works.\n\nJack Mabry (Robert De Niro) is an aging parole officer at a prison who is finishing his career and preparing for retirement: being the seasoned lawman he is he requests to finish his current case load instead of passing it off to his replacement. Because of his success in his field he is asked to review the case of an arsonist called Stone (Edward Norton) who is up for early release. Stone is a foul-mouthed, sassy, wily fellow who sees no importance to Jack except as a possible path to being released from prison. The two men parlay and create boundaries that make the process seem unlikely - until Stone brings his amoral, promiscuous wife Lucetta (Milla Jonovich) into the plan. Jack has always been a monogamous husband to his evangelically oriented wife Madylyn (Frances Conroy - the film opens with a shocking scene from the early years of their marriage that sets the atmosphere for their strained family life - making the likelihood of Stone and Lucetta's plan seem unlikely.\n\nJack is certain that he will do a good job as a parole reviewer for Stone, but when Stone introduces the wiles of Lucetta much changes in the personality and philosophy of Jack. And while this transformation into a pawn for a deceitful plan is working Stone appears to have a spiritual experience in jail - a confusing element for everyone in the film and in the audience. How Jack is manipulated by Stone and Lucetta and the aftermath of Jack's input to the review board supplies the grit for the ending of the film with unexpected twists for all four characters.\n\nEdward Norton, complete with tattoos and corn rolled hair, gives us a character we cannot ignore or forget at movie's end. He is astonishingly fine. De Niro, Conroy and Jonovich are equally convincing in these complex and well-drawn roles. This is a film that is at once cerebral and powerful. The manner in which director Curran uses a near constant stream of radio evangelism as the background for this film is ingenious: the payoff is excellent.\n\nGrady Harp"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "blanbrn",
        "review_rating": "8",
        "review_title": "Good cat and mouse film with spotlighted themes of temptation and facing one's morals.",
        "review_detailed_main": "As always Robert De Niro one of the best actors around again gives another watchable stand up performance and in this independent picture he gives a very moving and conflicted performance. After watching \"Stone\" you will classify this as a mind tempting drama a moral cat and mouse game of decisions and asking what is right and what is wrong. This film was crafted perfect and the acting is super.\n\nAs many know life is complex and temptation is always present mostly in the form of moral issues and lust and this film proves that. Many also know just how common it is that in the prison system that many of the deals are dirty and under the table. De Niro(in an underrated performance)is Jack Mabry a tough and by the book parole officer with the Michigan Department of Corrections, and even though Jack a religious man he appears to fight a battle with life and it's morals as he's somewhat a conflicted man, and those faith issues are put more to the test when his life becomes crossed up with an inmate and his wife in a mind game of cat and mouse.\n\nAs just weeks away from retirement Jack is to review the case of \"Stone\" Creeson(Edward Norton)a convicted arsonist who's now ready for release, and Stone plays his best to convince Jack that he's ready to go back into society. Only this involves an odd and clever con game of influence towards Jack's decision. This involves Stone's wife Lucetta(a very blunt and erotic and exotic performance by Milla Jovovich)and this very direct and outspoken lady has a plan of lustful seduction for Jack as this has effects on all three as it touches their lives emotionally and spiritually. Along the way it proves how lust and temptation can scar an already conflicted soul like Mabry's, and in the meantime the corruption ties together two men one a lawbreaker the other a lawman.\n\n\"Stone\" is a film that proves one must walk a straight path in life because it's full of temptation and lust with passion can be one's biggest weakness which leads to corruption and feeling guilt. This film was also a great duel of the mind it certainly was a well crafted drama that showcased just how relevant the theme of temptation can be in changing one's life and moral stance."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rickyvee",
        "review_rating": "10",
        "review_title": "WAYyyy Underrated and Misunderstood. It's a movie 100% about religion!",
        "review_detailed_main": "This is a RELIGIOUS movie! Not a drama. Not a crime thriller. It's all about religion. It's like Crash but not about emotions and feelings. All about religion. I am so so sad that so many people missed what this movie is about. (to a large degree I fault marketing, reviewers, studio, for a wrong pitch, an attempt to broaden the market) Each character represents a religion: >Materialism/Atheism. >Mainstream Christianity. >Non-Traditional Non-Denominational Non-Western Reincarnational Personal Revelation. >And finally - a man in confusion. The Lost Hero, The Lost Man. The Agonized Agnostic. The four main characters and the director and the writer all get it. Even the name of the movie/character is straight religion. This movie is not genre-confused. It's not about aging, adultery, crime, punishment, or even morality. It's not about right and wrong. It's about reality belief systems and their structuring into religion. The storyline is just a vehicle for an in-depth display of variation in belief systems and how they affect the way we live our daily lives. This movie Needed these real pro actors to pull off this stunt, and they did. I loved it. We watch Norton go through a classic Heroic transformation. Even the ending was perfect, it's the second DeNiro starts to hear his sound. (Conroy re-hears her's) Jovovich as The Goddess Maya, all flesh, is part of, and at one with the material creation so hears no sound. She IS the Earth. I never had so much fun in my Comparative Religion course! I hope it gets its cult over time. It deserves it!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "blumdeluxe",
        "review_rating": "8",
        "review_title": "Not tremendous but it has its moments",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "RJBurke1942",
        "review_rating": "9",
        "review_title": "Where we learn, once again, that wherever the truth lies - lies the truth.",
        "review_detailed_main": "The Storyline, above, provides sufficient information to set the whole scenario for you. My comments will concentrate on the three essential characters - a ménage à trois, so to speak - who form the substance of this story. Here is Jack (De Nero), a parole officer nearing voluntary retirement; here is Stone (Norton), a convict nearing the end of his enforced retirement; and over there is Lucetta (Jovovich) nearing the end of her patience - waiting seven years for Stone's release from prison.\n\nAt fade-in, we find out two crucial facts in two minutes or less: young Jack is prepared to commit the very worst kind of atrocity to keep his marriage, and his wife, Madylyn (Conroy) is an abused young woman wanting out of a dead marriage (see the first lines in Quotes, above).\n\nForty years later, Jack is still an icy-calm control freak who's been listening to convicts' sob stories for too, too long; so much so, his face is set as though in stone. Jack never truly smiles; he probably doesn't know how. Sitting opposite Jack - literally and figuratively - we met Stone who wants - needs, so he says - parole because he has finally seen the light, the error of his ways. A stark contrast to Jack, Stone is too talkative, too inquiring, too hip, too jovial at times, too much in-your-face for Jack to take. The explicit script and perfect deliveries by both players are simply scintillating.\n\nThe give and take between the two persists and enters a new and dangerous dimension when Lucetta sets about seducing Jack to grant the parole Stone needs and wants - in between her own sexual forays with other men. Faithful - to anybody - she is definitely not. What's more: Stone knows that and even warns Jack that \"she's an alien\".\n\nThe slow-paced build-up of tension will annoy those who expect Psycho-like action and mystery. This is not schlock psychology; this is the plain truth about some people's real lives in anybody's town. About a disturbed, depressed and repressed Jack, all alone but married all his life, with a daughter and grandchild he never sees any more, as he struggles to rationalize all of his past sins - particularly during his eulogy at his brother's funeral - but psychologically incapable of facing his own dreadful, awful reality. Until it's too late. It's a tour de force of acting guaranteed to make many viewers squirm in their seats. Little wonder this movie bombed at box office.\n\nAs a contrast, we see the young Stone gradually turning to malleable clay as he discovers and truly faces his own devils and decides to break with his past completely - the alien within as much as without viz. the shapely, sinuous and seductive Lucetta (and a great piece of acting by Vovovich). Throughout this story, the deliciously ironic snatches of day-time religious shows and interviews overlay the dichotomy of each of Jack's and Stone's search for ... redemption within themselves, if not with their god. One of them eventually succeeds....\n\nJust how all that is shown I'll leave you - urge you - to see for yourself. The denouement between Jack and his wife is gut wrenching - and liberating. That between Jack and Stone - erstwhile master and slave - is precisely, exactly right.\n\nThe rest of the cast is uniformly fitting and effective. The direction and editing are exemplary. Nine out of ten for this effort."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "etvltd",
        "review_rating": "8",
        "review_title": "myETVmedia says 'Stone' is powerful",
        "review_detailed_main": "John Curran hits the mark with his new film \"Stone\". In his new drama thriller \"Stone\", Curran takes us on a gripping spiritual journey through the lives of Jack (Robert De Niro) , Gerald (Edward Norton) and the two character's wives Madylyn (Fransis Conroy) , and Lucetta (Milla Jovovich). DeNiro and Norton literally explode on the screen, a parade of their craft, releasing the tension of an un-nerving introduction to the film; the two actors comedically butt horns which provides relief to the grim subject matter. So much so at the premiere viewing the audience burst into applause. A delicate balance is sought by the Director and Writer both thematically and stylistically. Four distinct styles of seeing illuminate the lives of our players. Stagnant, washed out imagery surrounds Madylyn. Pale greens and extreme soft focus paint the world where we find her dogmatically reading bible passages and killing time smoking cigarettes. A second, portrays Jack as he creates his own harsh, rigid experience. Repetitive, measured landscapes and the strong imagery of soldiers and guns is telling of Jack's boring bureaucratic life. A third, and an early glimpse at the transcendent nature of the film can only be described as breathtaking. Surprisingly, we are shown Gerald's prison world, surreal, an unlikely source of redemption, literally floating in the clouds.."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "amanda_chapin",
        "review_rating": "10",
        "review_title": "This Film Rocked Me Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "StudleyDave",
        "review_rating": "9",
        "review_title": "Brilliant",
        "review_detailed_main": "Sly, smart and ragged, this is a tale of insidious desires and deeds nibbling away at a person, until the acts start stripping them of their dignity, core beliefs - and ultimately, their life\n\nPerfectly cast, the trio are constantly engaging in corps-à-corps - one against the other; two-on-one, with poisonous effects on the quietly hopeful (yet forever tortured and tormented) fourth character - Jack's wife\n\nIt's a cleverly written, and well acted Drama. Really glad I watched it!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "dhaufrect-1",
        "review_rating": "9",
        "review_title": "A film that is riddled with great acting is \"Stone\"",
        "review_detailed_main": "\"Stone\" or Gerald 'Stone' Creeson presents a display of outstanding acting by Ed Norton. He plays a convicted criminal who commits a crime against his own grandparents. De Niro as Jack Mabry is the parole officer who is in charge of Stone's case and there is a pseudo-religious or spiritual background to the entire cinema. John Curran has directed some of the best performances out on DVD, and it can be seen on instant streaming on NetFlix as well. Lucetta Creeson played especially well by Milla Jovovich is enticing to the point of being rapacious as her character slowly involves the De Niro part in a twisting and turning plot that holds one to the very end of the film. Frances Conroy is convincing as the wife, Madylyn Mabry of De Niro's character, and one can empathize with her neglect that stems from an early incident. This is a film that is to be seen and savored with discussion. It is an intellectual challenge as well as a piece of cinematic entertainment."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "imseeg",
        "review_rating": "8",
        "review_title": "Gets better every time I see it. But beware, it's a detailed and painful portrait about the human mental pitfalls, brilliantly acted and directed, but many wont like it...",
        "review_detailed_main": "Seen this movie many times now and it is one of those movies that gets better every time I watch it, because I know how the story goes and I can enjoy the acting and the direction, which both are rather good, to put it mildly.\n\nAny bad? BUT, yes there is a warning, because for those who expect an exciting thriller or (lol) action movie, then you are betting on the wrong horse, this movie is ALL about mental PAIN, spiritual PAIN and sexual PAIN. And Robert de Niro is suffering from it, although to the outside world he looks like a conservative, god loving American parole officer. Many didnt like such a bleak story about spiritual doubts and mental disturbances, hence the low Imdb rating. I love to see a dark and bleak picture now and then, especially when it is done with such a great craftsmanship.\n\nThe good: for those art house movie fans, who love to see a bleak, but very true to life character portrait about sexual and spiritual pain, this is your pick. It is like a kick in my gut, but it has got excellent acting performances, terrific claustrophobic soundtrack guiding an even more claustrophobic story about addiction, mental pain and spiritual doubt. Bleak and disturbing, yet very impressive!"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "grahamschat",
        "review_rating": "8",
        "review_title": "You got to get this film really",
        "review_detailed_main": "(IMDB virgin here so please be kind :)\n\nSo the front cover really is the best indicator I think, \"Some people tell lies, some live them\".\n\nCan't really fault DeNiro, or Jovovich, both very good performances, but to me the star here is Norton.\n\nHe really took me on a bit of a strange journey.\n\nThis film is not about a Hollywood heist or cops and robbers anything like that, so this maybe be where the expectation is a bit off.\n\nThis is more a psychological thing.\n\nI agree the ending is a bit flat really, could do with a bit more of a conclusion to the journey for me.\n\nSo I thought the film was slow and the ending wasn't great but I really ended up feeling Jack's depression, Stone's epiphany and Lucetta's discomfort.\n\nTo me that's not a waste at all, after all art is about invoking emotion, so it hit the spot OK.\n\nI gave it an 8 since all the actors really drew me into their characters"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "rustyfingers007",
        "review_rating": "9",
        "review_title": "Be what do you want to be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Fa-Rehse",
        "review_rating": "9",
        "review_title": "Very impressive movie",
        "review_detailed_main": "Given the overall mediocre ratings, here on IMDb and in general, I'm really asking myself if people's attention span is too short for movies like these.\n\nIt's basically a 100 minute portrait of spiritual transformation, dysfunctional coping, self-indulgence and lifetime-lies. People tend to say \"it has no plot\", while in fact it features profound personal developments, surfacing of inner conflicts, repressed dreams and fears.\n\nIt's very un-black-and-white and gives you plenty of things to think about; It's only superficially discussing religion, but at its heart a movie about how you see things determines choices you make or choices that are made for you.\n\nIn Germany the movie got R-rated for a good reason (and it's not Milla jovovich's breasts, 9 songs got an R-rating here too); If you actually immerse yourself into the states of self-indulgence and self- righteousness the main characters provide, it can really be disturbing.\n\nIf you expect an easy thriller, you'll probably be disappointed."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "edwbur",
        "review_rating": "8",
        "review_title": "had a lot of suspense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "doug_park2001",
        "review_rating": "8",
        "review_title": "A Thriller that Goes Beyond",
        "review_detailed_main": "\"Stone\" drags a bit in places, could be called vague, could be called anti-climactic, but it leaves a strong impression and, unlike many films of its type, is not instantly forgettable once the credits start rolling.\n\nSuperb acting by all really helps carry it: Norton is a charismatically convincing con; Jovovich is one of the most realistically conniving vamps I've ever witnessed; Frances Conroy, as Mabry's long-suffering wife, is perhaps the strongest performer of them all in playing a character who is so painful that she tends to get ignored. De Niro gives the usual strong performance in playing Mabry, a character who continues to surprise with the way he straddles the line in his struggle between decent man and utter scumbag. Mabry also very effectively shows the dilemmas that parole officers face every day.\n\nThe suspense here is more psychological than eventful. Being more of a character film than a plot film, \"Stone\" may leave many wanting more dramatic stuff to happen even though there are a few good twists and surprises here. Still, it compensates with some very interesting usage of symbolism, parallels, and foreshadowings, and consistently touches on spiritual and metaphysical questions without seeming too preachy or dogmatic.\n\nI'm glad I saw this."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "8",
        "review_title": "Great overlooked film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "micheljjbraal",
        "review_rating": "9",
        "review_title": "true beauty shines trough",
        "review_detailed_main": "Looking at a movie is a very personal thing, the way you see it depends on the baggage you have, your own point of view.\n\nThats why we all see different things in movies. Some may hit a nerve others may not. This one did.\n\nBeautiful performances by all the 4 main karakters. Milla is lovely as always, at her best in a rol with a bit of a nutty twist. Robert again shows his masterful pain. Edward is edward, his eyes say it all. The wife of robert, man you can feel her agony.\n\nAnd then the wonderful lightness and love for life that shines through, you got to know where to look to see it. One to watch"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "MarieGabrielle",
        "review_rating": "9",
        "review_title": "examine the idea of innocence, and guilt...",
        "review_detailed_main": "DeNiro is excellent as Jack Mabry, a parole officer in charge of dealing with Edward Norton as a convicted arsonist who thinks setting fire to buildings is \"awesome\" and has a rather skanky girlfriend,well portrayed by Milla Jovovich here.\n\nFrances Conroy is Jack's washed out wife, they have been married over forty years, Jack still watches pro golf on television and attends church. On occasion he goes to the local pastor for question, but does not get the answers he is looking for. He loses his brother early in the story, causing him to re-examine his purpose in life.\n\nThere are some good undercurrents here about guilt and innocence as well as redemption. In the beginning of the film we see Jack with his young wife who threatens to leave him, so he holds their child out the window threatening to drop her if the wife leaves. Therein we see a glimpse of Jack's character that is not wholly revealed in the film's narrative.\n\nJack is missing passion and stimulation. He is losing his faith. In a way, his allegiance to the prison system reflects that, without working in this very structured environment he would indeed lose his moral compass completely and perhaps \"go the other way\" to the other side of the law.\n\nThe gray area of \"no one is ever completely infallible or innocent\" is a nuanced theme here. Watch the film more than once, it is a good story of character, and what makes people tick, which isn't always an easy answer. DeNiro is very good in this performance. 9/10."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "arinkleff-725-861016",
        "review_rating": "10",
        "review_title": "An ethical film",
        "review_detailed_main": "Stone is ultimately a film about ethics, and the lack thereof. In discussing his role, Norton noted that the ultimate goal of art is to portray reality, and therefore this film portrays a reality of poverty and corruption.\n\nEvery major character in this film proves themselves to be a felon, and whilst they wallow in the mire of their moral failings, they also show themselves to have some good attributes. In this way, the film is thus realistic and thought provoking.\n\nAs a drama, this film is obviously not intended as \"entertainment\", but rather it is intended to convey a deep philosophical commentary. Unfortunately, our culture is deeply divided over religion, which is not only central to the film, but served to mar its critical reception. Quite simple, non-Christians are turned off by the film's overt Christian references, whilst Christians are offended by the blatant immorality, sexual depictions, and coarse language. By reflecting reality, the film has alienated many viewers who refuse to truly consider things objectively, but that failing is their own.\n\nIn the end, what we have here is a masterpiece, which reveals the inhumanity of America. We are faced with the horrors of the judicial system and are reminded that many prisoners are themselves victims of abuses far greater than their own crimes, whilst they face punishments which have no rational purpose. Meanwhile, all around them, 'free' society engages in immoral behavior. In this way, the film reminds us that we are all sinners, and in the closing scenes, we see the inevitability of death and decay.\n\n-Adam Rinkleff"
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "randirjarrell",
        "review_rating": "8",
        "review_title": "Deep..A Trip...Oddly Fantastic---",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "chumbukket",
        "review_rating": "8",
        "review_title": "A mis-marketed film that succeeds on a thematic level that many may overlook.",
        "review_detailed_main": "Perhaps having never heard of this film before watching it was an advantage, because many of the complaints in other reviews have focused on having very different expectations for Stone. It seems that this thought-provoking character drama was marketed as some manner of suspense thriller, which it most certainly is not.\n\nStone has, however, in these same reviews, been unanimously praised for its marvelous acting. Indeed, the cast deserves it: Robert De Niro as the nearly-retired parole officer suffering from spiritual disillusionment, Edward Norton as one of the last prisoners whose case he works, and Milla Jovovich as Stone's seductive wife. Their roles are well-acted, engaging, and in the case of De Niro and Norton's characters, against type (you'll be delighted at the sight of a foul-mouthed, corn-rowed Edward Norton talking street to an uptight, religious De Niro). These performances are key, and in this case don't only serve to create a strong aesthetic and believable characters.\n\nStone is a movie that disappointed many with its apparently slow pacing and lack of action, but an open and analytical mind will note that the action in Stone is of a different sort. The laudable acting is so important because there are no gunfights or explosions to supply the action. Instead, the turning points, the twists and the climaxes are all in how we come to know each character and in the food for thought that comes of it.\n\nMarketing will tell you that Stone is about a prisoner on review for parole who uses his temptress of a wife to attempt to con his religious (but conflicted) parole officer, but it is about much more than that. That description only applies to the characters as we are introduced to them. Before long, Stone has turned to one of the many strange and gimmicky modern interpretations of religion, first as part of his attempt to convince Jack, his parole officer, of his reform, but he quickly becomes a true believer. At the same time, Jack is quickly losing his faith, thanks in no small part to his long-broken marriage and his seduction at the hands of Stone's wife Lucetta. Their respective spiritual epiphany and crisis, along with some strong motifs, establish a pervading theme of ambiguity in religion, among other things. Fortunately, this is done very tactfully and doesn't come off as either preachy or anti-religious. The effects of spirituality on the characters are good in some cases and bad in others.\n\nSuch things may be boring to some (though I get the idea that it's more likely that they were missed entirely by much of the viewing public), but I personally prefer this particular character-driven rather than event-driven style of \"action\" and never found the movie to be slow.\n\nThe mixed reception I've seen to this film shows that subtlety has its risks. However, for those who will pick up on it and appreciate it, Stone pays off with more than just A-list acting."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "bfd21552",
        "review_rating": "10",
        "review_title": "Are there answers to the big question?",
        "review_detailed_main": "\"Stone\" is, as one other reviewer notes, like \"Monsters' Ball,\" but it is so in that the film presents life situations but offers no final answers to the title character's (and our) question: \"Maybe there's a plan {for our lives} but what it it?\"\n\nEach of us has to find (or, perhaps, not find) the answer to the \"meaning of life\" for ourselves.\n\nFor those who have not yet contemplated this question, or--more to the point--for those who believe they have found the answer, then this film is, indeed, a waste of time.\n\nFor other viewers \"Stone\" hits home--and we leave the theater identifying, if not with the characters, then, at least, with their perplexity and desires for either closure or redemption."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "adamgefvert",
        "review_rating": "8",
        "review_title": "Deep movie about human feelings and motivation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "deadbull-95171",
        "review_rating": "8",
        "review_title": "Getting stuffed on junk food, with the same short term pleasure.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "david-af-mitchell",
        "review_rating": "8",
        "review_title": "Stone is a brave movie - and it works!",
        "review_detailed_main": "I'd never heard of it until It popped up on a TV channel a couple of nights ago: A movie with two of my favorite actors and I'd never seen a sign of it! Something weird! I'm very glad I watched it because: It's quite simply one of the best movies I've seen in a long while. All four leading roles are played brilliantly. De Niro particularly (he gets through the extremely hard-to-pull-off seduction scene with total conviction: just another example, if one were needed, of the actor's range.)\n\nStone is one of those rare movies that uses ambiguity knowingly and with total success - the nature and motives and the four main characters are left sufficiently unclear that you can never quite work them out, and it is this that makes the well-paced narrative work. The end is almost shocking in its boldness. I can think of only one other American movie whose end had a similar effect on me and that is Houston's amazing Fat City.\n\nThe fact that the action is carried out to a intermittent radio buzz of Christian propaganda juxtaposed with the professed beliefs or lack of them of the characters, makes this a much \"deeper\" movie than a quick summary of the plot might indicate.\n\nMy advice is: see it before it meets the fate of so many other movies that have been too intelligent to meet with mass approval and disappears without trace."
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "sriram_m",
        "review_rating": "10",
        "review_title": "Greatest Spiritual Movie which is Beyond the Perception of Some Critics",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "dslav1927",
        "review_rating": "",
        "review_title": "watch a different movie instead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "terrypeck",
        "review_rating": "",
        "review_title": "Resonates, but it won't with everyone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "troy-manatunga",
        "review_rating": "",
        "review_title": "Different; yet interesting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Psychological battle, De Niro and Norton are at their best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1423995",
        "movie_name": "Stone",
        "movie_rating": "5.4",
        "review_username": "sapetrucco",
        "review_rating": "",
        "review_title": "Been THERE 20× MAGNIFIED",
        "review_detailed_main": ""
    }
]