[
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "lnvicta",
        "review_rating": "4",
        "review_title": "Two acting heavyweights and an interesting story that squanders its potential in the dumbest possible ways.",
        "review_detailed_main": "I was expecting to despise this movie. I only watched it because I was in the mood to see a bad De Niro movie, so the one where he's opposite Travolta playing a Serbian seemed to fit the criteria perfectly. But I was actually on board for the first 15 or so minutes of Killing Season. De Niro's character is off in a cabin isolated from his family and still recovering from the effects the Bosnian war had on him however many years ago, and Travolta's character is out for vengeance because he was left for dead in the same war on the opposing side. It's a simple enough premise. And there's one interesting scene where De Niro and Travolta are drinking and sharing war stories where you actually feel some tension but mutual respect building between them. Kind of like Pacino and De Niro in Heat (a blasphemous comparison but it's the first thing that came to mind). Anyway, I wanted more of that.\n\nBut as soon as that's over, the movie turns into a cat-and-mouse game between the two of them that consists of one of them getting captured and tortured, then they somehow escape and the chase continues until the other guy gets captured and tortured, then they somehow escape and the cycle continues. It's just dumb and predictable. And let's talk about the accents for a minute. Travolta doesn't even have a bad accent. Mind you I don't know how authentic of a Serbian accent it is, but the accent itself is convincing enough. The problem is that he uses the same intonation for everything he says. At one point he's literally shot in the f*cking face and the next minute he's talking in exactly the same tone as before. And De Niro does this southern accent that drifts in and out, and you can tell he's just there for a paycheck because he's not even trying to pull it off convincingly. Hell it was more believable in Machete. And the special effects, holy god they're awful. They'll randomly cut to a close up of a wound and it just looks terrible. It's gratuitous, and I don't mind gratuity all that much but when you can clearly tell something is CGI, there's no excuse for that to make it in the final cut. It's unnecessary, it looks like crap, get it out of there.\n\nSo yeah, I ended up disliking the movie but not for the reasons I was expecting. Travolta's accent wasn't the worst part of the movie like I thought it'd be. The story was quite interesting but it gets resolved in the most half-assed way, like there's absolutely no pathos when there so easily could have been seeing as how it's about two opposing war vets encountering each other after all this time. I mean, it's not a terrible movie. It really isn't. De Niro has had much worse, so has Travolta. But there are glimpses of potential all over this movie that get squandered in the dumbest possible ways, and that itself makes Killing Season a frustrating watch."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "laserburn",
        "review_rating": "4",
        "review_title": "A movie that could have been very good",
        "review_detailed_main": "For starters, the movie gets absolutely everything wrong about events of the Bosnian war, but since such ignorance is expected from Hollywood, there is no reason to hold it against this particular title.\n\nThe premise of the movie is good, the basic story is decent, but the script could have been better written, the two main characters' stories never get satisfyingly developed. If this was directed by John McTiernan as originally planned, this would have been a great movie. Sadly, instead we got the guy who did Daredevil and he once again delivered a bland, uninspiring product. Acting is OK, Travolta did his best to hold a consistent accent (it was the wrong accent, but hey!) throughout the movie, while DeNiro looked more like he was only concerned with the paycheck.\n\nAll in all, the movie is not terrible, I guess it wouldn't kill you to watch it if you have nothing better to do for an hour and a half. The sad part is that this could have been a much, much better movie, perhaps even a classic."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "palavitsinis",
        "review_rating": "6",
        "review_title": "Not a masterpiece but it's watchable!",
        "review_detailed_main": "Apart from the angry folks from the countries that the movie depicts, that gave 1/10 to this movie, it's a nice movie overall.\n\nIt's not a masterpiece and it's actually right on the path of the movies that De Niro has been doing for the past few years. Despite it not being great, I really liked it for what it is. It's supposed to be a thriller with two war veterans and it's just that. It's nothing ingenious but it's a totally decent movie that would be a 6.5 in my book.\n\nTravolta was good, De Niro is always great cause I adore him as an actor! The action was as much as I wanted, the scenes of the fighting were really realistic and kept me at the edge of my seat. Even this back and forth thing that one was freed and the other was freed and so on and so forth, was nicely done and was not tiring.\n\nIt's a nice rental for a relaxed week night, with some pop corn or a pizza, if you can handle eating with bloody scenes!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mls4182",
        "review_rating": "1",
        "review_title": "Ghastly",
        "review_detailed_main": "Poor De Niro. I had to turn this off.\n\nThe plot was awful and Travolta us unbearably bad.\n\nI can't believe this was even financed. It is just pointless."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "7",
        "review_title": "Not mind blowing but a solidly entertaining flick and nowhere near as bad as the reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Bugeera",
        "review_rating": "",
        "review_title": "Another one...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "varsania",
        "review_rating": "7",
        "review_title": "JT Most Funniest Role to Date",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "WillWong101",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever watched",
        "review_detailed_main": "This movie seems like it was written and directed by a couple of 12-year old boys. It's an awful pile of steaming cheese.\n\nWhat was De Niro thinking? Travolta doesn't surprise me - he has a knack for picking stinkers.\n\nIt was excruciating from start to finish - filled with clichés, bad acting, ridiculous fight scenes, laughable plot, Travolta droning on in some pseudo-Serbian accent, and old man De Niro hobbling through the forest. Not sure how it could have been any worse.\n\nDo not pay money to see this movie. In fact, just don't watch it at all. Life is too short to waste on this kind of dung."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "spiritadelhamzaoui",
        "review_rating": "7",
        "review_title": "I read a lot of reviews about the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Buterfli1008",
        "review_rating": "10",
        "review_title": "Idiots, its a story. It's not freaking fast and the furious!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "kian_razavi",
        "review_rating": "7",
        "review_title": "Not the best but not the worst by far",
        "review_detailed_main": "I see comments from people insulting the writers and actors for ignorance in history and movie. Being myself a huge fan of History and a big History book writer, I am always the first to stand and yell about the shame the movies are!\n\nBut hey, for this movie I am not doing this. The reason? I sens that the producers/director had something else in mind. History changes always with the perception of Human mind. If you lived something from one side or another, the perception won't be the same thus History won't be the same. For me, only one thing was the key, the central element of that movie... hatred! And that my friends, we felt it. It was clear that Travolta saw what happened in a way when DeNiro saw it at the opposite... but when both of them were in that forest, they only were trying to kill each other or for Travolta, trying to admit DeNiro that he has done something wrong. But what is wrong or not? Who are them and who are we to say?\n\nTruth changes with camps and is not universal and Hatred naturally human! That was the guideline in this movie!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "srdjan_fon",
        "review_rating": "1",
        "review_title": "total anti-Serbian propaganda",
        "review_detailed_main": "historically incorrect! naive and just stupid! But corresponds to an uneducated American public!\n\nHowever,\n\nacting is good (6/10) actors are great (10/10) but obviously not read the script before accepting the role\n\nIf you like a bit of action and a lot of stupid torture scenes then this is the movie for you.\n\nTime spent watching this film better use to learn something in life.\n\nI hope that I have fulfilled the required ten lines of text, which is much more than this movie deserves"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "bojanran",
        "review_rating": "2",
        "review_title": "Wasted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "claytonspittler",
        "review_rating": "7",
        "review_title": "Tired of Nonsense Reviews? Me too!",
        "review_detailed_main": "Deniro and Travolta were what we have come to expect in this film. Both excellent actors a little past their primes, although this movie showed few signs of regress. Travolta, donning a chin-strap and somewhat comical Bosnian-English accent, comes to America in hopes of revenge on a former US soldier(Deniro)whom he had been confronted and shot by in the Bosnian conflict.\n\nAfter tracking the US soldier to his home cabin in Northwest USA,back-story is revealed. Ultimately, the two engage in a back and forth battle on the countryside pitting wits against wits in hopes of killing one another. The movie has moments of intense action, followed by articulated scenes of survival. Could have been a bit longer with more build up, hence my 7-10 rating. Would have been a 6 had this not been a Deniro-Travolta flick. Cinematography is good, story is to the point, and Deniro and Travolta do what they do."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "claudio_carvalho",
        "review_rating": "1",
        "review_title": "Awful Thriller with Shallow and Shameful Story of Revenge",
        "review_detailed_main": "In 1995, a UN platoon executes a group of Serbian Soldiers. In the present days, in Belgrade, the Serbian Emil Kovac (John Travolta) that survived to the execution eighteen years before, gets information about his executioner Benjamin Ford (Robert De Niro) and travels to the remote Appalachian Mountain, where Benjamin lives alone, to revenge. Emil meets Benjamin in the beginning of a cat-and-mouse game.\n\n\"Killing Season\" is an awful thriller with shallow and shameful story of revenge. It is unbelievable that a man, traumatized by the cruelties of the war, waits for eighteen years to revenge; pays money for the information of his executioner; travels from Belgrade, in Serbia, to a remote area in the United States of America to kill the man; and after a few minutes talking, they almost become friends. Actually I was expecting that the executioner would invite him to a barbecue in family or to drink a beer. Maybe this drama is the further that Hollywood writers might expect from a traumatized man. The decadent Robert De Niro and John Travolta should consider the retirement or change agent to get better scripts to not compromise their brilliant filmographies. My vote is one (awful).\n\nTitle (Brazil): \"Temporada de Caça\" (\"Hunting Season\")"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "MrSpark",
        "review_rating": "6",
        "review_title": "An interesting movie",
        "review_detailed_main": "First of all this review focuses on the cinematography and acting of this movie and not its historical accuracy, I am not a judge of that. All I'm going to say is that history has many sides.\n\nKilling Season brings to the big screen the first collaboration of two great actors, Robert De Niro and John Travolta. Both of the actors bring mediocre performances and are basically the main reason that this movie is quite appealing. Travolta's Serbian accent, I thought, was decent enough and quite believable. De Niro's performance was a bit rushed, like he did this movie as a favour for someone, or simply for money.\n\nAlthough overly cheesy and quite violent this film is perfect for thrill seekers who like to see good actors play roles that do not suit them at all. The plot is simple and does not complicate things although I do believe that the flashback scenes were useless to the portrayal of the story. The only thing need said about the plot is that it is a simple \"revenge seeking\" story.\n\nTo summarize, this movie is an adventurous story with beautiful scenery and intense action scenes that appeals for both action and thrill seeking audiences but also to more critically thinking audiences that focus on exaggerated acting performances. Overall I give this movie a well deserved 6/10."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "drakesh7",
        "review_rating": "1",
        "review_title": "Everything here is bullshit!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "brcastle2000",
        "review_rating": "7",
        "review_title": "Not their best work... Not their worst work either...",
        "review_detailed_main": "I had read some reviews before seeing \"Killing Season\" so I didn't have too high of expectations going in. That being said, I wasn't disappointed. DeNiro and Travolta give average performances, which aren't helped at all by the accents they try to use during the film. Travolta's is painful, the worst part is, someone, somewhere along the line had to tell him it sounded good. DeNiro's southern drawl is nowhere near as bad, but it seems to come and go at different times in the movie, becoming more or less noticeable. KS starts out a little slow but picks up about 1/3 of the way in and keeps a decent pace. The plot is solid, but IMO the script writer didn't hold up his end of the bargain. Either that or Travolta and DeNiro were basically going through the motions with their main motivation seeming like the paycheck they got after the last day of shooting. All in all, the movie is entertaining, if only mildly at some points. It definitely will not win any awards, but it will help you to kill two hours. SKIP THE THEATER, RENT IT"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Dourankev",
        "review_rating": "1",
        "review_title": "Worst Film of the Year",
        "review_detailed_main": "Worst movie of the year! This action is worthy of the 80s of the twentieth century, but not for the twenty-first century. The saddest part is that the story is fictional bad from start to finish. Even more sad is that two great actors have agreed to sell for a few dollars more. From bad to worse. Who watches this film loses 1.5 hours, which could be used for reading a good book or conversation in the company of friends. Disgust is largely because the film until recently was an art now increasingly becoming a cash machine without much thought. Still, it is suitable for people without much intellectual effort, like fast food, quick thinking and rapid results. As a side dish - the film flowing much ketchup (blood), plenty of pretty scenes. Farewell to the illusions of the \"great\" cinema \"great\" actors for the American \"dream.\" Do not waste time and money, run away from this movie!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "bob-rutzel-1",
        "review_rating": "9",
        "review_title": "Good Story: Effects of THAT War",
        "review_detailed_main": "Still carrying shrapnel in his leg from the early 1990s Bosnian War, Ben Ford (Robert DeNiro) had gone into the wilderness to live and to forget about his time in that war. Later, Kovac (John Travolta) meets Ford and they bond. That is, until Kovac announces his true intentions. Kovac was also in that war. Oh, oh!\n\nThis is perhaps the best cat and mouse movie I have seen in a long while. Ford and Kovac take turns at being the cat and then the mouse. This is not meant to be comical, as this is serious business, but cat and mouse is what we have. And, it all worked. At times, Kovac could have easily killed Ford, but didn't. Why?\n\nJohn Travolta, as Kovac, uses a Serbian accent and we get used to it as he does a good job of it. Both Travolta and DeNiro are in their elements in the movie. Oscars? Hmmm..\u0085.. maybe.\n\nFrom time to time, we are shown , I believe, scenes from the actual Bosnian war and they are not easy to see. Also, this is not an easy movie to watch, because there is torture involved, some quite bloody too. I cringed and had to look away more often than I would care to admit. It was like I was there. Oh, the horror.\n\nGood pacing throughout and some exciting action scenes as well. Excellent cinematography including some live and still photography of landscapes - that had that haunting look and feel - when the credits roll. And, the Johnny Cash song (Don't Take Your Guns to Town) played a lot in the beginning was spot on.\n\nThis is the story of the effects of that war on some who were there. (9/10)\n\nViolence: Yes. Sex: No. Nudity: No. Torture: Yes. Bloody Gore: Yes. Language: Yes."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "lunchboxwanderer",
        "review_rating": "7",
        "review_title": "Good film",
        "review_detailed_main": "I just finished watching 'Killing Season' and have to say I enjoyed.\n\nTravolta and DeNiro both did a great job with their characters.\n\nI've seen derisive comments about Travolta's accent but in my opinion they are unfounded.\n\nThe film had a nice feel to it along with an interesting story about how people deal with the emotional scars left from war.\n\nUsing the Serb/Bosnian conflict was a nice touch as it was one of the worst stains on humanity in the past 25 years.\n\nThe setting and cinematography were beautiful.\n\nIt was worth the time spent viewing."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "azimuth361",
        "review_rating": "1",
        "review_title": "Oh, for the love...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "lbh-89361",
        "review_rating": "1",
        "review_title": "Stupid to the point of pain",
        "review_detailed_main": "I have not watched a worse movie of a confused reality for a long time or it was made on bad purpose. It is pity that such good actors, Robert Deniro and John Travolta sometimes have to accept roles in films that spoil their overall rating\n\n😱"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "glennbatten",
        "review_rating": "7",
        "review_title": "Good but not Great and a Movie not a Documentary.",
        "review_detailed_main": "This movie is about how its never black or white in war no matter what side you are on and how some people are so affected by it and cant seem to let it go. It does not tell you what is right or wrong, it deals with the the ongoing effect of such things on two men years and years later.\n\nRating the movie itself 1 or 2 stars just because you don't agree with their version of the history is pretty myopic. If the internet had more penetration in Somalia in 2001 the Black Hawk Down would surely have been rated a 3 or 4 instead of the 7.7 it received as the locals claimed that is now how it went down at all. This is not a documentary but a movie.\n\nIt is not the best movie I watched, but it is entirely watchable by two actors who know there stuff. Watch it for the entertainment value not the history lesson."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "steveorr-01599",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Someguysomwhere",
        "review_rating": "7",
        "review_title": "Next time you have a disagreement with someone you should say \"Meet me in the woods\".",
        "review_detailed_main": "The actions of an American soldier, Benjamin Ford (Robert Deniro), toward the end of the Serbian-Bosnian conflict follow him home to haunt him. But not only in his mind thru conscience, but also in the form of a Serbian soldier, Emil Kovac (John Travolta), bent on a desire for a confession and revenge for a particular action against him. Benjamin is now living in a cabin retreat out in the wild some place, photographing wild-life, wrestling with his demons, and dodging his family. The perfect setting for two veterans to \"have it out\", mano a mano, undisturbed by other people and the laws and conventions that govern them in a less secluded or more populated area.\n\nIt's a survival movie with Emil as the hunter and Benjamin as the prey. It's a tough, brutal movie that may make you wince in some places and perhaps unintentionally laugh in others. We've seen movies of this sort before and they are always entertaining --when done well. AND THIS ONE IS. The tit for tat between these two men as they try to get the better of the other seemed \"somewhat bizarre\" to me but engaging. The movie is also made interesting (and more complex) by the fact that both men are likable. So it's not a simple \"good vs evil\" movie where you clearly want the good guy to do away with the bad guy. Speaking of which, John Travolta really does good bad guys. There's always that intimidating sense of \"crazy dangerousness\" lying just beneath their surface. Good accent in the movie too. This is an entertaining movie with likable leads. And worth, I believe, every star I gave it. Enjoy. Love, Boloxxxi."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "dusan_lisov",
        "review_rating": "3",
        "review_title": "historically incorrect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "BesartPrishtina",
        "review_rating": "7",
        "review_title": "Decent movie, highly underrated, disregard bad reviews",
        "review_detailed_main": "First let's talk about the movie... I liked the movie, it was a good Action,Thriller movie, script was decent also but the actors lacked a little commitment. De Niro was good but not as good as in The Heat, and Travolta was way out Pulp Fiction.\n\nThis not anti-Serbian propaganda, because historical facts are telling us that Serbia is the aggressor. Serbia has a lot high ranking government officials tried for War Crimes and Crimes against Humanity, it also has high ranking military officials tried for the same crimes.\n\nMaybe 200.000 casualties is not the precise number but it is not far from that since there is no precise number of death toll in Bosnia, some reports are saying that there are more than 115.000 dead, so it can be even 200.000.\n\nWhat really pisses me off is that we all know that 40% of those killed there were Bosnian Muslims so how come that this cannot be called a genocide??!! So as for closure the movie was good, lacked a little bit of acting but it was worth watching it."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "duckrogers007",
        "review_rating": "3",
        "review_title": "To far they live to know what happened",
        "review_detailed_main": "One star for Travolta and De Niro in film, without them i would give a movie a null, void, nothing, empty space. So its two.\n\nLets talk about history. Every side has its own history, and maybe in 50 years we will as collective see the truth. But now I see a lot of people here talking about what happened and defending them self's. Why? They missed the point of the movie, that war is over....(third star) Now its three stars.\n\nIn basic its history repeating it self over and over, and not learning it and knowing the through we make mistakes all over again.\n\nSorry guys I'm from Croatia, I always lived here, and a lot of my good neighbors were Serbs that defended their homes against not so good neighbors which had informations and one day just started the war, in their back yards, in their town, against their neighbors. Thats just insane.\n\nMy home town had survived some heavy stuff, i could say that attack on police precinct was just as film from 70's.\n\nBut my god, please, let just put it all a side, and say that it was insanity, lets be friends, and move on...like that joke De Niro told at the end.\n\nActing OK, as if i doubt it with those two. script heavy crap, Locations beautiful. Hollywood two thumbs down for this one."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jeremiah59",
        "review_rating": "10",
        "review_title": "Good movie with universal anti-war message",
        "review_detailed_main": "Good movie with very good performance by Robert De Niro and diabolical and wicked appearance by John Travolta. Filmed on beautiful locations in Tallulah Gorge State Park and Black Rock Mountain State Park. The movie borrows ideas from \"Deer Hunter\" (1978) and \"Deliverance\" (1972), even from the western \"Run of the Arrow\" (1957).\n\nBasically, it's an anti-war movie, with interesting psychological study of impact of war on warriors involved in a combat, here shown from a prospective of two enemies who continue their personal war, long after it ended.\n\nThe project was originally set in the 1970s and titled Shrapnel. It was later decided to be put in a modern warfare, the one in Bosnia. So, the movie brings universal message which could be applied to any war and war veterans.\n\nDo not be fooled about all the negative comments here, because those come from people who do not want to understand the message of the movie. Most of those comments are really hilarious, claiming that the movie is not historically accurate, trying to explain the war in Bosnia from their prospective, forgetting the fact that the film makers never claimed it has been based on a true story, and in fact it is not."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "cosmo_tiger",
        "review_rating": "7",
        "review_title": "Kind of a cross between First Blood and Killer Elite. Tense and exciting. Fun to watch the two hunt each other. I say B.",
        "review_detailed_main": "\"Sometimes things become part of you whether you like it or not.\" Benjamin Ford (De Niro) is a former American soldier who served in Bosnia in 1992. Emil Kovac (Travolta) is a former Serbian soldier who served in 1992. Twenty years later Ford lives alone in a remote cabin trying to forget the past while Kovac has been searching for Ford for twenty years. When the two meet up again a new war begins, this time it becomes personal. I have never really been a Travolta fan and lately it seems that De Niro is very hit or miss so my excitement was tempered for this one. I have to say I really did enjoy this and the movie kept me interested the entire time. The movie is basically just these two hunting each other in the woods while they try to get inside the head of the other and try and understand why this is happening. The only real problem with this is that when Kovac catches Ford he lets him get away and vice versa so it gets a little repetitive but that doesn't really detract too much from the enjoyment of the movie. Overall, kind of a cross between First Blood and the Killer Elite. I enjoyed it. I give it a B."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ak-738-189528",
        "review_rating": "4",
        "review_title": "Movie or postcard ?",
        "review_detailed_main": "So now i am sorry that i did not read the reviews first. The movie is a disappointment. I did not liked Travolta accent and look, this is not like an Serbian soldiers look like, not at all, you could tell it from 5 blocks away that this guy is American, anyway, if you wanna break your TV or laptop or you wanna beat the guy in the movie theater (you know, the guy at the ticketing) you are my guest to watch this movie.\n\nAnd what can i say about the story... it is a little bit cheap.\n\nThe final act, yeah, it was like: \"this is a beginning of a beautiful friendship\"\n\nYeah, nice pictures in the nature, but hey, they sold me a movie not a postcard!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "obione-798-645896",
        "review_rating": "5",
        "review_title": "what history? :)",
        "review_detailed_main": "Just a short comment for all the people complaining about the history facts.\n\nThere wasn't a Serbian Army? true that.. but there where: Arkanovi Tigrovi (Srpska dobrovoljacka garda), Knindze, Crvene beretke, Skorpioni, Seseljevi dobrovoljci, Dusan silni, Beli orlovi (Seseljevci, Osvetnici, Cetnici), Srpski sokolovi, Siltovi and many many more.. and they where not Japanese or chineese or Canadian people. It is to hard to understand to foreign ppl and learn all of them.. so they can say just \"serbian army\", even officially it wasn't their name.\n\nPlease look at the big picture and do not stick to these 2 words.\n\nTravolta's Serbian slang is not perfect but he is acting good. I am sure Serbian actors don't speak perfect English to.\n\nIf is a movie. Not the greatest one but still a movie and no one said it is based on a true story."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "pjr235",
        "review_rating": "7",
        "review_title": "I'd watch it a couple of times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Bunk7",
        "review_rating": "4",
        "review_title": "Simply bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Phillip_Tomasso",
        "review_rating": "7",
        "review_title": "Netflix Movie Review: Killing Season",
        "review_detailed_main": "Killing Season (Rated R) is written by Evan Daughtry (Divergent and Snow White and the Huntsman) and directed by Mark Steven Johnson (Ghost Rider movies). The 91 minute 220px-Killing_Season_film_posterfilm stars two of my favorites, Robert DeNiro and John Travolta.\n\nDuring the war in Bosnia, DeNiro (portraying Benjamin Ford) and his platoon stumble on a Serbian soldiers who have decimated a village. They've raped the women and killed the men and children. Taking the law into their own hands they form a firing squad and take-out the opposing soldiers, shooting them in the back of the head. Travolta's character (Emil Kovac) is one of those Serbian soldiers. Only he was left for dead.\n\nAngry, Kovac spends his life trying to track down the American soldiers responsible for the firing squad. Ford is a recluse. His marriage went to hell after the war. He barely knows his son. He lives in the mountains in a remote cabin and lives off the land.\n\nWhile on his way into town, Ford's Jeep breaks down. Kovac, posing as a hiker on vacation, assists Ford with getting the Jeep started. They go back to Ford's cabin and share dinner, and talk. Before long, it is clear that Kovac is there seeking revenge. Throughout, the two go at each other, back and forth. First Kovac has the upper hand. Then Ford. The torture they pour out is barbaric, and intense. (It almost is comical the cat-and-mouse game, if it weren't so brutal).\n\nBasically, Kovac wants a confession. Ford wants to leave the past in the past. It seems like the only way this will resolve is if one of them dies — and they way they go at it, death seems highly likely!\n\nKilling Season was . . . good. I enjoyed it. It could be because of the actors, though. I am not sure. I do know I did not play with my phone during it. It held my interest. I could not wait to see what would happen next. It was neither actor's best film, not by a long shot. But it was solid for a thriller. The story was interesting. Seeing each soldier's different point of view was interesting. I give Killing Season 7 out of 10!\n\nBest Selling Zombie Author Phillip Tomasso\n\nhttp://www.philliptomasso.com/"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "a-droushiotis",
        "review_rating": "3",
        "review_title": "Bobby needed the Cash, Travolta as well, Watch Something else!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "foreversmom",
        "review_rating": "7",
        "review_title": "Not bad - worth a watch",
        "review_detailed_main": "After reading some of the reviews, I thought I was going to be horribly let down. That's not the case here. I understand others' POV here... The movie may not be accurately based on facts; Travolta's accent kinda sucks (but he seemed to give it his best shot and stayed in character throughout the film); it may not be their best movie, etc... But the movie wasn't a huge let down either. It was entertaining and is worth a watch. My husband and I were both entertained and it was good enough to pass the time without any fast-forwarding. No, it's not going to win any awards, but most of the poor reviews are from people outside the US and they are probably more aware of the point in history (and actual facts) that this movie portrays.\n\nIf you watched \"Phantom\" and sat through it criticizing the fact that no one even TRIED to have the appropriate accent, or that some of the historical facts were \"blurred\", then you probably won't like Killing Season. However, if you can go into this movie without expecting accuracy and just watch it for entertainment, then you might enjoy it! We did!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "prince_dilawar",
        "review_rating": "4",
        "review_title": "More or less everything about this movie SUCKS..!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "arch-nemesis",
        "review_rating": "9",
        "review_title": "Feels like I read a good book",
        "review_detailed_main": "I personally thought this movie was awesome. It feels like most people who write a review about it are criticizing things like the facts about the history and the CGI. While I was aware of many of these problems, I didn't really harp on them considering they don't have that much to do with the film...The movie, I feel, wasn't entirely about the history of the war and what not, it was just an awesome story between these two people who have this odd relationship. When I got finished with the movie I felt like I had just finished reading a good book. If you don't criticize small things like those stated above it's very, very, enjoyable."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "stelioskiriakos",
        "review_rating": "7",
        "review_title": "An honest movie for DeNiro & Travolta",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Aosagi79",
        "review_rating": "4",
        "review_title": "Nice swing, painful miss.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "juicyfruitsweet2008",
        "review_rating": "5",
        "review_title": "Haven't seen a fail movie in a while!",
        "review_detailed_main": "So many ridiculous scenes happened in this movie. For example, this one guy was down then the other guy got a chance to have a shot at him but then he didn't do it. Then next thing you know the first guy somehow got an opportunity to get a shot at the other guy. This type of scenario happened probably 3 or 4 times again and again just ridiculous. Just do it already! Like come on.\n\nIn addition, the accent is really funny like many reviewers on here mentioned. The actor tried too hard and he seems to fail at it.\n\nWaste of 1hr 30mins seriously and I gave this movie a 5/10 rating since it has some suspense scenes to it."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Too-Tall-for-the-Desert",
        "review_rating": "7",
        "review_title": "Not worthy of all the criticism",
        "review_detailed_main": "Look it's not the best movie ever made, but it's not bad either. Perfectly entertaining viewing and it kept my attention right through to the end. Reading the other reviews the biggest criticism seems to be that it is not historically and/or linguistically accurate. So what? How many Hollywood movies are? I don't watch a movie for historical accuracy unless that is what it proclaims to offer and I had no such expectations with this film. If we judged every movie on how realistic or true to life it was then we always be disappointed. No, I think that particular criticism is particularly unfair and in my opinion the movie is fine."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "igor-karlovic",
        "review_rating": "3",
        "review_title": "Bad very bad movie",
        "review_detailed_main": "One of the weakest movie of the year. Bad acting, bad editing and a very big hole in the concept. The biggest mistake was to hire Travolta for the part. Irritating bad acting and horrible accent. Why didn't they get a local ex Yugoslaw actor (plenty of them) instead of Travolta. It would be more convincing, the feel would be more authentic. With Travolta it is ridiculous. The second mistake is the screenplay. The elaborate 'discussion' of a former war criminal is just not believable and the need for apology is stupid. These guys put a bullet in your head without any philosophical 'background' in the real world.And the peace making at the end is just awkward after several attempts of killing each other. It was definitely waste of time..."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "JockStein",
        "review_rating": "6",
        "review_title": "True Clash Of The Titans!",
        "review_detailed_main": "Like watching a solar eclipse for the first time, or catching a glimpse of \"Hayleys Comet\" as it makes its rare appearance over the earth, it is quite the event when Hollywood teams up two legendary and heralded actors for the first time. Robert De Niro and John Travolta star as adversaries still conflicted by their experiences in the Bosnian war. Travoltas character (Emil Kovac) travels to the United States seeking revenge against the U.N. commander (De Niro) for atrocities committed by his troops against the Serbians. What follows is two heavyweights slugging it out with reckless abandon, each gaining the upper hand and both being knocked to the canvass on numerous occasions. Who will prevail in this intensely physical and psychological warfare being waged by the two old enemies? Will it be the last man standing or will they reach some kind of compromise and lay down their weapons? Travolta did well and was almost unrecognizable in this improbable role and DeNiro showed at the age of 70 he is still a force to be reckoned with."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "goginl",
        "review_rating": "1",
        "review_title": "horror movie in the truest sense of the word",
        "review_detailed_main": "I just had to register to be able to comment on this \"film\". What surprises me most (or not?) is the fact that it is so easy to be a director, even if your level of intelligence does not seem to be nearly close to the average ratio. I have not yet been studied the director past of this \"masterpiece\" because it is virtually impossible for someone so bad to get the money for shooting any kind of movie. Yet the director not only got the money but also the actors who deserve attention ... what is happening??? The director of this debacle, to put it mildly, did not even try to find the original Serbian name for the villain. He is, without knowing geography and history (close and distant), used the Czech of the Emil Kovac??? But for Christ's sake is just enough if he punched in the Google.com: \"Serbian names\" and to got the right name that sounds at least Serbian! Serbian accents, on the other hand, which Travolta trying to copy sounds more like accent of a retarded and drunken cowboys after a night spent with a oldest cow from his herd in the desert. A plot of the movie absolutely belongs to the genre of science fiction, because it has nothing to do with this planet. The plot its even worse than the plot of Angelina Jolie so-called movie \"the land of blood and honey\", which was virtually impossible to outperform in the stupidity and bad acting, but that's just happened, Mr. Mark Steven Johnson made a worse movie than Angelina Jolie . What I do not understand is Mr. R De Niro as a great actor, takes part in a movie that will haunt him for the rest of his career. It reminds me of a retired world champion boxer who returns to the ring to earn a few bucks more and then be beaten and run out of money and friends (maybe a good idea for a future film that Mark Steven Johnson needs to direct with De Niro in the lead role). As if someone had put a gun to his throat and forced him to act here ... Who knows maybe is that just the case? Totally disappointing and an insult to all those who love movies and who loved these actors when they had more pride in acting."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "reisnersteven",
        "review_rating": "7",
        "review_title": "Better than people think",
        "review_detailed_main": "I just finished watching this and loved it. I understand it's historically incorrect but for once we have an action movie with two great actors, character development and good cinematography and you all trash it. The movie Spring Breakers has people saying 10/10 and this is 1/10 are you kidding me? First off Travolta steals the show with his new accent and is truly menacing. Someone said Deniro did horrible in this, don't ever talk about Deniro like that. Mans been going since the 60s and can still play a better tough guy than anyone out there today. Yes it is very inaccurate in the historical sense but I know that isn't the first time Hollywood did that so ignore that and what you have is a well filmed survival movie about two master hunters stalking each other through the woods. I found it intense, gritty and quite enjoyable"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "the_white_heart91",
        "review_rating": "2",
        "review_title": "Just Opinion",
        "review_detailed_main": "I consider this movie is a dead movie, what's the hell is that, is this even a movie!! with all respect to the actors but this film is really awful. Travolta was horrible with the way he talks with this accent, the way he reacts and fight is this even a fight for god sake. and De Nero isn't good enough for this role. the best thing in this movie is it has Milo Ventimiglia but only in three scenes that's not enough to bring life to the film. the movie is very bad i consider it on of the worst movies i have ever seen, the acting was bad, the story is old and not good. so i suggest if you didn't see this yet don't do the same mistake i did and waste your time."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "casey_drown",
        "review_rating": "8",
        "review_title": "Great movie don't know where all the negativity came from...",
        "review_detailed_main": "Awesome action and great performances by both actors!!! At least check it out for a buck from redbox!!! There was great character build up and an excellent story I had been waiting for this movie for awhile but when I saw all the negative comments I was skeptical on renting it, but was very happy to see action from beginning to end, it reminds me of Rambo doesn't hurt to just check it out!!! The people who said I was the worst movie ever made obviously have not watched a lot of movies, even though this wasn't a major blockbuster, Jennifer's body got better reviews than this what's the deal people please go to a cinema class!! Hopefully this will get the recognition it deserves we will see, but at least rate it better than a 5!!!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Action-Packed!",
        "review_detailed_main": "'Killing Seasson' is an Action-Packed film! Its Violent, Tough & Well-Acted!\n\n'Killing Season' Synopsis: Two veterans of the Bosnian War -- one American, one Serbian -- find their unlikely friendship turn tense with one of them reveals their true intentions.\n\n'Killing Season' is pretty hardcore. The rivalry between its anti-heroes is interesting. I agree, The Screenplay runs out of gas in the final act, but otherwise, I was pretty much involved in the film.\n\nEvan Daugherty's Screenplay is rough & rugged. Mark Steven Johnson's Direction captures the wilderness, efficiently. Cinematography is top-notch. Editing is nicely done.\n\nPerformance-Wise: Its great fun to see De Niro & Travolta battling it out, one-on-one. De Niro delivers a strong performance, while Travolta gets the accent right & is menacing enough.\n\nOn the whole, 'Killing Season' is much better than expected."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "petra_ste",
        "review_rating": "5",
        "review_title": "Be kind rewind",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jacklam55",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "I guess this is what it was like (or in some cases still is) when Chinese was spoken in Cantonese, or maybe a Mandarin speaker would speak to a Cantonese guy (and they'd be brothers), or one guy could be speaking gibberish to another guy that would be passed off as Chinese. Wonderful stuff. I guess this is what Serbians would feel after listening to Travolta's accent. Even to me, it sounded like a generic middle easter/Arabic accent. He could have put on some Arabic clothing and acted as a sheik for his acting talents.\n\nLike others said, this started out fairly decent, then quickly went off the deep end. Still worth a 2 star though, at least for the cast."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "aalmehrizi",
        "review_rating": "6",
        "review_title": "John killed it",
        "review_detailed_main": "The story is away from reality. This is the first time I see John Travolta trying to act. Yes he was trying to act Serbian but that didn't go well."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "archmage333",
        "review_rating": "1",
        "review_title": "Just a disgrace",
        "review_detailed_main": "I read a review that nicely summed up all the flaws of the movie but omitted to notice that the legendary actors themselves were fooled into participating. If they actually knew how inaccurate and ridiculous the script is, how sadly inadequate most of the props and background will be, would they accept it (even though I know the $$$ offer must have been saucy). Clearly a commercial, generic movie but does a superstar the likes of De Niro and Travolta really need the cash that much to allow himself to associate with this piece of garbage, let alone be the main reason people all over the world watch it. The saddest thing about it is a vast majority will never learn how idiotic this production is. The Serbian language doesn't sound like that at all and you can see from the very start that the movie is such a failure the only purpose it may have is to either enrage those that actually know how it should all look and sound, what happened, when, where and how... or make them laugh at this insanely flawed production. As for those who have no clue, the purpose is to yet again glorify the malefactors of the American government and their puppet masters who, in reality, fabricated, orchestrated and made sure that yet another \"divide-and-conquer\" war scenario is actualized."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "beebopbeedoobi",
        "review_rating": "",
        "review_title": "It's about songs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "prince_c3",
        "review_rating": "7",
        "review_title": "Better movie than rating!!!",
        "review_detailed_main": "Well, every time a movie comes out about the massacre of 1992 by former Yugoslavia showing the brutality and mass murders, rape and torture of human worse than second world war, why all the Euro Trash comes and start criticize the movies and telling the lies like nothing happened ever there. In fact the systematic killing of Muslims were biggest after Jews in WWII in Europe, but all the ignorant from Europe and their supporters has to come and give some negative reviews about the historical facts and how this and that never happened there. I have seen so many newspaper reports, videos and heard the stories of survivor how they rounded up all the men in villages of Bosnia and killed them and how they took all the young women to use them as sex slave and to work for them 24/7. I challenge everyone to prove this wasn't happen in Bosnia and I will provide the evidence. Where were all these ignorant when some fictitious movie about some event in WWII like Defiance and Inglourious Basterds which were far from reality got more than 7 star ratings, why all these Euro Trash don't criticize then and why the movies about Vietnam War depict anything but reality gets more than 7 stars. If those movies are not historically accurate and get 7 stars then why all these Euro ignorant give movies like Killing Season and In the Land of Blood and Honey bad ratings. Yes, when it comes to movie making in order to present as drama they make some changes and don't stick to 100% accuracy historically. All these ignorant questions about the historical facts which happened just 20 years back in the modern age of internet and aerial photos which and technology. But same ignorant never questioned about historical accuracy about something happened about 70 years ago when there was no internet or aerial photography or any advance technology. When it comes to this movie, well of course I am bit disappointed with the way Travolta act, of late his acting skills are repeating and boring. De Niro gave great performance. Overall, this movie is good with few missing Historical facts, but this could be a great movie, a 5.1 rating is not justified when crappy movies like Inglourious Basterds got 8 rating."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "matty241090",
        "review_rating": "5",
        "review_title": "Not their best but still a good movie.",
        "review_detailed_main": "I think the problem with this film is the actors are always placed on a extremely high pedestal and any slip up or under par performance and they are shot to bits. I definitely agree with people when they say this film wasn't a 10 star blockbuster but also disagree with the ratings of 3 or below. I believe De Niro and Travolta performed as well as they could with the script that was provided.\n\nNicolas Cage was to be Benjamin Ford originally but was replaced by De Niro, I think i would have expected Cage to lower the standard of this movie a lot if he actually was cast in the end.\n\nOne of the main criticisms of the film was Travoltas accent. I mean it could have been a lot worse but it still was noticeable. I think casting a actor with a genuine accent would have been the smartest bet. After all De Niro would have been all it took for me to watch this without Travolta in it at all.\n\nI'm not familiar with the war at all so can't comment on any of the accuracy of it or any faults they have with it.\n\nThe main part of the movie with the cat and mouse chase through the woodland around Benjamin Fords home was very suspenseful not know what the outcome of there very own war of revenge. The couple of torture scenes may be hard to watch by some people as they are quite graphic. Apart from the accent issue i enjoyed the movie. The story was there and the actors defiantly were. Maybe the script could have done with slight tweaking but if you can overlook that then you will enjoy it. 5.5/10"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Not exactly accurate, but then ...",
        "review_detailed_main": "How is it possible to get everything accurate and which truth are you supposed to tell? The story itself may revolve around the Balkan wars, but at its core it is about two men who have to cope with actions they were forced to do. So Travoltas accent might not be the best (he sometimes did sound like a drugged Arnold Schwarzenegger), but he tries to be as authentic as possible. The fact he even travelled to learn more about the war is a noble thing.\n\nThat doesn't change the fact, that the movie has some major issues. For some maybe even pacing issues. But having a heavy weight like De Niro in there helps the proceedings movie along quite nicely. It's tough to find and walk the thin red line in the blame game, but again the movie tries. If that is not enough for you, you won't be able to enjoy the tension that is building up between the two characters. And it is essentially a two men game. Let the season begin ..."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "nebk",
        "review_rating": "5",
        "review_title": "More Like Lukewarm Season",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "xunspoken13",
        "review_rating": "9",
        "review_title": "judge this movie for yourself",
        "review_detailed_main": "I just finished watching Killing Season and was disheartened by the reviews on IMDb. By no means am I a film aficionado, and I am sure plenty of people are going to be mad with me, which is fine, but I really enjoyed the movie and would recommend it to anyone who does not immediately write a story off because of its inaccuracies. De Niro and Travolta performed well together and told an interesting story of coming to terms with the past. Some parts were anticipated but all in all the overarching plot plays out like it should. The more gory scenes particularly stood out as parts of Killing Season I enjoyed, even if some of the movie's ideas are a little far fetched. Definitely give it a try. - Spencer"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "lorraineewan",
        "review_rating": "7",
        "review_title": "very well done",
        "review_detailed_main": "It is a bit distracting having John Travolta as the 'baddie' playing someone who isnt American but he really did a good job at one point I thought maybe he was just a lookalike for Travolta ....and De Niro as always was amazing. I wonder how this movie would be if the antagonist guy was really Serbian? I have a female friend who has been beaten with a bat for looking Serbian (she is Serbian but never hurt anyone). this is a story that needs to be told. because she has the square jaw features way she has experienced a lot of pain and most people in the world dont know about this conflict I dont fully understand it myself, but it seems like one group are suffering for the actions of the few. As with most conflicts. People could take a bat to a girl walking home from visiting her mom because she had a look...imagine what people do to a man?"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Fluke_Skywalker",
        "review_rating": "5",
        "review_title": "Off target",
        "review_detailed_main": "Robert De Niro and John Travolta have been chasing paychecks for the better part of a decade now, but more often than not both men can be counted on to bring their A-games--even in B-movies. Such is the case with 'Killing Season', an intriguing, but ultimately disappointing film that allows both men to really flex their acting muscles for the first time in recent memory.\n\nTravolta may look ridiculous, with his boot-polish black hair and chinstrap beard, and his attempt at a Serbian accent is comical, but he otherwise gives the sort of performance that reminds you why he's been a movie star for almost forty years. He and De Niro play well off of one another, and it's a shame that the script isn't up to their level.\n\nUltimately 'Killing Season' tries to marry both Hollywood and art house sensibilities, but the result is a bit like trying to connect a Lego to a Lincoln Log."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "daniel-schlachta",
        "review_rating": "2",
        "review_title": "Not recommended.",
        "review_detailed_main": "To tell you the truth I found the reviews here more interesting than the actual movie.\n\nOn the positive side, the cast is practically fail-safe, so if you must, go ahead and watch it, I won't put up a big red warning sign. I also subscribe to the appreciative things that have been written about the editing and the photography and the music.\n\nOn the negative side, it is just plain sloppy. I am more than willing to look past historical inaccuracies, phony accents, and logical problems in a story if the story is strong enough. But here it is just the other way around: if you force yourself to overlook the flaws you are basically already too busy to actually watch the movie.\n\nAs an example, the much-berated accent is not that bad in itself (I cannot validate Serbian) but it is not believable simply because the guy talks like Joe average with a weird pronunciation (cultural references included - I have to ask myself: where and how did he learn them?).\n\nAnd then those little things: the pitcher of lemonade magically fills itself. The protagonists seem to be faster on foot than when driving a car.\n\nConclusion: Nobody involved in the making of that film seems to have cared very much about it, so why should you."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Not a complete disgrace, but unsatisfying in the end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "richeysj",
        "review_rating": "6",
        "review_title": "Two Seriously Resilient Guys!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mise79",
        "review_rating": "1",
        "review_title": "Fact vs Fiction",
        "review_detailed_main": "Not sure where to begin but I must say that it looks like truth hurts, doesn't it? One thing that has remained the same since the end of the war is that you all still collectively claim, as you always have, that the whole world was (is) against you. There is no point of getting into details so take a moment and think about this: 1 - your own president was charged with crimes against humanity (humanity = whole world) 2 - You harbored 2 biggest war criminals who were both charged with, surprise, surprise, crimes against humanity (again the whole world part) 3 - Your current president apologized for the war I do agree that sometimes ignorance is bliss but it looks sad that even after being convicted by the whole world of atrocities in Bosnia, not seen since the slaughter of Jews during second world war, and almost repeating the same thing in Kosovo you continue to believe that you were the victims. Sad isn't it? I wonder what's next? 10 years from now will you claim that it was all a movie and that it never really happened?"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "For eighteen years I have waited.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "3xHCCH",
        "review_rating": "4",
        "review_title": "Torture",
        "review_detailed_main": "The poster proudly headlines two big name senior stars, Robert de Niro and John Travolta, in what looked like an action-themed movie. The casting hold much promise because of this star combination. Now is the film worth their names on the marquee?\n\n\"Killing Season\" tells the story Serbian ex-soldier Kovac (John Travolta) goes to America to seek out Ford (Robert de Niro), who was one of the US soldiers who executed Serbian soldiers back in 1995 when NATO intervened in the Serbian invasion of Bosnia.\n\nThis film is basically a revenge tale, but this was hyped up several notches because of the extreme torture scenes they want us to see. It becomes a game of alternating one-upmanship on who is torturing who, until the climactic confrontation scene.\n\nUnfortunately, this film is not too good, despite its cast. Or could the problem be BECAUSE of its cast.\n\nRobert de Niro seemed so bored doing the film. His acting was not convincing or as potent than when he was at his prime. He even looked too old to play this character Ford. When I found out that de Niro actually replaced Nicolas Cage for this role, now I understand why this character was written this over-the-top way.\n\nJohn Travolta was his usual hyper-sinister character we are used to seeing him in when he plays the villain in a movie. His accent was as thick as his goatee, both were atrocious. Actually, I would give him credit for being more restrained here when compared to the previous extra-psychotic bad guys he had portrayed before.\n\nI guess this lackluster story and ordinary execution are the reasons why this film is not receiving the attention that an unprecedented de Niro- Travolta pairing deserves. As directed by Mark Steven Johnson (who had previously directed mediocre action films like \"Ghost Rider\" and \"Daredevil\"), the events were rather predictable as they unfolded. There could have been more suspense and tension, but that was unfortunately not the case. What a waste. 4/10."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "roseann-32974",
        "review_rating": "7",
        "review_title": "Great acting",
        "review_detailed_main": "John Travolta played a Russian war veteran, and he had the best Russian accent I have ever heard. I honestly did not expect him to have such a strong accent, but it was done very well. Robert also played a really emotional role, and I feel he did very well under the given circumstances. I was impressed with the acting, and I was impressed seeing two movie legends battle it out. Overall, I gave the movie a 7 out of 10 because I feel some moments could have been better. I feel a few moments he could have killed him, and he should have. But overall, the acting was very good. I just feel it should have had a more realistic element to it."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "nesfilmreviews",
        "review_rating": "2",
        "review_title": "One of the biggest missed opportunities in iconic match ups.",
        "review_detailed_main": "A battle of awful accents coupled with slapdash cat and mouse intrigue, \"Killing Season\" is a thriller whose approach grows increasingly mundane, and renders itself completely forgettable. \"Killing Season\" is directed by Mark Steven Johnson \"Ghost Rider\" (2007), and the movie stars two cinematic legends, Robert De Niro and John Travolta, who star together on-screen for the first time ever. What could be an ultimate showdown of two acting titans with a storyline that closely follows \"The Most Dangerous Game,\" unfolds into abysmal exercise of nonsense, and thoroughly disappoints given its potential.\n\nBenjamin Ford (Robert De Niro) is a former American soldier and a Bosnian war veteran who now lives in a secluded cabin hidden deep in the Rocky Mountains. Emil Kovac (John Travolta) is a former Serbian soldier from the same war, who cannot let go of a particular run in he had with Ford. Finally acting on his obsession years later, Kovac uncovers Ford's location, and decides it's time to settle the score. After finding Ford and concealing his identity and motives from him, Kovac eventually reveals his intentions while out hunting with Ford, setting the stage for a struggle for survival. Kovac hunts his most elusive prey ever, but can Ford turn the tables on his Serbian hunter and make it out alive?\n\nQuickly and to the point, the primary problem is the material, written by Evan Daugherty \"Snow White and the Huntsman\" (2012). The movie promises an exercise in these two soldiers stalking and hunting each other, but ultimately it is nothing more than a series of graphic torture scenes with long-winded monologues, a series of power reversals, in which one gains the upper hand, just long enough for the other to escape. These reversals eventually happens with such frequency that it becomes entirely comical and ridiculous. I was more than a little confused as to why a movie pitting Robert DeNiro against John Travolta was getting such a limited release, but after watching \"Killing Season,\" I completely understand."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "graydevelopment",
        "review_rating": "10",
        "review_title": "Great Movie that someone powerful wants to sabotage.",
        "review_detailed_main": "I rarely if ever will review a movie, but I feel compelled to write some words concerning this movie. I saw the reviews and decided to pass on the movie at first, but when I was out of other options and it was last minute I grabbed the movie at a local Redbox. First off I am not going to argue the validity of any history portrayed in the movie, mostly because like any movie, they base something on a truth and add their own flair and interpretation to the flick. So, I won't bother defending it on the accuracy or inaccuracy of it's story. The important thing for me is that the movie is good, real good, and here's why. 1. Its very realistic as far as the characters, action, and plot are concerned. This could be something that could have happened all the way around. 2. It has a simple and yet powerful story that is easy to follow and is very fun. 3. It's cheap and in very good ways. The movie relies on acting and the natural shoot locations to do most of the work and not some special effects wizard to get the job done. It keeps you involved with real people and places. 4. The story is amazing and it will change you , if you let it. Its a lot of fun and excitement, don't let the hatters deter you."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "erraticchevy",
        "review_rating": "7",
        "review_title": "Who cares who knows more Bosnian history, I enjoyed this movie!",
        "review_detailed_main": "You guys need to back off a little. This is not a documentary on the history channel! This is a Hollywood Movie. Last time I checked there was nothing wrong with changing historical events for entertainment purposes. I thought this movie was excellent. It was exciting, different but I did enjoy it. Especially having De Niro and Travolta. Odd couple but great chemistry. By the way guys remember the movie Inglorious Bastards?? It's historical screenplay wasn't fact but indeed was nothing like what happened during the holocaust but everyone was able to sit back and enjoy it. I recommend you guys do the same, instead of harping over who knows more about Bosnian History."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Missed opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "preemptiveselfdefense",
        "review_rating": "5",
        "review_title": "It was a decent movie, BUT......",
        "review_detailed_main": "I'm going to put aside whether or not the movie accurately portrays Serbians and Bosnians and all that, as I'm not super well-informed (as I was still in the American public school system at the time) and would be putting out more opinions than facts. Which I'm sure someone else will go ahead and do w/out my help.\n\nAs for the movie, well it's a pretty good movie. Thought it was gonna go the gross-out route for awhile but turned out to be a well paced flick. I saw someone mention The Hunted or whatever, that movie w/Benicio Del Toro and Tommy Lee Jones corpse. Aside from some general similarities I wouldn't bother comparing them. Though I didn't like The Hunted a whole lot either. They are both similar in that they are mainly about two soldiers that try and kill each other in the woods. As I recall, Tommy Lee Jones was supposed to have been the other guys teacher or superior officer, which at least slightly accounted for the age difference. Here, they don't even bother w/that. You're supposed to accept that Robert DeNiro and Travolta fought in the same war together. Well, maybe DeNiro's character was supposed to be an officer. Didn't look like it, but I was probably so distracted by the young soldier that had DeNiro's CGI'd 60yr old face plastered on it.\n\nBasically, it's a good movie that is horribly miscast. Which is especially a problem when they're really the only two people in the movie for any appreciable length of time. Accents are tough, and people are overly critical, but in this movie they're just ridiculous. I've had a hard time taking John Travolta seriously in anything since Broken Arrow and Face Off and all that other horrible schlock. Maybe he did do a good accent (at least he uses it consistently) but he comes off sounding like FPS Russia with a head cold or something. DeNiro throws a little \"southern boy\" accent in every once in a while, but it comes and goes about as often as the arrows in Travolta's quiver (12,3,5,2,3....never stays constant).\n\n(Haha, I said I wouldn't compare them then I went ahead and did anyway. Maybe my ex was right....)\n\nSo, if u can swallow that Clint Eastwood and Seth Rogen fought in the same war together, than you'll be fine w/this movie. It's a good movie if you have the mental energy to block out...well, how the actors look and sound...then you'll be fine. I'm glad they did it so that I can watch the remake in 4 years and enjoy that."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "svizoman",
        "review_rating": "",
        "review_title": "misleading movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Beauq81",
        "review_rating": "7",
        "review_title": "Not as bad as I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "shamana-88-469423",
        "review_rating": "1",
        "review_title": "Congratulations for this A-grade junk",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "classicsoncall",
        "review_rating": "6",
        "review_title": "\"Sometimes things become part of you. Whether you like it or not.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "drpavlovic1611",
        "review_rating": "1",
        "review_title": "Bosnian Serbs are the bloodthirsty animals AGAIN. Congratulations Hollywood",
        "review_detailed_main": "What's happening with the people when the grow old? Morgan Freeman is spitting at his great career going to Srebrenica and listening only one side, Muslim, and declaring Serbia (which has nothing with it) as the genocide country. And, what is more interesting, de Niro, who was in Serbia, who was fed and welcomed here when he was young, by Serbian people, who loves Novak Djokovic, made this anti Serbian movie???? INCREDIBLE. Hollywood is really consistent. Serbs must be the bad guys and that is it. Nothing will change forever. 1. It is so interesting how Hollywood is IGNORANT. Does anyone there has one brain cell? The main, Serbian character has named EMIL KOVAC. So stupid. Emil is a MUSLIM name. KOVAC is a Croatian surname. And the beard he wore (John Travolta) is not Serbian style, it is more Muslim extremists one, that people are called WAHHABIST, the most fundamentalist current in Islam, they call it the origin of terrorism. Their members has that kind of beard without mustaches and they wear bermude (short pants). They still have their camps in Bosnia. And they are very active there. Of course, nobody cares about that future source of terrorism. Muslims are American pets. 2. How come that nobody asked WHAT THE US ARMY DID IN BOSNIA? As far as I know, America wasn't a part of the war??? How come that they fought at the side of MUSLIMS??? Even if they were part of the peace corp (which is NOT THE CASE), they didn't have a mandate to fight Serbs. And, in the film, they EXECUTE Serbian 'war criminals', they shoot them in the head, while they are kneeling in front of them? WHAT? So, this is the confession and proof that the USA WERE ON THE SIDE OF MUSLIMS. British general Rose, who was a peace core member, says that British SAS units (??? what did they do in Bosnia???) killed some Serbian patrol in 5 seconds. And he was bragging how he fought Serbs, instead to keep peace and be objective, not to fight any side. 3. I am really tired of accusations that Serbs killed other nations, and that other nation were just victims. There are war crimes at ALL SIDES. But Hollywood and the West sees only Serbian crimes. How come it doesn't remember that Mujahedins, the member of 'El Mujahedin', cut Serbian heads by swords?? That Muslims had so many camps for Serbs? That even so poor citizens of Srebrenica killed many Serbs in that Srebrenica and the other villages near Srebrenica and they were Serbs? And nobody was convicted for that? Hello! Did you hear this Mr. Morgan Freeman?\n\nMovie is dull. Movie is full of unnecessary violence, and they take turns who will held bigger gun and had the power over the other one. C\n\nConclusion. LIVE US ALONE! Serbs are not the only one who made war crimes, jerks! LIVE US ALONE. And you ask us why we love Russian? That's why. They consider us as a normal people. Not as the animals."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "haidarkanaan",
        "review_rating": "7",
        "review_title": "I Can't get the bad reviews",
        "review_detailed_main": "first of all the location and the background scene were amazing.. tow legends..and great plot.. i enjoyed every second of this movie.. those people who search for real history they can go and watch National Geographic or some sh* like that.. this is a movie with a plot and it's own vision of war"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "biscotte61",
        "review_rating": "2",
        "review_title": "Morality war story becomes \"excuse\" to show extreme violence",
        "review_detailed_main": "De Niro plays an aging Bosnian war vet who chose to live the life or a recluse. In comes Travolta who plays a tormented Bosnian vet, traveling to the us in search of De Niro to settle an old score.\n\nWhat follows is a cat and mouse game between both men, with no holds barred.\n\nThe producers didn't shy away to show explicit violence, sadism and even torture.The script made it difficult to draw the line between good and evil and leaves all to the viewers own imagination.\n\nAs usual De Niro is good, but he should stick to comedy films, once he started that. Travolta is surprisingly convincing as the Bosnian vet and almost impossible to recognize him during his first scenes.\n\nIs this a war movie ? No. A morality film ? No. Then what is it ? Well in my opinion it was an excuse to show explicit violence because that's what it's mainly about, meaning: who can inflict the most painful wounds ?\n\nIs this a movie to recommend ? Not in my opinion, unless you kick on torture scenes. Both actors deserved a better script, although both do their best in giving a believable performance but had to face a crummy and thin script.\n\nTo put SOME humanity in the story, there is little subplot involving the baptism of De Niro's grandson, whom he never saw before, but has no intention of attending.\n\nThe end is unsatisfying and incoherent. This could have been a winner if it had a strong script."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "gpsychos2",
        "review_rating": "8",
        "review_title": "Cmon ppl NOT BAD as all these ppl want you to believe. Low 8 in my opinion & entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "\"Don't Take Your Prejudice To The Movie, Son!\" ♦ 59%",
        "review_detailed_main": "Three times I dissolved with pain into the characters on-screen. And there is where Steven Johnson scores brownie points. I loved watching Robert De Niro & John Travolta as they pull off their bumptious characters with ease, not to mention the latter's accent.\n\nTalking about the Bosnian-Serbian war (of which this is the first movie I watched; don't know if there ARE any movies made on), the revenge factor is taken to a new level. The ire the characters have is justified, but every time the plot stretches to reach their so-called karmic summit, it turns you off. But the next sequence is both predictable & stunning, forcing me to rate a humble 5.9.\n\nMusic is fine, so is the cinematography. A joke in the script which one of the lead characters doesn't understand, truly sparks the message of this action film based on post-war depression & desolation. Respite from implications, it causes bewilderment.\n\nAtheists may love this movie, but driven by a Johnny Cash single, Killing Season is, if not highly, recommended. The action sequences are very well carved into the locations. Humor sustains in the first half while the second half comes pouring down. It spills its guts.\n\nBOTTOM LINE: A very watchable movie. And if you don't wanna miss the pair on-screen for the first time and a pretty commendable action film, go for it.\n\nCan be watched with a typical Indian family? YES\n\nProfanity: Strong | Nudity/Foreplay: No | Sex: Implied; No Visuals | Violence/Gore: Infinity | Smoking: No | Alcohol: Strong | Porn: No | Drugs: No"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jacabiya",
        "review_rating": "1",
        "review_title": "Didn't expect the river",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "over-13829",
        "review_rating": "4",
        "review_title": "Poor quality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "An Arrow Through the Head is Perhaps More Entertaining Than This Picture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "DON'T TAKE YOUR GUNS TO TOWN, SON.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "5",
        "review_title": "Hair-rising and violent manhunt with two terrific actors : Robert De Niro and John Travolta",
        "review_detailed_main": "In 1992 , the Servian Army invaded neighboring Bosnia , starting a war marked by large-scale massacres of civilians in the name of ethnic cleansing. More than 200.000 people died in the genocide , the most in any European conflict since World War II. In 1995 , American military forces and their NATO allies finally intervened , launching Operation Deliberate Force. Some years later , it is when the story begins, our starring Ford (Robert De Niro) has retreated to a remote cabin in the woods, trying to escape painful memories of war. The drama begins when Kovac (John Travolta) , a former Serbian soldier, seeks Ford out, hoping to settle an old score. The two veterans of the Bosnian War, one American, one Serbian, find their unlikely friendship tested when one of them reveals their true intentions. Both of whom clash in the Appalachian Mountain wilderness.\n\n¨Killing Season¨ tells the story of two veterans of the Bosnian War, one American, one Serbian, concerning a strong battle of wits and physical force between two tough protagonists , both of them holed up in the wet and tangled wilderness of Appalachian mountains , as the outdoors are frankly spectacular , the landscapes have been filmed in natural parks .What follows is a cat-and-mouse game in which Ford and Kovac fight their own personal World War III, with battles both physical and psychological. By the end of the film, old wounds are opened, suppressed memories are drawn to the surface and long-hidden secrets about both Ford and Kovac are revealed, eventually both of whom share a dramatic bond from the past that is unbreakable . Duo starrring with two awesome heavyweights actors playing ex-soldiers suffering dark nightmares from the past are pretty good , though their performances are inferior than other previous films . Robert De Niro gives a passable acting in his usual style as Ford , a former American soldier who is plagued by sinister memories when he fought on the front lines in Bosnia. And John Travolta is enormous as the two-fisted Servian soldier who survived an execution eighteen years before, and nowadays he seeks for vengeance .\n\nIt packs a suspenseful and stirring musical score by Christopher Young , a good composer expert on thrilling and terrifying atmosphere . Colorful and adequate cinematography by great cameraman Peter Menzies Jr. , shot on location in filming locations from Mountain City, Georgia, Stone Mountain , Tallulah Falls, Georgia, USA , Sofia, Bulgaria , and Nu Boyana Film Studios, Sofia, Bulgaria . The motion picture was professionally directed by Mark Steven Johnson , though it has several flaws , gaps and failures . Mark Steven is an American film director, screenwriter and producer. A Fine craftsman who's known for writing and directing the hit Marvel films \"Daredevil\" and \"Ghost Rider\" as well as writing ¨Elektra¨, \"Grumpy Old Men\" and its successful sequel \"Grumpier Old Men.\" Later on , Johnson made ¨Finding Steve McQueen¨ (2019) , Love Guaranteed (2020) and recently wrote, directed and produced \"Love in the Villa\" (2022) for Netflix. Johnson frequently makes films where the main characters are deranged or lonely people , and usually their parents are either absentee or dead. The father in Jack Frost (1998) comes back to life as a snowman ; in Simon Birch (1998), Joe's mother dies without telling him the identity of his father; in Daredevil (2003), Matt's father is killed by gangsters, and his mother is absentee. Rating : 5.5/10 . Only for Robert De Niro and John Travolta fans."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ThousandDetails",
        "review_rating": "6",
        "review_title": "Promising Open Season, Unreconcilable Closing Season",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "5",
        "review_title": "It was a movie that could have been good",
        "review_detailed_main": "I watched it on the recommendation of a friend. It was a movie that could have been good, but they failed.\n\nEven Robert couldn't save the movie."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ksgillihan",
        "review_rating": "6",
        "review_title": "It's really not that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Slow moving and doesn't go anywhere",
        "review_detailed_main": "Apparently based on true events of a past war. Killing Season sees Robert DeNiro and John Travolta seemingly playing cat and mouse with one another in this very slow paced heavy dialogue driven drama. It starts off somewhat interesting simply to see what's going to occur but ultimately quite predictable. Once we see Travolta in the woods near DeNiro and they strike up a conversation we get the sense that Travolta knows everything about DeNiro and he's simply waiting for the right moment to strike.\n\nThere were many different points where each character simply could have killed one another but they both ultimately decide not too. After a while all these teases simply got boring. In the end this isn't a memorable film and is lacking."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "pescarulpagubas",
        "review_rating": "10",
        "review_title": "This film is brilliant",
        "review_detailed_main": "This is a brilliant display of cinema art . I mean ... you need only to open your eyes in front of the screen and the rest will come . John Travolta is very believable in the role of a Serbian soldier . He is an amazingly good actor even though some people put him down for no good reason . I've red some reviews before writing this one and I honestly don't care about people that put this craftsmanship down . The movie doesn't need to be perfect . The movie was not made for serbians ... it was made for people all over the world . And those people don't care less about how perfect is John's Serbian . So go watch the movie and thank me later ! :)"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jormatuominen",
        "review_rating": "7",
        "review_title": "Face-Off Of Two War Veterans",
        "review_detailed_main": "Killing Season is not one of de Niro´s or Travoltas more memorable films, nor is it very original. The film kicks off with an American IFOR unit catching a Bosnian Serb death squad red-handed after an atrocity and summarily executing the serbs. A very late date is given in the film, October 1995, so the incident is completely imaginary as many have pointed out. I don´t see how this could possibly matter, though. This is not a film about the Bosnian war at all. This is a film about war in general, and the backdrop could be any war. The main body of the film takes place in the present and in the U.S.A. A former adversary comes to face off a troubled former American soldier after some cat and mouse play. As in the similar but much better film Shot Through The Heart (1998) both players are looking for a closure to their agonies rather than simple revenge. In that film the adversaries were snipers from the actual Bosnian war. Another related film would be the Estonian film Mandarines (2013) about the Russo-Georgian war of 2008. De Niro´s and Travolta´s characters fight it out in the woods in pretty much classic Rambo mode, but to make things more interesting they also exchange a lot of dialogue that explores their psychological traumas, similarities and differences. The pain they inflict on each other is an extension of the pain they can´t get rid of after the war. The point of the film is one to take seriously: you can´t expect to go to war and come back the same. Here it is made by world class actors in a beautiful natural forest setting. Worth watching before you go ethnic cleansing or decide to attack a foreign country."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "bokybkc",
        "review_rating": "2",
        "review_title": "Bad movie",
        "review_detailed_main": "As person who grew up in that area and knowing what really happened in that period of time can say that historical facts accuracy of this movie is 1/10. Completely wrong presentation of Bosnian War and situation during 90s.\n\nActing was poor because John Travolta has strong Russian accent not even close to Serbian. Also, he looks like Muslim from Bosnia with this beard, not even reminding on Croatians or Serbians. It is worth to mention that Emil Kovac is not Serbian name orcsurname too. DeNiro looks like guy who was interested only in paycheck. Movie story is confusing, not clearly stating that Serbians and Croatians are Christians and Bosniaks are Muslims. All together, 2/10 is more than enough."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ten-thousand-marbles",
        "review_rating": "4",
        "review_title": "Just silly. One of DeNiro's worst movies",
        "review_detailed_main": "The visuals and cinematography are quite good but do not a movie make. Travolta's performance and accent (it comes and goes) are laughable. The ways the two main characters trade off having the upper hand are absurd. The ending is ridiculous. Add a bad script to all this and you have a hard pass."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "searchanddestroy-1",
        "review_rating": "",
        "review_title": "Disappointing at the most, but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "LeonLouisRicci",
        "review_rating": "6",
        "review_title": "Major Missteps\u0085Midland Movie",
        "review_detailed_main": "Among its Many Missteps the most Obvious is Deciding to use a Backstory of a Recent Bloody Incomprehensible Slaughter that is not Easily Sorted Out even by Learned Types. What's the Point of Drawing all that to the Surface in a Small Movie that is Basically a One on One Survival of the Fittest Revenge Romp in the Wilderness.\n\nThis Film does not have the Makings to try and Fetter out all the Nuances of that Recent Conflict. it Requires, much to the Movie's Detriment, Background Details, Accents, and Motivations that can Never be Made Clear and Acceptable in this Type of Undertaking. It should have been Delivered as a Nifty Little Battle with Two Super-Star Actors left too it.\n\nSo Beneath all the Ridiculous Attempts at Deep Motivations and Political Posturing there Remains a Mediocre, Familiar Movie with some Fine Scenery and Back and Forth Gotchas. It does Rather Ping Pong in a Contrived Catch and Escape for its Short Running Time to the Point of Predictability.\n\nBut all that Aside, it's not a Bad Movie, just too much Packaging that in the End makes it Less Enjoyable than it could have been. Worth a Watch but is Somewhat Disappointing."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "AsMiR11",
        "review_rating": "2",
        "review_title": "The end is the only good thing about this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "tffny-spann",
        "review_rating": "7",
        "review_title": "John Travolta's is taking a new acting approach",
        "review_detailed_main": "First let me say John Travolta's new bald hair is very secure and gives him a whole new approach to his acting career.\n\nI seen that in this movie! I see. He played well as a ethnic Eastern European soldier with a old grudge!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "caggianogabe",
        "review_rating": "2",
        "review_title": "Like John Shea's \" Grey Lady\" with PTSD",
        "review_detailed_main": "De Niro has long been the master of the pregnant pause scowl as a means to telegraph an insightful comment. It is overdone here. In \" Grey Lady\", Eric Dane walks through the Hellscape of his own traumatized psyche while trying make sense of his life on Nantucket. Is Serbia much different ? Is anywhere when memories of human cruelty do not dissipate over time? John Shea should have had the Travolta role."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "peterp-450-298716",
        "review_rating": "6",
        "review_title": "A meaningless mainstream film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mark.waltz",
        "review_rating": "4",
        "review_title": "It's their war, not ours.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "cyndolman",
        "review_rating": "8",
        "review_title": "Enjoyed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "bowmanblue",
        "review_rating": "6",
        "review_title": "How to nearly kill people",
        "review_detailed_main": "When I heard there was a film on DVD that starred both Robert DeNiro and John Travolta, I kind of wondered how I'd missed its theatrical release in the cinema. Well, now I've watched it, I can sort of see why.\n\nIt's not bad. It's just not that good. It has all the feel of a B-movie that has somehow landed itself a couple of A-list actors to star in it.\n\nIt starts in the nineties where Robert DeNiro was a U.S. military commander in Eastern Europe. During his service time he was responsible for the (illegal) deaths of a squad of war criminals. Only he didn't kill John Travolta enough and now, several years later, he's tracked DeNiro down to his idyllic mountain cabin in the woods and is out for deadly revenge.\n\nWhat follows is the ultimate 'cat and mouse' chase. And it lasts for about an hour and a half. However, the film's major let-down is the fact that, once it becomes clear that each man wants and has to kill the other in order to survive, it leaves the viewer a little annoyed when they just don't bother. The balance of power shifts between the two so often that they take it in turns to have the upper hand, yet never bother actually killing the other. Yes, I know the film would be over at about the twenty minute mark if one of them bothered to 'off' the other, but it just became a little frustrating after the eighth time one had the other at his mercy, but decided to talk instead of kill.\n\nPlus DeNiro had Travolta's accent to worry about – sometimes it sounded like he was being stalked by Sacha Baron Cohen's 'Borat' character! But it's not all bad. Accent or no accent, both actors are pretty good (as you'd expect with such A-list weight on board). Plus there are some pretty sadistic moments of gore than really will leave you a little squeamish.\n\nBut, at the end of the day, it's basically one on one and you only really have to skip to the final chapter of the DVD to find out who ultimately comes out on top.\n\nOne for fans of DeNiro/Travolta only, as they do turn in decent enough performances, only the story (or lack of) does tend to let it down a bit and reduce what could have been a classic film into a glorified B-movie."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "saptesh786",
        "review_rating": "5",
        "review_title": "Cat and mouse chase with fight.",
        "review_detailed_main": "Movie theme online on based of chase and fight between two former war fighters. Story has not either sub plots then it seems trailing only repitative chasing and fights. Some brutal injury scenes may bother someone. Plus point is known actors. Robert De Nero did good acting and perfect for his role. Travolta had not much scope so he didn't impress. Once time watchable only for those star actors and not for story content."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jelenasadzak",
        "review_rating": "1",
        "review_title": "Omg",
        "review_detailed_main": "First of all Emil Is not Serbian name Is muslim name. Second beard that Travolta Has Is vehabia beard Serbs dont have that kind of beard. Third Serbs did not attack Bosnian ... Bosnia Has 3 nations, Serb, Croatian and Muslims, they both want to Make genocide on Serbian people so we defend Our Self not to be genocide. So Servis From Bosnia defend the selves. Get that???! Stupid movie, bad acting and after this movie i wont ever want to see Niro and travolta in Any movie. Shame on u and all of your lies. But karma makes wonders so director and writer From this movie full off lies should now that."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "hillca10",
        "review_rating": "",
        "review_title": "B-movie acting in a D-movie plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Hellmant",
        "review_rating": "6",
        "review_title": "Travolta is just such a bad actor but still the movie is worth seeing.",
        "review_detailed_main": "'KILLING SEASON': Three Stars (Out of Five)\n\nRobert De Niro and John Travolta appear on-screen together, for the very first time, in this action thriller directed by Mark Steven Johnson. Johnson has written and directed such critically acclaimed (and fanboy loved) comic book superhero movies as 'GHOST RIDER' and 'DAREDEVIL' (can you detect my sarcasm?). It was written by Evan Daugherty (who also co-wrote the updated fairytale retelling of 'SNOW WHITE AND THE HUNTSMAN' as well as the upcoming youth book and comic book film adaptations of 'DIVERGENT' and 'TEENAGE MUTANT NINJA TURTLES'). Daugherty's script won the 2008 Script Pipeline Screen writing Competition and was heavily sought after (by film producers) because of this. It tells the story of two Bosnian War vets who engage in a violent personal battle, in the woods, when one reveals his plans for revenge against the other (due to a conflict during the war). Despite all it's grade A ingredients the film was panned by critics, most criticized was John Travolta's performance (and the accent he uses). While I agree with the critics about Travolta I did still enjoy the film.\n\nDe Niro plays a former colonel of the American military (and NATO soldier) named Benjamin Ford. He's a veteran of the Bosnian War who now lives alone, in seclusion, in a cabin in the Appalachian wilderness. He's tried to forget his violent past and doesn't see or talk to anyone, including his son (Milo Ventimiglia) and newborn grandson. Emil Kovac (Travolta) is a veteran of the Bosnian War as well, but he fought for Serbia as a Scorpions soldier. Kovac holds a grudge against Ford for something that happened to him during the war (18 years earlier) and has tracked his whereabouts to his current location in the mountains. He poses as a tourist and gets to know Benjamin first before then revealing his real reason for being there. A vicious one on one war ensues.\n\nI found both lead characters to be very interesting and compelling. Their backstory is intriguing and the in-depth look at war (specifically the crimes of the Bosnian War) is very involving. De Niro is very good and likable as the American vet. Travolta's character is written well too but his performance is kind of laughable. The accent is pretty bad and he just comes across as very cartoonish. Other than Travolta though I had no real problems with the film. The action is great (and very intense) and Johnson's directing is perfectly fitting for it. Daugherty did deliver an intelligent and well written script as well and you'd think De Niro and Travolta on-screen together would be one of the strong selling points of the movie too but Travolta is just such a bad actor (at least these days). He used to be a good actor in his past though. Still the movie is worth seeing (in my opinion).\n\nWatch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=UV24sbHK5H0"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "moviexclusive",
        "review_rating": "3",
        "review_title": "Less an iconic matchup of two acting veterans than a potential career-killing misfire, you'd be advised to stay away from this suspense-free action thriller",
        "review_detailed_main": "'Killing Season' marks the first time that Robert De Niro and John Travolta are sharing the screen, and especially for those born in the baby-boomer generation for whom either actor are icons, that matchup might be reason alone to catch this thriller. Yet it is precisely because of such anticipation that we urge you to stay far away from this one, for not only is the film one of the biggest missed opportunities, it is also a reprehensibly bad film in itself, and nothing but an utter embarrassment to both of the veterans' acting careers.\n\nEssentially a mano-a-mano setup in the Appalachian mountains, De Niro plays a United States military veteran who is paid an unexpected visit by Travolta's bitter Serbian soldier eighteen years after the end of the Bosnian war. The latter was shot in the back and left for dead by the former back then, and has waited this long to track down his executioner to settle the grudge. As we find out later, Travolta isn't simply out to kill De Niro; rather, he's found God in the years since, and wants his slaughterer to make a true and honest confession.\n\nYes, God is referenced from time to time throughout their cat-and-mouse game, and then invoked repeatedly with the weight of a sledgehammer in the anti-climactic ending which unfolds too conveniently in an abandoned church right smack in the middle of the forest. There's no such thing as subtlety here - not even with its art-house pretensions - and indeed, it's plainly obvious that the religious references are no more than a cheap narrative device to drag out a thinly plotted script.\n\nWhat's more maddening is how it is used to justify the gory interludes in between the hunt - and we might as well warn you that it does get pretty graphic. When Travolta first catches up with De Niro after shooting an arrow through his right calf, he forces the latter to thead a steel rod through and then proceeds to string him upside down. And then as payback, De Niro shoots an arrow that pierces through both of Travolta's cheeks and pins him to a cabin door - not to mention waterboarding him after with heavily salted lemonade.\n\nThe torture is gratuitous to say the least, and thoroughly vexing when executed in the name of guilt, redemption and other philosophising about God. It would have been much more gratifying if writer Evan Daugherty had simply settled for a straightforward action movie between two equally matched foes pitted against each other by circumstance - and yet even on that count, there is little remotely intelligent about the chase that ensues, which ultimately descends into a catch-and-release repetition that is just tedious.\n\nOne can see that boredom written on De Niro's face, who looks miserable and tired most of the time; especially in recent years, the respectable actor has taken on a number of questionable projects that seem only in the service of a paycheck, and this is unequivocally one of those. Well, at least Travolta seems to get a kick out of an over-the-top performance complete with a shaved head and a bizarre Eastern European accent - but though it's a darker role than his usual, he's played bad much better before in Tony Scott's 'Taking of Pelham 123'.\n\nIt remains a mystery therefore why two actors of such calibre would sign on for such a dreadful movie, so lacking in any suspense or excitement no thanks in part too by Mark Steven Johnson's workmanlike direction. What it does manage to hit on the mark are the reputations of De Niro and Travolta, more so given how heavily the movie is marketed on their marquee names. And so consider this a well-intentioned advice for both of their fans - stay away from this stinker, or risk having your love for either one killed by this terrible misfire.\n\n-www.moviexclusive.com"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "lmgaland",
        "review_rating": "7",
        "review_title": "Decent",
        "review_detailed_main": "If you can stand Travolta's horrible accent this is a good movie 7.5/10. If you can't its more like a 5/10. It all depends"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "trublu215",
        "review_rating": "2",
        "review_title": "Just a complete mess",
        "review_detailed_main": "When somebody tells you that John Travolta and Robert De Niro are starring in a film like Killing Season, its hard for a fan to not get excited...then you actually sit down and watch the film. The first ten minutes of Killing Season is so painfully contrived and pretentious that you can't help but feel like the rest of the movie is going to be an absolute bomb...and if you feel like that then you are one hundred percent right. Killing Season is a mere direct-to-video film that could have really been something but instead it relishes in contrived moments between Travolta and De Niro that are so tongue in cheek that you can't really take it seriously, despite the film's intention. De Niro does the best with what he is given and, trust me, it isn't much to go off of. Travolta delivers the worst Russian accent I've ever seen on screen and that affects the rest of his performance because it is so campy and ridiculous that you just can't take him seriously, especially as the antagonist of the film. It is very hard to swallow.\n\nThe fact that this film is direct-to-video and is extremely mindless does not bother me, what does bother me is the action sequences. We have De Niro and Travolta, both of whom are in their sixties, and they are beating the living snot out of one another along with torturing one another for the better part of an hour and a half running time. This isn't The Expendables where you would expect this type of stuff, this is a film that is supposedly wants the audience to be set in a sense of reality and Killing Season represents none of that. In fact, it does not even acknowledge what it starts. By the end of it all, we're left with something so wrong, so bitter and so stupid that you can't help but want to kick your TV in."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "KubrickDelarge",
        "review_rating": "3",
        "review_title": "Another pay cheque performance for Mr. De Niro?",
        "review_detailed_main": "Well I really don't know what I expected from this movie at all but I know that it was worse than I expected. I don't know what was harder to get through: Travolta's \"accent\" or the storyline as a whole.\n\nI was cringing when I watched the trailer for this back when it was still not out yet because these two just don't fit their roles. I absolutely adore Mr. De Niro but I don't know why he just isn't trying anymore with his role selection. Mr. Travolta hasn't really disappointed me because I haven't LOVED many of his performances. In the beginning, I wasn't sure how bad this would eventually end up being (although based on how little character development there is I should have suspected) and even though the synopsis gave me an idea of how awful it would be - I carried on.\n\nWithout going into spoiler territory, I can say that right from the beginning I knew exactly where it was going and how it would end. And boy was I right! (not a celebratory moment)\n\nMy final verdict is basically that I just feel sad watching De Niro commit his time and talent to these types of movies. I wish he would go back to doing well worth it films where the story isn't written by Evan Daugherty - whose credits are: Snow White and The Huntsman (utter sh*t, I mean, KRISTEN STEWART IS IN IT) and G.I. Joe 3 (no, not even the first one... which was sh*t, too)"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "CowherPowerForever",
        "review_rating": "8",
        "review_title": "Don't take your guns to town son. Leave your guns at home Bill. Don't take your guns to town",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "KarenSantaFe",
        "review_rating": "2",
        "review_title": "Ugh.",
        "review_detailed_main": "I gave this two stars, because the camera work is actually good, and Travolta and De Niro are greats in their own right.\n\nAlso, the landscape really is beautiful, not sure where it was shot, but it's set in the Appalachian Mountains, so somewhere in that region?\n\nBut what a stinker of a movie, filled with gratuitous violence, and downright idiotic script....\n\nMaybe things went south in the editing bay, I don't know.\n\nIt's sad to see these great actors in such a cinematic and artistic failure.\n\nSave your money, and more importantly, save your time!\n\nOh, more lines of text to say it's awful? OK. It's awful. Awful. Awful."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "albrechtcm",
        "review_rating": "4",
        "review_title": "Pretty corny.",
        "review_detailed_main": "Robert De Niro was living alone in self-imposed exile. I'm sure the average adult and adulteress got the picture immediately, but just in case, the director spend a good five minutes drilling that into our heads. From that moment on, everything went as predictably as possible: Mr. De Niro's son trying fruitlessly to connect during the arrival of John Travolta who sounded like a Russian tourist guide who got lost in the wilderness. It's understandable that a man like Travolta might harbor a long-lived grudge against Mr. De Niro, but other than that we have a film about a war that obviously wasn't researched and even before the film started, the outcome was inevitable. Someone once said a good story should have an ending that's a surprise, yet inevitable. This one had no surprise. On the other hand, the chemistry of love — well, make that chemistry of like a little bit/hate between the two actors was pretty good and the scenery and photography was beautiful. Actors like this sort of film because they (a) get lots of screen time and (b) they get to emote, but a better story line wouldn't have hurt either. Overall, okay for a buck twenty at Redbox, but not a penny more."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "electronicsspa",
        "review_rating": "5",
        "review_title": "It is what it is.",
        "review_detailed_main": "I don't go into a Travolta movie for the depth. Same with De Niro (at least not nowadays). In an age where Tom Cruise and Brad Pitt are allowed to play themselves in every movie they make, I tend to cut actors who try some slack. Johnnie Boy tried, and he failed. His accent is insulting, but at least he tried.\n\nI gave this a five because, despite the fact that Travolta phoned in his accent, the movie entertained me. I didn't want my money back, nor did I scream to the heavens about how I needed my wasted time back. The film held my interest and provided an escape. That's all I wanted.\n\nFive outta ten."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "rgblakey",
        "review_rating": "4",
        "review_title": "The hunt is on between DeNiro and Travolta in Killing Season",
        "review_detailed_main": "There are a lot of movies that come straight to video that feature A-list actors, but for some reason they bypass the theater. More often than not it's pretty obvious why, but some of them are actually pretty entertaining for what they are. The latest Killing Season features Robert DeNiro and John Travolta in a revenge action thriller, but could these two aging stars deliver or will it be quickly obvious why the hunt ended on the shelf?\n\nKilling Season follows a reclusive American military veteran and a European tourist who strike up an unlikely friendship deep in the Appalachian mountains. But when the tourist's true intentions come to light, what follows is a tense battle across some of America's most forbidding landscape proving the old adage: the purest form of war is one-on-one. The story here is pretty simple and works fine for what they are going for despite some lacking historical accuracy in its backstory. DeNiro gives a decent enough performance but never really seems to put forth the ability that we all know he has. He seems to phone it in a bit just giving enough to make it work as opposed making it effective. Travolta does fine and has become king of getting visually into character, but despite a valiant effort his accent throughout the film along with the sometimes silly dialogue makes his performance a bit of a distraction. The opening of the film sets a bad tone as it looks like some low budget straight to TV film, but once you get passed the long drawn out slow paced attempt at character development things pick up a bit. If you can let those things go and just focus on the deadly revenge hunt that makes up the second half of the film it's not all that bad. They never step it into unbelievable territory, but instead allow each of them to have their moments making for some pretty fun old school action. At this point in the film these guys seem to wake up a bit and started having a good time.\n\nThis is far from a perfect film, but for a rental it's really not all that bad. It's a far cry from their past work and hopefully not the end, but it does manage to entertain despite its numerous flaws. The ending is a bit of a disappointment, but attempts to give these characters the redemption they are trying to find, but after everything prior you are wanting so much more. If you like either of these guys and most people do, give this film a chance and just watch it for what it is as opposed to what you hope it to be."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "shawneofthedead",
        "review_rating": "4",
        "review_title": "A strange, occasionally potent mix of torture porn and action thriller, just barely salvaged by but hardly worthy of its stars.",
        "review_detailed_main": "Looking through Robert De Niro's recent filmography is a rather disheartening process. In the past decade or so, he's soldiered his way through over-ripe dramas, unfunny comedies and pedestrian thrillers, with a gem of a film popping up every once in a while as reward for his efforts. One of the grand old men of Hollywood seems deeply intent on working as much as possible, even while the industry that once made full and glorious use of his prodigious talents no longer has any idea what to do with him. It's a shame – and a trend that isn't, sadly, bucked with Killing Season, an odd revenge drama that flits uncomfortably between the genres of action thriller, horror movie and torture porn.\n\nMany years after the Bosnian War, American military vet Benjamin Ford (De Niro) has retreated with his scars – of the physical and psychological variety – to a remote mountain cabin, hiding away from humanity in general and his loving son Chris (Milo Ventimiglia) specifically. Unexpectedly, he makes his first real human connection in a long time with Emil Kovacs (John Travolta), a garrulous ex-Serbian soldier he meets – seemingly by chance – in the woods. But it soon becomes clear to Ford that his new acquaintance harbours war wounds too: including a bitterly personal desire for revenge that can only be slaked in a hunting season of his own devising.\n\nThere's a germ of a great psychological drama buried beneath the troubling trappings of Killing Season. Both De Niro and Travolta rip into their roles with impressive levels of commitment: the former constructing a tough-as-nails exterior around a credibly vulnerable man riddled with the doubts and guilt of war, the latter somehow working his way around a thick European accent to lend an air of puzzling charisma to a character with deeply unsympathetic, sociopathic tendencies. It's largely because of their efforts that the film is strangely effective in its quieter moments.\n\nUnfortunately, those are few and far between. Evan Daugherty's script is concerned less with mining emotional drama and more with ramping up the film's action beats and ludicrously dark twists. To that end, Killing Season seems to almost revel in the physical pain and suffering it doles out to both Ford and Kovacs. This is not so much the action-thriller version of movies about post-traumatic stress disorder or battle fatigue, like The Hurt Locker, instead bringing to mind the brutally banal, horrifyingly pointless torture porn that forms the premise of the Saw franchise.\n\nTry as they might, neither De Niro nor Travolta can save a film that doesn't really know what it's trying to be. It takes one too many detours down the torture-porn route to be a truly effective psychological drama, and lacks any of the bite and wit required to lift it out of its more melodramatic moments. At one point, Killing Season was intended as a vehicle to reunite Travolta with Nicolas Cage for the first time since their barmy action smash-hit Face/Off. It says something unspeakably tragic about the final product – and De Niro's ongoing downward career trajectory – that the resulting film might actually have been better if it had stayed that course."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Brewstie2",
        "review_rating": "9",
        "review_title": "I enjoyed the movie.",
        "review_detailed_main": "I liked the movie, very much. It seems like it might be slow initially, however, I found the characters internal emotions came across on screen. It is interesting to apply how one's emotions affect all aspects of our lives throughout our lives. The beautiful peaceful scenery at times was warming. I read many hateful reviews. I found simplicity in the movie and the complexity of one's internal emotions and feelings very compelling. I felt the film was more about relationships than war. I found the bond between the two main characters entertaining. I do not think one was more powerful than the other. I found it to be an excellent balance of film presence between to seasoned actors."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "sanel-babic",
        "review_rating": "1",
        "review_title": "Don't watch",
        "review_detailed_main": "This movie had as much to do with Bosnia, as Hitler with modeling. Plot is awful. No basis in truth... except displaying Serbs as morbid killers.\n\nThis movie had as much to do with Bosnia, as Hitler with modeling. Plot is awful. No basis in truth... except displaying Serbs as morbid killers.\n\nThis movie had as much to do with Bosnia, as Hitler with modeling. Plot is awful. No basis in truth... except displaying Serbs as morbid killers.\n\nThis movie had as much to do with Bosnia, as Hitler with modeling. Plot is awful. No basis in truth... except displaying Serbs as morbid killers.\n\nThis movie had as much to do with Bosnia, as Hitler with modeling. Plot is awful. No basis in truth... except displaying Serbs as morbid killers."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "missmomosa",
        "review_rating": "3",
        "review_title": "What in hell.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "longest71",
        "review_rating": "3",
        "review_title": "boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Fun-Gus",
        "review_rating": "2",
        "review_title": "You have got to be kidding me",
        "review_detailed_main": "I quit watching at 8 minutes and 39 seconds because when I started watching this movie then saw the goofy looking Travota, who just makes my skin crawl, then out comes De Niro walking in the woods, finds some Elk hair bunched up in a tree branch, just like someone crammed it in there, not an elk. He then makes an elaborate blind from branches and pine boughs in a matter of minutes right out in the open. No sooner than he crawls inside two majestic Elk top the ridge in front of him as he gets his camera out. The Elk start to spar until De Niro winces in pain from a, more than likely, war wound sending the Elk running off. I had it, no more of this fake everything. Travolta can't act to save his life and De Niro has given up even trying to act. Put that together with the over the top obvious fake everything and I guess someone had money to just trow away, because that's what happened here with the train wreck at the beginning of the movie. Wow!!!!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ivana-savic0",
        "review_rating": "1",
        "review_title": "Are they kidding us?!",
        "review_detailed_main": "Did they really think that from lies and garbage an art can be created?! No, my dear all, it's not happening like that. This movie ruined my night, my impression about two great actors (I don't want to see them anymore) and tried to ruin the truth... but, it's not possible, thanks to God. Wait for what you deserve."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "stevehorvath59-515-490534",
        "review_rating": "9",
        "review_title": "Seems an enjoyable film with actions and retrospects to humanity.",
        "review_detailed_main": "I have not seen this movie yet, but from the previews I could have told you that there were stimulating pieces for the senses on both sides of the borders. For those who do not suspend their disbelief while viewing a motion picture, this is a waste of their time! One must suspend disbelief to connect with any character in any movie, may it be bad or good. If one does not suspend their disbelief, then the movie watching experience is a total loss, which explains the many negative reviews attested here for this feature, and others before now and for many others to come in future productions! I could go on about the idiotic Terminator Movies of the late 1980s that were originally made in the nineteen seventies, and how ridiculous those movies were, everyone believed a walking Robot killing machine in our midst in this Century. That is a good example of suspending your disbelief that should apply to any movie watching experience for YOU to enjoy!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "tray-9",
        "review_rating": "3",
        "review_title": "Very Sad. Just...... Sad.",
        "review_detailed_main": "Kudos to Robert Deniro as being one of the busiest actors ever. (Heck if I was an actor I would be very proud to be in as many movies as he's been in.)\n\nI guess, unfortunately, the downside to that, is that every once in a while you're going to end up in some horrible movies. This is definitely one of them.\n\nIMO Travolta hasn't been in anything good since Grease or Saturday Night Fever. So I'm not surprised to see him doing yet another horrible acting job with a horribly fake accent.\n\nI just can't believe that 1 great actor (Deniro), and one crappy actor (Revolta) would agree to participate in a movie with ZERO story, zero plot, zero interest.\n\nI watched this movie for FREE via the XBOX. I thought, \"what a cool deal\". Now I totally understand why this movie was free.\n\nI was the one who got ripped off."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "RevRonster",
        "review_rating": "4",
        "review_title": "One thing kills \"Killing Season\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "tvmovienews",
        "review_rating": "5",
        "review_title": "Killing Season",
        "review_detailed_main": "Killing Season is an action/thriller directed by Mark Steven Johnson (Ghost Rider) which stars Robert De Niro, John Travolta and Milo Ventimiglia. It follows two veterans of the Bosnian War, an American named Benjamin (De Niro) and a Serbian named Emil (Travolta). After Emil helps Benjamin out with some car trouble, he is invited back to Benjamin's cabin in the woods for drinks to say 'thanks'. The friendship however turns stale after one of them reveals their true intentions, and it quickly becomes a case of 'cat and mouse'. Robert De Niro is one of my favourite actors of all time, so it was great to see him back in a more serious role compared to the light and fluffy films he has become accustom to in his later years. Travolta's transformation into a Serbian is partially convincing due to his dark complexion and the thick beard he has grown for the role, but his accent seems a little shaky at times. While this isn't an amazing film and it has received some fairly negative reviews due to its inaccuracies in relation to the Bosnian War, I think its main intentions were to focus on the duel between both men and how the war has effected each man's personal life. I thought it was entertaining enough, but probably won't watch it again anytime soon.\n\nMy Rating: 5.5/10 For more Movie and TV News, Reviews and Rumours go to: www.facebook.com/tvmovienews"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "axismladen",
        "review_rating": "3",
        "review_title": "Unconvincing and dull, at least for someone whose country's been part of the war.",
        "review_detailed_main": "Summary says it all. If you're someone whose actually been affected by the war, it's just not convincing. The movie is really, no offense, it's not intended, American. It's like every other 'wanna be serious' Hollywood movie that you can smell a mile off.\n\nTravolta is awful in the movie. His accent is completely wrong which is particularly noticeable in the parts where he speaks Serbian - it's just terrible. I mean, if they wanted him to speak a language other than his own, at least they could've done a better job in finding a decent dialect coach for those few sentences he used.\n\nDe Niro does a decent job, like always, but it's really not significant given the quality of the movie it self.\n\nThe war in Bosnia & Herzegovina was bloody and I have no problems with the story-line, but when an outsider does a movie on the subject, it's just obviously fake. Like Angelina Jolie's directorial debut, In The Land Of Blood And Honey, intentions of people involved were clearly noble, but they just don't really completely understand what it was like to make a movie on it - that's why they use dumb dialog and a bunch of a-thousand-times- seen-before-things to cover the holes, which clearly doesn't work!\n\nIt's not boring and it can be easily used as a time waster, but... Just not good!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "tufficka",
        "review_rating": "1",
        "review_title": "Get to know some facts first",
        "review_detailed_main": "Watched this movie only because of the De Niro's acting. I've seen all of his movies. As a Serbian living in Bosnia, I must say that you have to ask anyone on the internet or come to our country, ONLY to ask is the name Emil Kovac even serbian, there is no Emil Kovac that will say he's serbian, that's not common name for us serbians. I was surprised for De Niro to act in this roll, because of his love for Serbia and Serbians that he said several times.\n\nI can say that historical facts about the war in Bosnia are false, but that's our destiny for everyone else to make our history as they like. You could only make true facts about names and some true facts once in a while for serbians everywhere.\n\nCome to Bosnia - Republika Srpska, come to Serbia - Belgrade, Novi sad, Nis...and find out some true facts..."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "prestonm1993",
        "review_rating": "10",
        "review_title": "The High-point of 2 Superstar's Careers",
        "review_detailed_main": "The best roles of John Travolta and Robert De Niro's careers,and I know that is a bold statement. This film shows there is no good and evil between soldiers, it is the entire concept of war who is the true embodiment of evil. These two characters were simply put on opposite sides of the same mud where blood was shed. Clearly it stayed with American soldier Benjamin (De Niro) & Serbian Terrorist Emil (Travolta). This film is an absolute must-see for action fans, suspense thrill-seekers, and fans of these talented actors. You genuinely care about both of the individuals, and see the truth in combat. The best of which our modern cinema can produce cannot be ignored."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mkilla-466-280124",
        "review_rating": "1",
        "review_title": "worst than a trip to the dentist",
        "review_detailed_main": "as soon as I heard J. Travolta's fake Serbian accent, I called my dentist and told him I was going to be able to make it after all. Trying to listen to Travolta's fake accent is like pulling teeth, pure torture, he is as much Bosnian, as I am Bat Man; and Bobby Deniro, what is going on there, ever since the movie Heat, it's like his acting is taking a nose-dive, don't get me wrong, he still up there, in the top three best, he still a monster of an actor, but I guess it's the movies he has picked, not necessarily his acting, after all, he has picked some real good ones too, such as Killer Elite, The Score, and even the Meet the Parents movies. I was completely fooled with the two big names, I figured, they would simply make Travolta talk as little as possible with that fake accent, and the movie would be a complete hit, but I guess that was not the case."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "MinistryofDoom",
        "review_rating": "4",
        "review_title": "Two Hollywood Veterans in a Convoluted Mess of a Film",
        "review_detailed_main": "Killing Season was a strange film. I wanted to like it alot because it has alot going for it: two great veteran actors, Robert DeNiro and John Travolta, a great setting in the Appalachian mountains in North Georgia, and lots of action and suspense. However, it's faults were too many to overcome. First of all, (and let's get this out of the way, because I'm sure you're all thinking about it), John Travolta's fake Eastern European accent and spray-painted hair was truly awful. At no point in the film was I able to believe that this guy was a real Bosnian unless all Bosnians have a wobbly mumbly drawl, and that's just not true. There are also alot plot holes related to the backstory, the story behind the story, if you will. It just doesn't make sense and to chalk it all up to the fact that the Bosnian war was just downright terrible is not a sufficient enough catalyst for the plot. Travolta's dialogue was also very heavy. He kept talking and talking. Would this guy please just shut up? As well, the violence is appropriate for the story but the decisions made by these two supposed war-hardened soldiers from opposing sides defy logic and common sense. Again, great setting though!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "vampire_hounddog",
        "review_rating": "4",
        "review_title": "A film that have so easily been better than it actually is",
        "review_detailed_main": "A retired American soldier (Nicolas Cage) lives isolated in his mountain cabin home. One day he is visited by a former Serbian soldier (John Travolta) who is looking for revenge after the American soldier and his men had killed his men after they came across a massacre and atrocities the Serbs had committed in a village during the Bosnian War. A dangerous game of cat and mouse takes place between the two men.\n\nOne of those action films that could have been so much better than it actually is when a cat and mouse capture and torture situation becomes an endurance battle. The film lacks wit and runs out of imagination way too soon, but was a project both Cage and Travolta had wanted to make for years."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "premkishan-k",
        "review_rating": "3",
        "review_title": "What Is The Point ?",
        "review_detailed_main": "Yes, what is the point? I couldn't figure out what the makers of the movie are trying to say. The trailer looked as if it is an action packed flick and it started likewise but seriously it goes no were\u0085drags on and on with some confession s**t going on between the two leads.\n\nTwo sophisticated and excellent actors wasted on this movie, only thing good about this movie is the acting\u0085.but honestly you will get bored of it too\u0085..just because there no plot and proper script.\n\nAnyone who is a fan of Robert De Niro or John Travolta what this movie to see your favorite actor\u0085..rest all\u0085please don't waste your time on this.\n\nI watched it because I like both the actors and I felt sorry from them, maybe I saw the movie in a wrong angle (I couldn't find any other) OR the makers made it in a wrong angle ;-)"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mail-04210",
        "review_rating": "1",
        "review_title": "simply awful !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "gavinv",
        "review_rating": "8",
        "review_title": "Stick with it, it's worth it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "brvynky",
        "review_rating": "4",
        "review_title": "Power hitters with wrong equipment",
        "review_detailed_main": "Two power hitters go to a baseball game and do there best to hit a home runs. The problem was they were swinging with hockey sticks. Morale: great actors need good equipment. This movie plot and script was terrible, pointless and boring. If it wasn't for RdN and JT no one would see this."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mm-39",
        "review_rating": "5",
        "review_title": "not a Hollywood type movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "carrascosanson",
        "review_rating": "5",
        "review_title": "Itchy & Scratchy, The Movie",
        "review_detailed_main": "This movie is the live-action adaptation to the cinema of the fictional animated television series Itchy & Scratchy, which is featured in the animated television series The Simpsons, as a part of the The Crusty the Clown Show. Only not silent.\n\nIf you like Itchy & Scratchy you will like this movie. There's lot of violent action, traps, blood and pain in an endless game of cat and mouse.\n\nThe film's got a pearl of wisdom from the mouth of John Travolta. It goes like this: --Atrocities of war-- \"are not the proof of the absence of God, they are the proof of his existence. Because men alone could not be capable of such evil.\""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "callanvass",
        "review_rating": "5",
        "review_title": "A bit too pretentious for my liking and not worthy for DeNiro or Travolta",
        "review_detailed_main": "(Plot) A Bosnian war veteran Benjamin Ford (DeNiro) in seclusion encounters another veteran involved in the Bosnian War Emil Kovac (Travolta) They befriend one another. Unbeknownst to Benjamin, he is being targeted by Emil.\n\nI was full aware of the STD release for this one. I also read a plethora of bad reviews for this one, but I was still quite excited to see this. Robert DeNiro & John Travolta are two of my favorite actors of all time, so I will rush out to see whatever they star in. DeNiro has become the brunt of many jokes for taking so many roles lately. Hell. I've even seen someone say \"He's been Nicholas Caged\" I apologize for the digression here, but grow up! Show some class and respect. DeNiro is one of the finest actors to ever grace our screens and is responsible for legendary roles. To say that kind of thing is abhorrently disrespectful. This movie isn't horrible by any means, but it's not that good. It starts off well enough. I was enjoying the banter between DeNiro & Travolta immensely. As soon as it took a turn for the serious, it became increasingly silly. It has plenty of bow & arrow chase sequences which I felt lacked suspense. It also grew rather tiresome. It got to the point where it felt like they were fighting like two 5 year old's fighting over a Christmas toy. It was just completely juvenile in my estimation. The violence factor is rather strong. I cringed in a couple scenes involving torture. Robert DeNiro is solid, even when he's not at his best. It's always a pleasure to watch him go to work. He was able to be sympathetic as well. I enjoyed his monologue in the finale. John Travolta fares a bit worse. His Serbian accent is OK at best, and I didn't get enough character development with him. His chemistry with DeNiro is good, though. Milo Ventimiglia is barely in the movie. It's a rather inconsequential part. He's basically, somewhat the \"estranged\" son. The ending was not surprising in the slightest, either.\n\nFinal Thoughts: This is a watchable affair. Let's face it. Even with DeNiro & Travolta on an off day, it's still better acting than quite a few others. This is worth a look on a rainy day. It's not as bad as people say, but it's not worthy of talents such as Bobby D & Travolta either. It's not something I'll ever watch again.\n\n5.4/10"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "oliver_187",
        "review_rating": "5",
        "review_title": "Historically really bad, but entertaining!",
        "review_detailed_main": "I know quite well about the historical facts what happened back then in former Yugoslavia. I admit the movie could have been better if they had chosen another war where the background story really could have taken place. To watch this movie you need to forget what really happened and just enjoy a good revenge story, which is really not that bad. At least it was an enjoyable 90 minutes for me, although I have seen much better movies of both actors. I also don't see it as an anti-Serbian movie at all, since both sides and their crimes are portrayed. If there is a lil message in this, it's more that war at all causes people to do bad stuff for which they have to suffer their whole life. In the end it is just an entertaining movie for me, most important is the revenge thought in this movie, nothing more, nothing less."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "senia2020",
        "review_rating": "10",
        "review_title": "awesome movie",
        "review_detailed_main": "This movie will keep you on the edge of your seats, both DeNiro and Travolta do an amazing job in portraying their characters. Travolta plays a Serbian sodlier and DeNiro an American soldier who both served in the Bosnian war int the nineties on opposite sides. The movie portrays the Yugoslav conflict well. Most of the action happens in the US but there are some scenes in Serbia. Travolta does great with the accent and Serbian language. Some bloody scenes so don't take your children to it. The ending is surprising and worth seeing. The movie starts off slow but is action packed and it culminates in the amazing ending. I would see the movie again."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "dwn-63584",
        "review_rating": "2",
        "review_title": "Letdown",
        "review_detailed_main": "It's a letdown having Travolta, and Deniro as it's 2 main actors. Yet still it is boring, and predictable. Major miss!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "wnourallah",
        "review_rating": "4",
        "review_title": "Stupid accent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "philip-00197",
        "review_rating": "1",
        "review_title": "Despicable",
        "review_detailed_main": "If this were an April's fool, the prank would be pretty good - but it's not, and it isn't. Ruling out the possibility to laugh it off - leaves for nothing but total disgust.\n\nSet aside the total disregard for historical events: This is, arguably one of the worst films ever made. The overall sensation is that someone squirted ketchup over a Disney nature film. The acting must be among the worst performed by De Niro/Travolta - but they are forgiven. One would have to assume that they realised what a load of crap this is and simply didn't bother to put on a performance.\n\nIf you add to the mix that Killing Season, in all likelihood, manages to offend thousands of people who have living memory of the horrors of war - it would be an enigma if Mark Steven Johnson gets funding for anything ever again. The only mitigating circumstance is that the film is so bad that; it will only reach a small audience.\n\nPersonally I'm totally against censorship - but, in this case, a minimum of self-regulation would not go a miss."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "kekoskender",
        "review_rating": "2",
        "review_title": "Wrong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "dale-51649",
        "review_rating": "3",
        "review_title": "Bosnian war victim seeks out American vet to settle score; a message flick",
        "review_detailed_main": "Of all the types of American films that are overdone, for me this is the most dreaded: The message flick. Especially since the message is usually \"women can do whatever they want, men don't matter\".\n\nEarly in the film we see with some scenes from the Bosnian war, including a mass execution of a group of war prisoners by some soldiers. Next, we see Deniro back in the states, milling around his log cabin, with segments of him going from one macho routine to the next- chopping wood, cleaning guns, reading by a crackling fire. I am surprised they didn't have a groin scratching while passing gas segment. Travolta shows up after having gotten some info . about De Niro back home in Eastern Europe. Naturally, they have to insert a baby into the film, so we are treated to some nauseating scenes of DeNiro's grandson, complete with that sound when you open a music box. At this point you know DeNiro is the good guy , and Travolta is in for some suffering.\n\nTravolta attempts to engage DeNiro in a cat and mouse war game, but Robert does not want to play until Travolta threatens DeNiro's family; then, SURPRISE, De Niro is out to kick some butt. The problem with the movie , there is no suspense. Once we see Travolta threaten a child, we know he is the bad guy, and that the ending will show DeNiro reconciling with the family, complete with violins . This in spite of the fact that his wife was having sex with his best friend while he was suffering at war. .So the message is - vigilantism is OK even if you are judge, jury and executioner; women can do whatever they want, men don't matter. Leave it to baby obsessed Hollywood to insert a baby into a war flick."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "sykemedia",
        "review_rating": "8",
        "review_title": "Great movie! Great Direction!",
        "review_detailed_main": "This is a great little movie, only an hour and half long though so don't expect the back stories of the characters to be to in-depth, De Niro and Travolta offer up some great performances, I would say the first half is more of a thriller, keeping you on the edge of your seat, then the second half is when the action starts and the fight scenes get gory! Iv seen a lot of things online yet there are some scenes in this that had me turning away not being able to watch, I recommend this movie, its a nice change this summer to see a movie based on performances rather than CGI, and De Niro is proving he's not to old when it comes to action, he definitely gives as good as he gets in this one :)"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "chrisnp",
        "review_rating": "3",
        "review_title": "An Equal Opportunity Offender",
        "review_detailed_main": "As a US Army veteran that served in Bosnia at the time in question, I was insulted by Di Niro's Ford character. I think if I were a Serb, I'd be even more offended by Travolta's Kovac.\n\nBoth characters commit horrible acts, and neither evokes much sympathy from the viewer, and so it's hard to care what happens to them. Di Niro plays the stereotypical maladjusted veteran living alone in the woods, a cliché since the Vietnam War. Travolta's character is even worse, with an accent sounding like Boris from Boris and Natasha cartoons and beard that would be more appropriate on an Amish farmer.\n\nWhat is really distracting is how little the movie resembles the true history of Bosnia and NATO's involvement. In 1995 NATO conducted an air war against Serb held areas of Bosnia, and by the time US ground forces arrived as peacekeepers, we were not liberating concentration camps, getting in fire fights with Serbs, or executing prisoners. We were dodging land mines, searching for weapons, and trying to keep the peace. The Nazi-like scene of rail cars full of bodies was just that – a Nazi holocaust scene taken off a WWII script and inserted into a more recent genocide. And because it was a relatively recent genocide, you would think Hollywood would show a little more restraint.\n\n(Spoiler alert) The message of the movie – what little there seems to be of one – is that all sides do horrible things, but if you throw away your gun and confess your evil deeds while sitting on a rock in the middle of nowhere, then you can immediately let go of years of anger, make friends, go home and start making your life right again. Uh huh."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "truttenberg",
        "review_rating": "4",
        "review_title": "You gotta accept that this movie sucks to enjoy it",
        "review_detailed_main": "This movie is absolutely awful as it is De Niro and Travolta torturing each other for most of the time. But it's so bad that it's hard not to laugh out loud for most of these torture parts. Easily De Niro's worst performance and Travoltas SECOND worse (The Fanatic!!!)"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "gilgongo1980",
        "review_rating": "5",
        "review_title": "mediocre entertainment.",
        "review_detailed_main": "The story started interestingly and ended interestingly. In between, the plot: It was on the verge of boredom, but still OK. Too much has been said and not enough done. That was unrealistic. Overall, I give generously 5/10, because of the happy ending."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "eddieroxx",
        "review_rating": "2",
        "review_title": "This one's a real stinker.",
        "review_detailed_main": "Boy, was this bad. Really bad. Not even DeNiro nor Travolta could save this movie. DeNiro just seemed to wanna make a quick buck with this one and Travolta's Serbian accent was unbearable. Even his hair looked completely fake. This is probably worst movie both of them have ever done in their careers, I kid you not. Just adorn watch it. It's a total waste of time."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ShelbyTMItchell",
        "review_rating": "4",
        "review_title": "Very Rough and Long Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "botschgirl",
        "review_rating": "8",
        "review_title": "Getting a Bad Rap",
        "review_detailed_main": "I wasn't going to watch this after reading all the terrible reviews but my husband liked it and asked me to, so I did. I was not disappointed. All the one-star reviews seem to concentrate on saying it was not historically correct in regards to the Bosnia war. I think those people are missing the point of the movie, which in my opinion was more about the relationship between DeNiro's character and Travolta's than historical accuracy. It's a movie and doesn't claim to be a true story. DeNiro was good as always, and Travolta gets a bad rap no matter what he does. I thought he did a good job, including the accent everyone is so focused on. Have any of you seen him in \"Love Song for Bobby Long\"? The man can act. I also noticed if you keep reading the reviews till you reach the third page, there are quite a lot of people that liked it and gave it 7-10 stars, and said basically what I'm saying, which is it's more of a relationship movie about the different effects of war on people than being about the war itself. Just felt like I needed to put a positive review on here after all the angry sounding \"1 star\" ones."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "bc-961-707014",
        "review_rating": "4",
        "review_title": "Not for americans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "leonblackwood",
        "review_rating": "3",
        "review_title": "Waste of time! 3/10",
        "review_detailed_main": "Review: This is quite a poorly made film about Travolta trying to take revenge after being shot by DeNiro in the Serbian war. The thing that I didn't like about the film was that, one minute DeNiro is hostage and then the next minute Travolta is hostage, which gets a bit ridiculous after a while. The other thing is Travolta appalling attempt of a Serbian accent. Anyway, the director really lost the chance to make a decent movie with these 2 veteran actors. You can tell that there both not giving there all and the Rambo style concept in the woods really didn't work. The movie really did show that both characters couldn't have been that good at kidnapping because they kept on getting away from each other. Anyway, I did have high hopes for the movie because both actors have made some all time classics, but this movie won't go down as one of them.\n\nRound-Up: What is going on with Travoltas beard and accent in this movie? Anyway, Travolta hasn't made a decent movie for some time and after seeing his future projects, like the Gummie Bear Movie, I can't see him coming out with anything that good soon. It's a shame, because the man can really act, but he just isn't getting the right movies. He's even starting to pop up in TV series, which is never good for an actors career. As for Robert DeNiro, he just seems to be addicted to working. He seems to be starring in some weird movies like Crossfire and Killer Elite, but he will always be taken seriously in Hollywood. As for both of the stars in this movie, I think that they should just call it a bad day at the office because the takings were appalling and personally, the movie isn't one that I will remember.\n\nBudget: N/A Worldwide Gross: $40,000 (Terrible!)\n\nI recommend this movie to people who are into there revenge action thrillers about a Serbian war veteran, seeking revenge. 3/10"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "4",
        "review_title": "A promising start descends in to a load of trite inanity",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Morning *** Friday Night ** Sunday Night * Monday Morning\n\nBenjamin Ford (Robert De Niro) was a US foot solider who served on the ground in the Bosnian war in the '90's, but who now lives a quiet, isolated existence in the mountains. However, one man, Emil Kovac (John Travolta), a Serbian man Ford was meant to have killed, cannot forgive and forget and has hunted him down to his mountain retreat. Initially friendly, Kovac soon has Ford locked in a deadly game of cat and mouse.\n\n\"De Niro and Travolta, on screen for the first time ever\", the publicity on the cover for this film proudly booms. That would be a small screen, however, in this neck of the woods anyway, as Killing Season arrived straight to DVD over here, which sort of sets the bells of doom ringing well beforehand. It's still an interesting pair up, though, but it's quite clear this isn't going to have the sort of quality it would have had if it had came out maybe twenty years ago. It actually opens quite well, after the opening shaky camera battle sequence, establishing an atmospheric tension before the lead paths have even crossed, but somehow when they do, all the components of the machine fall apart, and it just descends on a downward spiral.\n\nDe Niro tries to inject his role with some dynamism and gravitas, but you can never shake the feeling that it's another one of his 'pay cheque' roles. Travolta, never the most naturalistic actor, here has a dodgy Croatian accent to carry, along with a silly mountie beard. It's a curious pairing, that doesn't work due to the writing they have to contend with, including an unconvincing meeting, an initial bonding that does nothing to establish any menace or sense of unease, and an unexpectedly reflective and gentle ending that shakes it all up. After all this, you might think the ending would be the best bit, and it is, but in a good way, with some beautiful cinematography of the mountains and a nice, gentle song to go with it.\n\nIt's another real time thriller, meaning it's at least a short affair, but that just shows what a shame it is. **"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jordondave-28085",
        "review_rating": "5",
        "review_title": "It doesn't do anything for Robert DeNiro",
        "review_detailed_main": "(2013) Killing Season SUSPENSE THRILLER\n\nMovie uses the Bosnian war as a backdrop to pit, Serbian born, Emil Kovac (John Travolta) going after American soldier, Benjamin Ford (Robert DeNiro) who was enjoying his retirement back in the US, while he was living in an isolated wooden cabin. Both are going to reveal and settle their war commotion differences in the woods. The character, played by Travolta as Emil, was too artificial to be taken seriously, for I never had any grasp at why he had so much hate toward Benjamin when his character did far worst, while joining the army. Also, I don't ever recall any American soldiers ever partake being part of the Bosnian War."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "DiCaprio74",
        "review_rating": "5",
        "review_title": "Why?",
        "review_detailed_main": "Man, this movie killed me. It's was really painful to watch. I'm not sure if it were entirely to blame on how annoying Travolta's character was or trying to figure out why De Niro even took this role. This movie had so much wrong with it. First off, Travolta is still angry about his near death experience that happened years ago, so he's out for revenge. De Niro is just old and lives out in the middle of the absolute forest, with a family that's just dying to visit, but continuously refuses. In my opinion, this movie is way too scattered around. The fight scenes were iffy and the ending was no where near good. This really makes me wonder of they just took this job just to get out of the house or something. Both are really great actors, obviously. Yet, it didn't show in this film. I plainly found Travolta annoying, especially with that accent and De Niro was not attachable, which doesn't happen a lot. They were only pretty much asked to play their roles because they are well known and exceptional actors. I would honestly save yourself the headache and time and just avoid this movie. It'll do you great good."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "pixrox1",
        "review_rating": "8",
        "review_title": "Not unlike the pro wrestling on TV in the 1970's . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "jjefft2002",
        "review_rating": "3",
        "review_title": "Very disappointing",
        "review_detailed_main": "This could have been much better than it was, it would have needed a new script though, and to be perfectly frank, some better acting too.\n\nBoth Robert De Niro and John Travolta played familiar roles, and unfortunately Travolta especially, played his both woodenly, and unconvincingly. The dodgy accent didn't help either.....\n\nThe setting for the movie was fantastic though, really beautiful looking country. But obviously that's not enough to lift a movie out of mediocrity.\n\nI liked the premise of the film, but felt let down by what was in all honesty a B-movie played by A-list actors."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Bruce722",
        "review_rating": "4",
        "review_title": "Mediocre at best.",
        "review_detailed_main": "The Killing Season was one of those movies that you're not quite sure how it gets made. Who comes up with the idea of having John Travolta play a Serbian and have a battle with Robert De Niro? Honestly, it actually wasn't that bad of an idea but it was just such a slow movie that it made it difficult to watch at times. If this film was any longer I might've fallen asleep. Some of the plot points were a little weak also and Johnny T's accent, while not bad, isn't good enough to make you forget it's John Travolta. Overall, not a terrible movie but pretty mediocre in general. Unless you're watching it for free, don't waste your time."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "guflerm",
        "review_rating": "5",
        "review_title": "More than I expected",
        "review_detailed_main": "I skipped past this movie many times while searching for some entertainment on Amazon. I thought that Travolta could never pull off the role: Vinnie Barbarino playing a Serbian? Seriously? Sure, one could find faults, but I enjoyed this movie. Maybe because my expectations were low. I figured I'd watch a bit, then switch to another flick. But I stuck with it. Glad I did, because it was better than the current run of the mill productions that litter the streaming sites. The movie had my attention; wondering how the constant exchange of control would result in the end. And I thought the end was appropriate.\n\nFor those who pan the movie due to historical inaccuracies, you need to relax and see the movie for what it is, entertainment. If you're looking for accurate portrayal of US involvement in Middle East conflicts, then go read a book or - for the lazy lot - watch a documentary."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "kneal-894-648073",
        "review_rating": "5",
        "review_title": "Entertaining but this movie feels like there was no 'soul'",
        "review_detailed_main": "So, riddle-me-this\u0085typically when you get two great actors such as Robert DeNiro and John Travolta in one flick you have an instant movie classic, right? Well, let me solve this riddle and inform you that this isn't always case and Killing Season (2013) is one of those.\n\nDon't get me wrong, this certainly was not a bad movie. But neither was it a particularly good movie. This simply was a movie that seems like it \"didn't happen\". It didn't have a soul, nor conviction. In other words, the movie started and then it ended. 1 ½ hours later and there was no meat in-between in spite of some high action scenes. I can't find the right way to describe how this movie missed-the-mark other than it felt like DeNiro and Travolta did a personal favor for a movie- director friend.\n\nKilling Season opened with a disturbing scene depicting some awful events that took place during the Bosnian War. While this scene was quite emotional this could have set the stage for a good plot, especially considering the star talent of both Academy Award winning actors. There was some attempt by the director to create an emotional attachment with the characters throughout the film. Yet in spite of the greatest of Robert and John's acting talent, it just didn't work well for me.\n\nTherefore I can easily summarize Killing Season as this: \"Start movie : Some action here in the middle : End movie\". The movie felt like it wanted to be great but it was just blah. This was a movie that seemed to have great potential so I was a bit disappointed in this under- achiever. If it weren't for Robert and John acting in this film then Killing Season would get a much lower rating."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "taxdude-92175",
        "review_rating": "3",
        "review_title": "Disappointed",
        "review_detailed_main": "Travolta's shoe polish hair dye, his awful accent, and numerous getaways makes for a ridiculous movie with shallow characters. Skip this one."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "suite92",
        "review_rating": "8",
        "review_title": "Two survivors of the Bosnian conflict fight it out deep in the woods.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "criscrossin",
        "review_rating": "5",
        "review_title": "Disappointment after a great premise and plot",
        "review_detailed_main": "I am a fan of Travolta's energetic acting , always. De Niro is a supreme powerhouse and both of them together ,makes for a recipe of deliciousness. But the movie becomes predictable and some routine play acting after a great build up. Tension among the actors develop after they have a lovely late evening tet-e-tete. Where they drink, discuss philosophy of the war, trade war stories and some bad jokes and sing off tune. The setting was excellent. Dark brooding jungle, rains and loneliness. But the cat and mouse game fell apart. I think the writers didn't have it in them to create something truly great, they had a great idea, and that's it. Either because of paucity of funds or lack of creative abilities, the movie fell far short of it's premises to become a great one."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "Uriah43",
        "review_rating": "5",
        "review_title": "Interesting at First",
        "review_detailed_main": "Sent into Bosnia to stop Serbian aggression, \"Colonel Benjamin Ford\" (Robert De Niro) discovers a death camp operated by a special Serbian unit. A fire fight ensues and several of the perpetrators are rounded up and subsequently executed by Colonel Ford's squad. However, one specific person named \"Emil Kovac\" (John Travolta) manages to survive and after a lengthy stay in the hospital finally recovers and decides to find out who was responsible and upon doing that sets out to America to kill the man in charge. Meanwhile, Colonel Ford is having a difficult time reconciling what he saw in Bosnia and the actions he felt he had to take and is unaware that someone is out to get him until he shows up on his doorstep in the middle of the wilderness. Now rather than reveal any more of this movie I will just say that it was interesting at first but some of the scenes were rather repetitive and from then on it proceeded to go downhill fast. Additionally, the fake Serbian accent used by John Travolta also got old rather quickly as well. In any case, I don't think this is a bad movie by any means but it certainly doesn't merit any high marks either and for that reason I have rated it accordingly. Average."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "gradyharp",
        "review_rating": "8",
        "review_title": "The Lingering Ravages of War",
        "review_detailed_main": "The tagline for his moody, atmospheric, harrowing and insightful films is 'The purest form of war is one on one' and that generally encircles the mood of the film from beginning to end. Written by Evan Daugherty and directed by Mark Steven Johnson this is a small cast film that concentrates much of the destructive impact of war on those who fight it and survive it. Many people seem to expect more from a film than simply viewing how war eats the brain and memory and after-war life, concentrating responses on actors' accents and implausible encounters, but the message is delivered well if you are open to hear it.\n\nKILLING SEASON is the confrontation of two veterans of the Bosnian War, an international armed conflict that took place in Bosnia and Herzegovina between 1 March 1992 and 14 December 1995 and is still remembered for the Bosnian ethnic cleansing campaigns and the violent and terror-inspiring means the civilian population of another ethnic or religious group from certain geographic areas endured murder, torture, arbitrary arrest and detention, extra-judicial executions, rape and sexual assaults, confinement of civilian population in ghetto areas, forcible removal, displacement and deportation of civilian population, and deliberate military attacks or threats of attacks on civilians and civilian areas. One veteran is American, Benjamin Ford (Robert De Niro) whose life has become one of being a recluse in the back hills of Appalachia, ignoring his family and struggling with the atrocities he not only witnessed but participated in: the other a Serbian, Emil Kovac (John Travolta) who narrowly escaped assassination by Ford and the American troops and since the war has been hunting for Ford to make him confess his war crimes and suffer the consequences. Ford and Kovac meet surreptitiously at Ford's little cabin, and at first exchange food and drink only to have the reality surface of Kovac's intent to kill Ford. The remainder of the film is a cat-and-mouse game that braces the wills of each survivor in treacherous manners that make each man reopen old war wounds and find a new universality in the effects of war on the human mind.\n\nThe film is shot in Georgia (cinematography is by Peter Menzies, Jr) with flashback black and white and sepia toned footage of the horrors of the Bosnian War. De Niro and Travolta manage these difficult roles well in this basically two-person film (Ford's son and daughter in law and new baby are adroitly played by Milo Ventimiglia and Elizabeth Olin, and the early scenes in Serbia are polished by performances by Diana Lyubenova, Kalin Sarmenov and Stefan Shterev). The tension is underlined by a fine musical score composed by Christopher Young.\n\nThis film may not meet everyone's expectations of big noisy extravaganzas, but as a powerful antiwar statement is works exceptionally well.\n\nGrady Harp"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "ymeligy-52616",
        "review_rating": "10",
        "review_title": "Very good movie",
        "review_detailed_main": "Simple and without much drama around. Very touching and great performance by the legendary actors."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "fatima-melina",
        "review_rating": "8",
        "review_title": "I Don't even know where to begin!!!",
        "review_detailed_main": "As much as i remember these kind of \"political/Bosnian/Serbian/Let's be friend and stop killing each other/USA will help\" movies always were like this! I don't get why is everybody so upset!?\n\nso they killed too many Muslims!!? so what!!! even when they got cut, they told to media: \"we are going to kill more if we get the chance!!!\" so what? now you say scorpions got cut and executed?! more like Christmas coming early! I mean, come on guys!? But hey! at least you got to watch beautiful views of God's nature, instead of messy/filthy,bloody reality of what just really happened back then which all of them have been trying to cover-up ever since!!! this one is another ugly attempt! wonderful! I applause you! well done! I mean it! I'll give you an eight! but seriously! next time use a Tank! that is more like it!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "coolsagittarian",
        "review_rating": "9",
        "review_title": "Top Movie!",
        "review_detailed_main": "Both DeNiro and Travolta have done wonders! DeNiro does not look like he is ever gonna get old for action flicks and Travolta is his usual tough self and is the right guy for the job! As far as the plot is concerned I feel Americans will love the movie and Serbians would probably hate it but as a neutral, I have enjoyed both DeNiro and Travolta's performances enough to wipe out any negatives in the plot. The point of both characters being in the latter part of their ages has a sort of slow effect overall on the film but they way the plot has been panned out has reduced that feeling. Did not quite understand Milo Ventimiglia's character in there, he was better as not being there. It would be more enjoyable had he influenced the film a bit more by maybe a rescue or something. Overall WELL DONE!"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "vincesimioni",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Loved thus movie, iy was great and haf good reading"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "borisboskovic",
        "review_rating": "9",
        "review_title": "I'm from Serbia,film is not anti-Serbian propaganda...",
        "review_detailed_main": "Some parts of film are not 100% accurate, Serbs never surrendered like that or killed Bosniaks in trains....blah blah we will not get political That is not what film was supposed to teach you\n\nFilm is about how war is worst thing that can happend to you. In war you are literally killing people that have different opinion and that is not what we call freedom or free speech it teaches us about how war is never a real solution and anger will always stay in people hearts.\n\nI wont spoil it, film is great, that's it."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "michaelh562001-900-127984",
        "review_rating": "8",
        "review_title": "intence message",
        "review_detailed_main": "I really don't see why some didn't like this film but the again there are alor of idiots out ther john travoltas acting was outstandind and of robert deniro well he was inpecable i have come to the conclusion that critics don't know crap and thier oplnion is nothing more than just that ..........an opinion"
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "mcmcormick",
        "review_rating": "8",
        "review_title": "LOL! It's funny to read the unsatisfied reviews, so juvenile.",
        "review_detailed_main": "First of all, it's not really an original concept but then again, what revenge film is? As for acting, I don't get the complaints for Travolta, specially the accent, shouldn't you take that up with the casting director? An actor can only do so much. But why is everyone complaining about the screenplay anyway? It's first and foremost an action thriller, this isn't Gandhi? And most people gave high ranks to that crap \"No Way Home\" which even scored higher than \"Gandhi\". Puh-lease."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "marcvuijk",
        "review_rating": "8",
        "review_title": "Ignore all the bad reviews!!!",
        "review_detailed_main": "First of all, this isn't a film that wants to win oscars, instead it wants to deliver a powerful message through the eyes of these two war veterans who both have reasons for the way they live their lives after the brutal experience of war. Both Robert de Niro and John Travolta are on fine form here and deliver good performances,but i loved John Travolta's character a lot. All these bad reviews i don't understand,because it's a great film with a good story, beautiful scenery and two veterans in the movie business. All i can say is, sit back and give this movie a chance and it won't dissapoint if you understand the powerful message."
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "hamid-r-goodarzi",
        "review_rating": "",
        "review_title": "Under the shadow of two legends",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "gvzfs",
        "review_rating": "",
        "review_title": "Jägermeister and Travolta with a new phony accent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1480295",
        "movie_name": "Killing Season",
        "movie_rating": "5.4",
        "review_username": "willhclark-29-142263",
        "review_rating": "",
        "review_title": "Great film to Dishoner your U.S. Military Veterans and butcher history for a cheap thrill",
        "review_detailed_main": ""
    }
]