[
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "sddavis63",
        "review_rating": "4",
        "review_title": "People Need To Lighten Up About This Movie",
        "review_detailed_main": "This is certainly a consensus pick as one of the worst (if not the worst) movies ever made - and for that very reason I've always wanted to watch it. Now I have, and my suggestion to everyone is - lighten up. Yes, it's bad. The sets are dreadful - worse than you used to see on Saturday morning kids' shows. The special effects are weak - although to be honest I've seen worse portrayals of space flight. And the costumes are hilarious - especially the polar bear and the robot. But come on - you have to admit that there's a certain \"cuteness\" to the story of Martians coming to earth to kidnap Santa Claus so that he can bring happiness to their children. All the characters are pretty one- dimensional. There's good guys and bad guys and fun guys and kids from both Earth and Mars. No one gets particularly well developed. And then, of course, there's Santa. In all honesty, I thought John Call did a decent job as the jolly old man. In this age of high tech special effects and big budget movies there's no doubt that this looks pretty weak - and even by the standards of 1964 it was still pretty weak. But it's good fun, and for the fun alone I don't think it deserves its reputation as one of the worst movies ever. What's left to say, except - \"Hurray for Santy Claus!\" 4/10"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "talisencrw",
        "review_rating": "4",
        "review_title": "Not NEARLY as bad as people make it out to be...AND a lot more fun than it has any right to be!",
        "review_detailed_main": "I still very much appreciate its spirit, both in terms of no-budget filmmaking and sense of fun. I wish that the films of today could have even a fraction of its good-natured mischievous approach. Certainly film studios could learn a thing or two, in this ridiculous era of quarter-of-a-billion-dollar blockbusters. I for one don't need the equivalent of 'having my eyes masturbated', as one cinema critic so lovingly stated.\n\nI would prefer watching this in a second over any of the ham-fisted, cash-soaked holiday atrocities made in the past three decades (I believe 'A Christmas Story', and perhaps 'Elf' and 'National Lampoon's Christmas Vacation' to be the last decently-made Yuletide films).\n\nBut don't take MY word for it...see it for yourself (without the stupid and condescending MST3K commentary) and make your OWN conclusion."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mstomaso",
        "review_rating": "4",
        "review_title": "Can something this dumb really be harmless?",
        "review_detailed_main": "Maybe I have a soft spot somewhere in my heart for poorly written, badly conceived, silly 1960s children's movies - but I really can't understand why Santa Claus versus the Martians is in the worst 100 movies of all time here on IMDb. Sure, most viewers will breathe a sigh of relief when it ends, but this film really seems downright harmless compared to the six month old Kennel Ration Hollywood has been feeding us as commercial film for the last ten or so years. Hey, at least it's not a remake, a sequel, or a 2 hour long CGI cartoon with a few human faces tossed in for effect.\n\nSanta Claus gets kidnapped by distraught martians (white guys with bad green makeup and a few dishwasher parts glued to their heads, as well as inexplicable capes), who want to rescue their depressive, antisocial children from the doldrums by giving them all toys and a big red-suited guy with a beard to laugh at... err... with. Santa adapts to life on Mars very well and starts cranking out the toys with the help of Martian machines, but political controversies surrounding his activities soon threaten the fabric of Martian Society.\n\nI'm not kidding.... really.... this is the plot.\n\nAside from the ludicrous plot and mediocre acting (Bill McCutcheon gives the only really enjoyable performance in this film, though Pia Zadora and Vincent Beck are not too bad), this is no worse than many of the kid films of its time. In the age of ADD and general impatience, however, this film is more than a little dated. The only modern kid I can imagine enjoying this film is one with an extraordinarily great attention span and a penchant for B-films. In terms of production, this film has the feel of a 2 hour, 1960s low budget TV show, and is almost as clever.\n\nI would recommend avoiding this film unless you're compelled to watch films which go to extremes. I found it cute, funny, and more than a tad ridiculous. To most people, it's a film version of your great Aunt's wallpaper - it's just there on the TV, while far more interesting things are happening in the carpet below your feet."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Red-Barracuda",
        "review_rating": "5",
        "review_title": "Ludicrous, yet charming, Christmas-based nonsense",
        "review_detailed_main": "Santa Claus Conquers the Martians is a low budget kid's movie from the early 60's. It has a reputation as one of the worst movies ever made. But, similar to most such famously trashed films, it actually turns out to be nowhere near the worst of the worst. More accurately, this could be described as an enjoyable slice of cheese. Sure, its rubbish on several levels but it also happens to be memorable on several other levels.\n\nThe story, such as it is, has the Martians kidnapping Santa Claus and, in the process, abducting two Earth children as well. You see, the Martians want to enjoy Christmas as well. With a plot-line as moronic as that, there's really no point in splitting hairs over details and instead just sit back and watch what unfolds. The sets, costumes and make-up are all bargain-basement but they all work well enough within the confines of the plastic coated world that they exist in. Some of the highlights of the film as a whole include an angry Martian and friendly but stupid Martian, an impressively unconvincing and fake polar bear, a comedy punch up and last, yet surely best of all, a truly infectious theme song about Santy Claus. In the final analysis, there's enough strangeness here to qualify this as a bona fide cult item. It's poor, yet simultaneously quite good. Come on now; let's hear it for Santy Claus!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Sleepin_Dragon",
        "review_rating": "5",
        "review_title": "Harmless Christmas fun.",
        "review_detailed_main": "I badly want to give this film a 3/10, because it is by today's standards, abysmal. However, you have to try and take this film for what it is, made way back in 1964, the world was a very different place, the height of the cold war.\n\nIt is a Christmas film, and it's of course intended for adults, so you probably would have had to have been there, it's sweet, and from a kid's perspective probably did have some degree of charm.\n\nThe music is shocking, and the acting.... I'll leave that for you. At least they opted not to make Santa a Kung Fu Master, it's all meant to be heart warming.\n\nCould I sit through it again? Absolutely not, but one of the worst movies of all time? I've seen worse."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "zmaturin",
        "review_rating": "",
        "review_title": "Santa Claus Conquers the Martians... and our hearts.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Rainey-Dawn",
        "review_rating": "4",
        "review_title": "A Very Cute Christmas Movie!",
        "review_detailed_main": "This is one of those really dorky movies - extremely geeky! Yet it's fun, cute and a bit sweet... a little bit on the freakishly cool side too. It's one of the oddest movies ever made. It's very much kid friendly so if you have youngsters and are looking for a different kind of holiday film then you might want to try this movie. It's not great at all but it is one of those \"so bad it's good\" type of holiday family films.\n\nI acquired a copy of this movie through the Sci-Fi Classics 50-Films Pack put out by Mill Creek. I'm very glad they added this one - it's a refreshing change. I've just finished re-watching this film and I'm reviewing it just about 2 1/2 weeks before Christmas. It was great timing for me to get this film pack and I had no idea this movie was in the batch of films until I received it.\n\n4/10."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mark.waltz",
        "review_rating": "2",
        "review_title": "There should have been a sanity claus.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Torgo_Approves",
        "review_rating": "1",
        "review_title": "The best worst awful awesome movie ever!",
        "review_detailed_main": "(r#30)\n\nBasically everything is wrong about this film, and that's what makes it so great. It's hysterical, but even as you're laughing yourself breathless you can't help but feel bad inside that you're actually chewing down this rotten junk food. Because that's what Santa Claus Conquers the Martians is: a case of food poisoning. There are layers and layers of awfulness in this movie, and it really is an unforgettable experience. The actors are all stoned out of their minds and extremely ugly. The title pretty much explains the plot, although there's not really a lot of \"conquering\". Maybe a better title would have been \"Santa Claus Laughs at Inappropriate Times while Hanging Out with Bad Actors in Silly Outfits\"? Just saying. I know it isn't as catchy, but at least it's not deceiving.\n\nIt would be impossible to sum up all the stuff that sucks about this film, so I'll break it down into what I remember most strongly: a man in an ingeniously fake-looking polar bear costume (funnier than the \"bear\" from Hercules in New York); an extra with the most unnatural laugh you're ever likely to hear; an ex-dope addict martian with tics; kid actors who make sure every syllable of their lines are slowly and caaarreee-fulll-yyy prrooo-noun-ceeed; a newspaper headline stating that Santa's been \"kidnaped\", and a giant robot. Yes, you read that right. A giant robot.\n\nThe worst acting job in here must be when Mother Claus and her elves have been \"frozen\" by the \"Martians'\" weapons. Could they be *more* trembling? I know this was the sixties and everyone was doped up, but still.\n\nThis wins the Dung Beetle Award of the year. Destined to become a Christmas classic for me!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "XDevonousX",
        "review_rating": "1",
        "review_title": "Absolute Genius!!!",
        "review_detailed_main": "This is truly the worst movie I have ever seen, but it really goes beyond that. Something this stunningly terrible simply had to be done on purpose. Every joke, every \"special effect\" every background, every costume is done without any kind of thought as to not looking like it was done in under fifty seconds. This film brings artistry to sub-mediocrity. Something so basely horrible defies the physics of cinematography. I could not make a worse movie if I spent absolutely no time at all making it. Someone really, really tried to make this piece of gold stink like a thousand dead scatologists. If you have a dollar on you the next time you pass by your local dollar store, do yourself a favor and revel in the worst thing you can imagine."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "epa101",
        "review_rating": "4",
        "review_title": "It's brought a lot of pleasure to people",
        "review_detailed_main": "This has been ridiculed on \"The Canned Film Festival\", \"Mystery Science Theater 3000\" and \"Cinematic Titanic\": the only three to be mocked on all three bad-film programmes. Everything about it is so tacky that you can't help but laugh: a Santa Claus with a pipe who says \"No Sirreee\", a melodramatic Martian ruler, a polar bear that would be unconvincing in a pantomine. Still, the fact it makes you laugh means that it's not that bad. It wouldn't been on all three of those programmes if there were not a lot of fun to be had from laughing at it. I'd rather own something like this than, say, Richard Harris's first film \"This Sporting Life\", which is so boring that there is no way of getting any enjoyment from watching it. This is a bad film with a bad plot and it does get boring in parts, but it'll cheer you up on a bad day."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "amherst5282",
        "review_rating": "10",
        "review_title": "Paging Edward D. Wood",
        "review_detailed_main": "If the fabulously awful yet admirably enthusiastic director Ed Wood had ever made a kids' holiday flick, this would have been it.\n\nThis movie is not bad, if by bad you mean boring and a waste of time. It's spectacularly appalling, the way \"Plan 9\" is. They obviously had a budget of about fifty bucks to make this, and it shows.\n\nBut some of us love these evidences that once upon a time in America there was such a thing as real independent cinema, and all-afternoon multi-feature holiday shows at neighborhood theaters that only had one screen, and sing-along events built into kids' movies, and fun that didn't depend on multi-billion dollar special effects.\n\nThis is one of those movies that you will laugh at and make fun of, yet long for the days when local, independent television stations aired it on a Saturday afternoon before Christmas. You'll make jokes about it, but catch yourself absentmindedly humming \"Hooray for Santy Claus!\" for the rest of your life. And you'll amaze your friends with -- \"I know what movie Pia Zadora made her debut in, and you don't!\""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "whammy666",
        "review_rating": "7",
        "review_title": "Brilliant film...",
        "review_detailed_main": "Here it is, one of the best B-movie scifi films I have had the pleasure of seeing...the best Christmas movie next to Jack Frost (the one with the killer snowman). This is the best film I have paid a dollar for. I had wanted to see this and I had went to the dollar store and WHAMMO! There it was...Santa Claus Conquers The Martians on beautiful DVD. I got home, watched it, and laughed my butt off. This is a truly hilarious film. SEE A polar bear aka guy in a bear costume! SEE a humungous robot aka guy in a big costume! SEE aliens aka guys with green facepaint and green helmets on! SEE Santa Claus CONQUER THE MARTIANS! Quite possibly some of the worst special effects in film history, and one of the fuinniest plots in film history, it all adds up to fun! This movie has no boobies and gore, so it is appropriate for children too! Wow...what a remarkable film! SEE SANTA CLAUS CONQUER THE MARTIANS TODAY!!!!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Mister-6",
        "review_rating": "2",
        "review_title": "Do not open 'til Christmas...or any other time.",
        "review_detailed_main": "I remember seeing this movie a long time ago, way back before they installed the cup holders on the theater seat arm rests. You know, the good old days. All I could remember was the bright lights and colors, the green Martians, Santa was in it, and that \"song\" (S-A-N-T-A, C-L-A-U-S....)\n\nThe next time I saw it, I was a freshman in college and it was playing at the local pub's Bad Flick Night.\n\nTime was not kind.\n\nIt's a kid's movie, provided the kid is mentally deficient, a hostile brat and/or has short-term attention disorder. Either way, this one will appeal to them.\n\nFor the rest of us, there's the issues of Santa-kidnapping Martians in BRIGHT green makeup and helmets that resemble Yul Brynner's headgear in \"The Ten Commandments\"; other Martians that you either want to punch out (Dropo) or try and talk out of future acting opportunities (a young Pia Zadora-???); Santas that walk around saying \"Merry Christmas\", despite the fact that Christmas is not even close; pop guns that immobilize people; polar bears that have extremely long hind legs; and blah, and blah, and blah...\n\nBut DOES Santa Claus actually conquer the Martians of the title, like it says? Yep, but he doesn't hit, punch, kick, bite, scratch, claw or anything. Sorry kids, green blood does not flow here. You see, Santa puts in a Martian North Pole workshop and wins over the Martians with peace and good will towards men...and Martians too, I guess. He even makes lazy good-for-nothing Dropo a Martian Santa. GOOD; anything that will keep that nutcase on his own planet....\n\nTwo stars for SCCTM; one star for the Christmas spirit and another for the fact that it was half-price beer night when I went in that pub to see it again.\n\nMaybe they should do that for \"The Horse Whisperer\"...."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "NextActionHero",
        "review_rating": "",
        "review_title": "Not terrible if you think a bit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "sharktrooper21",
        "review_rating": "1",
        "review_title": "A film you won't forget... ever.",
        "review_detailed_main": "The title pretty mush somes up what kind of movie we have here. That is cheesy, dumb, and wrong on so many levels. In other words, the perfect film for MST3K.\n\nI don't really need to how bad it is but there is only one msytery that eludes me. Who the hell thought that this might a good enough idea to put money to fund a film like this? I can only think of two reasons:\n\n1. Since it's a holiday film, they thought they could get away with it. 2. It was made in Canada.\n\nStill I love the MST version and can't think of a better film that could serve as their Chrismas special. Also I never noticed prior to watching this that Santa is smoking. An icon for children everywhere is smoking out of a pipe! Hilarious!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lastliberal",
        "review_rating": "4",
        "review_title": "Oh me, oh my, oh me!",
        "review_detailed_main": "This is one for the fans of Ed Wood and Plan Nine From Outer Space. It is a camp classic of how to make a space movie.\n\nThe Martians kidnap Santa to bring joy to their children. You have to see their robot. It looks like a Halloween costume you may have made for your kids.\n\nA nuclear curtain is controlled by light bulbs! The Martians have antennas! I busted a gut watching this.\n\nThey used a lot of Air Force stock footage and I was thrilled to see the SAC aircrews running from their bunkers to launch their planes in an attempt to intercept the Martian spacecraft.\n\nThis was a real hoot!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "wes-connors",
        "review_rating": "4",
        "review_title": "Deck the Halls of Mars with Folly",
        "review_detailed_main": "\"Martian children are addicted to Earth's television shows featuring Santa Claus. This enrages their parents, who travel to Earth to kidnap Santa himself. On arrival, they kidnap two zealous children who lead them to 'Santa's Workshop' at the North Pole. They return to Mars with Santa and the children in tow, but are thwarted when he converts the Martian children with unstoppable Yuletide joy,\" according to the DVD sleeve's synopsis.\n\n\"Santa Claus, you're coming with us!\" was the line that got me. See if you can watch it straight through, with a friend, and not crack a smile. This amazingly silly film was obviously intended for young kids to see during Saturday afternoons in December, first in the cinema, and later on TV (just like the Martian children glued to their set). Or, maybe the whole project was a plot designed by parents to make their children go outside to play.\n\nMean and mustached Vincent Beck (as Voldar) does well as the bad Martian; later, he guest-starred as the villainous \"Megazor\" on \"Lost in Space\", a show which (more often than not) accomplished much with small resources. Reputedly, Gene Lindsey is the man in the polar bear suit, but he can't bee seen; later, he guest-starred as \"Randall Drew\" (Roxanne's brother) on \"Dark Shadows\", a show sparking the imagination on a limited budget.\n\nWith a small budget, your really need a big imagination. \"Santa Claus Conquers the Martians\" has a few good lines, a phallic set statue (as the Martian kids watch TV), and a nice view of the sky as seen from Mars (see Saturn?) - but, there isn't enough creativity aboard. John Call (as Santa Claus) and Bill McCutcheon (as Dropo) try their best with the script, and 1980s celebrity Pia Zadora (as Girmar) debuts. Milton Delugg's music is nicely done.\n\n**** Santa Claus Conquers the Martians (11/14/64) Nicholas Webster ~ John Call, Vincent Beck, Bill McCutcheon, Pia Zadora"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Cluckewallist",
        "review_rating": "3",
        "review_title": "An intricate, homely and delirious masterpiece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "cinephile-27690",
        "review_rating": "1",
        "review_title": "As the other 1 star reviewers say...",
        "review_detailed_main": "The plot is stupid (read the title again if you don't know why), the polar bear looks fake, actually EVERYTHING looks fake, the picture quality, everything is trash!\n\nThis is now considered to be a \"cult classic\", a hated movie that has gained popularity, and rightfully so. It's a \"so bad it's good\" movie, and probably one of the best of it's kind.\n\nAs I watched this movie, I wondered what I should rate it. It's not boring, but the film quality sucks! It's amazing that My Fair Lady, Mary Poppins, and The Gospel of According To St. Matthew came out the same year!\n\nThe movie gets a 1 for it's quality, but it's a must see for goofy fun!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "JamesMovieGuy_117",
        "review_rating": "4",
        "review_title": "a bizarre film with a bizarre concept.",
        "review_detailed_main": "Martians kidnap Santa Claus due to an elder's belief that the Martian children need to experience Christmas and the joys of childhood. This leads to two human children discovering the conspiracy and work to get Santa Claus back by Christmas.\n\nThis is a bizarre film with a bizarre concept. It's not good at all but if you want a b-grade schlocky film to watch during the holidays, look no further than this. It's for the most part harmless and despite its dumb and schlocky nature, I can understand why some may appreciate this as a guilty pleasure.\n\nIt's a very low budget film with crappy production qualities, awful looking costumes and special appearances from people in cheap looking polar bear and robot costumes.\n\nIf you are intrigued by Santa Claus Conquers the Martians, give it a watch. I know some people who like to watch this during Christmas time due to its bizarre nature. It essentially has the same production qualities as an Ed Wood movie but it's a Christmas movie."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "bellino-angelo2014",
        "review_rating": "2",
        "review_title": "A must-see just for laughing at his inaniness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "loriwallace-93796",
        "review_rating": "10",
        "review_title": "Lots of fun",
        "review_detailed_main": "Made in 1964 this film is a cult classic. Is it a great film? No! Is it fun to watch? Absolutely. Should you see? Of course. Is it safe for children? Yes.\n\nThe plot of this film is that the children of Mars are in some sort of stupor. When a father goes to the supreme leader about the problems his children are having the leader tell s them that \"Children are no longer Children on Mars\". Eventually the Martians are told about how on earth they have Christmas and Santa Claus.\n\nThe Martians then set out to kidnap Santa and they do along with 2 children.\n\nSanta however is facing a problem when he gets on Mars because one the Martians does not approve of his arrival.\n\nIf your a child of the 1970's then chances are you have seen this film. It is fun to watch. You can't help but to laugh at the cheap looking \"Saturday Morning Television\" special effects."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "hogwrassler",
        "review_rating": "6",
        "review_title": "For Kids Who Still Believe In Santa Claus",
        "review_detailed_main": "I can still remember, as a kid back in 1964, seeing the TV commercials advertising that \"Santa Claus Conquers The Martians\" was coming to the local movie theater. I am watching it right now on Movies TV! It's on their Saturday morning popcorn movies lineup. Since it's the Saturday before Christmas, it's an appropriate time to show it. The plot of martians coming to earth to kidnap Santa Claus in order to get Martian kids to stop watching earth TV programs is a unique idea. It's kind of silly but earth kids back in 1964 would believe most anything. The special effects are OK and the makeup is good enough the time period. There are some legitimate actors in SCCTM. John Call was well cast as Santa. He had a long career both as a stage, movie and TV actor. What with the internet today, modern kids would probably not be too interested. But, it might be an enjoyable movie for really young kids who aren't into the internet and cell phones yet. And for any of us who still believe in Santa Claus."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Hitchcoc",
        "review_rating": "2",
        "review_title": "It's just pretty bad!",
        "review_detailed_main": "I only watched this because for about forty years I have seen it listed among science fiction movies. Yes one reviewer said it was made for kids. That's true. Others were made for adults. However, bad is bad. Who the film was directed at is of no consequences. I would suspect short attention spans, would last about five minutes. It's just a rambling mess of mistaken identity and ridiculous situations, going nowhere. Santa is OK in his ho, ho, ho, sort of way, but he even looks bored and confused at times. He is brought to Mars to get the kids to focus on more traditional Martian values or something. They are watching too much TV, I guess. But the pitfalls are that the Martians are so uninteresting. Earthlings with shoe polish on their faces--it even rubs off at times. There is the obligatory bad guy. I guess he's on a power trip because what difference does it all make? The title is really the best part of the movie."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "bfjrnski",
        "review_rating": "",
        "review_title": "No matter what they say...this movie is cute!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "framptonhollis",
        "review_rating": "3",
        "review_title": "Masterpiece",
        "review_detailed_main": "People always give the \"greatest movie ever\" label to more basic films like \"Citizen Kane\" or \"The Godfather\", but, when I looked over the humongous list of films that I've seen, the one that truly impacted me the most was \"Santa Claus Conquers the Martians\".\n\nThe true emotional impact of this funny, entertaining, and truly beautiful film cannot match that of any other film. This is the stuff that would make Truffaut proud!\n\nI mean, let's be honest, after watching \"Santa Claus Conquers the Martians\", Fellini looks pretty terrible, right? I mean, sure, his films have intelligent scripts, strong emotional cores, and playful humor, but they are...lifeless. At least when being compared to this excellent work.\n\nI think that we should change dictionaries so that when you look up \"brilliant\" you just see a poster for this film. That just makes sense, right?\n\nAre these sarcastic reviews not funny anymore? Yes. But that doesn't stop me from doing them!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "gavin6942",
        "review_rating": "4",
        "review_title": "Quite Bad, But Enjoyable in its Badness",
        "review_detailed_main": "The Martians kidnap Santa (John Call) because there is nobody on Mars to give their children presents.\n\nYes, this movie is abysmally bad. The stock footage, the Martian costumes, the polar bear costume... it is terrible. The plot is actually pretty decent and could have made a good movie, but this was not it. However, this was what was made, and it is darn entertaining for what it is.\n\nOf course, besides the terrible costumes, you also have to avoid the scientific questions -- why do Martians speak and write in English? How do you turn on and off a shield that blocks radar? What is a nuclear shield? Fun fact: This was the film debut of Pia Zadora (who plays Girmar). Zadora went on to have a small but impacting film career, as well as releasing numerous albums."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Scarecrow-88",
        "review_rating": "5",
        "review_title": "Santa Claus Conquers the Martians",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "JoeB131",
        "review_rating": "5",
        "review_title": "Comically silly...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Uberrees",
        "review_rating": "1",
        "review_title": "So bad it's funny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "neon47",
        "review_rating": "1",
        "review_title": "Pretty not good.",
        "review_detailed_main": "Don't let the title of this movie mislead to into believing that this is some sort of B-horror, it isn't. It's a children's movie... a very bad children's movie. I've sat through movies that have put me in more pain than this (mostly sequels) but there really isn't anything good about this. First off the title of the movie is enough to pull in nearly any B-horror fan before they realize that Santa isn't up in the sky blasting away at the Martians. Rather he is kidnapped and ends up going pretty quietly. The problem with Mars is that there is no joy to be had for the children on Mars. Drawing this from the sad looks on his children's faces, the Martian leader decides it'd be a great idea to kidnap Santa and force him to spread Christmas joy on their planet. Again, Santa has no problem with this and goes quietly. However, the evil Voldar sees weakness in joy and decides that Santa must be destroyed before all of Mars becomes a happy place. So does Santa actually conquer anything? No. Is there anything in this movie that's worth seeing? Unless your extremely forgiving when it comes down to children's movies, no. Another thing that should be noted is that I do believe the soundtrack for this movie was recorded in the 7th layer of Hell. It's that bad. Not even worth the $5.50 bin at Wal-Mart. If you want a Christmas movie I suggest revisiting Tim Burton's The Nightmare Before Christmas."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Coventry",
        "review_rating": "3",
        "review_title": "HO HO Ho Horrible!",
        "review_detailed_main": "The complete and utter ineptness of this movie is very entertaining for approximately 20 minutes. Then it's simply becomes another incredibly lame and irritating no-budget Sci-Fi flick from the early 60's. The opening sequences are still somewhat refreshing and, bearing in mind this was originally intended to be a film for children exclusively, you begin to develop impressions that it doesn't really deserves its notorious reputation of being one of the all-time worst stinkers. All the children on earth get anxious because Christmas time is coming up and jolly music plays from every television set. For some hi-tech reason, the children on Mars receive the earthly TV-channels as well, and they're depressed because they haven't got a bearded fat guy in a red suit that hands out presents. The great leader of Mars \u0096 busy man that he is \u0096 promptly organizes a mission to earth in order to kidnap Santa and return the happiness to his children's green faces. So far so good, the sets and costumes are incredibly cheesy and laughable, but you can't help smiling at the screen. Then it all goes downhill from the moment Santa (and two random kids) are abducted and taken back to Mars. Santa Claus doesn't exactly \"conquer\" the Martians; he befriends them! For you see, there's only ONE mean and ill-natured Martian but all the others are hospitable and friendly. Then the movie just gets plain boring and I imagine even kids from the early 60's would have found it dreadful! The enthusiasm of cast and crew seems to have disappeared and there are absolutely no ingenious gimmicks anymore. John Call has the ideal posture and charisma to play Santa, but even he can't produce a convincing \"Ho Ho Ho\" when the end of the movie nears. Painful..."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Christmas-Reviewer",
        "review_rating": "10",
        "review_title": "I loved this film as a child",
        "review_detailed_main": "BEWARE OF FALSE REVIEWS & REVIEWERS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM HONEST\n\nGrowing up in Oxnard Ca this film always played on KTTV Channel 11 around Christmas time. It later moved to KTLA Channel 5 and Pia Zadora even did a fireside chat with television movie host Tom Hatten.\n\nEven today watching this film is a huge part of my \"Christmas traditions\". It was a \"Must See\" when I was a child and today I still watch it (Around Christmas)\". I also still watch \"Rudolph\" \"Charlie Brown\" \"Frosty the Snowman\" and MGM's \"A Christmas Carol\". One of the main reasons why I love this film is because I loved John Call as \"Santa Claus\". He is a huge delight. He is a terrific Santa.\n\nIn this film \"Santa\" gets kidnapped by Martians. The reason is that the children of Mars do not have a \"Santa\". They also do not know how to have \"fun\". So the leader of Mars goes to Earth and kidnaps Santa as well as 2 earth children. \"Santa\" then slowly wins over the Adult Martians even though there are certain forces against him.\n\nNow if you are an adult (and you have never seen this) you will think this movie is terrible. Children (Who still believe in Santa) will be entertained. It is harmless fun! Even the theme song \"Hooray For Santa Claus\" is \"Cute & Catchy\".\n\nThe films low budget is all too apparent here however if this film did have a bigger budget then it might not have the weird charm.\n\nI beg all of you to watch this film. Have a viewing party. It is a film that many people have seen and actually are afraid to admit that they enjoy it.\n\nI am not afraid to admit that I even bought this film on Blu-Ray."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "apurcel1",
        "review_rating": "7",
        "review_title": "Ridiculous and predictable in a really awesome way",
        "review_detailed_main": "This movie was fantastically bad. I found it in the Dollar DVD section at Target and was too amused by the title not to buy it. Best dollar I ever spent. Having just completed a Science Fiction Film Analysis class at school, my friends and I amused ourselves by picking out the parallelisms and political allegories. It was incredibly cheesy with terrible sci-fi elements and very predictable. But it was so awesome.\n\nBasically,if you can appreciate a terrible movie, definitely check this one out. Or if you're a bored college kid looking for a movie to make fun of. Or I guess if you hate bad movies and you're a masochist you could always watch it to torture yourself. See? this movie is perfect for a wide audience!\n\nFYI: I am being completely serious here. There is no sarcasm. I really enjoyed how cheesy this movie was."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "3",
        "review_title": "A must-see if to see how hysterically bad it is",
        "review_detailed_main": "I wouldn't put among the worst of the worst, but to be honest Santa Claus Conquers the Martians is not a good movie in my view. However, it is definitely worth seeing to see how bad it is. I do think the film starts off well, the first twenty minutes are refreshing and entertaining. After that, it is a different story, and although it is a mess it is hard not to be entertained by it.\n\nFirst off, while the sets aren't too bad, the effects are hysterically awful and the costumes especially with the martians are pretty hideous. The cinematography is also rather shoddy. The music is okay, but gets too much after a while. With Hooray for Santa Claus, I wasn't sure whether to cry \"Three cheers for Santa Claus\" or \"Bah humbug\".\n\nThe script is appalling mostly, cloying and unintentionally camp, while the story is incoherent and mean-spirited and there are some real pacing problems especially in the middle. The acting is not great either, John Call initially seemed a good choice for Santa with just the right charisma, but he is too jolly and he looked drunk or out of it in some way. I think a previous commentator is right, maybe he did read the script, knew it was terrible and decided to play along.\n\nOverall, pretty bad but entertaining also. 3/10 Bethany Cox"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Dethcharm",
        "review_rating": "",
        "review_title": "\"Something Is Happening To The Children Of Mars!\"...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "JohnHowardReid",
        "review_rating": "1",
        "review_title": "Not quite the worst movie ever made",
        "review_detailed_main": "Although this movie has amassed a cult reputation as one of the worst movies ever made, it's not really inept enough to justify even a cursory look. True, the title song has a certain zingy bounce to it that promises hilarity and for a while there it seems we might be in for a mild spoof on Christmassy movies or even a send-up of Day the Earth Stood Still. Alas, despite the expenditure of a fair bit of money on sets and costumes, every plot opening turns into a dead end.\n\nAdmittedly, not the worst movie ever made but it tries mighty hard to reach that distinction. If the script was meant to be joked up or played tongue-in-cheek, almost the entire cast seems unaware of that fact. In fact, John Call and Leonard Hicks are offered some really splendid comic opportunities but both seem relentlessly bent on playing the script straight, despite prodding by Vincent Beck and Bill McCutcheon (plus Don Blair in a small part as the television news announcer) to follow their examples. Mr Call in particular deserves some sort of commendation for his successful efforts to rob the role of any satiric humor, although Mr Webster's unhelpfully leaden direction must also cop a fair share of the blame."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lost-in-limbo",
        "review_rating": "1",
        "review_title": "There ain't no conquering here.",
        "review_detailed_main": "On Mars, the Martian's kids are feeling rather blue, so the leader of the Martians come up with a plan to kidnap Santa Claus from Earth to bring him back with them so he can spread the Christmas joy, by giving presents to their children. But also on the trip to Mars are two Earth children who get caught up in this mess by helping the Martians find Santa Claus. Not everyone is too happy about this outcome, as one of the Martians doesn't like this idea of Santa spreading fun to their children, so he goes out of his way to stop that happening.\n\nWhat's Christmas without watching a Christmas flick. But oh my what a film to pick! I remember watching this flick a long time ago, but I didn't remember too much about it and that was definitely a good thing from what I just watched! It isn't the worst film I've seen, but it isn't that far away from it. 'Santa Claus Conquers the Martians ' does give the word bad, a really bad name. Ah, maybe bad is too loose of word to describe it. Abysmal, yeah that's better. Sure, this is aimed at children, but really there's whole lot better Christmas flicks out there! Especially since it treats you as if you're damn fool! There's nothing subtle about it with you basically being slap in the face with its heavy handed nature of forced morality and force-feeding you, to where the story is heading. If you're thinking that it might be so bad that it's good entertainment\u0085 far from it, actually. Ed Wood might be proud of it as it does share patterns to his type of work in the cheap effects, lousy costumes (except Santa's, but not the polar bear) and cardboard sets, but his films had heart by being too over-the-top, while this made in the basement production was a total drag and ultimately cold. Even if there's one or two hammy performances amongst many droll ones. That would be John Call as Santa Claus. The Christmas spirit to me came across as false and rather unsettling. Yeah, unsettling. Something about it and all the happiness felt unstable and just got my nerves. When they broke into that unnatural laughter and strained humour, *argh*, don't they know their limitations in this incompetent hogwash. Nice idea, but handled without any real passion and it shows by its restless nature. So, this is how to celebrate Christmas! And to think, is this feature mocking itself or being serious. Ah, I think more so the latter. Bah! Oh my beloved eyes and ears. Why did I put you in this much pain?\n\nOther things that stand out in this uninspired trite has got to be the choreographed action pieces that just blows you away. Blows you away at how amateurish they were. Pretty much it's cartoon style in its action, gags and wait the drowning music. Stock footage is patched in rather elegantly! That's if you got bad eye sight. The diabolically lengthy script with its emotionally touching and you bloody don't say speeches aren't helped by the mostly robotic performances. These mainly came from the kids and the aliens from Mars. Well more so, people who just like to wear green (because it's logically that they be green) and have a hard hat with tubing and a TV antenna on top. Gee, they looked so realistic! It looks like it just comes second nature. Be careful you don't lose any brain cells as the catchy, but annoying opening and ending tune sticks in your head! \"Hooray for Santa Claus\" No, \"hooray it's over\" sounds a lot better.\n\nExpect the unexpected. But that doesn't mean it's a good thing! Oh, by the way, the Martian's stun ray really works a miracle."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "soremongs",
        "review_rating": "1",
        "review_title": "Embarrassing to watch",
        "review_detailed_main": "I didn't like this movie when I was a kid. Now, as an adult, I can appreciate the true awfulness of this movie. I love movies that are so stupid that they're entertaining. I love Ed Wood movies, Lost in Space, Zontar the Thing from Venus, but this movie surpasses the stupidity threshold. If your children insist on watching this movie, I recommend leaving the room!! Does this movie have any redeeming qualities?...Hmmm...Vincent Beck did do a fair job portraying the villain...and...Oh yes,you do get to see a prepubescent Pia Zadora standing around with a blank look on her face when she doesn't have any lines!! There's plenty of holiday entertainment out there you can watch before enduring this."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "SANTEE Claus!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "tnrcooper",
        "review_rating": "2",
        "review_title": "Kitschy classic",
        "review_detailed_main": "The children of Mars are miserable and so the elders of the planet go to the ancient Oracle of their planet who explains that the children of Earth are happier because it's the Christmas season and so they are excited about Santa bringing them gifts. The wise elders (among then Vincent Beck, Charles Renn, and James Cahill) decide they need to kidnap Santa and bring him to Mars so that their kids can experience some of the joy that Earth children are experiencing. Voldar (Beck) doesn't believe Mars needs Santa Claus and so he attempts to undermine bringing Santa home at every turn.\n\nI really can't hate a movie this inept. Obviously the resources and technical savvy of how to make a movie are missing in this case but it's obvious that the filmmaker wants to tell an upbeat story about the joyfulness that Santa characterizes. That he was completely technically inept, that the spaceship looks made of tinfoil, that much of the acting would not be out of place at an elementary school Christmas play, and that the dialogue is wooden enough that it might be possible to carve a canoe out of it is all true. That said, I don't find this unlikable. It is what it is. It's not the vanity project of a completely unqualified singer (Glitter, Swept Away anyone?) or the cynical, calculating Hollywood film which doesn't care about its own cynicism or the intelligence of its potential viewers (Waterworld, just about anything Steven Seagal, Renny Harlin, or Van Damme have been involved in for the last 20 years). If you like sweet, kitschy movies, this is one for you."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ofpsmith",
        "review_rating": "5",
        "review_title": "So bad it has to be good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "StevePulaski",
        "review_rating": "4",
        "review_title": "Public domain goodness",
        "review_detailed_main": "Santa Claus Conquers the Martians is a public domain fantasy film that was released in 1964 and is often regarded as one of the worst films ever made. As of April 2011, it is ranked number seventy-nine on the IMDb Bottom 100 with a 2.3 overall rating. It's such an odd little, creature of it's time, it's getting the \"wonderful\" honor of a remake. Completely unnecessary. There is pretty much no way this film could be made to be good.\n\nThe title alone mystifies me. At no point in the film does Santa Claus \"conquer\" anything. Martians are grim after watching Christmas specials on Earth depicting the jolly man St. Nick as a guy to bring happiness. They have no one like that on their planet. So the Martians summon an old man that tells them Mars is awful because there is no Santa Claus. So the Martians capture two earthlings that lead them to the \"real\" Santa Claus at the North Pole.\n\nHow the film is shot is another thing that is difficult to explain. It's 1960, color is quite popular in movies. Being only shot with $200,000 and having a name with \"Santa Claus\" in it probably means they wanted to use essence of color in the film. The color is dimmer than a 3D film. I can't tell what process was used. Obviously, Technicolor wasn't. With this, some scenes are in color, but it's so dim if the color isn't red or blue it's hard to see.\n\nSometimes, on frequent occasions, if something large in the movie is a bright color, like red, the color will spill onto other things around it. I know it's 1964, but color was around. This is lower budget, but if this was black and white it would look a lot less wonky and protruding.\n\nThe acting is unbelievably atrocious, but oh how I love it. There is a scene where the idiot martian Dropo (McCutcheon) is getting yelled at by the other martians for lazy. He runs away and \"accidently\" falls into various levers and is supposed to look like he fell into them. When he actually runs up to the levers, pulls four abruptly, and quickly grabs the other two he \"missed.\" The ship then rumbles uncontrollably. Absolutely, unintentionally scene that was an unexpected delight.\n\nWatching this with a friend was fun because we would talk back to the screen, ask the TV questions, and so on. Nothing is more fun than asking a movie why, what, and how questions that you genuinely want to know. It's like The Rocky Horror Picture Show.\n\nSanta Claus Conquers the Martians is known for it's public domain status in the United States. Public domain is where a film is open to the public and has no copyright on it in any form. Ever see those fifty movie packs in theaters that have fifty films from a specific genre? Like horror, drama, \"box office gold,\" etc. Those are all public domain films. Even though I gave the film a low rating, it's most likely the best public domain film in its own right. Usually all of the films have bad acting, a lame storyline, and poor picture quality clearly diminishing from its frequent copying from one DVD to the next. Santa Claus has all of those qualities; and it's pretty much the strangest Christmas film to exist.\n\nStarring: John Call, Leonard Hicks, Vincent Beck, Bill McCutcheon, Victor Stiles, Donna Conforti, Chris Month, Pia Zadora, Leila Martin, and Charles Renn. Directed by: Nicholas Webster."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "JH_Kalashnikov",
        "review_rating": "10",
        "review_title": "An American Classic of Bad Cinema",
        "review_detailed_main": "First I saw \"Reefer Madness.\" It was bad, but great.\n\nThen I saw \"Plan 9 From Outer Space.\" Horrible, but enjoyable.\n\nAfter that I saw \"Robot Monster.\" Awful and yet spectacular.\n\nFinally, I saw \"Santa Claus Conquers the Martians\" Wow, how can you make a lame plot for a screenplay worse? By making a low budget film out of it. And that's just what Joseph Levine thought when he released this film onto an unsuspecting Earth. Now I ask you, is this indeed the WORST film of all time? My opinion: NO. In my translation of the meaning \"bad film\" means \"unbearable, unwatchable and disposable.\" Not \"Santa Claus Conquers the Martians.\" This film is a landmark in the American motion picture industry. The makers of this film actually had the guts to create and release this film. Now that takes some serious talent! Let's not forget the actors either. Surprisingly the acting isn't nearly as bad as it's made out to be (people confuse the 'acting' with the 'plot.'). The children, the Martians and even Santa Claus make one heck of an impression on a shoe-string budget film like this (don't forget that weird professor Albert Einstein wannabe). Above all, clever a production design really create a fine sense of cheesiness. Now, how about a brand new DVD 'Special Cheesy Edition' of \"Santa Claus Conquers the Martians?\"\n\n\"Santa Claus Conquers the Martians\" is a rare and satisfying little gem of a film that broke, no, shattered all the rules of making a \"good and enjoyable\" movie. Now if only the bad films we get nowadays would be as bad as this one. Then they would actually be deemed \"enjoyable.\"\n\nI give \"Santa Claus Conquers the Martians\" 5 frozen-stiff elves zapped by Voldar, out of 5.\n\nA true cinematic cult classic."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "christinedavis-42275",
        "review_rating": "7",
        "review_title": "Don't Be Hating",
        "review_detailed_main": "At Christmas time my uncle brought this movie over and made me and my best friend watch. SInce we don't believe in Santa we did not want to see this. My Uncle however was insistent and so we watched this on Christmas Day and I am glad we did.\n\nAt first I thought that was a SNL sketch. It was so weird. After 10 minutes I got into it. Its weird but crazy fun.\n\nThe plot is that the Martian kidnap Santa. Mars doesn't have a Santa or every herd of him. So after the \"Martian King\" tells them about Santa its off the earth to kidnap our beloved Christmas Icon.\n\nStupid movie but so much fun to watch!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Ewan-7",
        "review_rating": "1",
        "review_title": "A Must-See Masterpiece!",
        "review_detailed_main": "This is probably the worst movie ever made. It combines terrible acting, terrible jokes, terrible sets, and terrible visual \"effects\" with a terrible plot. Replace all those \"terrible\"s with any derogatory term you'd like to insert. However, it is hilarious to watch and see how awful this movie really is. In this, it is a MUST-SEE. This movie is a MASTERPIECE in that it is absolutely not a masterpiece in any way, except that it is a masterpiece of awfulness. This movie is incredibly awful. Go rent it right now!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "BuckeyeBeth007",
        "review_rating": "",
        "review_title": "A Children's Christmas Classic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jabarker81",
        "review_rating": "1",
        "review_title": "Mystery Science Theater 3000",
        "review_detailed_main": "Now, when I watched this movie on MST3K, I was just binging the episodes Netflix had at the time, and this movie stuck out at me because I recall Nostalgia Critic mentioning this in one of his reviews. And needless to say, not only is this movie bad, but it's so insultingly painful to watch that my brain cells were killed off each minute. It was so bad that I needed to watch a good movie to restore myself afterward."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "richardchatten",
        "review_rating": "3",
        "review_title": "\"All this trouble over a fat little man in a red suit!\"",
        "review_detailed_main": "This unflinchingly testament to the tensions of the Cold War represents a typically enterprising choice by Talking Pictures as their Christmas treat for the kiddies. Often reviled as one of the worst films ever made: for God's lighten up, it's for kids, who absolutely lapped it up!! It's all very pretty in colour and it boasts a charming song that later sold well as a single.\n\nSanta himself is portrayed as a genial old cove who smokes a pipe, and his Missus makes a rare screen appearance. The Martians wear probably the silliest outfits - with headdresses that make them look like insects - since the days of 'Flash Gordon' (although 'Lost in Space was soon to surpass it) and one the daftest-looking robots you're ever likely to see.\n\nThe Martians all have American accents, greet each by rubbing noses and seem to consist of just one family and a handful of henchmen. The po-faced delivery by most of the cast is rather at odds with the raucous score by Milton DeLugg, and the sets belong in the shabbier episodes of 'Star Trek'.\n\nIt's good to see both sides of the Iron Curtain united against a common foe. There's also a little bit of what passes for topical humour in that one of Santa's reindeer is called 'Nixon' and the head of America's space programme is called 'Werner von Green' and that one of the Martians is entranced by his introduction to the slinky spring. Although by far the least funny element is predictably the comedy relief."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "bensonmum2",
        "review_rating": "3",
        "review_title": "\"Santa, you will never return to Earth, you belong to Mars now.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "MartianOctocretr5",
        "review_rating": "4",
        "review_title": "Utterly ridiculous, but fun if you're in the mood for nonsense",
        "review_detailed_main": "A lot of things have happened to the poor old jolly elf over the years. In different movies, he's been put in jail, kissed by housewives, tried for lunacy, knocked off a roof by Tim Allen, and one time a guy tried to blow up the North Pole. This is the classic among them all, when Santa gets kidnapped by Martians. The Martian kids are depressed, you see, so the Martians abduct Santa to make their kids happy again.\n\nCampiness is to be expected in a kids' movie, but this movie soars far and beyond all expectations of cheesiness. Martians have poorly applied green makeup that doesn't cover all their faces. Also, they wear used helmets painted green with broken antennae attached, for some reason. The robot and the polar bear are two of the most absurd monsters, and the freeze ray doesn't work too well on actors who visibly move while \"frozen.\" There's one character meant to be comic relief, but he's hard to find, since everyone else hams it up as bad as he does. Cheap sets, probably left overs from a grade-school play. Nonsensical dialogue, plot holes, miscellaneous errors, the list goes on. This movie is also the source for a trivia question: Girmar (\"girl Martian,\" get it? lol) is played by whom in her first role?\n\nWith all its blunders and goofiness, I'll give the movie one thing--it maintains a cheerful approach at all times. It even awkwardly manages a message about kindness winning enemies over as friends. It's necessary to approach the movie as a joke, though. Taking it at face value will probably leave you bored. I suspect that the original target audience of children were probably bored, since the movie drags in several places. As a \"so-stupid-it's-funny\" movie, this one is a novelty in its stunning ineptitude."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ColtSeavers",
        "review_rating": "4",
        "review_title": "I beg your pardon. This one's quite OK !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Waiting2BShocked",
        "review_rating": "4",
        "review_title": "Film-Making Plan 9 From Mars",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "superracingriley",
        "review_rating": "2",
        "review_title": "It's like being forced to spend a holiday in hell!",
        "review_detailed_main": "This movie is so bad that it makes Twilight look like a masterpiece in comparison, almost all the characters are bland and show no emotion whatsoever. Even Santa has a bad personality. I don't care if you like this movie or not, that's your opinion but god I hate it"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Cristi_Ciopron",
        "review_rating": "8",
        "review_title": "A kind of clumsy magic, very savory; the charm and integrity of some primitive productions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "matoolz2",
        "review_rating": "7",
        "review_title": "One of my favorite Christmas movies",
        "review_detailed_main": "I saw this movie in 1964 when I was 8 years old and I loved it. I next saw it a few years ago when the Sci-Fi channel aired it around Christmas and I still loved it but for different reasons. As a child during the 60`s this movie contained all the things a kid could want in a movie...Martians, rocket ships and Santa Claus to boot. As an adult it is hokey, poorly made and silly....but it brings back memories of the days that we were amazed by.....Martians, rocket ships and Santa Claus. I taped it when the Sci-Fi channel aired it and I show it every year at our Christmas party...even though I hear nothing but complaints from our party guests I still am transported back to that time when we were amazed by.......well you know."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "keithjco",
        "review_rating": "4",
        "review_title": "Pure fun with the MST crew",
        "review_detailed_main": "An awful bad movie rescued from oblivion by Joel and the bots. Smart jokes elevate this to a slightly bigger level than initially deserved. 3 stooges references, JFK, Warner von braun and Nuremberg, Vietnam and all sorts of 60s. Pop culture references alongside a tributrsong to roadhouse movie."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kevin_robbins",
        "review_rating": "4",
        "review_title": "This is a very bad movie that can be a fun watch despite being poorly done",
        "review_detailed_main": "Santa Claus Conquers the Martians (1964) is a movie I recently watched with my daughter on Tubi. The storyline follows martian children who discover Santa Claus and want to steal him and bring him to Mars. They come to Earth, kidnap some children and make the children help them capture Santa Claus. The Martians are about to discover once they have Santa they may have bitten off more than they can chew.\n\nThis movie is directed by Nicholas Webster (Manbeast! Myth or Monster) and stars John Call (Young Man with Ideas), Vincent Beck (Firepower), Bill McCutcheon (Steel Magnolias) and Pia Zadora (Hairspray).\n\nThis is probably the worst attempt to create martians of all time. There are some funny lines here and there and Santa Claus and the children are well done and fun. The inside of the spaceships look cool though the shots of outer space...not so much. The polar bear and robot in this are hilarious.\n\nOverall, this is a very bad movie that can be a fun watch despite being poorly done. I would score this a 4/10 and recommend seeing it once."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kyleesky",
        "review_rating": "3",
        "review_title": "its a BAD movie but its fun!",
        "review_detailed_main": "This movie is so BAD! Don't watch it for a Christmas movie it is not Christmasy it is a space movie. And it is from old times. It is not good today. But it is fun to watch- cuz its so bad. It is a really silly movie to but also really boring some times."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Bernie4444",
        "review_rating": "5",
        "review_title": "Hang up that mistletoe",
        "review_detailed_main": "Soon you'll hear Ho! Ho! Ho!\n\nIt is the Christmas season on earth. The Martian children are in a funk and will not eat their chocolate cake pills. Kumar (Leonard Hicks) a concerned father and a leader of the council calls upon the old man of the cave. His diagnosis is that Mars Needs a Santa, so in the interest of the children of Mars Kimar sets out to pilfer Santa (John Call.) Opposed to this attempted attitude change on a planetary scale is the curmudgeon Voldar (Vincent Beck). You cannot miss Voldar because he looks like green Groucho Marks. To add to the pathos a couple of pint-size hostages are also taken, Billy (Victor Stiles) and Betty (Donna Conforti).\n\nIs this the end of Christmas, as we know it?\n\nWhat is Voldar's evil plan?\n\nIs Billy & Betty doomed to drift around in space, or be captives of Mars forever?\n\nOn the other hand, is it just possible that Santa Claus Conquers the Martians?\n\nStau tuned for the solution."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "catalog-43954",
        "review_rating": "5",
        "review_title": "A Blast From The Past ! ! !",
        "review_detailed_main": "A blast from the past... back when there were no CGI effects.. This low budget, low tech, low quality work is a reminder how funny, silly, and often stupid the old sci-fi movies were back in the '50s & '60s... I loved it ! ! !"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kevinolzak",
        "review_rating": "2",
        "review_title": "Too dull to be effective camp",
        "review_detailed_main": "1964's \"Santa Claus Conquers the Martians\" was released by Joseph E. Levine's Embassy Pictures, director Nicholas Webster later at the helm for another trip to the Red Planet, 1967's \"Mission Mars.\" When the Martian leader (Leonard Hicks) decides that his children need some jolly good cheer to snap them out of their doldrums he's advised to travel to Earth in search of a Yuletide figure in a red suit and white beard located at the North Pole, but with a Santa found on virtually every street corner he finds himself in a bind. Fortunately, two earth children direct the Martians to Santa's workshop, all three kidnapped to exile on the Red Planet. Vincent Beck is the lone Martian who opposes such pointless frivolity, yet without him there would be no story and little enough amusement as it is, despite the worst looking polar bear suit ever deigned to be captured on film. Too cheap and listless to be appreciated as an inept cult film and too dull to amuse even the youngest viewers, military stock footage dragging out the running time to 80 minutes (shooting lasted 10 days in Long Island's Michael Myerberg Studios, a former aircraft hangar, surviving kiddie matinees well into the 1970s, its director still earning a $6 residual every year at Christmastime). John Call does at least look the part of Santa Claus, though his laugh needed a bit of work, and the little Martian girl is played by 10 year old Pia Zadora, who first gained a certain measure of celebrity notoriety during the early 1980s."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "keanmccracken",
        "review_rating": "1",
        "review_title": "The lamest movie I have ever seen",
        "review_detailed_main": "This movie is terrible. Its not one of the old horror / sci fi movies that you can enjoy for the ridiculous plot or how cheesy it is. This movie is not like that at all, which is what I expected when I went into it knowing no background information. This is a kind of family comedy type movie that has absolutely no redeeming qualities, it is just boring. The most boring and lame thing I have ever seen. I'm embarrassed I even finished this movie. Unless you are five years old or younger just don't waste you're time. Even if you have nothing else to do, I suggest do nothing. This movie is FAAAAR worse than sitting there doing nothing."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "moonspinner55",
        "review_rating": "2",
        "review_title": "My high school allowance was more money than the producer spent on this thing!",
        "review_detailed_main": "Calling \"Santa Claus Conquers the Martians\" 'ultra-cheap' is really paying it a compliment. It makes Ed Wood's bungled epics look well-made (and positively inspired!). Plot concerns Santa and two tykes being abducted by aliens...and that's it! No jokes, no special effects, just a pre-teen Pia Zadora in green-face. Truly abhorrent, although I have to say that theme song by Milton Delugg is kinda catchy. David L. Quaid was responsible for the cinematography (if you can call it that). Quaid later lensed \"Pretty Poison\" and Frank Perry's \"The Swimmer\", which goes to show even the most talented people have a skeleton in their closet. * from ****"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "laticewilliams",
        "review_rating": "10",
        "review_title": "Come-On everyone this Film is Fun",
        "review_detailed_main": "There is plenty of films that get made that turn out bad. Hollywood has given us lots of mega turds. Every Adam Sandler movie is terrible. Also most films that featured a Saturday Night Live Character are most of the time laugh free. All of them cost millions and most of them could not ring a laugh out of me. Not to mention none of them have one moment that was worth remembering. This is not the case with \"Sana Claus Conquers the Martians\". It is campy but it is fun. There is plenty of memorable moments. My favorite is when the toy manufacturing machine goes haywire.\n\nIn this movie the people of Mars kidnap Santa Claus so he can bring the \"Child Out\" in the children of Mars. Yes its not great cinema but it is entertaining\n\nAdults if you don't like it fine but children will. It is made for children that believe in Santa."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Poison-River",
        "review_rating": "7",
        "review_title": "Lay off all the \"World's Worst Movie\" nonsense.",
        "review_detailed_main": "What is it with everyone being so callous towards this movie? It's all the Medved brothers fault for including it in their '50 Worst Movies Of All Time' book. Remember, they also once said that 'Grease' was the second worst movie of all-time(after 'Plan 9...'), and that Romero's 'Night Of The Living Dead' was one of the worst movies of all time. So what do they know? Look at the the simple facts; its a Christmas movie! It's a silly sci-fi romp! It's, y'know, for kids. If you're looking for Resnais, Fellini, Brakhage, Ozu etc, don't come looking for this. And therefore don't go dissing it so severely. Have some of you NO sense of humour, or any kind of 'inner-child'? Aren't there far more unworthy movies deserving of such a verbal kicking?(Gigli, Ishtar, Swept Away etc)\n\nSome of the plus-points the movie has, I would say, are; the Martian Home sets, which look like something straight out of the pages of Outre Magazine. The hilarious polar bear.....come on, admit that it makes you laugh. The Martian Mommy....a bit of a retro-chic thing going on, one for the older (male) kids. The theme song....be honest! You can't help singing along, especially when the karaoke-style lyric boards come up at the end.\n\nObviously the Mystery Theatre version will highlight the myriad flaws the movie has, so get the original version.\n\nHooray for Santy Claus!!\n\nHooray for Santy Claus Conquers The Martians!!!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "cohen402002",
        "review_rating": "5",
        "review_title": "a must see awful movie",
        "review_detailed_main": "this movie is awful but completely lovable like a small child or an elderly relative or even your dad on the dance floor.\n\nit has the sophistication of a child - a quality that many movies have tried to reach.\n\nmartian names are simple momar is mother martian for example.\n\ni rated it 5 as of course the technical level and script are both poor. not for pure special effect fans or lovers of strong plots. however it is a must for movie fans who love movies as an expression of humanity as it shows or simplicity\n\ngood viewing"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lemon993",
        "review_rating": "",
        "review_title": "All this fuss over a fat little man in a red suit.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "AwesomeWolf",
        "review_rating": "1",
        "review_title": "To quote Homer Simpson: \"Huh? What is this crap?\"",
        "review_detailed_main": "If a name like 'Santa Claus Conquers the Martians' doesn't ring off \"worst movie ever\" warning bells in your head, I don't know what will. This is pure schlock, start to finish.\n\nThe plot? Well, the kids on Mars are raised in such a way as they reach the intellectual level of an adult when they are physically children. The current crop of kids are obsessed with 'Earth television', and the concept of Christmas. The solution to this? Well, some sneaky Martian adults kidnap Santa, and for no apparent reason, some kids from Earth, and take them all to Mars so the Martians can enjoy Christmas.\n\nDon't let the title fool you. At no point does Santa actually conquer any Martians. I'm guessing the title refers to his bringing good will to Mars. What a let down. I was hoping for some sort of war-mongering, bad-to-the-bone Santa that handed out whoop-arse instead of toys. I guess I'll have to make my own movie like that, but for now I still have this.\n\nDespite three paragraphs of negative comments, this is fairly enjoyable if you like the 'so bad that its funny' angle. The Martians don't come off as that mean, and Santa is pretty naive, a 'Jurassic Park' scientist kind of naive. The quality of the story defies description, and the special effects could be bettered by a blind chimpanzee. A drunk, blind chimpanzee. If I were an actual movie critic, I would be insulted by this and call it an abomination unto movie making. I wouldn't be surprised if a real critic had said that already, but those guys just can't have fun.\n\n1/10 - Check it if you're into B-movies. In fact, when I acquired a copy of this movie a year ago, it was 16th on IMDb's worst 100 movies. Unfortunately it has been bumped up to 27th, an insult to this fine example of awfulness."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Finntroll",
        "review_rating": "1",
        "review_title": "I knew acid was a common drug in the 60's but this is ridiculous.",
        "review_detailed_main": "You want stupid? You want insane? You want awful? Then, ladies and gents, I suggest you look no further than Santa Claus Conquers the Martians! This is by all means the worst movie I've seen, even Hercules in New York looks like a masterpiece compared to this pile of manure.\n\nSanta Claus, in this case a retarded, raging alcoholic, is kidnapped by martians and along with two annoying kids played by horrible kid-actors goes to Mars to bring the Christmas spirit there.\n\nWords can't really describe how poor this movie is. The settings look like something that's been threwn down a pool of liquid plastic and then spray painted by very drunk people, the dialog is jawdropping and goes something like this:\n\n\n\nAs for the actors, I bet everyone was high when they made this. Especially Santa, who laughs in every sentence.\n\nAwful ideas, made in the most awful of ways by and with awful people.\n\n1/10"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Gislef",
        "review_rating": "1",
        "review_title": "Is there a \"0\" rating available?",
        "review_detailed_main": "This \"Christmas classic\" is anything but, although TNT and a couple of other cable networks have decided to make it traditional. Gee, that and colorization: someone go over and burn Ted Turner's mansion down, please. Nobody can act in this, John Call makes a hideous Santa, but you can get chuckles watching Leonard Hicks do his Charlton Heston impersonation. The F/X are worthy of a elementary school pageant, and each plot point is spelled out in excruciating detail. Brain-dead items like the characters' names (Kimar = King Martian, Girmar - Girl Martian, Momar = Mom Martian) just add to the excruciating pain."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Yvonne333",
        "review_rating": "1",
        "review_title": "Anything with Pia Zadora in it must be a stink burger...",
        "review_detailed_main": "With a theme song of \"Hurray for Santee Claus\", Pia Zadora and water heater tubing on football helmets---this has the makings of one of the worst films in cinematic history.\n\nNever has such a wonderful holiday like Christmas been abused by the lack of a real film budget like Santa Claus Conquers the Martians (SCCM). I'm surprised that the cast of SCCM didn't pay to be in this cinematic suppository.\n\nPlease, if you have any decency, never submit children, or anyone for that matter, to this painful, boring, and campy film.\n\nIf someone gives you this as a gift, offer to have burial at sea if they hold open the toilet lid."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lambiepie-2",
        "review_rating": "1",
        "review_title": "Hooray For San-ty Claus!! Kill me now.",
        "review_detailed_main": "For years, I thought this film was produced in Japan by the same folks who did \"Godzilla\" in the 60's.\n\nFor years every Christmas, I asked Santa Claus to destroy this film and keep Independent hometown channels for showing it.\n\nThat's when I realized there WASN'T a Santa Claus. They continued to show this tripe.\n\nI guess in 1964 they thought kids would like this. Now don't get me wrong. I am of the generation that was reared on \"Astro-Boy\", \"Ultra-Man\", \"Space Giants\" and several Sinbad Movies as well as \"Jason and the Argonauts\" but this was just utterly stupid.\n\nIt's not that the \"idea\" was bad..Mars inhabitants (silly adult ones at that) kidnapping Santa..actually it took YEARS for the idea to be done correctly and with the right factors such as \"South Park\" did with a little parody on \"Black Hawk Down\" and several other factors. This was just so stupid. As a five year old child, I turned the channel on this tripe. The sets were cheap, they were painted green...all that was missing was Santa taking out a bottle of \"ThunderBird\" liquor holding it up to his lips and proclaiming \"Merry Christmas to all and to all, a good night\". Actually that would have been more entertaining.\n\nTake it from me, there is NOTHING nostalgic about seeing this film years later if you're of the generation that had to be put through this on TV like I was. Save your children, don't show them this unless you want to punish them.\n\nBut...Hmmm...come to think of it..making them watch this film is actually better punishment instead of putting them in a corner for a \"time out\"."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "a textbook example of how NOT to make a movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Brain_Guy",
        "review_rating": "4",
        "review_title": "Very odd, pure mid-1960's",
        "review_detailed_main": "This movie, though poorly made, does have an endearing quality to it that peeks through all the zaniness. Through all the oddness, you can still sense a true \"Christmas spirit\" about it. Santa Claus Conquers The Martians combines a typical 50's-mid 60's B-movie obsession with UFOs with a typical TV Christmas movie feel. One of the things that sticks out about the movie for me was that it didn't portray the Martians as the usual \"evil, murderous aliens\" they usually were in B-movies of this time period (well, except for Voldar). Their desire to make their children happy is what leads them to kidnap Santa Claus. Santa seems more than willing to help out the Martians, even running the toy shop without complaining. All is well at the end for everybody- Santa and the earth children go home, the evil Voldar is humiliated and defeated, and Droppo is inaugurated as Mars' very own Santa Claus. Overall, a decidedly weird but ultimately enjoyable movie."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Movie-Time-Everytime",
        "review_rating": "10",
        "review_title": "Why the Hate?",
        "review_detailed_main": "This film is not that bad. It is weird but for what it is it works wonders. To me this film was part of the annual must see movies when it popped up on television during Christmas. Yes the plot is silly. The acting silly but you know what \"I still enjoy this film\" because at the end of the day it still told a story and it entertained me.\n\nNow the lo frills special effects help makes this film charming. It is very sad that this film is in the public domain. Which means everybody can release this film on DVD also there is no money that can be made from a restoration which this film sadly needs.\n\nIf you don't know the story in a nutshell:\n\nMartian ruler Kimar (Leonard Hicks) is upset that the children of Mars are lazy and under the influence of too much pop culture from Earth. They are obsessed with the planet's television programs and don't want to do much of anything. In an attempt to get the kids peppy again, Kimar orders the kidnapping of Santa Claus (John Call), hoping that the jolly old toy maker will know how to cheer the children up again. But two Earth children are also nabbed, and this complicates things for Kimar."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "stewartloftin",
        "review_rating": "7",
        "review_title": "Wonderful memories!",
        "review_detailed_main": "I watched this when I was 6 (1969). It was back when there were only a couple channels to choose from in Houston. It really is a cute, fun movie. Yes, it is a low, low budget film but that just adds to the memory."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "preppy-3",
        "review_rating": "1",
        "review_title": "Absolutely the WORST Christmas movie ever...so it's a must-see!",
        "review_detailed_main": "The children of Mars are unhappy. It seems they want a Santa Claus but don't have one! So some guys from Mars kidnap Santa (and two annoying kids) to bring joy and happiness to the Martian children. It works but they make it clear that Santa is going to stay in Mars...forever. Trust me--this plays even worse than it sounds!\n\nA now classic bad movie. I actually caught this on TV when I was about 6 or 7. Even at that young age I realized the film was HORRIBLE! But it was so badly done you can't stop watching. The basic plot itself is ridiculous--even for a kids movie. All the Martians are green (!!!) and wear stupid helmets. The two Earth kids are played by the two most annoying child actors you'll ever see. The special effects are hysterically bad. The Martian spaceship is obviously a toy and wait till you see the polar bear (very obviously a guy in a bad suit) and the robot bought out to kidnap Santa. When I first saw it I broke out laughing (remember--I was 7 and still found it stupid). The dialogue is terrible and--worst of all--there's a SONG called \"Hooray for Santy Claus\" that will have you wishing you were deaf!\n\nThe acting doesn't help. Leonard Hicks plays Kimar--a good Martian. He's not bad but (understandably) looks embarrassed by being in this. Vincent Beck plays Voldar--the evil Martian. He's pretty terrible. Victor Stiles and Donna Conforti play Billy and Betty--the Earth kids. Their acting is so bad it defies belief. John Call plays Santa and he's CONSTANTLY laughing! My guess is he was drunk or actually read the script! Worst of all (and that's saying something) is Bill McCutcheon playing Dropo--the \"comic\" relief. He spends most of the movie acting stupid and overacting. Needless to say none of it is even remotely funny! Also Pia Zadora has her first role here (as one of the Martian kids). So yeah, it's terrible but it IS harmless for kids--but even they'll find it stupid! A 1 all the way.\n\n\"We don't want to hurt you Santa Claus so come along quietly.\""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "fromula",
        "review_rating": "",
        "review_title": "An Under-appreciated Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "barnabyrudge",
        "review_rating": "1",
        "review_title": "Cheap, boring and frequently inept family \"entertainment\" – doctors could recommend this movie as a cure for insomnia!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Cheap 'n' trashy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Bunuel1976",
        "review_rating": "3",
        "review_title": "SANTA CLAUS CONQUERS THE MARTIANS (Nicholas Webster, 1964) *1/2",
        "review_detailed_main": "This strong contender for the title of the \"All-Time Worst Movie\" is, typically, not as painful to watch as it has been played up to be over the years; having just watched its earlier Mexican counterpart SANTA CLAUS (1959) which I recently acquired in tandem, it was a given that I was going to get to this one too before this year was out. Anyway, the plot calls for Martian children to be 'hypnotized' by earthly TV channels and getting particularly depressed at Christmas-time because, unlike their fellow earthlings, they have no Santa Claus\u0085so, the head honcho of the Red Planet (a Michael Gough-look-a-like) decides to kidnap St. Nick (constantly letting off belly-laughs, as played by John Call) to cheer up his kids! Predictably, this plan is opposed by a trio of bumbling villains (led by a heavily-whiskered loser) who sabotage Santa's mechanical Martian toy factory and, eventually, capture the wrong Father Christmas (since, inevitably, the planet's leading comic relief – a would-be amiable idiot – dons on the red cloak to try out for the role which is vacated once Santa – and two earthly kids who were abducted with him – are transported back to their world). There is not much that I can add except to say that a credited but unrecognizable Pia Zadora apparently plays one of the Martians; while the film is, relatively speaking, livelier than the afore-mentioned SANTA CLAUS, the latter displays a more florid imagination; the odd Martian attire seems to be an amusing precursor to the much-later one worn by the dreaded Teletubbies; and, best of all, the children's ditty \"Hooray For Santy Claus\" proves to be an awfully catchy tune!!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jwwhiteh",
        "review_rating": "2",
        "review_title": "Abysmal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "sylvester-31701",
        "review_rating": "4",
        "review_title": "KeviKev",
        "review_detailed_main": "Wow! Lots of parents throwing negative review bombs without considering the 1964 social context. Well, they can now treat children to the MCU's CGI gore fest productions. Moreover video games to the likes of Call of Duty, Mafia II and Assassins Creed. Given that child entertainment and quality of life have evolved simultaneously."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "slokes",
        "review_rating": "2",
        "review_title": "When does bad cross over to good?",
        "review_detailed_main": "\"Santa Claus Conquers The Martians\" is one of the most popular bad movies ever made. One earlier comment here, defending the film, noted this popularity and said, in effect, \"If it's so bad, how come people are still watching it 40 years later?\"\n\nGood question. I think it begs another question: Is it possible to make a film so bad it actually becomes good?\n\nNot if this is any proof. SCCTM is just bad. Really bad. Bad sets, bad acting, bad direction, bad music, bad costumes (or \"custumes\" as the credits read), bad everything.\n\nThe idea of the story holds some goofy promise. On the planet Mars, children are sad, and in order to cheer them up, their caring Martian parents kidnap Santa from Earth. Santa arrives, bringing Christmas cheer along with a couple of Earth kids who help show their Martian counterparts how to have a good time. Naturally, there's one Martian who doesn't think all this merry making is so great (it's turning his people into \"Martian-mellows\"), so he sets out to stop it.\n\nFine. You know what kind of picture this is. Questions of astrophysical relativity and the available military response to Martian encroachment are really out-of-place. This is a film to watch with a five-year-old, toddlers even, and get whatever enjoyment you can through them. Children's films can be good, great even, when they are served up with the right amount of humor, care, and passion, like any other film.\n\nBut the film fails so miserably that you just cringe at the idea of an audience of any age sitting through it. The broad overacting of Dropo (Bill McCutcheon did forge a decent acting career after this, including a Tony and a memorable role in the under-appreciated \"Mr. Destiny\") sets a low bar the other players limbo right along after. Even Voldar's wacky assistants ham it up, pulling faces in every scene no matter who's speaking like they need Ritalin. I don't know if the actor playing Santa was drunk while making this movie, as some posters here say. I can only hope so.\n\nThere's unintentional comedy abounding, like the \"bear\" that sniffs out Billy and Betty near the North Pole and Kimar (Leonard Hicks must be Martian-speak for the word \"stiff\") stepping on one of the children actors' lines. Normally it's not nice to make fun of bad acting by children, but even if these kids hadn't grown up long ago, it would seem necessary to make an exception. They clearly didn't belong in front of a camera. What's that you say, there's a famous future actor in the bunch? Oh, yeah, Elliott Gould as Voldar, right. I spotted him right away. Actually, the only kid who even could read lines was Billy, and his monotone delivery is pretty much the gold standard for the tykes and adults alike.\n\nI watched the \"Mystery Science Theater 3000\" version of this movie, and I laughed and had fun. I always wanted to see this film, especially in December, and MST3K was the way to go. But I really, really mostly just wanted the movie to end. I felt sorry for these poor people on screen, left adrift by their producer, writer, and director, trying to be entertaining and just embarrassing themselves. I thought of all the ways the creators could have freshened up the story, thrown in some genuine interaction between the Martian kids and the Earth children, that might get a young viewer to care. Finally, I tried to enjoy it as a kitchy spectacle, but when the film doesn't care enough to take itself seriously, the point is lost.\n\nLike Huey Lewis said, sometimes bad is bad. SCCTM is awful."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mbaraka",
        "review_rating": "2",
        "review_title": "Best viewed Christmas afternoon",
        "review_detailed_main": "This film is best viewed of a Christmas afternoon, with a heap of drunken friends...SBS TV in Australia featured it a few times as part of their regular 'Cult Classics' which included all those old movies which did not fit mainstream, but which you wanted to see for nostalgia's sake. Pia Zadora starred as a Martian child. A few years later, whilst playing the part of Anne Frank on stage, she was so bad, that when the German troopers arrived, the audience shouted '...she's in the attic...' This film does not, however, rank up there with the 60's Godzilla and Gamera movies, which really had a style of their own. The film would have been better if Martin the (Looney Tunes) Martian were cast. At least then we would have had a better array of effects and a more realistic storyline."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Snakeeyez187",
        "review_rating": "10",
        "review_title": "Santa Conquers ALL",
        "review_detailed_main": "Every year on Christmas Eve me and my friend exchange strange gifts with each other. Last Christmas I gave him a bike with no wheels and he gave me a video which his grand-dad gave to him once upon a time. The video was called, \"Santa Claus Conquers the Martians\", I instantly thought \"omdays I so have to watch this!\", and I did. I was hooked. SANTA VS. ET = $$$. This movie would be the wet dream for any movie watching fanboy, as I reiterate, this is SANTA VS MARTIANS for God sake! How can you NOT want to watch this and NOT like it?\n\nSanta Claus Conquers the Martians is a brilliant film made for the brilliant mind. Simple brains can't comprehend the beauty and raw voice that it embodies. People who say \"I don't get it\" or \"it was boring\" just wouldn't know a good film if it came and whacked them upside the a**."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "themfs",
        "review_rating": "7",
        "review_title": "Watch MST3k version.",
        "review_detailed_main": "+5 if you watch the Mystery Science Theater 3000 or Cinematic Titanic version."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Emperor_Torgo",
        "review_rating": "1",
        "review_title": "Ho Ho Homicide!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "vueit",
        "review_rating": "",
        "review_title": "turn off your brain and have fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "a-twetman",
        "review_rating": "2",
        "review_title": "Dull and childish",
        "review_detailed_main": "It is as if someone has taken a a short story written by a tn year old kid, converted it into a script without fleshing it out in the slightest, then turned it into a feature length children's TV show. The plot is utterly ridiculous, the dialog has as much depth to it as puddle and the characters are as well rounded as a piece of cardboard. Speaking of cardboard, part of the sets look very much like painted cardboard and the costumes hold are on the same level, it' only he stock footage of the air-force that holds any kind of quality. My guess is that this was a low budget film quickly put together without much thought for anything. With that in mind, it's amazing that it doesn't do worse because all in all, Santa's constant mirth is the only annoying thing about this movie, the rest is just dull which is a lesser crime than right out bad."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Sylviastel",
        "review_rating": "1",
        "review_title": "It's truly awful!",
        "review_detailed_main": "I never thought a film would be this bad but it is. The film about Martians kidnapping Santa Claus and a couple of human kids to Mars. The Martian costumes are the worst I ever seen almost camp for words. I don't know how the cast did this film without cracking up. Except for Pia Zadora, I don't know anybody in the cast. The Martian costume is more funny than terrifying like a Saturday Night Live sketch. This film was done before we knew Mars was uninhabitable and before USA went into space. The kid actors are fine but still this film is perhaps one of the worst films ever made and perhaps the worst Christmas film of all time."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "All I want for Christmas is for these 80-some minutes to be removed from my memory",
        "review_detailed_main": "It is possible to get a high quality version of this, on DVD, though the one I got(cheap, don't worry) had no features, apart from a chapter selection. This basically only works as a \"so bad it's good\" kind of thing. How does it suck, you ask? Let me count thee ways: The colors and lighting are hideous and straining. It's soaked to the bone in sweetness, and so thoroughly and consistently ridiculous that there is a genuine chance of viewers getting diabetes and ending up stark raving mad from witnessing this. Almost all of the \"humor\" is painful. I'm not entirely sure how many of the attempts at putting a set-up and a punchline together I would go so far as to actually call \"jokes\". Gags almost invariably crash and burn. A little bit of the slapstick is perhaps not completely hopeless. The majority of the laughs this garners are unintentional. Once this realizes that it might hold the potential to make a point, it continues to mercilessly beat the audience over the head with it, until, presumably, the writers forgot about it. No, I honestly would not expect much from anyone who, during the Cold War, would take the words \"nuclear\" and \"curtain\", and put them together to mean something harmful of great power, in the script for a *family movie*. This can only be appreciated as anything \"serious\" by children, and the kids would still need to be of limited and/or impaired mental capacity. The acting is nonexistent. The pacing is decent. The developments are utterly unimaginative and predictable. The plot details how Santa, here portrayed as a gullible moron who couldn't get himself out of even the tiniest trouble unless inactivity was enough to accomplish that, is abducted by Martians, for the benefit of their offspring, who have clearly learned how to e-nun-ci-ate. The MST3K of this does hold hilarity, but it's not their best. There is no sex, violence or language. I recommend this to fans of B-rate flicks and all who enjoy their sides splitting at the things the creators of this did not mean to be funny. Now, can someone tell me how to treat the reek of cheese this left? 1/10"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Phanofmuzik-2",
        "review_rating": "1",
        "review_title": "Best movie of all time?",
        "review_detailed_main": "This movie was easily the best 1 dollar I will ever spend in my entire life. Easily.\n\nEverything about this movie is amazing in every way. Pathetically budgeted, horrific script, a plot im still trying to find, very poor acting, and the polar bear to end all polar bears (youll understand when you watch it). I don't think I have laughed as hard during a movie in a LONG time. All the while, its so harmless its almost endearing. Reminds me of something a 3rd grade class would put on, but with a lower budget, a worse plot line, and a more miserable script.\n\nI cant recommend this movie enough to anyone that could find enjoyment out of the incredible crappiness of this movie. Watching it is now a tradition during the holidays at my place."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Silenced",
        "review_rating": "3",
        "review_title": "bad movie...but it is worth seeing",
        "review_detailed_main": "Now granted for the most part this is one of the worst movies I have ever seen. Watching this movie makes one contemplate suicide. However, this movie is worth watching for one reason and one reason only. In the end Santa goes insane. He's not supposed to, but I think the the actor who played him went nuts starring in this bad of a movie and lost it. It's one of the funnier things I have ever seen. So check it out."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lepoisson-1",
        "review_rating": "1",
        "review_title": "Awesomely bad - but harmless. A good party movie.",
        "review_detailed_main": "I am trying to imagine a room full of Suits screening this movie and approving it for release.\n\nThe stupid theme song is annoyingly catchy. I'll probably be humming it for weeks.\n\nThis was amusing and fun, and I really liked the adult Martian headgear, part of which looks amazingly akin to the flexible gas pipe that connects my clothes dryer to the supply line.\n\nThere are far worse movies than this. The worst movie I've ever seen was Nukie, every minute of which was pure pain. If you really like BAD movies, check out Nukie...but you must make it to the ending, which is truly worth it."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Baldach",
        "review_rating": "2",
        "review_title": "Cult classic or a trip down neurotic memory lane.",
        "review_detailed_main": "There are 3 reasons to see this film. 1. To see the acting debut of Pia Zadora as a green Martin girl (realize even talented actresses get started with terrible roles). 2. To see if this really one of the worst movie of all time (and if you can watch the whole movie in one sitting you are very brave) 3. To relive your childhood (realize that while most things have gotten worse, this movie is a reminder that not everything was wonderful in the 1960's.) This is movie, is a Political Correct person's dream, there is no violence, a happy ending, up beat songs, and exteressitals,Santa Claus, children are portrayed in a positive manner. Other than the movie is plain awful."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "KennethEagleSpirit",
        "review_rating": "8",
        "review_title": "This thing is so bad ...",
        "review_detailed_main": "That it is hilariously good fun. With a plot simple enough for a three year old to grasp there is nothing to follow, nothing to think about, and nothing to remember. You just watch. Personally I think this is camp at its best. Some things are Cult Classics not because they're good but because they are just so bad you can't help but love the ugly puppy. This dog is about as ugly as you can get. But, hey, its for Christmas. Christmas is pretty homely too after the tree and wrappings have been thrown into the burn pile out back. Acting? Sound track? Continuity? Plot? Character development? Photography? Choreography? It is to laugh ... Ho, ho, ho. Which is exactly what makes it so much fun. Especially if you're three years old."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "caithiseach",
        "review_rating": "7",
        "review_title": "if you don't see it as serious art...",
        "review_detailed_main": "The other reviewer wanted to watch a Christmas movie with redeeming qualities. There are plenty of those out there. This movie falls into a vastly different category: it belongs in the \"Ed Wood-style Camp\" genre, subset \"Christmas Camp.\" If you can't stop watching \"Plan 9 from Outer Space\" because of the effects and the acting, you will have to make this film part of your Christmas tradition. It is NOT a horror film, but it has the same science fiction feel as \"Plan 9,\" and the music is the crowning glory of the amusing dreadfulness of this 80-minute foray into \"what were they thinking?\" So, don't show this to your kids as part of your cycle of Christmas flicks (though they may get the joke as well). Watch it with your friends with a glass of high-octane egg nog handy and laugh your head off."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "macumba13",
        "review_rating": "5",
        "review_title": "When You're Not In The Mood For \"A Christmas Story\".....",
        "review_detailed_main": "Hey, those Martians are entitled to have a Santa Claus too! Don't believe all the hype about this being such a horrible film, there are far worse. This is a great day-after-Christmas movie to eat your leftovers to. You know you're gonna have a wild ride when you hear the opening theme song. The story and the acting are ludicrous, but anybody who rents this already knows it's not Shakespeare. Not for the \"art\" crowd.\n\nOn scale measuring outrageous humor, a 5."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "craiggerard_2000",
        "review_rating": "",
        "review_title": "Pia Zadora-In her Screen Debut",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Michael_Cronin",
        "review_rating": "1",
        "review_title": "I hope you're happy, you've ruined Christmas",
        "review_detailed_main": "Oh dear. The Martian children are so sad from watching Earth television at Christmas time. So what do the Martian leaders do? Based on a suggestion from a deranged old hermit, they decide to kidnap Santa Claus, & manage to drag along a couple of Earthling brats in the process.\n\nOK, they weren't exactly trying to make Citizen Kane, but Ed Wood's output looks positively brilliant when considered alongside this moronic effort.\n\nThe acting & dialogue is so utterly awful that you barely notice the pathetic tenth-rate sets which might well have been thrown together by a class of drunken kindergarten children, which I believe was the intended audience for this sorry excuse for entertainment. However, most five-year-olds would be thoroughly insulted at being dragged along to watch such dross & promptly go home to burn their Christmas stockings.\n\nThis is even worse than the title suggests. What possessed anyone to make such an idiotic film is beyond human comprehension.\n\nOne of the worst movies I've ever seen. Bah humbug."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "melskunk",
        "review_rating": "1",
        "review_title": "A seasonal classic bad movie",
        "review_detailed_main": "After you've had your fill of Rudolf and Frosty, you should watch this movie. It's terrible. It's horrible. It's awful. It's badly acted, badly written, and really makes you wonder who thought this would be a good idea. But I can honestly say I watch it every Christmas, as the totally stupid, goofy atmosphere makes it the perfect fun holiday movie to watch with friends too old to get into the stop motion children's Christmas classics."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "marcslope",
        "review_rating": "2",
        "review_title": "One of MST's finest hours",
        "review_detailed_main": "Sure it's rotten and insulting and underproduced and witless, and mystifyingly self-satisfied to boot. But movies like this are why Mystery Science Theater was born: as rebuffs to an entertainment industry that routinely underestimated audiences' intelligence and taste. As kids, we were taught to enjoy stuff like this, and hence we were lied to. And MST is our revenge.\n\nThey do themselves proud on this one, with some of their funniest rejoinders. Early on in the MST version, when the unctuous TV newscaster bursts into Santa's workshop and Tom Servo enthusiastically intones, \"Get the hell out of my shop!!\", we know we're in good hands.\n\nNew Yorkers and theater buffs get an extra bonus: Wretched as the film is, it was filmed in a studio on Long Island and is rich in New York theater talent. Bill McCutcheon (Droppo) later won a Tony for the \"Anything Goes\" revival. Leila Martin has been with \"The Phantom of the Opera\" since it opened. Al Nesor is from the original cast of \"Li'l Abner.\" And there's some fun 1964 location photography, too."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "KOknockout920",
        "review_rating": "1",
        "review_title": "Its Santa Bear!!!!",
        "review_detailed_main": "Recently, i watched the MST3K version of \"Santa Claus Conquers The Martians\" and after seeing that, i thanked God for not killing myself!! The movies was about these Martians who are concerned(excluding Voldar) about unhappy children on Mars.So they decide to go to Earth to get Santa Claus to bring happiness to Mars.Along the way, they capture two children who were just resting in the leaves. When they got to they North Pole, the two children were almost mauled by a guy in a polar bear suit,they capture Santa Claus, and head back to Mars. When they get back to Mars, Santa starts making toys for the children, but not without resistance. Voldar and other Martians form to dis-troy Santa Claus, but in the end, they get caught,and Santa and the kids went back to Earth.This movie is one of the worst ever!!! Here are 10 of the most unrealistic, disturbing and stupid things in that movie:\n\n1.Droppo,the terribly gay martian 2.The polar bear 3.Torg,the martian robot who is turned into a toy by Santa 4.Milton Delugg, the guy who did the music in this movie. 5. THE song\"S A N T A C l A U S, hooray for Santy Claus\" 6.Stock footage of jets and rockets. 7.The Martians 8.The size of the rocket from the outside and the size of the rocket from the inside(very different) 9.\"Are you a television set?\" 10.\" No one on Earth will never know, that Santa Claus was kidnapped by Martians!\"\n\nEven 5 year old children will say\"Wow, this movie sucks,\" and throw it away."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kickstand",
        "review_rating": "1",
        "review_title": "So bad it's good",
        "review_detailed_main": "This is one of those stinkers that is just fun to watch. It's become a holiday tradition in our house. Of course, the best version is with the \"Mystery Science Theatre\" figures making their inane comments. However, in any form this film is a must for any lover of terrible movies."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "bkoganbing",
        "review_rating": "2",
        "review_title": "We Need A Little Christmas On Mars",
        "review_detailed_main": "You know the most frightening thing about Santa Claus Conquers The Martians is that someone, somewhere thought they were making a holiday classic on the order of Miracle On 34th Street or White Christmas when they put together this film. What substance was Joseph E. Levine on when he decided to inflict this film on the movie-going public? Especially the juvenile movie-going public.\n\nThe title says it all. Martian kids apparently live in a regimented society with no fun and they watch earth television to see how the other planet lives. After consulting with an 800 year old and I presume those are Martian years oracle it's decided they need a little Christmas on Mars. What to do, but capture Santa Claus and the leader goes to earth to get him. He also picks up a couple of stray earth stowaways as well.\n\nHe faces some opposition of course, but the spirit of Christmas and Santa Claus prevails.\n\nThe only name worth mentioning in the cast is a young Pia Zadora who made her debut in this ghastly film as a Martian kid. She's never really lived down appearing in a film the Medveds have given an honored place in their worst film list.\n\nThis one has to be seen to be believed."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "richieandsam",
        "review_rating": "3",
        "review_title": "Oh dear oh dear!",
        "review_detailed_main": "SANTA CLAUS CONQUERS THE MARTIANS Hahahahahahahahahahahahahahaha (stop to breathe) hahahahahahahahahaha! Blimey... what a movie! I recorded this off of the TV over Christmas all because the description on the TV guide said \"Cult classic, widely known for being one of the worst films ever made\". As soon as i read that, i knew I had to see it. J They are not wrong... it was terrible! The story is about the aliens on Mars. Their kids are unhappy, but the Martian parents don't know why. But they have been watching \"Human TV\" and they think that Santa Claus will cheer them up. So they jump in their rocket ship and travel to Earth to kidnap Santa to cheer up their children. To find Santa they ask a couple of kids where he lives, so they kidnap the children too. Santa now has to try and escape Mars and get back to Earth with the 2 kidnapped children. The acting was so bad that they might as well have been reading off of cards. The only actor that seemed to make an effort was the guy playing Santa... The effects were really really bad... the rocket ships that were flying through space looked like toilet rolls painted and put up on strings. I felt like I was watching Button Moon. There were some entertaining bits in the movie, but only because they were so bad that they made me laugh. The costumes were bad... the Martians clearly were just fellas dressed in tight green Lycra with a tube stuck to their heads. There was a couple of fight scenes in the film too, it seems they didn't even try to hit each other. The fists were heading towards their opponents face and then you saw them just push them away with the fist! I am seeing why this would be one of the worst films made, but i will be honest... it was that bad that it did entertain me. I will give it a generous 3 out of 10. Yet, it is still not the worst film I have ever seen!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "johnblackkjr",
        "review_rating": "10",
        "review_title": "Love to See This Film Restored",
        "review_detailed_main": "It hard for me to believe that this film is now in public domain. Because there is \"No Rights Holder\" anybody can show this film for free . That's too bad because this film is desperately needs to be restored.\n\nSo what is with all the hate? This film in reality has a strange/weird vibe to it and it makes enjoyable.\n\nThe story is simple. Martians kidnap Santa Claus. The martians need Santa to bring joy to their children.\n\nIf this film gets remade it will be bad. For all the hate on this film it is not really all that bad. If you want to see a terrible film then watch \"Christmas Grace\" or \"Salvation Street\""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "cgvsluis",
        "review_rating": "6",
        "review_title": "I wanted to mock it, but it is actually a sweet if not childish story.",
        "review_detailed_main": "I watched this film expecting it to be so bad that I would be able to mock it with a friend...but I ended up being pleasantly surprised. The overall story is kind of charming and if you can get over the fact that the aliens speak English and have these ridiculous helmets and antenna on, then you just might find it to be a cute story.\n\nOn mars the children are not sleeping or eating and they decide that they need a Santa like the human children have to make their kids laugh and smile, so they go to earth to kidnap Santa and bring him back to mars. Thanks to two earth children Billy and Betty, they are successful and their plan works...but now the two human children that they brought to keep them quiet are not eating and sleeping!\n\nI really appreciated the children's abilities to problem solve and retain knowledge. I loved that Santa was actually a very positive person in general.\n\nThe automatic toy making machine was great...and the robot, was fantastic! I actually had a very similar Halloween costume when I was a kid.\n\nI wish there really was a kid tv, this film made me nostalgic for simpler times. There are far worse films out there...even far worse Christmas films!\n\nIf you are looking for an unusual or out of the ordinary Christmas story, this might be for you. If you don't take life too seriously, you might enjoy this."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "classicsoncall",
        "review_rating": "4",
        "review_title": "\"From this spot there's only one direction you can go, and that's South.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "trpdean",
        "review_rating": "",
        "review_title": "Well, it's awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "capone666",
        "review_rating": "4",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "Santa Claus Conquers the Martians\n\nThe problem with Santa vs. the Martians is that, if they win, one kid will end up getting a single-parent household for Christmas.\n\nFortunately, it's not someone's father being abducted in this sci-fi film, but Father Christmas himself.\n\nWhen it's decided that the children of Mars (Chris Month, Pia Zadora) need to gain their own individuality, two Martian parents take it upon themselves to kidnap Santa Claus, a jovial toy-maker from Earth that their offspring watch via electromagnetic waves.\n\nBut when a Martian extremist learns of the parents plot, he fears for the future of his green- skinned race, and sets out to kill Claus.\n\nWith its subversive storyline, substandard special effects and asinine acting, Santa Claus Conquers the Martians excels at being horrendous.\n\nBesides, it's hard to know which one to root for: the aliens, or the immortal, fat, elf that always wants to manhandle your children at the mall. (Red Light)"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "rsmith2213",
        "review_rating": "3",
        "review_title": "Nostalgia and nothing more",
        "review_detailed_main": "The title alone is ridiculous, but growing up in the 70's/80's this was one of those films shown during the holiday's every year and for some reason you watched it. The costumes, set design are very low budget. As an example, the martians are painted green (because that's what martians would look like from the red planet), and the clothing they wear is....you guessed it, green. Including the helmets, boots, etc...Tom Hatten subjected the youth on weekends to this I believe, as a way to prove that holiday films could only get better in the future. If you were a fan of this film when you were young, re-watch it alone before subjecting your children to it so you can remember just how 'good' it was. Unless of course, you wish to cause them pain and regret spending time with you. I suggest if you are a divorced parent, you choose one of the Rankin holiday animated classics if you want something that hearkens back to your childhood."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ptusler93",
        "review_rating": "1",
        "review_title": "Hilarious Agony",
        "review_detailed_main": "What everyone else has already said, and then some. What I love is that there is no attempt to cover up, change, or otherwise improve the *pop* made by the air-blaster \"Freeze-rays\" used by the martians. And the very nonchalant way the martians fire them, sort of half pointing at the ground. The martians keep their prisoners terrified by their weapons, but then explain \"Oh don't worry, it wears off in a little while.\" I just wish I had the martian space ship console! This movie deserves to be watched several times to uncover the layers of badness. Thank goodness Target had it in the one dollar bin! I was able to get copies for everyone for Christmas! This is what the Sci Fi channel should be broadcasting, instead of that Wrestling Darrick."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "creamsdrummer13",
        "review_rating": "3",
        "review_title": "A space adventure for the holidays",
        "review_detailed_main": "Because this movie is so badly filmed, it actually makes it funny.\n\nThroughout the movie, i cannot understand why the martians do not use their stun guns on \"The Bad Guy\" (so as not to spoil anything) they keep telling him not to move as if he actually won't.\n\nThis movie also contains a terrible fight scene. It's so bad is comical.\n\nSome of the props are just so terrible it makes you fall out of your chair laughing. To name a few: the man in the polar bear suit, the robot, and the ship which mysteriously changes shapes:one when it is flying through space, and one when it is landed.\n\nAll in all I would suggest watching this movie because everyone should see it once, if only to laugh at it."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "sethn172",
        "review_rating": "1",
        "review_title": "What a very innovative holiday tradition...",
        "review_detailed_main": "I was online checking out free, 100% legal public domain movie downloads when I stumbled upon the movie that is \"Santa Claus Conquers The Martians.\" I've watched this movie from the beginning to the end, and while some parts may not be as good as other fantastic holiday movies like \"Santa with Muscles,\" \"Elf,\" \"Home Alone\" and others, the story is completely original: martian kids from Mars are bummed out because Santa Claus could only be seen on Earth TV. Suddenly, he is found his way into outer space! Now, I think that this is an okay movie, but I'm giving this a \"1\" because this was a \"Mystery Science Theater 3000\" film, and they are all bad in real life!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "thenintengenius",
        "review_rating": "2",
        "review_title": "\"I wasn't sleeping! I was just... practicing!\"",
        "review_detailed_main": "Everybody's heard of movies so bad they're good. In the case of Santa Claus Conquers the Martians, I would like to nominate it as the first film that's so bad it's utterly hilarious.\n\nStarring a group of nobodies and a young girl who should've remained a nobody (Pia Zandora), the film battles with a low budget and poor acting all throughout. The story is actually relatively original for a movie of this budget: Martian children are growing bored and listless, causing the adults on Mars to kidnap Santa Claus to try and alleviate this condition.\n\nBeyond the story, most of the rest of the movie is too funny for words. Santa acts like a drunkard, the Martians use a freeze ray on some of our heroes (that doesn't work as the actors don't know how to stand still), a man in an extremely fake bear suit chases two Earth children (who act so poorly that I can hardly believe they're actually children), a robot is made out of cardboard boxes and dryer tubes, and so on, and so forth.\n\nDespite the film's obvious low quality, I think everybody should watch it at least once. The film is so full of unintentional humor that it makes it well worth the small investment. (I've heard there is also a Mystery Science Theater 3000 version of this episode, but I've yet to watch it. I'm sure it's quite hilarious, though.)"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "michapringle",
        "review_rating": "1",
        "review_title": "A new contender for worst movie ever",
        "review_detailed_main": "This review is not concerned with the plot or details of this film, rather the aim is to explain why it is possibly the worst movie I have ever seen. If you're looking for plot details, skip this review.\n\nI am a fan of films; I've seen the AFI top 100, and the IMDb top 125 to name a few. I've watched numerous forgettable films. As a result of my film watching experience, I've determined some criteria for what makes a film truly awful. I am most displeased to announce this movie meets all criteria with resounding success, and may in fact have displaced Ironheart as the worst movie ever.\n\n1. A terrible film should start off with some promise (to raise your expectations against your will), and then quickly and progressively get worse. This film does this wonderfully. As I recall, the first 2 minutes are the best scenes of the film, and look like the movie will score a solid 4 or 5 out of 10. Shortly thereafter, absolute drivel is introduced, and the plot and script spiral into ineptitude with absolute finesse.\n\n2. All the actors are relatively talentless, and of the same caliber. This is necessary, to avoid an actors performance standing out, as good or bad. A good or bad performance can give the viewer a focus for the intense dislike of the film. I'm proud to say, I can't remember anything of the acting at all, except for the first 2 minutes, in which Santa Claus gives a reasonable mediocre performance from his workshop.\n\n3. Most miserable movies tend to fail by accidentally including some scene that results in laughter. Those that do it too much can become enjoyable cult classics, such as Barbarella, or The Rocky Horror Picture Show. This film sadistically and unfailingly pounds the viewer with scene after scene of insipid drivel.\n\n4. An awful film should have an inconsistent plot for the obvious reason that it makes it difficult to follow what's going on. I think the film had a relatively consistent plot, and stuck to it. However, it succeeded here on a new level beyond my wildest imagining. It's clear from the first moment this film starts that it's intended audience is children, or soon to be dysfunctional families. Typical with such films, there is a moral message, and this movie is no exception. I'm delighted to discover I've managed to burn it out of my brain, but I'm sure it was along the lines of be nice and get along, share stuff and don't kidnap people. The point is, as I'm watching this insipid driveling film, minute after minute, I am forced to think of these young kids watching this film, and unwittingly having their innocent minds twisted by this mess. By sticking to the plot, the makers of this film forced me to continue my nightmare visions of mental torture of children. In this film, sticking to the plot made it worse, and thus a more successfully bad movie.\n\n5. The most important criteria from any film, good or bad, is to elicit an emotional response from the viewer. Boredom doesn't count. What I look for in a miserable film are feelings of anger, sadness, or revenge. As with Ironheart, it was a struggle to continue watching this movie. I was angry with the producers of this film, and everyone else involved in the project, including those responsible for it's digitization, so that it's evil could continue to spread. As with Ironheart, I wanted to destroy this film before it was complete. I was deeply saddened by the loss of 90 minutes of my life spent on this drivel. Finally, I wanted to get revenge on everyone involved in the project by subjecting them to repeated watchings of this movie. What surprised and impressed me most about this film, is that I wanted to destroy it much earlier into the film than I did with Ironheart. I think it was about 45 minutes for this one, and about 60 for Ironheart.\n\n6. It should go without saying, but a terrible movie should have no redeeming features at all. Clearly this movie fails in that regard, since it eventually ends. However, the makers save the best for last; a horrible song, with words that appear on the screen so the kids can sing along. I'll never be able to forget \"Hooray for Santy Claus.\" Yes, Santy Claus. Ugh...\n\nThis movie easily scores 0 out of 10, a tie with only one other film - Ironheart. I strongly recommend that no experienced, thinking individual watch it."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "dwashbur",
        "review_rating": "8",
        "review_title": "Totally Silly Fun",
        "review_detailed_main": "This movie is so bad it's wonderful. It's one of my favorite Christmas movies because it obviously doesn't take itself seriously at all. The villain uses an old Wham-O Air Blaster toy to freeze Santa's elves, and you can't help but love Droppo. Even the cheesy theme song is just goofy and fun. Briefly, Martian children don't know how to have fun, but they watch Earth TV constantly and hence know about Santa Claus. The Martians decide they need Santa there to teach their kids how to laugh and be happy, so rather than just go ASK the big guy for help, they decide to kidnap him. Santa takes it all in stride and endears himself to everybody he meets except the bad guy Voldar. Two earth kids get taken to Mars with Santa, and hilarity ensues. The sets, the props, the acting, the lines - you name it, it screams \"low budget,\" but it's done in such a way that you realize everybody KNOWS we're on a low budget so just go with it and laugh yourself sick. Watch it on its own or with the MST3K commentary, and if you don't try to see it as a \"real\" movie, you'll have a ball."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "it's camp and it knows it",
        "review_detailed_main": "Martian leader Kimar is concerned that his children are falling under the spell of Santa Claus from the human world. The children on Mars don't have childhoods. They decide to kidnap Santa Claus... for the children.\n\nFrom the low rating, I'm not sure that people are watching this with the right frame of mind. I really like the first half. I like the alien designs. It's camp and it knows it. Come on, people. It has a robot. The second half is more of a mess. I'm not following all of it. I want Santa to do more, but I guess he can't Rambo up the Martians. No matter what, you can't beat the title."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "isotope2112",
        "review_rating": "1",
        "review_title": "Quite possibly the worst movie ever made",
        "review_detailed_main": "I saw this on video years ago. It appears it was all shot in one day because you can actually see the makeup running on the Martians as the movie progresses. This movie started a tradition with my friends and I of renting terrible movies and trashing them while we viewed them. If only we had thought of airing this on TV we could have been the creators of Mystery Science Theater. Of all the terrible movies we rented though, Santa Claus Conquers the Martians stands out in my mind as the worst of them. Funny if you are looking for a bad movie, otherwise avoid. 1/10."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "capnblutus",
        "review_rating": "",
        "review_title": "\"Gentlemen, We all can't be the Honey Nut Cheerios Honeybee!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "spinin",
        "review_rating": "2",
        "review_title": "Santa Claus Conquers the Audience",
        "review_detailed_main": "Everybody wants a piece of Santa. He's the man. Believe it or not, Martians want him as well. You see, the planet Mars has been a little boring lately, especially for kids. In order to make his kids happy, the Martian leader decides to kidnap the jolly fat man. Martians know that he is the most popular figure during the holiday season and he will surely entertain Martian kids if they bring him back. There are good Martians that simply want to kidnap a person to see if he can help them out, there are evil Martians that want to sabotage the entire plan, and then there are goofy Martians that can't do a thing right. Finally, there are bratty Earth kids that want to save Santa. All in all, a clever satire of today's society that's way ahead of its time. No... wait... that's another movie.\n\nI saw this on MST3K and found it to be one of the funniest episodes ever. The characters are extremely annoying, their costumes are ridiculous, and the settings are cheap and pathetic. Mothers, don't expect this to be a silly family flick that your kids can enjoy. NO! This is garbage! However, it contains one positive element. Unlike \"Manos, the Hands of Fate\" (another awful awful movie), \"Santa Claus Conquers the Martians\" is not seriously bad, but rather comically bad. The MST3K version is extremely funny and could satisfy all those with a sense of humor on a relaxing or boring day. One of my favorite moments occurs when the two Earth kids are being chased by a man... in a bear costume. For its ridiculousness, this film gets an extra point. Overall, a 2 out of 10."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "stevebob99",
        "review_rating": "2",
        "review_title": "A Christmas cult classic",
        "review_detailed_main": "This movie is pure camp. The costumes are silly, the make-up is ridiculous (the martians are not green around their eyes), the dialog is stiff and the acting is horrid. There is no plot, either. Somehow, you put all that together and it becomes a good, clean, fun movie. We'll be watching it every Christmas season and laughing all the way through. The Martians are especially fun to watch. They have what looks like a vacuum hose on their heads for no apparent reason. They also have coat hanger antenna that the earth children think makes them look like televisions. The two earthling children are really obnoxious. They can always get away from the Martians, but they always seem to get caught. There were at least 2 elements of the script that were never resolved. Why didn't the martians retrieve their robot from earth if they didn't want to be discovered? and Whatever happened to the Rockets Earth sent up after the Martians? Even the title doesn't make a lot of sense but you don't need to understand the movie, you can enjoy it for what it is- silly fun. If you liked Plan 9 from Outer Space, this movie is definitely for you, too."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Paul-559",
        "review_rating": "1",
        "review_title": "The woyst!",
        "review_detailed_main": "By now, we're well aware that Santa Claus Conquers the Martians is awful. For my money, the scene where the children sneak out of the \"radar box\" and spend forever dithering around just to close the lid and leave has to rank of one of cinema's truly appalling moments. The music which announces that the Martians are going to burst into Santa's workshop is as upbeat as a Batman fight scene, but they just walk through the door. Cheap AND nasty! .. . Anyway, I think it must be Ms Zadora giving this film 10 out of 10."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "andy-1023",
        "review_rating": "1",
        "review_title": "Please shoot me now. Really.",
        "review_detailed_main": "The only possible way this movie is tolerable is if you watch the MST3K version. Even then, the best you can do is feel sorry for Joel, Crow, and Tom. If you actually watch the real movie, I feel very sorry for you. It's probably the worst movie I've ever seen, and that's saying something, since my wife and I are connoisseurs of horrible movies. In fact, I would almost say that it's so awful that 1) either you should watch it because you want to say that you've seen the worst movie ever made, or 2) you should avoid it at all costs because you don't want to flush an hour of your life down the toilet. It makes \"Leprechaun in the Hood\" look like \"Gone with the Wind.\""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lee_eisenberg",
        "review_rating": "1",
        "review_title": "I guess that this was how the MST3K guys learned about Pia Zadora.",
        "review_detailed_main": "If you're willing to accept \"Santa Claus Conquers the Martians\" as a ridiculous kids' movie, then maybe we can give it more than 1/10. Otherwise, it's a real stinker. The plot (or whatever it is) has Martians kidnapping St. Nick and two Earth children, and taking them back to the red planet to entertain their own children. Then again, the schlock that Hollywood produces today isn't much better.\n\nIf you want to like this movie, you'd do best to watch it on \"MST3K\". Joel, Servo and Crow make some great comments (well, duh; they always do). When Dr. Forrester said that the movie starred Pia Zadora, I at first thought that he said \"Endora\", which made me think Agnes Moorehead. Fortunately, she never sank that low, and Pia Zadora was able to make up for this in later years. All in all, the movie by itself is 1/10, the MST3K version is 10/10."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "divaclv",
        "review_rating": "1",
        "review_title": "The fruitcake of holiday movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "solideogloria1685",
        "review_rating": "1",
        "review_title": "\"Two thumbs-up children's educational video\"",
        "review_detailed_main": "Despite what other reviewers may say, this movie is full of practical purpose. You see, Santa Claus Conquers the Martians is, fortunately, terrible.\n\nYes, fortunately, because otherwise it could not be used with children as an effective illustration that Santa Claus could not possibly exist. Parents are warned to give their children sufficient comfort during the watching of this film, as they realize through the horrific acting (which will remind them of their uncle's attempts at Santa in his red bathrobe on Christmas day) that they have been had the first 4-5 years of life. In this way, Santa Claus Conquers can quickly pull your child through a difficult realization in their earlier years. A two thumbs-up children's educational video!\n\nThis reviewer anticipates a sequel involving the Easter Bunny or Elvis Presley against the same Martian enemy -- Santa Claus Conquers may have started what will become a series of trusted vaccinations against the more ridiculous myths of American culture."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Woodyanders",
        "review_rating": "10",
        "review_title": "Hooray for gloriously rancid no-budget yuletide sci-fi schlock!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "happipuppi13",
        "review_rating": "7",
        "review_title": "When It Comes To Santa & The Martians : I Like Feeling Spaced Out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "TOMNEL",
        "review_rating": "2",
        "review_title": "Could be worse, but not much.",
        "review_detailed_main": "I don't see why someone would think people would want to see a movie about Santa Clause and Martians, but I guess someone did, and gave birth to this. \"Santa Clause Conquers the Martians\" is a strange kids film, but it probably will appeal to 6 year olds. Also the title really doesn't describe the plot. It's more about Santa befriending the Martians rather than conquering them.\n\nMartian parents are very annoyed that their kids are watching too many Earth programs on the TV. That somehow leads them to capturing two Earth kids and Santa Clause to suck the joy out of life, but Santa uses his charm to become friends with most of the Martians, but the few that still hate him plot against him.\n\nNone of the actors, including the man who plays Santa Clause are likable and they all do a pretty bad job. The special effects are better than I expected, but they are still really bad... a guy in a bear costume and a really strange looking cardboard robot. The climax of the film is one of the dumbest things I've ever seen, and any mildly positive thing goes away here. But even with all of it's continuity errors, terrible acting and pure strangeness, it's still better than other bad Christmas movies, such as \"Santa Claus\" (1959).\n\nMy rating: 1/2 out of ****. 83 mins."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Mike Sh.",
        "review_rating": "",
        "review_title": "A Joseph E. Levine, uh, .....classic?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "the_shah",
        "review_rating": "2",
        "review_title": "Never before have I fallen off a chair from laughter....",
        "review_detailed_main": "I have seen this film twice now. In fact, I own it. I found it about a year ago in the states for a buck. I feared watching it for about six months. Finally, I built up the courage and a few friends of mine and I watched it. All I can say is wow.\n\nI quite literally laughed my way for the full hour and half. It was painful. Voldar was by far the best character. He was just so furious.\n\nTell me this. How can Santa turn a robot into a toy by looking at it? Why did the midgets still shake after they were 'frozen' by the Martian freeze ray? Worst of all, why did the user of the ray gun have to make their own shooting sounds? Oh, and has anyone ever heard of a 'Radar Box'? I'm a radar guy in the Navy and I've never heard of one... WTF? The Polar Bear scene was one of my favourites. Quite clearly a man in a suit, the polar bear ambled along on his hands and knees (yes, knees... there was no effort taken whatsoever to conceal the legs...).\n\nNevertheless, for sheer stupidity, this film was enjoyable. Eighty-one minutes of pure stupidity. Pure laughable stupidity.\n\nI suggest you watch this if you have nothing to do. Or if you partake in smoking certain banned substances."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "martin-217",
        "review_rating": "2",
        "review_title": "Well, not the worst ever but awful nevertheless",
        "review_detailed_main": "Ah, the dangers of too much Earth TV... makes Martian children behave worrisomely and their parents Earth raiders kidnapping Santa.\n\nEven a child in the original audience would have known enough of Mars for this setup to be laughably silly. Even so, there is a campy creativity at work here that saves the film from being the worst ever, or even worst Santa movie ever (that distinction being firmly reserved for Santa and the Ice Cream Bunny).\n\nWith gaggles of martians bumbling around like Marx Brothers, Martian June Cleavers producing Chocolate Layer Cake Pills as special family treats, a Mrs Claus blushing that \"Television\" has come to her house, a set of pipe-smoking toy-making Little People as elves, and Pia Zadora as child of the red planet, there is enough to keep your brain in question mode for a long time.\n\nDon't ask questions. Liquor up and enjoy..."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jman_frogger",
        "review_rating": "1",
        "review_title": "Crap, sad, poorly made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "doctorawesomepants",
        "review_rating": "3",
        "review_title": "Classically Awful!",
        "review_detailed_main": "Santa Claus Conquers the Martians is a classic in B-movie awfulness. It is about, as the title says, Santa Claus being attacked at the north pole by Martians. The film never does a very good job of explaining why they really need to get Santa so badly, but it takes surprisingly little effort for a small number of earthling heroes to rescue Santa from the Martians so that Christmas can be saved. The acting, particularly by the Martians, is really awful. This movie is better watched and enjoyed as an episode of Mystery Science Theatre. You won't find many worse movies than this, and as an added bonus you can see Pia Zadora in it!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "drod005",
        "review_rating": "4",
        "review_title": "Christmas gone wrong",
        "review_detailed_main": "Christmas shouldn't have anything to do with super naturals. Its a big risk in movie making to have Martians meeting Santa. The Martians in the movie were not very martian like. They look like people with super hero clothes on. Martians, In my opinion, should not look human. I do feel the actor who played Santa Claus looked very good, one of the best looking ones iv ever seen. If you want to watch this movie yourself I found it on the American Pop Classics Hulu, http://www.hulu.com/network/American-pop-classics?sort=popularity, or direct link to movie, http://www.hulu.com/watch/112508/santa-claus-conquers-the-martians."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "guiltyascharged-1",
        "review_rating": "1",
        "review_title": "A truly horrible movie, yet strangely worth watching.",
        "review_detailed_main": "For those MST3K fans out there, \"Santa Claus Conquers the Martians\" is undoubtedly a movie you've heard of. For those not so familiar, the basic plot is Martians kidnap Santa to bring happiness to Mars. Sounds pretty bad doesn't it? While it isn't the worst movie ever made, it's easily the worst holiday movie ever made. I simply can't believe how bad it is.\n\nThe worst example of the vomit inducing dialogue includes a scene where Santa forgets the name of his reindeer and calls one of them \"Nixon\". Are you cringing yet? This movie also has some of the worst special effects I've seen, which brings to mind \"Plan 9 from Outer Space\". This movie has a crappy robot and a crappy polar bear. I'm truly scared of these moments not because of their effectiveness, but because of the utter incompetence of the costume department in the film.\n\nStill, despite it's horridness, it's still worth watching. It's in the public domain, so a quick look on Google, Yahoo, etc. will easily result in a few places to download the movie. I must say, Edward Wood would be proud of this film."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "JoeKarlosi",
        "review_rating": "2",
        "review_title": "Santa Claus Conquers the Martians (1964) *",
        "review_detailed_main": "Nobody expects a film with a title like this to be serious, and certainly this one wasn't - which helped a little, despite it being terrible. Here, cheesy Martians travel to Earth with a clunky robot to kidnap Santa and two Earth children, and take them back to Mars in the hope of bringing some good cheer to their own planet and their depressed Martian offspring. But there is one villainous Martian who thinks Santa is nothing but a troublesome fat man in a red suit, and tries to put a stop to him. A bad film to be sure, but I must confess I found the title song \"Hooray for Santa Claus\" fun in a definitely offbeat sort of way. * out of ****"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "KimitKimitTheFrg",
        "review_rating": "10",
        "review_title": "All time Classic!",
        "review_detailed_main": "This movie is super cool and awesome at the same time. It is funny, heartwarming, epic, dramatic, poetic, deep, thrilling, scary, and child friendly all at the same time!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Abby_Norm",
        "review_rating": "6",
        "review_title": "Hooray for Santy Claus!",
        "review_detailed_main": "That song still echoes in my head...in a good way! OK, so the film itself may have some problems with performances, continuity, etc., but the bottom line is that it is made for CHILDREN. And as a child, I thoroughly enjoyed it; so much so, that I still remember it fondly today some 20 years later! Some reviewers may have issues with this film when compared with the technology in films today, but one must keep in mind when this film was made. It was the early 60's, the space race was at it's height and USA had yet to make it to the moon! Misconceptions may abound in the plot, but they were pretty common in the 60s/70s. I love Star Wars although there is a world of difference between the original film and Episode III, but that doesn't make it any less enjoyable (although my daughter thinks Star Wars is boring and old fashioned...gasp).\n\nAlthough the film may not be worthy of top honors, it certainly does not belong in the bottom of the heap with the likes of Gigli, Glitter or Crossroads (which I believe has a better rating...WHAT?!?).\n\nMaybe this would be a classic today if it was animagic (like Mad Monster Party) instead of with actors, but I still recommend children see it at least once in their lives."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jbf-5",
        "review_rating": "3",
        "review_title": "Saw it many years ago but will always remember one dumb joke",
        "review_detailed_main": "Completely dopey, but who couldn't love a movie with the following bit.\n\nSanta is being threatened by a bunch of hostile and very green Martians. He tries to cut the tension with the following joke:\n\n\"What's soft and green and you put it on the end of a stick and toast it in the fire?.....\n\nA Martianmellow.\"\n\nI have tried to retell this joke to my wife, but go figure, it doesn't ever seem to come off. But then again she neither appreciates the Thee Stooges nor Mad Max.\n\nYou say it doesn't work for you either -- Well, maybe you would have to have seen the movie."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "shelbydog",
        "review_rating": "",
        "review_title": "Hooray for Santy Claus?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "sarastro7",
        "review_rating": "4",
        "review_title": "The real reason it's bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Steveo1986",
        "review_rating": "1",
        "review_title": "Ut-ter Rub-bish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "13Funbags",
        "review_rating": "2",
        "review_title": "A title full of lies???? No way....",
        "review_detailed_main": "This movie is considered one of the worst of all time.Although i don't completely disagree,I can honestly say it's probably the best movie I have reviewed so far. I can't find any definitive proof but I'm pretty sure this was made for TV.There are little breaks,it's 81 minutes and not rated and it's just very poorly made.All made for TV trademarks. The best part of the movie is Pia Zadora(who???) in the role of a lifetime as Girmar,the emotionless Martian child. So the Martians are advanced enough that they receive earth(American) TV and they understand and speak English. Yet they are dumb enough to think Santa Claus is what their planet needs. There's lots of terrible acting and plot holes. The Martians abduct Santa at gunpoint(the guns are hilarious and they never shoot anything),they also take 2 children so they won't be able to tell anyone what happened to Santa.Two seconds after they leave earth,the entire world knows Martians did it. They use stock US military footage for the space force that goes after the Martians,you know...the United States Space Force....... There are a couple Batman-esque \"Bang,Pow\" fights to counter the rambling dialogues.It's not enough to save the movie but it's something. There are apparently about 9 people on Mars,yet when one puts on Santa's spare costume,half of them think he really is Santa. The abducted children never cry or complain or ask for their mommy or to go home.They also quickly memorize all the Martians names,an amazing feat. Santa is happy and making really bad jokes the whole time and the name is a total lie.Santa Claus does nothing but make toys.At one point,the kids shoot bubbles at one Martian but that's it. At the end he just says goodbye and they leave. If you love terrible movies,you must see this. If you value your time, you shouldn't have even read this review."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ams20",
        "review_rating": "3",
        "review_title": "Allegory to the Cold War",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "doctorsmoothlove",
        "review_rating": "1",
        "review_title": "It's hard to imagine a worse Holiday movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ENDING-MAN",
        "review_rating": "2",
        "review_title": "If production wasn't so bad, it might have been a good movie.",
        "review_detailed_main": "All I have to say is that this movie may not have been so bad if the actors were better, the special effects been done by professional people and not by any random layman.\n\nNot to mention the elimination of that dorky \"Hooray for Santy Claus\" song.\n\nIt seems like it was just thrown together.\n\nThe sets could have been more professionally.\n\nSure, it\n\nwas made with good intentions, but it still is pretty bad. Story line\n\ncould have been revised too.\n\nI would have named it Santa Claus and the Martians. Why? Because they don't get conquered in the movie at all"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mylonitic",
        "review_rating": "3",
        "review_title": "No one will ever know that it was the Martians who kidnapped Santa Claus",
        "review_detailed_main": "\"Um...Do you realize what you just said?\" This is the movie that got my in-laws hooked on MST3K! Absolutely one of the most idiotic movies ever made. Had I seen this movie as a little kid (presumably the target audience), I would have had nightmares for weeks. However, Joel and the robots make this film immensely enjoyable. I laughed so hard I fell off the couch. A bit of warning: DO NOT, I repeat, DO NOT attempt to watch this movie UNLESS it is the MST3K version. One of the worst movies ever, one of the best MST3K episodes ever."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Movie_Reviewer123",
        "review_rating": "10",
        "review_title": "Brilliantly Terrible, Horribly Funny",
        "review_detailed_main": "Why did I, a very critical reviewer, give this movie 10/10? Because it is the best comedy I have ever seen.\n\nThe plot is set in Cold War-era United States and Mars. Santa Claus is accepted as real by the world, with TV interviewers flocking to make a report on this years' Christmas. However, elsewhere on Mars, the Martians see how cheerful children on Earth act compared to the Mars children, and after discussion with the Martian leader, they decide to go to Earth to kidnap Santa.\n\nIs that it? Yes, but this film is a comedy and nothing but.\n\nThe obviously bad acting, obviously fake effects and props, the ridiculous plot: all are evidence of an intentional parody.\n\nLooking at this movie from the perspective that it is a Sci-fi movie, it's an atrociously bad movie. Looking at it from a perspective that it is a comedy movie, it's brilliant.\n\nThe directors intentionally made every mistake possible while making the movie, used as low of a budget as possible, and basically did everything to make it so bad, it's funny.\n\nCinematic Titanic recently made a rather funny parody of this movie, but this movie was nothing but a hilarious comedy at the start.\n\nIt's brilliantly terrible, horribly funny."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Aegelis",
        "review_rating": "6",
        "review_title": "Aliens, \"Santy\", Automation, and Sabotage!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "dec2955",
        "review_rating": "3",
        "review_title": "Plan-9 From Santa Claus?",
        "review_detailed_main": "This movie is one of the 'forgotten' bad gems! How many could of thought that a movie about aliens and Santa could go so wrong? As many, I saw this as a kid when my parents would drop me off at the local movie theater the weekend before Christmas for a matinée, while they went shopping. Now as an adult I can remember the good times with friends as a child the weekend before Christmas when ever I see this movie. No mater how bad the props, acting, and even the story line.. this movie will always hold a special place in my heart! Share it with your children around Christmas, at the same time they are watching current classics like 'Elf' and 'The Santa Clause'."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "roarshock",
        "review_rating": "",
        "review_title": "I saw it in the theater when I was very young.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "the_mothman",
        "review_rating": "1",
        "review_title": "The worst movie on mars...",
        "review_detailed_main": "Okay, with a title like this, you should know exactly what you're heading into. Just let me say this: if you're gonna watch this movie, do it the right way and get the MST3K version. This version is actually tolerable; it left me with some pretty great quotes that I still use (hence the summary title).\n\nIf you're actually curious about this movie, here's the basic plot: the children of mars have been spending a lot of time watching earth television. They learn about the Christmas season and become curious as to why they have no Santa Claus on their planet. So, the martian adults decide to kidnap the real Santa to appease their children. I won't spoil the rest of the movie for you, so if you're still curious, track down a copy of this."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Cosmoeticadotcom",
        "review_rating": "3",
        "review_title": "Good crap?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "zorgen12",
        "review_rating": "1",
        "review_title": "Worse movie in History",
        "review_detailed_main": "I saw this movie when I was 10 years old. It was Saturday and my friends wanted to go see a movie. We searched the papers for something decent and this was the only movie that sounded at all interesting. I don't remember a lot from when I was ten but because this movie was so horrible I remember it. The acting was absolutely horrible, the special effects were something kids would do in their dads garage. I remember being embarrassed that I was watching it and for the first time in my short life I walked out halfway through a movie. I can't believe I even lasted that long. This movie is not even worth watching just to be disgusted or to say you watched it. Please, do not watch this movie. It would be better to spend 2 hours cleaning the floor with a tooth brush than to subject your brain to absolute garbage."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ihippo2",
        "review_rating": "1",
        "review_title": "Worst of the worst",
        "review_detailed_main": "I have to be honest... I've never seen the end of this movie, I have tried on several occasion but no luck. I tried to watch it with 2 of my friends and about half way threw my friend was on the floor talking about throwing him self down the stairs while me other friend was thrashing around on his bed in an attempt to knock him self out, yes this movie is horrid even the MST3K version. There is no match for the ridiculousness of this \"film\". Just wondering what state of mind of those producing this movie were in boggles my mind. all in all don't watch this and if you must have a suicide hot-line on hold.\n\nYELLOW CAKE!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "dvox",
        "review_rating": "4",
        "review_title": "The original \"Silent Night Deadly Night\"- straight from the island of \"misfit movies\"!!",
        "review_detailed_main": "If you've been naughty and not nice, Santa won't leave you a lump of coal, he'll tie you up and force you to watch \"Santa Claus Conquers the Martians\"!!! Whatever happened to the proposed sequel: \"Jesus Vs. the Christians from Neptune\"?"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "random_chaos",
        "review_rating": "1",
        "review_title": "Why do bad movies happen to good people?",
        "review_detailed_main": "If you've managed to avoid this film by now, be thankful. How bad is Pia Zadora's acting debut? How awful can a plot involving extraterrestrials kidnapping a mythological, jolly, fat man be? It gets real ugly real quick with technicolor to boot. The only redeeming quality this movie ever found was when MST3K spoofed it. Even then, I think Joel and friends had to do some heavy drinking beforehand. To summarize, keep this one on the shelf if you're a professional torturer in a small, Mid-Eastern dictatorship."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Mars Needs Moms to Monitor Martians",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "zacpetch",
        "review_rating": "10",
        "review_title": "Christmas Comedy Treat!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "NerdBat",
        "review_rating": "6",
        "review_title": "Very Underrated!",
        "review_detailed_main": "Oh come on, how can this movie have only 2 stars? Is it a well made, professional film? Of course not, but that's part of what makes it fun. The acting, especially a short fight scene are ridiculous but the characters become quite enjoyable. I especially love Droppo, the somewhat \"Slow\" member of the martian invaders. If you consider this a science fiction alien invasion film, you may be disappointed. This is more of a children's movie for Christmas time. It's a wonderful, fun, cartoony film. I just watched it this last Christmas with my boyfriend. Give the movie a chance, I garuntee you won't completely hate it!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "trixtium",
        "review_rating": "1",
        "review_title": "This is a CHILDREN'S movie?",
        "review_detailed_main": "How can the creators of this movie sleep at night, knowing how they have given millions of children irreparable trauma? Even with MST3K protection, I was looking around for sharp objects after enduring the unspeakably horrendous title credits. Just imagine how many children have committed suicide after viewing this atrocity WITHOUT the help of Joel, Tom, and Crow!\n\nThis movie (I use the term liberally) is more of a horror movie than a Christmas special. The raw pain that eminates from this mess is indescribable, but it will suffice to say that if you dare watch this visual poison, you should pound a pitcher before doing so."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "PlugHead",
        "review_rating": "",
        "review_title": "Ho-Ho-Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "KuRt-33",
        "review_rating": "1",
        "review_title": "Good kids get presents, bad kids get to see this movie",
        "review_detailed_main": "\"What's Christmas?\" asks a man with weird paint on his face and a cross between a large tea cup and a flower pot on his head. Well, he's a Martian and over there Santa Claus doesn't exist. This depresses their kids (including Pia Zadora) so much that the Martians decide to kidnap the little fat man in a red coat. Being much more intelligent than people from planet Earth, they kidnap some kids first to tell them where Santa can be found. \"What's that on your head?\" asks the girl. \"An antenna\", replies the Martian. Then the girl asks: \"Are you a television set?\" This aggravates the Martian version of Grumpy, who thinks television and Santa Claus turn the kids into nincompoops.\n\nAnne Robinson (the cruel host from The Weakest Link) once said she hated children's tv because the presenters always shouted and treat the kids like morons. The same can be said for this movie. It's not because it's a movie for kids that it can get away with a stupid plot. A movie where children's footprints are only noticed after the Martians discovered the children have escaped. A movie where Mrs. Claus is portrayed as a brainless plant. A movie where the dwarfs are paralyzed by the Martian's guns (it's a pity the actors can't stand still). A movie where Santa Claus is kidnapped by Martians. And a movie where, due to financial restrictions, the part of the polar bear is played by a man in a suit. Need I say more? Yes, I might end with a joke from the movie: what's green, sticky and roasted over a fire? A martianmellow. I think that says it all. \"Oh dear, oh dear.\""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "TheUnknown837-1",
        "review_rating": "1",
        "review_title": "what's worst about this infamous clunk o' junk is not the acting or the special effects or even the lack of continuity, but the harrowing impression that nobody is even trying",
        "review_detailed_main": "Allow me to state a firm, sincere opinion of mine right off the bat. \"Santa Claus Conquers the Martians\" is one of the all-time worst, most depressing, inexcusably amateurish and unendurable movies ever made. Even at a brief clocking time of eighty-one minutes, watching it feels like eighty-one days. I seldom use the word 'hated' when discussing movies (even bad ones) but I have to here. Because on my list of the five movies I would never, ever want to see again, this ranks at #4. There is not one - not *one* - redeeming element about this clunk o' junk. Everything in it is miserable. But what's most depressingly bad about it is not the directing, the acting, the writing, the amateurish cinematography, or the special effects that are dwarfed in conviction by the amateur monster costumes I saw at the G-Fest this year. What's most terrible about this movie is the harrowing impression that nobody is even trying.\n\nFor those who care, it is a children's' movie. During the other-world month of Septober, the children of Mars (or at least the present-day children of Mars) become increasingly depressed due to a lack of toys and fun and games. So one day, the king of Mars (and father of the only two Martian children I saw) decides to kidnap Santa Claus and have him manufacture toys for his children. With some goons, he kidnaps Santa and two Earth children around Christmastime and bring them to Mars. But, oh no, there's a mean old Martian with a mustache who doesn't want Santa making Martian children toys. And then...and then...\n\nAh, who cares? What a stultification-inducing plot. And believe me, the story is even lousier. But let's shove all of that aside. Let's just pretend we live in an alternate reality universe where movies don't need plots or stories or good writing or acting or directing to be good. Let's just judge it on bad movie standards. Oh, no, it fails on that level too. The movie would like to be a funny, charming, low-key little gem but instead comes off as a shameful catastrophe. I suppose somebody once conceived it might work, but nobody even bothered to try. There are moments that by themselves may induce laughs, but when seen with the rest of the movie just force your eyes toward your watch. The movie opens up with one of the worst, most annoying songs I've ever heard as the titles (with many spelling errors such as \"custume designer\" as Crow pointed out) scroll with horrible animation. Following this is just one headache-inducing moment after another, including an outrageously bad scene with a polar bear, which is the worst monster costume until \"Hercules in New York.\" And would-be laughs with a goofy Martian bumbler just make one click the 'mute' button or hope for some violence to eliminate an annoying character.\n\nNobody was even trying with this awful movie. There's a critical moment after the point where Santa is kidnapped, and then the movie flat-up forgets all about it. It's a scene that takes up a great deal of time and then without any explanation stops. It seems as if the screenwriter wrote the story on paper towels and used one to wipe his lips after supper. Or is it possible that instead of a screenplay, they just made this up as they went along? Heck, the sets are so cheap and the actors so deprived of enthusiasm, they could afford to.\n\nThere was not a single, insignificant moment of \"Santa Claus Conquers the Martians\" that I enjoyed. The entire thing from start to finish is a complete headache and a mind-numbing bore. It isn't quite the worst movie I've ever seen, but it is on the runner-up list and not too far behind. Very few movies have sunk so low. The most shameful thing about is that nobody is even trying. With most bad movies, there is the relieving element that at least *somebody* in the cast or crew was putting up an effort. But nobody was here. The only reason why people watch this movie is to a) see a young Pia Zadora as the Martian girl and b) to test its reputation, as I did. It is a movie that must be seen to be believed. But I implore you to take my word for it. Oh, and incidentally, the movie is called \"Santa Claus Conquers the Martians.\" Well, at what point, exactly, did Santa Claus conquer the Martians? See? Even the title makes no sense."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "pierrestjohnstchristopher",
        "review_rating": "1",
        "review_title": "A work of pure genius",
        "review_detailed_main": "This is quite possibly the worst movie of all time. Yes, yes, I know some people tend to over-dramatize the extent of their hatred for something, but I assure you, I joke not. This is excrement in its purest form. I have no doubt in my mind that the next time I have to use a toilet, a DVD with \"Santa Claus Conquers the Martians\" on the cover, will plop into the ivory bowl. Did it even have a budget(i.e. man in god-awful polar bear costume)? Aside from the alien mother(who I found to be rather intoxicating for an early 60's film) the other actors seemed to be as clueless as I was about what the hell was going on. I was bored. You'll be bored, too.\n\nI don't know what drugs good ole' Santy Claus was taking when he made this movie, but he could not have looked, or sounded, any more tanked than Colin Farrel at happy hour. They must have told the fat, red man that a mountain of weed would be waiting for him at the end of shooting this garbage.\n\nYou know how there are some movies that are funny and others are just plain stupid? This one belongs in the category of the latter. I literally felt embarrassed for all the actors, especially the children. These poor young lads and lasses would no doubt have killed their film careers by even being mentioned in the opening credits.\n\nWhen the film finally did end (a time period that seemed to span somewhere in the proximity 50 or more years) I promised myself that I would never subject myself to any movie that had the combination of \"Santa Claus\" or \"Martian\" in the film's title. Thank the lord, Jesus H. Christ, I didn't waste any of my money renting this worthless excuse for a film (and I use that term loosely). Do NOT rent this film. Buy a new hat or something."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mattirsmi",
        "review_rating": "2",
        "review_title": "Still just as bad as when I saw it in 1964",
        "review_detailed_main": "I thought I had a bad dream in 1964 but the nightmare came back one day when I saw AOL pushing this film to their broadband subscribers. Of course, it made one wonder what exactly they were offering that was new and exciting? It is good for a laugh in that it is so bad. I had even gotten one of the Martians guns for Christmas. But believe me there was not marketing tie in, they just did not want to spend the money on props."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Santa Claus Conquers the Martians",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jesse_barboza",
        "review_rating": "2",
        "review_title": "Hooray for Patrick Swayze...I mean, Santy Claus!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ggjjtt",
        "review_rating": "1",
        "review_title": "Bad, Bad, Bad, Bad Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "notadr8",
        "review_rating": "9",
        "review_title": "terrific",
        "review_detailed_main": "My, my, isn't everyone enjoying the superiority that an extra 40 years of pop culture provides! It's very evident that most people in these comments don't understand how perfect this movie was for the pre-ten year old set in 1964. As another commenter noted, it has Santa, it has Martians, it has elves and magic.\n\nI love the rich color of the movie, and Santa is the best, especially his first scene, being interviewed by the news reporter. This is all a great trip back in time, like to a forgotten old story book. The acting is fine, though I don't think it's an issue unless the kids are absent mindedly looking into the camera when they shouldn't.\n\nGreat hokum. It reminds me of some of the early BAD Hannah-Barbara cartoons and various early 60's surf board movies but I don't mind at all. This is a great artifact of the early Television age (1964).\n\nEnjoy, and don't let the nay-sayers put you off."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "VetteRanger",
        "review_rating": "6",
        "review_title": "The movie which convinced me that The Grinch has Martian blood",
        "review_detailed_main": "Santa Claus Conquers the Martians is intentionally campy and silly, and introduces the cheapest robot costume in the history of film LOL ... probably.\n\nHowever, the movie has a good heart, evident in Santa's continuing conclusions that the \"bad Martian\" means no harm. Luckily the two Earth kids the Martians also kidnap are not as naive.\n\nNear the beginning, a Martian elder outlines the problem with the latest generation of Martian children and suggests they need a Santa Claus. So the Martians decide to bring Santa to Mars. Once they reach Earth, cover your ears lest the stupid sounding technical dialogue leave you nauseated, but watch for the robot. No other set of cardboard boxes painted gray has ever looked so good.\n\nSanta doesn't get alarmed until a Martian tells him they plan to keep him on Mars. This leads to a toy battle reminiscent of Babes in Toyland. :-)\n\nIt's silly and certainly not for everyone ... and you'll have to be in the mood ... but there are some real laughs in this thing."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Strangeworth",
        "review_rating": "1",
        "review_title": "When exactly did he conquer them?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "zackhammer",
        "review_rating": "",
        "review_title": "Best christmas film ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ralfeeus",
        "review_rating": "1",
        "review_title": "How can something so bad be so good?",
        "review_detailed_main": "I was watching TV and this film came on. Now normally, I'll watch these types of movies through to the end, but this one? Well, it was so bad I had to change the channel every few minutes, so that my IQ didn't drop another few points, since I don't have many to spare.\n\nBut no matter how many times I turned away, I couldn't help but turn back and watch a little bit more of it. The crappy costumes, the horrible scripting and acting, and most of of all, the stupid laughing... damn, that laughing was horrible.\n\nAlthough I couldn't stop turning back the movie was gawd-awful, and it deserves every bit of the 1 star I gave it. I wonder if that 1999 remake is any better..."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "occupant-1",
        "review_rating": "2",
        "review_title": "Words fail me...",
        "review_detailed_main": "I've recorded this movie off cable twice - and twice couldn't bear to keep it, recording something else over it. CARDBOARD ROBOTS. Still, it has a curious allure, like the more commonly-known badfilm gems, such as Ed Wood's stuff or Sonny Tufts epics. It may be because of the relative quality of the time: as bad as it is, it still retains a kind of literary form, having a beginning, middle and ending, in which all characters contribute to the resolution of the conflict. Therefore, one can clobber the latest pretentious \"art\" film by pointing out that its plot's outdone by SCCTM."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Andy Sandfoss",
        "review_rating": "1",
        "review_title": "Xmas depression made flesh.....",
        "review_detailed_main": "This isn't even a good idea for a movie. Fey, green-skinned Martians with gas tubing on their heads for no good reason kidnap Santa Claus to make him bring joy to their children. The plot twists and warps like space around a black hole until the screenwriter remembers that the film needs a happy ending. Then one is just manufactured out of thin air. This film would probably scare the dickens out of any kid under six; no child over that would believe such twaddle."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "damoose-3",
        "review_rating": "1",
        "review_title": "Quite possibly the worst movie ever made",
        "review_detailed_main": "I first saw this movie on Christmas nite. I don't know whether it was because of all the food I had consumed throughout the day or just pure boredom but for some reason, I sat down with my father and viewed this hysterical holiday film. First you have the martians, grown men in bright green makeup and funny hats. Their names are so ridiculous that you cannot even remember who is who. These martians are frightened that their children are becoming boring (probably because they are fed math problems and equations through their tentacles all day long) so they ask an 800 year old swamp creature who looks like a cross between Yoda and Planet of the Apes what to do. He tells them to kidnap Santa Claus!!! At this point, I should have walked out on the movie but I continued due to ridiculous curiosity. Basically, the Martians make a trip to earth in a space ship that looks like a Bic lighter and kidnap two innocent children from a park. Along with the Children they head to the north pole. The children escape at the pole and attempt to warn Santa of the Martian plans but are stopped short by a polar bear that looks like the Snuggle bear from those laundry commercials and a robot who looks like corrogated cardboard and crushes things. The rest of the idiotic movie is Santa building a martian northpole on mars and giving \"Dropo the drunken martian\" the position of Martian Saint Nick. Then, Santa and the children head back to earth just in time for Christmas eve. After viewing this insane film and laughing hysterically throughout, I had to review it and warn the public. Do not view \"Santa Claus Conquers the Martians\"!!! It is without a doubt one of the single dumbest movies I have ever seen."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "SQdsv1",
        "review_rating": "1",
        "review_title": "Oh Boy",
        "review_detailed_main": "This is one movie that you want to avoid. I think i actually became stupider while watching this. I've seen better acting in a kindergarden play. The props look like they threw together what ever they could find in a garbage can. One robot looks like it is made out of cardboard!! They should have fired DROPO into the sun!! I don't think that i can ever sit through this whole movie again unless im watching it on MST3K. I can't believe that i was watching this on AMC (American Movie Classics) channel."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "wgreid",
        "review_rating": "5",
        "review_title": "Yeah, but you have to dig the kitchy song !",
        "review_detailed_main": "This movie sucks but `Hurray For Santie Claus!' is a family favourite in our house every year ! I think they play it at the end of the movie ? Otherwise this is something to sit back and have a good laugh over. MST3000 has the most fun with it."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "rowsdower45",
        "review_rating": "1",
        "review_title": "The least entertaining Christmas movie ever",
        "review_detailed_main": "A) The story is abysmal\n\nB) The actors sucked! (except for Voldar--I thought he was good.)\n\n1 star out of 10.\n\nA ha ha ha--!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "overandoverture",
        "review_rating": "10",
        "review_title": "Wonderfully Cheesy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Dolf",
        "review_rating": "7",
        "review_title": "A laugh riot in every scene",
        "review_detailed_main": "How anyone can knock this film, I have no idea. Sure it is bad, awful even. But it's one of those films that is SOOOOOO bad it will have you rolling in the aisles.\n\nThe acting in every scene is some of the worst I have ever seen. The plot is almost nonexistent, I mean is there any doubt that the filmmakers just wanted to go for the big kid draws of Santa and Martians? The props make Ed Wood's films look like they were done by ILM. What's not to like?\n\nIf you hated this film, you don't know how to watch a bad movie. For an extra treat, the MST3K version of this movie is a ton of fun."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "EJK-3",
        "review_rating": "1",
        "review_title": "Pia's acting debut",
        "review_detailed_main": "probably the worst christmas movie of all time. it is so bad you will laugh your head off. santa claus is such a dope you hope that the martians will keep him on mars forever\n\nOne of the kids (Girmar, for girl martian) is none other than PIA ZADORA, yeppers, Pia Zadora ---- an omen for her acting talents to come.\n\nafter the ninth viewing though, you do get sick of it 8^)"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "vcravens",
        "review_rating": "",
        "review_title": "What's not to like?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Boba_Fett1138",
        "review_rating": "1",
        "review_title": "Oh me, oh my, oh me!",
        "review_detailed_main": "This movie is really among the worst of the worst. It basically does everything wrong and should serve as a perfect example of how not to make a movie.\n\nThe concept already of course sounds completely awful but the complete script is even worse than the actual concept. Basically very little actually happens within the movie and has some serious pacing problems. The movie also features an awful bunch of characters, Santa Claus himself included. I don't know who are what is more annoying, the kids, the Martians, Santa Claus, or that guy in that polar bear suit. More annoying is when suddenly burst into laughs, often without an apparent reason, to probably make the movie more cheerful and comical to watch.\n\nFor a Christmas movie it also surely isn't cheerful enough. Instead its actually rather depressing. It has absolutely no Christmas spirit in it and the atmosphere is just totally wrong for this production. It's hard to say what they tried to achieve with this movie. Make a joyful season Christmas movie targeted at children or was it an attempt at making a more 'serious' science-fiction meets Santa Claus crossover, aimed toward an older audience.\n\nOf course the movie also uses tons of archive footage of rockets being blast off and also some more random footage of airplanes refueling in the air and world leader gatherings, to 'discuss the startling sudden disappearance of Santa Claus'.\n\nIt's '60's science-fiction, so it features all of the usual stupid and silly looking ingredients. Next to lots of archive footage, this means that the movie also has fake looking 'futuristic' sets, awful costumes and make-up for the Martians and just also general bad fake looking sets and costumes for the robot and the earlier mentioned polar bear.\n\nDon't, under any circumstances, ever watch this movie!\n\n1/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Oosterhartbabe",
        "review_rating": "1",
        "review_title": "Terrible Christmas movie(is there any other kind?)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "xcheck_Trump_Won",
        "review_rating": "2",
        "review_title": "You must see it once.",
        "review_detailed_main": "Aye, it's a horrible movie.\n\nHowever, just as one slows down on a freeway to gape at a traffic accident, one must sacrifice 2 hours of his/her's life to see this.\n\nIt's sooo bad it's funny.\n\nIf you can acquire a copy, veiw the Mystery Science Theatre 3000 version. Now THAT you'll be able to watch over and over."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Quinoa1984",
        "review_rating": "3",
        "review_title": "Ho Ho Huh?",
        "review_detailed_main": "There's not a thing that the filmmakers behind Santa Claus Conquers the Martians gets right, but right from the beginning their premise is so preposterous I'm not sure it could have even if it had been helmed by Richard Fleischer on a good day. This is about how martians - who we know are martians because of their awful, vomit-green paint on their faces and helmets that were bought at 1964's equivalent of Party City, despite them not coming from a red planet (for the brief seconds we see Mars it looks more like some green orb with some varying shades of things, I can't describe it at all for the life of me) - see that their martian children are too obsessed with the TV and a news reporter interview with Santa up at the North Pole. This leads them to come to Earth, they end up kidnapping two hapless kids first, and then use a robot (which doesn't do much) to kidnap Santa Claus so they can... do WHAT, exactly?\n\nMaybe the filmmakers thought they were going to make a sweet and dopey little children's movie, but what they got instead is alternatingly obnoxious and kind of insane in how the editing goes, not to mention the casting of John Call as a Claus who may just be TOO close to how kids picture Santa so that he becomes nightmare fuel instead. There's one particular martian named Dropo (Bill McCutcheon) who seems to be the biological father of Rob Schneider as far as being the kind of comic relief one wants to punch repeatedly to make him shut his face. There's also a couple of nefarious martians - one of which a Bryan Cranston stand-in and another who has a mustache halfway to Connery's hairy appendage in Zardoz and Daniel Plainview - who are so uptight that their performances can't help but be laughable.\n\nI think it's advisable to go the MST3K and/or Rifftrax route for this one, but I would be curious to some day watch it without the addition of the commentary. It's so bad that it's mesmerizing at certain times, from the stultifying acting and extremely cheap sets (at one point, and this is when they're still on the ship I think, the martians put a couple of the kids in what looks like a broom closet, no mock-up done to it at all), and how it's all done with a completely straight face. It's almost excusable how one note the child actors are (if they even are actors, I think a couple of parents lost their children at the bus stop and they were plugged in to this for a week or two), but what undoes any even shred of good-will is that its Santa does the same \"conquering\" in scene after scene: he will make the martians LAUGH until they're uh still green in the face.\n\nThis all leads up to a climax where one of the martians is defeated by, you guessed it(?) Santa using his dark arts to use the toys to attack him with their cuteness and toy-ish ways. The way the editing, in a montage style that I'm sure (no, I'm not) was lifted from the Eisenstein cookbook, cuts back to a laughing Santa Claus during this makes it look like he could be a serial killer instead of jolly ol' St. Nick. From the consistently terrible dialog, an occasional appearance by a newsman that looks like a marionette, and the first screen appearance by, uh, Pia Zadora(!) this is a complete mess, but a lot of fun.\n\n(PS: In full disclosure I did watch this with Rifftrax Live, and it made for a spectacular experience)"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jordondave-28085",
        "review_rating": "4",
        "review_title": "Cheesy and bad would have Santa conquering producers than the martians",
        "review_detailed_main": "(1964) Santa Claus Defeats the Aliens FAMILY SCIENCE-FICTION\n\nSaw this as \"Santa Claus Defeats The Aliens\" which really should've been called \"Ed Wood Presents Santa Claus Defeats...\" since it's a low budget feature film which is exactly how Ed Wood usually make his films. The set up has Martians from mars with green paint on their faces, questioning why their own children look so unhappy, so they devise a plan to kidnap Santa Claus from the planet earth. And by the time they get to earth, they bump into a couple of kids and informed them that the real Santa lives in the North Pole which is exactly where they went taking along with them are the two children, since they had just found out their real intentions and don't like the idea of the real Santa being kidnapped. The two kids unsuccessfully did make attempts to warn him, but was later captured by a fake looking robot which is obviously a guy wearing a fake looking robot suit sent by the Martians themselves- also their is also a guy wearing a fake looking polar bear suit who walks with his hands and knees. To say anymore would be pointless, but the thing is that I have no idea how I was able to watch this all the way through without cringing as opposed to some big budgeted movies. And I guess it's because I've used to see my fair share of movies similar to this one during my younger years which it wouldn't take much to entertain me, meaning that low budget production costs is sometimes not a requirement to watch some of these movies intended for kids going into pre-school. Let's see, their was \"Electric Company\", Mister Rogers\" to \"Sesame Street\" which it wouldn't take much to get children entertained when people are wearing fake looking costumes and bad makeup. I don't hate this since it's demographic is clearly obvious, but at the same time I don't like it either."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "marabear-1",
        "review_rating": "10",
        "review_title": "This movie is absolutely amazing in it's terribleness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "dweilermg-1",
        "review_rating": "7",
        "review_title": "* Not the worst!",
        "review_detailed_main": "* Santa Claus Conquers the Martians (1964) produced as a Christmas season matinee movie to entertain children yet teens & adults will find it to be laughable kitsch. HOWEVER IMHO this not the worst Christmas movie ever made. I personally give that distinction to Santa Claus (1959), filmed in Mexico and in 1960 dubbed into English for American kiddy matinee audiences. As a child I saw that one and absolutely hated it, thinking to myself \"Why am I here watching this?\" To this day I can watch and enjoy Santa Claus Conquers the Martians(1964) for laughable amusement BUT never again could I ever sit through Santa Claus (1959)."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "LesWaste",
        "review_rating": "",
        "review_title": "Dropo is the Torgo of the 60's. Wait a minute. . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Moonbeam_87",
        "review_rating": "2",
        "review_title": "Huh, What, Did they Kidnap Santa Yet? Oh still Boring, Goodnight.",
        "review_detailed_main": "Yeah you can see Where this is Going A Rating You Never Saw from Me Before, But it EXISTS, My TM F FOR FELL ASLEEP, I MEAN IT GOODNIGHT! If You Can't Sleep due to Insomnia, Then This Film is Better than a Tranquilizer. So Enjoy Falling Asleep, Before Santa Claus can Conquer the Martians."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "shensley-31445",
        "review_rating": "3",
        "review_title": "Pretty bad but certainly not without its moments of amusement",
        "review_detailed_main": "I generally love so bad it's good type movies. Plan 9 from Outer Space is a true laugh riot in my opinion.\n\nSo when I heard about this one and it being the Holiday season I had to check it out.\n\nUsually so bad it's got type movies have a lot of laughs in them.\n\nUnfortunately I didn't laugh as much at this as I thought I would but there are a few funny moments to be found.\n\nIf you're searching for an offbeat holiday movie this would certainly do the trick.\n\nThere's not much more I can say about rating this movie. The title pretty much says what you need to know about the quality.\n\nIt's not in the same league of Ed Wood type of enjoyably bad but I was amused a few times and sometimes that's enough for a movie to offer."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "scsu1975",
        "review_rating": "1",
        "review_title": "Pia Zadorable but that's about it",
        "review_detailed_main": "Sure, you can have \"It's a Wonderful Life\" and \"Miracle on 34th Street,\" but Christmas would not be complete without this monstrosity.\n\nIn the opening credits (and end credits) we are treated to the twist-like ditty \"Hooray for Santa Claus,\" composed by the renowned Milton Delugg. Sure-fire top forty stuff.\n\nMartian children are watching earth broadcasts and lamenting there is no Santa Claus on Mars. (The tv reception is excellent on Mars, so apparently Time-Warner cable is not involved.) Anyway, the kids' father, Kimar, decides he will go to earth and put the bag on Santa. He is accompanied by the villainous Voldar and the moronic Dropo. They all look like teletubbies.\n\nSanta is a bit senile - he refers to one of his reindeer as \"Nixon,\" presumably the one with the sweat on his lip. The Jolly Old Soul is accosted in his workshop by a Martian robot, who tosses around a few elves before Santa calms it down. Kimar and Voldar arrive and convince Santa at ray-gun point to come to Mars and make the children happy. Santa agrees, and when you see his wife, you'll know why he is anxious to get off this planet. Accompanying him on the trip are little Billy and Betty, who were snatched in the woods after giving up Santa's whereabouts. Stoolies.\n\nThe rest of the film, if you've stayed awake so far, pretty much has Santa making toys and Voldar trying to gum up the works. In the exciting finale, Voldar is toyed into submission by Santa and the kids.\n\nI actually recognized a few people in this cast. Vincent Beck, as Voldar, talked so loudly I kept hoping his moustache would fall off. Ned Wertimer, famous as the doorman on \"The Jeffersons,\" plays a roving reporter. I never heard of Gene Lindsey, but he plays a polar bear and makes one yearn for their extinction. I would never have recognized 8-year-old Pia Zadora as a green-faced Martian kid.\n\nBy all means, have the kids watch this on Christmas Eve. They will be asleep after ten minutes, which will give you plenty of time to get into the attic and try to put their toys together while following directions written in Chinese."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "hoskinsmike",
        "review_rating": "1",
        "review_title": "So bad I couldn't wait for it to end",
        "review_detailed_main": "I'd heard of this film for years and I'd always say someday I'll get around to it. Well, I finally got around to watching this terrible movie and you know what? I want my 1 hour and 21 minutes back. Just gawd awful. Ed Wood could've made a better film than this. At least I can now say I've finally sat thru the entire movie somehow without walking out or stopping it before it finishes.\n\nJohn Call plays Santa and a who's who of unknowns I've never seen in any other movie nor do I wish to.\n\nThe production values are terrible, right out of someone's basement. At best, watch it late at night so it will put you to sleep.\n\n1 star."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "bigverybadtom",
        "review_rating": "1",
        "review_title": "This Could Have Worked If They Wanted It To",
        "review_detailed_main": "It's a very cheap kids' movie about Santa Claus being real, and a team of green Martians kidnap him from the North Pole, but they inadvertently catch two little kids as well. Why do this? Martian children have found out about Santa through watching television broadcasts from Earth, and they want him for themselves.\n\nAs far as children's entertainment goes, it could have worked if the story had more humor. I remember some very cheaply made live shows and cartoons from my childhood, and some of them were actually entertaining. Good writing can make up for everything else being poor. Unfortunately the good writing isn't there."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "matthewlcorey-77844",
        "review_rating": "5",
        "review_title": "The title pretty much says it all",
        "review_detailed_main": "Crisis on Mars when the children of the red planet, who are monitoring Earth's television broadcasts, see footage of Santa Claus delivering gifts to children on our planet and become clinically depressed. This causes the Martians to send a rocket ship to Earth in order to locate jolly Saint Nick and abduct him. Their plan is nearly foiled by two young kiddos; however the Martians eventually prevail and the kids get swept up with Santa and taken back to Mars.\n\nIt would be impossible to overstate the cheesiness of this entire effort. Cardboard robots and laughably inept make-up effects are only the most glaring examples - but at some point it becomes almost irrelevant. Either you are on board with Santa Claus Conquers The Martians or you're not."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "pleasantstreet-856-664438",
        "review_rating": "5",
        "review_title": "Watched when it came out",
        "review_detailed_main": "Okay, I admit going to the movie theater in my small town (Remember movie theaters in small towns?)and watched this movie with all of my cousins for a special Christmas fun movie for kids. I was about 6 years old. We had fun, we laughed, enjoyed ourself, and I still remember the song. We did not see anything inappropriate, or hear foul language.\n\nNo, I can't get my grandkids to watch it. Their loss. It is too old Grandma, it is gross looking, are you kidding me and just no! My kids saw it, I probably made them, and they lived through it!\n\nJust give it a watch, so in 60 years you can tell your friends snd family about this movie!\n\nI will sing the theme song for the rest of my life!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Casey-52",
        "review_rating": "10",
        "review_title": "Completely entertaining!",
        "review_detailed_main": "Even though \"Santa Claus Conquers the Martians\" is always on the bottom 100 list here at the IMDb, it's not as bad as you would think. Personally, a bad movie to me is one that has no entertainment value whatsoever (or a movie that has nearly no entertainment value). For example, \"Demented\" and \"Burial Ground\" are bad movies in my book. \"Santa Claus\" is not.\n\nThe storyline is simple: Santa Claus is kidnapped by Martians to provide joy and toys to the children of Mars when they become overly depressed. Sounds like an ingredient for one of the worst movies of all time, right? Wrong! This movie is pure entertainment from beginning to end! It doesn't ever get REALLY boring, instead having long stretches of goofy comedy that isn't funny for the right reasons. The acting is mediocre at best, but I did like the sets they used. Very surrealistic, in my opinion. There is plenty of great dialogue to laugh at (i.e, \"I wasn't sleeping! I just haven't been able to sleep these past few nights...I forgot how! So I was just practicing!\"), most of it coming from clumsy Droppo, \"the laziest man on Mars!\". The little children who are kidnapped by the Martians are a mix of wooden and dedicated. Of course, some scenes' inadequacy are inexcusable! The polar bear costume is obviously fake and the Martian guns are Whammo Air Blasters that freeze people (who manage to keep moving and blinking, for some reason)!\n\nScenes to watch for: the Martians use the robot Torg to kidnap Santa, but Santa makes him into a toy!; the 'suspenseful' space door scene; the 'amazing' toy conveyor belt; Droppo passing as Santa (antennae and all); and the final showdown between Voldar and Santa, utilizing bubbles, water guns, soldiers, and other conveniently placed toys! \"Santa Claus\" is pure entertainment, in my opinion, and all those who speak against it should be sent to Mars!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "keenanchris",
        "review_rating": "7",
        "review_title": "Don't believe the cynics!",
        "review_detailed_main": "I'm surprised this appears on many all time lists of the worst film ever. It's nowhere near as bad as the cynics say it is, and it's target audience of toddlers and young children would have enjoyed it back in the day. Now, I'm not so sure, but if they like things like the old 60s batman and Rudolph the red-nosed reindeer, then this would probably appeal to them.\n\nIt's low budget and that's apparent with the sets and make-up, but that doesn't really detract from the ensuing, pantomime mayhem. The actors ham it up in theatrical fashion and Dropo and Santa Claus give particularly entertaining performances, and the crazy story will certainly be believable for tots and those with a childlike imagination. Plus, it's got a very catchy theme tune.\n\nSo, if you approach it in the right frame of mind and are looking for old Christmas films that you haven't seen yet, you might actually enjoy this!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Santa Goes to Mars",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "luann-lewis",
        "review_rating": "1",
        "review_title": "The Worst Movie I've Ever Seen",
        "review_detailed_main": "I've seen a lot of bad movies... Planet Nine, Attack of the Killer Tomatoes, and many more, but this is the honor of being the absolute worst movie I've ever seen! It's not campy, it's not interesting, no part of it is clever. Seeing some of the cast is mildly interesting, because they seem vaguely familiar, and the idiocy is jaw-dropping, but none of that rescues it from being just horrendous. I can only believe that they had a really good time making it, and that's what sort of rescues it because you think that these actors must've had a good time otherwise it would be considered humiliation."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jamesrupert2014",
        "review_rating": "4",
        "review_title": "Seasonal silliness - cheap charm marred by weak ending",
        "review_detailed_main": "Prompted by his children's sadness at not having a Santa Claus, verdant father Kimar (Leonard Hicks), along with the \"mean\" Voldar (Vincent Beck) and goofy Dropo (Bill McCutchen) head to Earth to kidnap the jolly old elf (John Call) and end up bringing a couple of plucky Earth-kids to the Red Planet as well. While far from great cinema, this good-hearted bargain-basement Christmas flick hasn't aged well but was probably entertaining enough for the youngens back in the day. Acting, script, special effects and production values in general are all second-string (especially the 'polar bear'), but the final product is no worse than some of the treacly 'Xmas specials' that infested our TVs in the holiday season. The are some amusing tidbits sprinkled throughout as well as some unexpectedly 'harsh' moments (a gloating Voldar appears eject the Earth kids out the rocket's air-lock), but unfortunately the 'finale', in which the kids and Santa, heavily armed with toys, get the drop on the green-skinned nasty and his hench-Martians, is painfully juvenile even by the nominal standards of the rest of the pic. Oddly, the film's claim to fame is that one of Martian kids is played by Pia Zadora, whose later 'celebrity' made her the best known member of the cast (which tells you something about the others). Not great but better than a sub-3, especially considering some of the other dreck that floats to the surface every December."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Aaron1375",
        "review_rating": "1",
        "review_title": "Santy Clause doesn't really conquer anyone.",
        "review_detailed_main": "This movie is dreadful, pure and simple and that is the nicest way I can describe it. From the annoying opening and ending theme, to the horrible production values, bad story, and inept actors this has to be the worst Christmas movie out there. And there have been some really bad Christmas movies. From the title, I was almost expecting something along the lines of that fake movie in \"Scrooged\", the one with Lee Majors. However, this is just a very bad movie where martians want x-mas so they kidnap Santa. Not much in the way of fighting or conquering going on here. Santa is rather annoying, but he probably is the best actor in the film which is scary. And the less said about the one martian who dresses up as Santa the better. The child actors are not much better and there is really nothing to be said of the sets. Every thing here is rather cheap looking and there is a scene with a polar bear that is just to stupid looking, however it looks great next to the martian's robot. As for the plot, strictly by the numbers, nothing is going to surprise you here. And I know this is probably someone's favorite x-mas movie from their childhood and they are going to want to write me and tell me how this movie is about changing socialistic lifestyles through being more friendly, but please save your breath. I just thought this movie sucked and there is nothing anyone can say that will change my mind."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "adamjohns-42575",
        "review_rating": "3",
        "review_title": "Naughty Martians!",
        "review_detailed_main": "Santa Claus Conquers The Martians (1964) -\n\nI bought this film on DVD years ago having seen it on a list of the greatest Christmas films. Sadly neither the first or the second of the discs that I bought got further than the middle of the film, when a man in a polar bear suit, made by someone who had clearly never seen a real one appeared.\n\nSo I have been waiting for it to be shown on TV to find out what happened in the end for closure and I have to say that if it didn't even interest my Mother, who watches all sorts of badly made, B-Movie, 'Murdoch Mysteries' sort of rubbish, then it was never going to wow me and she switched off to check her eyelids for holes pretty early on.\n\nOnce the robot Targ arrived, like something made in Primary School for a play, I knew that it was only going to go even further downhill than Dropo (Bill McCutcheon) had already taken it.\n\nHaving watched a lot of 'The Two Ronnies' comedy stylings lately, I found this film to bear a strong resemblance to their approach to sketches and I could easily see them replicating this situation with the same humorous results and without losing any credit as comedy sketch writers.\n\nKimar (Leonard Hicks) could easily have been played by Charlton Heston, not only because he sounded just like him, but because the acting was of that sort of calibre, poor as it was from basically everyone.\n\nAnd as if the idea of Martians kidnapping Santa Claus wasn't daft enough, the end result was just stupid.\n\nAlso, the execution of the film and the \"Special Effects\", special like a painting from a kid at nursery school, were dire and odd to say the least. Talk about a shoestring budget.\n\nA badly done B-Movie, that should probably be a Z-Movie instead, because it didn't even provide that usual fun charm that others like 'Flash Gordon' (1980) have had.\n\n349.01/1000."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "johnstonjames",
        "review_rating": "10",
        "review_title": "Hooray For Santy Claus! Does It Snow On Mars? Oh Well. At Least They Have a Droppo Claus! Hooray!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ClassixFan",
        "review_rating": "8",
        "review_title": "Hooray For Santy Claus!",
        "review_detailed_main": "This film used to occasionally show up on our local PBS station and the first time I ever saw it, I thought it was a joke or some odd skit. I immediately fell in love with this film, just because of it's high camp level and because how can anyone find fault with a cult classic like this? Sure, the acting is stiff and the story is laughable, but isn't a film supposed to entertain? This one definitely delivers with the camp and entertainment, but it does have some good going for it....John Call has to be one of the best looking film Santa's I've ever seen. He chuckles and smiles his way through the film in spite of the goofiness of the film.\n\nBasically, Santa and two Earth children are kidnapped and taken to Mars, when Martian parents begin to worry about the time their children are spending in front of the video monitors and the overwhelming sadness that they seem to be enveloped with. Of course, you have a rotten Martian who does all he can to destroy Santa, the Earth children and the leader of the Martians, a large robot and a Martian-elf-wannabe.\n\nI love the opening theme and the film, I just wish someone could find a better video quality version to release!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "billsyfer",
        "review_rating": "10",
        "review_title": "Love it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "tomfromgoshen",
        "review_rating": "8",
        "review_title": "Classic fun for kids in1964",
        "review_detailed_main": "Yeah yeah yeah so it's not state of the art cinematography, sound, or special effects. It was however great fun for children in 1964, and if you are a student of cult classics they preview shielding before Star Trek hits the air waves a couple of years later. Santa is portrayed as a man of love and kindness. This is a great film for very young children."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Dropo",
        "review_rating": "9",
        "review_title": "If this movie was any better, God Himself would have filmed it!",
        "review_detailed_main": "This movie is about the only thing that does not depress me about the holiday season. Well that Star Wars Christmas album is alright too. Anyway, do yourself a favor and hunt down this movie. Force some loved ones to watch it with you. It will be a holiday memory nobody will soon forget. This movie has martians. It has Santa Claus. It has a kick-ass theme song that will be stuck in your head for all eternity. If you like Christmas movies, or sci-fi, or camp this is the flick for you. There is also a bear and a lobster clawed robot. And a guy that looks like Klinger from MASH but isn't. What more do you want, a depressed Yoda-like martian? The movie has that as well!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "sarahbareno",
        "review_rating": "10",
        "review_title": "One of the best holiday movies out there",
        "review_detailed_main": "I wrote a review a while back, but I don't think it ever posted. Well, let's get straight to the point. My life is divided up into two sections. Before I watched this movie, and after. I have finally reached true bliss. Great acting, and an even better story. Go ahead and watch this movie, because you won't regret it."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mistressdiedra",
        "review_rating": "10",
        "review_title": "Praze the Glory of Mars!",
        "review_detailed_main": "Now I have to be honest, the first time I watch this movie I nearly threw myself out a window or off a cliff to escape the awfulness of it, but a while back my lord and master(the same person, btw) bought it in the bargain bin of a local cd/DVD store 'In Blazing Colour'(a recommendation I feel), and I was forced into seeing it for a second, and then a third time, and it grew on me, which has to say something about its brilliance as I loathe anything that even hints of that whorish Christmas cheer that everyone is always on about. I wont bore you with the details, but this WILL increase your Slack! and slack is the very marrow of life! It is recommended as a 'must see badfilm' by The Church of the Subgenius Praze ''Bob''!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "arandomshiz",
        "review_rating": "10",
        "review_title": "This is it Chief!",
        "review_detailed_main": "Sense the dawn of man, humans have striven to find the answers to the universe and life. I have searched all my life for the answers to the universe. And who new in 81 minutes i would be able to find my life goal and know all answers to all questions asked, being asked, snd will be asked. I no longer need my human form, i have evolved into a 5th dimensional being because of the enlightenment this movie has brought me. I do not recommend watching this if you enjoy the sweet bliss of ignorance to life itself. -"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "henis",
        "review_rating": "10",
        "review_title": "The best Chanukah Movie Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "geod69",
        "review_rating": "10",
        "review_title": "Hysterical!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "dhgerth",
        "review_rating": "10",
        "review_title": "Best Christmas Movie Ever!!!!!!!!",
        "review_detailed_main": "Santa Claus Conquers the Martians (or Santa Claus Defeats the Aliens, as our copy is called) is by far the best Christmas movie ever made. My family and I watch it every Christmas eve, and every year it is an occasion we look forward to with much anticipation. The tale of Kimar's quest to bring the joys of Christmas to Mars is one that will endure throughout the ages, and should be shared by all families. It's just awesome. All other Christmas movies pale in comparison to this classic holiday film."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "discogrove",
        "review_rating": "9",
        "review_title": "Greatest Christmas Story Since Santa With Muscles",
        "review_detailed_main": "Alright amigos, I just have to say that SCCTM is off the heezy fo sheezy. This movie was well worth the $4 I paid for it (on DVD quality no less!). Anyway, I don't wanna give away the story, but there's Santa, Robots, Martians... all the makings of a blockbuster. Lady Momar is pretty fine for 1960's standards. All in all I'd give this film 9 out of 10. That's one star short of pure gold, due to lack of kung fu. Well, peace out amigos."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Elvish Parsley",
        "review_rating": "10",
        "review_title": "Hilarious!",
        "review_detailed_main": "This movie must be watched with the right attitude. If you start out expecting to hate it, then (surprise!) you will. But, I find it extremely entertaining. Of course it's bad! What did you expect with a title like that? But, it falls into the \"so bad it's funny\" catagory. How could anyone not sing along with \"Hurray for Santa Claus\"? If you like this one you should try to find the \"Mexican\" Santa Claus movie. It's great too."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Albatros-3",
        "review_rating": "10",
        "review_title": "A wonderful, magical, fantastical adventure!",
        "review_detailed_main": "This movie is a classic! There is no way it deserves this low rating. It has it all! Character development, plot twists, fantastic musical score, outrageous special effects, and even a very young Pia Zadora! See the lovable Santa Claus! Fear the frightening robot Torg! Laugh at the delightful Dropo! Sing along with songs that will probably stick in your head forever and then some! Oh, but if you're going to see it, be sure to watch it...MST3k-style! Arguably one of the best episodes of the funniest show...ever. Amazon.com has this episode of MST3k (Mystery Science Theater 3000) as a double feature with \"Manos\": The Hands of Fate. This movie will certainly be my continuing Christmas tradition."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ron-114",
        "review_rating": "10",
        "review_title": "someone needs to stick up for this film",
        "review_detailed_main": "i can't believe the negative comments about this film-it is a \"christmas classic\". it was made for fun, to enjoy not to critique! this is my favorite christmas movie of all time and has been since i was a child-and i can't wait to share it with my own children someday."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "What_Its_Like82190",
        "review_rating": "10",
        "review_title": "we're from mars. don't be afraid, we have children just like you on mars.",
        "review_detailed_main": "OK. here is the '63 movie classic found in the 88 cents bin at Wal Mart. saying that, i thought this was one of the best movies ever made. the opening song alone is probably the best piece of music i have heard in my entire life. \"when we hear sleigh bells ring, our hearts go ding-a-ling\". there you go. pure genius. anyway, aliens must kidnap Kris Kringle in a dastardly plot to keep them from having to use sleeping spray on their kids. best story I've heard of since Police Academy 5. i really suggest picking this one up if you got the 88 cents. i mean, its got great special features like English, Standard Full Frame, 81 Minutes, Color, Stereo Sound, and Interactive Menus!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "grochomarx2002-953-297125",
        "review_rating": "9",
        "review_title": "So \"bad\" it's good? But is it THAT bad? A charming time waster.",
        "review_detailed_main": "An ultra low budget, and a script in need of a major re-write, but gosh darn it if this little gem isn't fun for a change of pace.\n\nJust compare this 1960's low budget effort with more modern fare like \"The Cat in the hat, or the Jim Cary version of how the Grinch Stole Christmas, and you will get more honest laughs and have a better time by watching this flick instead of some more modern \"block busters\".\n\nThis is hardly a perfect film, indeed it is far from perfect, and that's what makes it a charming waste of time."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "busguy",
        "review_rating": "8",
        "review_title": "This is my favorite Christmas Movie",
        "review_detailed_main": "I always looked forward to seeing this movie every year. Sure it's cheesy, but it's a kids movie! I tried to talk my parents into letting me build a console like the one on the Martian spaceship so I could put it in my room. Everyone should see this film!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "iammenotyou",
        "review_rating": "10",
        "review_title": "Cinematic Masterpiece",
        "review_detailed_main": "It was a cinematic masterpiece from a whole other world. I have yet to see another movie with such a caliber in aliens and Santa Claus. With the poor little martian needing presents and kidnapping Santa I mean it rocked my world. I love the directors work with symbolism and the director of photography must have been a genius. It may not have the best in make-up and special effects but once you get past that it is a movie for the whole family to enjoy. I have watched this movie over a dozen times and it gets better every time (maybe because I have memorized all the dialog). On a serious note I would recommend this to you and you should go out to your video store and rent this movie, sit down with the kids and enjoy. Bottom 100 is inappropriate for this film."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lordzedd-3",
        "review_rating": "8",
        "review_title": "Surprisenly enjoyable for a goofy concept",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "asalerno10",
        "review_rating": "10",
        "review_title": "ADORABLE LOW BUDGET MOVIE",
        "review_detailed_main": "During the 1970s this movie was broadcast every Christmas and as a kid I watched it every year. The Martians are worried because the children of their planet are sad, the only thing that makes them happy is to tune in to the TV programs on Earth and see the coverage of Christmas, in particular the journalistic notes that they make to Santa Claus in his factory. Toys. To solve the problem, a ship from Mars arrives and kidnaps Santa and two Earthling children who happened to be visiting his house. But an evil Martian sets out to sabotage everything related to Christmas. The movie has a very low budget and it shows, the special effects are simple and crude but despite everything the movie has a certain charm, the best thing is the soundtrack and the main theme HOORAY FOR SANTA CLAUS, for many the movie can be terribly bad, but I still see it with the eyes of when I was a child and it's genius how with so little they made a show that has remained in the memory for several generations."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "pierresfamily",
        "review_rating": "10",
        "review_title": "Kitschy fun!",
        "review_detailed_main": "If you are not set on being a \"Grinch\" and instead just want to enjoy a fun treat for Christmas, this film is for you! Cute and not politicallly preachy like all of today's movies. Very refreshing if you just want a movie that is simply entertaining."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kevin2663",
        "review_rating": "10",
        "review_title": "Love this movie",
        "review_detailed_main": "This movie is terrible. Bad acting, bad script, bad costumes, great fun. I watch this movie every Christmas. I've watched it since I first discovered it on VHS many years ago. My kids watch it with me. Will this movie ever win an award? He'll no. Maybe a Razzie. Watching this movie is low watching old kung Fu movies, its campy, but entertaining. I love this movie and would recommend it to anyone who enjoys great b-movies."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "davidtmanforever",
        "review_rating": "8",
        "review_title": "It's one of those movies that are so bad it's good :D",
        "review_detailed_main": "If you really want to watch something crappy this Christmas, I say pick up a copy of this film. Sure yeah, it sucks. But it's sooooooo terrible, it's funny. The acting is pretty bad, the script is a nightmare, and it's cheesy as ****. It all makes for a good laugh. The story, as much as it is, goes like this: The children on Mars are unhappy. All they do is sit in front of the TV watch the \"earth programs\" (LOL). So, then the parents of the children ask the wise man of Mars why they're unhappy. He says that it's because they don't ever get presents. Then he tells them about Santa Claus. The Martians go to earth, kidnap Santa Claus and two kids, and they want Santa Claus to give the children, gifts. He says he'll try to help as best as he can. I own the \"MST3K\" version which I got as a birthday gift for my 14th birthday and it's still hilarious. But don't get me wrong, I'm sure the original version of the film is just as good. So, I say check this movie out if you're a fan of cheesy movies."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "rubberross",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "This god tier film might be the best thing i have ever seen in my entire life. I can finally die happy knowing that I have seen this amazing movie. I have been truly blessed."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "americayay",
        "review_rating": "10",
        "review_title": "Cult classic...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "210west",
        "review_rating": "9",
        "review_title": "\"People, it's a diner.\"",
        "review_detailed_main": "Those are the wise words that someone wrote on Yelp after reading the snooty reviews of a local Manhattan diner, reviews that weighed the culinary merits of the diner's beef stew, meat loaf, and scrambled eggs as if the place were a five-star gourmet restaurant.\n\nI'd say something similar to people who've made fun of this film, describing it as laughably bad, campy, cheesy, and inept: People, it's a kiddy movie, one made 60 years ago. It's aimed at an audience roughly the age of the children onscreen.\n\nAs such, it's quite charming, serving up innocent fun for little kids the same way low-budget local TV shows once did."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ozofjaws",
        "review_rating": "8",
        "review_title": "This is actually fun if you watch it with a group setting",
        "review_detailed_main": "This film is called one of the worse of all time. Well to an adult yes it could be. The acting and special effect are even below Saturday Morning shows but the film is such a huge hoot if you watch it around Christmas with a bunch of friends.\n\nSanta Claus in this film was kidnapped by Martians along with 2 earth children, Santa is trying to teach and bring the joy of the season to the children and adults of Mars. One martian however is not happy and wants to destroy Santa.\n\nThe film runs 81 minutes. Its paced well. Also the theme song is catchy."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "acfair",
        "review_rating": "10",
        "review_title": "Eggnog, family/friends and this movie",
        "review_detailed_main": "No work of art can ever touch this masterwork, a film that stays true to its cause: Martians are people too(even if they have helmets with antennae as part of their genetic makeup)\n\nYou get the original Jar jar blinks as an elf and santa and martians use mind control and try to murder each other.........\n\nStop everything and watch this one!"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "letterl",
        "review_rating": "8",
        "review_title": "Not really that bad!",
        "review_detailed_main": "I first viewed Santa Claus Conquers the Martians when I was a kid and it's one of my favorite Christmas movies -- probably my favorite. Yes, it's cheaply made and the plot is silly but it's harmless fun. It's something I look forward to seeing every year."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "rhoechst-93333",
        "review_rating": "8",
        "review_title": "Santa Claus Conquers the Martians",
        "review_detailed_main": "It's dumb, yet enjoyable enough to watch again, most likely with friends for a laugh."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "lilpissywinkle69",
        "review_rating": "10",
        "review_title": "Emotionally Powerful Anime Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mot1mot",
        "review_rating": "9",
        "review_title": "A MUST SEE (in an altered state)",
        "review_detailed_main": "So bad it's good! However, view only in an altered, beer enriched state of mind. Realize that this movie is from a kinder, gentler time. If the entire room does not sing along with \"Hurray for Santy Claus\", they are not drunk enough."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "obscuridad",
        "review_rating": "10",
        "review_title": "A classic...",
        "review_detailed_main": "This is one of those rare wonderful movies that has a special quality: It is SO BAD, that in the end it turns out to be good.\n\nIt is goofy, its special effects aren't that special, but it has... something... Do not ask me what it has, you can either love or hate this movie, look at it in disgust or laugh at its 'child-like-manners'.\n\nAt first I thought it was going to be so terrible I couldn't see it again, but who can not have a second glimpse at that bad green makeup falling apart?"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Braddx",
        "review_rating": "10",
        "review_title": "Brilliant Effort All Around",
        "review_detailed_main": "This masterpiece has been called one of the worst movies ever made. Such is the level of taste these days. The reviewers here fell for this canard and joined the herd, completely ignoring the fact that Santa Claus is a giant among the 4-year-old crowd.\n\nEvery 4-year-old I have ever known told me that this film left an imprint on their psyche that has lasted well into their grown-up-hood. I can vouch for the truth in that because I myself was once a 4-year-old. I didn't see it then because I was sent to bed that night for what I still consider a minor infraction.\n\nThe writing, the production, the sets, etc., were all created and designed BY 4-year-olds FOR 4-year-olds. Such a notion borders on genius, and has never been duplicated before or since (although it is unclear how it could have been DUPLICATED BEFORE it was first plicated).\n\nInexplicably snubbed by the Academy, it remains deeply embedded in the hearts of the Santa Claus faithful."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "RiffRaffMcKinley",
        "review_rating": "8",
        "review_title": "So Bad It's Good, But It's Pretty Bad at Being Bad, So It's Good That It's Bad",
        "review_detailed_main": "You heard me.\n\nAnyway, \"Santa Claus Conquers the Martians\" as a serious movie is almost as big a joke as \"Somewhere in Time.\" Fortunately, it looks like camp was the goal, so camp it shall be! As a B-movie, \"Santa\" rocks the socks off of every sock-wearing rocker in the known galaxy. Every last detail right down to the film's somewhat faded look makes this film feel like a terrific surviving ode to a genre that has produced so much garbage (\"Reefer Madness\") and also some sweet sugary goodness (\"The Rocky Horror Picture Show\").\n\nDefinitely, though, it is a love-or-hate kind of movie, and the answer to that question all depends on the outlook you take. If you think this was meant to be an Oscar darling, go ahead and hate it. Just leave it to those of us who can appreciate it. And another thing-- we have *got* to raise this past 2.6/10. Such a low rating should be reserved for the absolutely unnecessary (can we say, \"Pirates: At World's End\"?)"
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "pirate1_power",
        "review_rating": "8",
        "review_title": "What to explore: How Santa continues to conquer the Martians (collectively)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "DizzyDitz",
        "review_rating": "",
        "review_title": "Lives down to its low expectations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "gekster",
        "review_rating": "10",
        "review_title": "Plan 9 from Outer Space eat your heart out.",
        "review_detailed_main": "This movie truly has it all. Aliens, action, morals, and it's all wrapped up in a nice little C-rated bundle. Plan 9 From Outer Space WISHES it could be this bad a movie. But despite its supremely horrible storyline, acting, custumes (lol) and sets, I hold a dear place for it in my heart, for it teaches us that Santa himself is even more naive than the children who believe in him..."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Ta'Lon",
        "review_rating": "",
        "review_title": "Hooray for Sanny Claus!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "buddybradley-22665",
        "review_rating": "10",
        "review_title": "So Bad It's Great",
        "review_detailed_main": "It's apparent that much effort was put onto this movie by people who didn't know how to do it. It has everything you need to be bad but not boring. A believable Santa. A boy from the 1950s. Pia Zadora. An original song that she sings and at the end the words are on the screen so you can sing along. Martians with bad green makeup. A polar bear that's obviously a man crawling on his knees. Numerous typos in the credits. And much more. You will laugh all the way through, for days later and every Christmas for the rest of your life. You'll want to get someone else to watch this movie every year. You have to see it to believe it."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Kai-18",
        "review_rating": "",
        "review_title": "Dropo's Christmas cheese.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "plan99",
        "review_rating": "10",
        "review_title": "The most entertaining Sci-fi film ever.",
        "review_detailed_main": "Eat your hearts out Mr Spielberg and Mr Lucas as this is how you make an entertaining Sci-Fi film. Even more fun than Plan 9 From Outer Space and that takes some doing and it's also better/worse than that classic of bad film making. In glorious saturated high contrast colour with the dark skin tone of the Martians changing very frequently possibly due to some of it rubbing off during filming and them not bothering to touch it up. The Martian's helmets seemed to be crash helmets with a ski mask glued onto the front and some tubing attached. The mystery regarding the presence or not of water on Mars was solved due to a water ski being present in a Martin store room, NASA please note. It deserves an 11 but 10 is the maximum allowed."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mpopham",
        "review_rating": "",
        "review_title": "Lousy movie -- or minor masterpiece?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "A Crazy Christmas Movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kmw1962",
        "review_rating": "",
        "review_title": "One of the three worst films ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mincesticker_l",
        "review_rating": "10",
        "review_title": "It may be more clever than you think you are, plus, it's fun.",
        "review_detailed_main": "It's Turkey Day, and the MST3k marathon neglected to make this their grand finale (or, mibbie, their coup de grâce). I have always been a little disappointed Santa Clause Conquered the Martians made it onto the Satellite of Love; to me SCCTM is every bit the cult classic MST3k itself is. The sets, the robots, the acting, the alien costumes, are all on par with contemporaneous Sci Fi classics like Star Trek TOS - an aesthetic MST3k itself pays homage to. And like those shows, Santa Clause Conquers the Martians... is clever.\n\nI have fond memories of watching this movie as a child, it was one of a handful my grandparents kept on VHS as I grew up in the 80s. I played it now for my soon to be 5 year old. He was delighted, and made me rewind the final 'fight' scene three times - once to call his older 'too cool for movies' cousins into the room to watch with him. (They all had a riot.)\n\nSanta Clause Conquers the Martians is unfairly maligned. It's a thrilling expose of 1960s society's hopes and anxieties for the space and arms race. UFOs that can't be tracked, 'nuclear curtains' that will disintegrate you on contact, and a burgeoning US space program that promises to take it all on. And then there is Santa. It's a rebuke of excessive automation and a loss of innocence, in favor of a simpler message of good humor and simple pleasures. In the end, Santa disrupts the entire sociopolitical structure of Mars and cements peace between our planets with a simple message of cheer and good will. In one scene, he unites our two species and rescues the Martian children from the depths of despair with nothing more than an infectious belly laugh. Frankly, it's magical.\n\nRespectfully; diminishing this movie as cheese and camp misses the mark."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "NosferatusCoffin",
        "review_rating": "",
        "review_title": "Santa Claus Conquers our brains!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "61toyland",
        "review_rating": "10",
        "review_title": "I love it! Wonderful and magical!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "oscar-35",
        "review_rating": "",
        "review_title": "Good kiddie film only",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Magracy",
        "review_rating": "8",
        "review_title": "My childhood and yoor kids will love it",
        "review_detailed_main": "This is a great b movie. Sure it's cheesy and production value is horrible and acting is bad, but that all being said this is a great kids film with fun values and a theme some that will stick in your head for ever. 10 year old Pia Zadora is great can see the talent even at a young age. People dog cult movies as bad, however if you give these low production movies a chance so are actully amazing. The fact that is overly cheap and cheesy makes these film a brilliant example of the perfect cult film. When I was a child this film would show on local tv Sunday afternoon movie at Xmas time. I longed for this movie very year. It's wholesome, no nudity, no bad words, just a fun sci-fi romp with martians and Santa Claus. Watch the original cut or if you like watch the mystery science theater take on this classic."
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "mrb1980",
        "review_rating": "",
        "review_title": "Good for Laughs, with Catchy Theme Song",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "rdambroso",
        "review_rating": "",
        "review_title": "A Masterpiece of ineptness..like anchovy and peanut butter cookies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "badger-37",
        "review_rating": "",
        "review_title": "Hey, Folks it's Christmas !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "kevinone",
        "review_rating": "",
        "review_title": "Oh my god is this bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "A lump of . . . coal.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "ilithmar",
        "review_rating": "",
        "review_title": "WONDERFUL",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "jixor",
        "review_rating": "",
        "review_title": "I was shocked, and scared.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Angel_and_Demon",
        "review_rating": "",
        "review_title": "Can Santa Outdo Aliens and Pia Zadora???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "dgalloway",
        "review_rating": "",
        "review_title": "One of the worst movies ever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "wheelsjm",
        "review_rating": "",
        "review_title": "Quintessential Camp",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "Very boring but there are some redeeming qualities",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Chibi Riza",
        "review_rating": "",
        "review_title": "This is like soaking in scolding hot water!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "Sargebri",
        "review_rating": "",
        "review_title": "Pia Zadora's Debut!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0058548",
        "movie_name": "Santa Claus Conquers the Martians",
        "movie_rating": "2.7",
        "review_username": "shark-19",
        "review_rating": "",
        "review_title": "Not even \"good bad\"",
        "review_detailed_main": ""
    }
]