[
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Sleepin_Dragon",
        "review_rating": "3",
        "review_title": "What were they thinking???",
        "review_detailed_main": "I'm not sure if Jim Sturgess was encouraged to play the insanely over the top cockney geezer, or it's simply how he did it\n\nI give it three stars, simply because the opening was brilliant, two minutes of stylish, elegant, engaging cinematography, those sequences were the best part of the film. Some scenes looked nice. However...\n\nAs soon as Keith arrives, the film becomes unwatchable. The plot vanishes, the story telling is nothing short of a fiasco, it really does become a self absorbed mess, I applaud you if you see it all the way through.\n\nTheo James by contrast is very good, he's a fine actor, but the damage had been done beyond belief by the time he arrives.\n\nDidn't enjoy it, 3/10."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "a mess",
        "review_detailed_main": "Struggling writer Samson Young (Billy Bob Thornton), sleazy darts player Keith Talent (Jim Sturgess), and well dressed man Guy Clinch (Theo James) are in a dive bar when Nicola Six (Amber Heard) walks in dressed in sexy mourning. The clairvoyant femme fatale can see the deaths of people. In that moment, she realizes that she has seen her eventual murderer. She lives above Samson and is a character in the story he's writing.\n\nIt's a disjointed mess. I like a few of the surreal touches but dislike a whole lot more other ones. The Enola Gay makes Guy look stupid or is the writing stupid? Or is the writer's expectations of the audience is too low? At least, the story could be about Bockscar and Fat Man. It just makes the movie stupid overall. Next, Samson Young is an unreliable narrator. He's a sleepy unreliable creator. It makes everything in the movie unreliable. In addition, Amber Heard is nothing but sex. She's an empty character. There is no motivation. She is a figment of Samson's imagination. She is a surreal fake creation of the male libido. She's a sex robot bending to each male's fantasy. Finally, there is Jim Sturgess contorting his face unnaturally beyond camp. It's completely ridiculous. With the darts playing, it reminds me of The Big Lebowski but in a bad way. There is no loveable character. There is no fun. There is no enjoyable quirkiness. This is a mess waiting for the reveal which I don't care about with characters that are not compelling."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "stanadrian",
        "review_rating": "4",
        "review_title": "Simply put, awful",
        "review_detailed_main": "A pathetic attempt of a deep, interesting and artsy movie. Just awful, and I usually find some good things in bad movies. Do yourself a big favour and avoid this utter failure."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "kikiclogwyni",
        "review_rating": "1",
        "review_title": "Awful. Just awful",
        "review_detailed_main": "One of the worst movies I've ever watched. Amber Heard plays a woman who has foreseen her own murder and spends the rest of the film trying to work out who her killer will be, apparently by ... shall we say \"sleeping with\" .... all the possible suspects.\n\nI am writing this while half way through it and I already want to kill her myself. She sashays and vamps around valiantly, but cannot pull off the film noir vibe. Heaven only knows what Jim Sturgess thought he was doing. I would like to say he chews up the scenery, but I doubt his crack-head yellowed teeth would be up to the job. Billy Bob Thornton is, well, Billy Bob Thornton, only sleepier than usual. The only high spots are the few appearances by Johnny Depp as a cheerfully villainous Cockney gangster, but he is uncredited in the final product. One can only presume he did not want to be associated with this abomination.\n\nPretentious, badly acted, boring tosh. Total waste of a good book and almost two hours of my life! Awful. Absolutely awful."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Someone's perverted sexual fantasy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "arfdawg-1",
        "review_rating": "1",
        "review_title": "Wow",
        "review_detailed_main": "Hands down, this HAS to be one of the WORST movies ever made.\n\nIt's a mess.\n\nNot a film noir. It's a film No"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "catblack-692-314355",
        "review_rating": "2",
        "review_title": "Quite Terrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jnrb71",
        "review_rating": "1",
        "review_title": "Bizarre nonsense",
        "review_detailed_main": "The ingredients: (1) A very bored chain smoking Billy Bob Thornton without yellow fingers. (2) The femme fatale who is consumed by all things sexual like a female cat on heat. She doesn't work, prepare food or go shopping but instead prances around all day in her underwear in her flat in case male visitors arrive. She has also been living in the neighbourhood for a year but the boys never noticed before. How come? (3) The posh gentlemen who prefers to hang around in sleazy underground bars all by himself where he has no friends and doesn't fit in. (4) The dart player scumbag who squints his eyes and pulls faces every time he speaks as if someone emptied a bottle of lemon juice in his eyes. (5) The kid in a dinosaur suit who behaves like a total gremlin and has to be stopped physically or he will eat the furniture. Where can it go to from here? Only downwards, and we didn't even get to see her boobs."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "mikehavekin",
        "review_rating": "2",
        "review_title": "Annoying.",
        "review_detailed_main": "I'm going to be brief: Jim Sturgess overacts so much it's embarrassing, my neighbours three dogs bark from the minute they leave to when they get back, Jim is way more irritating than them. It's like amateur dramatics night.\n\nGive this one a wide berth."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "lalalohan",
        "review_rating": "7",
        "review_title": "SEE THE DIRECTOR'S CUT",
        "review_detailed_main": "Two versions of London Fields are currently playing in theatres. The film most theatres are showing is the producer's cut, but select theatres are showing the director's cut instead.\n\nIt's amazing how two different edits of the same film can make such different movies. Yesterday I saw the producer's cut of London Fields and today I saw the director's cut, and wow THE DIRECTOR'S CUT IS SO MUCH BETTER! Why isn't this one the main cut? Here the bad CGI'ed skies are substituted for tension, mystery, emotion, and a plot that's easier (plus more interesting) to follow; as well as a whole new score and different takes that bring out better performances from the actors. Every emotional beat is so much more powerful, which makes the mystery of who will kill Nicola Six that much more suspenseful and engaging.\n\nTHIS is the version of the film that should be playing everywhere. The producer's cut honestly shouldn't even exist; it just doesn't add anything to the film. It's no wonder the director sued the producers over this. According to him the \"main\" cut released is a cut he hasn't been involved in for over four years.\n\nIf you had any intrest in seeing London Fields I would 100% recommend seeing the director's cut, and if you liked the producer's cut then you'll love this one even more! It's still not a perfect film, but THIS one is more entertaining, engaging, suspensful, and overall just a better film. I really hope both cuts are released on the DVD to compare them even better; I find the whole thing so interesting."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "pink_floydilia",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "This has got to be the dumbest movie I've ever watched. And I've never seen anyone overact more than Jim Sturgess has in their movie. Absolutely ridiculous. Even the rest of the cast couldn't pick this disaster up off the floor. Nothing makes sense, transitions are messy, acting is shocking, storyline is ridiculous. No redeeming qualities at all."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "pconnor1",
        "review_rating": "9",
        "review_title": "See the Director's cut!",
        "review_detailed_main": "See the Director's cut! I've seen both versions, and the Director's cut is the one that gets this rating. The director's cut is so much more layered and well crafted. The music choices, the color, the differences in how the characters are introduced, and how we are made to care for the characters, and how the story unfolds is just so much better. You can feel the attention, care, and skill involved in the director's version.\n\nIt was truly interesting to see the difference. The whole experience is just better."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "rjfromtoronto",
        "review_rating": "6",
        "review_title": "Boy oh boy",
        "review_detailed_main": "Opening scene made it look like it was going to be a neo noir, femme fatale cinema lovers long awaited dream, the cast should have been good enough, but it failed, much like The Terminal with Margot Robbie, though that did have a nice twist ending to make it at least palatable. This dog of a film? Waste of $5 in the Wal-Mart discount bin, it was weird and you could tell a book was written and only those who read it knew what the F was going on, the pills and calendar, throwing out her stuff, the holes in the ceiling, the dinosaur kid and that simp married guy, why did anyone want her dead, being jealous and played? Pfft, at least she looked good in that white dress and other scenes, that was all it was good for, seeing a sexy looking lady doing wooden acting looking so good doing nothing. Otherwise WaTch Atomic Blonde, Ava, Miss Bala, Salt or Anna or Hanna if you want to see strong female well acted leads with decent plots and themes. Or just watch a real Noir. White Heat, The Killing, The Killers, Criss Cross, The Postman Always Rings Twice, Double Indemnity, The Blue Dahlia, The Glass Key among others, there's nothing like the old school stuff and the beautiful starlets of yesterday."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "servilan42-847-181755",
        "review_rating": "1",
        "review_title": "I wish you could give minus stars as a rating",
        "review_detailed_main": "This movie is a real stinker and that's the best thing I can say about it. If Jim Stugess' does not win an award for most dreadful, horrible performance in a movie for London Fields, there is no God."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Jxsbee",
        "review_rating": "1",
        "review_title": "You couldn't pay me enough to watch this again",
        "review_detailed_main": "How this movie ever got made is beyond me. Absolutely terrible. Amber Heard couldn't act to save her life and had me cringing throughout. The storytelling is also Labourious. Best part of this movie is the whole ten seconds Johnny Depp has a scene and even he can't save this horror."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "tigerfish50",
        "review_rating": "1",
        "review_title": "London Wasteland",
        "review_detailed_main": "'London Fields' begins with two fiction writers embarking on an apartment swap. Struggling scribbler Samson Young vacates his squalid Hell's Kitchen den to stay at the opulent Notting Hill residence of successful Mark Asprey, who departs for New York City. The duo's names give the game away - the swap signifies a personality split rather than any geographical re-location. The symbolism of Young's moniker and his home base are fairly obvious while Asprey's initials echo those of London Fields' novelist Martin Amis.\n\nThe film follows Young as he slots seamlessly into Asprey's social milieu. He focuses on documenting the anticipated murder of his upstairs neighbor, a movie star called Nicki Six, who has predicted her own death at the hands of an unknown killer. The prime suspects for this future homicide are a darts player and a city wheeler-dealer - soon to be joined by Young himself. Nicki has affairs with all three, goading them to kill her through jealousy, so that her prediction will prove correct.\n\nThis extravagant plot might be manufactured by Asprey's fevered imagination, but unfortunately the film itself also looks like the product of a mind in disarray. The movie shows the potential dangers of getting a music video director to film the adaptation of a fairly sophisticated narrative - the end-product might be be garish visuals at the expense of characters' personalities and their environment. Compounding the catastrophe, the actors deliver theatrical performances which destroy any chance of taking the proceedings seriously. By the time the climax arrives with its predictable twist, it's hard to believe anybody still cares about the fate of these cornball caricatures."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "JoBloTheMovieCritic",
        "review_rating": "1",
        "review_title": "London Fields",
        "review_detailed_main": "1/10 - absolutely terrible - for some reason I didn't believe all the horrid reviews, but they were speaking the absolute truth"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "onestopconcepts",
        "review_rating": "1",
        "review_title": "Non sensical",
        "review_detailed_main": "This movie made no sense. Transitions were non existent, the character development was poor except for the main character who only seemed to make her appearance known by sleeping with all the male actors for no apparent reason. This was waste of money."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Tommy-Iceman",
        "review_rating": "",
        "review_title": "Unintentionally comical! You need to be high to get through this...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "alexisruttley",
        "review_rating": "1",
        "review_title": "Horrible acting",
        "review_detailed_main": "How is Amber Heard an actress her acting is horrendous."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "CANpatbuck3664",
        "review_rating": "6",
        "review_title": "An Unintentionally Funny Catastrophe",
        "review_detailed_main": "I'm not going to write much in the defence of London Fields (even though I gave it a 6/10, you'll understand why in the next paragraph) but when I review bad movies, I always start with the positives. I was intrigued by London Fields for around the first 10 minutes. The dialogue by our narrator Samson Young (Billy Bob Thorton) is heavy handed but they know how to setup a mystery. Its obvious that the story will have a different kind of slant to it (both by the beginning flash-forward and the bizarre notes about the current global climate within the story) and it caught my attention. The movie very quickly went off the rails with the introduction of Keith Talent (Jim Sturgess) and Guy Clinch (Theo James) but I have to admit, I was interested for a short period of time. The other note I'll make is that Amber Heard was appropriately cast as Nicola Six and she was trying so hard in this. She couldn't save this train wreck of a movie and I felt bad for her because of how desperate the team behind the camera are to remind you of how hot she is in every single moment she is on screen (I appreciated how beautiful she is but a lot of her steamy scenes border on porn and I doubt she consented to that). I wouldn't define this as an award-worthy performance but when the rest of the cast is so out of whack, she's at least playing in the appropriate area and she fits the part.\n\nSome movies are made for the uninitiated and some are made for the fans. The plot in London Fields must require you to be familiar with the source material because it is so scatterbrained, I don't know if I could have wrapped my mind around it with a second viewing. London is in crisis, people have fled the city, are we offered a detailed explanation why? Nope, just go along with it. Our narrator Samson (a terminally ill writer) is dying of an unspecified illness but he's resigned and almost nonchalant about it. Why is he dying? Why is he okay with it? Never mind that. Why is he interacting with all the fictional characters in his new book? Why is he seen by some and ignored by others? How is Nicola able to see the future? If she's aware of what will happen, why doesn't she try to protect herself? There were answers offered to some of these questions but none were satisfying or made much sense. Compounding on this is the ridiculous dialogue which is okay at best and at worst just awful. I got plenty of laughs from this movie but I don't think any of them were on purpose.\n\nThe supporting cast is either at one end of the spectrum or the other. They're either underplaying it so badly that you can imagine them asking for their lines after every take or they're chewing the scenery with such an over-the-top bravado that it left me howling. On the under-performing side, we have Billy Bob Thorton, Theo James, Jaimie Alexander and Cara Delevigne (who is only in the movie for about 5-10 minutes). Thorton is a good actor when he's committed and while I'm almost certain he was directed to be this way, boredom radiates off his performance. He's sleepwalking through this and I don't think there was much he could do. Theo isn't a terrible actor but he's normally a little bland and this is definitely more of that. On the other side, we have Jim Sturgess, Jason Isaacs and Johnny Depp who are all swinging for the fences. Sturgess is overdoing his character in an epic sense here, I was laughing at him every time he was on screen. Between how ridiculously sleazy his character looks to his mind-blowing delivery, he was hitting Sean Penn from Gangster Squad levels in scenery chewing. We also have Depp in a pretty small role, he's at least fun in his small bits but its a lot like his shtick in Mortdecai where its too cartoony to even be in the same ballpark as reality. We also have Isaacs in voice over, he's so sly and scummy in this that his voice is the embodiment of the cat who ate the canary. There's only 1 other movie that I can think of that features such a wide range of laughable stuff from the cast (I'll be talking about it in the closing paragraph to this review).\n\nI started out laughing, then I slipped into being dumbfounded and by the end, I was a mix of being in awe and snickering under my breath. The twists and character motivations in this movie are so hard to determine even though if you diagrammed the plot, it would be so simple. Through the perspective of Samson, there was a lot of potential to really play with the style the movie was being filmed with (e.g. the movie Limitless where we see the effects of the drug) with Samson drifting in an out of sanity or \"the real world.\" But while the movie isn't without any style, there's very little here that's going to be memorable or that's going to catch your eye. I know the budget was modest but if you don't have the material to carry the movie, do something else that's going to elevate it.\n\nThe behind-the-scenes notes about London Fields paint an accurate picture of how much of a misfire this is. But I couldn't turn away from the screen or even stop giggling at the gigantic mess London Fields is. I think this would make a great so-bonkers-its-good double feature with the 2018 release Terminal. Both feature a stylized attempt at noir with some Guy Ritchie style sprinkled in and they both miss the boat completely. Both feature a gorgeous and talented lead actress who are trying their best but the movie drags them down like anchor tied around their ankles. Both feature a supporting cast that is so all-over-the-place that you can't pin them down as disinterested or way too committed. Lastly, they also both have an ending twist that attempts to shock the viewer and doesn't quite get there (admittedly though Terminal wins this category hands down). Terminal is the better movie but London Heights made me laugh more. I'm sorry that Heard and Depp were fighting constantly while this was going on but London Fields falls into the so-bad-its-entertaining category for me. If I were a real critic and I had to grade this seriously, this is a 3/10 but I'm bumping it up to a 6/10 for the entertainment value I got out of it."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "politicidal",
        "review_rating": "2",
        "review_title": "This is the Snowman of 2018. This is the worst movie of 2018.",
        "review_detailed_main": "This movie is so bizarrely constructed and the editing is so bad, one can easily call it The Snowman of 2018.\n\nWhile that failed venture was your standard police procedural made into a woeful example of outsider art through bad luck, this film aims for some near incomprehensible labyrinthine parody of every postmodern thriller made since Pulp Fiction or The Usual Suspects.\n\nThe closest that can be described to being a serviceable plot is that a slinky sexy woman named Nicola Six (no seriously that's her name) is blorn with the uncanny gift of premonition. And she guesses her murderer upon entering a sleazy London pub and being courted by a series of strange or suspicious characters. In between that, there is a lot of overwrought narration by a bored Billy Bob Thornton; a darts competition; and panoramic shots of what seem to be the Apocalypse.\n\nIf it had an inkling of self-awareness, it may be a spectacular example of stealth trolling pretentious film snobs and industry insiders everywhere. But given that this film stars Amber Heard (the poor man's Nicole Kidman) and rejected leading men like Jim Sturgess and Theo James, that seems unlikely.\n\nAmber Heard is a beautiful sexy looking woman. But she does not yet have the screen presence to convey the aura of mystery or raw sensuality that seasoned pros like Sharon Stone or Angelina Jolie or Diane Lane could have done in their sleep. Theo James is slumming in a post-Divergent paycheck role that leaves nothing worth remembering. The worst offender of the main cast is Jim Sturgess as a gross looking barfly with a preposterous cockney accent and rotting teeth. This guy's performance is so ridiculously over the top that Nicolas Cage would be chastising Sturgess to tone it down.\n\nThe sole bright spot among the main cast is surprisingly enough the most controversial, Johnny Depp. No, seriously, Johnny Depp is in this movie and he's actually pretty good. It also helps that Amber Heard gets naked alot in this so at least there's that.\n\nBut unless you fancy yourself as one of those pretentious hipster schlock enthusiasts (such as myself ;).) I cannot recommend viewers to seriously consider watching this."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "cgibrand",
        "review_rating": "9",
        "review_title": "DIRECTOR'S CUT IS A GORGEOUS, INTELLIGENT TREAT!",
        "review_detailed_main": "Make sure you see the Director's Cut!!! It seems there is only one imdb page for these two, WILDLY DIFFERENT, movies. At least for now.\n\nI don't know how an adaptation of this story could have been done better. Somehow an American director managed to portray London in a very specific era through this unusual, slightly weird but so captivating story, perfectly. The Director's cut is sexy, thought-provoking, surprising, beautifully filmed and full of moments that will pop up in your head in the best way for the next few days. I don't think Amber Heard has ever been captured this beautifully, and this will probably be her best movie, ever. The rest of the cast, especially BBT and Theo James, is great too.\n\nLocation, details, choices of images and where to push makes this more than a movie, it's an excellent piece of art for this time. Finally, the MUSIC is unbelievable. I must get my hands on this album! So beautiful. And if I understand everything correctly, the music (or most of it?) is exclusive to the Director's cut! That's incredible!!!!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "christianstephens",
        "review_rating": "6",
        "review_title": "Amber Heards best",
        "review_detailed_main": "Amber Heard is talented , great cast, solid directing and decent writing. Long run time and a lot of dialogue but such interesting characters and Billy Bob is great."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "random-70778",
        "review_rating": "",
        "review_title": "Lead Actress cannot act",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "dipsyhasgone",
        "review_rating": "1",
        "review_title": "Who is that the actress?",
        "review_detailed_main": "She just bad, idk kinda bringing down the entire movie"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "larrys3",
        "review_rating": "1",
        "review_title": "Disastrous",
        "review_detailed_main": "An extremely bizarre, dark, and nonsensical noir. Unless you are fixated to see the sultry and erotic Amber Heard vamping it up or an unrecognizable Jim Sturgess in a completely over-the-top portrayal I can see no reason to view this flick. Is it any wonder Johnny Depp, in a peripheral role, wanted to remain uncredited? I would say stay as far away as humanly possible and avoid this disaster of a movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jacktiggermilner",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "I managed about 10 minutes and I'm wondering if there is a worse actor in the industry than Jim Sturgess. How does he continue to get work? Not even lovely Theo James can persuade me to carry on!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "ssto",
        "review_rating": "7",
        "review_title": "artistic",
        "review_detailed_main": "Very noir-ish with excellent cast.\n\nBilly Bob Thornton is essentialy the same as always, he's awesome playing such characters. Somehow throughout the movie, he kept reminding me of Jeremy Irons' character in \"Stealing beauty\".\n\nAmber Heard is seductive and innocent, and on the brink of proving she's a good actress; maybe a proper role will come soon for her.\n\nFantastic performance by Jim Sturgess, he's the king of every episode he's present in - really, really good!\n\nSurprised to see Johnny Depp in the same movie as AH, and to the end didn't think I'll see them in the same scene, but - then I read in the comments that the movie was shot years before this year's release, go figure... JD is his usual weird persona that he's so good at playing.\n\nOverall, a high quality movie, with style, beautiful shots and artistic note. I had fun watching it, and recommend it\n\n7/10"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "micauden",
        "review_rating": "10",
        "review_title": "this was the funniest movie ever",
        "review_detailed_main": "Hey guys, London Fields made me and my boyfriend laugh the entire time. i knew it was serious but he was convinced it was satirical and filled with exaggerated cliches. every time something cheesy happened we burst out in laughter. if you take this movie seriously it sucks terribly but if you pretend the whole thing is a joke it gets 10 stars!!! highly recommend being high when watching it"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "RosanaBotafogo",
        "review_rating": "7",
        "review_title": "Regular and boring...",
        "review_detailed_main": "It seems that a vampire was missing, all the while waiting for his appearance, the dark, sensual, mysterious and glamorous atmosphere led me to induction... But the film, intensely dragged, the novelist's narration makes it slower, melancholic, but the drama it doesn't justify so many dramatic characters and little suffering, it sounds artificial... Films with Deep, once loved, now disgust me... Regular and boring..."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "e-m-lian",
        "review_rating": "1",
        "review_title": "I wanted to like it",
        "review_detailed_main": "I wanted to like this movie but the lead actress cannot act, she is beautiful yes but has no acting skills, a shame, the story has potential but please do better with the cast."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "grantss",
        "review_rating": "5",
        "review_title": "Stylish but unfocussed",
        "review_detailed_main": "An American writer arrives in London where he meets Nicola Six, a beautiful woman who soon becomes his muse. She is playing a dangerous game, dating a small-time (married) gangster and a wealthy businessman in an effort to con them both. A clairvoyant, she has premonitions of her own death, at the hands of one of the three men she is involved with.\n\nThis film had heaps of potential. The plot is initially very intriguing and the atmosphere is dark and stylish, sort of neo noirish. With the style and the English gangster setting it initially feels like a cross between a Guy Ritchie film and a Frank Miller graphic novel.\n\nHowever, the wheels come off after a while. The plot becomes random and unfocussed. The writer and director add layers of complexity that seem just there for complexity sake as they don't add anything to the movie. Jim Sturgess's performance as Keith Talent is painful to watch: massively over-acted and forced.\n\nThere's enough intrigue to keep you watching but sadly it's all in vain as things don't get much clearer by the end.\n\nUltimately, quite disappointing."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "smalgreenpeacoat",
        "review_rating": "1",
        "review_title": "I gave it the benefit of the doubt....",
        "review_detailed_main": "TBH.... I am a fan of many in this film, but I mean, come TF ON!!!!\n\nLBH.... This was a full on a Misogynistic film.\n\nCatering to the male agenda of S#%, violence, and male dominance. Let's not get it twisted..."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "robroyman-28615",
        "review_rating": "1",
        "review_title": "Cheesy Garbage",
        "review_detailed_main": "One of the worst movies made, and surprising since it featured a pretty good cast.\n\nSeems to drag on forever, making you wish someone would kill Nicola Six just so you can get to the credits quicker! Not worth watching!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "stevendbeard",
        "review_rating": "3",
        "review_title": "Messed Up Weird Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "andrejurado-1",
        "review_rating": "7",
        "review_title": "Misunderstood, insane and usual film noir!",
        "review_detailed_main": "I don't understand all the hate... I think the movie was just fine. And misunderstood! It's about a writer, a dame, death, money and cheating. Pretty much like most film noirs. The problem wasn't the what, but the how. And people didn't seem to have liked it. Oh, well. I did. Cheer up, would ya, love?!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "stace-38446",
        "review_rating": "1",
        "review_title": "Worst acting",
        "review_detailed_main": "The nicola actress is awful. Difficult to watch because of her terrible acting"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Greg-230",
        "review_rating": "10",
        "review_title": "DON'T LISTEN TO THE CRITICS - THIS FILM WILL BE A CULT CLASSIC",
        "review_detailed_main": "While this is not an Oscar-worthy film, it really is INCREDIBLY fun and entertaining to watch. I went to see it expecting to have a good time, and thats what I received. Its a fun film that I would highly recommend to anyone who wants to see a sexy, film-noir classic. Don't listen to the negative reviews, this movie is really enjoyable and I will be seeing it again, and probably buying it when it comes out.\n\nThis is a film that is absolutely stunning visually. I don't believe it should be getting all these bad reviews, I thought it was amazing! As did everyone else in my theatre. The social media reviews are off the charts and on Rotten Tomatoes it's going to go over 90%. Also there are some really good plot twists that will catch you by surprise. The writing, acting, and editing were all great. Overall its a really cool movie that will put you in a good mood. One of my top Must-Sees for 2018."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "nikree",
        "review_rating": "6",
        "review_title": "Don't kno how to rate it",
        "review_detailed_main": "TRUST THE REVIEWS.\n\nDefinitely the episteme of Male Gaze.\n\nYes I didn't see the whole movie, cuz I couldn't get past 30 minutes.\n\nVery loose movie with plots are passed in minutes, but not missing an opportunity of sexualizing the protagonist."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jtindahouse",
        "review_rating": "3",
        "review_title": "One of the worst films I've ever seen",
        "review_detailed_main": "I can't remember the last time I saw a film this disproportionate in terms of the quality of the cast and the poor quality of the film. Make no mistake, 'London Fields' has an amazing cast. Sure Amber Heard in the lead role isn't much of an actress (although she somehow manages to maintain a fair bit of star-power) but outside of her there are great actors everywhere. Even Johnny Depp has a decent amount of screen time. Sadly though these actors aren't even close to being able to save what is one of the worst films I've ever seen.\n\nThe film tries to be a mystery but there are a few problems with that. One is that we the audience simply don't care by the time the conclusion finally rolls around. We have been bored out of our mind for 90 minutes and we simply want the film to end. Secondly, all the characters are basically the exact same person. Which character did the deed makes absolutely no difference to us in any way. Whether is it a, b, c or d through z doesn't alter the film in our eyes one bit.\n\nThen the film tries to impress us with its arty narration. It is trying so hard to be 'Fight Club' by having memorable quotes left, right and centre, but I can assure you none of them land. Instead the narration is just annoying and weird. The film has some of the most bizarrely shot darts scenes as well. We are never told what is actually happening and apparently professional darts players are capable of missing the board entirely? Who knew? 'London Fields' needs to be avoided at all costs. It is an abomination."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "ap290761",
        "review_rating": "1",
        "review_title": "Worse than bad.",
        "review_detailed_main": "There are bad films, and there are pretentious films. This one does not belong to the former category."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "champers2910",
        "review_rating": "1",
        "review_title": "Trash - belongs in the bin, just don't even bother.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "SKFCB",
        "review_rating": "",
        "review_title": "Lots of sex including bondage. Parents review way off.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "lifelinespublishing",
        "review_rating": "7",
        "review_title": "a plus and a few minus",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "ethanm-31245",
        "review_rating": "1",
        "review_title": "Worst among the worst",
        "review_detailed_main": "If you want the real outcome of the movie, check out the box office. High budget, low ROI."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "murtdoc",
        "review_rating": "9",
        "review_title": "Unique - Like a tasty food wine.",
        "review_detailed_main": "London Fields was never meant to compete with your usual blockbuster chick-flick kind of movie. Its got a category of it's own. It's like a good wine - it's meant to taste better with time. It's meant to be a catalist for s specific taste. A good painting appreciated more after people learn to understand it. Amber Heard is a unique beauty and a talented actress - She was perfectly cast for the role."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "bpfoy",
        "review_rating": "7",
        "review_title": "Young Falling in Love with the Elderly",
        "review_detailed_main": "In this age of internet this is not so far fetched. I get young women all the time trying to pick me up via messenger and it's only a matter of time until they ask for money .s the last girl never asked me for any money. She wanted me to contact a lawyer for her and claim I was her husband so that she could get her father's inheritance LOL I'm still waiting to see how it plays out! So yeah, this does happen but it's so unbelievable you're idiot if you fall for it."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "mienekevanmiddendorp",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Watched it because of Billy Bob, but Amber Heard totally messed it up, never seen such poor acting."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "tomcurry-63034",
        "review_rating": "1",
        "review_title": "Horrifically bad movie",
        "review_detailed_main": "I was forced to rate this movie a 1 star because unfortunately there is no such thing as a 0 rating"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "subxerogravity",
        "review_rating": "5",
        "review_title": "On the weak side",
        "review_detailed_main": "Oh wow! I just saw this in theaters and your telling me it's been out since 2015? I guess that's the biz of showbiz, this movie is bizarre enough for me to believe that they could not find anyone who wanted to distribute it.\n\nThis also explains why Amber Heard and Johnny Depp are in the same movie. In 2015 I think the two were still together. They did not share any scenes in the movie (Maybe they had to reedited so that was the case explaining the long delay of release).\n\nLondon Fields love itself far too much that it's not listening to anyone telling it how dull this is. I will say this, I did not see the ending coming of this mystery because of the oddness of the film, which I can totally respect.\n\nBilly Bob Thornton plays a washed up writer from Hell's kitchen who switches homes with a hot shot writer from London in hopes he can write his next book and he gets and idea when he discovers his next store neighbor, Amber Herd has predicted that someone will kill her and has agreed to let the writer observe to see how it will lay out.\n\nThe film looks beautiful and gets you in the mood of the Murder Mystery. I found it interesting that I could not tell what time period the movie falls under. I think it's a near future, that has better cell phones then we do now, but I'm not sure. Amber Heard does help in the beauty of this film as it's definitely her purpose in the film to play that classic Femme Fatale.\n\nI like Billy Bob Thornton and he was interesting enough, although his narration of the film did not get me into the story. This is true of most of the male cast members including Depp who quirky behavior was just corny. I say don't see it."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "livinglifing",
        "review_rating": "1",
        "review_title": "Amber Heard cannot act...period",
        "review_detailed_main": "Whatever or whoever gave Amber Heard the idea that she can act must have been up to something. Seriously. Even Aquaman would have been ruined if not for the strength of the script and remainder of the cast. This film did not have that and she lit the fire to this hot mess. Even her physical appeal is eroding as she ages. Sad..."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "shannieclaus",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "This has got to be one of the worst movies I've ever seen. Amber Heard totally sucked in this move. Not sure why they even made the movie. I give it a Big Zero on the watch list"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "ssvfolder-1",
        "review_rating": "1",
        "review_title": "Absolutely bad!",
        "review_detailed_main": "Accidently saw it a while back. This movie is awful. Not just because atrocious acting by its female lead, but also bad script, bad acting, bad everything.\n\nDon't waste your time."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "VoyagerMN1986",
        "review_rating": "",
        "review_title": "Is there a caegory for worst lead actress in history?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "saimariejohnson",
        "review_rating": "6",
        "review_title": "Thornton's promising.",
        "review_detailed_main": "I think there are some elements of this film I liked - the principle of the storyline and Thornton's acting from the writer's POV really appealed to me. Depp always delivers a fun character and does so effectively in the film - Heard's only real addition is remarkable beauty and a lot of conniving cunningness that is reflective of her character. It's not the worst film but certainly not the best, but has a promising premise of suspense and intrigue."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "stacydawl",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Absolutely awful I honestly have no words on how bad this movie is. That lead actress Alison heard is so unbelievable as an actress sorry but it's definitely no from me"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jipboon",
        "review_rating": "9",
        "review_title": "Cult classic",
        "review_detailed_main": "Love the atmosphere of this movie. Great cast. Dark but funny details here and there. One to be among the cult classics."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Isis-Ascending",
        "review_rating": "7",
        "review_title": "Johnny Depp & Jim Sturgess shine bright.",
        "review_detailed_main": "I enjoyed the film version of the novel directed by Cullen. Especially Depp and Jim Sturgess as the lovable, creepy \"Keith Talent.\" Author, Martin Amis debuts in a cameo as \"Julian Neat\" at the darts tournament. In book, \"Visiting Martin Amis,\" the author details his novel \"London Fields\" and main characters, Nicola Six, Keith Talent, and \"Guy Clinch.\" Coincidentally, Julia Clinch wrote \"Visiting Martin Amis\" (Amazon)."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "aarpcats",
        "review_rating": "1",
        "review_title": "Unwatchable, even as a curiosity piece",
        "review_detailed_main": "Even in a dark comedy where the characters can be played as satire, Amber Heard cannot act. She is beautiful, but she cannot sustain a lead role.\n\nThe rest of the actors are phoning in performances to a dumb plot and a grimy set. It's hard to tell whether they are reducing their abilities to match Heard, or whether the entire cast took Ambien before they performed their sleep walking roles.\n\nAwful. Do anything besides watching this movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "lisajr-39663",
        "review_rating": "1",
        "review_title": "Bad dont bother",
        "review_detailed_main": "This film was even worse that I was expecting. Heard is just a really bad actress."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "boecksimone",
        "review_rating": "1",
        "review_title": "Amber Heard is a bad actress",
        "review_detailed_main": "Very bad performance from Amber Heard, she seems to have no natural talent."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "anomis_ananda",
        "review_rating": "1",
        "review_title": "I'd give it a 0, but it's not an option",
        "review_detailed_main": "25 minutes in and I'm bored AF. Feels like the best action these people give, is smoking. Lead is pretty, but that's about it, as her acting is beyond poor. She'd be a good model, but I'd never hire her for movies again.\n\nDon't waste your time on this one. I can't even follow the story as it's soooooooo boring I wish to just drop it every 5 seconds."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "carlaesler",
        "review_rating": "2",
        "review_title": "Not good",
        "review_detailed_main": "Unsure why Johnny Depp would take an uncredited role in the atrocity, he is a mega star. This film is awful. I almost didn't finish it but I always follow through, no matter how bad a movie is. Waste of time!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "kboss-21078",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Don't waste your time ,it's not worth it, so boring, don't"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Miranda_Myklebust",
        "review_rating": "",
        "review_title": "Booooo for Amber",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Dora_",
        "review_rating": "7",
        "review_title": "Just because Amber Heard is there, it is good movie",
        "review_detailed_main": "This movie is good, just because she is in there. Beautiful lady! Teo James is good too. Not enough? I am sure there is plenty actors of anybody's taste. The script is weak, but again I am just enjoying sexy Amber. How does a woman have unrealistic beauty?"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "reza_rajabi",
        "review_rating": "1",
        "review_title": "Nonsense awful",
        "review_detailed_main": "I think about what I watched but I can't understand the movie even one minute of it. Don't waste your time plz."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "tomanc",
        "review_rating": "8",
        "review_title": "London Fields: Yes, but there's no reason for any of this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "amanbirsingh",
        "review_rating": "7",
        "review_title": "Bold and Beautiful!",
        "review_detailed_main": "London fields is attractive. It has black in quantums to annoy you but makes you feel sad in parts. Ignoring the need for deep reflection, the movie is fairly up close and far too personal even for a psychedelic fan.\n\nBilly Bob Thornton comes back powerfully as he stands aged and numb amongst the crass and plastic growth of an entire new world, changing for him and changing for nothing. And, the narrative is poetic.\n\nIf we're talking about the safe jibing of all losers of our perpetual society, we're treading into new ground with our blanket of love, sensitivity, borrowed wisdom and social security.\n\nMatthew Cullen makes his point by being out rightly judgmental as he interferes strongly towards the final part of the script. Dropping the open ending option and the melodrama, Cullen chooses cold anger to speak loudly about the ways of the lonely."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jenningssharron",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "I only watched this movie because my all time favourite actor Johnny Depp is in it and while his very small part was very well acted the rest of the film was awful the lead actress was wooden and unbelievable the story was weird I didn't like it at all"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "RoryCole28",
        "review_rating": "4",
        "review_title": "Too souless to be a femme fatale",
        "review_detailed_main": "When hiring an actress to be a femme fatale one has to hire someone who has allure. This actress poses the the emotions and simply is too young or simply doesnt posses the allure that is needed for this role. The story is good but there is such an artificial quality from the two leads, this girl/woman and Billy Bob Thorton. Good story and good filming etc but the acting was intolerble."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "sarahjanetyrrell",
        "review_rating": "1",
        "review_title": "Swerve",
        "review_detailed_main": "I could not even finish this. A leading lady who is more than a pretty face would have helped. Badly acted & scripted."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "tomi210210",
        "review_rating": "1",
        "review_title": "At least Johnny had a cameo in it.",
        "review_detailed_main": "They showed Amber's character like she's a goddess, when in reality she's average at best. Uninteresting movie with not much going on. I would've given it 4-5 stars for Bobby's acting, but I can't and won't support an abuser."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "arelmada",
        "review_rating": "1",
        "review_title": "...",
        "review_detailed_main": "It is so bad, so disastrous! Amber Heard is no movie star, she can't act, she is just talentless!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "ghiblighost",
        "review_rating": "1",
        "review_title": "Abuser needs to go",
        "review_detailed_main": "Terrible acting from Amber. She is cringyly bad, liar and husband beater. No to domestic violence."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "nxgn_not_not",
        "review_rating": "6",
        "review_title": "directors cut +",
        "review_detailed_main": "Buchen Ja! Producer Nien. If U r going 2 c it. Especially after reading the book ... c the director's cut. Better yet read the book & then c the director's cut. So so so gives me hope (that the dream of) more things that were thought un-film-able will eventually be embraced across various forms of media.\n\nHave Fun"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "steveorr-01599",
        "review_rating": "8",
        "review_title": "We have a bunch of jealous people here",
        "review_detailed_main": "Wow. I can't believe the hate coming out of this for Amber. Her acting is not that bad in this (how can she misplay a femme fatale?) I admired her beauty, but not her acting, in Drive Angry. She actually does a pretty good job in this flick. I think most of the hate is coming from the fact that she very well might be the most beautiful woman in the world and everyone is jealous of this and her relationships with Depp and Musk .\n\nBilly Bob was Billy Bob, pretty standard role for him, but Jim Sturgess was excellent and Theo James did well, too.\n\nThe unveiling of the twist kind of threw me, but I get it.\n\nI have seen a lot of horrible movies since the onset of Covid, and this is not even remotely close to joining them. Ignore the bad reviews and give it a chance."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "sergelamarche",
        "review_rating": "6",
        "review_title": "watchable",
        "review_detailed_main": "Looks like a film made for Amber. Many sequences were purposedly erotic. But then, many others were purposedly funny. This film is like an inside joke. Watchable."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Piparkakkutalo",
        "review_rating": "1",
        "review_title": "Amber Heard ruins the whole movie",
        "review_detailed_main": "She has had a bad wrap online once the world found out she is a horrible abusive person off camera. It´s not right but that kinda does affect the way she comes accross on camera now... So just because of that reason, imma have to give this movie 1star. If minus stars were possible i would give -10 for featuring an abuser."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "mcmillward",
        "review_rating": "1",
        "review_title": "Terrible film",
        "review_detailed_main": "Terrible film starring domestic abuse criminal Amber Heard."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Xh11jab",
        "review_rating": "1",
        "review_title": "Amber Heard's acting was true to form ...",
        "review_detailed_main": "In that she categorically CAN-NOT act to save her life\n\nThis was excruciating to watch. Couldn't even finish the movie.\n\nCould've cast Elmo to do a better job. Honestly what were they trying to do???"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "nisara",
        "review_rating": "3",
        "review_title": "39 producers",
        "review_detailed_main": "39 producers on this mess managed to pull this film down to a score of 3.9. What is wrong with modern filmmakers? The more producers on the credits, the worse the film tends to be. How could the industry get into this terrible quagmire? So much money is wasted on first class flights for the producers and five star hotels, this money could have been put into the movie. 39 producers can't agree on one thing so obviously the film suffers from indecision and pulling in different directions. The movie the Godfather had only one producer and that turned out very well. In my humble opinion. I've heard that the directors cut is much better than the producers cut, that isn't a surprise to me, I wouldn't however go out of my way to seek the directors cut out having seen the film once."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "annevisser-36127",
        "review_rating": "1",
        "review_title": "For Johnny",
        "review_detailed_main": "Don't know the movie but just want to say: Justice for Johnny #9gag"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jakealcock",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Would never watch this movie again, I know it is sad but the only reason I watched this movie was to write a bad review, I know it was going to be terrible, but I just want to throw shade at amber heard for absolutely anything I can. #JusticeforJohnny"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Furrymuppets",
        "review_rating": "",
        "review_title": "Not good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "permet-33540",
        "review_rating": "6",
        "review_title": "Wait. This is a sci-fi comedy.",
        "review_detailed_main": "I took the recommendations of one of the other reviewers and used some medical cannabis before watching this unusual movie. This was a black comedy with dystopian hues. A sci-fi parody of the film noir genre. (Boy that sounds pretentious but it's true).\n\nI imagined that two Czechoslovakia from the 1"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "martusenet",
        "review_rating": "1",
        "review_title": "I will never spend money on a movie with Amber Heard Again",
        "review_detailed_main": "Justice For Johnny Depp, This woman should loose her career instead of Depp BOYCOT AMBER HEARD"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "stegasaurob",
        "review_rating": "10",
        "review_title": "One Hundred And EIGHTY!",
        "review_detailed_main": "London Fields has to be the best docu-drama I've ever seen on London's underground darts scene. I only hope they make a sequel with more of the wonderful Keith Talent. A more attractive and appealing man has never stood behind an oche.\n\nOn the downside, Johnny Depp's uncredited cameo as Jim Bowen is underwhelming."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "bigdogtim7-418-694044",
        "review_rating": "1",
        "review_title": "Terrible acting!!!",
        "review_detailed_main": "Amber Heard shouldn't act anywhere, not in Court and especially not on the movie screen.\n\nShe is far better off going back to modeling so she can pay all her losses off."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "trinipal-27995",
        "review_rating": "1",
        "review_title": "Do not read if you haven't or want to see this title",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "darkojonovic",
        "review_rating": "1",
        "review_title": "Why",
        "review_detailed_main": "The only point in film is Amber Heard is in lingerie. Who cares about it can save time and search for those parts on the internet."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Bader00",
        "review_rating": "1",
        "review_title": "For justice",
        "review_detailed_main": "Justice for johnny depp.\n\nAll sad for johnny he should be contine in movie Amber Heard he should all raview 1/10 Its not fear all prdoucer take amber Still johnny its a great actor and what happend in house johnny still in house johnny."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "georgiamcd",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Honestly I've never seen this movie but it must be terrible because a*ber heard cannot act to save her life - the best part about this movie would definitely be Johnny Depp but I couldnt watch it because of 'her'. I give this a 1 star just because Johnny depp is in it :)"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "zwrsrk",
        "review_rating": "1",
        "review_title": "Amber Heard is dreadful",
        "review_detailed_main": "I can't even put it into words. This was a terrible movie but Amber Heard is atrocious!! She is just the worse actress I have ever seen. I will never torture myself with another minute of her 'acting'. Please do not waste your time."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "sherlocks84",
        "review_rating": "1",
        "review_title": "Another \"Sin City\"?",
        "review_detailed_main": "All what the makers had in mind was to create a movie \"like Sin City\" nothing else.Filled in some rubbish in that and delivered, you got this movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "levelsoflife",
        "review_rating": "10",
        "review_title": "cult classic",
        "review_detailed_main": "Don't listen to the critics - they are hysterical and frothing at the mouth about a film that relishes in unabashed fun."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "tamara_blue-68271",
        "review_rating": "1",
        "review_title": "Awful movie",
        "review_detailed_main": "Don't waste your time watching this. Worst movie i ever saw."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "derekpoland",
        "review_rating": "1",
        "review_title": "AH, 'nuff said",
        "review_detailed_main": "AH, 'nuff said. I really can't see anyone rating this or any of her movies higher than a one but we can't go lower unfortunately. She deserves nothing. Nothing at all."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "nathanschn",
        "review_rating": "2",
        "review_title": "It's bad !!!",
        "review_detailed_main": "Bad story , I'm surprise to see 2 great actors in such a bad movie ! The girl may be pretty but damn she is a horrible actress !"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "squishy-bumbum",
        "review_rating": "1",
        "review_title": "Horrible acting",
        "review_detailed_main": "Honestly the acting in this was terrible. Watching Amber Heard in this is like watching paint dry on a wall"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "dahliafleischmann",
        "review_rating": "1",
        "review_title": "Awful. Just Awful.",
        "review_detailed_main": "I couldn't even finish this it was so bad. Please don't waste your time."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "vinayshri",
        "review_rating": "3",
        "review_title": "Honest review",
        "review_detailed_main": "As i am a avid webseries and movie watcher i can say this movie has quite slow direction. I literally fall in love with Amber Heard's acting but movie was way too slow and predictable also. Makers should have added some events that could spiced up the movie. Keith's been loser in the movie until end and then something unexpected happen that proved why he's been loser. I don't think i have invested my time at good movie. Thank you for reading this. Hope you have a great day."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "micro-cotton",
        "review_rating": "1",
        "review_title": "Save yourself from disappointment, give this one a miss",
        "review_detailed_main": "I am right in saying Johnny Depp was in the film but was not credted? Perhaps he had the good sense to disown it as was the disjointed garbage. Lured by Amber Heard and Billy Bob Thornton I wasted almost another 2 hours of my life trying to make sense of this."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "nickclement-74227",
        "review_rating": "8",
        "review_title": "SEE THE DIRECTOR'S CUT - NOT THE BUTCHERED THEATRICAL VERSION",
        "review_detailed_main": "Up until a few weeks ago, I had no idea about Mathew Cullen's new film, the much discussed, often maligned, and barely-given-a-chance London Fields. I had no clue about the behind the scenes issues (Cullen battled the producers over his final vision with a compromised cut recently getting released in theaters on a semi-wide platform), and regardless of those various problems that the creative parties had with each other while making and finishing the project, I don't care about any of that stuff - I care about the movie in question. So when the opportunity presented itself to view Cullen's personal director's cut, I jumped at the chance. Cullen, founder of the visual effects company Mirada, has a background in commercials and music videos, and got his chance to play with a massive piece of storytelling for his feature debut, and I'll be curious to see what he does next, especially if he gets the chance to make a film and not become entangled in production nightmares.\n\nSo while I can't compare the director's cut to the producer's cut (or the novel which the film is based on), what I can state is that I very much enjoyed watching Cullen's preferred vision of London Fields. It's got a stunning sense of visual craft, with textural compositions that are strikingly bold and frequently eye-blazing, and the film's noir-esque plot of a distressed writer (Billy Bob Thornton) trying to make sense of his reality and the story he's in the midst of writing always remained interesting and unique. It also helps when ultra-eye candy actress Amber Heard is the femme fatale (in more ways than one); ever since Pineapple Express she's remained a most alluring screen presence, and it's clear that Cullen knew what he had on the other end of his viewfinder when he was setting up his mise-en-scene. Throw in a totally bonkers if slightly grating performance by Jim Sturgess and familiar faces like Jason Isaacs, Theo James, Jamie Alexander, Cara Delevinge, and an uncredited (and sorta hilarious) Johnny Depp, and you've got a starry cast that really brought the juice.\n\nGiven that original novelist Martin Amis co-adapted his own book (with Roberta Hanley), I can't imagine that he'd work to sabotage a filmic version of something he initially created, so I'd have to assume that the busy plot of the film follows the exploits of the book to a certain authentic degree. The dialogue is over the top and purposefully rosy, with the actors clearly having fun delivering their lines. Toydrum's musical score is brazen and fully alive at all times, and the sometimes surreal juxtapositions of archival footage mixed in with glossy cinematic artifice keeps the viewer disoriented and wondering what might happen next. Cinematographer Guillermo Navarro (Desperado, Jackie Brown, Pan's Labyrinth) really earned his paycheck on this movie - every shot is luscious. The film's credits list a staggering number of producers and production companies who were involved in getting this project to the big-screen. For some, London Fields will exist as a cheap and easy punching bag, but for others who can separate business from art, and if you can see Cullen's director's cut, many will find a very entertaining and conceptually wild movie that's just waiting to be discovered and embraced by a cult audience."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "eberkerbatur",
        "review_rating": "4",
        "review_title": "it was terrible (4.1)",
        "review_detailed_main": "The movie hardly understood and i was bored, i was not interested in anything. There was a different universe and environment. I did not understand when the movie was set. There was a different world and I couldn't understand that world.\n\nIt sounds like watched for the cast but I don't think it's worth your time, it was bad or even awful"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "atw-49612",
        "review_rating": "1",
        "review_title": "Worst movie ever!",
        "review_detailed_main": "Worst movie I ever seen! If I could get it minus I would! I turned it off after 10 min! I tried to watch it again the day after but I turned it off again! Save your time and don't watch it!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "kjsinghsaini",
        "review_rating": "1",
        "review_title": "Nonsense",
        "review_detailed_main": "This is how a movie ust not be made, makes no sense. has no heart forget about the place of it."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "mattecata",
        "review_rating": "1",
        "review_title": "Execrable movie",
        "review_detailed_main": "It is just a lost of time.....almost execrable movie"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "heelatucker",
        "review_rating": "2",
        "review_title": "Dog Poo",
        "review_detailed_main": "1 star for Johnny Depp cameos, 1 star for Theo James. At least he can actually act, and is nice to look at. The other performances were dog poo. BBT is so overrated, Jim Sturgess absolutely awful, and Amber Heard... painful to watch. Wow just wow. It was so so so bad. Story was all over the place. Plot was stupid and predictable. Why was the yellow-toothed, over-the-top Jim Sturgess character such a big part of the focus? We're we supposed to believe he was the killer, because that was so obvious. Why all the dart-playing?? What was the significance? I laughed out loud only once when Theo James' rabid son tried attacking someone. Besides the 2 pluses above, there were ZERO redeeming qualities to this movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "ntnkapoor",
        "review_rating": "1",
        "review_title": "Read down",
        "review_detailed_main": "The only reasons to watch this movie are 1jhonny depp 2amber Heard's beautiful ass"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "starmac-51297",
        "review_rating": "1",
        "review_title": "Worst actress and worst movie all in one",
        "review_detailed_main": "Worst actress nominee 2019 and worst movie all in one? There is only one way to go. Very very bad movie but not as bad as Amber's performance. Do not watch! You've been warned."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "bobzzzz",
        "review_rating": "9",
        "review_title": "I guess there are two versions",
        "review_detailed_main": "I must have watched the Director's Cut because I thought this was great. I was surprised when I came here and saw so many negatives."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "glondon-57861",
        "review_rating": "1",
        "review_title": "Worst movie I have ever seen",
        "review_detailed_main": "This move is proof that Amber Heard is a terrible actor besides being an alleged abuser."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "matteljupa",
        "review_rating": "1",
        "review_title": "Could not finish the movie..",
        "review_detailed_main": "Had to stop watching i usually see the whole movie. This time impossible. Bad acting. Bsd story. I liked jasons perfomance. But that was it. This is a movie you can skip entirely."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "surreygal",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "I am sorry but this has to be one of the worst films I have seen. The plot is muddled. I didn't manage to suffer to the end. Miss Heard, as always, relied on her looks to get her through. If a studio wants a film to fail, add Miss Heard to the cast. The truth is, she just has no acting talent. Justice for Johnny."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "robdrummond",
        "review_rating": "4",
        "review_title": "Well",
        "review_detailed_main": "Such a weird film.\n\nIt says my review is too short - so. It's really such a weird film."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "TheTruthofItIs",
        "review_rating": "5",
        "review_title": "All hail Amber Heard",
        "review_detailed_main": "\"London Fields\" is her showcase film playing a femme fatale seducing unsavory types and modeling lingerie. If you edited this right it could be a Playboy Lingerie video - remember those?! I could follow the story for the most part but by the end was left scratching my head as to why her death occurred, just didn't seem well motivated at all. Was interesting to see her interplay with Depp's character since they'd go on to be an item then married IRL. I rate it a five because though it makes little to no sense in the end, many of the individual, component scenes are well crafted and executed well, especially those with Amber in them."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "thefemias",
        "review_rating": "1",
        "review_title": "Perfectly Cast Lead",
        "review_detailed_main": "The character of Nicola Six is trashy, deceitful, one-dimensional, narcissistic and fake. Just like the so-called actress who plays her. Don't waste your time on this movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "byroncairns",
        "review_rating": "1",
        "review_title": "High Hopes Little Reward",
        "review_detailed_main": "The writing is awful, but I liked the actors and was hoping for more. Sadly more never made an appearance."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "strawberryfeelds",
        "review_rating": "8",
        "review_title": "Keep an open mind - and you won't be disappointed",
        "review_detailed_main": "I wonder if any of these reviewers have read the novel by English writer Martin Amis on which this film is based. Amis is an intelligent, witty, original writer, and a perceptive commentator on the absurdity of our post-modern world. This film does an excellent job of capturing the complexities of a book that is deliberately enigmatic and ambiguous.\n\nHow does Nicola Six know that she will be murdered by one of the men in the pub? How can a girl like her possibly be sexually interested in a low-life like Keith? Is it because she deliberately set out to drive those men to kill her? Then again, is a woman actually murdered in \"real life\"? Or does the whole thing just take place in a novel? And if so, who is the novelist?\n\nRead the book and watch the film - or watch the film then read the book. Or just watch the film with an open mind, without expecting your standard cinema fare of good guys/girls vs bad guys/girls, requiring no intellectual input from the viewer.\n\nNo spoilers here. The whole point of the film is to get you guessing - and you'll still be doing that after the final credits."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "korinp",
        "review_rating": "3",
        "review_title": "Lots of great ideas but fumbles from the start.",
        "review_detailed_main": "The cast ensemble had all the makings for a great film, but the lead actress overacted her part and ruined it for me. Great ideas for a script that seemed to get lost or jumbled throughout the film."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "pisces-37330",
        "review_rating": "1",
        "review_title": "This movie is an absolute wreck!",
        "review_detailed_main": "Billy Bob Thornton does his best with the material and has the strongest performance. But ultimately, his character falls apart, by no fault of his own.\n\nTheo James' character seems to barely be a person and he seems to play him as such, minimal effort. I'm not sure if that was intentional.\n\nJim Sturgess is the MOST in every scene and it's every grating and annoying. And he's skeezy enough, the yellow teeth are just unnecessary.\n\nAmber Heard just falls flat, she's no Female Fatale. She embodies the blonde bombshell they were going for, but her performance is lackluster.\n\nThe plot... oh the plot. This is where things get messy. Sex, murder, extortion, writing, and darts? With a dash or clairvoyance.\n\nSo the gal walks into a dingy bar in full retro funeral attire (black veil included) and leaves after a few brief interactions. She's trailed by the local handyman who happens to be very good at darts (and owes money to several loan sharks). A handsome upperclass gentleman who inexplicably was also at the dingy bar follows the two and is trailed by the writer for whatever reason. And the plot just continues to unfold in a manner such as that. Things happening for reasons that don't really make any sense."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "hlnmcgu",
        "review_rating": "5",
        "review_title": "Ruined by Jim Sturgess",
        "review_detailed_main": "Fine film, if you view it as a kind of surreal comedy and I enjoyed it - would have gave it a higher score if it wasn't for the extremely bad casting in Jim Sturgess as 'Keith'. Sturgess must be the worst actor I've ever seen, not even funny in scenes that are supposed to be funny. Sturgess takes up a lot of the film too, pouncing around pulling faces pretending to be cockney, it was embarassing.\n\nSeriously I liked the sad parts too, and I think the femme fatale has a sad side. I think Amber Heard is a touching actress. Billy Bob Thornton was good too. Not enough of Johnny Depp in the film to judge too much, but he does a swell pommy accent."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "sechbp",
        "review_rating": "5",
        "review_title": "Waste your time",
        "review_detailed_main": "Waste your time ,it's worth it, so sad. just do it"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "RiccardoVecchione",
        "review_rating": "",
        "review_title": "THEO JAMES IS THE BEST",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "saptesh786",
        "review_rating": "4",
        "review_title": "Good Plot average movie : A woman and three lovers one be killer.",
        "review_detailed_main": "Story plot is good, but screen play missed the shot. A woman, who has power to see the future knows that she will be killed by a lover among three of them. Though story seems interesting its presentation is very poor and average and loose its thrill. Lot of parts focusing only on Ambar Herd's beauty and her lusty woman role. A couple of sex scenes will raise your heart beat definitely. Stunning beauty of Ambar is appreciable. She is perfect in her role. In other word she is only watchable part of the movie, other wise movie would be garbage. You can only watch this movie if you are fan of Ambar Heard either or wants to smell her charming beauty. She is just gorgeous."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "jewelch",
        "review_rating": "4",
        "review_title": "Going out on a limb here bit I liked it",
        "review_detailed_main": "OK I'm going out on a limb here but I just can't believe all the bad reviews I thought it to be a good 3 star movie, All I can say is try it you might like it also. James Welch Henderson, Arkansas 2/18/2021 PS You will never guess who kills her. or does she even die."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "andre-bernard",
        "review_rating": "3",
        "review_title": "Amber Heard is very sexy....that's all!!!",
        "review_detailed_main": "One of the worst movie with great actors in it....Amber Heard will never win an Oscar biut she's so sexy!...Jim Sturgess is very bad even if he's great in his others movies...And Billy Bob Thornton too could be better !"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "vindrauga",
        "review_rating": "10",
        "review_title": "Greatly misunderstood movie",
        "review_detailed_main": "I don't know what others were confused by. Perhaps too much one dimensional Hollywood obvious movies. At any rate I liked this movie a lot. Reminded me of Hal Hartley movies and it was a welcomed relief from all the main steam only to make bucks movies..."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "annegretcoetzee",
        "review_rating": "3",
        "review_title": "Interesting deviations from the book",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Confusing mess stylish neo noir",
        "review_detailed_main": "A film surrounding hype and criticism upon its release. Described as a thriller film noir, London Fields isn't very good in many aspects. The acting varies upon the actors and the story is seemingly convoluted and a mess in terms of storyline. It is confusing at first regarding Billy Bob Thornton's character and his narration. It seems more detailed and feels like it tries being smarter than it actually is.\n\nA lot of criticism is about Jim Sturgess' characters. His over the top acting is noticeable as he takes up a lot of the film, pouncing around pulling faces pretending to be cockney. Theo James play the more straightforward yet sensitive likeable character. Thornton seems to be sleep walking as his character appears to be simply a figment of imagination. This wasn't exactly clarified specifically the ending. Amber Heard isn't the strongest actor but she has a great presence on the screen. The hate for her in this film is vastly overblown and most definitely seems to stem from her personal life.\n\nPositives about this film is the cinematography and scenery. The visuals make the film look very stylish and more watchable. However the story of the love triangle drags on at certain points and is somewhat predictable and becomes boring. Somewhat anti climatic and the twist type ending was quite predictable. If one could look past its flaws there is definitely a watchable factor as it's not as bad as many of these reviews claim."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "A_Different_Drummer",
        "review_rating": "2",
        "review_title": "A rare movie indeed",
        "review_detailed_main": "If you spend a lot of time with movies -- guilty as charged, M'am -- then you will notice that, once a blue moon, you come across a certain rare kind of film. A film that should never have been made. A film that should never have been greenlighted. Or funded. Or distributed. Or seen. Not because it is so bad. Lots of bad films out there. Tens of thousands. But because it is such a waste. Of talent. Of resources. Of theatre space. London Fields is a perfect example. The concept -- a heroine who can forsee her own death, and an amoral writer more than willing to exploit that -- might have worked in more capable hands. But here the audience is the victim, not the fictional character. The creators even managed to take one of the most likable actors in Hollywood, Billy Bob, and make him cringe-worthy. Extraordinary achievement. ((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "roopesh-chandra-bose",
        "review_rating": "4",
        "review_title": "Not so bad",
        "review_detailed_main": "Not sure about the hate but found this to be reasonably enjoyable for one watch.\n\nThe movie is stylish and has a certain fantasy based surreal feel that may not go down well with many people who want a cut and dried plot.\n\nThe acting was overall ok, a bit over the top sometimes but we have seen worse.\n\nMy only gripe with this movie is that I found the plot transparent. I guessed guessed the second half of the story including the end, fairly easily, which means it did not offer anything different from other such genre movies."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "sharafiali",
        "review_rating": "4",
        "review_title": "A movie that wants to be good",
        "review_detailed_main": "A movie that want to show a deep mininig but it cant a bad combination of \"mother\" and \"the seventh seal\" It contin some good secne but its realy far from a good movie"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "anmol-75911",
        "review_rating": "10",
        "review_title": "Amber heard",
        "review_detailed_main": "She looks completely flawless and stunning. Definitely a 10 for her gorgeousness"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "McScared",
        "review_rating": "10",
        "review_title": "Someone doesn't want you to see this film",
        "review_detailed_main": "That's the only conclusion to draw from all the one star reviews.\n\nI'd like to think that the reason is an obvious one, but I'm sure it is more complicated than that.\n\nAmber Heard is stunning and her acting is very good. All the performances were good and I really enjoyed the story. It's sad that many people will miss this very entertaining film due to petty reasons.\n\nI'm not picking sides on the personal stuff, because none of us will really know. But as far as this film goes, it's intelligent, stunning, and entertaining. Kudos to all involved. Johnny, grow up and stop thinking that you're doing the world a favour. The Truth does exist. And your behaviour is childish at best."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "anmol-75911",
        "review_rating": "10",
        "review_title": "Gorgeous looks",
        "review_detailed_main": "Amber heard looks very stunning and gorgeous. Her beautiful looks surely deserve no less than a 10 rating"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "solalmediodia",
        "review_rating": "9",
        "review_title": "a true work of art",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "galloconmando",
        "review_rating": "10",
        "review_title": "One of the best films ever!",
        "review_detailed_main": "Super sexy! Great cast, unexpected ending, loved it !\n\nWould totally recommend if you want an exciting thriller with a lot of sexy scenes. It is now one of my favorite movies. A lot of reviews here are just based on the Whole depp heard trial. Watch it for yourself!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "corvingeo",
        "review_rating": "10",
        "review_title": "A cult movie applicant",
        "review_detailed_main": "I felt every moment, every phrase, every scene, every character is me. Thank you for all involved in this movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "willcline-91043",
        "review_rating": "8",
        "review_title": "Amber Heard!!",
        "review_detailed_main": "Im always up for anything she's in. this girl has style, talent looks and she keeps getting better and better"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "lepar0v",
        "review_rating": "10",
        "review_title": "Secret Gem",
        "review_detailed_main": "I found out of this movie in 2019. I can't explain it, every minute of it is like a poetry. The scenes are perfect and every actor played so well. I don't understand other reviews, this is like a piece of art and it was intended to be.\n\nIs the movie sexual, yes, but that's just the charm of it all, it is a big pillar of the this movie's foundation.\n\nMovie portrays naivety, vanity, betrayal, lust, lies, deception, every bad human characteristic with little bit of comical moments here and there to make it complete.\n\nAlso Jim Sturgess who plays Keith Talent is playing perfect character. Many comical moments that wouldn't be as good if it wasn't for him. Big bravo for this movie."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "RocheK01",
        "review_rating": "8",
        "review_title": "Director's cut",
        "review_detailed_main": "This movie is done injustice with how it was released. The director's cut is the only version that should be watched. It's a shame it has received such negative reviews but it's their own fault with how they marketed the different versions. I really do love how this movie was put together."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "steve-care",
        "review_rating": "8",
        "review_title": "Directors Cut.",
        "review_detailed_main": "This film has been on my hit list for ages, considering the cast and the story, i was waiting in anticipation for it to come out in the UK. Alas, it didnt and when i read about what had happened, i realised why.\n\nIt has been classed as one of the worst films ever made and was hardly seen which when you see the huge cast that's in it, is amazing on its own. So bad was it received & reviewed that Amber Heard won a razzie for worst actress. However, that is the \"producers\" cut. However, when i heard that there was a one off screening of the \"directors\" cut in London and that Matthew Cullen & Jim Sturgess were going to be there, i had to go.\n\nYes, its based on a Martin Amis story and is probably the only film you will ever see about love, jealousy, murder & darts but Cullen & Sturgess were here on hand to tell the truth about what actually happened.\n\nThe film ran into huge financial difficulties & the producers decided that they didn't want Cullens original cut but they wanted their own version which went for sensationalism over story, and this is the version that got panned. Most of the actors disowned this version & in the case of Heard, she tried to sue the producers for breach of contract, stating what they had made abused her personally with regard to using body doubles for the extra nudity in this version stating that she did it and this was not what she had signed up for. Apparently this producers cut has images that are offensive to everyone with refs to 9/11 etc. So Cullen financed his own directors cut and im told its completely different from the other version.\n\nI can tell you now, that although its not the greatest film ever made, its a really entertaining film. Heard is a great Femme Fatale, oozing sex appeal, Sturgess is very OTT in his role and Johnny Depp has a fun cameo.\n\nDont think I want to see the producers cut as this is all thats available, but if you get the DVD/Blu Ray, the directors cut is on the extras!"
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "hrothgar19",
        "review_rating": "8",
        "review_title": "Nowhere near as bad as feared",
        "review_detailed_main": "It's a brilliant book and this makes a fair effort at filming it. Very good cast. Some bits are changed for no apparent reason (the car, the relative location of Sam and Nicola's flats, her age) but they don't detract too much. Some of the plot twist and the redemptive quality of the book lose their impact here but a film of a book is never going to be great.\n\nI can see how it would be a very difficult film to watch if the viewer wasn't already familiar with the story."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "linderbrock-313-892577",
        "review_rating": "8",
        "review_title": "I saw it in Spanish and the acting wasnt that terrible, femme fatale nicely projected.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "sacred-24-196008",
        "review_rating": "8",
        "review_title": "Great promising mystery thriller",
        "review_detailed_main": "L really like mystery thriller movies, especially the ones that build around a sexy female character. Amber Heard acted really good on this film, l can say she justified Nicola Six as a character. Go and see it if you like this kind of films."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "alinashcheg",
        "review_rating": "9",
        "review_title": "Watch if you are into eye-pleasing philosophical movies and and don't care about actors' drama",
        "review_detailed_main": "The majority of bad reviews are just haters of Amber Heard as a person (not saying there are no good reasons for that hate).\n\nHowever, if you are more interested in a good piece of art rather than Hollywood's gossip, than you need to see that."
    },
    {
        "movie_id": "tt1273221",
        "movie_name": "London Fields",
        "movie_rating": "3.9",
        "review_username": "MsShirlyS",
        "review_rating": "",
        "review_title": "My eyes!! Terrible performance!!",
        "review_detailed_main": ""
    }
]