[
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "eldreddsouza",
        "review_rating": "1",
        "review_title": "O Bollywood lol. Feel like laughing at your state.",
        "review_detailed_main": "Same old nonsense continues to be done in this industry. Tiger Shroff has been doing one thing from the start of his career and is not capable of giving any other expressions. With him it's always like 'action at the cost of expression'. He's been in this industry for almost a decade now but has not improved even one percent at the things that he's bad at, which is obviously acting, emoting and dialogue delivery. How long are we gonna see the same old jumping and dancing with the same bland face? Is he ever gonna change?\n\nThere's no story in this film. This film relies solely on its action which is still way over the top and completely nonsensical. Tara Sutaria is overrated. Haven't liked her acting since her debut film SOTY 2 but I don't know how people still have faith in her.\n\nThe songs in this film are terrible. 1st rate torture if I may. They only make the film more unbearable. Can't believe AR Rahman worked on the music of this film. Even the original whistle baja is so good compared to this. This one is so bad I can't even describe it in words. Nawazuddin Siddiqui is doing his same acting from Kick. So in short this film offers nothing new. Pathetic acting, dialogues and their delivery, worst songs, action that you've already seen a million times and no good story at all (horrible in fact), I wouldn't recommend this film even to my debtors. Don't pay me back but also don't waste my money on such horrible films."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vluckylkv",
        "review_rating": "1",
        "review_title": "Even 0 star is too much for this movie",
        "review_detailed_main": "Cringey performance is expected from tiger shroff and tara but nawaz performance was even more cringing. Tiger bhai hume pata hai tum ucchal kood kar lete ho but thoda acting or story par bhi kaam kar liya karo. Tbh I have never seen any bad movie more than this. Please don't watch this movie, it can seriously gave you brain damage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kustomizer",
        "review_rating": "1",
        "review_title": "Choti bachi ho kya",
        "review_detailed_main": "Bad movie bad movie bad movie i avoid i don't like it but bad movies likes me I can't avoid.\n\nBollywood 😂\nAs far as film is concerned there is nothing i mean nothing to talk about whether it's Tiger acting or Tara sutaria mediocre performance and Nawaz bhai ke liye ek hi bat bolunga whu kya majburi thi but ha paisa mil raha hai to who cares This is for our beloved Bollywood Choti bachi ho kya Choti bachi ho kya Choti bachi ho kya Choti bachi ho kya Choti bachi ho kya Choti bachi ho kya Choti bachi ho kya Wo 150 character likhna tha isliye ye upar wala Bakaiti kiye😂"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rahulvaidya055",
        "review_rating": "1",
        "review_title": "Chu****panti 2",
        "review_detailed_main": "Nothing to write in review here. The headline says it all. Save your money, time, sanity by not watching this piece of utter unoriginal crap and literally doing anything else."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nandisubhadip",
        "review_rating": "1",
        "review_title": "This movie had so much hidden talent that it should have remained hidden",
        "review_detailed_main": "Script is horrible.\n\nActing is awful.\n\nSongs are bad.\n\nDialogues are disgusting.\n\nTiger Shroff should just go for Olympics.\n\nTara Sutaria did everything except acting.\n\nAction sequences are just atrocious.\n\nDirection is horrendous.\n\nFinal Verdict: if you just want to spend some time with your gf/bf in a AC hall then book this movie because no on will watch this hot pile of garbage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sherlockholmes99",
        "review_rating": "",
        "review_title": "Better save your money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kkolambkar",
        "review_rating": "1",
        "review_title": "What crap was this🤣🤣🤣🤣",
        "review_detailed_main": "Why Tiger Why?!! Why u make such movies.. Chotti bacchi ho kya samaj nahi ata🤣🤣🤣\n\nIt was more of a comedy movie... Irrelevant fight scenes...nonsense twist and stupidity at its best!!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "yathinkudupaje",
        "review_rating": "1",
        "review_title": "Action with Bgrade Bollywood Romance",
        "review_detailed_main": "Heropanti2. The title of the movie should be renamed as gutterpanti 2. Booking was done based on second trailer. But it is a total disaster movie. Tiger seriously has to go to film school and learn acting before doing any movie. Bollywood thinks adding intimate scenes will attract crowd. Are they making mainstream movies or bgrade movies. A R rehman music is disaster. The two positive thing in the movie is action scenes of international quality and namazuddin siddiqui. Acting. If one remove these scenes. Then total disaster. Not recommended to family audience.if couples who want to spend 2hrs inside theatre can go for it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "chougule-56751",
        "review_rating": "1",
        "review_title": "Save money, instead help someone.. Epic disaster",
        "review_detailed_main": "Worst movie ever.. Tiger, nawaz, tara, Ahmed khan, a.r rehman & sajid nadiadwala all should be arrested for torturing audience .. Please sit at home or go for runway 34..\n\nTiger never disappoints us in disappointing us.\n\nZero rating for the movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "prasadunawane",
        "review_rating": "1",
        "review_title": "Wished I would have watched KGF 2 FOR 3rd time",
        "review_detailed_main": "Tiger shroff.... Nepotism, Nepotism, Nepotism... Acting bhi Sikh Le bhai.. abs nahi bhi rahenge toh challenge.. I really thought it would be some movie, but after watching content oriented movies like Kashmir Files and KGF 2. Really feel sorry as to why you signed this film? Why? No content, and director was the worst... Bhai abs, thighs, bosom aur kya? Audiences ka patience? Free me diya toh bhi don't watch."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jualemon",
        "review_rating": "1",
        "review_title": "One more Poor Show",
        "review_detailed_main": "As I expect from Trailer, it was very poor story and direction. Lots of blooper in movie. Horrible action and their poor post production work. Overall not worth your money. Tiger needs to learn from past and needs to choose better story.\n\nThey made remake but seen are inspired from other movies also. After RRR and KGF you won't want to see these kind stupid stories, there is no sense no logic, everything is magic. Ahemd direction was really poor."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ujjalrajkhowa-24022",
        "review_rating": "8",
        "review_title": "Outstanding",
        "review_detailed_main": "One of the best action movie in 2022 ever delivered from Bollywood. Tiger doing his amazing action and improve himself in acting. Heropanti 2 is completely different from it's 1st part and in Heropanti 2 you will get a good story with suspension and entertainment ,also emotions. On the other hand Nawaz doing a perfect character as well as he doing before. After all it is a amazing movie guys. You never get disappointment. Thank you."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "harryranu-82979",
        "review_rating": "7",
        "review_title": "Does exactly what it states on the tin!!!!",
        "review_detailed_main": "This movie ain't going to win any Oscar's, however it's a pure masala movie, exactly what you expect from Tiger movies ably assisted by the excellent villain. Stop giving it 2-3 stars and let those that want to watch it not be put off by the poor reviews. This ain't Kashmir Files but it's also not trying to be."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "videoeditorzone",
        "review_rating": "1",
        "review_title": "Bkawas",
        "review_detailed_main": "Fuddu bakwas Fuddu bakwas. Fuddu bakwas Fuddu bakwas. I don't like this movie. What aI thought is bakwas. Fuddu bakwas Fuddu bakwas. Fuddu bakwas Fuddu bakwas. I don't like this movie. What aI thought is bakwas."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Soul_Snatcher",
        "review_rating": "1",
        "review_title": "Collapse of Bollywood",
        "review_detailed_main": "This movie is hilariously bad. We're seeing collapse in bollywood and rise of tollywood/south movie industry.\n\nThe sci fi stunts are so cringeworthy that african sci fi looks more compelling.\n\nAll over india, people are waiting for next south movie, not an bollywood propaganda peddling mediocre drivel."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "arjuncshekartheofficial",
        "review_rating": "1",
        "review_title": "It's better to watch KGF Chapter 2, RRR and Pushpa 1000 times than watching this cringe.",
        "review_detailed_main": "This movie is absolutely a cringe, this movie doesn't have a story and screenplay. Tiger shroff acting is so terrible, such that it made me to ran out of theater within the first half. I booked tickets for KGF Chapter 2 and watched it for two times after watching this terrible movie. Man the director who directed this horrible movie must have to stop directing films and starting transportation business is the best way he can earn billions of money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "reek-26352",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie of the year goes to heropanti 2 :) aisei movies banate raho Bollywood aur agey jayenge :)) Ahmed Khan please continue with choreography, you are one of the worst director of bollywood 🙏"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "tgabhiverma",
        "review_rating": "1",
        "review_title": "EATING THE LAYS WAS MORE ENJOYABLE",
        "review_detailed_main": "YES IT A VERY GOOD ACTION MOVIE IF YOU COMPARE WITH BHOJPURI C GRADE MOVIE. EVEN BHOJPURI MOVIES ARE ENJOYABLE. IT IS JUST A BIGGEST DIASTER EVER. DIMAG KI L LAG GYI. BHAI IF YOU WANT A PEACEFUL ENVIORMENT GO WATCH THIS MASTERPIECE. AARAM 2 HRS 30 MIN SO JAO. SJ 2 IS MASTERPIECE FOR THIS. HAN IF YOU TAKE REVENGE ON SOMEONE JUST GIVE ITS TICKETS TO HIM. HE END UP TO BE MAD.\n\nSHARAM KARO YAAR BOLLYWOOD!\n\nHACKER AND CODER ARE DOING SUICIDE. BABLU AS TIGER SHROFF IS JUST A SUPERHERO HACKER COMEDAIN ACTION.\n\nTHIS JUST BHOJPURI REMAKE OF JOHN WICK, SUPERHERO MARVEL MOVIES. BHOJPURI IS BETTER THAN THIS.\n\nMASTERPIECE!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "3",
        "review_title": "Baaghi 3 Has Got An Official Father. A Terrible Sequel With Unbearable Heropanti.",
        "review_detailed_main": "Heropanti 2 (2022) : Movie Review\n\nOne of the main reasons behind massy South films' huge success in the Hindi market is Bollywood's masala films being too bad. It's been 5 years now since we haven't had a huge hit in the action-masala genre - the last being \"Tiger Zinda Hai\". The reason is quite clear and simple: we aren't making good films. Rajamouli's larger-than-life vision has left such a big impact on the audience that they are not ready to watch any mediocre masala film with cheap materialism. Tiger Shroff debuted in heroic style with Heropanti (2014), which was a remake, but anyway, the film established him as a young action star in Bollywood. With Baaghi (2016), Baaghi 2 (2018), and War (2019), he cemented the position, but then came Baaghi 3 to spoil the party. And now comes Heropanti 2 to add more fuel to those burning expectations. A late sequel is always in doubt, especially when it has nothing to do with the storyline of the predecessor, unless you are making a \"Golmaal\" franchise like Rohit Shetty. Heropanti 2 was too late, but more than that, it was unwanted. Instead of doubling the fun in the second part, it halves everything.\n\nHeropanti 2 has a complex storyline, so there's nothing simple about it like its first part. The film introduces you to Babloo (Tiger Shroff), a smart hacker and a fighter (that's obvious with Tiger), who is living a remote life somewhere away from enemies. As expected, the villains unite to beat him and find his location, and from the rest, you can predict how he smashes everyone. Babloo's love interest, Inaaya (Tara Sutaria), is the sister of his biggest enemy, a magician-cum-gangster, Laila (Nawazuddin Siddiqui). Laila wants to do mass hacking to earn money, and Babloo tries to stop him in his style. The writing has nothing new to offer, but that's still okay with a mass film. We don't expect a strong script from a typical action entertainer, but what's not okay is the cheapest form of screenwriting. Heropanti 2 is full of cringe moments, and believe me, they are unbearable.\n\nThis is not a film for acting; most of the mass films aren't, including Hollywood. Tiger Shroff is on a heroic high, the same way he was in Baaghi 3. Yes, he can beat a bunch of villains, but this time he's a hacker too. That adds some tech stuff to his filmography. Tara Sutaria looks gorgeous in every scene, whether it is a casual, fashionable look or an extremely glamourous one with high sex appeal. But let's not talk about acting. Let's skip that part. The bigger shock is that a talented actor like Nawazuddin Siddiqui is playing this bad role. The calibre of Nawaz is so high that it's just unacceptable to see him doing a role like this. It's not that I expected an artistic performance from him, but even in mass films, there's always some kind of scope for the villain. Nawaz just doesn't fit, or shall I say, the character doesn't fit. Amrita Singh goes flat too.\n\nHeropanti 2 is a high-action film alright, and some of its effects even work on a few occasions, but the rest of the time, it's unbearable. The dialogues are too cheap sometimes, and are a little funny on a few occasions. What hampers it the most is the screenwriting, which literally tests your patience. Those Facebook and WhatsApp jokes from the 2014-2015 era are not supposed to work in the film made in 2022. Heropanti does not have anything new, but what's more worrying is that it makes the old formulas look worse. There are a few scenes that are entitled to please the single-screen masses, especially those different forms of action sequences. Also, AR Rahman's music has some sort of goodness. Even though not all songs work, some do.\n\nDirector Ahmed Khan seemed clueless here. There was no chance that Heropanti 2 could have gone anywhere with such weak writing, but Khan's direction does nothing but present it in outdated manners. Many scenes remind you of the 80s masala films that we have left way behind. Heropanti 2 is not even watchable for hard-core Tiger Shroff fans because they have seen him in better films like War, Baaghi 2 and Baaghi. There's a lot missing; it's just a matter of how much you notice. The list can go on and on as the modern cinema and its audience have become more cautious nowadays. Overall, a terrible sequel that people never demanded, and the Heropanti level is definitely down this time.\n\nRATING - 3/10*"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "part-88233",
        "review_rating": "1",
        "review_title": "Cringe Fest",
        "review_detailed_main": "Torture. Ahmed Khan , Sajid Nadiadwala - Please stop taking audience for a ride. Movie has n storyline. Over the top actions which has become so repittive, you can actyually watch old Jackie Chan and Keanu Reeeves movie to relive those."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Biswas_",
        "review_rating": "1",
        "review_title": "Please stop working with Ahmed Khan",
        "review_detailed_main": "Tiger shroff has immense potential to be a terrific action hero but his choices to work constantly with Ahmed Khan, who basically is another version of Prabhudeva , is ruining his career. Just because Ahmed Khan gave him one success in the name of Baaghi 2, does not mean he constantly continue giving him chances even after knowing audience don't find Ahmed Khan films as even barely watchable. This is exactly what Salman Khan did working with Prabhudeva constantly for 2 bad films.\n\nHeropanti was never good. It was average but was successful cuz of a new hero interest, some really good songs and dance/ action moves. Due to this commercial success , they went on to make Heropanti 2 which imo is even worse.\n\nThe thing is, they had an interesting story in hand. A hacker named Laila planning to get hold of the money of every Indian and Tiger trying to get him by entering into his personal space and then getting caught eventually leading him to staying undercover and try catch him formed the base of an intriguing plot. It is the terrible execution of this story that leads to thr downfall. Never does it feel thrilling or something. Even the climax doesn't feel thrilling.\n\nAdding cherry to this cake is the terribly written characters especially of Nawaz and Tara. Nawaz tries to be a \"Kick\" kind of villian and fails miserably. It is Tara however who is an absolute pain to watch. Her constant squealing in high pitch voice feels so irritating at one point that i felt skipping those parts .\n\nDouble meaning jokes, weird sequences further malign this project.\n\nAction is definitely a little over the top but after watching the action and logic in south films like KGF, I decided well, i won't complain here too as it belongs to the same masala genre.\n\nSongs? Well it's very hard to digest that AR rahman first chose to give his music for a film like this and then proceeds to give not a single good song. Whoever was the music composer for Heropanti 1 did a way better job than AR rahman.\n\nOverall, I think others have elaborated well about whether to watch it or not . Seeing the poor collection at the BO, it should be a lesson for Tiger to stop working with Ahmed khan."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "whoareyou-25120",
        "review_rating": "",
        "review_title": "Aak thoo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "somvarshitbnk",
        "review_rating": "10",
        "review_title": "Support this movie",
        "review_detailed_main": "Better movie to watch please support this movie because it's good to watch support this movie like other South movie go to theaters watch this movie and then give your review because very much hardwork is required to make a flim and tiger is giving 100 percent to all his movie. So please support this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kainatrc",
        "review_rating": "6",
        "review_title": "Tiger rocks",
        "review_detailed_main": "People say expectation hurts and this line totally fits with this movie. When you go to watch this movie please don't have any expectations...and tell your brain to go to\" rest mode\"and then start watching it. Once you start watching don't try to find any logic and this \"mantra\"will make you enjoy each and every part of this movie. Watching Tiger Shroff on big screen is a treat to your eyes. Watching his stunts and fights gives you a sense of satisfaction. Though the story is little weak but Tiger Shroff's acting ,looks and stunts compensates everything. Nawazuddin's role is equally important throughout the movie. You can see Tara Sutaria's skin more than her acting. But I must say she is looking damn hot in the movie. This movie also gives you taste of Rohit Shetty's movies.... stunts of expensive cars. This movie would be released of Amazon prime video very soon but I personally feel that you must watch it on big screen to get the feel of sound effect and picture quality. Nothing can beat watching movie in cinemas on big screen. Overall it's a good movie and is a must for kids."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ifanbhuiyan",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Horrible acting, full of cringe. The concept of the movie was good but it was presented in such a bad way. If tiger continues to work in this type of movies, his career will be gone very soon. And I have nothing to say about Tara, cause I don't count her as an actress."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Chutiye_dekthe_hai_firstshow",
        "review_rating": "1",
        "review_title": "Aare Paapio mere paise lautao",
        "review_detailed_main": "Dasvi pass logon ne Milkar jo haaga hai screen pe mat pucho.\n\nAare thoda acting and Directing school jao, script writer to paise do. Jo paise us Tendue to dete ho uska 30% tho writer par karcha karo.\n\nAare yeh sab tum logo ki bas ki bath nahi hai, engineering kar lo aur infosys or TCS join karo. On-site jaane milega."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "HitYaFlop_MovieWorld",
        "review_rating": "3",
        "review_title": "Not Recommended 👎🏻 by Hit Ya Flop - Movie World",
        "review_detailed_main": "Can a movie be made without any plot and screenplay? The answer is \"Yes we have Heropanti 2\". After directing the Baaghi franchise, Ahmed Khan reunites with Tiger Shroff for this film, but the question is Why? What was the need for this sequel?\n\nCan a movie be made without any plot and screenplay? The answer is \"Yes we have Heropanti 2\". After directing the Baaghi franchise, Ahmed Khan reunites with Tiger Shroff for this film, but the question is Why? What was the need for this sequel?\n\nThe makers have underutilized Nawazuddin and focused only on copy-paste action sequences, Tara Sutaria's looks, and Tiger Shroff's abs & dance. They have tried to add humour in some scenes but failed miserably. They have even forcefully added 'Choti Bachi Ho Kya?' trending dialogue in one fighting sequence.\n\nThe music is given by maestro AR Rahman, who is completely wasted here. He could have saved some songs for a better romantic film. If you are looking for a storyline, meaningful dialogues, character development, watchable performances, and humour then you should avoid this film.\n\nDirection 1.5/5 Acting 1.5/5 Action 2.5/5 Story 1/5 Screenplay 1/5."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "adrenaling",
        "review_rating": "1",
        "review_title": "Creativity is missing",
        "review_detailed_main": "Bad direction. Women objectification, Director is giving chance only bcz he has money and friends clearly doesnt know how to direct movies. Tiger shroff is expressionless and pathetic again."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "anuragtilak",
        "review_rating": "1",
        "review_title": "Cringe at its best",
        "review_detailed_main": "One of the most cringiest movies ever made. What else can you expect from a choreographer turned director who doesn't know the ABC of direction.\n\nSatyamev Jayate 2's Milap Zaveri would see this and have the last laugh cuz HP2 beats SJ2 hands down in terms of cringe."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "radhehooda-36678",
        "review_rating": "1",
        "review_title": "To all my friends",
        "review_detailed_main": "After seeing this movie I just want to ask the cast choti baachi ho kya. Don't waste your time and money it is just illogical and very poor acting and story line is very very poor. Film makers have just spend money on fighting scenes."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Carolyn_Channing",
        "review_rating": "1",
        "review_title": "No logic whatsoever",
        "review_detailed_main": "Worst movie I have seen so far this year. No logic whatsoever in it, full of cringe worthy one liners and dialogues with physics defying stunts. The movie gave me migraine, I had to take medicines for it. Save your time and money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ronitbiswas-29346",
        "review_rating": "1",
        "review_title": "Cringe cringe cringe i don't like Bollywood i avoid it but Bollywood likes me so I can't avoid it",
        "review_detailed_main": "Cringe cringe cringe i don't like Bollywood i avoid it but Bollywood likes me so I can't avoid it Mother became sis Dad became Father in law Wife became choti bacchi ho kya samajh mai nahi aata Pls i request you if you want to watch this movie then take painkiller, anesthesia, sound jammer for your ear other wise blood will be there.\n\nAnd sasta p+*+hub."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "dleemarupert",
        "review_rating": "",
        "review_title": "chu****panti 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shaikhkashif-05103",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Excellent. Loved the way of action mind blowing story and great acting by nawaz and amazingly shot great work by the whole team superb please go and watch dis amazing movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "witra_as",
        "review_rating": "7",
        "review_title": "Showcase sparkle for Tiger",
        "review_detailed_main": "Another showcase sparkle for Tiger Shroff who often danced randomly between scenes. Ahmed Khan banked on its over-the-top action sequences with nonsensical plot and characters. Nawaz wasn't that good either. Catchy songs made up for pure mindless entertainment."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "akkitmr",
        "review_rating": "1",
        "review_title": "Disaster of 2022",
        "review_detailed_main": "Don't watch this movie, please help someone needy, who needs 100 or 200. Don't watch this movie, please help someone needy, who needs 100 or 200. Don't watch this movie, please help someone needy, who needs 100 or 200. Don't watch this movie, please help someone needy, who needs 100 or 200."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "qqmvtcw",
        "review_rating": "1",
        "review_title": "Bakwas Movie dont waste money",
        "review_detailed_main": "Agar 0 star ka option hota to main wo chose krta ... Skip kro yaar 0.5/5 Tiger shorff I thought you will stop taking remakes and start doing originals but please you please do those remakes only Unfortunately I watched heropanti2 my inner feeling is I wasted 200 rs for this worst film.\n\nHIGHLIGHTS: NOTHING DRAWBACKS: EVERYTHING ELSE FINAL VERDICT: SAVE MONEY."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rao-92652",
        "review_rating": "1",
        "review_title": "Boring Movie",
        "review_detailed_main": "There is no acting in the movie, how they can make such a disaster, Pls Tiger leave the flim industry and be a PT Teacher in schools. This nonsense acting make our Indian cinema Down. So in Future pls I Request Quiet your acting and your business."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rmaheta_wed",
        "review_rating": "1",
        "review_title": "pathetic",
        "review_detailed_main": "Looks like the producer don't get the copyrights of baaghi series, so they release baaghi type movie under heropanti banner. But they forgot that heropanti is a comedy movie whereas this is more of baaghi type action movie ."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "arvndrthd",
        "review_rating": "1",
        "review_title": "Terrible movie. Don't waste time",
        "review_detailed_main": "Nothing there in movie, so nothing to write. I would have given negetive rating if available Don't waste time and money.\n\nKGF 2 is much better and enjoyable."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "arbaz-25903",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "Pure horse sh#t Waste of time, peace and every second of it was a torture I'd prefer to watch a wall for 3 hours straight instead of this movie.\n\nF@#k My brain cells are dead now..... Horrible."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "AziziOthmanMY",
        "review_rating": "1",
        "review_title": "Bollywood 5 Star Dumpster Fire",
        "review_detailed_main": "A truckload of over the top bollywood action sequences.\n\nThe movie sole purpose seems to be to showcasing tiger shroff with a good amount of kindergarten CGI and cheesy rope work.\n\nThe story line is dumb as a rock.\n\nProbably a third sequel is in the works i guess."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pi-prince",
        "review_rating": "",
        "review_title": "brain freezing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sksaha-43915",
        "review_rating": "10",
        "review_title": "One word review",
        "review_detailed_main": "The story was good buy Execution is not up to the mark...the performance of stars is also over the top...tara sutaria is here presented as for entertainment purpose...it could be a good film but makers are failed to do that...But one time watchable if you leave all the logic while watching."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "arsenalfcclubwearegunners",
        "review_rating": "7",
        "review_title": "Not that bad, my choice",
        "review_detailed_main": "Well, the movie is full of action, and drama, but somewhere little overacting by the heroine her acting is not that impressive and her overacting is destroying the charm of the movie and scenes between Tiger ( Jai Hemant Shroff) are nice but, her overacting uff oh god, I don't think so overacting by heroines necessary. She should take some acting classes.\n\nOther than the heroine, other actors were fine, Amrita Singh is an iconic actress no doubt, and movie scenes in between flashbacks were good, I liked that. Action and thrill were bang on.\n\n7 stars are fine for this movie.\n\nWell, watching a movie is their choice but still, I recommend watching it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mdridwanhossainjoy",
        "review_rating": "1",
        "review_title": "Poor story, waste of money..!",
        "review_detailed_main": "Not everyone likes to watch poor storyline with Hollywood copied action. Fully waste of Nawazuddin..! Tries to copy Joker but wasted.\n\nThis movie is full of disappointment. Bollywood should grow up and make better content instead of Poor so called action fiim..!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mrdevashish",
        "review_rating": "1",
        "review_title": "Chhoti bacchi ho kya?",
        "review_detailed_main": "Chhoti bacchi ho kya? Samajh nahi aata aisi movie nahi dekha karte, kuch ho jata to?\n\nA complete disaster, Sajid Nadiadwala, Ahmed Khan, Tiger Shroff, Tara - everyone did justice to this disaster. No one tried even a little bit to spoil this disaster."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "suyashkrishna",
        "review_rating": "1",
        "review_title": "If you praise nonsense, you'll get more nonsense",
        "review_detailed_main": "Don't watch it!\n\nElse you'll make your own future dark!\n\nThose movie people think that by putting fancy things in movies, the movie will be a hit even if it has no story, no acting and no reason to be existing."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nadkarnisumeet",
        "review_rating": "4",
        "review_title": "Crouching Tiger Copy Dragon.",
        "review_detailed_main": "Heropanti 2 review :\n\nSalman bhai missed his Eid appointment this year and so, Tiger cub is here with his mass masala entertainer. Heropanti 2, the unrelated sequel to his 2014 debut film, packs in all the standard Bollywood elements of over the top action, forced emotions (maa factor), unnecessary songs and oodles of swag while missing most important aspect of filmmaking - SCRIPT!!!\n\nFrankly, there is absolutely no semblance of a story or script here and all we see is either Tiger in action mode or gyrating to strictly okey dokey music score by A. R. Rahman. Admittedly, one of the songs called 'Da Faa Kar' is catchy and zingily choreographed but hey, why is it pronounced to appear like an English swear word??!!!\n\nOn the positive, the action sequences in the second half are well executed and the production values are expectedly first rate. Editing could've been much better specially that non-linear timeline gets tad confusing after a point. The humour element is generously sprinkled across the narrative but falls flat on most occasions. Like Tiger being asked to strip in public to show a coveted 'teel' on his bum. Yucks!!!\n\nOf the cast, Tiger Shroff is outstanding in the action scenes but falls short in the emotional ones. There is no doubt that he is no 1. Action star today but urgently needs to choose a good story to showcase his overall talent. Tara Sutaria, looking a million bucks, has precious nothing to do except appear in various state of undress!! Amrita Singh is earnest as the maa...I actually recollected her young avatar in Mard (1985) which I loved as a kiddo. How time flies!!\n\nAs for Nawazuddin Siddiqui's Laila, the same queer character was played more effectively by apna Shakti Kapoor in Dharmendra's 1990 hit Veeru Dada. \"Mere kanne chakku hai\" was Shakti's still popular catchphrase from that movie. Sadly, Nawaaz hasn't been able to match up to that level..\n\nHeropanti 2 is intermittently entertaining but most of it appears irrelevant and dated for 2022. An average fare, at best!! Sorry Tiger, I love you loads but kya kare. Heropanti se jyaada you need to do Acting-panti now. Please!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rajnot",
        "review_rating": "1",
        "review_title": "Choo###tya Movie",
        "review_detailed_main": "Arey Madharchood , Gand main sey bullet nekalnaka baat, kho jaka dance karaga kya.\n\nAhmed khan you are the worst movie maker and Sajid you are dumbest producer."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "singhshivam-95002",
        "review_rating": "1",
        "review_title": "Waste of money and time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "londhevaibhav",
        "review_rating": "1",
        "review_title": "0 star and bakwas bollywood",
        "review_detailed_main": "Bakwas director and bakwas story .. Tech tech banvtat...Navin idea ahe ka nahi.....150 shabd kay lihu bakwas varti .. Bakwas la bakwasch bolnar ajun kay..Bakwas bakwas bakwas."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "hmail-31911",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "At first I want to say to the Director.. If you can't make a good movie please just leave the industry.\n\nYou just wasted our money and time by giving this another garbage. I will suggest you to make youtube videos you will do that better.\n\nThis movie was just a garbage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "tikoomohit",
        "review_rating": "10",
        "review_title": "Too good to be true",
        "review_detailed_main": "Excellence in film making 🤣 😂😜😜 realistic acting, no over acting at all 👏👏 action scenes are very dangerous for eyes 😳😳 songs are like poetry to ears 💆💆"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "batwondersumit",
        "review_rating": "1",
        "review_title": "UPGRADE VERSION OF POISON BY BOLLYWOOD",
        "review_detailed_main": "This movie is absolutely poison and director of this movie is completely no knowledge of film making he know only action with out feeling and emotions and no story. Tiger you are a stuntman and you have no acting skills pls learn some acting from any acting school and actress of this movie is only for skin showing and no more use of actress and music is senseless and namaz uddin siddiqi talent is completely waste he only talented part of this film crew member."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rishi_mathuria",
        "review_rating": "1",
        "review_title": "Sabko aati nahi n iski jaati nahi",
        "review_detailed_main": "Bhaisahab....mat karo itna atyachaar. Bandh karo yeh nanga naach. Pathetic is not the word. Please bro get into wrestling body building but not into acting. It isn't everyone's cup of tea."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "xxyz-72205",
        "review_rating": "1",
        "review_title": "It's totally bakwas movie...I waste My time 😡😡😡",
        "review_detailed_main": "Pls..yaar do something Nice like runway 34., Movie is not match that level , acting, direction, screenplay is not good, Even VFX aslo not good film is not like choti bacchi."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kasunshanaka-61611",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "Plz I beg you trust me. Only watch if you want severe headache in summer. The story is just out of mind. Its like watching kids cartoon story. Bunty is just non sense character. Tiger has given same sort of actions jst like his other movies."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vitthalmisal",
        "review_rating": "1",
        "review_title": "Total time time waste movie didn't expected this from Tiger and Nawaz",
        "review_detailed_main": "Worst movie of 2022 Don't waste your time watching this cringe stuff. No words to say at all tara sutaria with 0 acting skills doing nothing. Worst song created by ar rahman of all time i didn't found any story in the movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jatinlohade",
        "review_rating": "2",
        "review_title": "Not upto expectations",
        "review_detailed_main": "This movie doesn't have a story and screenplay. Tiger shroff acting is so terrible, such that it made me to ran out of theater within the first half.\n\nNot upto expectations."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "johnmurmu-09841",
        "review_rating": "1",
        "review_title": "JISKO RISK se ISQ HAI WAHI ISS MOVIE KO DENKHE",
        "review_detailed_main": "Best tiger shroff movie according to the director of movie welcome back.\n\nSayad kisi chhote bachche ne kahani likhi hai.\n\nMore power to audience.\n\nPaisa barbad ho gya bc 😭"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sunnywithualways",
        "review_rating": "1",
        "review_title": "Wahiyat Movie",
        "review_detailed_main": "Wahiyat movie 😴, same thing again and again, over acting by nawajudin siddiqi. Have to watch KGF chapter 2 for recovery after this movie.\n\nDon't watch it, its a torture."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "devendrabijendrasingh",
        "review_rating": "10",
        "review_title": "BLOCKBUSTER heropanti 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nishitpatel-92696",
        "review_rating": "3",
        "review_title": "They just made fun of heath ledger and Nawaz!",
        "review_detailed_main": "Trailer proved how dumb Bollywood creators could be. They chose nawazuddin as villan and made him to do dumb overacting. Other than that, there is nothing but waste of time."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "laxmijl",
        "review_rating": "1",
        "review_title": "Nonsense",
        "review_detailed_main": "Both producer and director of the movie should watch Tom and Jerry, it has way better storyline. This movie director is such a shame to this Hindi film industry don't know why these guys are working with this guy."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jonny78",
        "review_rating": "2",
        "review_title": "The Reason Of Bollywood's Demise",
        "review_detailed_main": "People wonder why KGF 2, RRR, and other such films become great hits at the box office (though those films aren't the cinematic masterpieces most proclaim them to me; rather they are massy commercial entertainers with brilliant execution). This is simply because the average product of Bollywood is a film like Baaghi 3, Heropanti 2, etc.\n\nThe main problem here is the wanna-be western vibe that so profoundly emanates from this film. Excessively objectified women, campy sleek action scenes drag the already horrible screenplay to an even poorer level.\n\nBollywood just manages to stay afloat with cinematic masterpieces such as Tumbbad, Sardar Udham, The Kashmir Files preventing it from sinking. Otherwise, it's the Titanic of Indian cinema - once very respected, but now sits at the bottom of the ocean."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ranjanravi-17547",
        "review_rating": "1",
        "review_title": "0/10 should be actual rating",
        "review_detailed_main": "Again and Again , no story , only third class fight , zero physics , no reality , third type drama , double meaning words , pls think like normal people , Bollywood has made a different world and is not seeing out of it , Tiger should be awarded best copy actor , nawazuddin degrade his acting and will not survive for more....ranumandal wala halat hoga in sabka."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "tdtonmoy",
        "review_rating": "1",
        "review_title": "C class Movie",
        "review_detailed_main": "The trailer showed its capacity... and now the movie came out with same disaster.\n\nSame commercial story, same action sequence.\n\nPls give some relief to the audience ...\n\nSTOP MAKING THIS TYPE OF MOVIE rather help humanity... If i could gave minus mark then i would have done that already.\n\nNEVER ever expecting something good story from them...... HATS OFF TO THE DIRECTOR AND STORY WRITER.\n\nMORONS."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "abhishekchauhan-54545",
        "review_rating": "1",
        "review_title": "it dont deserve 1 star 0 star is perfect",
        "review_detailed_main": "Worst movie ever please dont go to watch it it is a request. If u want to keep your mental peice so pleaase dont go. Worst movie bhai pta hi nhi h ki kya bna diya...ande ho jate h kya movie banate time banane ke baad smj nhi aata kya inn logo ki bhut bekkar kaam kiya h ...bhai khud bhi dekhni chaiye movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "man_utd-81303",
        "review_rating": "1",
        "review_title": "Stop making such crappy movies.",
        "review_detailed_main": "People, it's time to take a stand against such crappy movies and not give them a single view (either in cinema or OTT)\n\nIm tired of seeing established actors or their children acting just because they got means .\n\nIt right there with Bachchan Pandey in series of mindless craps. Refrain from such movies and save some time/money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "brijprakash",
        "review_rating": "1",
        "review_title": "complete waste and boring",
        "review_detailed_main": "Complete waste of time and money, one of the most boring and stupid movies. The role of Inaaya was most stupid part, not expected this bad. Seriously!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "humanprojector",
        "review_rating": "8",
        "review_title": "What's there to hate so much, the film is entertaining and fun",
        "review_detailed_main": "Heropanti 2 is a perfectly average and entertaining film. It has a silly plot but is not that inane, there are some flashes of smartness in relevance of cyber crime in today's world, there are lot of great action sequences that can be watched and rewatched, super-funny and self-aware dialogs by Rajat Arora, some very filmy scenes which refreshingly don't go over the top, and yes since I am an AR Rahman fan, I loved the songs, the background score and the well-shot song sequences especially Dafa Kar and the qawwali Rehnuma. I was surprised by how much I liked Tiger Shroff in this film. He reminds me of an early action-comedy Salman Khan. He is certainly no great actor but is pleasing to watch on screen. The film is lot of fun if you want to watch something mindless and entertaining. I personally don't like much of the 'great' or 'superhit' films that come out these days but liked Heropanti 2 enough to watch it twice.\n\nPeople have become too demanding and critical these days. They will watch and praise anything that comes on Netflix or OTT just because others say it is great and must be watched. This film is not smarter or dumber than other films or content that we see in south or north. But for some reason everyone decided to spread vitriol over this particular film. It is how movies were back in 90s, silly and fun. Critics and oversmart audience ko Dafa Kar!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rajkumarraju-59646",
        "review_rating": "1",
        "review_title": "Boycott Bollywood",
        "review_detailed_main": "Now the condition of Bollywood very bad no one wants to watching movies of Bollywood.\n\nPeople loves south movies ❤ #BoycottBollywood #BoycottBollywood."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "manilkumar73",
        "review_rating": "1",
        "review_title": "Ignore this movie",
        "review_detailed_main": "I still dont understand why bollywood force us to watch such crap movies... Directors and entertainers (not nepos) should reset this approach and bring in good movies.... the decay of the bollywood with black money... sic."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ajith-04112",
        "review_rating": "2",
        "review_title": "Tiger it's better to stop",
        "review_detailed_main": "Tiger was never a naturally born actor like Jakie Shroff but problem is even after years of film making films he is still that same , nor his films looks good neither his acting, it's better for him to purse other things rather than acting. Films are made by acting skills not dancing or gymnastics if that was the issue Salman Khan Aamir Khan and amithabh bachan wouldn't have become such a big stars today......."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "hussainahmed-54654",
        "review_rating": "1",
        "review_title": "All are paid rating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "cantment",
        "review_rating": "1",
        "review_title": "Dustbin",
        "review_detailed_main": "Bad movie bad movie bad movie ....... (!) What the Fuchka leveled hero and heroine....and wtf story!! Wtf acting!!!! Boycott Bolly.... such a waste of time and money....."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mani2015",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Full of rubbish. Tiger's career will finish if he keeps on working in these kind of movies. Please think Tiger before choosing any script. Major disappointment with no storyline at all."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "haiderkaleem",
        "review_rating": "1",
        "review_title": "GATARPANTI 2 , WASTE OF TIME AND MONEY",
        "review_detailed_main": "Official name - GATARPANTI 2 I donot want to even right this review right now because this film does not deserve that also take any garbage films of any Bollywood actor that film will be more nice this film , now-a-days only South is producing films but Bollywood is focused on NEPOTISM AND NEPOTISM , EVERY NEW ACTOR IS SON / DAUGHTER OF ONE OR OTHER ACTORS OR RELATIVES IS THIS SOME KIND OF JOKE GOING ON IN BOLLYWOOD INDUSTRY ? NO STORY NOTHING this film is flop OUT OF 10 I WILL GIVE IT 0 STAR'S IT SERIOUSLY IS BAD FOR YOUR MIND AND HEALTH I DONOT KNOW HOW CAN AR RAHMAN GAVE MUSIC TO THIS FILM ? , JUST HOW much big pay check NAWAZUDDIN Siddique got to do this garbage film ,the writer who wrote Chandni chowk to China ,Sanju etc is the writer of this garbage i cannot even imagine does the direction team and the writing team were drunk while making this GATARPANTI This film budget was 115 crores and they made this rubbish While my one of the personal favourite KGF 2 BUDGET WAS ONLY 100 CRORES AND THEY MADE A HISTORY Bollywood is finished now is the time for SOUTH PICTURES to rise Bollywood should learn something from south film industry from KGF ,RRR , PUSHPA ETC BUT BOLLYWOOD IS ONLY FOCUSED ON COPYING THE South films and remaking them in Hindi because Bollywood does not even has a NICE STORY FOR it's FILMS !!!\n\nJust watch KGF , triple R OR PUSHPA AGAIN ,or even KOREAN DRAMAS OR ANIMES OR HOLLYWOOD MOVIES BUT PLEASE DONOT WASTE YOUR TIME ON THIS GARBAGE Bollywood actors just know how to charge hefty money 💸💸 but they do not know acting just drugs and alcohol and parties."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "Completely, utterly, TRASH",
        "review_detailed_main": "What a trash movie, bullocks from the very start scene, what utter useless waste.\n\nTiger should choose the movies very wisely now, he is still in process should not destroy it.\n\nTara Sutaria, the worst possible choice for the movie, one of the most leading worst actor, what cheap costumes and dialogues and acting. She should really get some classes ASAP.\n\nFirstly she aint that good looking and she is one terrible actor.\n\nIn one of the scenes, the hair were so fake, another actor for the entire scene touching the same with words in his mind WTF\n\nTrash, so trash i cant even describe it properly.\n\nAhmed Khan the director, well direction is not at all your cup of tea."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "manleenme",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": "Tara sutaria is so natural... Actually Tiger and Tara both are wonderful actors... They should be given better scripts... We want to see them more...Tara will look beautiful in epic Indian legendary movies."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shaikhnaoman",
        "review_rating": "1",
        "review_title": "Only watch if you are Choti Bacchi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "anujkhat",
        "review_rating": "1",
        "review_title": "Pathetic , waste , awful",
        "review_detailed_main": "Really a bad bad one ... Starting from Tiger , Nawazuddin, Tara Sutaria all performed at their worst .. heroine anyways has lack of acting skills .. Music of Rehman got wasted too.. Now sure what Fun Ahmed Khan has this in directing .. again he has shown how a bad screenplay , direction can spoil everyone...\n\nStrictly not to WATCH."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sangeetha-02199",
        "review_rating": "1",
        "review_title": "Worst movie to b released this yr",
        "review_detailed_main": "The story is so boring! Same old concept. Acting is worst. There is no emotion on the hero's face.there was no need to make such a crap movie.total waste of time and money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pranavkk-22333",
        "review_rating": "1",
        "review_title": "Chutya ka muscle show",
        "review_detailed_main": "Just hate the repeated jumping and dancing just boring.\n\nActually he is no more a actor. Hated him veery much Congrates Bollywood for your end. The movie have no storie.just a dump waste."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vrnster",
        "review_rating": "1",
        "review_title": "It's not Heropanti, it's Chutiyapanti",
        "review_detailed_main": "Total bakwaas ! A lot of scenes copied from South Indian movies. No story, no logic, no acting and No sense. Should have given negative -10 rating for this chutiyapanti. Avoid this movie, save time n money. Bollywood movies are getting to new low every day."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "aniljogadiya",
        "review_rating": "1",
        "review_title": "0 rating ke layak nahi hai ek dum ghatiya film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shreyrjain",
        "review_rating": "1",
        "review_title": "Why do they make such movies!?",
        "review_detailed_main": "I didn't expect much from this movie, should've never left my house for this movie. Whole theater was empty, just went to movie because I had free tickets. It's not even worth if you're going to watch it for free. Just help yourself by saving sometime."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "npawan-17475",
        "review_rating": "1",
        "review_title": "Terrible.. not suprising in a way!!",
        "review_detailed_main": "Terrible.. not suprising in a way!!\n\nHorrible acting, poor story, no screenplay, waste of time and money.. its time for Bollywood to smell some coffee."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kaishushankar",
        "review_rating": "10",
        "review_title": "Action movie 🍿🎥",
        "review_detailed_main": "Some things that I liked about the movie is the Amazing Cinematography The Casts Performance Some Action Sequences\n\nWhat I think they could have done better is the Script Consistency and the Story Line\n\nThey Also could have gotten a different and a better storyline For Example, Tiger is a Raw agent highly trained in martial arts and other forms of combat and computer training as well. Due to personal and family reasons or specific other reasons, he left his job. Now the government wants him back to kill illegal troops and soldiers, wanted men around the world that Nawazuudin rules with his illegal activities. Later on, the government thought that Tiger is a criminal. Then Tiger proves that He is a Raw agent with over the top and incredible action sequences."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "professorpunisher",
        "review_rating": "1",
        "review_title": "Dont waste ur timee!!!",
        "review_detailed_main": "I wish hadnt watch this movie. I only watched it cuz heropanti was a pretty good movie, but this one is just horrible in every possible way!!! 😂 I mean why even make the movie in the name of Heropanti."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vikky106",
        "review_rating": "1",
        "review_title": "Petition time",
        "review_detailed_main": "Can we please have a petition to stop bollywood choreographers from directing movies and do only choreography..that should sum up the review..also IMBd please add 0 rating atar."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jackyul",
        "review_rating": "1",
        "review_title": "Bollywood's End is near.",
        "review_detailed_main": "Tiger exposing his body is basically plot of whole movie. Nothing new here to see.same old garbage in same old packing. At this time I advise tiger to look other options as career.he can do any thing besides acting. Don't waste your money it will be on TV at end of this month."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "singhindira-05442",
        "review_rating": "1",
        "review_title": "Not expected from tara !",
        "review_detailed_main": "I'm very disappointed with tara. She is a good actor and she done a lot show like on Disney . But how can se agree with this script . And tiger has only one expression 😂😂 nothing change with him from beginning except his beard . 🤣🤣 Do some work on acting not only on action and Dance ."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "armydoctorprakash",
        "review_rating": "1",
        "review_title": "Another useless product of bollywood",
        "review_detailed_main": "Don't watch ,to save your time & money better watch bhojpuri films. Worst acting from tiger even however he influenced Nawaz to perform worst. Dukh movie with none another than action action action ,,,songs songs songs and nothing."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mehulnarsanda",
        "review_rating": "1",
        "review_title": "Can i get my money back",
        "review_detailed_main": "As per trailer i was impressed but in real time i got looted,, totally wasted of time and money.😭 #bc kuch dhang se to stories banaya karo 🙏 Please any way to get money back of my 5 tickets??"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vishalrapps",
        "review_rating": "1",
        "review_title": "DO NOT WATCH!!!",
        "review_detailed_main": "Worst movie ever, I don't know why this director is still in Bollywood. Please do not waste your time. If there was zero rating I would have gave zero or negative ratings."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shikhasinghsharma",
        "review_rating": "1",
        "review_title": "Non sense",
        "review_detailed_main": "Learn something to make something,stop wasting time and money of audience, don't think viewers r stupid to enjoy this crap in the name of masala movie. Total disaster,go and watch RRR,KGF2 and Pushpa....let Bollywood just waste their money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ashishgera-08552",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "Movie is good heropanti 2 The Rise\" is a riveting cinematic experience that transcends conventional storytelling, immersing the audience in a world of relentless action, gripping drama, and powerful performances. Directed by Sukumar, the film weaves a tale of intrigue and ambition against the backdrop of the red sandalwood smuggling trade in the Chittoor region.\n\nAt its core, \"Pushpa\" is a character-driven narrative that follows the journey of the titular character, Pushpa Raj, played with unparalleled intensity by Allu Arjun. The film begins by establishing Pushpa's humble origins and his ascent in the ruthless world of red sandalwood smuggling. Arjun's portrayal of Pushpa is a tour de force, capturing the nuances of a complex character torn between morality and survival.\n\nThe screenplay, penned by Sukumar, is a masterclass in storytelling. The narrative unfolds organically, blending moments of tension with flashes of dark humor. The film's pacing is deliberate, allowing the audience to delve into the psyche of the characters and understand the intricacies of their relationships. The dialogues, delivered with finesse by the cast, are sharp and memorable, adding depth to the narrative.\n\nRashmika Mandanna, who plays the female lead Srivalli, brings a refreshing charm to the film. Her chemistry with Allu Arjun is palpable, providing emotional anchor points amidst the chaos. The film subtly explores the theme of love in the face of adversity, adding a layer of emotional depth to an otherwise action-packed storyline.\n\nOne of the film's standout aspects is its technical brilliance."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "zampanami",
        "review_rating": "1",
        "review_title": "Very bad boring choose better",
        "review_detailed_main": "Dont waste time. You know you will regret. Spend that money into eating something nice, atleast you will enjoy it & take it's nutritional values, ye toh t***i hai."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "saifrahman-83514",
        "review_rating": "1",
        "review_title": "waste time",
        "review_detailed_main": "As far as film is concerned there is nothing i mean nothing to talk about whether it's Tiger acting or Tara sutaria mediocre performance and Nawaz bhai ke liye ek hi bat bolunga whu kya majburi thi but ha paisa mil raha hai to who cares This is for our beloved Bollywood Choti bachi."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ashinmnm",
        "review_rating": "1",
        "review_title": "Ultra garbage max pro",
        "review_detailed_main": "I don't know what they were trying to create the movie is just horrible... I have never rated a movie on imdb but I couldn't show my frustration of wasting my time watching this anywhere else. They should be ashamed of themselves fooling people into seeing this kind of garbage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ankitmishradude",
        "review_rating": "1",
        "review_title": "Use your money elsewhere.",
        "review_detailed_main": "Very bad acting, Tiger and Tara have done the same old worn out story. I suggest don't waste your time and money. If you want you can also watch kgf2 again instead!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "km_shekharojha",
        "review_rating": "1",
        "review_title": "The Above rating is not one Star, As there was no option of 0 Star So...",
        "review_detailed_main": "First of all Mr. Ahmed Khan should be prosecuted for doing this kind crime to entire humanity across the globe. He deserve a mass Punishment.\n\nHe will be Solely responsible for ruining Tiger shroff career for making him act in such a pathetic movie. This is not first time doing such awful crime he did it before too REQUEST: If You all have two hrs. Of time, better sleep, instead of watching this disaster plus highly terrible movie, at least your brain will get some rest.\n\nThis will be probably most senseless and Misérables movie Bollywood had ever made with a shining star cast. Miss Tara was Dookan of Overacting, Sheer disaster. She should quite acting with immediate effect.\n\nAt last Feeling bad for Mr. Nawazudding still he gave his best as always. He was only one gem among all potatoes.\n\nI will be filing case against Mr. Ahmed Khan for wasting my Two hrs of time plus Ticket price. My rating is 0/10."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nickerpoo-41161",
        "review_rating": "1",
        "review_title": "One of reason why Bollywood sinking",
        "review_detailed_main": "The biggest drawback of this movie is the protagonist, except from one of dud actor in present day he proved that he had is one of most lazy being in bollywood. His last movie was Baaghi 3 which released in 2020, he got 2 full years to sharpen his acting skill but rather invested all time in gym and martial art training. After all those years he still looks like ping pong ball which just bouncing around the screen.\n\nNow coming to the director, Mr Ahmed Khan, \" Bhai kahe tum choreography chod ke film director banneki koshish kar rahe ho?"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nsolanki15",
        "review_rating": "1",
        "review_title": "story",
        "review_detailed_main": "Casting was good. As always nawazuddin did very good acting in movie. Tara is not good in acting. Great action by tiger Shroff. But the story of movie was very bad."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vbhvsnii",
        "review_rating": "1",
        "review_title": "Fokat me bhi mat dekhna ghatiya movie.",
        "review_detailed_main": "Such a waste of time.\n\nFokat me bhi mat dekhna ghatiya movie.\n\nDonate money instead of watching this movie.\n\nTotally nonsense intolerable movie.\n\nTheir acting, dialogue delivery iss too cheap."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "danieleghan",
        "review_rating": "10",
        "review_title": "Brilliant action",
        "review_detailed_main": "Really great action film with great fight sequences. Great cinematic colour and great time frames in different time periods. Really realistic modern film making a real high class piece of filmmaking at the top level. Great story and great acting all combined with a very clever script. Excellent camerawork really high level fining in a modern and contemporary way. Amazing film that should be seen as it really gripping and modern filmmaking at its best. This a must see film for fans of action packed films at the highest level in modern film making. Do not miss this great filmmaking and action movie taken to the next level."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pramod-57493",
        "review_rating": "1",
        "review_title": "A scrap nothing else",
        "review_detailed_main": "What type of movie is this after Sunil Shetty Krishna this was the second movie which I left after interval. There is no story no acting out nly overactive. Tiger Shroff what r u doing Baghi 3 was mistake but this one is blunder."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "lets-07490",
        "review_rating": "1",
        "review_title": "THE OFFICIAL GODFATHER OF BAAGHI 3 & RACE3",
        "review_detailed_main": "This film is utter trash,no acting,no logic, irritating music,logicless action scenes and Tiger shroffs over acting above all. Save ur precious time otherwise keep ur Head in ur Home then go to watch it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kamalvaswani-06724",
        "review_rating": "1",
        "review_title": "Very very bad experience i just watched the movie for",
        "review_detailed_main": "One and only nawazuddin ji is great actor otherwise i will give zero star to the movie Bollywood u need to improve yourself.\n\nBollywood needs to improve itself because movies like kgf2 and rrr getting very popular these days.\n\nJust because Bollywood is fullfiled with nepotism and heros with do even know words like acting."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "za-48959",
        "review_rating": "1",
        "review_title": "Your Time is Precious",
        "review_detailed_main": "If you have little sense of film industry, I will humbly suggest you not to watch this trash. I have wasted my 2.5 hrs but got no beginning, middle and end of the story. What is this nonsense 🙄🙄"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "satyamdadhichh",
        "review_rating": "1",
        "review_title": "Most Pathetic Movie ever",
        "review_detailed_main": "If Bollywood combine all its worst movies then Race 3, Radhe and now Heropanti 2 .\n\nOne of the worst movie ever. This film has no plot. It's basically a series of set pieces featuring Tiger Shroff prancing, romancing, and dancing, when he is not mowing down bunches of baddies."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Vikky0007",
        "review_rating": "3",
        "review_title": "Kya bawaseer bana diye ho be",
        "review_detailed_main": "What is this movie??? Total waste of time and resources. Pathetic acting. No story. Just stupidity after stupidity. Idiotic sequences. WTF was this?? Runaway from this movie. Not even worth a second. Editing is so abysmal. No way this could be any kind of success. Oh my god what the hell was this?? Still just trying to understand. I think probably Nadiadwala has too much 'extra' money to burn??"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "inderjeetsingh-39114",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Please refund my money back...wasted my time and money 💰 as well....this is tigers one of the worst movie ever made... Tara was looking gorgeous.....please don't watch if you love your money.... I made a bad decision to choose this movie over runway 34....my friends went for runway 34...and they are satisfied....but for me...heropanti 2 is utterly disappointment."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mitularts",
        "review_rating": "1",
        "review_title": "Complete chutiya panti",
        "review_detailed_main": "No story Worst screenplay 3rd grade dialogues Waste of such a talented actors Navazuddin & Tiger Shroff.\n\nThis cannot make it to the any OTT platform to maintain the dignity of even those platforms.\n\nNever waste your time to even watch 10 minutes of this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ahmedqaim",
        "review_rating": "9",
        "review_title": "Eyes, Paralyze, Hypnotize",
        "review_detailed_main": "The dialogues, The acting, the action, its just explosive, Please note that its not for children its an R rated movie.\n\nThe special effects are special.\n\nEYES, Paralyze, Hypnotize, Life is full of surprise... The best dialogue ever.\n\nThe script is just epic and i say this with experience, it is a MUST WATCH, Your eyes need this movie.\n\nNawazuddin has OUT DONE himself...."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "keshavdhanuka",
        "review_rating": "1",
        "review_title": "Worst movie I've even seen !!!! Please don't waste money !!!",
        "review_detailed_main": "Even one star is too much for this movie. How can someone make such a pathetic movie no story complete stupidity. The hall was all empty and people began to leave the show before the interval. What remarks Bollywood is setting my making such pathetic movie. Completely waste of money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bedantabarman",
        "review_rating": "1",
        "review_title": "Hagne Wale ko agar hagne se pehle hagna mehsoos na ho toh kya hage?!",
        "review_detailed_main": "It seems like everyone starting from crew members to directors searched the best possible ways to make flop movie. And they have got par above their expectations.\n\nWhat a waste of Nawazuddin's acting! He did extremely well. Rest all are bound to face negative criticism.!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "unknownworldmember",
        "review_rating": "1",
        "review_title": "AKAL SE KACHCHE HO KYA😅SAMAJH NHI AATA",
        "review_detailed_main": "They only want to make money. People in the industry are not working on new ideas,coming with old stories. Bollywood is only focused on remaking old music. T Series has given the job of copying the masterpieces by adding some words.\n\nBollywood is full of nonsense nepotism.\n\nTiger ,good looks don't matter .There should be talent in this body.\n\nBollywood please put some sense in your movies with new ideas."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "dkgwmz",
        "review_rating": "1",
        "review_title": "Kaun he yeah loog kaha se chalta hein Inka itna dimagg...",
        "review_detailed_main": "Nothing nothing absolute garbage Tiger should Read script before doing movie & avoid doing this sort of torture movies he has huge potential but this sort of directors will ruin his potential."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sandeepmalhi-05856",
        "review_rating": "1",
        "review_title": "Someone stop Ahmed khan please",
        "review_detailed_main": "Good story idea.. given to the wrong director. Lost of words.. save your time.. watched it on prime. Forced myself to the finish.. my dad enjoyed it tho.. he did say tho, nice to watch nonsense like this once in a while.. that was a 70 plus year olds comments.\n\nAhmed khan, please stop yaar.. please 🙏🏽🙏🏽"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pratikjoshi-12751",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "Aisi ghatiya aur vahiyat movie banate kyu ho, na story, na acting, na koi sense. Why do you waste time and money on such films which don't have story."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ravieebtech",
        "review_rating": "1",
        "review_title": "Please don't reduce screens for other movies for garbage like these",
        "review_detailed_main": "Wasted a good weekend. I think they are intentionally pushing us away from Bollywood. It requires certain amount of courage to release such movies. Don't watch it. Please save your time and money. Don't put any effort for watching the movie because they have not put any effort in creating it. If possible please return my ticket price I will go and watch kgf2 again or will try my luck with runway 34."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "abhijitshil-23",
        "review_rating": "1",
        "review_title": "Flop at best level",
        "review_detailed_main": "No Content, no story, worst casting and direction.\n\nJust waste of 140 min.\n\nThat's the problem with BW Nowdays, no content, no proper story telling, worst direction, no proper dilogue's such a big flop,"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "markedwardsphotography",
        "review_rating": "10",
        "review_title": "DRONE cinematography Pilot",
        "review_detailed_main": "I was the official movie Drone Pilot: Mark Edwards / CAA licensed Pilot.\n\nThere was many locations and the weather played an important part during Filming. My YouTube Channel is ' Mark Edwards Edwards Photography \" if anyone wishes to contact me for future filming work."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jddqzzzkq",
        "review_rating": "1",
        "review_title": "Don't waste your time😭😭😭 I made that mistake for you guys",
        "review_detailed_main": "Worst money I have seen in my life 😭😭 I wasted my hard earned money😭 people started to leave within first 20mins 😭 I only stayed because I wanted to get my moneys worth but I only lasted 40 mins 😅😂😂😂 kasme don't go guys Plzzz guys Don't do it Watch Jonny sins fix taps and sinks but don't watch this money 😅😭😭"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kakolifurnitures",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Don't even watch pirated version... It'll be waste of your data too.. 😪\n\nAfter watching WAR, I thought Tiger bhai has learnt acting and it'll be Seen in his upcoming movies... But then the legendary director Ahmed Khan came to destroy my hopes... I'm also a fan of Tiger bhai... But fact is fact\n\nThis movie is just a combination of some memes and famous scenes from some hit movies(like transformation scene in Vedalam)... Worst movie Ihv ever seen! 😑😑"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "akidstuakau",
        "review_rating": "1",
        "review_title": "ZERO STAR IS THE BEST RATING FOR THIS MOVIE",
        "review_detailed_main": "I FEEL SO BAD FOR GIVING EVEN ONE STAR. THIS FILM DESERVES ZERO STAR.\n\nIF SOMEONE CAN SEE 30 MINUTES THIS MOVIE, SHOULD BE AWARDED RS 500 AS PRIZE MONEY.\n\nTOTAL WASTE OF TIME.\n\nTIGER SHROFF SHOULD LEARN ACTING INSTEAD OF GOING TO MAZAR."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "castingcircle-96-360157",
        "review_rating": "1",
        "review_title": "Zeropanti !",
        "review_detailed_main": "Bollywood makers again taking the audience for a royal ride and a maha boring one. Inane storyline ,Tiger Shroff sleepwalks throughout the film. His action scenes look so repetitive , the same flying through air, jump kicks and body flips. It might as well be from Baaghi 3 or any of his previous films. Nawaz gets some fun to his character and plays it well. The music is okay. If this is the way they continue Bollywood days are numbered."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ursamiullah",
        "review_rating": "1",
        "review_title": "Fraud",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "wwwsaikatdevroy",
        "review_rating": "1",
        "review_title": "Totally Worthless movie . Bollywood movies are not be good like past movies . There are no reality and not follow physics rule.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "zeeshan-48543",
        "review_rating": "2",
        "review_title": "Another mediocre film by tiger",
        "review_detailed_main": "I don't know how tiger chooses his movies... DIRECTOR: There jumps, high kicks and flips in the movie.. and story is... TIGER: Dont tell me story.. i am in.\n\nIf you can make a cinema it doesnt mean that you can serve anything..\n\nGood cinematic experience is our right and hindi film industry is spoiling ot."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sameerlodaya",
        "review_rating": "1",
        "review_title": "Zeropanti",
        "review_detailed_main": "Sameer lodaya\n\nThe movie should be titled as Zeropanti\n\nWhat has happened to ahmed and tiger are they same makers of heropanti 1..tiger is fighting in suit and you expect the viewers to accept this..to make it worst they brought Tara in the movie..this time even kids did not like it..what is the story and where it is going even the makers did not know it..boring action,pathetic songs,roadside dialogues,ugly tara this all you will get to see in this movie\n\nOnly good thing about the movie is NAWAZ atleast we saw him in new character\n\nThey could have saved the movie by releasing on OTT."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "prakshobhm",
        "review_rating": "10",
        "review_title": "Real Hero",
        "review_detailed_main": "This is something new which the audiences can learn from the movie that how the best education we get from the from by protecting our account from the hackers. Tiger Shroff is a inspiration for all the youth because his hardworking, dashing stunts and incredible body. Tiger Shroff has better moves while stunning and his martial arts skills are best. I like his dance, acting and dialogue delivery which is the best among every thing. How voice modulation has improved a lot than heropanti. His looks seems that he has matured. I wish that this kind of movies run smoothly to get some new learning to the audiences."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "airborne-13006",
        "review_rating": "1",
        "review_title": "Most horrendous Movie",
        "review_detailed_main": "This is the most horrendous movies ever made by Bollywood. I am confident the way level of Bollywood is falling it won't exist in few years. Their has to be a total revamp of Hindi film industry. This movie is a classic example of total Flop."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jantheprajwal",
        "review_rating": "1",
        "review_title": "Choti bacchi ho kyaa???",
        "review_detailed_main": "Never dare to watch this garbage Itni gandhi movie poori life me nhi dekha me kya yar thodi sharm karo...... Paisa barbad bc.... Never dare to watch this garbage Itni gandhi movie poori life me nhi dekha me kya yar thodi sharm karo...... Paisa barbad bc...."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "subirgambhir",
        "review_rating": "1",
        "review_title": "Mental Torture. Please avoid!",
        "review_detailed_main": "No story, No continuity, No relation between two scenes. Please save your money. Do not watch it for free. You will get a nervous breakdown trying to figure out or make sense of what exactly is going on! Avoid!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pawan-tiwari",
        "review_rating": "1",
        "review_title": "Hey Bollywood, India and audience has changed",
        "review_detailed_main": "But bollywood is still the same dumb. Its high time, you grow up else will be gone. How do you even think of making such movies, the acting of amrita singh and that sanaya, aweful. The fingt scene, which could have been a reason to watch, you have shot in such an idiotic way, i gave up there."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kiran353",
        "review_rating": "2",
        "review_title": "Heropanti",
        "review_detailed_main": "What a Tatti movie. Undoubtedly, the worst movie of this year. The hero only jumps like a monkey unnecessarily during the fight scenes . It's the only movie wherein one of the most versatile actor of Bollywood Nawazuddin Siddiqui , was unbearable to watch, which speaks of the poor script and direction. Nobody should watch the movie , even if a person has nothing to do in his life. Tatti movie Only Desi need to do a YouTube video to show how good the movie was . Oh hello! No expression by the actor , all biceps, triceps, abs, forceps and no acting . The movie was so dumb , it showed a jeep being rammed into a train and steering right into the compartment , what a dumb movie by the director."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "anishaadiga",
        "review_rating": "1",
        "review_title": "Same old typical kiddish movie..",
        "review_detailed_main": "Waste of time and money. Bollywood is not evolving., no good scrupt or story. Worst overacting and nothing more.............better to watch south actors films ...."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "lokeshkhatkar",
        "review_rating": "1",
        "review_title": "Na deke",
        "review_detailed_main": "Very bakwas movie, iti bakwas movie Is se acha aap cartoon dek leve.\n\nJsjsjkfjfkkdks Kskskkfjfkfmskkf Isiocofoofks Isidhvehaoofndbs Isidhsgbajcoodjf Bshdjkfiskbzgshjskf Bsdkebisiskfisjjs Nai aaya na samaj aase hi ye movie he 😂😂 Nai aaygi samaj Acting to he hi nai Only six pack, iska kya achar dale\n\nIn the last very bakwas movie of the year."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "amiratmaniya-73171",
        "review_rating": "1",
        "review_title": "Bhangar Movie ever",
        "review_detailed_main": "Bhangar movie , bhangar movie is not enough for this movie, I mean seriously, studio, tiger shorff, navazudin sir and all other actors could have done so much more, but there is no logic in this film, anyone will showup from anywhere and some random dialogue and gose anywhere that's it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "iamdeepujayakumar",
        "review_rating": "1",
        "review_title": "Extremely bad",
        "review_detailed_main": "By far the worst movie that I watched was bhaagi 3 ,now it has an equal, if someone ask you what is the definition of bad just tell heropanti 2 , worst in almost every segment Either the heroine is producers daughter or girlfriend,her acting is straight up garbage, tiger is basically the same like every movie ,full time waste."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mehedicrime",
        "review_rating": "1",
        "review_title": "Lost my brain, kidney, liver.",
        "review_detailed_main": "After watch this movie I lost my brain, eye, kidney, liver. Please watch at your own risk... Why people watch this movie I Don't know. Such a B grade Bollywood movie. Never expect that at this time this type of movie will come. This is a Disaster. I think tiger shroff should leave the acting."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "maxdhada",
        "review_rating": "2",
        "review_title": "do not waste your time",
        "review_detailed_main": "Worst movie. No story, same acting as previous movies story not connect with people. Bollywood need good contain to make good movies.\n\nSuggestion to tiger shroff as he is good actor please do not work with same director repeatedly other wise you have no future in bollywood."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kgfram",
        "review_rating": "1",
        "review_title": "I am kattar hindu",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kjazz-73836",
        "review_rating": "1",
        "review_title": "Choti bachi ho kya",
        "review_detailed_main": "Very very very bad movie.i dont like it.\n\nI avoid. Bollywood bollywood bollywood i Dont⛔ like it I avoid But south indian movie likes me i cant avoid."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "symoongalibe",
        "review_rating": "1",
        "review_title": "Why? Waste of time!",
        "review_detailed_main": "Is this is a movie?😀 Lol the girl don't know the name even,,,worst acting ever😀 Nawazuddin acting was perfect but the whole thing what happened 😀😀😀😁 Troll movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shwetank-54723",
        "review_rating": "1",
        "review_title": "An assault on senses!",
        "review_detailed_main": "This movie is an assault on senses. Ahmed Khan should be banned from ever directing a movie. Rajat arora and sajid nadiadwala should publicly apologize for writing this story and I've not even reached over-acting, illogical vfx and songs yet. Please do not waste those minutes of your life."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "khusbusamia",
        "review_rating": "1",
        "review_title": "this is tatti",
        "review_detailed_main": "Never watched such a bad movie in my life. Worst is a small word for this. Ye log paisa laga k tatti kiyun banate hai vhai?? Why?? Tiger should not even counted as actor tbh. Isse bhadda or koyi nehi."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "uditskvjpr",
        "review_rating": "1",
        "review_title": "The heropanti 2 is very boring and 0 /10 star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "deeps-53921",
        "review_rating": "1",
        "review_title": "Bad Movie",
        "review_detailed_main": "Same stunts same things.. What joke now bwood.\n\nThey dont have contents.\n\nTelling about this movie, nothing to say good.\n\nBad direction , same actions (can see drm all his old movies) , they didn't utilise navazudin also.."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "preetisinha07",
        "review_rating": "1",
        "review_title": "Worst movie ever!",
        "review_detailed_main": "I watched literally 5 minutes of the movie and I couldn't force myself to watch the rest of it. Cringe worthy performance , dubbing, dialogues, direction - I found all of this in 5 minutes.\n\nEeeewwww!!!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Couziambatman",
        "review_rating": "1",
        "review_title": "Wake-up Bollywood!",
        "review_detailed_main": "As viewers we should wake-up and start acting up on movies like this. Not so long ago a decent action movie was suffered at the theatre and now this movie comes out and people are rushing in to watch? Seriously this torture of a movie deserves to be kept untouched. What were the makers thinking while making a movie as such at this day and age.? Bollywood sees their audience as dumb. We should not let this happen again, we should appreciate good movies and let stinky poo poo like this to rotten."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vj-51334",
        "review_rating": "1",
        "review_title": "30 mins max",
        "review_detailed_main": "I could not tolerate the movie for more than 30 mins. Can compete for worst movie of all time. Expect better from maker of movie like Ghajini. Please do not even attempt to watch and waste your time.."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ghanishthdhama",
        "review_rating": "1",
        "review_title": "Worst direction of this movie",
        "review_detailed_main": "This is a humble request to Ahmed Khan sir, please do not ruin telented persons by wasting your money by making this types of movies. Really these type of movies are the reason behind all the hate the Bollywood is facing. This movie's plot had the potential to make an amazing picture but really we are verry disappointed with this type of movie. This movie was just like a two hour trailer, I mean there were so many jumpcuts.\n\nWorst movie of bollywood 😡😡😡😡😡.\n\nAnd sir please once again don't waste money in the making of this type of movies 🙏🙏 I mean you have spend 70 crores in the making of this , please sir Tiger Shroff has a good potential in him please use that potential otherwise these type of movies will finish his career🙏🙏🙏🙏🙏🙏🙏🙏.\n\nAnd I am sorry is anyone is offended."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ankitduttaad",
        "review_rating": "1",
        "review_title": "Worst till date!",
        "review_detailed_main": "Worst movie till date. The actors were fine. The movie- story, cinematography, editing and all that was bad. Just taking an action hero and a hot actress doesn't do the job."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Perspicuity1",
        "review_rating": "1",
        "review_title": "Tiger Shroff and Ahmed Khan should stick to doing what they are best at, because if they continue to make movies, it would be a great disservice to humanity.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sumonahmmed-96810",
        "review_rating": "1",
        "review_title": "One of The Worst Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "abhijeetf-48771",
        "review_rating": "1",
        "review_title": "sheer mental torture",
        "review_detailed_main": "I feel I am being generous by giving it one star.. It has to be the epitome of one of the most nonsense movie ever made. It will top in all aspects of ridiculousness. Worst acting, worst cinematography, worst direction, worst cheesy dialogues, worst BGM, worst story. Please spare us of such movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pradeepgoyalk",
        "review_rating": "1",
        "review_title": "Blunder from writer and Director",
        "review_detailed_main": "Writer did blunder by writing such movie but Producer did biggest blunder by investing on such story.\n\nAnother biggest lose end is Tara Sutaria - such helpless acting!!!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "erumkhan1981",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "Omg this film is absolutely ridiculous! Who thought of wasting so much money to make this piece of work! If they had spend some time on the content, they would've had a chance but this has failed in all departments except for glamour and toned bodies. Far out!!!\n\nPlease Bollywood what's going on, where is the storyline, where is the common sense and quality script, where is the sophistication of dialogue delivery, the emotions and so much more. Why the focus on over acting, unnecessary graphics zabardasti kay, glamorous clothes, hair and makeup when your content is so empty? Your movie industry has reached a new low.\n\nVery sad."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "gajendervermaverma",
        "review_rating": "2",
        "review_title": "Very disappointed",
        "review_detailed_main": "He acted as super spy or computer genius but blocking bullets with elbow, got one in the bum but no bleeding and running as if never got shot. The girl randomly kissing and over reacting. It feels like they wanted the movie to fail drastically - don't they have proper logical genuine movie stories with actions which is balanced with brain ? Nawazuddin acting was atleast good but he should be careful choosing such cheesy stories."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mrityun2000",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "I don't really write reviews. I usually give rating and done. But this movie was such a pain to watch that I felt like stopping others to watch this movie. Very poor and absurd plot."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nagendraram-17416",
        "review_rating": "1",
        "review_title": "Very very worst movie ever I watch.",
        "review_detailed_main": "Bollywood having very low Intectuality, by watching this movie. In Bollywood having no humanity based movies. Even not having scientific temperamental moives. Bollywood always spread superstitious, blindfaith, irrationality, religious-hatred, Inhuman mentality, Inhuman activities etc. Bollywood having no real life moives. In India Upper cast people called Savarna having Inhuman mentality & these people always spreading FalseHateViolence. FalseHateViolence is also spreading by Bollywood. So that every Intectual people very disappointed with Bollywood & Bollywood actors, actress, movies."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vikychops",
        "review_rating": "1",
        "review_title": "Appeasement movie",
        "review_detailed_main": "Unnecessary requirement of appeasement song.\n\nCharacter names, acting, plot, storyline everything was pathetic.\n\nAction was like worse than a comic movie.\n\nVery weak story."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "skhalils",
        "review_rating": "1",
        "review_title": "What an absolute garbage! Not expected from Nawazuddin",
        "review_detailed_main": "Utter nonsense, overacting and a rotten touch of nepotism. Looks like this is a downfall for Nawazuddin career. As for Tiger and Tara, they didn't have any career back then and looks like they would be soon taken off screen.\n\nProducers should stop investing in such stories and actors.\n\nBollywood is getting worse, day by day. Box-office should take lesson or two from south-korean masterpieces else it would take mere some time they would be vanished.\n\nJackie Shroff should be ashamed of his son. He should open a \"mithai shop\" or a gym where tiger could work with his overacting."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jayramgaonkar",
        "review_rating": "1",
        "review_title": "Watch circus to see a jumping guy without expressions...!!!",
        "review_detailed_main": "IMDb should allow zero stars rating for such garbage.\n\nNo doubt Tiger Shroff is a bad actor but everything about this movie is pathetic. The storyline, acting, songs I am not even talking about the technical stuff. Then they have introduced some twists which makes no sense. Watching this movie is torturing yourself. Everything Is cringy. I don't know what they were trying to do with Nawazuddin Siddiqui. It felt like director told every cast in the film to do what they want to do. Even kids will come up with better story than this.\n\nWe don't go to theatres to see gymnastics we need storytelling, convincing acting and good direction. Bollywood is making movie from selling point of view, good that people have realised this and stopped watching garbage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ankur-49604",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "I could not find less than 1 rating therefore had to give 1. I could not understand what it was trying to show. It was total waste of time. I had to fast forward the movie to complete it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vicsac21",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "It was painful to watch this movie.\n\nTiger Shroff with full attitude and zero acting. Means many acting schools are there in Mumbai. Why not to learn acting skills?\n\nNo need to talk about actress.\n\nNawazuddin repeating his previous acts.\n\nFilm is only made to lure the young audience who is fascinated towards action, cars, style etc. But totally hopeless."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "402rahuja",
        "review_rating": "1",
        "review_title": "Ahhh pain to brain is what this movie is",
        "review_detailed_main": "1 star only because of nawazuddin siddiqui sir. Tiger as usual did only meaningless stunts with no acting or any facial expressions. I don't know how are such movies with zero sense even released? Why is he dancing with a bullet wound in his leg? Why is he not dead after so many grenades blew him up? It's high time/ Bollywood should work on realistic movies and not such waste of time and money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "waqasgulzar",
        "review_rating": "1",
        "review_title": "WTF!!",
        "review_detailed_main": "Unbelievably pathetic! How lame does Bollywood think its audience is!?? All actors r made to look stupid! Couldn't go fast the first action scene thts says alot watching Tiger's film :@"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "prinshshukla",
        "review_rating": "1",
        "review_title": "very overrated movie",
        "review_detailed_main": "The songs in this film are terrible. 1st rate torture if I may. They only make the film more unbearable. Can't believe AR Rahman worked on the music of this film. Even the original whistle baja is so good compared to this. This one is so bad I can't even describe it in words. Nawazuddin Siddiqui is doing his same acting from Kick. So in short this film offers nothing new. Pathetic acting, dialogues and their delivery, worst songs, action that you've already seen a million times and no good story at all (horrible in fact), I wouldn't recommend this film even to my debtors. Don't pay me back but also don't waste my money on such horrible films."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kunalsonkamble",
        "review_rating": "1",
        "review_title": "Waste of time . Ban ahmed khan. Worst story and direction.",
        "review_detailed_main": "Waste of time . Ban ahmed khan. Worst story and direction. Story is baseless . Just waste of times.glamour should be part of story not the story itself. Fancy cars , beautiful location are the ornaments which can be used in beautification but the basic necessities must be there."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "cs_rahul_prasad",
        "review_rating": "1",
        "review_title": "Tiger Shroff's Heropanti 2 is Story Less, Plot Less & Worth Less !!!",
        "review_detailed_main": "Babloo Ranawat (Tiger Shroff), a genius hacker, is tasked with tracking down Laila (Nawazuddin Siddiqui), the mastermind behind the world's largest cybercrime yet to occur.\n\nWith ripping muscles, crisp six-pack abs, high-octane action, and double dhamaka, Babloo is back with his Heropanti. To be honest, the premise is predictable: Babloo is an unstoppable one-man army on a mission to track down the baddies and kick their a**es off in order to protect the world from cyber-crime. But apart from this basic plotline, Sajid Nadiadwala's franchise Heropanti 2, serves up a lot more for the action-movie buffs.\n\nAfter directing the Baaghi franchise, Ahmed Khan reunites with Tiger Shroff. And, as with his previous films, the story takes a back seat to the prospect of watching a hot hunk engage in a high-octane stunt duel. The first half is a little off-kilter and takes a while to settle in, post-interval one can expect a lot of stunts, thrills, twists and just enough masala and explosions to keep you entertained. The film excels in action set pieces by Ram Chella- Lakshman Chella, Parvez Shaikh & Kecha Khamphakdee, but it also delivers some unbelievable action choreography in which the hero and even his phone survive a major explosion. Eventually, Rajat Arora's writing falls flat and takes the audience's sensibility for granted. The story tries to be overwhelmingly larger than life, but in the process, it loses logic and becomes preposterous.\n\nLaila, a hobbyist magician and cybercrime kingpin, is on the verge of robbing the Indian government. CBI has hired Babloo to prevent this calamitous event from happening. Will Babloo be able to catch Laila, who always seems to be ten steps ahead of everyone? Will his love, Inaaya Saran (Tara Sutaria), a self-made billionaire and Laila's sister, get him into more trouble and become a roadblock for him? Or is it simply a honey trap for Babloo or vice versa? Things reveal themselves in layers as the story progresses, keeping the audience engaged.\n\nTo make it a Hollywood-style movie, Ahmed Khan and his action team have designed the stunts of the film to recreate thrills that you'd usually watch in movies like Mission Impossible and Fast And Furious. And while the action is relentless and the dialoguebaazi is entertaining, the predictable storytelling in this film leaves a lot to be desired.\n\nTiger's smouldering on-screen intensity, as well as the high-flying action, are both fascinating. His seeti-maar dialogue, 'sabko aati nahi, meri jaati nahi,' is a perfect fit for his personality and the stunts. Tara's role is limited to mostly managing to up the glamour quotient of the movie. She is seen running around in high heels with Babloo, which is too tough to pull off in real life. Together, Tiger and Tara look good on-screen, but they don't have that sizzling chemistry to talk about. Nawazuddin Siddiqui is in top form in playing a negative role as Laila. He literally hypnotises the characters in the film and leaves the audience stunned with his superb act. Amrita Singh adds a sense of humour to the narrative.\n\nAR Rahman's score heightens the drama's feel, but every song drops randomly. Among the rest of the songs 'Whistle Baja 2.0' is the most upbeat number, but you'll have to wait until the end of the movie to hear it. Tiger makes his singing debut with the song 'Miss Hairan,' which is quite surprising.\n\nLike the typical entertainer, Heropanti 2 offers a little bit of everything-action, drama, music, romance and exotic locations. The screenplay makes room for a mix of commercial movie elements, but where the film scores is its action department, which gives Tiger's fans ample to dig into. Looking for anything more than that, like a story, this one is not for you."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "alomziadur",
        "review_rating": "1",
        "review_title": "Worst movie don't watch it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "puneetarora-99441",
        "review_rating": "1",
        "review_title": "I would rate it 0 if there was one..",
        "review_detailed_main": "Pathetic movie..full time waste even if i watched it for free.beware of this movie..i dont understand why actor like tiger shroff even signed this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sibasissinha",
        "review_rating": "1",
        "review_title": "Worst Movie, I HAVE EVER SEEN.",
        "review_detailed_main": "Worst Movie of 2022. I wish, I wold have given NEGATIVE RATING.\n\nDirection less direction, No story, No plot, No screenplay, No acting, nothing nothing nothing..............."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "karmagurungaug",
        "review_rating": "1",
        "review_title": "Bollywood is going down",
        "review_detailed_main": "Finally i can see that nepotism era is coming to an end. There will be no more royal treatments for so called sons and daughters of bollywood mafias.. You can compare these bollywood movies with south movies and can find vast difference .. The actors in this movie were bang average with crap story lines,"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "santoshjai-04055",
        "review_rating": "1",
        "review_title": "Worst timepass movie",
        "review_detailed_main": "One of the worst movie in the years, brainless Ahmed Khan keep making sht movie like that short live Bollyw💩od. Audience please don't waste your money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "chand-suhas",
        "review_rating": "1",
        "review_title": "Pulse scam indeed.",
        "review_detailed_main": "Pulse scam indeed. Blindly believing to have known the pulse of the audience and delivering such an atrocious film to rob them off their time and money.\n\nWhat more to criticize of this silly film that really thinks itself to be entertaining. The jokes seems forced and so does the action. Even the scenes that they lifted off from the south films have zero sync with the actual film here. One cannot simply copy Valimai's innocent/devilish switch to elevate the hero without any need or a terrific bgm.\n\nWhat we get is a bundle of illogical scenes and over the top silliness while handling the premise that involves bringing down a criminal using an hacker while the said hacker is targeted under witness protection. This over eccentric Nawazuddin as Laila looks as out of place as Tiger Shroff as Babloo.\n\nMCBC - Definitely not gonna side with \"Main Chali Bye Cutie\"."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ihtishamhussain",
        "review_rating": "1",
        "review_title": "Too bad",
        "review_detailed_main": "This is one of the worst movies I've ever watched. Tara has overreacted too much all over the movie. The story is also worse, it's better to watch something else than this."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "munnahossainshanto",
        "review_rating": "1",
        "review_title": "This movie is one of the worst movie that I have seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kausik-tanik",
        "review_rating": "1",
        "review_title": "Waste management",
        "review_detailed_main": "Well who made this inorganic waste?\n\nLearn from regional films You guys are putting death sentence to hindi movie. It was so tiring The one star belongs to nawazuddin s avt But that too was sick How long such a high calibre actor will be misused for doing these idiotic senseless acts?"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pulkitpaliwal-96562",
        "review_rating": "1",
        "review_title": "Worst movie ever made",
        "review_detailed_main": "Heropanti 2 is the worst movie ever made in Bollywood. No story , no acting , worst songs , and many more such things . And over exaggerated dialogue. And the songs of this movie are also very irritating. And acting of tiger and Tara is worse . Highly recommend to not watch this movie 🙂"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "goravsingal",
        "review_rating": "1",
        "review_title": "Feeling bad for Nawazuddin Siddiqui - Why did he chose this - Too poor movie",
        "review_detailed_main": "I usually watch any movie, any bad movie.\n\nBut, I really couldn't watch this movie. Its so pathetic, logic-less movie.\n\nHow can these actors take part of these kind of movies. Totally waste of time.\n\nGo watch TVF movies instead. They are far-far better than bollywood. Only Nawazuddin knew how to act, but he got such a poor role. Everybody else, is so poor in acting."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ronsingh-77874",
        "review_rating": "1",
        "review_title": "TRASH may lord have mercy on your soul",
        "review_detailed_main": "First of all, how do I go about reviewing this movie? Please note the following 1. I am 43 years old 2. I have watched hundreds of bollywood, hollywood, tollywood movies 3. The first time I am reviewing a movie 4. The worst movie I have ever seen in my lifetime. I think children produced, and directed this movie. I can not imagine a grown adult could produce such unbelievable trash. I only finished watching this movie because it was like a horrifying car accident.\n\nRIP tiger shroff to your acting career Anyone watching trash May Lord have mercy on your soul."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nathbhaskar-98972",
        "review_rating": "1",
        "review_title": "Totally disappointed, wastes of time by watching.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kapilgurjar",
        "review_rating": "2",
        "review_title": "Disappointed",
        "review_detailed_main": "Tiger should properly check story before signing a film.....DISAPPOINTED Tigger...Public understand your gener...Action and romance...but audience getting matured now, thanks to Shahrukh and Salman.... Audience don't appreciate scraps...Please don't disappoint again."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "drkishanmistry",
        "review_rating": "1",
        "review_title": "Worst movie of Indian Cinema",
        "review_detailed_main": "The movie does not have a head or a tail. No meaningful message nor entertainment. I am surprised that such good actors like Tiger Shroff and Nawazudin Siddiqi agreed to act in this movie. Total waste of 2 hours and 20 minutes of my life."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "purpletrades",
        "review_rating": "1",
        "review_title": "Third class film",
        "review_detailed_main": "Waste of time Such a b-grade action and movie.\n\nPoor direction Worst acting and such a plain story Even chota bhim is better than this movie.\n\nDon't watch it and waste your time You will regret it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mymudit-64859",
        "review_rating": "1",
        "review_title": "Hats off to critics who goes to cinema to watch these kind of movies .",
        "review_detailed_main": "After watching for around 1hr , I was like why I wasted my time on this and had to quit in between.\n\nNobody love JABARDASTI k songs Action - 5/10 Story - 3/10 Acting: Lead actress - 3/10 Lead actor - 5/10."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "akhil027",
        "review_rating": "1",
        "review_title": "What a waste of money!",
        "review_detailed_main": "This is the most ridiculous, biggest trainwreck of all time. Even a 10 year old can come up with something better than this. Everyone knows Tiger is only good with stunts and dance. But this movie doesn't even gives you that. The action scenes are a disgrace to Indian cinema. It's like some B grade writer wrote and directed the movie with a huge budget. Tara Sutaria is only an eye candy, but the moment she opens her mouth, we're done. I can't believe somebody actually thought her role would be funny. Dear Tara, please stick to modelling. Tiger's punch lines are cringe at its peak.\n\nThe biggest shock is AR Rahman's downfall. This is one of his worst work. I think he just had some extra tunes which he sold to the producer without knowing about the content of the movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "geetanigam",
        "review_rating": "1",
        "review_title": "nepotism movie lollll",
        "review_detailed_main": "Tiger shroff.... Nepotism, Nepotism, Nepotism... Acting bhi Sikh Le bhai.. abs nahi bhi rahenge toh challenge.. I really thought it would be some movie, but after watching content oriented movies like Kashmir Files and KGF 2. Really feel sorry as to why you signed this film? Why? No content, and director was the worst... Bhai abs, thighs, bosom aur kya? Audiences ka patience?"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "eskundu",
        "review_rating": "1",
        "review_title": "\"Choti Bachhi ho kya\" was the best moment in the whole movie.",
        "review_detailed_main": "Rubbish.... A pathetic Joke...... This directors and scripts writers should be banned for life. Actors also should be banned for signing this kind of nonsense."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "caguptapriyanka",
        "review_rating": "1",
        "review_title": "Negative raise to the power infinity rating..maha bakwaas movie",
        "review_detailed_main": "Maha ghatiya movie , ekdum bakwas . I hardly leave any movie in middle ..but I had to leave this one ..no emotions , all nonsense stuff happening , only reason I tolerated it for 1hour was nawajuddin . I wish there was a dislike option and negative rating option here . Pls don't waste ur time watching this ..we watched thinking at least we will laugh at silly action sequences , but they were pathetic too ..don't understand why tiger shroff wastes his talent in such garbage projects . Highly disappointed."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vs-53277",
        "review_rating": "1",
        "review_title": "Time waste, Bogus movie",
        "review_detailed_main": "I seriously feel like I have burned my 800 rupee watching this movie and have wasted my Sunday for this 3rd class movie. Tiger shroff doesn't know A of Acting."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rakeshmaru-02435",
        "review_rating": "4",
        "review_title": "Waste of time",
        "review_detailed_main": "Heropanti 2 is a mediocre, boring Bollywood film. Tiger has a great body and can perform feats, but he lacks acting ability. This isn't the '90s, when you could impress audiences with songs and dancing moves despite bad narratives. People require maturity."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kingdas-42522",
        "review_rating": "1",
        "review_title": "Worst movie ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nitinkumarpatel-30467",
        "review_rating": "1",
        "review_title": "Waste of time, money and energy.",
        "review_detailed_main": "After watching this movie...le me to bollywood---\"ye sare ke sare mil ke bewakoof bane rhe h madarfod k bachhe\".waste of time, energy and money.i won't watch the movie even someone gives me money to watch it😂😂😂."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "yasirmahmood-45271",
        "review_rating": "1",
        "review_title": "Peace of Waste",
        "review_detailed_main": "Tiger shroff is such a boring character same lines same jumps same stunts same acts such a poor film and thanks people are understanding now the real face of Bollywood which is no more sorry from pak."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rohit_vit2020",
        "review_rating": "1",
        "review_title": "Worst forceful unnecessary",
        "review_detailed_main": "Worst, forceful, unnecessary, non-comical, these are the terms that can be easily associated with this movie. Such a crap. Had to terminate watching within first 20mins of the film."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ramayadav-56866",
        "review_rating": "1",
        "review_title": "this is movie??",
        "review_detailed_main": "The songs in this film are terrible. 1st rate torture if I may. They only make the film more unbearable. Can't believe AR Rahman worked on the music of this film. Even the original whistle baja is so good compared to this. This one is so bad I can't even describe it in words. Nawazuddin Siddiqui is doing his same acting from Kick. So in short this film offers nothing new. Pathetic acting,"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "suhaschikhalikar",
        "review_rating": "1",
        "review_title": "Choti bacchi ho kya 😂",
        "review_detailed_main": "Don't waste your time on giving explanation why you give 1 star, just say \"choti baachi ho kya! Smj ni aata\" & move on.. 😂\n\nThey think audience is as same as 2010 were ppl used to get entertained at any aaltu faltu story line & acting lmao."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kchanel-22697",
        "review_rating": "1",
        "review_title": "Waste of my time",
        "review_detailed_main": "This movie was so bad. It was stupid, awful zabardasti ki comedy. I have never left a review for a bad movie. This was so senseless I had to go out of my way to leave a review. The first heropanti was way better. If you have nothing to do, even then don't watch it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "safiyyah-29184",
        "review_rating": "1",
        "review_title": "I AM SHOCKED WITH WHAT I WATCHED",
        "review_detailed_main": "I am a huge Tiger shroff lover I was waiting his movie since bhaagi3 released and I watched it, soon as I knew this one was coming out I was so excited to watch It in UK however I couldn't believe my eyes what I watched this time even Nawaz Uddin Saddiqui couldn't even save the movie. Tara had the worst acting and dialogues sounded cheap. Tiger shroff clothing looked very similar to movies Bhaagi3, and War. I felt like Tiger was trying to be Hritck at times of the movie which was a put off. England was portrayed as some cheap place all about sex, party and something that its not the nurse scene was weird doctor's don't wear porn clothing in real life.\n\nIt's was atrocious I've actually been put off Tiger shroff this time so badly.\n\nLiterally what the hell was this who directed and wrote the rubbish script for the movie because literally done a good job putting Tigers career in the bin Tara was finished anyway but here goes out to Nepotism again we loose a great actor like Shushant and we get replacement with a clown!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "dimitrz",
        "review_rating": "2",
        "review_title": "Cheap copy of Karan Johar movies",
        "review_detailed_main": "And that itself is saying a lot.\n\n3 or 4 times while watching this movie I had to recheck if this was a Karan Johar movie or a Sajid Nadiadwala movie. Seemed more like you are watching a poor remake of Student of the Year and that itself is saying a lot.\n\nHeropanti 1 was such a decent movie, I loved watching it , Heropanti 2 is pathetic to the core.\n\nSongs less said the better , seemed as if they were forcefully added ,\n\nI feel sorry and angry at Tiger at same time for doing these kinds of stupid movies, the guy has it in him to do good movies yet for some reason he only chooses craps like Student of the year 2 , Heropanti 2 etc."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shiplum",
        "review_rating": "1",
        "review_title": "The worst movie of 2022 - Yet another Baaghi sequel movie, with another name",
        "review_detailed_main": "Fake acting, worst storyline, worst performances by Nawazuddin Siddiqui, Tiger Shroff and Tara Sutaria. The worst part of the movie is the fake acting of various stars, like they were beaten up and forced to utter words, and fake emotions."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shahed-hussain",
        "review_rating": "1",
        "review_title": "Bollywood RIP!!!",
        "review_detailed_main": "Seriously what a waste of time. Its boring with lame story script, so predictable and was thinking why didn't i watch a south movie instead.\n\nCan't remember watching a decent Bollywood movie in the last couple of years.\n\nSouth movies are the real gem of Indian cinema and i can't see Bollywood catching them in the next few decades."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "meymama",
        "review_rating": "2",
        "review_title": "Very bored",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kkunal-08693",
        "review_rating": "1",
        "review_title": "No concept.. Worst Acting",
        "review_detailed_main": "Even not a good action script. Totally Time waste. Bad Acting. Bad Editing... dance not matching with music.. Worst dialogues. Don't watch this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "prasadk-37281",
        "review_rating": "1",
        "review_title": "Waste of time..Torture",
        "review_detailed_main": "Pathetic... disgusting and a torture nobody should endure. A big no. Tara sutaria is disgusting with her antics and keeps on irritating tiger Shroff. Too much of violence."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "goldenmanish",
        "review_rating": "1",
        "review_title": "Total Bakwaas. Pathetic Movie",
        "review_detailed_main": "When they make such movies, I wonder what they must be thinking. I think when they make such movies they degrade the audience's perspective. They believe that audience would love such a movie. So let me tell you, the makers, you are wrong. Stop taking us for a ride. Either you do not know what the audience wants, or either you love such nonsensical, full of stunts movies, with cars flying here and there. Come on have some sense. Grow up!\n\nTotal waste of actors. Tiger Shroff should think twice before signing such movies. The actress looks hot. But the dialogues given to them were too bad."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jituwipro",
        "review_rating": "1",
        "review_title": "Can a movie be more stupid than this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mazran-92803",
        "review_rating": "2",
        "review_title": "Is this a JOKE?",
        "review_detailed_main": "Hey, guys I normally appreciate most of the work of creation, but this movie is like watching a third-grade cartoon movie. It is visible that very less effort has been put in while making this film.\n\nFEW good points 1) a colorful movie.\n\n2) looks like a good amount of money was spent on the film.\n\n3) good action and dance moves.\n\nFew Bad Points.\n\n1) Story makes very less or no sense and looks like a bad piece of direction or poor editing.\n\n2) Director tried to make storytelling intelligent by implementing Back and forth in the timeline but he failed because it looks broken.\n\n3) not any chemistry is visible between characters, seems like the characters just reading their scripts.\n\n4) dialogues look senseless and very poorly written and also they are implemented very badly between scenes.\n\nAnyways I have watched this movie on OTT hence I have just wasted my time not money. GOOD luck guys."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bislaarun-43324",
        "review_rating": "1",
        "review_title": "Never seen anything worse. Ever!",
        "review_detailed_main": "Pls don't waste time watching this movie! It's such a shame - I am a big fan of Bollywood cinema, but watching this movie made me question my choices in life. Every second felt wasted! :("
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ibdpiskillinglife",
        "review_rating": "1",
        "review_title": "I was searching this film in IMDB as Zeropanti 2 instead of Herpanti 2",
        "review_detailed_main": "I was wondering why no results came when I was searching this film in IMDB. Then corrected myself. But this film is Zeropanti 2. As usual Tiger Showff hitting people and injuring them, including the audience. Why are they doing this to Bollywood yaar? What has the audience ever done? This movie kills us more than the number of people Nawazuddin Siddiqui killed in the film . Love scenes were more disturbing in this film than the smoking ads. Tiger Showoff is not a ninja. He is a bloody fruit ninja in this film. Even paracetamol is not enough to heal headache after watching this film. If there is a heropanti 3, let me be the bloody hero so I will just kill the director before more of these film come to life. If I saw this in theatre I would just give extra 500 rupees more to the theatre for just stopping this film. It met my expectations cause my expectations were only a handful of zero's."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mirmujahidaliabb",
        "review_rating": "1",
        "review_title": "Terrible waste of time",
        "review_detailed_main": "Cannot believe that they can make a film as bad as this. Ahmed khan stop it. Sajid Nadiadwala what a lousy movie\n\nThis is another lousy venture after baghi 3."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "govind-87780",
        "review_rating": "1",
        "review_title": "Bakwas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kinisudarshan",
        "review_rating": "1",
        "review_title": "Kya karun yaar, mera sardard jaata nahi",
        "review_detailed_main": "Ever wondered how it feels to be on the electric Chair? I regrettably found out while watching Heropanti 2. Some people say \"Making a commercial film is also an art\", but Heropanti 2 is an art made by few a**holes."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ahmadnoty-60048",
        "review_rating": "1",
        "review_title": "Bakwas bakwas",
        "review_detailed_main": "All scene are copy ..story is mixter of 4/5 movies .bakwas act bakwas time waste.\n\nMairi life k 2 hour waste..\n\nOr ab kia likho................................................. ....... ....... ....... ..... .....\n\n... .\n\n."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "luckyvermav",
        "review_rating": "1",
        "review_title": "Public chote bachhe Hain kya 🤣",
        "review_detailed_main": "After watching this movie and wasting my money I have only one question for Bollywood, chote bachhe ho kya ese kon movie banata hai 😠 .\n\n. .\n\n. .\n\n. .\n\n. .\n\n. .\n\n."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rajdxbhyd",
        "review_rating": "1",
        "review_title": "NO wonder people appreciate South Movies.",
        "review_detailed_main": "Absolute TRASH. Expect bollywood to churn out such atrocious stuff and South movies will rule Indian Cinema. Terrible acting, script, music.....basically AVOID this trash HEROPANTY !!!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "docakki",
        "review_rating": "1",
        "review_title": "Hope it helps .. save ur precious time .. don't see it",
        "review_detailed_main": "Plz send this message to 3 people and ask them to send it to 3 more .. the movie is a disaster , and beyond saving .. save yourselves.\n\nPlz send this message to 3 people and ask them to send it to 3 more .. the movie is a disaster , and beyond saving .. save yourselves."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "faridalnahiyan",
        "review_rating": "1",
        "review_title": "garbage & disaster",
        "review_detailed_main": "Totally garbage & disaster film. If you want to waste 2hrs from your life than watch this disaster film. I dont know why sajid nadidwala make this film... I think he wanted to waste our time..."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "user-744-703090",
        "review_rating": "1",
        "review_title": "Zero stars",
        "review_detailed_main": "10 mins into the movie and here are my comments. This is A new low from Tiger and Ahmed, not sure why Ahmed is still directing? Nawaz is ruining his career on purpose. I am sure the worst is still to come. Tara Ji aap acting rehne do."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sumangarg-83561",
        "review_rating": "1",
        "review_title": "Dont waste ur time",
        "review_detailed_main": "Story is just a 💩. Acting is good, story is just of half hour and made it around 2 hr +. So overall time waste however due to unemployment all are bound to watch these kind of movies for time pass."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "samiranbarman-66301",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever seen,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "leena-47675",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "If this is the kind of movies bollywood will be making, We will never go back to theatre to watch movies like this. Glad to have OTT option where we can pause the movies and not have to bear the torture.\n\nTiger shroff &Tara need acting classes."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "amitmondal-14233",
        "review_rating": "3",
        "review_title": "Very weak movie.",
        "review_detailed_main": "Story line weak.\n\nScript line double weak.\n\nAction can prove physics wrong everything is wrong accept nawazuddin acting.\n\nWhat a wonderful weak movie really needs to get ORS."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ayaanbhojani",
        "review_rating": "4",
        "review_title": "Waste Of Actor's Talent Zero Direction Don't Waste Your Money On This",
        "review_detailed_main": "Gave a watch thz weekend and would say tht the director had a good script but completely ruined it with zero direction (Ahmed khan shld learn directing films if he wants to bcm a director with credits😏🙄). Tiger shroff looked good in the film bt acting wise nothing is actually praiseworthy even his actions scenes just seem normal,Tara sutaria also looked preety but she ws overacting ki dukaan💯 and overly loud,Nawazudin siddiqui also doesn't impress much he's jst average. The films 1st half had the potential to do something really interesting bt wat ws the aim of the director i still don't get it (I think to jst waste the talent of actors). Overall heropanti 2 is a below average film tht had a potential to do well but with completely zero direction it fails miserably, I rate it 3.8/10 starz."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rajkarankumar-60768",
        "review_rating": "1",
        "review_title": "Chhoti Bachhi ho kya",
        "review_detailed_main": "Fully Boycott this movie don't waste your money save your time also If you wouldn't wait then You have go to watch south movies. Because South movies gave respect our Indian culture, tradition, and Our Hinduism Boycott Bollywood."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "anishyadavashika",
        "review_rating": "1",
        "review_title": "This movie deserve 0 star",
        "review_detailed_main": "Cringey performance is expected from tiger shroff and tara but nawaz performance was even more cringing. Tiger bhai hume pata hai tum ucchal kood kar lete ho but thoda acting or story par bhi kaam kar liya karo. Tbh I have never seen any bad movie more than this. Please don't watch this movie, it can seriously gave you brain damage. Cringey performance is expected from tiger shroff and tara but nawaz performance was even more cringing. Tiger bhai hume pata hai tum ucchal kood kar lete ho but thoda acting or story par bhi kaam kar liya karo. Tbh I have never seen any bad movie more than this. Please don't watch this movie, it can seriously gave you brain damage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ashmitbieber",
        "review_rating": "1",
        "review_title": "Watch It Or Not?",
        "review_detailed_main": "You Will Definitely Gonna Love This Movie if you drop your human brain and logic in dustbin, Worthless Movie, Never Watch This Movie, Worst Movie Ever Exist in this world."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "auriannahall",
        "review_rating": "1",
        "review_title": "Never should have been made.",
        "review_detailed_main": "This is so sad... Heropanti was my favorite movie. A movie I could watch over and over.. but what is this movie? Completely out of touch with the first.. I was excited to see a part two but this should have never been made! And what the heck is up with this new love interest after such a strong connection with Dimpy?? Does not make any sense. Also I actually loved Tiger Schroff in the first movie! I loved the romance and the passion! The first movie took me on a complete Rollercoaster of emotions. This one was dull, boring, lacking emotion, and terribly written and acted. Tiger Schroff did not even play the same character in this movie. Everything that was so great about the first movie was NOT in this one. This is was completely demolished. A huge failure that I wish was never made and will go back to acting as if it never exsisted.. I wish I never heard of it in the first place!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "justbroken",
        "review_rating": "4",
        "review_title": "one good thing and many flaws",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "satyaa-40883",
        "review_rating": "1",
        "review_title": "One star for good location",
        "review_detailed_main": "First of all, why i can't see any emotion, y i can't feel anything in this movie.\n\nSecond, who took amrita Singh for role.\n\nThird, form where this money comes from, so that producer can spend rubbishly on this kind of movie.\n\nAisi tatti banatey raho Nawazuddin Siddiqui aur ek din tm bhi chutiya giney jaogay.. Katai, bollywood ki hawa lag gyi hai."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Pavan_trippy",
        "review_rating": "2",
        "review_title": "Definitely not a Rahman's musical. Is this a joke ?",
        "review_detailed_main": "This is the worst Rahman's musical. Music is good as an individual album, but not as a movie.\n\nPathetic movie to be honest. Did I miss something or is the movie inherently bad? This movie genuinely makes me question A. R. Rahman. What is this sir? Am I really missing something or is this just a money printing project? Honestly pathetic to say the least.\n\nOkay now to talk about the film, there's honestly nothing worth mentioning except for a couple of tracks composed by Rahman.\n\nDirection was pathetic. Action and stunts were mediocre.\n\nGenuinely speaking, just skip this movie if you're a Rahman fan. Watch it at your own discretion, because you'll be genuinely disappointing."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "masumshaitan",
        "review_rating": "1",
        "review_title": "Brainless attempt sequel of super flop movie",
        "review_detailed_main": "It's strange seeing Bollywood presenting parts of previously flop movies of Jackie shroffs son, poor direction, worst acting and Dont even ask about the script."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kaustavbasu-73064",
        "review_rating": "1",
        "review_title": "Unable to tolerate this nonsense!!!",
        "review_detailed_main": "What kind of movie is this??? Utter nonsense and unbearable. How's the Nadiadwala group financing such nuisance? Unable to rate 0 else would've done that!!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "a-kumar-04845",
        "review_rating": "1",
        "review_title": "maha bakwaas",
        "review_detailed_main": "Nothing more nothing less to write.\n\nBut because I have to write one hundred and fifty characters am adding this sentence to make sure it gets to 150."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "surjyanarayansahu",
        "review_rating": "5",
        "review_title": "Not compare to south movies to bollywwod",
        "review_detailed_main": "After watching southindian film, indian filmlover ignore bollywood movies but what kind of expectation are you expect from bollywood i mean this movie is also not achieve that expectation but not so bad as audience showing for giving ratings and this one is also a one time watchable movie.\n\nSo called filmlover watching south movies and compare that film to bollywood is completely wrong.\n\nI am also watch all language movie but not compare one industry to another industry.\n\nOverall Tiger and Tara done good job but not achieve the great success."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "roysayan-05014",
        "review_rating": "1",
        "review_title": "A must not watch film!",
        "review_detailed_main": "Starting from the storyline, action sequence, action and direction is the so bad that you cannot watch the full movie.\n\nWhat a waste of such a wonderful actor like Nawazuddin Siddiqui."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kaushikapurv-60684",
        "review_rating": "1",
        "review_title": "Its like an adult lullaby",
        "review_detailed_main": "Watched this movie on prime, every night for 5-7 minutes and I would be asleep before I know it.\n\nTry this and you would discover the true use of this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "fierofire",
        "review_rating": "1",
        "review_title": "Cringefest of the year 2022",
        "review_detailed_main": "It's shocking that people can make such kinda cringefest in 2022.\n\nAnd it's shocking that actors and actresses could act in it.\n\nE.g. Public laughing when Tiger Shroff was punched outside pub etc, dialogues.\n\nI don't know what to say."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ankitmail-09674",
        "review_rating": "1",
        "review_title": "WROST..DUMB...",
        "review_detailed_main": "Isse jyada bekar kuh ni ho skta..galti tiger ki ni h.. Is ahmed khan ko industry se bhar kro laat markr.\n\nIsse ghatiya movie ni ban skti race se bi kuh bekar ho skta h to ye h bhai log.. Bnd kro ye dard dena public ko bnd kro."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rabbifazl",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "Why some people gave this movie 10 star? Who are they. I think it would better if there is a minus star. This movie deserve minus star. It is really horrible to watch the full movie and very painful. The direction is very very bad. The dialogues are very cheap. Very Disappointing movie from Bollywood."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "asadmirza-03571",
        "review_rating": "1",
        "review_title": "Boring movie",
        "review_detailed_main": "Can't sit to watch complete movie. It's completely nonsense it's waste of money and time. Producer should stop to make this kind of movie to make people fool."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "brucejagtiani",
        "review_rating": "1",
        "review_title": "No need to waste your time",
        "review_detailed_main": "Acting Direction Action Location MONEY Time Talent etc etc etc - All a waste. Could have spent some valuable time elsewhere. Unnecessary songs and unrelated scenes."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "manglanaveen-98163",
        "review_rating": "1",
        "review_title": "Bakwass movie",
        "review_detailed_main": "Not recommended, one of the worst ever movie ..\n\nbakwass acting and direction,,\n\nPeople need ask for money to watch this movie...\n\nNo story, no acting,"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sanjeevsingh-06730",
        "review_rating": "1",
        "review_title": "How can such movies can even get released",
        "review_detailed_main": "Same old nonsense continues to be done in this industry. Tiger Shroff has been doing one thing from the start of his career and is not capable of giving any other expressions. With him it's always like 'action at the cost of expression'. He's been in this industry for almost a decade now but has not improved even one percent at the things that he's bad at, which is obviously acting\n\nDirections editing alll has been done seems by a 5 th grade child in fantasy."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "clubmiles",
        "review_rating": "1",
        "review_title": "Just crap",
        "review_detailed_main": "Worst movie up to date, There is absolutely nothing good in this movie.\n\nYou could wonder how much money AR Rahman got for doing the music for this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "pratik-33719",
        "review_rating": "1",
        "review_title": "Heropanti meri jati nhi acting muze aati nhi",
        "review_detailed_main": "Worst movie, not event 1 star.\n\nSame action in all squeal nothing new songs are worst. All other star performs well.\n\n... .... .... .... .... .... .... .... ..."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "coolpravin-56478",
        "review_rating": "1",
        "review_title": "Tiger Shroff proves that he is not actor",
        "review_detailed_main": "Tiger Shroff nothing but the stuntman, i dont know why producers cast him. I cant differentiate acting jis acting from other movies acting & reaction is same except movie names.\n\nOnly god can save Bollywood from such actors & directors RIP Bollywood 🙏"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "devendrarai-98944",
        "review_rating": "1",
        "review_title": "First Movie without any stori and acting",
        "review_detailed_main": "Worst movie ever without any stori line, can't wait till interval, completely waist of time and money. There is nothing to tell about this movie. Pathetic acting by both actor Tiger and Nawazuddin."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kirantr",
        "review_rating": "1",
        "review_title": "Worst movie after coolie no 1",
        "review_detailed_main": "After Varun Dhawan coolie no1, this is the flop movie not even 1 ratings is enough. Worst movie I don't know what type of cartoon movies they are realising these Days."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "radhamehra-45421",
        "review_rating": "1",
        "review_title": "super flop of the year",
        "review_detailed_main": "Can a movie be made without any plot and screenplay? The answer is \"Yes we have Heropanti 2\". After directing the Baaghi franchise, Ahmed Khan reunites with Tiger Shroff for this film, but the question is Why? What was the need for this sequel?"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "miltontalukder-57858",
        "review_rating": "4",
        "review_title": "Worst Movie",
        "review_detailed_main": "Heropanti - The worst Movie. Nowadays Bollywood movies are going bad. Bollywood movies budget are big but stories is poor. Directions is very bad. Conception is very fool."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rags-08217",
        "review_rating": "1",
        "review_title": "Worst movie of 2022",
        "review_detailed_main": "Very bad story like though characters are good no doubt.. but it's just to much .. for a moment I thought I am seeing a South Indian movie.. And after you watch 20mins .. you will die of boredom Acting of Laila .. too good. But others .. 😔😔 Disappointed .."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "saurabhloves2000",
        "review_rating": "1",
        "review_title": "Ahmed Khan is Going from BAD to WORSE",
        "review_detailed_main": "If you value your time even a little, don't waste your time on this piece of art. I started the movie with a lot of excitement thinking it features Tiger Shroff and Nawazuddin Siddhiqui, but I am surprised that these actors can choose to work in such a bad movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shahmaryam-34304",
        "review_rating": "2",
        "review_title": "Watch the movie if you wanna waste your time",
        "review_detailed_main": "The move was lame, there was no storyline at all made no sense. The whole movie was a show off hence showing off tiger shroffs body and action only otherwise no story at all."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sfoysol",
        "review_rating": "1",
        "review_title": "Just a wastage.......",
        "review_detailed_main": "Waste of time, money and comfort. Total wastage. Not merely watchable..... Cringe!\n\nI'll suggest not watch this cringe movie.\n\nI'll suggest not watch this cringe movie.\n\nI'll suggest not watch this cringe movie.\n\nI'll suggest not watch this cringe movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "saahilmalik-22893",
        "review_rating": "1",
        "review_title": "The worst movie of 2022",
        "review_detailed_main": "Plot: Babloo, a hacker, is sent to hunt down Laila (a magician). However, a while later he is in hiding, he is living as RJ and everyone wants him dead. What happened?\n\nHeropanti 2 is an awful film. I usually enjoy Tiger shroff as he puts a lot of effort in his films. However this time he looks like he just wanted to finish the role quickly. I really like Nawazuddin Siddiqui but his role here didn't impress me. Tara Sutaria wasn't good at all.\n\nThe first half is just crap. It shows Babloo on the run with Tara Sutaria while everyone wants to kill him. It doesn't show us why it's happening but it shows us fragments of what happened. Every actor gives us a headache here. Also showing Tiger Shroffs' but isn't funny. It's also bizarre how he survives an explosion literally right next to him.\n\nThe second half you could say improves as the flashback portion stands out. However when we get back to present day, it goes back to being terrible.\n\nAll of the songs are awful and are nothing special.\n\nI would never recommend this movie to anyone. Not even I'd you have nothing to do. Worst movie this year."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "norbert-plan-618-715813",
        "review_rating": "3",
        "review_title": "Only for die hard fans of Tiger",
        "review_detailed_main": "Tiger Shroff is a great professional. Acting in this film confirms a certain self-sacrifice. The script is at best confused and mixes a background of espionage based on bank account hacking, stories with his mom (all the scenes with his mom are clumsy and boring), with his new sweetheart (the delicious Tara Sutaria, whose plastic is interesting - she should sculpt her legs a little, which should not be shown, but that the costume designer tries to show all the time with shorts or very short skirts -, and who needs to take acting lessons) and with the villain, Nawazuddin Siddiqui, who is the only sympathetic, funny character (mix of gay Joker, flower wizard and psychopath with joy), very bad of course, and brother of Tara Sutaria.\n\nIn the midst of all this, Tiger Shroff cries, is sad or serious, dances and fights (he likes footwork and splits, as a tribute to Jean-Claude Van Damme we imagine). His tendency to be quickly shirtless is confirmed. Probably to hide his legs (he is short on legs, bordering on dwarfism). But he impresses for all the dedication he puts in. No homoerotic subtext here (although if you consider some of Nawazuddin Siddiqui's remarks...) The film is a stodgy mix of sentimental comedy, espionage and action.\n\nThe dance numbers are rather vulgar and fortunately amusing (and there must be four of them): Tara Sutaria obviously can't dance and the editing of these sequences does everything it can to avoid showing her footwork, which is clumsy and sorely lacking in tone in her movements. The music is barely passable.\n\nRespect to Tiger Shroff for shooting such a crap with so much conviction."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "woeser-94209",
        "review_rating": "1",
        "review_title": "Zero star for this junk movie.",
        "review_detailed_main": "These days in bollywood, anybody can become a director but they dont know anything abt direction. This is the perfect example. So if u dont want to waste your money and time this is the movie to avoid. 🤦🏻"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bhumijain-83333",
        "review_rating": "1",
        "review_title": "No story no acting",
        "review_detailed_main": "Firstly don't get why heropanti 2 was made heropanti 1 itself was horrible. Body or looks don't make a movie. Cringeworthy performance and plot. Lot of black money with producers to make such wasted movie.\n\nChote bachi bhi isse achi movie bana deti."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "madanmarwah",
        "review_rating": "4",
        "review_title": "Pedestrian entertainment for the masses",
        "review_detailed_main": "This is yet another proof that the original is on most occasions better than the sequel. Somehow I feel that Tiger Shroff was far more impressive in his debut movie probably because he had only one aim, that was to impress and arrive. Here he has to perform one ridiculous scene after another, though he has a large quota of kick boxing scenes and stunts to perform but falls short in the acting department, perhaps not entirely his fault. Director Ahmed Khan has made the movie with the masses in mind and they will not be disappointed. A saving grace is Nawazuddin who plays an effiminate don Laila with a quirky and comic demeanour playing to the gallery all the time. He is the one who makes the movie watchable. The scenes are farcical and ludicrous to say the least. The songs are shot with glitzy special effects which don't make them better anyway. I do miss the conventionally choreographed shot songs of Ahmed Khan a few years earlier which had rythm and style. The cars are classy and they screech at regular intervals till they crash in the underground parking lot. The hoodlums are international types and they come in all shapes. In respect of acting, Tiger drifts along in an easy laid back manner showing off his attitude and nothing else. I was disappointed with the leading lady Tara Sutaria who overacted and hammed throughout. It is not the first time the heroine is shown as a haughty and arrogant girl but somehow her interpretation fell short."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "andyganja",
        "review_rating": "1",
        "review_title": "Fell asleep twice wile watching this film",
        "review_detailed_main": "A bunch of producers got together and decided to make the worst film of the decade. So they hunted, and got Ahmed Khan as the director, Tiger Shroff with exactly one and a half expressions and the insufferable Tara Sutaria to pair.\n\nFortunately, for the producers, Tiger Shroff and Tara Sutaria succeed in delivering to the brief - that of making the worst movie of the decade.\n\nAnd to add a cherry to the cake, they even forced Nawazuddin Siddiqui to ham and act out the worst villain in his career. He tries desperately to copy Batman's Joker. And he comes out so pathetic, that i feel sorry for him.\n\nFortunately for me, I didn't spend money in a theatre for this garbage."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bhuniasaikat",
        "review_rating": "1",
        "review_title": "The rating should be 0",
        "review_detailed_main": "The producer and director both should be banned for 5 years for making such useless movie. There is no story in the movie.please don't waste your time to watch this movie. Tiger & Tara's acting will make you cry .Worst movie of 2022."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shunyaaakash",
        "review_rating": "1",
        "review_title": "Garbage.",
        "review_detailed_main": "Ahmad Khan has done some special course in wasting talents and making crapy movies.\n\nDear Tiger! Work on your acting and director choosing skills.\n\nBollywood! Stop trying to fool people with silly movies. Audience has evolved, it's high time for you to evolve now."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "abhik-27387",
        "review_rating": "4",
        "review_title": "Average One Time Watchable Flim",
        "review_detailed_main": "Story is just a below average. Action Scenes are also below average. Performances are so average. Tiger Shroff 's Acting is just ok. Tara Sutaria has done overacting in this movie. If you don't know what is overacting just watch Tara Sutaria 's Performance in this movie. Nawazudin 's Acting is ok. Only Locations, Sets, and Costumes are best and rest of the flim is average."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "reena-63370",
        "review_rating": "1",
        "review_title": "Tiger's Acting To An End💯",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bhushansonaje",
        "review_rating": "1",
        "review_title": "Total waste of producers and public money",
        "review_detailed_main": "I wonder Bollywood directors even watch their own movies after completion, it's a pure torture. I feel urgent basis parilament should make a law against these stupid directors and give them harsh punishment for mentally torturing public."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "abinashnath-56897",
        "review_rating": "1",
        "review_title": "Just don't",
        "review_detailed_main": "Is film me sabke laude lage huwe hai.\n\n1. Physics were harmed in making of this film.\n\n2. Trash acting.\n\n3. Don't look for logic.\n\nI was in intervel but already got tired of this garbage.\n\nIt's just a complete waste of your money.\n\nIn addition: You can't hear those dialogues."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "usman-aslam-ua",
        "review_rating": "1",
        "review_title": "Worst bollywood movie",
        "review_detailed_main": "No story line no acting sense...baseless action scenes all around. Directors doesnt know what logic means....just casted an actress who can wear short dresses thats it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "yprateeky",
        "review_rating": "1",
        "review_title": "Sets a new bar to cross.",
        "review_detailed_main": "I don't normally write reviews but this movie was so bad that it made me write atleast something.\n\nThere is no cohesion between anything. Belonging to cybersec industry, I myself, wanted to vomit at things that were being portrait. Not only they got tech side absolutely goddamn wrong (I am open to have some superficial elements as hacking in the real world isn't something that interesting, so I'll get if they would've some things to make the process interesting but this movie just sets a new low to cross for movies to come).\n\nAction was waaaaaay too silly. Not to mention the dialogues were subpar. I had enough in the first 30 minutes but sitting through the whole movie was a challenge to accomplish.\n\nIf you really hate yourself, want to waste 2+ hours and many more after watching by just contemplating how damn bad this movie was then go ahead. I am doing the same.\n\nDoing nothing, just... sitting and breathing would be better than watching this. NOT RECOMMENDED."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Codenamex-47",
        "review_rating": "1",
        "review_title": "WTF was it ?",
        "review_detailed_main": "What was this movie ? After watching block buster movies like KGF, RRR etc who is paying for this trash script ?\n\nI find the actors expression a bit too over , complete waste of time. Seems as if it was made by some tiktoker director."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mishradigitalstudiofbd",
        "review_rating": "1",
        "review_title": "Tatti , potty hai bhAi",
        "review_detailed_main": "Irrelevant scenes, useless action, no combination of dialogue & story... Bhai expensive cars ko kyu barwad kiy jb banani potty thi. Tiger worst movie of the year. Wasted 1600 rs... Went with group... It was chu- tiyPanti2."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mohammedpolash",
        "review_rating": "1",
        "review_title": "Just jumping japang like circus.",
        "review_detailed_main": "What a circus show...!\n\nI don't understand why the Bollywood industry is competing to make such a useless, time wasting, money wasting movie. The previous remake was also good. But what was it!\n\nNo action type, no drama, no romantic, no comedy."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "badavaththarun",
        "review_rating": "1",
        "review_title": "A revenge on audience",
        "review_detailed_main": "Tiger shroff is taking revenge on audience. He is not gonna leave Bollywood. He is not gonna improve his acting skills. He is not gonna act in good movies. He just fights just fights in a movie. These many people are telling you to leave, leave na yaar. Very bad product of nepotism is tiger shroff. He may not the one but he occupies top position."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jashodasuthar",
        "review_rating": "1",
        "review_title": "Bablu",
        "review_detailed_main": "Heropanti 2 deserves 0/5 it's really not good. In this movie something is going on something. And tigershroff becamebablu WOW!!! With stopped mind or don't know how writer have written the story kuch bhi ho raha hai. If someone is selling tickets in 50/- please save don't waste on this movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rahulranjan-63407",
        "review_rating": "1",
        "review_title": "Don't deserve even 1 star , Except Nawaj bhai acting all movie parts are scrap",
        "review_detailed_main": "Bollywood please stop creating such a garbage, Nawaj bhai deserve better story and better Hero costar not like Tiger Sirf naam ka Tiger rah gya hai.\n\nCreepy story plot and nonsense drama scene just filled with unwanted and meaningless action scenes."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "harshraj-40815",
        "review_rating": "1",
        "review_title": "Couldn't even watch on Amazon Prime!!",
        "review_detailed_main": "I wonder how the director and actors make such pathetic movies!! I couldn't even tolerate this movie on OTT, I wonder how people bear such movies in theatres."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "tanujaroradelhi",
        "review_rating": "1",
        "review_title": "Terrible Terrible Movie",
        "review_detailed_main": "Extremely mediocre and yet another blackest spot in Tiger's already blackened acting career. Though some of his movies are average, most of them have been made keeping in mind his stunts etc, which leaves minimalistic importance to script, dialogue, story, etc. And the best IIFA, Star, Etc awards will be presented to these low life actors or movies. Where is the standard of acting going?"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vaibhav00636",
        "review_rating": "1",
        "review_title": "Race 3 has competition",
        "review_detailed_main": "Quite possibly one of the worst bollywood films ever made right up there with Race 3. Absolutely no story and the worst screenplay ever written for celluloid. Nawaz is only here for a paycheck and Tiger should just leave being an actor and become a stuntman or dancer."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "IdliDosa123",
        "review_rating": "1",
        "review_title": "Chutiya film. Would give it negative stars if i could",
        "review_detailed_main": "These benchods just wasting money. Yes the film has great action sequences as you would expect, but the editing storyline and general movie is so bad. Better off watching kgf or bahubali than this\n\nLets make this the worst movie of all time, benchod."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bipinshuklabs",
        "review_rating": "1",
        "review_title": "Poor tiger acting",
        "review_detailed_main": ".......,.... Baghi 3 now heropanti 2 Kya tha ye kyu tha no logic nothing How producers ready to put money on this content.. hope he'll work on good movies like WAR .............,.... .......,...........,...."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "priyamdubey-85965",
        "review_rating": "1",
        "review_title": "Worst movie I ever seen",
        "review_detailed_main": "I am wondering right now ki isse jada ghatiya movie koi ni bana skta hai I am challenging even tik tokers are better than tiger shroff acting and about story isse acchi story bachpan mai school drama ki hoti hai. Please do not watch this this movie can seriously harm your sperms which is being made in your body. If you have guts then see and I am forsure that the concequences after watching this movie will damage your mind,body, peace, even this universe can be destroyed by the help of this movie. In mahabharat actually bhramastra was nothing it was a whole movie \"HEROPANTI 2\" that's why Lord Krishna was afraid of this and never wants that any one fire this Astra........"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "capitalsolution",
        "review_rating": "1",
        "review_title": "Deserves Negative Ratings.",
        "review_detailed_main": "I wish I could get a refund for watching this stupid movie. What a cringe worthy content created by the makers? Acting skills were so poor.\n\nForced story."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "thashminafernando",
        "review_rating": "1",
        "review_title": "Tiger plz stop acting like this movie",
        "review_detailed_main": "What a bad movie🤢🤢🤢🤢🤢 I was watched attack part 1 before I watch heropanti 2. Attack film was awesome 10 stars for that for sure. But when I watch this i was like vomit😂"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "y-13986",
        "review_rating": "1",
        "review_title": "SO MF BAD",
        "review_detailed_main": "Could even watch it through once that's how bad it was. Gave it another chance to finish it and still hated it. Gave one star cuz tiger is hot. Both actors can do much better acting i know it, they just rlly sucked in this movie. So cringy and just unnecessary."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ahujamk",
        "review_rating": "1",
        "review_title": "What did I just see",
        "review_detailed_main": "Script: Horrible. The storyline is poorly written, leaving viewers lost and uninterested.\n\nActing: Awful. Tiger Shroff might want to consider the Olympics instead-his physical prowess far outweighs his acting. Tara Sutaria? She did everything except act.\n\nSongs: Forgettable. The music fails to make an impact and feels like a forced addition.\n\nDialogues: Disgusting. The lines are cringeworthy, often making scenes feel unintentionally comedic.\n\nAction Sequences: Atrocious. While Tiger's athletic abilities are undeniable, the over-the-top stunts feel more like a circus act than action choreography.\n\nDirection: Horrendous. The film lacks coherence, vision, and any sense of flow, making it a painful watch."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sitayadav-05111",
        "review_rating": "1",
        "review_title": "flop movie",
        "review_detailed_main": "The makers have underutilized Nawazuddin and focused only on copy-paste action sequences, Tara Sutaria's looks, and Tiger Shroff's abs & dance. They have tried to add humour in some scenes but failed miserably. They have even forcefully added 'Choti Bachi Ho Kya?' trending dialogue in one fighting sequence."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "advsangambansal",
        "review_rating": "1",
        "review_title": "Worst movie ever to see",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "yedasanyasi",
        "review_rating": "1",
        "review_title": "Total waste of money and time",
        "review_detailed_main": "Such a waste and non sense movie , only has VFX made muscles of tiger Shroff, why do u spend so much money in such loose non sense story , i think the aim was only to get losses to adjust black money . But our money is hard earned , it's better to donate our money than to watch such non sense movie ."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "srishifrah",
        "review_rating": "1",
        "review_title": "Ahmed Khan - Spare us",
        "review_detailed_main": "Please do not spoil Tiger's career.\n\nStay out of DIRECTION PATHETIC movke and nothing much to write about Movie is with all rainbow colours It matched Rohit Shetty vision Horrible music by AR Rahman."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "tkmce2008",
        "review_rating": "1",
        "review_title": "Films don't get worse than this...",
        "review_detailed_main": "I recently decided that it is time that I started saving money so that meant not buying tickets to films such as this lame stunt show. But I am yet to realise the value of time, so I watched Hero-pathetic on Amazon Prime Video (the many benefits of having a membership).\n\nSet in London, RJ (yes, such a believable name) aka Babloo (more like Pappu), an undercover agent/reformed hacker/ace martial arts expert has his cover blown when his ex-girlfriend asks him to strip in public. The man after his life is none other than Laila; a world renowned cyber-criminal (has zero knowledge about computers), who moonlights as a magician (a bad one).\n\nThe most unbearable thing about Zero-panti is @arrahman 's involvement. A month ago, I thought Aaraattu was the worst thing Rahman did. But I stand corrected. The songs are disastrous; even the rehash of the original Whistle Song is reduced to some techno-crap. Rahman even managed to sneak in a Sufi number (for a pseudo mourning Babloo).\n\nTiger Shroff as a world renowned hacker and Nawazuddin Siddiqui as a cyber-criminal aka fake joker are the worst casting choices ever made. At least make it believable if not anything else. Just because it is the 21st century, we don't need all crimes to be cyber related. Tara Sutaria and Amrita Singh's characters are irritating to the core.\n\nHorrific-panti is Tiger Shroff's other action franchise (Bhaagi being the other) that has countless spiritual sequels for no reason. And if you haven't had enough of Tiger's stunts, then he has a new film coming out this Christmas, titled Ganapath. Signing off until another atrocity releases."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "prithvinesh-82526",
        "review_rating": "1",
        "review_title": "What was that?",
        "review_detailed_main": "What happened to you Sajid? Really. What was that? Rather why was that? The plot is very weak. Let's just say that there is no plot. They took old mindless logics (even for Bollywood) and senseless twists to make this movie. In reality, you only watch Tiger doing some backflips and can easily guess all scenes.\n\nTrailer looked like Hitman, real movie really hit us hard. Very disappointing."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "miscwork-56158",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "The production spent all their money on cars and glamour.\n\nWhat they missed was a good script and some acting.\n\nThere were instance it was so fake acting it wasn't a."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "msubhedar",
        "review_rating": "1",
        "review_title": "Zeropanti, Ghatiyapanti",
        "review_detailed_main": "I wish I could rate it as 0. Kya tha bhai ye. First of all jo log banate hai movie wo nahi dekhte honge kya? Agar duniya ki ye akhri movie hogi tab bhi me na dekhu isse. Ab ye IMDB puch raha hai \"Does this review contains spoiler\" isako kya pata kuch story hi nahi hai toh spoiler kya ghanta du. Lol."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "legendsgalaxy",
        "review_rating": "1",
        "review_title": "Abe Ye Banaya Kya Ha ???",
        "review_detailed_main": "Yaar Matlb Kuch Bhi daldoge Action Ke Naam Pe we Know Tiger Shofff is A Good Action hero His Stunt is Outstanding . But it doesn't mean ki Tum Log Uske Action Ke Dum Pe Puri Movie Chipka Do\n\nAnd About Starcast ap Logo Ko pata hona chahiye ki apne nawaz sir jaise great talent ko le rkha ha Apko Kuch Unke Sath Unique try Krna Chahiye Jaise woh Deserving ha Aisa Thodi Ha Ki Kick Movie Ka Character Yaha Laga Dalo\n\nMovie Ke Music Ki Baat na kre Toh hi Best Ha Kyuki \"Daafaakaar\" issey zyda Ksii ne Kuch music se acha Mili Ho I Can't see\n\nIllogical funny moments:- Seriously bollywood main Sach Main Ho Kya Rha ha kuch Bhi 18+ chize bol ke Comedy Smjh Baithna Ye Kaha hota ha Bhai director ko khud Bhi haasi aayi Hogi Kya Aise Ghatiya Funny scene main\n\nConclusion :- Heropanti is Far Better than Heropanti 2 aur Kisi bhi movie ke aage Purane movie Ka Number lagake Movie nhi Bikti abhi audience matyre Contain Aur cring main Farak Jan Chuki Ha\n\nThank you."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "souravbiswas-16911",
        "review_rating": "1",
        "review_title": "Bollywood movie 🤣🤣🤣my foot",
        "review_detailed_main": "Bollywood has no content...they copy from south indian movie...we all the people #boycottbollywoodmovie.\n\nWe hate bollywood actors and actresses.\n\nWe request to the people do not watch bollywood movie.."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "patelkr-95304",
        "review_rating": "1",
        "review_title": "Is this a joke??",
        "review_detailed_main": "0 star for action 0 star for director 0.5 star for music 0 star for action sequences 0.5 star for story\n\nI had to stop watching this movie for my own mental peace.\n\nSomeone please tell Tiger to stop jumping around for no reason."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ashishsingh-39587",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "No plot , over acting characters. Waste of time. There is nothing about this movie that I liked. Watch it on ott if you are busy elsewhere and let this play in background."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "harshrajj-04099",
        "review_rating": "1",
        "review_title": "Just Bollywood style repeatative story and tiger showing his sixpacks",
        "review_detailed_main": "Just waste of time Everything shown in this movie is repeatative stuff of bollywood.\n\nWhenever they try to make a new story they just combine many bollywood movies.\n\nBollywood should just make remakes they are good at making remakes.\n\nIf they try something new the we gets 'Heropanti2'"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "deeptibhudia",
        "review_rating": "1",
        "review_title": "The fall of bollywood!!",
        "review_detailed_main": "What is going on bollywood?!!! I honestly feel it's going down. This movie has no structure, story, consistency and the acting is terrible. Tiger continously does the same action sequences (as he does in all thos movies) with additional stunts that look so unrealistic. It's sad because he is very talented, but I haven't yet seen a movie of his were I have been impressed, War was the only movie I can say was good. The car scene in the garage was so over the top and cringe. The cgi and green screen is badly done and the continuous change of location is unrealistic, cycling in London and ending up in Yorkshire!! Come on!!\n\nTara's acting was so bad, cringeworthy and annoying. The songs were awful, which is ashame as it was AR Rahman's music.\n\nI think Nawazuddin Siddiqui, gave it some justice as I feel he was the only one who acted well.\n\nBollywood is struggling and you can see it and Tollywood is rising. I should have watched RRR again.\n\nDon't waste your time on this movie. Tum sab Miss hairan ho jaoge."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "unknowna-17012",
        "review_rating": "1",
        "review_title": "0 Star! Unbearable. Cringe. Stupidest movie ever.",
        "review_detailed_main": "I cannot believe that any sane person would look at this movie and say, let's release it. Wtf was this movie? I literally have a vomiting feeling after watch only 30-40 minutes of the movie. Completely unbearable and cringey movie ever.\n\nWith so much quality content on OTT nowadays, I cannot believe these directors/producers/actors think that these kinds of movies are ever going to work.\n\nAnd the worst, the absolute worst part of the movie was Nawazuddin's acting. Pure cringe. I expected Tiger and Tara to act badly which they did, so no surprises there but an actor like Nawazuddin. Paisa kya kuch nahi karwa sakta hai insaan se.\n\nI cannot believe I'm saying this, but even Salman Khan puts more effort in his movies than this Tiger, cheetah, tendua shroff.\n\nWorst worst worst movie ever. Don't watch it ever. But if someone points a gun to your head and make you watch it, don't eat anything while watching because you're surely going to vomit."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "IPyaarCinema",
        "review_rating": "1",
        "review_title": "Heropanti 2 (Actually Zeropanti)",
        "review_detailed_main": "This film is really a misuse of talent, labour, time and money and is a lot noticeable when you truly watch it. Terrible screenplay. Absolutely a wreck. Despite the fact that, I was opposing myself from watching it yet when I saw the film for my own fulfilment by not believing others, I truly despised with the idea of making this witless sequel of Heropanti. The film might have been made all around well with such high production budget yet it was perfectly ruined by the makers."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "keerthisriv",
        "review_rating": "1",
        "review_title": "How Can any sensible actors accept this script? Shows their heights of common sense.",
        "review_detailed_main": "I was like WTF did I just watch. I knew this was not such a hit movie , so choose to watch while working. I useually watch not soo hit average while working because I will not see screen for 100% of the runtime. It's just like background entertainment. But this was disgusting of the lot. Such poorly written script and story. If you want to make someone a flop actor or actress then this is the type of movie you should cast them in. 0% logic. Even if this was made like epic movie then also it lost it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "mustafakamalrubel",
        "review_rating": "1",
        "review_title": "Bad movie ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shekharnagar-32218",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "The most pathetic movie I have watched... waste of time and money. Don't understand why such kind of movies are made... and why do stars like Nawazuddin Sidhdhiqie, Tiger Shroff do such a bad script."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "aditya-bajaj-410-579578",
        "review_rating": "1",
        "review_title": "Amazon needs to stop paying for garbage",
        "review_detailed_main": "Ott platforms are promoting these kinds of productions and destroying real talent the move was so bad I could not watch it beyond a point the We can't expect much for tiger sheroff anyway but I the way they have showed Tara sutra as this dumb chick is just degrading and has destroyed my likeliness towards her - Nawazuddin Siddiqui is just over acting from the first seen with close ups done in really bad lighting scene after scene the lighting is so bad and production standards of this movie are as low as tiger sheroff - please don't wate your time watching this it's time you will never get back."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ankfordeals",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "Abdulxoxo",
        "review_rating": "5",
        "review_title": "A horrible production with little to no redeeming quality",
        "review_detailed_main": "I was blown away, everything about it is well staged, and the background colors, lights, costumes were all very detailed, the actors dance with passion, overall it is well directed and choreographed. I'm referring to the music videos of course as for the movie. It is simply one of the most unwatchable, terribly written, poorly edited, awkwardly acted, aimlessly directed movie I've watched this year. This film is more of a music video than it is a movie. It is evident that the large chunk of the budget and energy went to the music as every now and again a random song pops up that has no tie to story at that particular point. The director chose to tell his story in a non-linear fashion and that's fine, with a crisp editing it is always a good concept but the editing here is beyond horrible. Past and present are being put together with no distinction whatsoever. For that, things get confusing really fast and it shouldn't have to be as it is relatively simple-to-follow plot. The other reason where this movie fails other than its poor directing and editing, is the characters. All the characters are simply irritating with Inaaya; the love interest and the villain being the absolute worse. The bad guy's 'grand plan' didn't make sense and so was demeanor. Our hero is not far behind, the film wanted us to believe that he's some kind of slick computer genius with mad hacking skills but he comes off the exact opposite. Tiger Shroff is being typecasted in these roles and although he has the physicality, his acting chops though are below average. He's got like two or three facial expressions. I think he needs to start choosing his projects more carefully or better yet he should star in gritty drama roles where he can improve his acting skills.\n\nOn the whole, other than the grand scale production design and eye-pleasing visuals, there's nothing redeeming about this tripe of a movie."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "kreativestudio-67293",
        "review_rating": "1",
        "review_title": "Creapy dialogs and abrupt editing",
        "review_detailed_main": "Never grips at anytime. Leading actress is the worst actor. There are so many plot holes that you cant find plot and slow motion in every alternate minutes. Instead of flashy cars they should have gave some money to writer."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "phantom-72928",
        "review_rating": "1",
        "review_title": "Is there any option of -10*?? This movie is surely deserves rating under zero.",
        "review_detailed_main": "Time is very valuable thing. By watching this pile of garbage you will waste valuable 2 hours of your life. I'd say they should pay us as we tortured us in the name of watching movie. Too much bad. So many dissapointment. Logic was no thing in this movie. Bombs are not dangerous, they just torn your clothes. Nothing to worry."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "vvvvinod",
        "review_rating": "1",
        "review_title": "Not a good movie",
        "review_detailed_main": "I would say don't waste your time in watching movie instead go and watch circus.would say don't waste your time in watching movie instead go and watch circus.would say don't waste your time in watching movie instead go and watch circus."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sabiobernard",
        "review_rating": "1",
        "review_title": "Nonsense",
        "review_detailed_main": "I fail to understand the sense of producers, director and actors who consider this film. A. R rahman need to go back to listen his own compositions.. Felt like he lost his way and joined with this Bafoons to make money."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "chandanamitabhijeet",
        "review_rating": "1",
        "review_title": "Greatest disaster to Indian Cinema",
        "review_detailed_main": "The movie doesn't deserve a zero Star. Waste of time. Fully useless and bakwaas movie. Don't watch this movie. A great disaster to Indian Cinema. How can an actor do a fight scene when there is a bullet in his butt. The script and the writer of the movie is beyond imagination."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ajju-cool",
        "review_rating": "1",
        "review_title": "Terrible Movie.",
        "review_detailed_main": "The movie has nothing going for it.\n\nI have no idea how an actor like Nawazuddin opted to do this movie.\n\nAhmed Khans direction is directionless.\n\nThere's no flow to the storytelling and the whole movie seems forced and the songs will only remind you of 80s and 90s where there were songs for no reason.\n\nThe special effects are done by a 12 year old.\n\nBetter to avoid and sleep off if you have nothing to do."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "SBcriticImdb",
        "review_rating": "1",
        "review_title": "Omg! No thing makes sense in this movie. It's so bad!",
        "review_detailed_main": "Overall acting 2\n\nTiger Sheriff acting 2 Nawazuddin Siddiqui acting 2 Tara Sutaria acting 3 Supporting cast acting 0\n\nBAD!!!!! Why do they make part 2 when it has nothing to do with the first one. Why? Tiger Shroff is king of giving flop films. His has talent at dancing and bodybuilding. Acting is not his talent. Maybe he should consider doing supporting roles. As a lead actor he just can't carry a film to success. Nawazuddin sidiqui is too overconfident in his acting now. It shows it on screen. He should stick to smaller roles.\n\nI don't want to say more and waste my energy on saying why it's so bad. It's just bad. The story, the acting, the action, the comedy and the directing. Everything is bad bad bad!!!"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "takshi-76322",
        "review_rating": "1",
        "review_title": "Not worth wasting time",
        "review_detailed_main": "Don't watch. Total time waste .no story line which can bind u even for 15mins .. pathetic dialogues of the villan . It should be not rated even 4.6 in overall .,.........................................................................................."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "seemarathod-77860",
        "review_rating": "1",
        "review_title": "kya majburi thi aise movie bnane ki",
        "review_detailed_main": "The music is given by maestro AR Rahman, who is completely wasted here. He could have saved some songs for a better romantic film. If you are looking for a storyline, meaningful dialogues, character development, watchable performances, and humour then you should avoid this film."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "akhilpandey-64076",
        "review_rating": "1",
        "review_title": "Worst movie. Save your time",
        "review_detailed_main": "Wasted around 1hr but saved 1hr. Worst movie ever.\n\nRe dubbing, green screen, bakwas executions. There was no story so no need to mention anything about that. 70cr barbaad charity me donate krte to jayada better hota."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "maharshibbhatt",
        "review_rating": "1",
        "review_title": "Torture",
        "review_detailed_main": "Such a hopeless director Ahmed.\n\nNawazuddin is such an overrated actor, his acting skills are very dull Poor Story screenplay and direction 1 Star for Tiger shroff..."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "sudeepcancer",
        "review_rating": "1",
        "review_title": "Terrible, Horrible, Pathetic",
        "review_detailed_main": "OMG how can they make such pathetic movie.\n\nAfter Baghi3 this another disastrous movie for Tiger.\n\nActing tujhe aati nahi heropanti teri jati nahi.\n\nBrain less people make such movie and brainless people like me watch such torture."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "nidhibhatia-82682",
        "review_rating": "1",
        "review_title": "this is not good yr",
        "review_detailed_main": "There's no story in this film. This film relies solely on its action which is still way over the top and completely nonsensical. Tara Sutaria is overrated. Haven't liked her acting since her debut film SOTY 2 but I don't know how people still have faith in her."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "abhirath-12825",
        "review_rating": "1",
        "review_title": "Handsdown, worst movie ever",
        "review_detailed_main": "In the pursuit of making the worst movie, i think Heropanti's team has aced the race this time.\n\nCannot make anything worse than this.\n\nActing: worse Direction: Worse Dialogue: Worse.\n\nOver acting: 10/10.\n\nKudos."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "JatinDhartiwasi",
        "review_rating": "3",
        "review_title": "Zero knowledge about hacking",
        "review_detailed_main": "They think just clicking few keys would stop or start something that bag... Zero common sense... Bad writing bad script. Bollywood leveling decreasing day by day becaveof movie like this. Totally disaster movie..."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "KarmaLysing",
        "review_rating": "2",
        "review_title": "This dud is not even worth a clever pun",
        "review_detailed_main": "Why, Tiger? Just... Why?\n\nThe \"plot,\" such as it is, exists solely as a framework for action scenes so ridiculously over-the-top they are literally boring.\n\nThere is ZERO chemistry between Our Hero, Babloo, and the erstwhile Heroine; who is, incidentally, so utterly noxious and rancid you're rooting for her to get nuked - preferably from orbit. (It's the only way to be sure).\n\nSeriously... even if you are a die-hard Tiger Shroff groupie, give this one a hard pass, and rewatch \"Baaghi\" instead."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "jiteshpopat",
        "review_rating": "1",
        "review_title": "Heropanti",
        "review_detailed_main": "Rubbish not worth a watch Tiger acting is bad dialogues delivery is poor his martial arts are same moves as before. Nawazuddin Siddiqui trys to be the joker poor attempt lazy film poor watch."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "walidms",
        "review_rating": "1",
        "review_title": "ChamPanzi Terminator",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "scofieldmichael-51893",
        "review_rating": "1",
        "review_title": "Here to save your 2 hours...",
        "review_detailed_main": "Very bad acting by tiger and worst story. Not worth watching even single time.. focus is on action instead of story. I recommend not to watch. Nowadays tiger does movies without stories... No doubt people moving towards south films."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "shaikhjaheed-59827",
        "review_rating": "1",
        "review_title": "Bekar movie 🎬",
        "review_detailed_main": "Same old nonsense continues to be done in this industry. Tiger Shroff has been doing one thing from the start of his career and is not capable of giving any other expressions. With him it's always like 'action at the cost of expression'. He's been in this industry for almost a decade now but has not improved even one percent at the things that he's bad at, which is obviously acting, emoting and dialogue delivery. How long are we gonna see the same old jumping and dancing with the same bland face? Is he ever gonna change?\n\nThere's no story in this film. This film relies solely on its action which is still way over the top and completely nonsensical. Tara Sutaria is overrated. Haven't liked her acting since her debut film SOTY 2 but I don't know how people still have faith in her.\n\nThe songs in this film are terrible. 1st rate torture if I may. They only make the film more unbearable. Can't believe AR Rahman worked on the music of this film. Even the original whistle baja is so good compared to this. This one is so bad I can't even describe it in words. Nawazuddin Siddiqui is doing his same acting from Kick. So in short this film offers nothing new. Pathetic acting, dialogues and their delivery, worst songs, action that you've already seen a million times and no good story at all (horrible in fact), I wouldn't recommend this film even to my debtors. Don't pay me back but also don't waste my money on such horrible films.\n\n161 out of 167 found this helpful."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ump-08732",
        "review_rating": "1",
        "review_title": "NOT A MOVIE !!!!!",
        "review_detailed_main": "This cannot be categorized as a movie. It's a mind numbing torture. No story, no acting, no freshness....even nawaz's acting is repetitive.\n\nIf you want to see tiger hopping and jumping around for no reason...well even then i would say avoid it. A total waste of money, time and data."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "itzrocksalman",
        "review_rating": "1",
        "review_title": "LOL !!!!",
        "review_detailed_main": "This movie doesn't need to be reviewed .🤣 Its utter waste of time no script , no story movie made for brain dead Zombies 🤐 After watching it on Amazon Prime for few minutes i was questioning my self , what am i doing ? Do i deserve this kind of mental torture . Please avoid giving yourself a headache by not watching Bakwaspanti 2😖"
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "omiazad",
        "review_rating": "2",
        "review_title": "Do not watch this even it is free on Prime Video",
        "review_detailed_main": "Let me give you a positive review. Hundreds of people were connected with the making of this movie and got paid. So our watch time would not go in vain. But I am not sure what is wrong with Indian movies these days. No story, no dialogue, fake action, cheap VFX. If this has been release in the 80s, then it would be fine may be. But the story is so weak, no one would like it."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "piyushmankind",
        "review_rating": "1",
        "review_title": "Ajmer jao film ko flop banao",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "arabmohammadfazlyrabby",
        "review_rating": "1",
        "review_title": "No 1 Flop Movie on this year 2022",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ketanjaiswal-41208",
        "review_rating": "1",
        "review_title": "Ye kya hai bhai 😂😂😂",
        "review_detailed_main": "Itni third class movie shayd hi bani hogi .. kuch bhi sence tha movie ka ??\n\nIt going to test your patience level for sure.\n\nNo story , no connection , no good songs .\n\nTiger is only flying in the movie .\n\nBaseless movie , if you have seen in theatre , god bless to the eyes.\n\nBollywood when they going tk get a good script."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "amairkhan-11514",
        "review_rating": "1",
        "review_title": "Not heropanti the whole movie was *huthiya-panth(Garbage)",
        "review_detailed_main": "Director Ahmed Khan surely was very high while making this junk movie of meaningless randome scenes. Even YouTuber kids would have been made good movie with this much of budget."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "amarsinsinwar",
        "review_rating": "1",
        "review_title": "Jyada khrab h bhai",
        "review_detailed_main": "Tiger khud ko roast krte dikha puri movie me..bhai khud bi kabi apni movie dekha kro kya bnate ho ye.................................... ...................................................,......."
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "naumanmansoor-16247",
        "review_rating": "",
        "review_title": "Issay acting Ati nae or film industry ki Jaan isssay jati nae",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rohitcoco",
        "review_rating": "",
        "review_title": "What a confusing plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "rushikashyap-76576",
        "review_rating": "",
        "review_title": "I didn't like this Movie Heropanti 2. Boring movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "bikramsinghbahniwal",
        "review_rating": "",
        "review_title": "HEROPANTI 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11873440",
        "movie_name": "Heropanti 2",
        "movie_rating": "2.3",
        "review_username": "ihashir-57240",
        "review_rating": "",
        "review_title": "Voilation of Muslim religion in song (rehuma)",
        "review_detailed_main": ""
    }
]