[
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "terunzius",
        "review_rating": "1",
        "review_title": "Worst movie i've ever seen",
        "review_detailed_main": "A week ago i watched Daniel der Zauberer. I wanted to give it a chance after all the bad reviews it had received. This foolish idea ended up being just a waste of my precious time.THe plot reads as follows: A boy who became famous through a TV show has problems with people who don't like his music. The main character is played by daniel kueblboeck, the new star from Germans pop idol (so Kueblboeck actually plays himself). After all I'm proud i made it through the movie. To be honest i only watched it till the end to write about it. The movie itself is so bad it almost hurts physically. So this is a warning : DO NOT WATCH THIS MOVIE!! DO NOT GIVE IT A CHANCE!( unless you are either a masochist or a küblböck fan). Don't say i didn't want you. This movie should receive a 0 Voting instead of an awful."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Flokey",
        "review_rating": "1",
        "review_title": "German singer Daniel Küblböck plays himself in a dramatic bad art-movie",
        "review_detailed_main": "This is probably the worst movie ever.\n\nDaniel Küblböck shouldn't act. Never. Even it's the end of the world as we know it. Never, never, never.\n\nSome people give this movie 10 points, because they feel compassion for him, but if you are objective, this is the WORST MOVIE EVER MADE.\n\nI know girls like him because of... uhmmm I don't know, but fact is, he isn't an actor, he isn't a real singer. He only passed in the casting show, because he's funny, not because of his \"talent\".\n\nThis kind of art-movie is responsible for 90% of eye cancer victims and mental deceases. DON'T WATCH THIS MOVIE (except you are drunk or drugged)"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "sunreign",
        "review_rating": "1",
        "review_title": "Do not watch this movie, not even for a joke",
        "review_detailed_main": "This movie won me a bet with a friend of mine. I said she could not watch this without crying, yelling or leaving the room.. well she cried, she yelled and she tried to left the room, but it was locked by that time.\n\nDo not watch this movie .. this isn't a game, this isn't negative psychology to make you interested and there is no message intended apart from \"Do not watch this movie\". Since the whole \"plot\" evolves around people hating the main actor, and you will hate the actor while watching this work, you get the distinct impression that the movie is actually aimed at you. Should that be the case, it's the cultural equivalent of stoning the viewer to death."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Philstor",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen ?",
        "review_detailed_main": "YES, beyond any doubt, this is indeed the worst movie I've ever seen. Even the cheapest action flicks cannot come close to this outrageous offense to the eye. This movie not only is an insult to any person who regards himself even a bit intelligent. No, this movie is one of the reasons you seriously start to doubt, that freedom of thought is a good idea. The acting is nothing more than a bad joke. You might get offended if you watch this movie with even the slightest expectations. I will restrain myself from speaking about the actors themselves because I don't want to use foul language. So please, don't abandon your pride. If you don't vote with a 1 please don't vote at all. This movie has truly deserved nothing better by a sane person."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "dennis12-1",
        "review_rating": "1",
        "review_title": "The worst film ever made",
        "review_detailed_main": "Obviously Ulli Lommel, the creator and director of \"Daniel der Zauberer\" had some urgent bills to pay back in 2004..\n\nJust a few facts about this movie: - the visual quality is miserable, the whole thing is filmed using a cheap DV camcorder, just like an average holiday movie produced by a nearsighted, shaky retiree .. The kind of stuff nobody would like to watch on the big screen..\n\nthe \"actors\" are acting .. very bad! Think about the worst performance you have ever seen - and than imagine all the bad actors being drunk, insane, spastic and disabled in many other ways.. Than multiply the resulting \"badness\" with the number of sand grains laying in the sahara desert and you've got an idea of what \"Daniel der Zauberer\" is like! The only reason why this movie has left the very justified last place of this Movie Database is because the voting was falsified by organized hordes of \"Daniel Fans\", it really IS the worst movie ever made.."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "werrybold",
        "review_rating": "1",
        "review_title": "God, how awful",
        "review_detailed_main": "Daniel der Zauberer is probably the worst ... \"movie\", I've ever seen. And I've seen many, many movies. It's cruel. Save your money or throw it in a trash can, but don't spend any money for that ... \"movie\". It seems to me, the director didn't find enough real actors for his ...\"movie\", so he fills the cast with his family and family of Daniel Küblböck. And for all the happy folks out there, who don't have any idea who on earth this Daniel Küblböck is... He's some an former candidate of the German \"Pop Idol\", who's lack of talent is only matched by his airs and graces.\n\nDon't say, I didn't warn you."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Crazy_Gibberish",
        "review_rating": "1",
        "review_title": "Nearly impossible to track down, but worth it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "kluseba",
        "review_rating": "3",
        "review_title": "Rest in peace",
        "review_detailed_main": "The main reason why I watched this movie that is often described as one of the worst of all times is what appears to be Daniel Kublbock's tragic suicide that occured less than two weeks ago. The actor, businessman and musician jumped off a cruise ship into icy water and his body hasn't been recovered yet. Daniel Kublbock has always been a tragic character evoking both disgust and sympathy and who obviously had his share of mental struggles. His parents had wanted a daughter and separated in his early childhood. His mother was apparently an alcoholic who used to hit him sometimes while his relationship with his father was ambivalent. Daniel Kublbock auditioned for the first edition of a reality talent show when he was just seventeen years old. He wore androgynous clothes, appeared to be overtly emotional and had very dramatic, loud and unskilled vocals. Daniel Kublbock was looking for fame to find his own identity but refused to accept that he didn't have much talent and failed to understand that he was used by producers to have a clown in their show that people could make fun of. Againt all odds, many female teenagers pitied him or even saw themselves in this sympathetically confused being and made his songs and records more popular than anyone would have predicted. Daniel the Wizard was released at the height of his career. Instead of helping him find his fame and identity, the media attention had its share of negative impacts on him. Daniel Kublbock openly identified as bisexual, then admitted being homosexual and ended up claiming he was transgender shortly before his death. His physical appearance also shifted drastically as he looked quite androgynous as a teenager, then gave himself the look of a serious male businessman before adapting a feminine look with dresses and heavy makeup. His music also changed from anglophone pop rock music over Latin pop to a mixture of blues and jazz. Daniel Kublbock's fate is tragic because he never found his true identity and his erratic behaviour gave him a few moments of glory but also a few moments of resentment. Blaming those who bullied him because of his at times annoying behaviour is only partially accurate as his family, managers and friends should have helped him deal with his mental issues first instead of supporting him being watched by millions on television when he was still legally a child.\n\nIronically, much of this torn character can also be found in this movie that mixes fantasy elements and documentary aspects. Daniel Kublbock is seen going completely crazy on stage at one moment and sitting thoughtfully in an isolated room in the next scene. The film portrays a young female teenager who admires the unique and different singer while male teenagers despise him for his erratic behaviour. This film actually shows us who Daniel Kublbock really was and how he was really perceived by society. These two elements alone make the movie bearable and justify a slightly generous rating.\n\nThe rest of this film is a catastrophe. The plot is beyond ridiculous. The acting performances are stiff. The camera work is shaky. The sound is unsteady. The movie mostly consists of concert footage weirdly intertwined with poorly scripted fantasy elements. While other bad movies such as The Room show a certain degree of passion for filmmaking or are at least entertaining like Samurai Cop, Daniel the Wizard is neither passionate nor entertaining. Despite its short length of only eighty-one minutes, it feels incredibly stretched and could have been cut in half. The movie righteously sold very poorly but is today considered a cult flick because of its flaws. Honestly, those flaws are so amateurish that they aren't even worth discussing. Daniel the Wizard is only interesting to watch if you are intrigued by the lead actor's tragic fate. If you come here expecting hilarious entertainment, you have to looke elsewhere.\n\nCalling this film one of the worst ever made would be exaggerated. Describing Daniel the Wizard as unsuccessful low budget mash-up of random documentary elements and weird fantasy parts is more accurate. This movie is a sympathetic wreck. Such seemed to be the life of its lead character as well. May Daniel Kublbock rest in peace."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "secacr",
        "review_rating": "1",
        "review_title": "don't even think about it...",
        "review_detailed_main": "What shall I say, seeing the trailer was bad enough, knowing who the lead actor is makes my brain go to standby... Unless you want to get really upset about such a waste of time and resources, which this sorry excuse for a movie is, give the money for the video or whatever to charity. The acting is wooden, the voice of Daniel makes you want to rip your ears of, basically everything about this flick is so unbelievably bad (even the posters, which you can still find in catalogs) are real bad and I cannot imagine who would want to buy them.\n\nAll thumbs down.\n\nThis is the worst film in the history of mankind yet. All filmmakers will be hard pressed to top (or bottom, in this case) this one."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "macbeet",
        "review_rating": "1",
        "review_title": "You are lucky if you never even heard of this film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Fwenceslas",
        "review_rating": "10",
        "review_title": "A Milestone in the History of Trash",
        "review_detailed_main": "If you're going to watch \"Daniel the Magician\", prepare to face what real, awful Trash means. This movie lacks all logic and structure, it's a painful, merciless attack on brain and eyes. Sit back and watch what I would call the \"Waterloo\" or the \"Stalingrad\" of German cinematic entertainment. Ulli Lommel, former follower of the famous director Fassbinder, has done a decisive step in the history of trash-movies. I don't know whether Fassbinder would be ashamed or happy about what Lommel so consistently has given birth to, but I am sure, this mutated freak, this abhorrent monster of a movie will be a long time one of the milestones in the universe of b- and c-movies. If you're a trash fan - watch it! Definitely! If you're kinda \"normal viewer\" - don't even touch this freaky cinematic disaster! 10/10"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "fpollinger",
        "review_rating": "7",
        "review_title": "easy to hate - difficult to love (but possible)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "ChristophAndre",
        "review_rating": "1",
        "review_title": "This one is really bad",
        "review_detailed_main": "In few words: This movie simply sucks. To be frank it's probably the worst movie I've ever seen.\n\nThere are huge problems with the concept of the story. Some might argue about the (non existing) abilities of Daniel Kübelbock as an actor. However you could imagine a story with Daniel Kübelbock playing himself in a self ironic way and some kind of trash factor supporting the rest of the story. Now Daniel Kübelblock is actually playing himself and the whole story is trash (if you would look at it from that point of view, actually more points could be given), however the film -I actually searched on several pages on the Internet to confirm this, cause I didn't believe it after I first watched the movie- wants to give its viewers a serious message and is determined to be considered as art. I would call this movie \"Entartete Kunst\" if the Nazis hadn't already used this term for their evil purposes. Still doing it in spite of this is quite tempting.\n\nMost of the other actors are better than Kübelbock, still they are far below average to say it in a friendly way. Quite amusing are the sociolects (in particular indicating uneducated and unemployed people) and jargons (representing a high consume of the German mass media culture) several actors are using. There are several slips of the tongue as well in some quite simple sentences. It really adds a lot to the already great trash feeling this movie provides."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "greendark2000",
        "review_rating": "1",
        "review_title": "I lost 80 minutes of my life.",
        "review_detailed_main": "First of all... don't watch this movie without knowing that you are going to have a good movie which will heal your wounds after watching this movie! A 5.5 stars rated film of any genre should do. 6.5 stars might even make your evening if compared with this movie. When I heard of Daniel Der Zauberer being in the bottom Top 100 I decided that it is my duty as an anti-Daniel-fan to watch this movie. By the way, I've seen 'Plan 9 from out of Space' too but for a different reason. This movie was the most horrible experience in my whole life. I almost bit my hand off while listening to the totally senseless dialogue's and the lethal singing of this halfbreed. He can't be from this planet!\n\nThe worst scene is Dannyboy sitting there reading his own fan-mail to his entire family and giving comment on every letter written by young girls and old ladies...how can you dare? Then after this first torture he goes jogging and sings the whole time.\n\nI'm very sorry that he managed not to be shot in the neck by his kidnappers. That would be a reason to watch this movie again. I agree with my German friends that this movie is the biggest waste of time and resources. All thumbs down!!!\n\nOnly goody: You come to see all his crashes and humiliations from the days in the Jungle Camp!!!\n\nGreetz, Felix"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "sethn172",
        "review_rating": "1",
        "review_title": "This is one bad \"Musicians who can't act\" movie!",
        "review_detailed_main": "Urrgh!!!!! Now, I know I love the movies with musicians as stars, and that many people disagree with me about this, but this movie, \"Daniel - Der Zauberer,\" is one notable exception! This movie is not good; it's bad, bad, bad!!!!! I mean, we have the German pop idol, Daniel Kubelock (or something like that), a Michael Jackson wannabe, and we have a bunch of assassins trying to kill him! Plus, the whole movie is like watching \"behind the scenes\" footage! What kind of musical movie is that????? Oh, well. Guess I'll be watching bad musicals like \"From Justin to Kelly\" and good musicals like \"Grease\" for the rest of my life! Where's the \"Mystery Science Theater 3000\" team when we need them?"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "xanderlavelle",
        "review_rating": "1",
        "review_title": "There is no excuse for this",
        "review_detailed_main": "Well, what can I say? A friend of mine an me we are a huge fan of trash movies and we have really fun of watching these kind of movies. So of course we also came across this item. We were really looking forward to this because we assumed a lot of funny passages but even with our expectations set as low as they could get while watching this movie it got down under...\n\nThis 80 minutes movie is pure terror. You cannot even have a laugh about it and you first realize how terrible this movie really is after you have finished it. It is leaves you with the feeling after watching a deep blue drama just without the empathy and tears.\n\nWell, I really warn you about watching this piece of junk. The camera is the worst kind of recording I ever came across, Daniel Küblböck sings the worst songs I have ever heard (and it is not hard to guess, that he wrote the songs himself)- low light \"Teenage tears\" - and the script is so lacking of any talent that you really hate everybody who has something to do with this movie.\n\nI may say that I give everybody a chance, but after this movie Daniel deserves the hatred he gets. He is causing it himself. None of the characters is a tiny bit sympathetic and every minute passing by seems like forever. And nobody has any talent to act. It is also the longest movie I have ever seen.\n\nAnother thing is that this movie is called Daniel - Der Zauberer (German for magician). Well, there is just now and then a reference to a magician but he never is one. Would it be an intelligent movie, i would guess Daniel would be an imaginary magician and his music is sort of the magic, but due to the fact that this movie is not a slightly bit of intelligent it just cannot be.\n\nThis movie is a slap into the face of the movie industry. How could anybody allow this to happen in the first place?! DON'T WATCH THIS MOVIE! I would categorize it as horror or psycho terror. There is no Comedy, Fantasy or Crime in it - well crime is only the fact it has been produced.... I'm done..."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "t_atzmueller",
        "review_rating": "1",
        "review_title": "In one word: Manure ...",
        "review_detailed_main": "Let me tell you a little story: having once worked in a video store, my boss had ordered 15 copies of \u0084Daniel der Zauberer\" – two for rentals, 13 to be put into sale. He assured me that this was a wise choice since, at the time, the name Daniel Küblböck was in mouth and ears of many pre-teens and teenagers. Küblböck made second place in Germany's \"Superstar\"-version (\"DSDS\") and was groomed to become Germany's version of Michael Jackson; music and persona being as artificial as the tip of Jackos nose. Surely a few handsome bucks would come from the rentals.\n\nNeed I still mention it? Neither rental copy ever left the store. Not once. After having reduced the price to 50 cents, my boss tried to give the DVDs away for free, causing two copies to leave the store. One customer who took a copy assured me that this was meant as Christmas present for 'that guy dating his ex-girlfriend'; the other copy was taken by a drunk who wandered the adult section and who didn't own a DVD-player.\n\nWhatever happened to the remaining 13 copies, you ask? Unless my boss has used them as make-shift beverage coasters, they remain the only films in that shop to carry the label \"Free\".\n\nIs \"Daniel der Zauberer\" the fabled 'worst movie ever'? Well, sure \"Daniel der Zauberer\" makes \"Plan 9 From Outer Space\" look like a Cecil B DeMille picture – but it's by far not the worst film ever. Oh, by no means. Just check out any other Ulli Lommels production, for example \"The Zodiac Killer\", \"Black Daliah\", \"BTK Killer\" or \"Green River Killer\". They're all god-awful; all bad enough to turn your best friend into your worst enemy.\n\nYou might wonder why I bother to write a review about such manure: well, it's fun to make fun of movies that are worst than anything you've every recorded with your cell phone.\n\nAnd now you asked me how many points I give and to pass judgement over this film – to paraphrase the \"Black Adder\": good sirs and madams, I wouldn't pass water over \"Daniel der Zauberer\"."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Lotica",
        "review_rating": "1",
        "review_title": "Why? Honestly... WHY!!?",
        "review_detailed_main": "This movie... is a disgrace to the art of film making, and to film makers everywhere. Why... would you make, a film about some craptastic singer who cannot sing for the sake of his whole family from dying? Answer me! WHY!? This movie, I have nothing to say about it. It's the reason why there is war, why peace will never come, and why the world will end sooner or later... it's that bad my friends. IT'S THAT BAD!!! Why am I even talking!? I cannot save you now... you are already.. DEAD!\n\nThis movie, makes me want to stop watching and reviewing movies altogether, as it is the worst movie of all time. This movie, the director, and MOST IMPORTANTLY... the star of the movie, should lock themselves in a shaft, and shall never be seen again... EVER!!!!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "gustofsummer",
        "review_rating": "1",
        "review_title": "Crap'n Cult'n Küblböck",
        "review_detailed_main": "This movie is bad, it's cheap, it's ridiculous and unbearable... and yet there's something about these 78 minutes of boredom.\n\nIs it the contrast between the semi-pro colors and the amateur camera work? The contrast between the waaaay too long live-performance part at the beginning and the terrible jumpcuts and plot holes later on?\n\nThe downhill slide of bad acting and stupid dialogs? The stunning dull locations? The cheap teeny music? Or is it the idea of presenting an untalented (and colorblind?) would-be-superstar as the leading hero?\n\nI don't know what it is, but in Germany this DVD is a popular gift to bring along when being invited. It's only 1 Euro and it's fun to force the \"bona fide\" receiver to watch it at least once - it's been a gift, you know ;o)\n\nThe joke of the cover-artwork being actually more expensive than the making of the movie and the fact that the incompetence lasts right into the DVD menu with several typos makes this film truly the worst of the worst!\n\nDanke schön Ulli Lommel, danke schön Daniel Küblböck!\n\nSo dare to watch it in a row - you'd be the first. And if you ever wear a green/white \"Theramed\"-tuxedo and strike a pose like Daniel on the backcover of the DVD your life has been an empty fraud..."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "tmann21",
        "review_rating": "1",
        "review_title": "This is the real \"The Ring\"-video! Do NOT Watch it, you might die!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "gurnek-87579",
        "review_rating": "10",
        "review_title": "Best Fricking movie ever",
        "review_detailed_main": "My friend Bob the wizzard told me to watch this movie and I am in disbelief of how amazing this movie is. The actor is so handsome, The CGI is close to unmatched perfection. Words cannot describe how good this movie really is. I recommend this movie to everyone who loves watching good movies. While I watching this movie I was in an another dimension. The movie excels in its world-building. The magical realm is richly detailed, immersing viewers in a visually stunning environment that feels both expansive and intimate. The use of practical effects and CGI is seamlessly integrated, creating spellbinding sequences that are both imaginative and grounded. This visual splendor enhances the film's narrative, making the fantastical elements feel real and tangible."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "info-20416",
        "review_rating": "",
        "review_title": "That's why remakes where invented",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "thomaspatt",
        "review_rating": "1",
        "review_title": "this movie is a deadly weapon...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Jiamei",
        "review_rating": "1",
        "review_title": "The Horror, The Horror.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "pinnochio-3",
        "review_rating": "1",
        "review_title": "crap",
        "review_detailed_main": "First of all, as an excuse for watching this movie: My girlfriend brought this piece of crap for around 50 cent as a \"joke-present\". I watched it and used it to produce some kind of parody. Yes, I made a Youtube-Poop out of it. (http://www.youtube.com/watch?v=V1CfK5CzFSo) That was quite good material for this purpose. Now, to say something about the actual movie. It has very bad acting, a script which seems to be written for completely dumb people only and has very bad quality in general. If you want to have a good laugh at some of the poorest things mankind ever produced, go on and watch it. You will not be disappointed. Otherwise to cut it short: This movie is suicide for your brain. Don't watch it!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Documentary? Fiction? Who knows? It's awful either way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "itdk",
        "review_rating": "1",
        "review_title": "Absolutely Hysterical... The best bad movie ever made!",
        "review_detailed_main": "When I first heard about this piece of trash, I knew that I had to find it- I was destined to watch. I'm American, and I don't speak German, so I had an awful hard time finding a subbed copy of any kind. I probably put more work into finding this than I should've, but hey, it was all worth it in the end. Because this film is so nonsensical, it's ludicrous. You NEED to see this movie. I wish more people knew about it. It is just layer upon layer of monstrosity, a music film with a bad musician (I actually didn't think he was terrible, but his dancing and English lyrics were. Stick to German, Daniel.),like 4 different unexplained subplots, bad effects, bad quality filming, and the cherry on top- all of Daniel's on screen \"haters\" constantly take the words out of your mouth as they pummel him with insults about how he looks like a girl and makes their ears bleed. I can just imagine a room of writers thinking about how to get more people to see this film, and one of them coming up with the bright idea to make Daniel a wizard. A wizard, for god's sake! And they don't even really commit to the whole wizard thing, it's totally half assed. I could go on forever, I mean, I've been laughing at this film for months, but I'll sum it up with this: You will laugh (at Daniel), you will cry (at yourself), and you will have a blast watching this beautiful goddamn movie."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "benjaminweber",
        "review_rating": "1",
        "review_title": "A film so awful it transcends language",
        "review_detailed_main": "I approached this film with only a basic understanding of spoken German, enough to order at a restaurant, ask for directions etc. As it was, the version I found did not have subtitles, so I decided to try without. This was in fact not necessary, because this film speaks the international language of terrible film.\n\nThe plot makes no sense, a fault so expertly delivered that no dialogue is needed to convey this to the audience. The acting is bad in any language, and then there's the real kicker: the editing and camera-work. It feels like something someone filmed for YouTube (back before professional YouTubers with high production values came along), the only hint that this isn't the case is the main character performing in concert venues. The sound quality, the picture quality and the slightly shaky picture betray that this was likely filmed on a home-video camera. The editing is virtually non-existent, with a general feeling most of the video clips were hastily stuck together in Windows Movie Maker.\n\nOverall, a must-see for lovers of bad film. It doesn't matter whether you speak German or not, you will still be able to enjoy this bombshell."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "oyesusanne",
        "review_rating": "1",
        "review_title": "Horrendous, has to be seen to be believed",
        "review_detailed_main": "The star of this movie, Daniel Küblböck, took part in the first ever season of the German version of American Idol. He managed to gain some popularity due to his androgynous look and quirky personality. He later took part in the German version of \"I'm a Celebrity...Get Me Out of Here!\" and by now has faded into relative obscurity, but not before leaving us this tremendous achievement of bad movie making.\n\nThe rough plot of this movie goes like this: Daniel is at the height of his popularity, giving large concerts and receiving dozens of fan letters every day. However, many others hate him and his music. His worst hater is a ridiculously edgy guy called Balthasar, who is planning an assassination together with a teenage couple (Tom and Rike). Meanwhile, Daniel is visited by a mysterious one-armed magician figure (played by the director, Ulli Lommel), who tells him that in order to become a magician himself, there are several tests he will have to pass...\n\nNow, where do we start? The beginning of the movie (and several later scenes) show Daniel performing live, but his horrible singing, dancing and his ridiculous outfits quickly become hard to stomach. Speaking of ridiculous outfits, I should mention that the evil killer Balthasar wears a red leather trench coat and has upside-down crosses branded on the back of his head[!]. Judging from the bad image quality, lighting and constant shaking, the movie seems to have been largely filmed on a hand-held camcorder. Adding to the \"charm\" of the movie are some of the exciting locations: Küblböck's living room, the forest and meadow next to his house, a concert hall and the small apartment of the murderous conspirators. The production values are roughly comparable to the home movie project of a sixth grader. The true \"highlight\" of the movie however are the bizarre dialogues and the general ludicrous and nonsensical way the plot goes forward. It's hard to describe and really has to be seen to be believed.\n\nOverall, this might be the worst movie I've ever seen, but I can't say that I haven't been somewhat entertained. If you want to take the dive and watch one of the titans of trash, I think you wouldn't regret it."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "sion-13",
        "review_rating": "1",
        "review_title": "1.0000000000001 out of 10.000000000000",
        "review_detailed_main": "\"The distance between insanity and genius is measured only by success.\" Look at the success of this movie before you decide whether to watch it or not. I've seen so many movies in my short life so far but I think that this one has shorten my total lifespan since it was a total waste of time. If you're insane enough and want a challenge, watch it! But don't blame me after you've done. Special effects: wrong movie dude... 1/10 Sounds&Music: you know... he sings... 2/10 Story/Plot: no action, no tension, no humour, seriously: there's nothing 0/10 (not interesting at all!) Actors: well you know... i guess you can call it 'acting' ... 1/10 Enjoyment: seriously i doubt you're going to like it -.- 1/10 cya"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "liselotte-feilhuber",
        "review_rating": "10",
        "review_title": "Why this movie has so bad votes",
        "review_detailed_main": "Probably all those people who have voted for 'awful' for this movie have never seen it because it was a film made for fans and only about 30.000 people in Germany have seen it. Just to inform those who have never heard about Daniel Küblböck I would like to give some information and background. Daniel took part in the German Idol where he finished 3rd. He certainly was not a very good singer at that time but a brilliant performer and thousands of Germans voted for him and he was shown in TV almost every day. Then there was a voting for the most important German and Daniel was on Place 16 - the German people voted for him NOT HE HIMSELF. Since then he was dissed wherever possible, in TV and in the German press. Non of the other prominent people could believe that such a young boy was in front of them and started to talk bad about him wherever possible. A lot of men cannot stand him because he is everything else than a macho type and THAT is not acceptable in Germany. He likes to laugh and wants to make people smile and his motivation is 'Positive Energy'. He never attacked or said bad things about anybody. Press and TV have made a good job during the last year and take him now as example for bad politics, bad football, bad everything. Daniel's movie was produced by Uli Lommel who was fascinated by this youngster when he saw him on stage when he gave a concert for about 2000 to 3000 fans in Munich. The movie shows now exactly a part of his life. A lot of his fans adore him but also a lot of Germans just hate him. The movie wants to make clear that there is no sense in hating but try to understand other people. As you can see from most of the comments here hardly anybody understood the sense of the movie (have never seen it). It is fact that there are lots of German people who put their whole energy and bad feelings just on a (now) 19 year old boy. If you talk to 'normal' people about this, they just shake their heads and cannot understand it. But these 'sick' people meet on internet sites like 'Let's kill Küblböck' and others and now you can also recognize why this movie got this bad votes. Last but not least just a little information on Daniel. He has improved his voice a lot and gave in December two unplugged concerts in Munich (sold out) where he performed in a super atmosphere and everybody attending this concert was delighted about his 'new voice'."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "ghartwick-15358",
        "review_rating": "1",
        "review_title": "Not the worst, just one of the worst - there's a lot of competition for the bottom",
        "review_detailed_main": "I have to write this to balance out the 10s. I just saw the movie in the original German. That eliminates the possibility of bad dubbing or a poor English edit. As a \"movie\" it definitely ranks as one of the worst ever made. It has the pretension of trying to be an art house film but fails miserably. I think to people giving it a 10 (meaning one of the greatest movies ever made!) are voting for the singer not the movie. His preen German fans are voting not as serious movie goers. I can't evaluate his singing talents (not my area of expertise ) but this voting should be confined to only the movie. This is definitely not worth seeing unless you are like me and trying to see all of the worst movies available (a touch of masochism )."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Emperor_Torgo",
        "review_rating": "1",
        "review_title": "It's a Good Thing his Name is Daniel, Otherwise I Couldn't Guess his Gender",
        "review_detailed_main": "I am so, so sorry.\n\nI am not sorry for this movie. I am sorry for myself. Vain? Certainly. But vanity, I'm afraid, is a virtue in this instance.\n\nDaniel Der Zauberer (or Daniel the Wizard) is a movie about German...entertainer (...?)...Daniel Küblböck. It is apparently supposed to be an art movie about how his singing inspires thousands, but instead of just a bunch of dancing and singing (like the ego trip known as Moonwalker), it seems to have a plot. My German is negligible in this case, so I didn't understand *any* of the dialogue, but according to the handy Internet, a Goth band tries to kill him because his music is better than their's, or something like that.\n\nThere is a character who I guess is supposed to be \"the Wizard\" of the title, Johannes Küblböck. Based on the fact that they share the same last name, I assume he and Daniel are father and son, but we never really learn whose side the Wizard is on; I was perplexed. Sometimes he helps the Goths, then he apparently is playing Santa or something for young Daniel (?). And there's something about a girl and her father, who are No. 1 fans trying to help him, although I honestly don't know what happened. The girl looks a little young for him, is it his sister? The ambiguity, perhaps, is the balancing factor of this movie. In many instances, ambiguity can set up a nice atmosphere, provide a bit of mystery...but this isn't a horror or mystery movie. It's an art movie, and an art movie where I really don't have a clue what's going on. My main problem was that it was hideously boring and the acting was terrible.\n\nOh, and of course, I was especially creeped out by Daniel's...choice of dress. He's not gay, I'm sure, it's just...\n\nAh, well. Terrible. And my favorite movie is Manos: The Hands of Fate."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "lerainieur",
        "review_rating": "1",
        "review_title": "Most awful c**p I've ever seen - but I loved it",
        "review_detailed_main": "OK, there's nothing to say about this movie that hasn't been said. The \"acting\", the \"story\", the \"songs\" - did anyone mention the wardrobe? I almost p***ed my pants when I saw Daniel in his yellow coat at the end of the movie. To all the people who gave it a bad review: Don't watch it if you expect anything. To everyone who likes trash: Watch it. It can't get any trashier than this. If you thought Helge Schneider makes bad movies, you will see that one can sink even lower. OK, no one in his right mind pays money for a movie ticket or buys the DVD, but I say: Gather some people who are into trash, rent this movie, have some (a lot of) beer and watch it!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "grinsekatze00",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "After some of my buddies made me watch this movie I have to admit: Thisis(yes really!) the worst movie ever made! Nothing more to say....except.... I somehow cannot understand how people can give this movie 10 points. Whats wrong with you guys? Some people give this movie 10 points, because they feel compassion for him, but if you are objective, this is the WORST MOVIE EVER MADE.\n\nAnyhow - do not watch this movie, not even if you are drunk and drugged! Serious, irreparable physical and brain damage will occur. For your own sake - stay away from this devilish piece of movie. For any further information about this movie goto hell."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "frederick-schulz",
        "review_rating": "1",
        "review_title": "must see",
        "review_detailed_main": "This is the worst movie ever. 1/10 stars. Worth seeing for everyone who loves bad movies."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "axel335",
        "review_rating": "1",
        "review_title": "-437",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "The_Phantom_Projectionist",
        "review_rating": "5",
        "review_title": "\"Steht mir etwas schlimmes zuvor? Sag es mir, bitte. Muss ich bald sterben?\"",
        "review_detailed_main": "Detractors of German pop oddity Daniel Küblböck who wanted this movie to fail could not have been indulged more than having Ulli Lommel write and direct the feature. Küblböck's polarizing persona melded with Lommel's highly questionable style of filmmaking to make for a movie that I'm surprised ever saw the inside of any theater and is practically custom-made for criticism. If someone greatly dislikes the movie, there's really no arguing with 'em...but as a lover of low-budget filmmaking, I found enough things that I liked to inspire a decent rating.\n\nThe film's biggest liability is not actually its cast or direction, but its screenplay. Lommel's screenplays frequently read like something written by a man on LSD, and this one is no exception. The movie would probably be a lot more coherent if only the story could stay focused on the actual plot. Instead, it entertains no less than five different narratives: (1) the planned assassination of Daniel by a knife-carrying weirdo (Rudolf Brem) and his cohorts, (2) a rivalry between said weirdo and Daniel's ghostly protector (Lommel), (3) Daniel's quest to perform in Hollywood, (4) Daniel's status as a magician-in-training, and (5) the conflict between a teen fan (Marina Lommel) and her grandfather (Peter Schamoni) over Daniel's music. Any movie running under 90 minutes would have trouble exploring all of these subplots, but DANIEL DER ZAUBERER strains itself even further by also focusing on footage from Daniel's live performances, impromptu music videos, and go-nowhere scenes like when the would-be assassins stalk Küblböck outside of his home.\n\nThe level of awkwardness is high. Some of it has to do with the acting - performed by mostly first-time performers - but more of it has to do with the blocking, editing, and the script. Dialogue shots are frequently shoved together in a manner that in no way replicates normal conversation, and scenes are occasionally interspersed with completely unrelated footage. Director Lommel must hate establishing shots, because the viewer is often just dropped right in the middle of a scene without buildup. New characters appear from out of nowhere and strike up intimate conversations with established characters. All of it's very odd.\n\nWhile the film depicts Daniel's vehement critics as old fogies and pathetic weirdoes who scribble death threats, his fans don't look all that great either - not the young devotee who's willing to alienate her grandfather's customers for his music and certainly not the odd girl who cavalierly tells him about how he appeared to her father in angel form (even Daniel seems weirded out by that). The movie is not very effective in drumming up support for the guy, but given its lack of production values and inherently flawed nature, I wonder how much better a more restrained version would have even been.\n\nThere are some redeeming features. While this film kicked off what many consider the absolute worst portion of Ulli Lommel's career, DANIEL DER ZAUBERER has a level of energy that most of his future films lack. Few scenes drag, and unlike subsequent Lommel fare like DUNGEON GIRL, this one actually feels like it's building towards a planned conclusion and not something the crew came up with on the fly. The actors' performances can be contrived, but they're all pretty sincere and played with more confidence than you'd find in a typical no-budget movie. Fans of the main star will probably be disappointed that Daniel is no way cut out to be a dramatic actor, but they'll appreciate the presence of several exclusive songs that have yet to be released in other formats. There's even the occasional feel-good scene, like when Daniel and his on screen grandmother (Katja Rupe) discuss his deceased grandfather.\n\nThis one's hard to recommend to most people, but if you tend to like films that the rest of the world seems to dislike, this one may be or you!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "hoorx",
        "review_rating": "1",
        "review_title": "soldier in Iraq looking for this movie!",
        "review_detailed_main": "I know this is supposed to be for reviews and I'm sorry for misusing it but I am a soldier in Iraq and I'm dying to see this movie and I can't find it anywhere. If anyone has it or a link to somewhere that I can buy it please let me know. I have searched high and low on all the big named sites American and European and I can't find it anywhere. If you can help me please send an email to hoor3x@hotmail.com thank you very much.\n\nThere needs to be at least 10 lines of text for this message to be sent out so...\n\nmy email is hoor3x@hotmail.com\n\nany help would be appreciated!!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "lingling-2",
        "review_rating": "10",
        "review_title": "Wonderful Film",
        "review_detailed_main": "I don't know what I expected but I was totally surprised. When you think that this was Daniels first movie, it's amazing how talented he is. Sensitive film with a lot of good music - 3 new titles and some original scenes from the concert that Daniel gave in January 2004 in Passau 2004. I can totally recommend this experience. All the other actors do their best but it is obvious that Daniel Küblböck is the star. I must apologize for the intolerant German people who are frightened to try something new and who just want to see their old actors and old fashioned movies (Otto, Bully). I'm sure that abroad this film will be much more successful. In Germany we are not ready for this yet, but the whole world is waiting for Daniel. Richard"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "kosmasp",
        "review_rating": "1",
        "review_title": "No magic here",
        "review_detailed_main": "And no pun intended here either - well maybe that is not entirely true. It is quite easy to make fun of a movie like this - and calling this a movie is quite the stretch. That is still putting it mildly. Daniel could not act if his life depended on it - and I really don't want to be mean or whatever you would want to call it. He looked like quite the happy go lucky man. But like all \"clowns\", he was pretending to be happy on the outside and was quite sad on the inside.\n\nThe ridicule he had to endure - he was not protected enough from that. And whatever happened to that cruise he supposedly jumped off and was never to be seen again ... sorry this got dark. I had not seen this ... product since it was released, but I had heard that it was a disaster. And if you consider that it actually had a director who should know better ... who had done way better work before ... ah well, he needed the money and just tried to make the best of it.\n\nAgain, it is quite tragic how over a decade I think after the movie was released, Daniel felt still bullied, still had the issues inside of him. But not calling the movie for what it is would not achieve anything. And as I have made clear enough I reckon, this is not his fault! It is the fault of managers, people around him I assume and anyone pressuring him without protecting him.\n\nBy the way, I said he can't act ... it is not like anyone else in this ... thing can act! No one seems to be able to conjure emotion ... make you believe they are in a movie and playing a character ... While this isn't technically a horror movie, I will count this as an addition to my Shocktober Challenge I am currently doing ..."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Horst_In_Translation",
        "review_rating": "2",
        "review_title": "Really harmless, but really bad too",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "philipphoerning",
        "review_rating": "1",
        "review_title": "Easily THE best worst movie of all time.",
        "review_detailed_main": "I feel so sorry for the non-German speaking audience because you will miss out on the whole expierience.\n\nThis film is a desaster but it fails so horribly on every angle it is a masterpiece of awfulness.\n\nThis movie was the most low-budget film that somehow made it actually to the cinemas in Germany, but was cancelled by the theatres after 1-2 weeks after screening.\n\nTitle role and \"actor\" is Daniel Küblböck who was the third place of Germanys first \"Germany's got talent\" show. He was a goofy odd-ball at the time and the media made fun of his persona. He had his 15mins of fame and the director Ulli Lommel tried to capitalize on that with a weird really weird bkographical'ish take what was going on: Daniel hated and loved by people, he polorized.\n\nThe movie itself is just absurd to the max. The acting is horrendious. But afterall its like watching a beautiful trainwreck, its unintentional art to its finest.\n\n1/10 MUST SEE!!!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "seanyboy-92561",
        "review_rating": "",
        "review_title": "I haven't even seen this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "mucher2000",
        "review_rating": "3",
        "review_title": "It isn't THAT bad.",
        "review_detailed_main": "Come on, seriously, I have checked this movie out recently.\n\nIts just mediocre, thats all. Sure, Daniel is a lousy actor, but hey, his career has only started recently, give him some time for pities sake! Okay, the script stinks, but I have seen worse (Braveheart, Troy and Ben Hur being good examples). Just give the young fellow a chance to prove himself instead of just bashing him without a valid reason. Its always easy to blame young talents. Keep the work up Daniel, although the movie is really not great. You should check this one out: http://www.3-engel-fuer-charlie.de/ (great movie) Heads up, Daniel, some people just don't know the ways good movies are made. Including yourself, but you can still change."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "lillyjessen",
        "review_rating": "5",
        "review_title": "Very Interesting Movie with Good Potential",
        "review_detailed_main": "This movie is definitely an odd one, it's laughable and an adventure. It definitely dabbles in the whimsical and absurd subjects. It was very fun to watch because of its confusing and absurd moments. I think that \"absurd\" is really the best word I can think of. It had good potential, the actors weren't bad except when they had to act mysterious. Anyways, the acting overall wasn't bad, the production was definitely unique, I find it interesting that the camera movements reflected the events in the film. The sound was very good for a movie like this, the film quality was kind of low but it was okay for 2004. The movie is kind of crazy at the beginning but, once you get to end where everything is more understandable its definitely a better watch and more tame. The movie definitely had a few good moments, the wizardry aspect definitely seemed kind of out of place. Overall, I picked 5/10 because it seemed like an artsy and complicated movie half of the time but the others, a weird mash of things."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "britta_stoever",
        "review_rating": "10",
        "review_title": "A magical mystery film",
        "review_detailed_main": "\"Daniel der Zauberer\" is a magical mystery story of love an hate.\n\nIt's an Art-House film about the problems of the unhappy German people with a lucky boy, who makes what he wants. It's no fiction! \"Daniel\" plays himself. In the autumn 2002 he went to a casting-show. He was just 17 and came out of the deep bavarian forest - he was quite naive. His voice wasn't the best, but his performance was very special and original. Some people loved this natural talent and other (real) German people said: Only someone who worked hard on his voice and choreography can be a star! By this way: This voting is manipulated from people, which like to hate Daniel! The story goes on... Sorry, but my English is very bad."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "svkleber",
        "review_rating": "10",
        "review_title": "Best movie of the last decade?",
        "review_detailed_main": "I can't understand why this movie has such a bad rating. I have just watched it and I liked it very much. Acting, camera and sound is just beautiful. The use of horrible camera positions and incredible, awesome and wonderful performances of Küblböck itself are godlike. The acting of the wonderful Daniel Küblböck reminds me sometimes to the, maybe not that good, acting of Robert de Niro as Travis Bickel in Taxi Driver (In my opinion 8/10, Daniel 10/10). All I can say is that from this day, until the ending of the world, Daniel is my personal wizard, in fact he's my role model! To sum up the movie I can only say: No words can describe this wonderful piece of art. Watch it, enjoy it, watch it again."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "primrose21",
        "review_rating": "",
        "review_title": "What you get is what you see",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "ninapony",
        "review_rating": "10",
        "review_title": "Entertaining, arty fan movie",
        "review_detailed_main": "This is surely not an easy film for non-fans, because it is densely constructed around Daniel Kueblboecks personality and insofar a real Daniel overdose. For fans, it is a warm summer rain with the extended concert scenes and music videos. Neutral viewers should just relax and tune in to the rhythm of the movie. The technique reminds of danish dogma movies, with a shaky camera and improvised, spontaneous action, often without a script. It is highly amusing to watch the protagonist Daniel Kueblboeck switch his personalities from demonic stage god to cute and childlike sweetheart to sad and disillusioned grown-up. A highly charismatic and entertaining person. The actors are mostly stage actors and give the dialogs a theatrical atmosphere. 1 credit off for the unintentionally comical scenes at the family hearth."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Philly2000",
        "review_rating": "10",
        "review_title": "Amazing film, amazing actor",
        "review_detailed_main": "I've seen the movie a few days ago...I was so surprised that it was really great. I enjoyed every second of it.\n\nThe movie creates a very special atmosphere. It's in no way professional but exactly this fact makes the film so good! Daniel is a great actor and so are the actors of the other characters. Every scene speaks of its own and of course the highlights are the scenes form Daniel's last concerts.\n\nTo sum it up - the movie is worth watching, not just because of its fantastic main actor. Also even people who aren't fans of Daniel should go and see it. They'll be surprised how good this film is!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "bellamazingo",
        "review_rating": "10",
        "review_title": "Absolutely amazing, the most quality film I have ever seen.",
        "review_detailed_main": "I can't believe what I saw in this movie. First, the quality was amazing, it definitely didn't look like it was filmed on a flip phone! I could not have asked for a better viewing experience. Second, the acting was extremely realistic! The acting looked very natural and not at all like they were being held against their will! Third, the plot was astonishing! Very well written and not confusing at all!! Fourth, the message behind it was very deep. It made me think that I should aspire to be just like Daniel because he is my idol now. Also, I would just like to appreciate the music in this film! It was so gorgeous and I would like to listen to it while dancing in the rain!!!!! Overall, probably the best movie I have ever seen! 10/10 would recommend, will watch again!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "y-49040",
        "review_rating": "10",
        "review_title": "Epitome of perfection!",
        "review_detailed_main": "This movie was absolutely peak. Now I realize how great films like The Godfather or Shawshank Redemption were made. Those guys must've time traveled to watch this masterpiece and take notes from it! The plot is original, the characters are absolutely wonderful and the shots are extremely high quality. Although it has a bas reputation, it's because of the prejudgement coming from the first few minutes. There are also a lot of major abstract themes tackled in the film, like violent greed and envy. This movie is a total masterpiece AND a commentary on the society, just like its animated rivals Foodfight! And Trolland. I recommend this movie to everyone, regardless of age, gender or ethnicity."
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "muhamad-86570",
        "review_rating": "10",
        "review_title": "Unexpectedly Enjoyable: A Fresh Take on Fame in Daniel der Zauberer",
        "review_detailed_main": "A week ago, I watched Daniel der Zauberer with an open mind, despite its negative reviews. I wanted to give it a chance and see what it was about. The plot follows a boy who becomes famous through a TV show and faces challenges with people who don't appreciate his music. The main character is portrayed by Daniel Küblböck, a popular figure from Germany's Pop Idol.\n\nTo my surprise, I actually enjoyed the movie! While it may not be a typical blockbuster, it was good in its own unique way. The movie gave me a fresh perspective on a celebrity's struggles with fame and the pressures that come with it. For those who appreciate quirky, offbeat films, this could be an interesting watch. It might not be for everyone, but I can see how it might appeal to fans of Küblböck or those looking for something different. If you're curious, give it a try - it might surprise you!"
    },
    {
        "movie_id": "tt0421051",
        "movie_name": "Daniel the Wizard",
        "movie_rating": "1.2",
        "review_username": "Kdosda_Hegen",
        "review_rating": "8",
        "review_title": "It is not a good film in an objective sense but...",
        "review_detailed_main": "I sure can see how most people would consider this one of the worst films ever made. Production is super cheap in half the scenes. And a few scenes have some random nonsensical moments which are even weirder than the bizarre main events that surround them. The plot is very odd and the film gives very eccentric vibes for better or for worse.\n\nBut I found the film to be overwhelmingly heartwarming and uplifting. It is also such a personal project - semi-fictional and semi-biographical as it involves some events from the singer's life that actually happened in real life but also features tons of fantasy elements as well. It is such a passion project and I was so cheered by it that it would be impossible for me to dislike it.\n\nI personally really loved the songs and Daniel is beyond cute. He's so adorable, beautiful and charming, but I have a thing for skinny guys with long hair so maybe it's just me.\n\nBesides everything, the film also somewhat foreshadows the disturbing events that followed years later in real life. So, now it is an important film to exist as a historical artefact in retrospect to the singer's death."
    }
]