[
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "gepyr0",
        "review_rating": "2",
        "review_title": "Title should have been \"How Zoe killed us all.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Sleepin_Dragon",
        "review_rating": "4",
        "review_title": "A disappointing watch.",
        "review_detailed_main": "Zombie movies have literally been done to death, no pun intended. Nowadays the expectation is for something slightly less unoriginal, with a huge budget, and the usual shocks and scares. Sadly this one fails on both counts, there is absolutely nothing original, and the budget was evidently fairly low, as at times it looks a little cheap. The start was pretty decent, and the Zombie stalker thing was perhaps a little different. The acting was sadly a little below par too.\n\n4/10"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "omendata",
        "review_rating": "3",
        "review_title": "Day Of The Dudd",
        "review_detailed_main": "Why is it with a budget of 8 million you cant make a better version than the original which cost a mere $3,000,000; its not rocket science but I guess you need a Romero at the helm.\n\nNot very scary or claustrophobic like the original was, woeful acting, illogical situations. cheddar cheesy dialogue and blood shooting out like a hose made it comical - The Walking Dead has it spot on so why not just copy if you dont have a clue what you are doing. I wont mention the ending which had the entire audience laughing - Oh my what were they thinking? And to add insult to injury the thrash metal \"nettle-rash\" music as my old dad used to call it at the end credits really did aggravate an already aggravated viewing sesh!\n\nIts not awful - the people who give 1 star are as bad as the shills who give 10/10 to every movie they review and havent a clue what the ratings systems means - 1 star means its the worst movie you have ever seen; watch \"THE BAD BATCH\" with Keanu Reeves then come back and tell me you would still give this a 1 star.\n\nTo be fair Johnathon Schaech did a pretty good attempt at the original Bubba-zombie (he was the best actor in the whole thing) and the effects were not bad. The Dawn Of The Dead remake has been one of the best Zombo remakes but sadly this one is not. How very disappointing I must say! We can only hope Peter Jackson gets his Zombie movie that he has been talking about for over a decade off the ground, until then I guess us die hard zombo fans will have to make do with The Walking Dead!\n\nA fair 3/10 from me!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vrijevoeten",
        "review_rating": "1",
        "review_title": "The most stupid heroin ever.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "patrickrobinson-72136",
        "review_rating": "",
        "review_title": "This is shit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vonschmeel",
        "review_rating": "1",
        "review_title": "complete rubbish - run away from it",
        "review_detailed_main": "I built this account just to warn people how bad this film is. save yourselves and dont watch it, its the worst low budget everything under the sun including acting. a film by fans for fans,of themselves...\n\nit should be a crime to use \"day of the dead\" for garbage like this\n\nRomero is rolling in his grave right now"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "raymondlc",
        "review_rating": "1",
        "review_title": "Terrible Acting, Terrible Plot, Terrible Characters",
        "review_detailed_main": "Just all around a dreadful occurrence in film history.\n\nThe main protagonist checks all the boxes on the \"dumb things to do in an apocalypse\" checklist. Add to that the massive plot holes and bad acting and you get a recipe for failure.\n\nWhile the main character is the absolute repository for bad ideas you'd be amazed at how stupid the other characters can be, it's as though they all want to die. For example in one scene zombies flood into the area, this is followed by one of the characters running TOWARD AND PAST the horde of zombies, followed immediately by the protagonist. Naturally these flesh hungry zombies let both individuals pass without harm after all we're watching a terrible movie.\n\nAll of this hullabaloo because she needs a zombie alive. Following this massive plot hole what does she do? She kills the one she wanted alive.\n\nThis movie is garbage don't bother watching it, I'd watch a 100 hour marathon of The Wiggles before I watched this again."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "paulwattriley",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "Why are people intent on wasting money making poor movies. After 2 minutes you can clearly tell that this is going to be an awful movie.\n\nSince when do people explode blood when bitten. What was the zombie wiping the wind screen with blood inside the car all about?\n\nPoor script with even worse acting."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "anunsguy",
        "review_rating": "1",
        "review_title": "Very very bad movie and it's not a remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "imdb-2965",
        "review_rating": "1",
        "review_title": "Irrational behaviour in the face of danger",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mhorg2018",
        "review_rating": "1",
        "review_title": "Are you kidding me?",
        "review_detailed_main": "First, I'll be entirely honest. I absolutely hate remakes. 99% of them are utter crap, made by no talent pinheads trying to use an existing success to lure chumps in to see their crappy, ill thought out tax break films. This is no different. I didn't think that there could be a worse remake of Day than that horrible 2008 version, but this one is EVEN WORSE. Someone should make a movie where George Romero comes back as a Zombie and KILLS everyone even thinking of making another remake of one of his movies. This has everything bad. Acting. Storyline. Plot. Even the zombies are bad. At 90 minutes long it felt like three times that. Just a horrible waste of time."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ocnav87",
        "review_rating": "10",
        "review_title": "Made my mates and I laugh constantly",
        "review_detailed_main": "The way people's blood exploded is worth 10 stars haha\n\nLots of gore. The plot I thought was quite original for a zombie flick. Simple but original. It's just a not-to-be-taken-too-seriously zombie flick to make you and your mates laugh. Good times."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "gojiseb",
        "review_rating": "7",
        "review_title": "It's not the original, but it's a fun time!",
        "review_detailed_main": "When another remake of Day of the Dead was announced, the horror community was already up in arms. And for good reason. The last two attempts at \"reinventing\" Romero's nihilistically grim third installment in his \"Dead\" series were total unmitigated disasters. And from the sounds of it, this one was going to be no different...\n\nLow and behold, the film is released to scathing reviews left and right. And I won't sit here and pretend I don't get it, because I do, but I will say this...for whatever the hell it's worth, I personally thought it was very fun. It's trashy, cartoonishly violent (literal EXPLOSIONS of blood whenever someone gets bitten) and just plain silly at times. But I think that's why it works. It reminded me a bit of the Italian zombie flicks that were made in the wake of Dawn of the Dead and it seemed more focused on being an entertaining movie than trying to top the original.\n\nThe cast is generally pretty poor with Sophie Skelton making a bland protagonist (a sort of cross between Sarah and Dr. Logan from the original), Jeff Gum being an incredibly lame substitute for Joe Pilato's legendary Captain Rhodes and Marcus Vanco just being plain old boring.\n\nThe big exception here would be the top-billed Johnathon Schaech as our main antagonist Max. Max is essentially meant to be this movie's version of Bub, but whereas Bub was a lovable and sympathetic character, Max is a flat-out despicable monster from the get go. He makes a solid villain and the scenes where it's just him interaction with Skelton are genuinely effective. The third act really picks up thanks to shifting its focus mainly onto him.\n\nSo at the end of the day, it's not going to blow anyone's minds and if you walk into it wanting something on par with the original, then you're just asking to be disappointed. But if you're craving some old-fashioned splattery direct-to-video zombie action, you'll probably have a fun time with it."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "alistairc_2000",
        "review_rating": "1",
        "review_title": "Sh*t Sandwich.",
        "review_detailed_main": "This is one of those time when I wished I had listened to my gut feeling. It said avoid this trash but I was like how bad can it be? As bad as Day of the dead Contagion (a turkey which had nothing to do with the original movie)? As bad as the Steve Miner one? It is on a par with the Miner movie. It just feels like a generic zombie trash movie. Like zombies of mass destruction or zombie planet to name two from the cannon of so bad they are awful zombie movies. The movie itself is just generic zombie schlock. If they had called in zombies in Mexico then it just would have been a 2 out of ten trash movie. Saying it is based on the George Romero movie is an insult. Watch this at your own peril."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jamieselbebowsel",
        "review_rating": "1",
        "review_title": "Really?",
        "review_detailed_main": "I am getting sick, really sick, of these hacks \"remaking\" classic horror movies. This is a theft of a name/brand. This is not even a zombie movie. Its a total mess and a joke. Zombies aren't stalkers. Blood does not spray out of a humans body like a fire hose. With the budget they had for this, they could have at least found some people who could act their way out of a wet paper bag. They failed. Even DOTD 2 Contagium was better written and acted, and my dog could crap out a better movie than that turd.\n\nI wanted the main girl to die within 30 seconds of seeing her character on screen. She caused the death of almost every character by her stupidity. But hey, all she had to do was take some blood from her stalker zombie ex-patient, who tracked her down from the smell of her panties, and she saved civilization. Great writing.\n\nDO NOT WASTE YOUR TIME ON THIS PIECE OF CRAP! 'nuff said"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Athanatos173",
        "review_rating": "5",
        "review_title": "Sub Par",
        "review_detailed_main": "From what I understood, Day of the Dead Bloodline is supposed to be a remake of Day of the Dead (1985).\n\nNow I must state for the record that I am not a fan of remakes as they usually fall flat, and I can't understand the need for them in the first place, and it shows a lack of originality as well.\n\nWith that statement out of the way, Day of the Dead Bloodline was in fact far inferior to the original Day of the Dead, though to be fair it bares very little in common to the original.\n\nThe acting was amateurish and the script was poorly written. The effects were actually pretty good, with the only exception being blood constantly expelled with explosive force from people being attacked, which is fine if you are watching a comedy but not so much in a supposed horror movie.\n\nAll in all, I wouldn't recommend this movie, though if you have nothing else to do and want to watch it, go ahead, just don't expect something memorable."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "LoneWGK",
        "review_rating": "1",
        "review_title": "Zombies all of a sudden geniuses and stalker",
        "review_detailed_main": "The movie started out so so.\n\nWhat totally made me think this is crap is when they all of a sudden made the zombies clever. The one zombie is now a stalker and only goes after the specific woman. Its like a serial killer/rapist stalker movie but using a zombie do it.\n\nThey could not make up their minds if they wanted to make a zombie movie or serial killer thriller.\n\nZombie carrying a grudge and angry after seeing the woman he is after kissing her boyfriend. I mean come on, really.\n\nZombies is supposed to be brain dead and only want to eat the living, in older movies zombies were slow as well, now they break records running sprints here. But i can still live with that, just not the genius stalker serial killer zombie.\n\nThe rest got spoiled by bad acting and sloppy camera work.\n\nNot a good movie at all. Do not waste your time."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "kardosma",
        "review_rating": "1",
        "review_title": "This is to Romero's originals what canned spaghetti is to authentic Italian pasta",
        "review_detailed_main": ".. that is to say, tastless rubbish.\n\nI love the horror genre, and especially the classics and those movies with fresh new ideas. This one? Sigh. It's formulaic, follows a standard character profile (the army guys, the cranky leader, the gormless younger brother, the driven med student/female love interest...) with predictable plot points throughout, and what must surely be the most stupid characters in the history of horror cinema. I mean, this goes way WAY beyond \"heard a noise in the dark basement, goes to investigate\" kind of stupid. And don't even get me started on the ultra cheesy ending... this movie really should come with vomit bags. Truly.\n\nWhen your entire storyline would have been negated by even one sensible/logical choice at some point, there's something very wrong.\n\nThis stinker is best avoided; if you can't, then try to find the humour in it like some other reviewers did - that'll help you get through without tearing your hair out!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "freqeteq",
        "review_rating": "3",
        "review_title": "It may be bad but at least it's only 90 minutes long.",
        "review_detailed_main": "There is absolutely nothing new or interesting to be found in this budget zombie flick.\n\nThe story is fine I guess, but the screenplay that tells that story isn't, it's full of poorly written characters in cliched situations full of worn out horror tropes that you've seen 100 times before and done 100 times better.\n\nThe acting swings wildly between just OK, awkward, and completely terrible. Some of the actors deliver their lines as if punctuation is a foreign concept to them, there's no pauses or natural flow to the monotone words falling from their mouths. The lead actress does a few voiceovers throughout the film that are delivered so poorly that it sounded like she was reading them for the first time as they recorded her.\n\nWhen it comes to direction and camera work the action is your typical low budget handheld shaky cam style, it's functional, it does the job and that's about it. There's nothing special or inspired, no shots that make you sit up and take notice. Any young aspiring directors out there aren't going to be rushing out to copy this directors style, if you can call uninspired and forgettable a style. I will say that the practical zombie and gore effects are well done, though variety when it came to how things died would have been nice instead of just zombie death = headshot and human death = bite on neck from zombie.\n\nIn the end this is a very mediocre horror film full of poorly written cliched characters portrayed by mostly terrible actors, the various situations they find themselves in have zero tension because the script is so uninspired and predictable that you always know what's coming next. If you're like me you'll be rooting for the zombies after the first 10 minutes.\n\nI give it 3/10\n\nYou don't need a lot of money to make a great zombie type flick, all you need is a good script and a passionate director with a vision, for proof of this go watch The Girl With All The Gifts or 28 Days Later that both had similar budgets to this movie."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ekim1982",
        "review_rating": "1",
        "review_title": "A Complete Insult to Its Namesake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ommbomb",
        "review_rating": "2",
        "review_title": "George Romero would be spinning in his grave!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "thehorsetowater",
        "review_rating": "",
        "review_title": "Bacterial Pneumonia...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bigosc",
        "review_rating": "10",
        "review_title": "Trash",
        "review_detailed_main": "The acting, special effects and story was awesomely horrific. Couldn't stop watching though. Nothing better to do lol"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "zombie92-853-937706",
        "review_rating": "7",
        "review_title": "Enjoyable if you don't watch it as a \"remake\"",
        "review_detailed_main": "It had original zombie and lots of gore, what's not to like."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "him-61157",
        "review_rating": "1",
        "review_title": "One of the worst movies ever made",
        "review_detailed_main": "The movie is terrible, nothing in it is even decent, the characters suck, there \"story\" if you can call it that way is just not there, it's so bad it will make you wonder why does this even exist"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "playabball",
        "review_rating": "1",
        "review_title": "Worst movie I have ever seen!! Do not watch!!",
        "review_detailed_main": "I literally made this account just to write this and tell everyone this is the worst movie I have ever seen. You know that in horror movies people do stupid stuff that is obviously the dumbest thing you can possibly do in that situation, like knowing there's a killer loose in your house and hearing a noise and going to check it out yourself. You guys know what I'm talking about. Well imagine that times infinity for a while movie. You will lose brain cells watching this. I literally wanted to go back to high school after watching this because I am now back at 3rd grade intelligence. The stupidest possible thing they could've done at every point in the movie wasn't what they did no.. they saw the stupidest thing they could possibly do in every situation and multiplied that by quadrillion infinity stupid and then did that. I am so mad I wasted my life watching this and I'm surprised nobody has committed suicide after watching this movie because of how bad it was. The disrespect this movie brought to every aspect of a horror movie... the fact that they even mention the original day of the dead title in this movie!! I cannot believe somebody actually wrote this whole movie and people actually thought it was a good idea. They should have to pay me a million dollars for the ptsd this movie will give me for the rest of my life because of how garbage it was. DO NOT WATCH I REPEAT DO NOT WATCH THIS MOVIE. DONT EVEN LOOK AT IT. it's not one of those reviews where you are like oh well it got bad reviews but I should just give it a chance and decide for myself. NO. THIS MOVIE SHOULD BE BANNED FROM EVERY COUNTRY IN THE WORLD BECAUSE OF HOW BAD IT IS. ok I'm done. Do me and your family a favor and do not watch this and make society dumber from the amount of intelligence you will lose from this. Don't."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "calypso-38561",
        "review_rating": "5",
        "review_title": "Only two and a half minutes in and it's already stupid.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "AnnahMH",
        "review_rating": "1",
        "review_title": "What the hell did I just watch???",
        "review_detailed_main": "This is the type of movie that would make Romero roll in his grave.\n\nDear god, the acting was horrid. The scenery was high schoolish, the script felt like a group of 7th grade drama students watched it after binging all six seasons of \"Saved by the Bell\" (no offense 7th graders)\n\nSo much of this didn't make sense.\n\nWhy the hell would a zombie smear blood on the inside of a windshield? Because it looked cool?\n\nHow the hell did the doctor instructor become a damn zombie?? Did her cosmopolitan drink turn her into a Zombie?\n\nSo people explode when they get bitten now?\n\nZombies now wear the large intestines as necklaces now?\n\nSo the US military wears circa 1983 military fatigues?\n\nWas the set filmed at Universal Studios in Orlando Florida?\n\nI cannot state how bad this movie is.\n\nAt least \"The Room\" made an effort at trying to be good."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tichy_cnp",
        "review_rating": "1",
        "review_title": "Abysmal",
        "review_detailed_main": "So at this point we should assume any movie trying to capitalize on the night of the living dead franchise is cancer. This movie was painfully dull. Romero couldn't have saved it, not that he would. I fast forwarded through the last 30 minutes."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bdbusiness",
        "review_rating": "1",
        "review_title": "George Romero is gonna wake up and slap yall",
        "review_detailed_main": "This was complete garbage from start to finish I've seen Cinemax movies with better acting"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Platypuschow",
        "review_rating": "5",
        "review_title": "Day of the Dead Bloodline: Another failed remake",
        "review_detailed_main": "Day Of The Dead (1985) has held its ground as one of the greatest zombie movies ever made and one of the jewels on the crown of the true king of zombie movies George Romero.\n\nWhen it was remade back in 2008 starring Mena Suvari it understandably flopped, it had big boots to fill and failed spectacularly. For whatever reason 10 years later in what is already shaping up to be one of the worst years in movie history they decided to remake it again.\n\nBloodline is exactly that, it's not just a cashgrab attempting to live off the originals name it is in fact an attempt at a remake. Sadly however they decided to change a great deal and that doesn't sit right with me.\n\nIt follows our heroine as she lives in the military bunker alongside civilians and soldiers alike. The soldiers vs scientists dynamic that made the original so memorable has been removed altogether.\n\nThey have a Bub like character, but he is an abusive stalker of our leading lady and is smarter than the rest of the zombies. Relentlessly pursuing her which is interesting but simply not Day Of The Dead.\n\nThough I don't think this is bad it certainly isn't good either. It's an offensively inferior remake of a movie that needs to be left the hell alone. All the changes to the plot have done it no favours, the pacing is dreadful, the characters are interchangeable and the \"Bloodline\" thing is pointlessly tacked on.\n\nThe Good:\n\nCouple of nice nods to the original\n\nLooks better than you'd expect\n\nThe Bad:\n\nInstantly forgettable characters\n\nAwful pacing\n\nSimply shouldn't exist\n\nThings I Learnt From This Movie:\n\nBeing bitten by a zombie will cause a mini explosion which sprays blood upwards of ten feet\n\nDuring the zombie apocalypse while seeing people being ripped apart and while surrounded by zombies it's best to take a leisurely walk through the middle of it all and have a telephone conversation"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "juke430",
        "review_rating": "1",
        "review_title": "Don't do it!",
        "review_detailed_main": "ATTENTION: This movie is sooo bad if I could have traded places with Glen from TWD, I'd love a facefull of Lucile from Neegan. This movie makes House of the Dead look like Citizen Kane of the zombie genre. If you know anything about movies at all -let's just say this director makes Uwe Boll look like Spielberg. Bad everything. Even the extras were bad. Dead or alive! Zoe...I'm shaking my damn head. You had one job."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "The_Techpriest",
        "review_rating": "",
        "review_title": "Warning - Do not waste your time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "titsmaster",
        "review_rating": "10",
        "review_title": "THE BEST comdey zombie ever!!!, its a comedy... right?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "thatmaninblack",
        "review_rating": "6",
        "review_title": "Solid 6/10 for an entertaining movie",
        "review_detailed_main": "Looks like another movie that getting hate for no reason. Sure, it's not perfect, it's cheesy at the end, but the acting is ok, I liked the main zombie's background story, the main actress is great looking and she also plays well. The gore effects look ok, even the CGI is ok. There is plenty of action, the characters are fine. The army guy in charge made sense, the main female character also had her reasons, it made sense why the zombie went after her, and the boyfriend character is also likable.\n\nI liked the original, I liked the 2008 one and I like this one too. I guess if you think the 2008 was ok, then you gonna like this movie too.\n\nPeople giving 1 or 2 or 9 or 10 points make no sense. This movie is a solid 6 from me, because it's re-watchable.\n\nUnfortunately this movie became the victim of the \"it's hip to hate the movie\" thing, since many people jumped on that bandwagon.\n\nOther thoughts: The original is made of $3.500.000 back in 1985, this one made of $8.000.000. If someone knows what inflation is, realizes that this movie's REAL budget is lower than the originals, since $3.500.000 back in 1985 did worth more than $8.000.000 in 2018."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "steo-dono",
        "review_rating": "1",
        "review_title": "No actors, no plot, no horror",
        "review_detailed_main": "Terrible movie and I normally like bad movies. I can't understand why everything nowadays needs a back story. All three of the original films barely gave us anything in backstorys we don't need it! The lead women is god awful her pure stupidity is only matched by her complete lack of charisma, the actress should never of been put in a lead role but that's not to say any other actor on screen was any better even the zombies didn't quite work. Not scary, not funny not even worth trying a drinking game with it. Like take a shot every time someone try's to convey an emotion and fails. If you love horror, zombies and strong leading women then give this a miss."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bowmanblue",
        "review_rating": "2",
        "review_title": "Seriously?",
        "review_detailed_main": "I was into zombie movies BEFORE zombie movies became cool again (some time in the early 2000s I believe when 'Resident Evil' appeared on the big screen. Therefore George Romero's 1985 film 'Day of the Dead' (or rather sequel to two classics - 'Night of the Living Dead' and 'Dawn of the Dead') was a real favourite of mine.\n\nIn fact (and don't hate me for this!) even though 'Day' wasn't quite as well-received as its two predecessors, I actually liked it the most. I loved its darkness, sheer terrifying claustrophobic nature, cast, gore - in fact, everything about it. Now, skip forward a couple of decades where I'm allowed to browse the internet and I find out that - for some reason - the actual TITLE of the film, i.e. 'Day of the Dead' was never copyrighted (or something). This meant that, if I so wished, could make my own version of the film (maybe with some sort of addition-tagline just to cover myself) and not get sued. This went some way to explain 2005's 'Day of the Dead: Contagium' (don't watch it - trust me!). And possible 2008's remake of 'Day of the Dead' which confused many into thinking it was a sequel to the (quite excellent) 2005 remake of 'Dawn of the Dead.'\n\nI don't know why I watched 'Bloodline.' Maybe it's because 'The Walking Dead' is currently between seasons, or because 'Bloodlines' is on Netflix. Either way... I wish I hadn't. Although, like any good car crash, I couldn't turn it off.\n\n'Day of the Dead: Bloodlines' has some of the worst acting I've ever seen. It also has some of the most obvious sets I've ever seen. The gore is okay, but too over-the-top for a film that's not supposed to be a 'comedy-horror' and the characters are more one-dimensional than your average daytime soap opera. So why did I continue to watch it? Possibly because I couldn't believe that someone was not just content with ripping off the 'Day of the Dead' title, but they've basically remade the original film... only much worse.\n\nMost of the original characters have been 'updated' (any by 'updated' I mean turned completely one-dimensional by second-rate actors), although a few names have been changed and/or applied to different characters. They've taken the setting, the characters, recreated the location (albeit badly in a set, rather than a real underground missile silo) and palmed it off as some sort of update. And - surprise, surprise - it doesn't work. They've even turned 'Bub' (aka the slightly more intelligent zombie from the 1985 version) into a slimy stalker, although, in the actor's defence, he's probably the best actor in this remake.\n\nIf you like zombie movies - great. Just watch a different one, as you're bound to have a few in your collection. Just because this is 'free' on Netflix, doesn't mean you should waste your time on it. It really is that bad. 'The Walking Dead' will be back soon enough. Even if you think the TV show is getting stale, it's still head and shoulders over this garbage."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Tweetienator",
        "review_rating": "4",
        "review_title": "So So in Zombieland",
        "review_detailed_main": "Day of the Dead: Bloodline is not the most bad zombie movie on earth but it is also not a good one. There are good remakes of Romero's work: Zack Snyder's Dawn of the Dead (2004) is an excellent one and Eisner's The Crazies (2010) is good/okay.\n\nDay of the Dead was already redone by Steve Miner in 2008 and as it wasn't a total failure its \"quality\" reminds me a lot of Day of the Dead: Bloodline - the production value and effects are good and far better than all those zombie flicks done by some buddies or students of filmmaking but the storytelling and acting is, let's say, improvable.\n\nIn my opinion Day of the Dead of Romero got some issues too (the acting, well, improvable) but it got an excellent atmosphere or feeling, claustrophobic and dark. Also in one point Romero did a far better job - there are no filling scenes, the tempo, everything is raw to the bone and therefore I never felt bored, stretched or something. I could imagine myself in that bunker, surrounded by the dead, wondering how that would be, what I would do etc. pp. (back then I was too young but I still managed to sneak into the cinema). Bloodline does not in any sense give me that kind of \"feel\" at all.\n\nBloodline follows just loosely the ideas/story of the original. My question here: why call it then Day of the Dead at all!?\n\nFinal words: Bloodline's story is standard, predictable, a little boring, and there is no actor on board who did inspire any real empathy on my side.\n\nWell, if you are an aficionado of all zombie related (like I am), you may dare to watch."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ianbhunter-22967",
        "review_rating": "",
        "review_title": "Appalling beyond words!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "BA_Harrison",
        "review_rating": "3",
        "review_title": "Day of the Dead: Bloody Lame.",
        "review_detailed_main": "George Romero pretty much screwed up the 'Living Dead' franchise with everything from Land of the Dead (2005) onwards, but it was his to ruin. Director Hèctor Hernández Vicens, on the other hand, has no place in making such a travesty as this 'Bold New Vision' of Romero's classic Day of the Dead (1985). An insult to the original in almost every way imaginable, Bloodline will give zombie fans nightmares, but for all the wrong reasons.\n\nFirst off, the undead in this film are referred to as 'rotters', which makes them sound like something out of a Billy Bunter comic strip. And if you thought that the vegetarian zombie in Steve Miner's Day of the Dead (2008) was a dumb idea, wait until you get a load of Max (Johnathon Schaech), who is clearly intended to be the equivalent of Bub from Romero's movie, a zombie with the ability to reason. Max is a stealth zombie, able to sneak into the military base by hanging onto the underside of a vehicle, and then slope off into the main building where he crawls through the air ducts. He's a stalker too, following pretty doctor Zoe Parker (Sophie Skelton), the subject of his obsession before he was 'turned', using his amazing tracking skills. On top of all that, he can talk too. I bet if someone passed him a few oranges, he could juggle as well.\n\nThe other zombies are of the running kind that roar like a T-Rex.\n\nThe humans are equally as irritating. Zoe might have good intentions, trying to create a vaccine to the zombie virus, but her reckless behaviour endangers all those around her, and ultimately costs the lives of almost all of those in the camp. The bad guy, Miguel (Jeff Gum), is a pale imitation of Captain Rhodes from Romero's film, and Zoe's love interest Baca (Marcus Vanco) is merely pretty-boy eye candy for the ladies. There's even a cute kid in the form of Lily (Lillian Blankenship), who Zoe risks all to save (certainly, many die so that she can live).\n\nI guess what this film clearly illustrates is just how great Romero was in his prime: his first three zombie films still stand as three of the best the genre has to offer, even after all of these years.\n\n3/10, purely for the gore."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "draftdubya",
        "review_rating": "2",
        "review_title": "Mary Sue Zombie Doctor vs Max Zombie Ninja",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mariusarmangue",
        "review_rating": "2",
        "review_title": "Unintentionally funny goldmine",
        "review_detailed_main": "I'll set this straight right away. This film isnabsolute garbage. It's mostly nicely shot but bseides that everything about it sucks. The plot, the acting, the Sound and Music, the directing. This is a really bad film. BUT it's Also extremely funny. Characters do the most senseless actions and follow the clichést og clichés and on top of that we have tons of scenes that makes absolutely ko sense without an explanation (which we never get). I'll leave an example below but before reaching the spoilers, here's my rating.\n\nSo grest, it's great score: 1/10 So bad, it's good score: 7/10\n\n---- Spoilers below ----\n\nIf all the unintentionally funny scenes, my favourite is probably when some random guy dies in the vent. He sits on a chair when he suddenly hears a Sound coming from the vent, so climbs inside it to check it out (as you do). On the way he grabs a hammer from the table and says \"Damn rats\". He never uses the hammer and there's absolutely no reason or explanation for him to grab the hammer and it's never brought up again, so why is it in the scene? Was his plan to kill \"the rats\" with a hammer? How hard would that be? It makes absolute no sense and it's what makes this film such a thrill."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "purplesky_lover",
        "review_rating": "2",
        "review_title": "If only zoe died in the first place, i would rate this movie higher..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "collonas",
        "review_rating": "1",
        "review_title": "Zoe is a Robot",
        "review_detailed_main": "Emotionless... Main actress was bad but Movie plot was worse"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ashglyde",
        "review_rating": "10",
        "review_title": "I liked this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "brixtonwa",
        "review_rating": "6",
        "review_title": "Good special effect",
        "review_detailed_main": "This movie really held a promising storyline in it's description however it fail to meet up to the expectations of the other day of the dead movies. The one thing it has going for it was the special effects were good and the plot line would've been good with some tweaking. The acting helpless little to be desired at times it was strong and other times it was really weak. It's worth watching but don't hold expectations for it."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "snuggybearkids",
        "review_rating": "1",
        "review_title": "How to write a pathetically bad zombie film 101",
        "review_detailed_main": "Even stupid survivors in other bad zombie movies make better decisions and say less cringing things than they do in this insipid attempt. Like the state of society, which is filling up with real zombies, the fact that scripts like this get made proves how dumb films and those who produce them have come."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vandeman-scott",
        "review_rating": "2",
        "review_title": "A movie only a zombie could love",
        "review_detailed_main": "I'm usually pretty forgiving with minor plot holes, but this one's swiss cheese. I was going to outline some of the issues, but I now realize it's pointless.\n\nThese characters are too dumb to be alive. There's only one bad decision they haven't made yet: to watch this movie. Trust me, you'll be rooting for the rotters.\n\nTo the dude who says these reviews are, like society, polarized:\n\nPlease look again. They're not polarized; they're uniformly scathing, as they should be. Your 7-star review is an outlier. IF ONLY society at large could find as much common ground as the reviewers here have found in lighting up this movie. There are more burns in these reviews than there are in downtown Portland."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "stract",
        "review_rating": "",
        "review_title": "Extremely unlikeable protagonist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mat-fletcher",
        "review_rating": "1",
        "review_title": "zombies that sprint, punch out windshields and make humans explode by touching them",
        "review_detailed_main": "It has little in common with the timeless classic whose name it has assumed or any other decent zombie movie for that matter.\n\nIf you want to make a zombie film where the zombies can sprint then you d need to recognise that you are breaking the rules and you better make it worth it. Danny boyle has been the only person who has successfully made a zombie film where the zombies can run and those were not the undead anyway, just diseased.\n\nThat aside, it is a really bad movie, from the opening scenes you can pretty much sum up what you are in for and if you can be bothered to sit through this turd or not.\n\nI'm giving it a 2 instead of a 1 mainly because...actually no, I can''t think of anything positive to say so i'm giving it a 1."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jonathaneholmes",
        "review_rating": "1",
        "review_title": "Awful lead actress",
        "review_detailed_main": "An incredibly dumb medical student risks touching an infectious patient with no gloves, treating her without a mask, kisses her forehead, goes on a pointless supply run and brings infection into the base to save one patient losing one of her team, let's the gate open and gets the exterior of the base overrun by zombies to collect blood samples losing 2 of her team, risks keeping a living zombie in the med bay who gets loose and compromises the entire facility, the guards never seem to get weapons bigger than sidearms despite the alarms, stupidity runs rampant, and no one here looks like they should survive. By the end of this I was honestly rooting for the zombies to kill them all. Was quite disappointed the main character survived. Absolute trash full of poorly written and unlikeable characters"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "honeypot-02316",
        "review_rating": "1",
        "review_title": "Ruined a clasic.",
        "review_detailed_main": "Horrible, horrible movie with way over the top and overly exaggerated spraying blood effects and terrible actors. Not even the zombies could save this film. No one wants to see fast running zombies, even the mere idea of that is just stupid, especially in an 'of the dead' movie. And they make it even worse with running, quick thinking, stealth ninja zombies. George Romero is rolling in his grave right now, and I guarantee Tom Savini will have a good laugh at the god awful effects. If these companies are not going to do an original film justice, they need to stop remaking them."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "antoninisk",
        "review_rating": "2",
        "review_title": "Who ever did this never understood the original",
        "review_detailed_main": "George Romero trilogy masterpiece was not about zombies. Its a clear message to society ,humanity and the human nature. All his films have a common point:human relations. Take this of the equation GR vision had minimum effects compared to the new era flicks. So what was the magic?Good story,photography and of course direction. Todays directors miss the point. I have written it plenty of times before:bigger dont mean better. Romero spent several minutes of screen time to create iconic characters especially in his second and third films. New guys get your head straight. Learn photography.Learn to frame.Learn pace and editing. Who cares about splatter. Anyone with aPC and silicone can make gore. But can you make feeling?Can you produce a single frame where jaws will drop? I still remember after 30 years the dream sequence of Lori in the room with the calendar. I could have been as well in that room.Lighting guys....Direction.... In any case this one is boring...See it on fast forward(i saw it full time)..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "boydpeters",
        "review_rating": "2",
        "review_title": "I have flushed better quality **** than this",
        "review_detailed_main": "Whoever is responsible for this should be ashamed. They have clearly never watched a zombie film in their life. It is horrific. Horrible. Beyond any redeeming quality. What is so sad is that they had a budget and good location and reasonable actors, and they delivered that. There are no words. Don.t Just don't. Even if you can stomach such rubbish as Fear the Walking Dead, don't watch this. Commit the writer, director and producers names to memory and never watch ANYthing they produce"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "emarch-92355",
        "review_rating": "1",
        "review_title": "Terrible in every way.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "watermelon_sarah",
        "review_rating": "8",
        "review_title": "I would like either a reboot with similar story or a second with some of my questions answered or a back story in Max.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "shawnalt",
        "review_rating": "6",
        "review_title": "Not as Bad as you may think",
        "review_detailed_main": "Honestly I think this film is suffering from bad word of mouth. If you look at it as just a zombie movie it petty ok but if you are expecting a faithful remake you will be disappointed as with most remakes these days it goes in different directions then the original. The acting is good but not as intense as it was in the original but the only real thing I see to complain about is the ending feels rushed with a little bit of unresolved conflicts near the end with nothing epic in the fates of any of the characters."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "CheekyFreaky",
        "review_rating": "1",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "silentbob-22185",
        "review_rating": "3",
        "review_title": "How to Offload a Crap Script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "The bloodless undead",
        "review_detailed_main": "'Day of the Dead: Bloodline' drew me into seeing it, with a cool poster/cover, an intriguing if not particularly original premise and as someone with a general appreciation for horror. That it was low-budget, which from frequent personal experience is rarely a good sign due to that there are so many poor ones out there, made me though apprehensive as well as the low rating and poor reviews.\n\nIt is sadly however yet another film seen recently, hence some reiteration because the exact same strengths and flaws those films have are present here, that to me was incredibly disappointing considering its potential which it doesn't do anywhere near enough with. 'Day of the Dead: Bloodline' is terrible, with a plethora of problems (huge ones too) and doesn't do enough with its potential, which was hardly small. There is next to nothing to recommend.\n\nWhether it is a sequel or remake of 'Day of the Dead', by default the vastly superior film being actually good, and how it fares as well doesn't matter so much to me. It's how it fares on its own terms, on that front this film is an abysmal failure.\n\nLets start with the sole positive. The scenery is atmospheric and spooky.\n\nUnfortunately, the scenery is not done justice by the rather direct to video schlocky way it's shot and edited and the drab colour palette, so much so it was hard to appreciate it, it was very clear that the film was made in a rush with no care or enthusiasm. In particular, the camera work was a nauseous assault on the eyes with its excessive amateurish-ness.\n\nGoing on further to the negatives, the story does feel paper thin, disjointed and over-stretched and some of it feels vague, under-explained in the last third where the film especially became duller, more predictable, more senseless and less scary. Too many characters are too sketchy and with nowhere near enough to make one want to endear to them. Their annoying and illogical decision making and behaviours frustrates.\n\nMaking the film feel bland and forgettable with not enough heart put into it. The effects are ropy at best, the sound quality is obvious and utilised cheaply (being too loud in the build ups and people's reactions) and it's best not mentioning the uniformly lumbering and monotonous acting that shows a huge indifference to the situation and what is going on.\n\nDialogue can be stilted and rambling, with lots of clichés and no depth whatsoever, while the pace goes to a standstill very quickly and drags on forever with very little going on worth caring about and useless padding, never recovering. Found too many the supposedly shocking moments not surprising or scary and the supposedly creepy atmosphere dreary, due to the excessive obviousness, a lot of dumb and vague moments and explanations and the lack of tension and suspense. Would not have minded the lack of originality (the film is extremely derivative and in a dumbed and watered down way) if the story and atmosphere were at least alright in execution, in reality they were both very poorly done.\n\nA lot of 'Day of the Dead: Bloodlne' has underdeveloped plot elements and often nonsensical, illogical and confusing character motivations, while too many of the things to make you jump or shocked are far from creative or scary and are pretty tame. The ending makes the film finish on an incomplete and confused whimper.\n\nThere is not enough threat with goofy looking make up for the zombies that act more bored out of their minds than undead scary, and what there is of it tends to be used poorly. It is completely unimaginative and more odd than creepy, completely failing to show any sense of horror or creativity, also too reliant on gratuitous elements that it thinks makes things unsettling but actually cheapens everything. Everything here is neither creative, suspenseful or nail-biting. Some badly sagging momentum too. The direction is leaden and like their heart was not in it or ill at ease, with the chemistry between the characters and actors coming over as constantly random and aggressive with the subtlety of an axe.\n\nOverall, awful, completely bloodless and more dead than the zombies. There is no redeeming value apart from an element that is difficult to appreciate with it being complemented so badly. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "farkow-430-467667",
        "review_rating": "1",
        "review_title": "Even watching an advertisement is better",
        "review_detailed_main": "As you know, human brain is the most intelligent one among all living on Earth. So, you expect some quality. I never see an animal brain wrote a story, make a movie before, etc... However, WHATever wrote and directed this movie, successfully did something. For humans, of course, you will use bad words every second of the movie. But, if you make your dog watch this movie, it can be okay for it, or any other animal you have."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "108YearsOld",
        "review_rating": "1",
        "review_title": "Day of the Disgust: Poopline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "loopinthoughts",
        "review_rating": "4",
        "review_title": "Terrible acting, Effects were great, If you got nothing else to watch, give it a try!",
        "review_detailed_main": "Where do i start? The terrible acting of everyone in this film gave me a migraine! But I'd like to start with the good things. The zombie makeup effects, blood and bite effects were top notch. It was really well done. The story had potential but miserably failed. Not a single person in this film can act and what the hell is that accent? Everyone speaks like a freakin pornstar!\n\nHonestly, i don't know why i should recommend this movie to anyone! But if you have watched all the zombie movies in your watch list and can't find anything so far, go for it.\n\n\n\n((( SPOILERS BELOW )))\n\nThe main characters makes a whole lot of stupid decisions. How the hell did that place swarmed up with thousands of zombies in a single night? Earlier morning when they went out on a supply run, there were like 5 or 6 zombies by the gate and few more on the road which they killed half of by the end of that scene. Then the following night the place overflows with thousands and thousands of zombies and they keep shooting and shooting. They're on a freakin hill, how did all those zombies get there overnight?\n\nAlso i can't believe how the main subject zombie(max) able to hang down the humvee without anyone ever spot him! They made a perimeter check and placed soldiers in place before going into the hospital, but he was able to avoid contact with ALL of them and hop under the vehicle. That little girl(lily) was dumb as a brick, she went straight into a pool of zombies when she was scared away by said zombies. Just great. I'm not asking it to be completely realistic, I know some movies are made just for the mindless fun, but where's the fun in this?\n\nJustifiable reasoning should be given for each events that are happening, which is what you're failed to do and gave me a severe migraine! I expected a lot seeing the movie name, disappointed nonetheless!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "yapmayhon",
        "review_rating": "1",
        "review_title": "Just bad",
        "review_detailed_main": "Bad acting, bad script, bad storyline.. I hate this so much I created an IMDB account just to give my review."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ginasharp",
        "review_rating": "2",
        "review_title": "Oh my gosh..... the growling?!?!?!",
        "review_detailed_main": "This really was just a lot of zombie gore and violence without much plot to me. Storyline could've been better developed. If you just love movies with gross zombie scenes you may like this. I enjoy more of a plot than zombie gore."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Extremely Gory and Mindless Action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "wpreussner",
        "review_rating": "10",
        "review_title": "Good Zombie Movie",
        "review_detailed_main": "Der film lohnt sich zu gucken bester 2018 Zombie Film"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rolykeates",
        "review_rating": "7",
        "review_title": "Try and you might be surprised",
        "review_detailed_main": "Admittedly, it's not brilliant, but it has a good pace to it. It takes on elements from the original Day of the Dead film with a twist. Watch and see, what do you have to lose?"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ivko",
        "review_rating": "1",
        "review_title": "don't waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "guyzradio",
        "review_rating": "3",
        "review_title": "The movie version of \"click bait\"",
        "review_detailed_main": "Having seen the classic \"Night of...\" flick and a few Living Dead spin-offs, I watched \"Day of the Dead: Bloodline\" expecting, well..., something. Being drawn in by claims this is a \"retelling\" or \"reimagining\" will lead to a dashing of expectations in a just few minutes. The plot is predictable and includes the usual \"Well, that was a dumb move\" scenarios that ruin somebody's day. Acting is blah, and fast-cut jerky fight scenes with zombies have little visual impact. I won't elaborate further, as reading a few other reviews will supply the details. However, I did find it odd that a couple good guys get spattered with zombie blood, but simply wipe their hands and faces, and life goes on despite zombie-ism being caused by a virus."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Gothamite1",
        "review_rating": "3",
        "review_title": "I really hoped they all died",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mistela67",
        "review_rating": "2",
        "review_title": "Easily the worst acting I've seen from a Netflix movie",
        "review_detailed_main": "I have never seen a movie that had so many poorly trained actors in it. The dialog wasn't all that great, either. Not much to say about this one. Just a bad movie all around."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "KoolCatReviews",
        "review_rating": "3",
        "review_title": "A lose remake done badly",
        "review_detailed_main": "I think this movie would have done better if it dropped its day of the dead association. It really could of been an original movie. A lose association to day of the day just confuses us as the audience. A completely strange remake. The movie had some okay scope with bunker being a great set. The biggest downside of the movie was how stupid the characters acted making the film unbelievable. The action is decent but very cheesey. The plot is pretty standard zombie fair with a bolted on non senseical main story."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ThatDarnIrishMan01",
        "review_rating": "2",
        "review_title": "Maybe the worst \"of the dead\" movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Jack_Shite",
        "review_rating": "1",
        "review_title": "Utter garbage",
        "review_detailed_main": "Stupid characters, godawful script and some of the worst acting ever committed to \"film\". I lasted 20 mins. A stinking heap of compost."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "brayna",
        "review_rating": "1",
        "review_title": "Oscar for the most annoying lead role",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "craigbenting",
        "review_rating": "6",
        "review_title": "Good Example of Horror Nobody Can Rate Honestly",
        "review_detailed_main": "Watch this movie with an open mind then read the reviews. Together, they are a perfect reflection of our society today:\n\nPolarized\n\nThis movie isn't horrible and it isn't great. But reading the reviews, you'd think the positive ones (yes, there are 10's) are crazy or the negative ones (nothing above a 1, seriously?) are crazy. Ironically, I'd say almost all the reviews are flat-out lies.\n\nI don't think the people who made this movie were talented enough for it to rate below a 3, just the same as they weren't talented enough for it to rate above a 7. Every rating outside that middle range was an extremist lie and the review writer knows it.\n\nWhy'd they write it then? Shock value. I'm only shocked at how we lie to ourselves these days.\n\nIf this movie sounds interesting, try it. It ain't as bad as a 1 and it ain't as good as a 10.\n\nIf every movie you watch has to be a 1 or 10, just stop watching movies, because most of the time you're going to lie to yourself to feel better.\n\nSome movies are throwaway entertainment, and that's all this one is."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ahmed-rasoul2",
        "review_rating": "2",
        "review_title": "Zoe, how to destroy everything t",
        "review_detailed_main": "Okay, just don't spend any money on it. Zoe will screw it all after running in her bra for few takes and the zombie who loves her is going to screw it for himself.\n\nCold action, low talent, few good visual effects, overused plot."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "affizb",
        "review_rating": "1",
        "review_title": "Bad acting, Bad storyline",
        "review_detailed_main": "Please don't waste your time watching this movie, there's plenty of good zombie movie out there rather than this."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "piparminttuz",
        "review_rating": "1",
        "review_title": "1/10",
        "review_detailed_main": "So lame...I can't even. How did they manage to find all the worst actors in the world to one single film."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "numbahunna",
        "review_rating": "1",
        "review_title": "Awful, I should have headed the warnings.",
        "review_detailed_main": "I saw all the bad reviews but my love for zombie movies and respect for the source material this was a remake of convinced me to watch it anyway. That was a mistake. This feels like it was written and directed by a 10 year old, not a particularly gifted one either. Do yourself a favor and pass."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "kon-17",
        "review_rating": "1",
        "review_title": "Can only repeat what others have written",
        "review_detailed_main": "This is a complete masterpiece, if the result should have been the most non-talented film ever made.\n\nHow could anyone waste funding on this. It is a complete disaster and do not bring anything to be entertaining. Bad acting, bad dialogs, and no suspense or engaging action. How did these people survive for so long being so stupid?! Come on..\n\nHowever, I had to see it. Just make sure the reviews are correct. They are!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "nodlimax",
        "review_rating": "1",
        "review_title": "Shockingly Awful",
        "review_detailed_main": "This is so bad, it actually hurts watching it. I went in blind on this one. I saw it among other zombie movies and wanted to give it a chance. I absolutely regret watching it.\n\nThe characters, acting and effects are horrible. There are constant blood explosions for all kinds of injury. The characters literally have no working brain cells and I wouldn't believe them surviving in this kind of scenario for one second.\n\nEverything that happened during this storyline did happen because of stupid decisions made by the main character except for the initial outbreak. Btw. The initial outbreak was completely random and weird as well. You have a corpse that supposedly died from H1N1 and who already had an autopsy done on him. Somehow he turned into a zombie or rather a \"rotter\" as this movie calls its zombies.\n\nWhat follows after the initial outbreak in this movie is a collection of stupid decisions which makes everything worse minute by minute. The characters in the movie don't even recognize when someone else dies. Also one of their friends is on the ground getting torn apart by zombies? Better stay and watch. It's not like a freaking bullet to his head could end his suffering.\n\nA small bunker compound where a zombie is crawling through ventilation systems? No one will hear it. Btw. That \"zombie\" was like a freaking ninja or the characters are literally just blind and deaf. They couldn't even hear a screaming woman being torn apart by the zombie..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Lokii321",
        "review_rating": "4",
        "review_title": "Ray of loosing faith",
        "review_detailed_main": "I have one question....! Who pitches this story and manages to get someone to part with lots of money to fund it? Who then watches the dailies and doesn't pull the movie? Ok that's two questions.\n\nI have seen better acting in year four nativity plays than in this movie. You know that adage that if you put enough chimpanzees in a room with typewriters they would eventually write something. They did! They wrote this script!\n\nIt's truly terrible on all levels, the characters make really odd decisions and don't listen to logic or sense. The only positive thing about this movie is that eventually it ends."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "fxdx4",
        "review_rating": "5",
        "review_title": "Not a classic, but an honest attempt.",
        "review_detailed_main": "If you have seen the original Day of the Dead, please remember it was by far the worst of the original trilogy, and was less than acceptable at best as the conclusion to Romero's series. Bloodlines unfortunately can't fix the original and ends up missing more than it hits.\n\nBoth Dawn and Night have been remade since the 1990's - both very successfully. However I always believed the most potential for a remake was with Day. Enter Day of the Dead: Bloodline.\n\nThe plot is similar to the original. Sometime after the zombie apocalypse, a small base is holding out, and looking for a cure. People will get eaten, gore will be seen, throats will be ripped out.\n\nWhile the original was a B movie from the 80's, Day:Deadline is a C movie from the 2000 -teens. The acting is abysmal, but who really cares? The plot has more holes than I could list in this review's word limit, but it's a zombie movie, and the original content wasn't great to start with.\n\nThere has been an honest attempt to update and clean up the original, but the remake isn't much better. Low budget and a general clumsy development of ideas limit this film to just another zombie \"B\" movie of which there have been so many. It's too bad, because this story does have some potential.\n\nIt's a movie. It's a 'B (really C)' movie. It has zombies it in. If you are still interested, watch and you will find something to enjoy in it. If you are not interested, by that description, then you probably would not like it even if it was great."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "TdSmth5",
        "review_rating": "6",
        "review_title": "Not that bad",
        "review_detailed_main": "Zombies take over the world. A couple of months earlier we learn how all this started. A corpse is brought to medical school. A group of students studies the cause of death and learns that it's some variety of influenza. Meanwhile one of the students, the pretty Zoe is stalked by one patient who carves her name into his forearm. When the tries to rape her the corpse reanimates and attacks the crazy guy.\n\nYears later what's left of humanity is holed up in some military base surrounded by zombies. Zoe is the main physician there, she's involved with one of the military guys, brother of the main military guy. Civilians are living in RVs and tents inside the base. When they run out of medicines Zoe suggests they raid the med school storage. On the way there the Humveee breaks down, and once at the university they're attacked by zombies, including Zoe's abuser Max who's developed smarts over the years and manages to make it to the military base unnoticed. He's captured eventually and Zoe studies his blood in order to try and develop a vaccine against zombiefication. Of course Max breaks free and thanks to the overall stupidity of the humans, zombies overrun the base. Will the military be able to stop the zombies in time for Zoe to finish her vaccine?\n\nDay of the Dead: Bloodline is a zombie B-movie that features the lovely Sophie Skelton (a Brit playing an American of course), who makes for a dynamic and compelling lead without being too bossy and annoying. Most importantly, it has the most charismatic main zombie I've seen in a long time. Johnathon Schaech does an outstanding job as the smart zombie in love. The movie is violent and gory. But it has plenty of weaknesses--the secondary cast is goofy as your typical military that looks like no military but in oversize pristine uniforms. While the zombies have gotten smart the humans have gotten dumber and this movie features countless acts of human stupidity. That said, the main concept of the script is good. But editing makes a couple of goofs.\n\nOverall, this is a good zombie flick but not one that should be associated with the Romero series, not sure why anyone can these days make something called \"Day of the Dead.\" In any event, it's nothing to get too upset about. Enjoy this movie for what it is. It sure is better than many of the countless awful low budget zombie movies out there and is plenty entertaining."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "evanstommy1992",
        "review_rating": "1",
        "review_title": "Bad just bad....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sen_ben33",
        "review_rating": "2",
        "review_title": "bad movie script",
        "review_detailed_main": "This Movie has good potential to be an awesome zombie movie but ended as one of the worst zombie movies.\n\nThe movie script is such a bs. This movie actually just shows an epic girl who threatens everyone in her range through her decisions and want to be every time right. her discussions are just ridiculous."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "hypernutt-194-476124",
        "review_rating": "2",
        "review_title": "Worst Zombie Movie EVER!!!",
        "review_detailed_main": "Had potential but the stupidity outweighed everything else. See World War Z for the 10th time before seeing this one once!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "insomnyan",
        "review_rating": "1",
        "review_title": "Avoid the plague of bad zombie films",
        "review_detailed_main": "Poorly paced, the characters are as dimensional as a poorly drawn stickman on a piece of paper, the poor attempt at a plot is beyond predictable and for some reason the commander(or whatever the guy in charge is called) keeps being put as an asshole when the protagonists are the ones disobeying orders, making dumb moves and getting a lot of people killed and the guy trying to protect the people is the asshole???"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "lowsoonpeng",
        "review_rating": "1",
        "review_title": "The only good thing about this movie is you would probably not finish watching it. Thereby saving some minutes of your life.",
        "review_detailed_main": "Usually I would wait till I finish watching a movie to comment how a waste of time this is.\n\nFor this movie. I didn't even have to go all the way."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "amlautz",
        "review_rating": "1",
        "review_title": "This clearly has zero respect for George A. Romero's film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rizosnicholas",
        "review_rating": "2",
        "review_title": "Staggeringly Bad",
        "review_detailed_main": "Look, I knew this wasn't going to be great so I went into it expecting nothing. Somehow it was still worse than I assumed. I hoped this would be a so bad it was good situation, but it was just so bad it was bad. No fun to be had. Also, the main actress and her friend from the start seem to be reading all of their lines and also they don't know how to read."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "anitamads",
        "review_rating": "1",
        "review_title": "Absolute crap",
        "review_detailed_main": "Why did they make this piece of crap in the name of day of the dead? I went in, without having read about it in forehand, but that didn't help one bit. The entire movie sucks from start to finish. And honestly, it made me mad, so so mad. All the moronic moves the characthers took, wow, seriously? Do not watch."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "StanleyCupBruins",
        "review_rating": "6",
        "review_title": "I honestly liked this movie better than Day of the Dead (1985)",
        "review_detailed_main": "I enjoyed Day of the Dead: Bloodline (2018). Give this movie a chance for what it is. Remember, George Romero was denied millions of dollars in funding Day of the Dead (1985) and it shows. The protagonist/doctor is more believable in Bloodline compared to Day of the Dead (1985). I will not give anything away so make up your own mind. I did and gave it a six out of 10."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "abovethelaw-95473",
        "review_rating": "2",
        "review_title": "Ripped Zombies!",
        "review_detailed_main": "A group of survivors is living underground in a bunker away from the outside that is full of zombies. With them is Zoë Parker, a former med student, trying to come up with a vaccin. PS: Zombies don't run! What would George A. Romero say?"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "my-name-billys",
        "review_rating": "5",
        "review_title": "it wasn't sooooo bad",
        "review_detailed_main": "Really this one wasn't so bad as the reviews says it was kinda fun to watch, i cant say that was a good movie tho but at least you can give it a try let's say for me was a moderate movie but still good as a popcorn b movie"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "audacity10",
        "review_rating": "2",
        "review_title": "The decline in Hollywood continues unabated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Randall-Flagg01",
        "review_rating": "2",
        "review_title": "Holy Stinker",
        "review_detailed_main": "What an absolutely abysmal POS. This movie sucks in every way...horrible acting, stupid plot, ridiculous decisions made by the characters, no likable characters, etc. I rated the 2005 'remake' higher and that was a turd. Do not waste your time or money on this garbage."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "nogodnomasters",
        "review_rating": "3",
        "review_title": "He has your name on his arm",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "eyoby",
        "review_rating": "1",
        "review_title": "waste of time",
        "review_detailed_main": "Really? this must be a joke, they rather pay me for watching this movie then this talentless actors lol."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mdellava",
        "review_rating": "1",
        "review_title": "Zombies do not plot, plan or hide",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sirplata",
        "review_rating": "1",
        "review_title": "Waste of time!!",
        "review_detailed_main": "Running, Thinking and smart Zombi's. What the f'k Zombi's are walking dead. Stupid only food what they need and not smart. take an example dawn of the dead 1978 No running zombi's but tension pure. I miss the latter in almost all these films. Romero had super music in this film. The mix of horror and music was perfect. This film is boring and like many other films of this genre. Filmmakers go back in time and start where Romero started. slow undead but much more of this kind and you can no longer side that is tension."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Pairic",
        "review_rating": "6",
        "review_title": "An Average Zombie Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "silicontourist",
        "review_rating": "1",
        "review_title": "DAY OF THE DrEADful",
        "review_detailed_main": "My review title already explains to you the readers/viewers what I thought of the film!\n\nI sat watching this and saying to myself, \"I'm sure I watched this earlier on last year, 2017\" but, as its a 2018 release, it must have been just so cliched and copy cat in its directors style of production. The acting was from bad to worse and the story just dragged on in a dreary fashion, as if the director was making it up as they went along. Everything you have ever seen in a zombie movie is seen here yet unbelievably, the survivors (even the soldiers) never have a weapon with them at all times.....no guns, machetes or knives!? However! The thing that stood out so stupidly was the fact that these zombies could represent their country, for the 100 metres at the Olympics. They made Cheetahs look slow and they all seemed to have the strength of Hercules. A great many 'Film Directors' today are totally messing up the zombie genre, to the point where they are mainly in the comical (because the story/zombies are literally laughably stupid), or they are just absolutely DrEADful films!\n\nI always believe everyone should watch a movie themselves and determine its worth (as everybody's tastes differ) but, sometimes you really should just believe an individuals review. PRO's: Best thing about this movie are the special FX (hence the 1 star I have given it) and the end credits... CON's: Nothing new, good or interesting and, there is no time spent watching refund of your life :)"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "garethathomas",
        "review_rating": "1",
        "review_title": "So disappointed!",
        "review_detailed_main": "Starts with the Lionsgate logo, and thats the high point!\n\nI thought it would be better than average horror film coming from a major studio, but this film has only one redeeming feature, the special effects are good.\n\nI think this film would be a great tool for any film students on how not to make a horror film."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "cruise01",
        "review_rating": "2",
        "review_title": "Horrible all the way around with dead acting, boring direction, and a waste of a good remake.",
        "review_detailed_main": "Day of the Dead: Bloodline is a remake to George A. Romero's classic zombie film which showed how society has crumbled after the apocalypse. And a group of refugees and what is left of the military are hiding in an underground bunker. The trailer to this film seemed very promising and looked like it was going to be a lot of gory fun like how 2004 Dawn of the Dead film looked. Now don't get me wrong, the 2004 Dawn of the Dead remake has to be the best remake yet. Which succeeded over the original. Now Day of the Dead: Bloodline however, was very disappointing and even the worse film ever. Not sure where to start about this film.\n\nWe can all say the acting was horrible. Go figures since it was a straight to dvd movie, were it is most likely fitting in the sci fi channel. The cast performance was horrible and amateur with the acting. Main character Sophie Skelton playing a character that was once a med student and now she is capable of trying to come up with a breakthrough of a cure to the virus. Yes, it was unbelievable.\n\nThe direction was horrible. Characters make stupid decisions. A little girl runs away from the zombies and runs towards the herd of undead to escape? What was her logic in that. Who knows. A military soldier gets very close to a chained up zombie to taunt it. We can know were that is going. And no characters make a bright decision at all in the movie.\n\nThere was no scares. Or excitement with this film. Yes, the zombies are fast. The action is so dull. It does not build the suspense to even care on what is going on. The practical effects was horrible. Every zombie biting a person and causing the blood to outburst was cheesy.\n\nI enjoyed the original Day of the Dead for what it was. It may not be strongest George A. Romero's zombie movie like Night of the Living Dead or Dawn of the Dead. But the 1980s music, set design, make up, and the creepy scary tone of being surrounded by flesh eating undead worked great in his classic movies. This remake does not do anything to make it better besides making it a cheesy forgettable zombie movie. Plus if you seen the original, you may miss Bob the friendly undead that the scientist experimented. Unlike the remake, which had a forgettable undead that outsmarts the others.\n\nOverall, Day of the Dead: Bloodline is a horrible film. Acting is atrocious, the direction was dull and terrible, and there was no scares or thrills to make this worth watching. If you are a fan of the original you will be disappointed. I would not recommend the film at all.\n\nI rate the film 1 out of 5 stars."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "TerribleKatherine",
        "review_rating": "3",
        "review_title": "A terrible movie and viewers without a clue",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "adrenachrome",
        "review_rating": "2",
        "review_title": "The idiot plot",
        "review_detailed_main": "Spoiler free here. A famous writer (yeah, I forget his name, sorry) once wrote about the making of Alien3 by calling the idiot plot, whereby the story is only propelled forward because all the characters are idiots.\n\nThis goes triple for the characters in this movie. No one has a shred of common sense, and bad things happen (usually to themselves) because of the aforementioned lack of common sense.\n\nI'll forgive a kid in a movie for being dumb, but for supposedly highly trained soldiers, it's a mortal sin. Dumb plot, dumb characters, dumb ideas abound. Save your brain cells, see something, anything, else, but don't see this."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "JohnStopman",
        "review_rating": "1",
        "review_title": "Monotone Acting Spoiled it for Me",
        "review_detailed_main": "Although the SFX are decent and the storyline has its interesting moments, the acting is truly of the worst kind: it's completely monotonous for the most part (emotionally flat).\n\nIf thou still loveth thyself: then please, don't waste your time by watching this piece of crap }-/"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "laffey-56086",
        "review_rating": "1",
        "review_title": "The Only Review You Need",
        "review_detailed_main": "I've seen better acting in porn. Need I say more?\n\nWell, I guess I have to say more since IMDb is telling me my review is too short. Oh, wait. There we go. That's enough text."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "serahserah",
        "review_rating": "1",
        "review_title": "Don't watch unless you are a masochist",
        "review_detailed_main": "I couldn't even make it past the first 15 minutes. I've watched some dross in my life. But THIS! The acting is so bad it is award winning. Do not do it you yourself! You've been warned."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "alexbazelos",
        "review_rating": "6",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "blahblah-56699",
        "review_rating": "1",
        "review_title": "Syphilitic Piece of Crap",
        "review_detailed_main": "Everything that could be bad, is bad. The script. The direction. The dialogue. The acting. The overblown, unrealistic special effects. The worse part? They dared sully Romero's legacy. This review requires I say if there are any spoilers. Rest assured, there's nothing anyone can say that could spoil this movie."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mcdonaldjohn",
        "review_rating": "1",
        "review_title": "Actual waste of time",
        "review_detailed_main": "I watched this as I do like to watch \"crap\" zombie movies and enjoy Evil Dead type films. This however doesn't really tick any of my usual boxes. Badly acted, badly written, and no real redeeming features."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jerralagbayani",
        "review_rating": "5",
        "review_title": "A Step Down in Remakes With Little in Common From the ORiginal",
        "review_detailed_main": "Day of the Dead: Bloodline was supposed to be a remake of the original but this, like my review for the remake Dawn of the Dead, was not like the original at all. Not even the learning about how to find a way to stop the apocalypse was right, this remake trying to find a cure while the original was teaching zombies how to be human again. This is as good as watching maybe something under the rating of Jeepers Creepers and I think needs a 5.5/10. They made the setting a camp and most of it takes place above ground and the only character keeping his place like from the original was the leader."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jona-kid",
        "review_rating": "2",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "akinbodeore",
        "review_rating": "1",
        "review_title": "Wtf is this??",
        "review_detailed_main": "Very terrible movie and horrible acting. The protagonist narrated the story like a robot. No emotion shown when someone even died. Don't bother wasting your time lol"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "koroxx",
        "review_rating": "5",
        "review_title": "Not that bad, an \"OK\" remake.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "The movie should not be bearing the \"Day of the Dead\" title...",
        "review_detailed_main": "I must admit that I had very little expectations for this movie, especially since it bore the \"Day of the Dead\" title as the previous one \"Day of the Dead: Contagium\" was a train wreck.\n\nIt turns out, of course, that \"Day of the Dead: Bloodline\" didn't fare much better.\n\nWhat lured me in, aside from the fact that it was a zombie movie, was the movie's cover, as they did manage to capture the essence of Romero's \"Day of the Dead\" movie with it. However, that was just a false presentation, as the movie had very little to do with that classic zombie movie.\n\nThe storyline was adequate, albeit quite predictable and generic.\n\nThe special effects were that one and only thing that kept me glued to the movie to get through to the end. The zombies, however, were running, which is a huge no-go in my opinion. But it gets worse, the zombies were also making this insanely inhuman growling sound that would scare even a ferocious lion. Those sounds were just so absurdly ridiculous and it didn't work in any sense for the movie.\n\nThis was a zombie movie that snuck in under the radar and will vanish just as unseen.\n\nThere is very little to be had here for a zombie afficianado, so don't get your hopes up."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bachh-82093",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "duckman_079",
        "review_rating": "6",
        "review_title": "Okay zombie movie",
        "review_detailed_main": "Seems like other reviewers plagiarized one another without forming their own opinions.\n\nActing - is so-so. Not good, but good enough.\n\nStory - some reviewers complained about the story or plot, but it's around the same quality as the original.\n\nSmart zombie- another reviewer complained about the zombies being too smart. Well none of the zombies were smart. There was one character who LOOKED like a zombie, but wasn't. He was partially immune to the zombie virus and had certain systems of his body succumb to the virus, while retaining some higher level brain function.\n\nAll in all, it's not that good, but not nearly as bad as what other reviewers are claiming. I can see why someone might give it a 4 or 5 if they we're expecting Dawn of the Dead or 28 Days Later. But a 1 - 3 is certainly out of the question."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ocmanager1234-883-237057",
        "review_rating": "2",
        "review_title": "This actually could have been a good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ilovetobeyoung",
        "review_rating": "2",
        "review_title": "A rapey stalker zombie is all you need to know about this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ShadowGhoul79",
        "review_rating": "1",
        "review_title": "Don't Waste Your Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bijeshgupta",
        "review_rating": "1",
        "review_title": "Kill Zoe first",
        "review_detailed_main": "Just kill Zoe and the movie will be better. Waste of time & money."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Leofwine_draca",
        "review_rating": "5",
        "review_title": "Needless, but not quite as bad as expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rockykumar1982-165-204478",
        "review_rating": "1",
        "review_title": "Worst zombie movie ever ! Dumbest characters in whole world.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "diescobarmdq",
        "review_rating": "1",
        "review_title": "BAD, BAD, BAD.",
        "review_detailed_main": "Just plain bad. And I thought \"Patient Zero\" was the worst, but this one is really really awful. Horrible movie, terrible acting, cringe worthy effects. BAD."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "garabedian123",
        "review_rating": "2",
        "review_title": "Yikes...bad acting all around",
        "review_detailed_main": "Yikes...they could have at least tried...A sentient zombie movie is one that has not been done well. THe acting its putrid. Every one..every actor in the movie despite the zombie sounded like reading a book. And too cliche. Can you say walking dead. Showing me how professional they are...ooh...and yet they sure do not act like they know what they are doing. Walking dead galore with nonsense...Hey is that dark hole making growling noises? Lets go in head first and check it out..ookay"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "b_kite",
        "review_rating": "6",
        "review_title": "A suprisingly decent effort from the group that brought us \"Creepshow 3\".",
        "review_detailed_main": "So here we have another unofficial \"Day of the Dead\" reboot, brought to us once again by James Glenn Dudelson who made \"Day of the Dead 2: Contagium\" and \"Creepshow 3\" both awful. However here they actually manage to give us a somewhat interesting little movie. Its fast paced and has a crap ton of gore, which makes it pretty fun. The acting sucks most of the time, but, I found myself enjoying it rather well!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "RonHuynh23",
        "review_rating": "3",
        "review_title": "Just plain bad",
        "review_detailed_main": "An attempt to make a another zombie movie follow the great work of G.A. Romeo \"dead films\" but failed, here are the reasons: The idea of intelligence zombie (Max) and the built up story from there are quite hilarious, annoying, unbearable. The same feeling with (smart zombie dad) in 28 weeks later. Bad script with boring dialogue, empty characters and the copy of autocratic from the original film. The ending was pretty bad and they even trying to fool all the audience by the scene that the little girl and our Zoe ran toward base door full of zombie but nothing happen (fast forward to 1:14:30 and you will see). The film itself just not worth to get the title \"Day of the dead\""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "joycecardenas",
        "review_rating": "1",
        "review_title": "Crazy Zoe",
        "review_detailed_main": "She totally killed all the people coz she put everyone in danger ! I hate this movie ! And the little girl running in the middle of zombies how crazy is that ! Wasting time watching it"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Real_Review",
        "review_rating": "2",
        "review_title": "Shockingly Bad Acting. Maybe The Worst Acting Of The Decade.",
        "review_detailed_main": "The dialog is terrible throughout the movie, so considering how bad the writing is, I guess the acting really can't be good. But, come on... This is just stupid-bad. Even when they are off-camera reading narrative over a scene, the bad acting oozes from their voices.\n\nThe effects are pretty good and the zombies are scary, but a university theater production would be better acted than this \"remake\" (exploitative click-bait. This is not a remake - this movie is, truly, one-of-a-kind).\n\nRealReview Posting Scoring Criteria: Acting: 0/1; Casting: 0/1; Directing: 0.5/1; Story: 1/1; Writing/Screenplay: 0.5/1;\n\nTotal Base Score = 2\n\nModifiers (+ or -): Originality: -1 (Every scene of this movie was lifted from other zombie projects);\n\nTechnical Effects/Make Up: +0.5\n\nTotal RealReview Rating: 1.5 (rounded up to 2 for IMDB)"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "BNXbrayo",
        "review_rating": "2",
        "review_title": "It's Not as bad as people say, Its Worse.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "majorahq",
        "review_rating": "1",
        "review_title": "Avoid unless there is nothing else to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "airel-45017",
        "review_rating": "1",
        "review_title": "I have NEVER EVER rated a movie 1 star before this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "eunicevital",
        "review_rating": "1",
        "review_title": "Worst of the worst 😡",
        "review_detailed_main": "Extremely terrible script....I almost shouted them papa towards the end of the movie but held back . Whoever wrote that script should never be allowed near Hollywood ever again."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rumzchaodin",
        "review_rating": "1",
        "review_title": "I'd rather shoot myself in the face then watch this movie again",
        "review_detailed_main": "I'm serious, it really is that bad. No character development, no plot, bad acting, mind numbing dialogues... Don't waste your time."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ielts-98538",
        "review_rating": "7",
        "review_title": "Not as bad as many say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "dianarasbid",
        "review_rating": "1",
        "review_title": "Utter Drivel",
        "review_detailed_main": "Worst zombie flick ever, and that includes The Evil Dead. The ONLY highlight was Johnathon Schaech as Max. The zombie effects were pretty good. Acting? Dismal. Storyline? Puerile. Meaningless. Yawn. Even our dogs were disgusted. George Romero must be rolling in his grave. Utter effing travesty of a film. Aaaarrgh!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Jay_Rusty",
        "review_rating": "1",
        "review_title": "Atrocious acting!",
        "review_detailed_main": "Some decent production values and gore effects but plagued by atrocious acting and a supremely idiotic screenplay!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "johnnyboygrant",
        "review_rating": "2",
        "review_title": "Don't",
        "review_detailed_main": "The acting is laughable. Good story, should have been a better film."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "calypso-38561",
        "review_rating": "5",
        "review_title": "Maybe I was a little quick to judge....still not the greatest movie however.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "loversofmovies",
        "review_rating": "4",
        "review_title": "BAD",
        "review_detailed_main": "Well where do you want me to start from ?\n\nBasically everyone life is in Risk because of Zoe ? You've got to be kidding me right ?\n\nExtremely badly written."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "grahambuilder",
        "review_rating": "3",
        "review_title": "Special Ed horror",
        "review_detailed_main": "The only decent actor is Max. Junk movie with sub standard C rated actors."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "azfactsanalysis",
        "review_rating": "1",
        "review_title": "Absolute crap",
        "review_detailed_main": "Waste of time..... week plot and nonsense .... not even close to a zombie movie ... 1 out ten"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "christopherstamp",
        "review_rating": "1",
        "review_title": "Beyond Terrible",
        "review_detailed_main": "Couldn't make it past 7 minutes - the dialogue is so terrible and written at high school level, it's absolutely ridiculous. I can normally finish a bad movie (I made it to the end of Birds of Prey 2020 and that was beyond crap) but this is even worse.\n\nWhy would the creators waist money on this?"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rowtiget",
        "review_rating": "6",
        "review_title": "Admittedly a pointless remake but still a fun watch.",
        "review_detailed_main": "I'm gonna start off by saying that I know this isn't a good movie; espescially with the significant flaws this film carries and that's what I wanna start with...the flaws.\n\nFlaw number 1: The Acting... The acting ranged from bad to somewhat tolerable. Their behavior was barely even realistic, the main actress was so monotonous half the time it was like listening to a robot while other times she was close to human behavior but just not quite.\n\nFlaw number 2: The Dialogue... None of the things they say is remotely believable to what people would say in situations the characters are put in; not even the way they try to connect with one another.\n\nFlaw number 3: The Characters... The characters or atleast the human characters are poorly written and incredibly dumb even by typical horror movie standards. They make poor descisions left and right you don't really care if they die.\n\nSome people criticized the gore sequences where zombies would drag a person off-screen and an explosion of blood would shoot out. Personally, I wasn't bothered by this since I'm used to over-the-top gore with movies like Evil Dead 2, Dead-Alive & the Wrong Turn movies (excluding the first one) but it's still worth mentioning. Because the film relies heavily on these things it's no wonder why people were disappointed with this movie. Now that we've gotten the flaws out of the way, lets point out all the good things that won over my approval.\n\nFirst thing that I'd like to bring up is the cinematography. Even if you didn't like it, you have admit the film is still wonderfully well shot; you have to admire the people behind the cameras. They get alot of cool shots throughout the movie like the zombie appearing before the camera and spitting out a fountain of blood from its mouth which is one of my favorite shots in the movie.\n\nSecond is the action sequences... This movie was pretty crazy when it came to the action. There was alot of gun firing, stabbings, pucnhing, zombies biting and ripping people apart, it was just awesome.\n\nThird, the special effects were amazingly well crafted that they stand up to the special effects seen in the original Day of the Dead.\n\nFourth is the story... The story I felt was actually pretty good. It was the same premise told in a different way which was kinda like the way Dawn of the Dead 2004 did with the original.\n\nFifth, the gore... The gore was awesome, don't really need to say much there.\n\nSixth is the villain and the actor playing him... I know I said the acting wasn't good but actor Jonathan Schaech did a good job playing the lead zombie villain in the movie. He's pretty much the best thing about this movie, which I know isn't saying much but it still counts for something.\n\nAnd finally the seventh reason is the fact that it's faithful to the original 1985 classic. It doesn't make a movie good when it's faithful to the source material but atleast this version wasn't too derivative as the 2008 remake was if you can even remember it. I'm not trying to convince anyone to watch this movie, my review is just stating that this movie wasn't as bad as people make it out to be. True it has flaws but I think if they hired actors for their talents rather than their looks which is clearly obvious and hired better writers it would have probably been a much better film. It's a fun stupid movie that was worth watching but that's just my opinion."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rytiskvd",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Movie was horrible. Horrible plot. Don't waste your time watching this."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "osaure",
        "review_rating": "1",
        "review_title": "From two to one.",
        "review_detailed_main": "Started watching this dumpster fire and gave it 2 stars. However, after watching it I cut its rating in half: 1 star. I like bad movies. This isn't even bad in a good way."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Screaming_egg",
        "review_rating": "1",
        "review_title": "Since when zombies are intelligent?",
        "review_detailed_main": "The people who approved this script should be banned for entering Hollywood for life!! Anyone can easily write a 10 times better zombie movie scenario in 5 minutes. Disgraceful, pathetic, don't watch. Zoe gives women leads a bad rep."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jamesvass-62316",
        "review_rating": "1",
        "review_title": "Bad actors, bad story, bad accents.",
        "review_detailed_main": "How did they stuff this up... the acting is so bad that the zombies do a great job by comparison! The American accents and slang talk is just laughable; \"I miss deep dish pizza from Chicago\" it's just a joke of a movie and I got through half way before turning it off..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sabunia",
        "review_rating": "1",
        "review_title": "Omg",
        "review_detailed_main": "This is the worst writing. This is the worst movie I have ever seen. It's not even a good trash. It's just bad."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "garbbie-60885",
        "review_rating": "1",
        "review_title": "I WISH I CAN UNWATCH THIS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mismerize",
        "review_rating": "2",
        "review_title": "DON'T waste your time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "moviehawg59",
        "review_rating": "7",
        "review_title": "An \"okay\" idea ... just executed on the \"cheap\" ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "hrseemagautam",
        "review_rating": "1",
        "review_title": "I want to give - 10 for this",
        "review_detailed_main": "Wastage of time Worst movie Most zombie movie It was not proper zombie even"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "shaqd-90876",
        "review_rating": "1",
        "review_title": "Wish I could give it a 0",
        "review_detailed_main": "This is one of the worst movies I have ever seen. Worst script. Worst zombie movie. Kids could do better. Bruuuuuuuh. One of the worst acting I have ever seen. Bro kama we ni mkenya usiangalie huu upuzi"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "doyle-doyle21",
        "review_rating": "1",
        "review_title": "ouch",
        "review_detailed_main": "Literally the worst film I've seen. Acting is terrible. Looks like all actors are dubbed. Please avoid and watch the originals.. 2 hours of my life I won't get back."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "erik-hennerfors",
        "review_rating": "1",
        "review_title": "The only way this movie was mad is if..",
        "review_detailed_main": "The writers are as brain dead as the people they portray.\n\n\nThese kind of movies usually make you laugh and with the intent to, some might even be called good.\n\nBut this piece of shit should never have been green lighted since it never successfully do anything, it is neither laughable nor interesting.\n\nThe main character is a dishonest lunatic with no real knowledge of anything else than getting people killed. And the end is just an image of what she wants but never will succeed in doing."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "FeastMode",
        "review_rating": "2",
        "review_title": "my notes",
        "review_detailed_main": "Terrible and boring. i laughed hard at a bunch of idiotic parts. i could tell it what going to be an over the top movie from the opening scene but that still couldn't get past how ridiculous some of it was (1 viewing)"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "moonyentalam",
        "review_rating": "3",
        "review_title": "Terrible Zoe",
        "review_detailed_main": "Honestly, I like Max being the zombie but the plot is annoying. Zoe has to be blamed and I am not sorry for her character"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Heididamman",
        "review_rating": "1",
        "review_title": "What was that ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "metalrage666",
        "review_rating": "1",
        "review_title": "Movie's like this make you wish for a real zombie plague",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "zsbiw",
        "review_rating": "7",
        "review_title": "Great locations and actors, but...",
        "review_detailed_main": "This movie has great locations, cinematography, and actors, but the zombies themselves seemed to move too fast. So fast you could hardly see the the blood and gore effects.\n\nThis movie has a pretty main actress (Sophie Skelton). I liked the action scenes. I liked the story. But the zombies and blood and gore effects could've been better.\n\n7/10."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "kittenkongshow",
        "review_rating": "4",
        "review_title": "Better than I expected.",
        "review_detailed_main": "Having read a lot of the reviews here I was expecting to hate it but while it's no classic I found it a entertaining enough watch.\n\nI wonder if some of the hate is because it came out so close to the death of George A Romero.\n\nOver the years I have watched more Zombie flicks than is healthy - a large number of which are wastes of whatever they were shot on, This film actually looks decent isn't as badly acted as some reviewers say (Then again the horror film I watched before was Krampus - The Christmas Devil - Turned off after 20m - bilge).\n\nRemove it from Romero and it's a decent enough film - and this may be blasphemy but go back and watch all of the Romero series...they have dodgy bits too..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "hfcarchyt",
        "review_rating": "2",
        "review_title": "Terrible Acting",
        "review_detailed_main": "Potentially good plot but terrible acting. I tried to get through it but couldn't even make it halfway."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "cb_whitewood",
        "review_rating": "2",
        "review_title": "Hard to get through.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "aarpcats",
        "review_rating": "2",
        "review_title": "Worse than bad.",
        "review_detailed_main": "Bad CGI Terrible acting Terrible plot High school play production values Awful.\n\nI would rather have my entrails eaten by zombies than sit through this movie again,"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "akssaayy",
        "review_rating": "1",
        "review_title": "Why Hollywood cannot create good zombie movies?",
        "review_detailed_main": "The acting is terrible and all the scenes remind you of things not to be done during zombie apocalypse. All characters died due to acts by female characters. This movie had an opportunity but they missed it."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "iGlad",
        "review_rating": "1",
        "review_title": "Brain dead script",
        "review_detailed_main": "Utter drivel and so badly acted it was a disgrace how did this get made. This is the worst of the worst"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "lordraiden112",
        "review_rating": "1",
        "review_title": "Makes those Uwe Boll zombie flicks look like Citizen Kane",
        "review_detailed_main": "Bad, horrible, horendous, retarded, this crap fest did not cost 8 million, more like 8 thousand,because there are zombie gems like The Outpost whick cost about 280.000 and are worth repeat viewings. This looks like money laundering to me. No actor was worth more than 100 bucks in this mess of a film, and the production crew were probably the 'director' and his friends..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "doruksen1",
        "review_rating": "1",
        "review_title": "Worst movie I've ever watched",
        "review_detailed_main": "Generally, I make reviews to movies I love, now I'm a bit upset because I can't vote the movie as 0.\n\nPeople are wasting money & time by making movies like that, acting and script are both the worst ones I've seen up to now. I don't even know if the producer had an expectation by making a movie like this, I hope he hadn't.\n\nFirst scene of the movie will make you understand what quality movie you are watching. Especially I love zombie movies, rather than series, and I was begging movie to end. If you have 90 mins for destroy from your own lives, go ahead watch it, you'll be disappointed."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tamirbraf",
        "review_rating": "6",
        "review_title": "Underated movie !",
        "review_detailed_main": "Nice zombie movie. Don't expect more then a movie to brake the habbit, it isn't a cinematic masterpiece, but good action watched on Netflix, I rated 6, the main character Zoe is cute. 😊"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "WolfgangR5150-1",
        "review_rating": "1",
        "review_title": "Attempt number two at remaking the Romero classic falls shorter than the first attempt. Didn't know that was possible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "macdeutsche",
        "review_rating": "1",
        "review_title": "It's bad",
        "review_detailed_main": "This movie makes no sense. I watch horror movies all the time, but this is bad enough that I stopped watching in the middle."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "lonniew",
        "review_rating": "2",
        "review_title": "I wanted to like this so very much",
        "review_detailed_main": "I saw an article where the director wanted to make this true to George Romero's original as possible and this is anything but that. George would rollover in his grave if he saw this movie.\n\nI will say what I like about it first..\n\n1. The set pieces seemed to be designed to try to match the original sets 2. They used a second of the original music in the beginning.. boo only a second 3. The mood seemed right at first 4. They carried over some of the dialogue of the original\n\nWhat I hated about it:\n\nEverything else.. they changed so many of the core elements from the original that I find it hard for them to say they were trying to stay faithful to the original. They changed so many core elements key to the original film that it felt wrong, including one beloved character that is obvious now the psycho demon like creature that seems as if it were birthed by a demon and the joker..\n\nThey also removed the key storyline of what the mission was in the original .. for the most part, in the first movie it was a major story element and in this remake the key plot lines of the original are throw away pieces that are just there for fillers..\n\nThis is a piece of junk and it dishonors Romero .. HOWEVER ..\n\nIf you never saw Dawn of the dead and you're a youngin' who knows nothing about the mythos George created.. you might have fun with it as a throw away horror film .. it pales in comparison to it's namesake."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "fireflicker38",
        "review_rating": "1",
        "review_title": "Utterly disappointing",
        "review_detailed_main": "This has to be the worst 'zombie' movie ever made. Horrid script, terrible acting, barely any plot, awkward and juvenile.\n\nIt's like a bunch of secondary students got together after school and made this so called movie as part of their drama class. It's that bad. There are some good B movies out there...even with low budgets, but this was not just a waste of time, but an ugly film in every way."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sharonsaxton",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Complete, utter rubbish! Rubbish plot, rubbish acting .. unbelievably bad!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "docdra",
        "review_rating": "2",
        "review_title": "Just not worth it...",
        "review_detailed_main": "I'm not sure what I expected, but I didn't expect it to be this bad. As someone else noted, the very first minute of this movie tells you that it is pure schlock.\n\nTen minutes in and you've seen scenes that just don't flow right or make sense - a college party with champagne and wine, student doctors that are supposed to give a cause of death without ever fully examining the body, a zombie apocalypse in a 'city' that seems short on zombies and victims. Plus sets that look like they filmed it on the backlot of the backlot of a cheap production studio - like way out back to the point they don't even charge for it.\n\nThe script isn't much better and while the acting generally isn't good, it is marginally better than the script - marginally...\n\nJust pass on this unless you're getting together with friends to watch a bad movie you can riff on."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "guidoplaizier",
        "review_rating": "1",
        "review_title": "I don't think they even really tried",
        "review_detailed_main": "Don't bother. It all sucks. Even the styrofoam rocks are terrible."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "brandonsoo",
        "review_rating": "1",
        "review_title": "Epic Fail - Avoid at all costs",
        "review_detailed_main": "This movie is filled with a heap of bad acting with a huge dose of idiotic situations and decisions that really shouldn't happen if you are living in a zombie world. I am surprised how all of these people managed to survive as long as they did."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Sturmgeist1804",
        "review_rating": "6",
        "review_title": "Not that bad",
        "review_detailed_main": "Yes, it is a remake that does not live up to the original.\n\nYes, the protagonist gets everybody killed\n\nYes, the military personnel act like amateurs\n\nNonetheless, good zombie action and violent deaths! I was entertained throughout!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "douchivue1073",
        "review_rating": "1",
        "review_title": "Like many others I also created this in order to just let people know how terrible this movie is.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vali_dum2002",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "I don't understand why someone want to do a remake of a movie and make it worst. I don't understand how that movie earn money from producers. I can write much better screenplays but nobody will give me a dime. Mr. Hèctor Hernández Vicens, please, at next movie, send me a copy of the script and I'll make it better free of charge."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "pesticle",
        "review_rating": "1",
        "review_title": "Just watch the original Day of the Dead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "matt-sickle",
        "review_rating": "1",
        "review_title": "Utter Garbage",
        "review_detailed_main": "This movie is so bad that the only horror here is that it was made at all. You could stuff a cheap camera phone in a beach ball and roll it down the street and get a more pleasing result. This makes putrid shot on video SciFy movies look like masterpiece work. Just don't even think about wasting time watching this."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "evertonimata",
        "review_rating": "1",
        "review_title": "I really wanted to like this movie but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ashecatlin",
        "review_rating": "5",
        "review_title": "From a zombie fan",
        "review_detailed_main": "I'd say this was a good way to kill some time, it's not the best zombie flick but it is entertaining.\n\nIt was advertised as a remake of George Romero's but instead it just takes a few elements from the original.\n\nAlso the guy playing the lead zombie did a fantastic job, easily the best part of the movie."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Teamforest",
        "review_rating": "5",
        "review_title": "It wasn't good but it also wasn't that bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "fetus_milkshake",
        "review_rating": "1",
        "review_title": "very disappointing",
        "review_detailed_main": "Terribly written,casted,acted,directed,filmed.....they didn't even use good equipment to make this. the zombies are laughable! definite b movie and that is being very generous.....no idea how they got away with using \"of the dead\""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "richard_stiles",
        "review_rating": "7",
        "review_title": "Feed The Zombies",
        "review_detailed_main": "A group of Zombie Apocalypse survivors are so compassionate for the plight of the pitiful starving undead, that to make sure the poor helpless zombies don't go hungry, they apparently intentionally feed themselves to the zombies, willingly, one by one.\n\nI mean, there are stupid people in the world who do stupid things, and seeing that in a movie actually can make the movie more realistic, if it's done in a way that evokes \"Okay, yep, I know people that stupid\". But when it goes far beyond the limit of normal stupid choices, the movie becomes The Suicide Games, in which the characters are trying to one-up each other's zombie maulings. \"Okay, we're doing something that has to be done now, and that alone would be so boring it would make the movie boring, so to make it exciting, we're gonna do it in the middle of a bunch of zombies. Who wants to be the zombie food this time?\" To which someone raises their hand high in the air, bouncing on their heels \"Ooh! Ooh! I will!\" And that one is pointed out as the lucky winner, and the one next to them is disappointed, but they'll get another chance next time.\n\nWell, if not being boring was their goal, they accomplished it. But man, it ain't Tolstoy."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tobiasklaye",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": "G.A.Romano would roll over in his grave (no pun intended)"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "enneaa",
        "review_rating": "1",
        "review_title": "Idiot protagonist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ciarang10",
        "review_rating": "1",
        "review_title": "Storyline, acting and ending",
        "review_detailed_main": "I'm not even man! I'm just disappointed. For such a budget a fan could have made a better film! a better cast also. The one thing that annoyed me the most was when the sick kid ran through a door with a horde of zombies running the opposite way!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "wadebabcocksoutheast",
        "review_rating": "2",
        "review_title": "Horrible with nearly no redeaming qualities.",
        "review_detailed_main": "First, many reviews of this talk about a remake of Day of the Dead. I don't believe this is a remake, but just a movies taking advantage of a well known name. I have seen the original as well as at least one remake and this movie doesn't resemble them at all.\n\nNext, most of the acting is this movie is terrible. The lead actress Sophie Skelton was the only one that was even kind of good. The terrible dialog made her seem less talented than she is. I know she is better because I have seen her in other things such as Outlander where she was much better.\n\nLastly, the blood spray effects when people are bitten or ridiculous. Unless everyone's blood pressure was 1200/800 instead of 120/80, no one would spray blood like they were a balloon popping. Some of the other effects were ok, but nothing special.\n\nFor the guys out there, the one thing this type of movie usually has is a few hot girls showing off their assets, but this movie even fails there. If not for the gore, it might as well have been rated PG. At least if you skip the beginning and ending credits, it only wastes about 82 minutes of your life."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "AlbusDumbledore",
        "review_rating": "1",
        "review_title": "Fast and the Furious Zombies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "planktonify",
        "review_rating": "2",
        "review_title": "Yet another Zombie flick?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "coolaza-71540",
        "review_rating": "1",
        "review_title": "The worst movie I have ever seen",
        "review_detailed_main": "The actress Sophie Skelton is so Terrible she ruined her career she's a very bad actress, Trying so hard with her American accent. I think this movie the Is the worsed horror movie I have ever seen. PLEASE DO YOUR SELF A FAVOR AND DON'T WASTE YOUR PRECIOUS TIME... DISGUSTING........ I only give it 1 Star because I couldn't give it any less......."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ianbell-66-621545",
        "review_rating": "2",
        "review_title": "Grit your teeth",
        "review_detailed_main": "2 stars as a nod to the makeup department only. The rest need their screen actors' guild cards revoked."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "meast-15252",
        "review_rating": "7",
        "review_title": "Alright zombie movie",
        "review_detailed_main": "I've seen worse zombie movies. This one is fine. But not better than 100 zombie movies."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "davidoforange",
        "review_rating": "1",
        "review_title": "Complete and utter trash!",
        "review_detailed_main": "The acting and sound was so bad that it felt like I was watching a poorly dubbed film.\n\nWhat's worse, the film manages to copy the storyline of the original \"Day of the Dead\" and make it so bad. Take my advice and steer clear of this burning, stinky trash."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tfminfl",
        "review_rating": "2",
        "review_title": "216. Day of the Dead: Bloodline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "IonicBreezeMachine",
        "review_rating": "3",
        "review_title": "Day of the Dead is remade once again, and while somewhat closer to the 1985 film, it's also simultaneously a step down from the '08 version",
        "review_detailed_main": "Five years after a zombie outbreak, med student Zoe (Sophie Skelton) serves as the doctor to the refugees and military personnel in High Rock Bunker, possibly the last human stronghold. High Rock is overseen by the stern and commanding Miguel (Jeff Gum) whose brother Baca (Marcus Vanco) is Zoe's boyfriend. On a supply run to Zoe's former university to get medical supplies, Zoe's stalker and attempted rapist Max (Johnathon Schaech) has become a zombie, but due to variations in his body chemistry he is more intelligent and \"human\" than other zombies and has retained his obsession with Zoe. Max is able to sneak into High Rock but is soon captured at Zoe's request as she believes he could provide the source for a vaccine.\n\nIn 2013, it was announced yet another remake of George A. Romero's Day of the Dead would be produced a mere 5 years after the release of the previous one. Much like Day of the Dead projects Day of the Dead 2: Contagium and Day of the Dead '08, executive producers James Glenn Dudelson and Robert Franklin Dudelson of Taurus Entertainment were involved with the project as they own the rights to the title (even if their company Taurus Entertainment is strangely absent). Initially it was announced that House at the End of the Street director Mark Tonderai would helm this remake upon initial announcement, but after a five year period between announcement and release Tonderai was only credited as \"co-writer\" while directing duties went to first time feature director Hèctor Hernández Vicens. According to initial announcements, the film was originally going to feature the slow moving zombies seen in the original Day of the Dead with the release also throwing shade at the PG-13 zombie blockbuster World War Z, however this proved not to be the case as the film uses \"runners\" made popular by 28 Days Later and Zack Snyder's Dawn of the Dead remake leading me to believe this was probably a very troubled production with a lot of behind the scenes meddling. Day of the Dead: Bloodline does stay closer to the source material than it's '08 counterpart and features some intriguing ideas, but in execution it's a boring and pretty stupid slog.\n\nI start off by saying only one complementary point on this movie in that I actually did like Johnathon Schaech as the film's antagonist Max who's a more sinister revision on \"Bub\" from the 1985 film and Bud from the 2008 film in that he's a more \"human\" zombie. Unlike the good natured Bub and Bud from the previous films, Max is established as being a sinister presence in the story who has retained his humanity and guile, but when that humanity was originally an obsessed rapist it does lead to some interesting possibilities. Unfortunately, that's where my complements for this movie end because everything aside from the novelty of a zombie stalker is done pretty poorly.\n\nSophie Skelton has proven herself to be a solid actress in other things such as the Starz series outlander, but much like Menu Suvari in the previous film, Skelton doesn't speak with much conviction here and her performance may be even worse than Suvari's was in '08 because there's a decent amount of voice over narration that when she speaks sounds very boring and unenthused. The movie also doesn't have much in the way of interesting characters with most of them being pretty forgettable and full confession: I had to watch this twice because the first time I fell asleep 30 minutes in because of how boring it was. I suppose there's less usage of unconvincing CGI than there was in the first film so the terrible fire effects and CGI Rocky Mountains are absent, but while there is some gore, it's not particularly impressive and we still have CGI blood spurts that just aren't convincing. But the absolute death nail in this movie for me was the incredibly stupid decisions made by characters that allow many of the disasters to happen including but not limited to: Wandering off from the group by yourself with no back-up, letting zombies IN to the secured compound to get samples from them, or brazenly getting up in the face of a captured zombie and taunting it.\n\nMuch like how Day of the Dead '08 existed solely because Zack Snyder's Dawn of the Dead was a hit, Day of the Dead: Bloodline only exists because The Walking Dead was a phenomenon. There's nothing wrong with chasing trends, but when you barely put any effort into your trend chasing with substandard effects, acting, and writing, that's where my leeway runs out."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "raven_guest",
        "review_rating": "1",
        "review_title": "Where to start...",
        "review_detailed_main": "I have no medical training or experience, but even I know a LOT of the things these 'medical students' were doing were wrong; No hair tied back in labs, didn't clean site before taking blood from patient, dealing with 'highly contagious' patient but not wearing gloves or a mask... Things like this remove any chance of become absorbed in a movie as they're just lazy and common sense.\n\nAnd this is before I even start on the acting. The lead's voice overs sounded bored, the acting was terrible from all concerned and the whole thing was just such a mess!\n\nIn the opening scene the lead is walking down a street full of people being attacked. Just casually strolling and calling her mum. She doesn't think to be quiet or run away UNTIL she is being chased.\n\nI couldn't manage more than half an hour as it just made me so angry.\n\nAVOID!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "nure-76810",
        "review_rating": "1",
        "review_title": "Worst zombie movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "lecowang",
        "review_rating": "1",
        "review_title": "The worst zombie movie ever I've see",
        "review_detailed_main": "The story is okay But the personality of roles are so empty and stupid"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Wizard-8",
        "review_rating": "3",
        "review_title": "A real dead \"Dead\" movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ILovePigeonsALot",
        "review_rating": "2",
        "review_title": "#Metoo Horror film before #Metoo",
        "review_detailed_main": "First of all there was no need to try to include a potential assault on a female in a zombie movie like this to try to somehow give the heroine in the story some battle scars and make her some edgy \"strong\" independent woman only for her to be the single reason why everyone died and the absolute mess that the movie turned into.\n\nThis was barely a zombie film, more zombies needed and less poor acting. It is a VERY LOOSE re-imagining of the original 1985.\n\nWeak writing, leaky plot and mediocre zombies. At this point just watch the original from 1985 and do not waste your time with this. This is not even a time burner.\n\nA lot of these remakes are getting churned out at rapid speed they even make direct-to-video movies look liek Avatar."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "kschonauer-85610",
        "review_rating": "7",
        "review_title": "Not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "PhilipMartin81",
        "review_rating": "1",
        "review_title": "Oh dear....",
        "review_detailed_main": "Romero's Day Of The Dead is arguably the best of his original trilogy. They tried to remake this masterpiece with the help of Mena Suvari, Ving Rhames and co, and it worked out terribly. You'd think another attempt would draw on the failures of that turkey. But Bloodline manages to enhance the failings even further to produce this absolute dud of a movie. The acting is incredibly wooden, and that's usually something I can get past but if it weren't for utterly poor story. I'd watch it if you are a pure zombie genre fan and need to tick it off your list but I'd sooner rewatch Miss Suvari shooting at zombies that can walk on ceilings!!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vanusa-44121",
        "review_rating": "1",
        "review_title": "Wasted over an 1 hour of my life for nothing! Terrible movie",
        "review_detailed_main": "Painful to watch, Zoe should have been the first person to die and maybe the movie would have been better. The acting was poor and the story line was even worst."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "binge_watchr",
        "review_rating": "1",
        "review_title": "This is worst movie you can ever see...",
        "review_detailed_main": "After watching almost 1500+ movies, I am quite comfortable in saying that this is the worst movie one can ever see.. I thought of giving it a chance on Netflix but now i regret it..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "crazyben17",
        "review_rating": "1",
        "review_title": "Zoe The Dumba**",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sadakobayushi",
        "review_rating": "3",
        "review_title": "Surprising, but not in the way you'd hope",
        "review_detailed_main": "I went into this movie with certain expectations. I really, really liked the original, so I didn't expect it to match that in any way. The previous remake was pretty bad, so I figured that this would be better than that one at least. That's... not how it worked out, unfortunately.\n\nFor starters, the acting is astonishingly awful. I watch a lot of B-Movies, I'm used to bad acting, but nothing that was said in the movie felt right in the slightest; it was stilted and wooden like they were trying to channel too much intensity into every conversation. It wasn't even amusing like some movies acting, instead being painfully dull. I must admit, I skipped about five minutes halfway through because I realised that it was just going to be five minutes of unlikable characters talking angrily at each other. I didn't miss much.\n\nThe special effects are sometimes decent, but most of the time it's high-pressure sprays that just look goofy. There was one bit where someone got dragged behind a counter and then the bloodspray shoots up from the opposite side of where it should. With characters like this, the least you could hope for is them satisfyingly getting munched on, and we didn't really get that. The makeup on the zombies is pretty decent, at least.\n\nThe story itself is basically similar to the original, but without the intelligence, wit, or social commentary. Instead we get more characters doing stupid things because, well, that's how they keep the plot moving! They wander off, don't lock doors behind them, assume flimsy materials will hold back hundreds of zombies... I wouldn't expect them to survive a romantic comedy, much less a horror movie. I am astonished that they somehow survived five years between the opening and the main film.\n\nI saw a review that described it as \"More Fulci than Romero.\" In fact, it was that comparison that intrigued me. The thing is, Fulci movies don't have great characters, or deep stories, but what they do have is satisfying gore and grue, an unsettling atmosphere, and music that's eerie and fitting. The only music from this that comes to mind is the end credits metal, which is already fading from my memory. None of it is notable in any way.\n\nDay of the Dead: Bloodline is no Romero. It isn't even Fulci, or Bava (I'm thinking Lamberto, but either works), or even Lenzi. It is a failure on just about every level that somehow, astonishingly, makes me wish I was watching the 2008 remake instead.\n\nAnd that's incredibly sad."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "phantasma-79041",
        "review_rating": "1",
        "review_title": "Die little girld",
        "review_detailed_main": "Total crap with retard senario and actors. Especially the precious little usless girl that should be saved and everyother should die"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "romeroseviltwin",
        "review_rating": "2",
        "review_title": "What the expletive?",
        "review_detailed_main": "Everything everyone else said except how do you kill a zombie by breaking its neck???"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "iotaquilarea",
        "review_rating": "1",
        "review_title": "This movie ruined my day.",
        "review_detailed_main": "I lost my hope of humanity because of this movie. If we, humans can make something like that we should be gone from this world."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "amesmonde",
        "review_rating": "",
        "review_title": "Some redeeming features.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "johnnyhammarberg",
        "review_rating": "6",
        "review_title": "Good movie with a huge hole when it comes to the end.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "eric-wallis",
        "review_rating": "3",
        "review_title": "Sloppy mess!",
        "review_detailed_main": "I am a huge horror movie fan! I love the original \"Day of the Dead\" movie. I wish this mess had not been made! Characters are uninteresting. The acting is bad and the special effects are awful."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jakobtatar",
        "review_rating": "1",
        "review_title": "TERRIBLE!",
        "review_detailed_main": "The movie could have been great if not for the lead actress."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "DanzWMe",
        "review_rating": "1",
        "review_title": "Hard Pass",
        "review_detailed_main": "I could only get to 10 minutes of this crap before I turned it off and I didn't watch the full 10 minutes because it was too boring.\n\nI was majorly distracted & that says all you need to know about this mess. I was honestly trying to watch it because I'm a fan of the original & had actually just watched the original the night before but it was too boring & was dragging with nothing happening or going on in these first 10 minutes that could have held my attention.\n\nI was trying to watch to determine if it was following the same plotline as the original but I don't \"think\" it was & was too disinterested in finding out anything further with it. Why'd they even bother!\n\nPass this one, you'll thank me later."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "zipionlive-10195",
        "review_rating": "2",
        "review_title": "Day of the Useless Ripoff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "brownragga",
        "review_rating": "2",
        "review_title": "Annoying characters",
        "review_detailed_main": "I came for big guns and zombies - I got poorly written annoying characters and bad acting instead...was a waste of time"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "gigazabal",
        "review_rating": "2",
        "review_title": "Well",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Alewxithymia",
        "review_rating": "3",
        "review_title": "This is NOT a \"Good bad movie\". It's just bad...",
        "review_detailed_main": "Just want to make a review to warn those (like me) who are looking for good bad movies. This is not it. It's just straight up poor. I know bad acting sometimes can make a movie hilarious. But this movie is trying to be serious with no success.\n\nThe movie has pretty decent effects and good camera quality and all, but it doesn't make up for the bad plot and acting. Stay away if you are looking for a good zombie movie, or a good bad zombie movie. This is neither."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bland-kevin67",
        "review_rating": "1",
        "review_title": "Great distraction but Bad bad movie",
        "review_detailed_main": "I watched this despite my wife's protests and the ratings on NetFlix because I have seen some pretty nice flicks which were lowly rated. This one was spot on! The movie made bad movies seem no so bad. I feel bad for the actors who are trying to make a name in Hollywood but also need to make a paycheck. The movie starts out as a flashback from a scene that is never referenced in it again! The directing seemed to be so juvenile that even a high school student film would fare better. Not sure if this could be called a remake since it lacks the story line of the original and the non sensical killing was moot. I'm glad the director was kind enough to limit it to 90 minutes."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "drewisgnarly",
        "review_rating": "6",
        "review_title": "Not the worst zombie film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tedkraan",
        "review_rating": "2",
        "review_title": "2 stars for props and makeup",
        "review_detailed_main": "I'm trying to give a spoilerfree review here.\n\nThe problem with the story of this movie is that it doesn't know what kind of story it wants to be. It isn't a real zombie movie.\n\nCombine this with the cheesy acting that you wouldn't find in most B movies. (It's worse)\n\nLastly the script and the characters are very illogical, making it impossible to root for anybody. And not caring for what happens to the protagonist, kills the suspense or scariness quite quickly.\n\nTo sum it up a bland undermediocre waste of time. Nothing like George Romero would produce."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "grizzlygripskating",
        "review_rating": "1",
        "review_title": "Im impressed",
        "review_detailed_main": "With how bad the movie is, but im confused with how someone watched the movie once it was complete and said \"this should be released to the public\""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "papadeltazulu",
        "review_rating": "1",
        "review_title": "Even worse than the 2008 remake",
        "review_detailed_main": "There's not much point going into detail about this, plenty before me have said it all. Dreadful script, awful acting, poorly filmed and has people doing the most dumb stupid things you'll ever see on film. It's infuriating to sit through, predictable as hell and actually makes the 2008 movie look good in comparison (if that's possible) simple but ok special effects can't save this one from being a contender for worst horror film of the year.\n\nAvoid."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "saramichro30",
        "review_rating": "1",
        "review_title": "Not bother",
        "review_detailed_main": "This movie was just plan bad, everything is Zoe's fault, per the movie senario. There is a gross factor to it though. Gross acting, gross plot and yeah the zombies are gross. ( only saving grace) I have never written a review on here but this movie was just that bad. Save your $5.99 rental fee and go by yourself a latte. Much better choice."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "campergrl",
        "review_rating": "4",
        "review_title": "It's okay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mayenkkhadka",
        "review_rating": "1",
        "review_title": "Not worth wasting your time on",
        "review_detailed_main": "Dont watch it. Just dont watch it. Some makers and actors are seriously ruining this beautiful genre. Why waste money on these kind of movies? The story line, the direction , the actors everything is bad about this movie.. What were the makers thinking, like honestly. I swear the story & the actors are just irritating. Baseless concept. Baseless story line. Baseless acting. & the fact that this movie is on the netflix just amazes me.\n\nDont watch it. Just dont watch it. Some makers and actors are seriously ruining this beautiful genre. Why waste money on these kind of movies? The story line, the direction , the actors everything is bad about this movie.. What were the makers thinking, like honestly. I swear the story & the actors are just irritating. Baseless concept. Baseless story line. Baseless acting. & the fact that this movie is on the netflix just amazes me.\n\nDont watch it. Just dont watch it. Some makers and actors are seriously ruining this beautiful genre. Why waste money on these kind of movies? The story line, the direction , the actors everything is bad about this movie.. What were the makers thinking, like honestly. I swear the story & the actors are just irritating. Baseless concept. Baseless story line. Baseless acting. & the fact that this movie is on the netflix just amazes me."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "realityinmind",
        "review_rating": "1",
        "review_title": "Absolutely horrible actors cast by a horrible casting team",
        "review_detailed_main": "Two people were responsible for casting this movie... Jeremy Zimmermann and Mariana Stansheva. These two people should never be allowed to work on another movie ever again. The cast for this movie is the worst cast I have ever seen in a movie, ever. Period. All of the women look exactly the same. All the men look exactly the same. They are all young actors, which is not believable in the slightest for this sort of story. One actor was so bad they had to overdub all of his lines... I wonder if it is even the actual actor's voice?!\n\nZimmermann has been a casting director for decades... he worked on hundreds of movies from Kevin Costner's Robin Hood to Hellboy 2. Stansheva has been casting for 15 years, but mostly low budget movies. Regardless, these two people should not have a job after casting this movie with the horrible actors that they used.\n\nCongratulations to the makeup effects and cinematography. Hopefully this movie didn't hurt their careers much.\n\nOverall the director is to blame for this horrible crap. This is the last movie he has directed, and that might be for the best."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "dogndogs",
        "review_rating": "4",
        "review_title": "James Bond Zombie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jlukasik",
        "review_rating": "1",
        "review_title": "Awful!",
        "review_detailed_main": "Couldn't even make it 30 minutes in. Completely awful!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mrpaynex",
        "review_rating": "1",
        "review_title": "NETFLIX WTF",
        "review_detailed_main": "BOI NEFLIX IF YOU DONT GET THIS HOT PIECE OF TRASH! BOOTY! ASS! MOVIE OFF YOUR DAM PLAYLIST!!!! KMT! This movie doesn't even deserve the one star I had to give it due to the IMDB rating system (IMDB step ya game up), nor does it deserve any kind of critical analysis whatsoever! Beyond the story being trash! Acting trash! characters trash!, writing trash! direction trash! this film is basically a nonsensical pile of ish! that should have never been made in any iteration of are possible multi-dimensional universe and or spiritual plain of existence, how any studio put 8mil into this movie is beyond me and probably says a lot more about the current state of the world than anything else, I was going to write something about that being ironic because this movie is meant to be a retelling of George A. Romero's third instalment in his original zombie movie trilogy, in which he clearly reflects some aspects of modern psyche and society of the USA if not the world in the era the films were made and BLUH BLAH BLUH! Film definitely doesn't deserve any level of mental energy I just used to even formulate the basis of that thought, you made a bad movie guy! Stupid ass...piece of ish ass.... wouldn't wipe my ass wid the script ass... hot ass trash ass.... wasted an hour an a half of my life ass.... wait! I sat tru this whole movie! I am clearly a dumbass.... don't watch bad movie kids."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "johnanthonymazzei",
        "review_rating": "5",
        "review_title": "Adventures of a Lovesick, Commando Zombie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sparkyhughes33",
        "review_rating": "3",
        "review_title": "Awful, just awful.",
        "review_detailed_main": "Don't know where to start with how bad this movie is, the acting is terrible, you can see each one is waiting for their mark, they sound like they are reading idiot cards, no emotion, no tonal influences, it's a very hard watch. Don't bother."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ehansen-52754",
        "review_rating": "1",
        "review_title": "Laughable acting",
        "review_detailed_main": "The characters are so monotone, and the acting so poor, that the zombies appear more lively and vibrant in comparison."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jackbrant-54259",
        "review_rating": "1",
        "review_title": ":/",
        "review_detailed_main": "So so bad... they have obviously been given the money for the effects but not enough to get some decent actors. Also most of the zombie moans don't match up with the mouth."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "hazelparis",
        "review_rating": "1",
        "review_title": "Uhmmmmm....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "MfromBelguim",
        "review_rating": "1",
        "review_title": "The worst movie ever",
        "review_detailed_main": "In total I could stand 18 minutes and 31 seconds of this movie. Really? I'm a big fan of the genre. I love watching horror movies but this? A great zombie film is my absolute favourite, by the way were they supposed to be zombies ? Anyway, I wanted to give a zero but I gave one point for effort."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "markgallup",
        "review_rating": "4",
        "review_title": "Nothing to Special to See Here",
        "review_detailed_main": "This movie doesn't do all that much to push the envelope of zombie films. The story is only just okay and most of the characters have no personalities. I'd say the second half is where the story and characters improve a bit which made it a little more enjoyable. The acting has some low lows as well.\n\nThe zombie design isn't too bad, they have a look that stays true to Romero's film and the gore has some highlights. There are some interesting concepts such as a new look at zombie virus and cure, but the execution isn't very well done.\n\nI would recommend this film only to big zombie fans who want to get there fix, the movie isn't horrible but it edges onto poor. Some of the scenes are decent and the gore is there. But anyone else, I would say give Romero's films a watch or even some of the Return of the Living Dead movies."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "danthom-28031",
        "review_rating": "4",
        "review_title": "Disappointing.",
        "review_detailed_main": "For a genre with many great variations of living dead films, Bloodline cannot be said to be one of those films with Mark and Lar's version of Day of the Dead severely lacking in comparison to Romero's. The hospital opener for starters just appeared to do away with whatever story could follow, aided worse by the ridiculous five-year leap. I mean, seriously. We're to believe Zoe, played by Sophie Skelton, never mentioned the hospital before, or any of her childhood to Baca, right? Not credible. Then there's Miguel, who didn't prefer Rhodes (Pilato) to Miguel (Jeff Gum). Sure, Miguel, like Rhodes, is actually the good guy of the story and is only trying to keep people safe, and Gum's performance was great and filled with intensity, but I just felt Rhodes had more depth. More layers to him. In the end, Bloodline just wasn't as good or as fulfilling as it should have been, especially Max. Disappointing!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "robturnerisc",
        "review_rating": "4",
        "review_title": "Really?",
        "review_detailed_main": "Garbage film. The only redeeming thing is the lead actress looks like Tori Black."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "chenpanker",
        "review_rating": "1",
        "review_title": "A Waste Of Your Time",
        "review_detailed_main": "Such a bad movie, suffer every minute of this. terrible acting"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "juliegjoertz",
        "review_rating": "1",
        "review_title": "So bad that you LAUGH at a supposedly \"scary\" movie",
        "review_detailed_main": "Enough said - but if you don't believe me and want to see just how bad acting and a plot really can be, go ahead. I actually created this profile just to worn everyone about this horrible low-budget movie :)"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "williammccleave",
        "review_rating": "3",
        "review_title": "George would be rolling in his grave",
        "review_detailed_main": "Terrible acting, zero plot.\n\nMy fault for giving it an optimistic watch. It can't be that bad. It's terrible."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "zildjian_x",
        "review_rating": "4",
        "review_title": "It's ok if you don't expect much from it",
        "review_detailed_main": "If you're expecting a Dawn of The Dead or 28 Days Later, then of course you're in for a huge disappointment. If you take it for what it is though, just a cheap and cheesy zombie movie, it's actually not too bad. If you're a lover of zombie movies and you have nothing else to watch, give it a shot. It's not very good, but it was entertaining enough to keep my attention."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "hakeemtarabulsi",
        "review_rating": "2",
        "review_title": "Horrible Remake",
        "review_detailed_main": "This movie is a horrible remake of the 1985 'Day of the Dead'.\n\nAgain, why producers are insisting on feeding the viewers with lousy versions of good reputed old movies?\n\nMost of its scenes were filmed in dark, where there is no need for much setups, effects, decorations, etc., while the performance of ALL actors was less than zero."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "dwremy",
        "review_rating": "2",
        "review_title": "NOT GOOD.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "terryamartey",
        "review_rating": "1",
        "review_title": "A very useless movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "michaeljpfitzgerald",
        "review_rating": "1",
        "review_title": "Holy cow, this is dreadful",
        "review_detailed_main": "An unwatchable hot mess, it's extremely depressing that this pile managed to pull the DAY OF THE DEAD brand. There is nothing shared between this and Romero's works.\n\nI couldn't force myself to go all the way, here, but if you intend to, and you want something utterly terrible to focus on - the sound editing is bizarre and every actor sounds badly dubbed. Stress-inducing production."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "aloule",
        "review_rating": "5",
        "review_title": "could have been nice with better plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tomgibbins",
        "review_rating": "1",
        "review_title": "Why 😮",
        "review_detailed_main": "Well that's 90 minutes I'm never going to get back"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "lucasbrausch",
        "review_rating": "2",
        "review_title": "Not even funny",
        "review_detailed_main": "This film has two redeeming qualities:\n\n1: Two of the performances were close to acceptable even if the script made them boring as hell (no pun intended)\n\n2: Some scenes are actually so bad that you can enjoy them as a comedy.\n\nThat's it. Just... don't. All the other performances are unwatchable, the plot is complete garbage, you know everything in advance and it's stupid decisions all over the place. The cinematography and lighting are useless, the dialogues are horribly written and the characters are far from interesting. It's a good movie to get annoyed about, if that's what you're looking for. Not even the zombies looked even remotely good. (Exception for the main zombie I guess he looked alright)"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "parry_na",
        "review_rating": "5",
        "review_title": "Adequate but nothing new.",
        "review_detailed_main": "For a film called 'Day of the Dead: Bloodline', this delivers what you would expect - nothing more, possibly slightly less. Rubber faced zombies stalk the city street set and deliver much theatrical bloodletting: cascades of the stuff shoot out toward the camera. Then we get to know the characters - sullen, pretty, some in love with each other, most just delivering deadpan military-isms: earnest recriminations and stoical retorts. Curiously, it's a bit bland, the gore scenes committed perfunctorily, creepy moments and dark corners just the same as you will probably have seen before, rolled out with an alarming lack of tension.\n\nIn horror films such as this, heroic leads have to make illogical decisions. You could blame heightened emotions, the stress of the relentless apocalypse, or simply the need to place them in jeopardy. But they're such a torpid bunch, you're not really bothered about what happens to most of them.\n\nZoe, the main character, is well-meaning, pretty, brave, and is ultimately responsible for the death of hundreds. Most interesting is Max, the undead attempted rapist regularly taunted at close range by our heroes. My score for the film is 5 out of 10."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "phoebe-26659",
        "review_rating": "1",
        "review_title": "Horrible acting!!!",
        "review_detailed_main": "Where can you find the actress who can just read lines??? I just couldn't stand Zoe's acting!!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "LouAbbott",
        "review_rating": "4",
        "review_title": "A Take On A Classic That Shouldn't Have Been Taken",
        "review_detailed_main": "In the original \"Day of the Dead\" script, George A. Romero envisioned the living training zombies to kill other zombies. Due to money constraints and the possibility of the film receiving an X rating, his original vision changed. I and other Romero fans had high hopes this film would use the original script. High hopes shot down, cut up or eaten. \"Bloodline\" is the type of film that gives away 90% of the plot during the first 10 or so minutes. The film is not as bad as some have written. Still, \"Bloodline\" is a take on George A. Romero's classic that probably shouldn't have been taken."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "gamerposturehealth",
        "review_rating": "2",
        "review_title": "STINKER",
        "review_detailed_main": "Terrible plot, horrible characters, poor acting . The only good thing about this movie was seeing Sophie Skelton in tight pants."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sarsing-80099",
        "review_rating": "1",
        "review_title": "I thought this should have been on syfy",
        "review_detailed_main": "Whilst scrolling through Netflix, and getting tired of wasting 20 minutes perusing, I settled on this. I've been a lifelong fan of the zombie genre. There was absolutely no character development. The main character Zoe is an idiot, the entire plot has more holes than swiss cheese. The only good thing about the movie is the zombie makeup. Save your time, I'd rather watch paint dry"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "dawnofdead",
        "review_rating": "1",
        "review_title": "10 minutes",
        "review_detailed_main": "I seriously could not get past more than 10 minutes of this movie. It was bad, and I love crappy, cheesy horror flicks. It wasn't worth the effort of a remake. Definitely a mistake and an insult to the name of George A. Romero. Don't even waste your time."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rokgregori",
        "review_rating": "1",
        "review_title": "NOO!",
        "review_detailed_main": "Just dont dont lose your time on this crazy stupid movie, one of the worst movies ever!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bobbiwibble",
        "review_rating": "2",
        "review_title": "Embarrassingly bad",
        "review_detailed_main": "This started off so much like a parody that I watched the whole thing waiting for the twist.\n\nThe only positive thing I can say is that the actors did the best with what they were given, especially the lead. She seems like a decent actress but the dialogue and framing was so horrible that none of the actors stood a chance"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sawrabhsingh",
        "review_rating": "1",
        "review_title": "Third class picture",
        "review_detailed_main": "This is the first film on Netflix I have watched in fast forward.. None of the actors were doing acting.. It was so boring.. I am still in a shocked that I have watched it.total waste of money. I never write on films.. This is the first time i am writing.. Direction is like, the director is not in a mood of filming.. (suggestion) don't make a sequel of this.. Sorry Mr producer 💔 .. I am from india.. We love this kind of movie very much.. But this one is beyond 😅 .. One thing I like, the main zombie.. Kadak banda tha.. The concept is good.. Make up n all the effects is all good.. But the art work is not good.. Screenplay is too weak. But all over the worst part is direction.. Sorry to say that."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "ralph-67198",
        "review_rating": "1",
        "review_title": "Well. It was kinda funny for like 25% of it. I'm the end, it was all AWFUL",
        "review_detailed_main": "One of the worst movies I have ever seen. Maybe the worst. No effort was put into this studio dumpster fire of a movie. It took a great first movie (day of the dead 1985) and tore it apart and crapped on it. Now, the three main things that I find make the movie a mess\n\nThe acting and characters- the actors are all awful, no suprise there. Not a single one is believable at all in their roles. Also, the characters SUCK. They have no development, and the ones that do you don't like anyways. They also making some of the dumbest decisions I have ever seen, some that are minor and will slow down the plot to ones that ruin everything.Nice job, main character who I forgot the name of. You ruined everything with your dumb plan that makes NO sense. You killed everyone, except all the kids, of course, because this film doesn't take a single risk.\n\nNext up, the production design and technical things- it all sucks. What a surprise. The movie is blandly shot, the action scenes are terrible, the music sounds awful, the sets look fake, the CGI looks atrocious, the practical stuff even looks fake because of how bloody simple things like stabs get. All of it is just awful, and is embarrassing, as I have seen low budget films have much better everything. To make it even worse, the editing and pacing makes me think a student filmmaker from the 4th grade made it The only thing I can commend about it is that the props look real, but that can be pretty hard to mess up.\n\nFinally, the script, dialogue and plot- there isn't much to say here. The dialogue all sounds extremely fake, the script was poorly written, and the plot was nonsensical. It was one of the dumbest movie plots I think I have ever seen.\n\nDon't watch it. It's not worth it. It's not even a so bad it's good. Heck, it's not even a one out of ten. It's like a 0.5/10. It's The worst film I have ever seen, and a complete Trainwreck on every level."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Redpawn3",
        "review_rating": "5",
        "review_title": "Change name better reception",
        "review_detailed_main": "I have a strong feeling that if the name was changed, this would be a pleasant low budget fi.\n\nI have seen so much worse than this film, and so much better of course.\n\nNot a fan of the voiceover narrative logs in this film (its fine in many other films).\n\nThe title sets up expectations that this film fails to deliver. But it's fine schlock if you remove expectations."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vmm-44628",
        "review_rating": "1",
        "review_title": "Omg you have to watch this!",
        "review_detailed_main": "Wow this movie is so so bad you have to watch it. I had to look it up after watching it for 5 minutes to see if it was a comedy. The acting is soooooo bad. It's been a long time since I've seen a movie this bad where ALL the actors are bad! You have to watch it just to laugh at the acting!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "irazgulsayr",
        "review_rating": "5",
        "review_title": "The zombies ( walkers)",
        "review_detailed_main": "In this movie the zombies act just like humans, you will really start to think they are human. They are also the fastest and smartest for a zombie. In the Walking Dead series, the zombies were much slower and relied on people's smells. Here in this movie zombies can run and jump super fast. So a bit different. It's an exciting movie, but the zombies just had to be really different."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "goth-yagamy",
        "review_rating": "1",
        "review_title": "An insult to the entire genre and to the viewer",
        "review_detailed_main": "It takes some merit to make a remake worse that the one from 2008. But somehow they managed that with this one.\n\nThis amalgamation of bad clichés, ridiculous dialogues, forced situations is a disaster that should have not seen the light of day.\n\nThe insult comes when you think that this has the \"Day of the Dead\" name on it and sells itself as a remake. The idea that those responsible for it were trying to appeal to fans of the original is insulting, since the only way to pull this up is to take every single one of those fans as some kind of mindless teenager without criteria and the work of Romero as some generic cheap bloodbath. Did they really think of them as so stupid?\n\nIf they were to spit over Romero's grave, it would have been faster and less disrespectful than releasing this brain-killing disease into the world.\n\n1 Star, because I have to at least put 1 and because Johnathon Schaech tries and does the best he is able to, considering the tragedy of a film that he got himself into."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "Quantom-X",
        "review_rating": "3",
        "review_title": "Do these even still make money?",
        "review_detailed_main": "A typical C movie low budge zombie film with little substance. This is supposedly a remake of the 1985 Day of the Dead film, however I never saw the original so I can't judge it based on that.\n\nThe effects are bad, the acting is terrible and the plot kinda stupid. It has an interesting idea with a zombie made from a human that has much higher immune counts than usual only partly turning and being the breakthrough they need to create a vaccine. However, it's just a bad movie. Very little saving grace about it. It's not really worth your time."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "oubay2004-326-874772",
        "review_rating": "1",
        "review_title": "I wish there was a worst rating",
        "review_detailed_main": "Please save yourselves from watching this freak show, not worth even 1 min of your time, run away and don't look back"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "malcolmmh",
        "review_rating": "2",
        "review_title": "A single highlight: Jonathon Schaech",
        "review_detailed_main": "There is one highlight in this film, and that is Johnathon Schaech as Max the zombie. His portrayal of Max, turned zombie, is the only redeeming element in a movie full of horrible acting ( I really mean horrible acting), terrible plot and story line, and hilariously bad blood squirting effects. I hope that his portrayal of a zombie catches the eyes of someone with movie/directing talent and he gets another opportunity to apply his craft as a zombie in a good film, he has the potential to be an iconic horror character like Jason Voohees, Freddie Krueger, or Candyman. If you can watch it without spending any money do so, and just fast forward to the scenes with Max... otherwise leave this one alone."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sarah-263-133115",
        "review_rating": "1",
        "review_title": "Day of the don't!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "robfollower",
        "review_rating": "5",
        "review_title": "Day of the Dead: Bloodline(2017)",
        "review_detailed_main": "Let's face it, Day of the Dead: Bloodline is one of those films that we would have happily done without. Between directing errors, a script that dances between the banal and the absurd - among other things co-written by Romero himself -, and an acting at the limit of endurance, Vicens' zombie movie unfortunately ends up going right into that array of remakes without criteria, unsolicited, and absolutely avoidable. Yet the first few minutes would seem to introduce a completely different result.\n\nAt the expense of a well-made make-up work, Day of the Dead: Bloodline is accompanied by a poor-quality script: rough in the way it reels off the events, banal in the references to the original film, stuffed with cliché scenes, and discounted beyond belief, especially in the end. Many - too many - are the obscure points which, needless to say, are accompanied by an at times disarming acting. To save the shack only Johnathon Schaech as an almost sentient zombie, think a little !?\n\nCertainly with Day of the Dead: Bloodline we did not hope to find the perfect zombie movie, but at least a film capable of resting the foundations on a well-structured story. Profound disappointment!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jomsimpelo",
        "review_rating": "1",
        "review_title": "POOR ACTING!",
        "review_detailed_main": "Special effects are good, but damn the acting are very bad thank you netflix for giving us another freaking waste of time movie!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "esangandrada",
        "review_rating": "2",
        "review_title": "Very bad movie!",
        "review_detailed_main": "First of all, I do not recommend this movie. Never! Acting sucks and the main character irritates me. It irks me that a movie like this exist. I guess this is more like a comedy one as how horrible it is."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "grhgulhan-24150",
        "review_rating": "1",
        "review_title": "don't waste your time",
        "review_detailed_main": "I couldn't bear more than ten mins to weird plot awful acting and people exploding like a bomb with a bite... don't even bother trying to watch"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "akleinekoort",
        "review_rating": "1",
        "review_title": "So bad it's not good... Just bad",
        "review_detailed_main": "Only 4 minutes in I could tell exactly how bad this movie was going to be, this is an absolute disgrace to the day of the dead name SAVE YOURSELVES FROM THIS STEAMING GARBAGE PILE OF A MOVIE!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "voodoochild-jr",
        "review_rating": "1",
        "review_title": "Dear oh dear...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Name (it)",
        "review_detailed_main": "Taking on the name of a very popular entry of the Romero original zombie trilogy is one thing. Trying to pay homage to it, also would usually give it bonus points. Still giving it updates of some form of course. But still this does dissapoint overall for many reasons.\n\nI like some of the actors involved (especially the new Bob), but the degree of ... how shall I put it? If Zombies are out for brains, they will not find a lot here. The setting and the military containment zone is nice, but the fact the story and as already stated the characters are a mess ... it does not help much! Saying people here are irresponsible would be an understatement! Not a good horror at all"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "a-wordley",
        "review_rating": "2",
        "review_title": "Why?",
        "review_detailed_main": "George Romeros \"Day\" was a classic in the zombie genre, \"Dawn\" 2004 was a decent reworking of the original. This is probably the worst I've seen in this genre and I've seen \"The Dead don't die\". Poor characters, laughable effects and predictable at every turn."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "xjlyon",
        "review_rating": "3",
        "review_title": "Lame",
        "review_detailed_main": "The story line was pretty lame. The acting was pretty much the same."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "desperado_here",
        "review_rating": "5",
        "review_title": "when warm bodies goes wrong lol",
        "review_detailed_main": "The movie is okay if nothin good is on and you also like zombie movies."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "peter-46978",
        "review_rating": "5",
        "review_title": "Intelligent Rapist Super-Zombie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "tincy22",
        "review_rating": "1",
        "review_title": "amm..staring at the ceiling for 90 min would be better spent..",
        "review_detailed_main": "Wow..the acting left me speechless..i have seen bad movies before but this one is beyond bad..it leaves you mad at yourself for spending the last hour and a half watching it! i can only say> don't go in there!!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "bgilland-815-616755",
        "review_rating": "1",
        "review_title": "Nooooooo!!'",
        "review_detailed_main": "Why why why!! Why would someone create this and think it was good! Bad bad bad... with all the zombies movie out there, this has to be one of the worst!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "mattvalo",
        "review_rating": "1",
        "review_title": "Dumbest zombie movie plot ever",
        "review_detailed_main": "Yet another movie that tries to link itself to Romero's sextology. So, imagine yourself the original Day of the Dead, except all the characters are dumb. And zombies can sneak around and crawl in the vents. Anb Bub (here called Max) is a.."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "linaabusharar2003",
        "review_rating": "1",
        "review_title": "Don't let the title fool you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "yodajmdod",
        "review_rating": "1",
        "review_title": "The worst Horror film I have ever seen in the past.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "murfiano",
        "review_rating": "2",
        "review_title": "A star for something positive (2 positives)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "sugardaddy-31900",
        "review_rating": "4",
        "review_title": "Not sure if it's an A or a B movie",
        "review_detailed_main": "Decent film but there's plenty that lets it down. The acting at times isn't too bad but when they speak, that's where it goes down hill...fast. The blood splatter from the bites are way over the top and then god awful cheesy story line is terrible at times. The military guys are about as useful as jizz flavoured beer and it's hard to believe what happens because of their incompetents. Too many times the film try's to scare you with the (I've looked behind me so I'll turn around and 2 seconds later I'm being attacked) technique. A lot about this film had B movies qualities but I don't think it's quiet there. A- movie."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "micw-34546",
        "review_rating": "5",
        "review_title": "Not as bad as it first seems",
        "review_detailed_main": "The production value is shocking the special effects are awful. The acting is nothing to write home about but if you give it a chance actually turns out ok."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "michael_bristow",
        "review_rating": "2",
        "review_title": "Terrible acting and dialogue",
        "review_detailed_main": "Paint by numbers plot, made worse by awful acting and dialogue.Two dimensional characters. Avoid."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "thedarkestshadow-32785",
        "review_rating": "4",
        "review_title": "Not as bad as the previous \"remakes\"",
        "review_detailed_main": "At least this one doesn't have zombies that can climb walls like Spider-Man or contain stupid made up words like Contagium. The acting is a mixed bag. The actors themselves are a mixed bag as well. The main character sometimes acts fine and then other times her punctuation is just......."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "petkanasw",
        "review_rating": "2",
        "review_title": "Low Budget, Lower script",
        "review_detailed_main": "OK, a low budget horror film shot in Bulgaria. It has some production values and mediocre acting, but that's not the worst of it. The lines sound like a table read of the first version of the script. The lines desperately need editing - they're stayed and stale and some don't even make sense in the context in which they're delivered. Such un-natural lines make it sound like it was badly translated from another language, which might actually be the case."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "martinpbishop",
        "review_rating": "3",
        "review_title": "I wanted the Zombies to win",
        "review_detailed_main": "If you are a fan of bad acting and an awful script then this film is for you. Thrill to the plot holes, excite to the stilted delivery by the cast and come to the conclusion that the only Brain Dead were the people who commissioned this pile of manure. Some nice gore though."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "nitzanhavoc",
        "review_rating": "5",
        "review_title": "The very defibition of an okay Zombie flick.",
        "review_detailed_main": "First thing's first - I did not know this was a remake. Perhaps it means unforgivable ignorance on my behalf, but I simply looked a nice film on Netflix and came across this. Trailer seemed okay, so I figured, what the heck? This means that perhaps my opinion would have been more harsh had I had the whole \"I must compare this to the original and deduct one point for each and every difference\" thing going. I honestly don't understand why people do that to themselves.\n\nSo, Bloodline was to me like a Friday night family dinner. It isn't made by a chef, it isn't a taste-bud orgasm and it might even not contain your favorite childhood dish. It's just nice. The film is a regular Zombie flick with a nice story and a main plotline which I haven't seen done so far (again, this is a remake, so I guess any compliments belong there and not here). The acting is good enough for the overall level of the film. I personally dislike the amounts of blood and gore (zombies tearing out bits of flesh don't impress me, simply looks like an unrewarding and unnecessary way to spend a budget, sorry) but I suppose a Zombie flick trying to be classic needs some of that.\n\nAll in all? I had fun. I was entertained. I wasn't swept off my feet or had my mind blown, I simply enjoyed the dynamics between the characters and the overall post-apocalyptic battle scenario. I'm sure you could find better Zombie flicks, as well as worse. Nothing much left to say, as for better or worse the film doesn't leave a lasting impression. Watching it won't be as painful as others here say, so watch a trailer and decide for yourselves."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "texasstreetsoldier",
        "review_rating": "1",
        "review_title": "Literally the worst movie I have watched in years",
        "review_detailed_main": "First off I hardly ever write a negative review. Even out of all the bad ones THIS ONE TAKES THE WORST CAKE. It was so incredibly bad I watched half, hated it, but thought it can only get better. Then I fast forwarded to more and became even more disappointed. Nobody should be mildly proud of this. It's like a 12 year old made a movie and everyone just did it because the kid was dying."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jckercher",
        "review_rating": "1",
        "review_title": "Beyond stupid",
        "review_detailed_main": "Very predictable. A constant string of \"what were you thinking\". Waste of time."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "avikbara",
        "review_rating": "2",
        "review_title": "Compared to this Day of the dead (2008) was gold.",
        "review_detailed_main": "I cannot believe that this would cost 8 m USD.\n\nHere is a list for you to read: 1. there are dubbed scenes in the movie for some reason, 2. the voice over for narrated parts is half a$$ed, 3. there are some decent actors and i think that is where the 8m went because it definitely did not go into writing a good script or screen play, 4. seems like they had a concept in mind but weren't able to make it real, 5. couldn't wait for the movie to end it was somewhat unbearable, 6. i have literally forgotten almost everything that happened in the movie that is why i did not mention any scenes.\n\nIf you are a zombie fan feel free to watch this movie but do not expect it to be any good. I do not blame you for watching this as there is a severe shortage of zombie movies atm."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "vicenternse",
        "review_rating": "1",
        "review_title": "0/10 - Why?",
        "review_detailed_main": "No reason to be done. This is a 0/10 but as it is an invalid rating, I'll say that \"1\" stands for the great tip this movie brings up: This is exactly HOW YOU SHOULD NOT do a movie. Terrible."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "xabeille",
        "review_rating": "1",
        "review_title": "This movie is wasting your time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "celene008",
        "review_rating": "1",
        "review_title": "At some point someone should have pulled the plug...",
        "review_detailed_main": "I am being super generous with this rating. It really should be negative numbers (only reason i give it such a high rating was Max the Zombie was decent and Sophie looked good in running shorts)... Netflix should refund me for putting me through this. Although its a lot me watchable than Twilight.\n\nThere is literally nothing redeeming about this movie..."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "rejnert-19-289736",
        "review_rating": "4",
        "review_title": "Movie with potential",
        "review_detailed_main": "Sooo...this movie was below average with quite a few of the actors doing a poor job. Zoe kept the movie from drowning completely and Miguel Salazar, well his acting was so terrible i considered if i should stop watching it. It was like he was reading from the script as they were recording. A shame really because the movie did have potential as far as zombie movies go."
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "nguyenphanduy",
        "review_rating": "4",
        "review_title": "A few words about the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "kmac238",
        "review_rating": "3",
        "review_title": "Could've been decent but...",
        "review_detailed_main": "Literally the worst acting and scripting I've ever seen!"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "jessread-83843",
        "review_rating": "1",
        "review_title": "Absolutely shocking",
        "review_detailed_main": "So I don't know if this is meant to be a remake or what but if this is then was a shocking film, If it is supposed to be a remake of the George A Romero's classic of the 1985 day of the dead is not even scratched doing justice, the classic is untouchable, George would be turning in his grave for this film!\n\nThis is such a badly written and cheesy film I think the 3.4 it's been given is way too high, max who is meant to be a representation of Bob from the classic groans and had a lion roar in place of it and the grin he does is horrendous, it's actually embarrassing how bad it is, it's more like a a really bad comedy film than anything, I wasted 90 minutes of my life watching this,"
    },
    {
        "movie_id": "tt3053228",
        "movie_name": "Day of the Dead: Bloodline",
        "movie_rating": "3.5",
        "review_username": "eddietude-1",
        "review_rating": "1",
        "review_title": "OMFG Are you kidding me?",
        "review_detailed_main": "WOW. This was absolutely awful. Could the actors in this film been any more wooden? Who cast this POS. The overall story itself wasn't bad, but the writing was just horrendous. I'm sure that didn't help the actors either. And every kid in here was clearly someone's relative and not an actor.\n\nHey producers, just because \"little jimmy\" is your kid, doesn't mean they can actually act. Hire ACTORS even for the small roles.\n\nWhat a complete waste of time, money, and an effort"
    }
]