[
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "chris-encinas",
        "review_rating": "5",
        "review_title": "What were you expecting? Much better than most reviews say",
        "review_detailed_main": "I don't understand why so many are giving this film 1 or 2 stars. What in the hell were you expecting? I think reviewers are being too hard on this one. This is a low-budget schlock sci-fi horror B-film. If you enjoy B-film horror and creature features you will enjoy this. Is it good? No, but it's fun."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "eurom44",
        "review_rating": "5",
        "review_title": "Negative criticism overdrawn",
        "review_detailed_main": "I thought I'd switch off after 30 minutes because of the reviews here. Also because of star rating 3.5. But the movie is better than expected."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "s3276169",
        "review_rating": "4",
        "review_title": "Basic with a B.......",
        "review_detailed_main": "Doom Annihilation is a \"basic with a B grade\" horror sci fi.\n\nLow budget, basic effects and lean on the story front. In other words this is a no frills flick that has limited appeal. It might be alright for a very slow rainy day but personally, I can think of a long list of things that would come well ahead of watching this again.\n\nThe acting is ok but again nothing and no one really stands out. 4/10."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jamiedee-45573",
        "review_rating": "1",
        "review_title": "By far worse then the rock doom.",
        "review_detailed_main": "Makes the rock doom look like a masterpiece.\n\nAll copies of this film need collected up and buried at sea in a locked vault..\n\nThat's all I need to say. 👍"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Darkfyre_rn",
        "review_rating": "2",
        "review_title": "Diarrhea Masterpiece",
        "review_detailed_main": "Good: Lots of attention to the set designs, very Doomy, even though it didn't always look great. Some practical FX were decent. Some external CGI shots of the base and ship were pretty ok. Um... There were two, maybe three, capable actors that did a 'decent' job.\n\nBad: Literally everything else. This a groan-inducing train wreck of a movie that spits in the face of any Doom fan. The easter eggs were terrible. The lead actress was abysmal. The script and story were Sharknado worthy.\n\nAvoid unless you're looking for a laughable film to heckle with friends"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "TwistedContent",
        "review_rating": "2",
        "review_title": "Cheap, Flat, Ridden With Clichés & Disrespectful of the Source Material",
        "review_detailed_main": "I think we all knew this was going to proper bad - low budget, cheap actors, mediocre director & no involvement from the authors of the original concept and all the games. Bad it was.\n\nThe very start states quickly what kind of thing will follow, the first shot is full of grade b cgi and even the opening titles were zero-budget style. We get introduced to a bunch of painfully clicheic characters (carried out by stiff acting) and plotline, surrounded by plasticky looking props and sets, effortless cinematography, boring color grading and so on and so forth. The special FX is mix of cheap cgi and practical fx that don't impress much. References to the contents of the games are there, a few, but to no satisfaction. So it continues for 90 minutes, from time to time entertaining us with emotionless and uninspiring action sequences. Oh, and the original score can be described the same way. There is some amount of much needed gore, but not creative enough or just simply not enough of it to compensate for anything. As the movie passes by, You find yourself predicting events and not caring for any of the characters - most you're going to feel is cringe or anger, if you're a \"Doom\" game franchise fan. You're also going to be very bored.\n\nI loved \"Doom 3\", have played it through for three times & if there's anything good \"Doom: Annihilation\" did is inspiring me to play one of the games again. I'm recommending a hard pass on this absolutely lame and disappointing game adaptation. My rating: 2/10."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Terminator5454",
        "review_rating": "1",
        "review_title": "Another awful video game movie to add to the evergrowing heap.",
        "review_detailed_main": "When I first heard that another DOOM movie was being worked on I was baffled; I assumed that after the terrible reception that the first film received, we would never see another attempt at making a DOOM movie (something that I was perfectly fine with, mind you). However, I was willing to give it the benefit of the doubt; perhaps this time they would try to remain faithful to the source material and present us with a gloriously over the top action film reminiscent of the fantastic CGI trailer for DOOM (2016). After learning that it was going to be a direct to dvd film with a low budget, all my good will for the film dried up. The dreadful trailer and the absence of DOOMGUY failed to win back any enthusiasm.\n\nThe premise involves a group of UAC marines being dispatched to a station on the planet Phobos for security duty. On this station, a group of scientists, engineers, and researchers are experimenting with teleportation and, of course, everything goes horribly wrong. After having one of their scientists test out the teleporter and returning deformed, Dr. Betruger, the one overseeing the operation, decides that it would be a brilliant idea to send himself in next. This causes the station to experience a power surge and demons begin to invade. The marines arrive and must now attempt to bring the station back online and figure out what exactly happened here.\n\nThis sets up a rather dull film. A good portion of it is spent with the marines moving through brightly lit corridors halfheartedly pointing their guns at every corner and exchanging dreadful dialogue. None of the marines are interesting or memorable; they're all just a bunch of walking military cliches that we've seen countless times in other sci-fi horror films.\n\nThe dialogue consists mainly of cheesy action movie phrases and painfully awkward references to the games (example: a character refers to himself as an \"ultra nightmare\", which is a difficulty setting in the game series). For people that are unfamiliar with the source material, these constant references will have them scratching their heads and wondering why the dialogue is so unnatural. Fans of the games will find themselves rolling their eyes at these forced references.\n\nThe acting is stiff and lifeless, with the only exceptions being Dominic Mafham, who plays Dr Betruger, and Clayton Adams, who plays a marine named Winslow. Everyone else looks bored.\n\nI honestly couldn't tell what tone this movie was trying to go for. It fails to evoke any feelings of dread or horror because the entire station is lit up like a Christmas tree, and there isn't any proper ambiance. If it was trying to be a horror film, why not make it like DOOM 3? A game that features a dark and rich atmosphere filled with gory visuals and accompanied by some truly fantastic sound design that succeeds in immersing you into its world. Whatever. After meandering around for a about an hour, the film shifts gears and turns into a lame action movie.\n\nThe choreography for the action scenes is clumsy and disjointed, and I found myself dozing off during most of them. The outfits for the marines are unconvincing and cheap; they look like they are wearing airsoft gear. The CGI for the demons looks like something out of an amateur YouTube video.\n\nIf you're as big of a fan of the DOOM series as I am, do yourself a favor and skip this movie. You won't lose sleep over missing out on this. If you're not familiar with the series, this film will be a waste of time for you."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mastertech19",
        "review_rating": "1",
        "review_title": "Ending sucked",
        "review_detailed_main": "I played doom with my cousin in 1995. The movie borrows from the game, a title and a few loose details. The female lieutenant is clueless and not believable. The last 10 minutes are absolutely horrible. The writer director should try another career."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ptjvandijk",
        "review_rating": "1",
        "review_title": "Doomed",
        "review_detailed_main": "Take everything you love about the Doom franchise and forget it. This movie lacks the basic things that make Doom great. The directing was weak, acting was horrible, vfx sub-par and no Doom guy.\n\nThis movie makes me think it was a cheap way to hold on to the movie rights. Just avoid this and save yourself some time"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "rarepeperonis",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "No enemies that comes up from the DOOM game No Doom Guy Bad sets and CGI Ridiculous story stolen straight from other movies This movie left me speechless what a garbage movie"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "christopherwells-72001",
        "review_rating": "10",
        "review_title": "Don't listen to the woman hating critics",
        "review_detailed_main": "This movie is so good! So much better than the 2005 version it isn't funny. It doesn't matter that the lead character is a woman, her acting is great and the movie has a compelling story. They even include an Easter egg to show that BJ Blaskowitz, the main character from the game was there first and was killed. Great effects, great acting, story and tons of homages too the game and those that made it and play it! It's on Netflix now, watch it!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Elwood_Blues",
        "review_rating": "6",
        "review_title": "OK movie",
        "review_detailed_main": "Having just seen this, I can't agree with the majority of negative votes. Granted, it is a low-budget movie with no star power and a we-have-seen-this-1000-times-before script. But with the limited resources they had, it is an enjoyable sci-fi action flick. IMHO the actors played their parts convincingly and the action was okay. The only really bad thing about this were the CGI shots of the portals... that looked like from a 90s computer game. If you have some time to spare, give this a shot. There are far worse movies out there."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thegemte",
        "review_rating": "1",
        "review_title": "Cheaply Produced & Unoriginal, Shouldn't been made.",
        "review_detailed_main": "So think Aliens, planet a colony to save, then think Resident Evil first film, the labs, etc. Except done on a small budget.... At one point we were saying the enemy looked like power ranger villains from the 90's. Now you can go they had a budget...blown on rubbish CGI scenery effects in the last 20 minutes. Abomination, through and through. Not that I expected any better, it's a game turned movie. But there are much better things to watch than this."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ybbobb",
        "review_rating": "1",
        "review_title": "what ?!?!",
        "review_detailed_main": "Seriously worst film i have watched all year please save yourself the trouble by not wasting money on this movie and if you can watch it for free just stab your eyes with a fork you will feel much better than wasting your time with the horrible story line and even worse acting"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tomkpersonalmail-00623",
        "review_rating": "2",
        "review_title": "I was so happy when this ended",
        "review_detailed_main": "Just plain awful. Then they seemed to have run out of film suddenly and the movie ended. Lots of zombies, gratuitous violence for 65% of the movie. The movies plot was stupid. Many of the actors couldn't see death coming even though hundreds of their friends had already died the same way! Just a chore to watch. Could do so much better."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "michalsmetana",
        "review_rating": "1",
        "review_title": "It is anything but DOOM",
        "review_detailed_main": "Ok honestly the 2005 Doom with Dwayne Johnson and Karl Urban was average for me at best, with the FPS scene being the only thing saving it. But this? Nothing. NOTHING! Nothing can save this mess of a movie. It is horrible from first second to the last credit. And that is said mildly said. So no. Run from it, avoid it, get away! Just don't watch it!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "chfs-30853",
        "review_rating": "1",
        "review_title": "Sy....Fy.... Channel",
        "review_detailed_main": "Wow! This really does make the previous film starring Dwayne Johnson look like a masterpiece. The CGI is bad in fact it's just bad. I stumbled across this and didn't know it was going to be released straight to video. Shouldn't have even been given that much. If you give it your time lower your expectations and then you'll still be disappointed."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ra-223-320116",
        "review_rating": "1",
        "review_title": "Bad!",
        "review_detailed_main": "First off: This movie has nothing to do with DOOM. The movie makers, have loosely borrowed a few elements from the game, that's all. It has no relation to the movie from 2005 either.\n\nThe acting is terrible, the props are awful and the FX must have been done in windows paint."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mattbtownsend",
        "review_rating": "1",
        "review_title": "Not a Doom movie",
        "review_detailed_main": "The director tried so hard to fill the first 20 mins with as many Easter eggs and nods to the game as possible to try to fool us that this was a Doom movie. Unfortunately he forgot about the actual story and demons. Very bad acting, very bad story and not worth watching even if you're a die hard Doom fan."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ottoschlosser",
        "review_rating": "1",
        "review_title": "Never write reviews, first IMDB review",
        "review_detailed_main": "One of the most boring films I've ever witnessed. Unbelievable."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Lugodoc",
        "review_rating": "10",
        "review_title": "There's A Chainsaw",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Syboat",
        "review_rating": "7",
        "review_title": "Pleasantly surprised",
        "review_detailed_main": "I know we would want to see millions spent on a Doom movie but you know, hats off to the guy that made this, he had passion and a limited budget. If you go into this expecting the earth you will be disappointed, but I was pleasantly surprised. It had a lot more than the original Doom movie I mean this had references to the game and the hell sequence was pretty impressive. So don't listen to the haters but enjoy it for what it is but don't expect big budget Doom mayhem."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "darthvaderthanos",
        "review_rating": "1",
        "review_title": "Why did this happen?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "athychristopher",
        "review_rating": "4",
        "review_title": "Generic Sci-fi Horror",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "nightringer-76840",
        "review_rating": "1",
        "review_title": "What a Waste on the Brand",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "steveo7777",
        "review_rating": "1",
        "review_title": "ITS DOOMED",
        "review_detailed_main": "Absolute trash.bad writing bad acting, apart from main scientist. Give this garbage a miss or waste your time. Its your choice."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "DuskShadow",
        "review_rating": "5",
        "review_title": "Actually better than the Movie at some parts",
        "review_detailed_main": "I have been a long time fan of Doom since it was a free share game on the net back in the early 1990s, and the ironic thing is, this contrasted at some points heavily compared to the movie, but in a good way. Whereas the film had more CGI that was high quality, better known actors and something of a script that resembled a film, it still was not as good as it could have been, actually deviating from the story of the game. HOWEVER, this newest take on the franchise actually stayed much truer to the very games themselves, allowing people to see the maze like corridors and sub sections that the players would normally have gone through in the classic installments of the Doom franchise. Though not the best idea to have a very slender young woman as the main character, she was still enjoyable to watch for the most part, and the movie progressed in a really cool way by the end that was much more satisfying than the film was. That being said, the film wasa teensy bit more badarse with all its flare. Nonetheless, I like Doom annihilation. 5.5/10"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "wfraziii",
        "review_rating": "1",
        "review_title": "Would rather watch the video of my birth...",
        "review_detailed_main": "Terrible acting and FX look like they were done on an IPhone 4."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ahao76",
        "review_rating": "2",
        "review_title": "This Doom is not related to the Doom in 2005. Phew.. I'm glad for that..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "patrick_panda",
        "review_rating": "1",
        "review_title": "\"Do you know what this is?...ALIENS!\"",
        "review_detailed_main": "The title of this review is as stated by one of the many forgettable characters, this is a poor man's Aliens. It is teetering dangerously towards breaking copyright."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "SeniorInvissible",
        "review_rating": "9",
        "review_title": "not bad",
        "review_detailed_main": "Ignore all the bad reviews. this movie is pretty good"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tj-118",
        "review_rating": "6",
        "review_title": "Actually an alright movie - if you know the games",
        "review_detailed_main": "I was expecting the worst but was actually positivly suprised. I think the relativly unknown actors played fair and I think the scenarios were pretty close to the latest Doom-games. I enjoyed recognizing a lot of stuff from the games (weapons, monsters, keycards and the hole base design), but true: If I didn't love the game and felt nostalgic while watching it, I would probably find this movie rather lame. It was good intertainment."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ivko",
        "review_rating": "1",
        "review_title": "more video game than video games",
        "review_detailed_main": "This movie achieves something interesting: it feels more like a silly game than the actual game does. What I mean is, although it certainly isn't always true anymore, older video games had a reputation for focusing more on the gameplay aspects like puzzles and combat than on things like a cohesive plot and character building. Movies, even movies based on video games, focused more on the story because story and visuals were their primary tools for entertaining people. So the cliche that developed was that games were where you fell in love with a game world, but movies were the vehicle that made the inhabitants and their lives \"real\".\n\nOver the years the gaming industry has made huge strides towards creating engaging and beautiful stories that integrate with gameplay, like Naughty Dog's 'The Last Of Us'. The movie industry, on the other hand, possibly because they more easily minimize language and cultural barriers, has increasingly found that movies with basic, uncomplicated plots can appeal to vast audiences in places like China. They have followed that trend by making films that are almost exclusively about the visuals, with almost non-existent plot and character development.\n\nThis movie is like seeing that original cliche come full circle. The plot of the latest Doom game, while admittedly pretty straight forward, it is an FPS after all, is at least as sophisticated as the plot of this movie, if not more so. And because this was a low budget film, the visuals are really awful, while with the settings maxed the Doom game looks pretty good. So here we are, with a movie that looks more like the cliche of a game than the game itself!\n\nNeedless to say, this movie is pure garbage; I would avoid it. If you want to watch a \"Doom\" movie, I'd suggest heading to YouTube instead and watching someone's 'movie' run (these typically just include the cut scenes and major events and clip out most of the combat, etc.) of the latest version of the game."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kamorris-36272",
        "review_rating": "1",
        "review_title": "This is almost a competitor to Dragonball Evolution",
        "review_detailed_main": "Another review states that this movie spits in the face of Doom fans and I agree. The sets are cheap, the acting is bad, the effects are just pathetic, and nothing is true to the source material. References are just cheaply tossed in, like dead bodies having names of ID staff/characters, some jackass saying \"I'm your ultra-nightmare\", a plasma rifle just called the BFG that shoots green projectiles which don't chunkify anything. It was a waste of time, and if I had paid money to watch this I would have demanded a refund and lit my money on fire right there because it would have been more entertaining.\n\nIt's not even good for a laugh. It's not Dragonball Evolution levels of bad, but damn if they didn't try hard to compete with it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Starhero999",
        "review_rating": "2",
        "review_title": "DOOMed from the start",
        "review_detailed_main": "Aside from the chainsaw scene and Betruger the rest of this movie was absolutely horrendous (the two positives I said deserve at least an 8/10 but everything else deserves nothing higher than a 2/10)"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Perra117",
        "review_rating": "5",
        "review_title": "Not so bad like people write here.",
        "review_detailed_main": "This movie have something to do with the Doom games.\n\nThe Action scenes is good and they use the keycards like from the games.\n\nMonsters/Demons shoot Flameballs/Fireballs in this movie, was not in the frist movie I think , that is very nice to see.\n\nThe Chainsaw is in Action !\n\nThe last 10 minutes is very good work when many Demons/Monsters shows.\n\nWhat they could do better yes a lot of things and more various of Demons/Monsters.\n\nLow price movie but have you not enough money to make one better and do what you can for what you have I accept this work."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "cruise01",
        "review_rating": "2",
        "review_title": "Horrible video game adaptation.",
        "review_detailed_main": "Doom: Annihilation (1 out of 5 stars).\n\nDoom: Annihilation is a terrible video game adaptation of the series which does not do anything to improve from 2005 Doom movie. This film really makes other video game adaptations movies like 2005 Doom feel like a masterpiece or even the Resident Evil movie series is well done. Doom Annihilation is a poor adaptation of the game. The script and direction is laughable bad and cheesy. The dialogue is horrible. The story is generic of the premise with nothing more to it. Besides scientists at UAC opened up a portal releasing the monster looking things from the game that throws fireballs at the people and infecting nearby scientists into zombie like things.\n\nThe plot is generic. Besides a rescue squad of soldiers going into the laboratory to discover that incident and trying to contain. The ending is even worse if it is trying to end for a sequel but it is cheesy.\n\nThe script is terrible with bad dialogue. The soldiers seemed more amateurs as a team than being professional. The direction is horrible with dull action sequences. And characters making stupid decisions. I really did miss the first person shooting sequence in 2005 Doom movie which was well done.\n\nThe acting is horrible with a cast of unknown actors. The visual effects are low budget terrible. The games animation seemed more realistic.\n\nOverall, Doom: Annihilation is one of the worst films ever. The action, direction, acting, and plot is just one of those bad adaptations of the game."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "hupp_ethan",
        "review_rating": "1",
        "review_title": "Awful movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "marulez",
        "review_rating": "1",
        "review_title": "Yet another Doom movie failure",
        "review_detailed_main": "Not only it was a too much focused on feminism but the story itself didn't respect the original story of Doom 3 or Doom 2016 or any other doom game for that matter. Did the producers think that they are better than the writers of the story to change it?? Arrogance... They learned no lesson from the first Doom 2005 movie. That movie changed the demons with people infected with some viruses. Now this Doom changed the epic DOOM GUY with a Doom woman and on top of that, not once does anyone in the entire movie refer to the demons as demons or to the portals as Hell. On the contrary, they are portrayed as some sort of aliens from another planet. Wow just wow.... had they respected the original story, despite the low budget, it could have been a better film with a higher rating and thus higher profits."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "davedukart",
        "review_rating": "1",
        "review_title": "Movie makers never learn",
        "review_detailed_main": "Why make a movie based off a source (any, be it abook, comic book, video game, etc.) and then make it absolutely nothing like the source? Did the horrible rating and reviews of that last abortion named DOOM not teach you anything? So, why did the same formula get used again?!?\n\nDid the dork who made this second piece of garbage EVER even look at online pictures of DOOM? I'm guessing \"no\", because, beyond the name, there was nothing DOOM related in the movie.\n\nPay attention, idiot film makers. DOOM is about Mars being a gateway to hell. It is NOT another stupid zombie virus movie of which there is already wayyyyyy too many. Demons NOT zombies. No stupid virus, no blue skinned neck biters.\n\nIf you want to add yet another overused zombie movie to the mountains of crappy existing zombie movies, just make a stinking zombie movie and don't fill DOOM fans with hope, only to piss them off. Because, duh, the majority of people that will watch a DOOM movie is fans of the game.\n\nThis movie SUCKED. I hated it even more than that last one, which I really hated."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jacobmilczewski",
        "review_rating": "10",
        "review_title": "Great B movie! More in line with what Doom really is and a plus up from that disaster film with the Rock",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jeffreyc-32567",
        "review_rating": "7",
        "review_title": "Doom retaliation my take.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thajesri",
        "review_rating": "1",
        "review_title": "I thought the Rock's Doom was bad",
        "review_detailed_main": "It's too bad I won't even bother writing much about it... It's like it was directed by a 5 yo kid"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "joseph-boik",
        "review_rating": "3",
        "review_title": "Yikes!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jackub-97563",
        "review_rating": "1",
        "review_title": "This is what you get when you change a story to make the PC crown happy.",
        "review_detailed_main": "Worst possible outcome when you try to change a movie to make the outrage cultural people happy. Stop changing stories and make your own. Bad acting, obviously low budget. It does not deserve to be titled Doom."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "viklis",
        "review_rating": "1",
        "review_title": "Absolute garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "JagdtigerIV",
        "review_rating": "1",
        "review_title": "Not much related to the game it's based on.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "shaynkevin122",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I wanted this to be so good. I'm a fan of the games and the previous movie. So I gave this a shot. It was boring and stupid. Only good thing about it was the special effects, other than that don't waste your time."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "svensonfam",
        "review_rating": "1",
        "review_title": "Laughable",
        "review_detailed_main": "Simply awful. All the characters are stereotyped. All the lines are forced and stereotyped. It is very, very difficult to make a movie this bad, but the producers have succeed with simply a pathetic, brain dead, laughable film."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Reladamjod",
        "review_rating": "5",
        "review_title": "Fun fan tribute movie",
        "review_detailed_main": "Set your expectations correctly; this is a fun popcorn movie for the fans of doom with excellent attention to detail (weapons, backgrounds and beasties) that brings back memories of playing the game! That's all it is folks, it's not up for any awards."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "levishreads",
        "review_rating": "8",
        "review_title": "You haters are all stupid",
        "review_detailed_main": "Ok let's start this off simple... in DOOM 1993 the main game takes place on Phobos, which is where this Movie taken place. Second, you don't need Doomguy for there to be a DOOM movie, Doomguy is important but he's made several other appearances of other games. Third, the 2005 version of DOOM with the Rock didn't even have any demons to begin with, this movie does... can you at least appreciate that fact?"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "basilios-48001",
        "review_rating": "7",
        "review_title": "Nice Surprise!",
        "review_detailed_main": "I watched this because I was bored and didn't expect to make it through the end. I was expecting to see utter garbage. What I saw was a movie that was highly entertaining with decent acting. I actually enjoyed this one more than The Rock's Doom movie. The effects weren't the best, but nowhere near as bad as I expected. If you enjoy SciFi movies, then this one is worth a watch."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "lukem-52760",
        "review_rating": "5",
        "review_title": "AWESOME SCI-FI HORROR, LOTS OF FUN & VERY ENTERTAINING",
        "review_detailed_main": "This new version of \"Doom\" was a really nice surprise!!! It was made on a low budget but looks fantastic, it's good entertainment.\n\nI got good sci-fi movie vibes with this Doom: Annihilation, i saw hints of \"Aliens\" & \"Ghosts Of Mars\" & \"Resident Evil\" all Excellent films & \"Doom\" fits in nicely with this Awesome bunch!!!\n\nFirst off i have to say again how good this film looks for a lower budget straight to dvd B-movie flick, the production design is excellent!!! The music is very cool & the acting is mostly really good & the practical monster fx are Amazing, it's so nice to see rubber suit creatures on screen again, reminded me of old school 80's & 90's style & the Demon creatures are really cool looking!!! I know this is based on the old 90's computer game but i don't really know that, so i only go by this as a movie & as a sci-fi Horror Thriller it's great fun. The main positive thing about this film is it's Entertaining!!!\n\nOur tough Hero/Lead is \"Joan Dark\" played by Amy Manson who gives a moody & no-nonsense tough performance that's totally believable, she's Cool character & another standout Cool Character is the marine Captain \"Savage\" played by British actor James Weber Brown, he's a tough Shotgun wielding action hero while he's on screen!!! The rest of the cast of Marines & scientists are all pretty decent & solid on screen with lots of mixed accents that make the ensemble cast interesting.\n\nThis is a nice simple story about a group of scientists who discover an Alien teleportation device & open up the gateway that then unleashed Demonic creatures & a team of space Marines are sent to the strange moon type planet to check out what's happened, that's basically the plot but there's other bits & bobs going on but the main focus is seeing Cool marines fighting possessed scientists & Demon creatures that have taken over the space station base.\n\nThere's lots of Awesome action scenes & lots of old school gory blood splattered gore, like demonic people getting cut up with a chainsaw!!! & lots of Demons getting shot to bits & Marines getting ripped to pieces & throats ripped open, it's an Awesome old school blood bath!!! Of course there's alot of C.g.i stuff as the film goes on but it looks excellent for a limited budget film like this!!! There's a nice mix of practical rubber fx & the usual flashy c.g.i stuff but it all gels well together to look fantastic on screen. The moonbase station looks really good & the spaceships look Awesome, everything seems to be lovingly crafted to look the best it possibly can for the cost of what they had to create it all. Doom is a very enjoyable sci-fi Horror that's actually alot better than some of the huge budget blockbuster movies that hit the cinema!!! Also \"Doom\" has a nice pacing & an eerie isolated atmosphere. The marines look Cool as hell & the Demons are scary & ferocious beasts & some shoot fire balls!!!\n\nDoom: Annihilation is a fun & exciting action packed sci-fi Horror movie, it's also great late night entertainment."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jojor-28812",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dimebagcarroll",
        "review_rating": "4",
        "review_title": "I have seen worse.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thedarkestshadow-32785",
        "review_rating": "5",
        "review_title": "Not terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "urbdg",
        "review_rating": "1",
        "review_title": "Annihilation of the Doom franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "armesisp",
        "review_rating": "1",
        "review_title": "Belongs in the bin",
        "review_detailed_main": "Brainless and unlikable characters everywhere, stupid plot and cheap acting. This garbage should never have been made."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thadgordon36",
        "review_rating": "1",
        "review_title": "Really?",
        "review_detailed_main": "Can I give a movie less than one star? I love movies that are so bad that they're good, but this movie is just bad."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jmandova",
        "review_rating": "1",
        "review_title": "It truly is Hell On Earth",
        "review_detailed_main": "They got one thing right, they somehow managed to make you believe that you've been sent straight to hell for 105 torturing minutes and that this movie will never end, Watching this is truly Hell on Earth. Do not pay to see this, in fact, do not see this for free. You would be better of watching old movies of your mom's past career than to watch this pathetic excuse for a doom movie."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "glenmd",
        "review_rating": "10",
        "review_title": "Don't believe the bias and ignorant negative reviews!!",
        "review_detailed_main": "The first thing everyone needs to know is this movie is made on low budget! The 2nd thing you need to know is even low budget it is 50x better the the 2005 movie starring the rock! Dont believe the bias pathetic negative user reviews because its obvious that all those reviewers dont give credit to low budget productions because they judge movies on high budget cgi and special effects not story! And the 1st rule of a great movie high or low budget is story because story is always king! And this movies story is perfect, it follows the game lore completely and 100% accurately! And any reviewer that states this is another failed attempt at a game adaption doesnt know what there talking about because this is the best game adaption that ive seen that hasnt altered the story from the game just to produce some hollywood money farming polished crap! Anyone that dislikes this movie obviously isnt a fan of the games and has never completed any of the doom game franchise! If this movie had the budget and special effects of the 2005 release it would easily score a 20/10! The problem with the internet is everyone has a voice and thinks their opinions are worth something and everyone thinks their a brilliant critic which couldnt be further from the truth and completely reckless and damaging to film franchises career's and also ruins it for the people who truly enjoyed the film and want to see the next release! And as for the review about the ending being like it ran out of film is absolutely moronic because thats exactly how the games ended! Do yourself a favour ignore the negative reviews and watch this movie for what it is and no matter what your opinion is after keep it to yourself unless possitive! Recommended to every true doom fan and honestly are the only people that should and have the right to write a review of this movie is a true doom fan because thats the audience it is made for!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mosnorrebo",
        "review_rating": "7",
        "review_title": "Great movie",
        "review_detailed_main": "I will first say that I would rather have seen doom guy and not doom girl. The movie industry seems to like their feminism. But luckily it didn't destroy the experience even if it was a disappointment.\n\nWith that said so is it still a great and entertaining movie. But it would have settled better if they not have switched the out doom guy for a girl. It should have been longer as well.\n\nHow disappointed I even am for the casting choice so can't I help that I really enjoyed this movie and would like to see a sequel.\n\nAs a last word.\n\nPlease Hollywood. Don't change sex of the characters just because you can. I don't think you would do a movie about Martin Luther King Jr and cast a white woman for the roll so stop this BS. It only makes people angry, leave bad reviews and won't watch the movies."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Chikiw",
        "review_rating": "1",
        "review_title": "-_-",
        "review_detailed_main": "I wouldn't waste your time on this movie and you will understand why if you read the other reviews. Everyone else summed it up for me.\n\nIt is BAD"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tsunami-56539",
        "review_rating": "1",
        "review_title": "The Writing is Awful! =(",
        "review_detailed_main": "I wasn't expecting anything brilliant but the super lame writing and idiot characters ruin any chance of this movie being entertaining. You'd think that a squad of space marines would be slightly competent but basically every character is a moron with a thumb up their @ss and no clue what to do. It's just boiler plate dumb and dumber syfy horror with characters who get in their own way and by the end you're just hoping that they all die horribly. The one positive is that the production value and acting was pretty decent for this level of movie.\n\nOverall, two thumbs down and a middle finger for awftul writing! =("
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ICMooVees",
        "review_rating": "1",
        "review_title": "Doomed",
        "review_detailed_main": "Not much else to say other than what the other reviewers have posted in truth. This is a clinic on what a movie should not be. As a matter of fact, one would be hard pressed to find a more worthless movie than this drivel. No wonder Netflix scooped this up so quickly. Even worse than some of those 1950's sci-fi dumpster flicks.You have been warned..."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "yankeren",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "The first movie was a good sci fi action, this one is a disgrace even for a backyard B movie, don't bother"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "taranator-45851",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "almightyheretic",
        "review_rating": "1",
        "review_title": "Makes Doom (2005) Look Good",
        "review_detailed_main": "Terrible acting. Terrible effects. Terrible plot. They could have named this movie anything else and you still wouldn't associate this with the Doom game."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "BriHinoMan",
        "review_rating": "4",
        "review_title": "When you have time to kill",
        "review_detailed_main": "If you ever have an 1.5 hrs to kill this is your movie. The dialogue is shawty at best, the graphics are expected of a low budget film, and the whole film itself screams let's make a few more dollars off of Doom fans. The only and I mean only redeeming quality of this film is the choreographed fight sequences. There have been bigger budget films that have way worse fight scenes than this film. Makes me wonder if they hired a bunch of UFC fighters turned actors for this film."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "sonofgondolin",
        "review_rating": "1",
        "review_title": "DOOMED for blandness",
        "review_detailed_main": "The cast know nothing of acting as if they are military nor do they look it. Somehow fully trained soldiers are taken out by blueish zombies, which are not in the DOOM video game. No DOOM marine only compounds the terrible decisions that were made in this film. The UAC soldiers wear sad paintball looking outfits that do not resemble the gear in the games what so ever. The majority of the acting is as stated in other reviews poor and stale. I enjoy B movies and other movies so bad they are enjoyable but this is not really enjoyable. This was a meal that had no sweetness, savory, or really any flavor at all."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "grbadaddy",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "I like the action and storyline. I want to see more like the guns and monsters."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thisisbs911",
        "review_rating": "6",
        "review_title": "It's better then the last Doom",
        "review_detailed_main": "This one actually follows the game lore. The UAC is doing crazy experiments with portals on Phobos which go horribly wrong. Now a group of marines is going to land there end up in the mix. So we have a good start.\n\nThe characters are just okay. Doom is using all the cliches as predictable as they may be.(I loved the easter eggs like each security card was blue, yellow or red) Who's going to live who's going to die? Yeah that's pretty easy to figure out in the first 10 minutes if you've ever seen a movie like this. It still manages to have some intense scenes and good action sequences.\n\nIt's low budget but I was hoping for more creatures, that's one of the best parts of the game, but they only use zombies and imps. I will give major props to the imp costumes, they were real and in camera and looked great versus anything cgi. The BFG was used and at first it was ok, near the end I was like hell yeah that's a BFG.\n\nIf you're a Doom fan like I am and also like low budget sci fi horror, Then I think you'll have you'll have a good time. but when it's over you'll wonder, wait if they didn't land then there was no problem at all? The movie is a mess but good for doom fans."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "patrickkell",
        "review_rating": "1",
        "review_title": "They just NEVER learn",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "smarties2k",
        "review_rating": "1",
        "review_title": "A DOOMed movie...",
        "review_detailed_main": "Such a shame...it has so much potential... Doom was one of my favourite games...this movie really destroyed perfectly good memory of the great game.\n\nLousy acting. Bad storyline...should be renamed DOOMED!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "reaper-32290",
        "review_rating": "1",
        "review_title": "DOOMED FROM THE START",
        "review_detailed_main": "Im just gonna bullet point this: Pros- Set design isnt too bad Box art for the physical copy is okay Good paper weight Could probably scrape the ice off your car in the morning\n\nCons- Bad acting Costumes are aweful Plot was done better in the 2005 (granted there was no hell in the 2005 version and it was about human genetics) CGI was naff NO DOOM GUY Worse than the 2005 one (bearing in mind i really enjoyed Doom 2005)"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "boratsuckdev",
        "review_rating": "1",
        "review_title": "Atrocious",
        "review_detailed_main": "Why would ID software lend their title for this low budget, direct to DVD fest? Borrows heavily from ALIENS. Female protagonist was absolutely unnecessary. Wish they did better."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "108YearsOld",
        "review_rating": "1",
        "review_title": "Dumb Annihiilation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "UniqueParticle",
        "review_rating": "4",
        "review_title": "Painfully bad yet mediocre in some aspects",
        "review_detailed_main": "The acting and cinematography are atrocious! I started Doom: Annihilation several weeks ago and got bored so here I am watching the rest because I'm a huge movie buff and figure I give it a chance. It's filmed so poorly like a 2 AM late night movie lol. So much of the dialogue is ridiculous although the last half is pretty enjoyable!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "theohammjr",
        "review_rating": "1",
        "review_title": "So disappointed",
        "review_detailed_main": "Found this while looking threw Netflix and was super excited to see it. Clicked on it felt like the game for the first 15 minutes. Then they say hey let's put a small none intimidating women so the feminist can fill good about how they messed up another movie."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "stijnwerk-22655",
        "review_rating": "2",
        "review_title": "Skip",
        "review_detailed_main": "Stronk wahmen who need no man, and idiotic male characters. Just standard Hollywood woke garbage. I just saved you from wasting your time, you are welcome."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tkarlmann",
        "review_rating": "8",
        "review_title": "Enjoyable Doom!",
        "review_detailed_main": "Don't believe the low raters here; if they want to be snobbish, let them. You will enjoy this film! Good 'Doom' Action, well acted and well paced. Criticisms: For 'marines', their reaction time sucks! A Real Marine would shoot much faster, even when presented with a creepy life-form. I was overjoyed when they brought in the ole BFG-9000! If you don't know what B..F..G stands for, well, I've no help for you. (Hint: Big F... Gun) Back in the day, we all played Doom, using the Company's network to play against each other at lunchtime. Doom was ALWAYS great fun. Video games, like movies, come & go, but Doom set new standards for those of us who like shoot-em-ups. This film brought back fond memories for me. I like this version of film-Doom better, I think, than the last one with \"The Rock\". Try as I can to recall that version -- The Rock came off as just a bit corny for me. That does not happen in this film. Enjoy."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "wingzero203",
        "review_rating": "6",
        "review_title": "Honestly Not Bad and Pleasantly Surprised",
        "review_detailed_main": "Let's start with history to establish some perspective. If you can make a movie based on a video game with a $60 million dollar budget with an A-List actor (and former wrestler) and still have it be terrible, I doubt you can do worse with a low budget reboot. Because of that, don't expect gold as this flick has \"B-Movie\" written all over it. You see it with the no-name actors, the same redressed corridor sets for different scenes, cheesy dialogue indicative of the limited budget they were working with, and the CGI that was silly at best.\n\nIf you can get past that, you'll encounter a plot of space marines being routinely sent in for base security, only to discover a \"situation\" and investigate. They make no shortage of references to the Doom franchise which is nice but what I really enjoyed is the \"unexpected\". That is, you actually see these marines doing marine stuff (e.g. hand-to-hand fighting, etc.) and midway through the movie, you'll wonder why it appears the movie is about to end when it's just getting interesting.\n\nThey didn't shoehorn a strong female heroine in the name of feminism but instead had a nonchalant display similar to Sigourney Weaver in Aliens (1986) and Linda Hamilton in T2 (1991). The movie's look and feel isn't incessantly dark and terror-filled like the game and this movie takes place on the Martian moon Phobos instead of on Mars (like the game).\n\nI don't believe this flick was made to redeem the franchise from the cinematic disaster that was Doom (2005) but it's definitely an interesting re-imagined story. If you decide to pull the trigger, just turn your brain off and enjoy it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "muzili",
        "review_rating": "",
        "review_title": "This was way better than 2005 one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "pdx-92142",
        "review_rating": "2",
        "review_title": "Better wait for Doom Eternal",
        "review_detailed_main": "Let's acknowledge that this was nothing else but a cheap attempt at keeping the adaptation rights at Universal. Or at least, for me, that's the only way the existence of this... series of images and sounds is justified. This is clearly neither a work of love, nor a dimwitted attempt at having fun with the IP. This is a boring, soulless, pointless exercise in near-zero budget cinema.\n\nOk, granted, Doom is not the headiest game IP ever, but there is mysiticism, gory fun, body horror, straight-up hardcore knee-deep-in-bowels action and big stakes in the original game series. With such rich source material I am baffled how this lukewarm, middling, unoriginal and, above all, BORING adaptation ever came to be. Like, you have to consciously work on delivering such a bland screenplay.\n\nAll, and I literally mean, ALL dialog is recycled from far better movies. The leading lady's (Joan Dark -- is this meant to be a funny dig at Joan D'Arc? Seriously? Was this written by stoner college kids?) acting and delivery rivals an unpolished oak desk working for UPS. Is it possible to have negative chemistry with everyone? She certainly makes it possible.\n\nEveryone else is completely forgettable, apart from the big bad, whose... twist? is perfectly obvious from the minute he shows up after the shutdown. At least he puts in true, 100% all-natural ham when everyone else is clearly just baloney. He chews more scenery than the acid from the Alien.\n\nMusic, cinematography, VFX? Who cares. Soulless, but serviceable.\n\nIt's a bloody mess, literally and figuratively. And it clearly ends with the intention of a sequel. But why? Doom: Annihilation certainly succeeded in one aspect: it annihilated the IP for the movies."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "motved",
        "review_rating": "1",
        "review_title": "This is what the Left and Hollywood are doing. Less than 1 star.",
        "review_detailed_main": "I wouldn't recommend this movie to anyone, well maybe if I wanted to get them for something... but I'm not that person. Can't believe I wasted time trying to watch it. Go on read so more reviews before you waste your time."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "gabollanos",
        "review_rating": "3",
        "review_title": "Not a Doom movie",
        "review_detailed_main": "In my opinion it's regular, worth seeing one Sunday afternoon, but the first trailer left a very bad impression that generated a wave of disgust among fans and spectators in general.\n\nThe ideas that the director had for this film were diminished by the budget of this, which leaves me the following conclusion, to be a film with references to other FPS and with a different name to DOOM, it would have been ok, but carring DOOM In his name, it doesn't match."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kalixtshawxo",
        "review_rating": "1",
        "review_title": "Majorly disappointing",
        "review_detailed_main": "Worst representation of a \"military unit\" ever. Did they even have any kind of military advisor?\n\nIt's DOOM in name only. Very much a hodge podge of generic movie tropes haphazardly tossed together ."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Dethronizer",
        "review_rating": "1",
        "review_title": "Dr Betrüger. Really.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "pipo-",
        "review_rating": "1",
        "review_title": "And the worst movie award goes to ....... DOOM: Annihlation!",
        "review_detailed_main": "Seriously thanks for wasting my time and minutes of my life I will never get back.\n\nHopefully in the future these people can be held liable for scamming/wasting our time and trying to cash in on a previous successful franchise / game / movie title.\n\nThe movie is worthless avoid, go watch DOOM 2005 instead (or whatever), can't be any worse then this. (even the description is off, hell?, demons?, where was this?, I'm sure it wasn't this movie.\n\nThis is another example where Feminists are a bunch of untalented leeches sucking off the teet of previous successful titles, these people are utterly useless in the movie industry and only RUIN great potential titles (Ie DOOM, Predator, star wars..etc), They have absolutely 100% no talent and can't come up with their own story/movie/ideas all they know how to do is ruin the works of others....\n\nThis movie is such a disrespect to fans and non fans alike it should be recalled and removed and everyone refunded + compensated for having to endure this trash, I just hope people really listen to the 1 star reviews because it is that bad."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Calicodreamin",
        "review_rating": "4",
        "review_title": "Poor acting, good cinematography",
        "review_detailed_main": "The sets/costumes/CGI are actually pretty believable. The Phobos moon station was looked legitimate and provided a nice backdrop for the plot to unfold. However, the acting is subpar, most lines sounded like they were reading straight from a script. The main actress wasn't terrible, but as a whole it was cringeworthy. The actual storyline had purpose and flow, but there were a few tangents that could have been cut."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ejackmonroe",
        "review_rating": "",
        "review_title": "Doom Annihilated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "danielcereto",
        "review_rating": "2",
        "review_title": "Z movie",
        "review_detailed_main": "This movie makes first Doom a masterpiece. That's all. Simple, right? I only recommend to watch this if you're watching another movie at the same time. After five minutes you'll focus on the other one. Even Steven Seagal's movies have more budget and quality."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mehdihmzd",
        "review_rating": "8",
        "review_title": "This is not a video game",
        "review_detailed_main": "If you don't compare this movie with video game of DOOM, you will like it, you must watch this movie without previous thinking. Because this is not a video game, we can't expect everything. Watch as a movie. Have fun."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "LazyAnnihilator",
        "review_rating": "6",
        "review_title": "Who needs the Doom guy?",
        "review_detailed_main": "Before watching this I was looking forward to a movie so bad its good. I'm one of those people that view The Room as a master work of cinema and find Neil Breen's deconstruction of modern societal values in his Magnum opus Pass Through as a much needed mirror on the World.\n\nSo I was surprised to ended up genuinely enjoying Doom:Annihilation. Its low budget but they spend it in the right place's.\n\nThere was also zero politics despite what the on-line reactions were claiming. Honestly I thought the same when I heard there was going to be no Doom guy and the lead would be female. Plus the trailer really didn't help.\n\nNow Hollywood is agenda heavy of late and it is getting annoying but I didn't see it in this. If it's there they hid it well which isn't likely given the B movie script.\n\nThe lead was a bad-ass. A woman closer to Black Widow or the full metal b*#$h from \"Live, Die, Repeat\" not a miss man character at all.\n\nIf low budget sci-fi horror is your thing its worth the watch."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "zombie84-1",
        "review_rating": "2",
        "review_title": "garbage",
        "review_detailed_main": "Can somebody please give me back my 6$ please. this is a disgrace to the game and the first movie. At least the first movie held my interest this is like a cheap syfy rip off. Nothing happens at all. The gore is trash. the effects are from the 90s. The plot is the same as the rocks version but recycled. What a wasted."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jimknittel-64527",
        "review_rating": "1",
        "review_title": "I was DOOMED to watch the whole thing...",
        "review_detailed_main": "Only so I could write an honest review.... and that is... Pathetic. Horrible. Waste of time. Low budget. Horrible CGI. Mega chips on shoulders. That must be what makes their bullets 10,000 times stronger than other ones. Zero charisma from \"leaders\". Tossing around bad words does not make you tough or a leader. Almost laughable. 'nuf said."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "slickx",
        "review_rating": "1",
        "review_title": "Bad...",
        "review_detailed_main": "Was really looking forward to a new Doom movie. But this was not it..."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "cags-22839",
        "review_rating": "1",
        "review_title": "The single most uninspired film I've ever seen.",
        "review_detailed_main": "Here's a litany of words that perfectly describes this movie: cheap, schlocky, tedious, annoying, lazy, pedestrian, random, flaccid, turgid, chaotic, and just flat out stupid.\n\nThis is the most uninspired movie I've ever seen. The production design is bland and limited. The editing is stilted. The action scenes are jumbled and come out of nowhere. The special effects are straight out of 1995. The characters are grating. And everything that happens is ultimately pointless.\n\nWords of advice: ANY MOVIE with the subtitle Annihilation is ALWAYS AWFUL!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "peichlmartin",
        "review_rating": "1",
        "review_title": "What? How? Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "johngarrett-02297",
        "review_rating": "1",
        "review_title": "Typical trash",
        "review_detailed_main": "Total garbage. Its fun to watch if you enjoy laughing at horrible writing and high-school level production."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "barry_wile-711-574713",
        "review_rating": "1",
        "review_title": "Someone actually made this...",
        "review_detailed_main": "This Film has nothing to do with the game DOOM or the 2005 film, it has terrible acting, horrible special effects, unlikeable characters, bad dialogue, and an incomprehensible plot. It's clear that this dumpster fire was hastily slapped together at the last moment In an effort to maintain the IP."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "clownsrule-88642",
        "review_rating": "1",
        "review_title": "Why",
        "review_detailed_main": "If anyone from Netflix is reading this, can I get a free month for watching this movie? Also, please don't greenlight a Halo movie if this is what y'all are going to do to it. Master Chief doesn't deserve this. Neither did Doomguy really."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Moviedude90",
        "review_rating": "10",
        "review_title": "To rebalance the ratings...and bc...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "gustavo_palos",
        "review_rating": "6",
        "review_title": "Still better than the big budget one",
        "review_detailed_main": "Don't really understand all the criticism written here. What were you expecting from a low budget related to a 'in your face' shooting fps game? And to be honest you should look at it from all the limitations they were facing when bringing this up. For a low budget. they kept it simple without adding horrifying cgi, the scenarios looked pretty ok, acting nothing more nor less than expected, no need to add braless women, and certainly you see more of the game items in this movie than in Rock's one.\n\nKeep it up"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Lonestar55",
        "review_rating": "1",
        "review_title": "From the same director as Soccer Dog: The movie...",
        "review_detailed_main": "I had no clue that this movie could be this bad. It's just awful.\n\nI didn't expect perfection but this is as bad or worse than most SciFi channel productions. Terrible acting, terrible props, and the CGI looks like it was done in 1999. The whole movie is honestly a waste of money.\n\nWhy was there so much damn story? Literally all someone needs to do to make a good DOOM movie is start with a Space Marine in the prison on Mars, bad things happen, he gets out, and he fights his way to the end of the movie learning things along the way.\n\nNo redeeming qualities. This movie was beyond terrible, don't waste your time."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "indacoma",
        "review_rating": "1",
        "review_title": "Awful Movie",
        "review_detailed_main": "This movie looks like crap , all the actors are flat and boring and nothing happens for what feels like forever. Nothing like the game except in name alone"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mrfunk-86209",
        "review_rating": "1",
        "review_title": "Absolutely Horrible",
        "review_detailed_main": "To claim this is from the Video Game is blasphemy, cant believe anyone thought this was even a good idea and I couldn't even bare to waste my life watching the rest, didnt get half way through and already saw the downhill it was going"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "xkryon",
        "review_rating": "1",
        "review_title": "Really?",
        "review_detailed_main": "At first I thought it was a joke! Worst movie ever. What they are thinking!! Waste of money!!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Jayc1601-643-779107",
        "review_rating": "4",
        "review_title": "Not absolutely horrible.",
        "review_detailed_main": "As an outsider not knowing (or caring) about anything Doom related, I had no high hopes for this movie and did not know what to expect. I read the bad reviews and sought out any good reviews to see if there were any redeeming qualities to this movie. Ultimately I expected something not top quality, and I was hoping that if it's not that good, at least it might be unintentionally funny due to how bad it might be, like the movie \"Airplane vs Volcano\". That movie was so bad in every way that it was actually enjoyable to watch while talking about everything that's bad about it. But that is not the case for Doom. It was semi enjoyable, but then it started to get stupid, but not stupid enough to just laugh at it. Just stupid enough to get a little frustrated with it and want to write a review about it. So bottom line, if you don't expect too much, you won't be too disappointed. Good enough to watch if you have absolutely nothing else to watch.\n\nSPOILER ALERT IN 3,2,1... Stop reading if you don't want to know.\n\n(Okay, resume countdown, 3,2,1...) When the female marine stared to fight off hords of the creatures by herself, even in hand to hand combat and annihilating them so easily, while the much bigger, stronger fellow marines just died so easily when attacked by only one creature, that's when the movie started to go downhill for me. Also, she was out of ammunition and began fighting in hand to hand combat. Then when the fighting was over you can see that she had several clips on her person that she could have used but didn't. Things like that started adding up and becoming annoying, but unfortunately not ridiculous enough to begin enjoying it for how bad it was or as a spoof."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "movingtarget-96634",
        "review_rating": "1",
        "review_title": "What a mess",
        "review_detailed_main": "This is actually worse than Uwe Boll's interpretation."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "fnluna",
        "review_rating": "2",
        "review_title": "Doom the movie",
        "review_detailed_main": "Does nobody knows how to make a Doom movie? It's very simple, develop a story around a marine with a good background and emotional plot.\n\nAnyone remembers Phonebooth?? Hour and a half from Colin Farrell stuck in a Phonebooth."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "stvng",
        "review_rating": "2",
        "review_title": "Everything was a cliche",
        "review_detailed_main": "I'm really not sure whose idea it was to use literally every trope in the book but they really didn't hold back any punches. The film almost felt like a video game but not in the ways it should have. Most of the action scenes were laughable and seemed poorly thought out and executed with something predictable waiting around every moment of silence, suspense, and punchline. The interactions and dialogue between characters we're lack luster added close to nothing for character development. It's clear the creators just wanted the main crew to be a bunch of bad asses but that fell flat as well. The costumes and cgi were not that bad, and neither was the set, this was probably my favorite thing about the film, I just really wish they would've done something more with all that. Honestly, this movie would have been so much better if it weren't so predictable; Like I said: every trope in the book. If you can get passed this though, then you should give it a watch, otherwise I guess it serves as mildly disturbing background noise, if you're into that sort of thing."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "andrewmichaelbuckley",
        "review_rating": "10",
        "review_title": "Not as bad as some say. ... should have had a cinema release",
        "review_detailed_main": "I have given this movie 10 stars to make up for some of the overly negative reviews.\n\nNow my true rating is a much more positive 7/10.\n\nIn some repects this movie is far more respectful to the original game (fireball shooting baddies, health packs, weapons upgrades (chainsaws) and different coloured key cards) than the Dwayne Johnson film.\n\nWhere this film loses marks is the fact that there are no really big name actors ... actually that is unfair because there was absolutely nothing wrong with the quallity of the acting, none of the acting was as hammy as The Rock in the last Doom movie. In fact where this movie lost marks (to me) was the number of British actors who were required to talk with American accents, FFS please let them talk in their own accents rather than in a generic US accent . If the money men had done their job better to raise a bit more cash then maybe they could have had an A-lister or two so that they would have had a proper cinema release rather than being direct to video.\n\nTechnically this movie is 10/10 Sound 10/10 CGI 10/10 SFX 10/10 Costume/Prosthetics 10/10\n\nArtistically this movie is Acting 10/10 Story 9/10 (there was something missing) Editing 10/10 Cinematography 10/10 (not the 11/10 needed for an Oscar)\n\nWould I watch again ... yes!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kaefab",
        "review_rating": "6",
        "review_title": "an okay way to pass one hour and a half",
        "review_detailed_main": "An okay way to pass one hour and a half.\n\nThis movie gets a lot of bad reviews, by i guess die hard fans of the doom video games.\n\nYes i guess the title says it all doom annihilation, but you need to take this movie for what it is and not to seriously.\n\nIts a semi low budget science fiction action horror movie, to be honest the special effects are really good, they are not asylum type grade Z CG, ships, base etc are all really well made.\n\nMy only issue with this movie was the actors, they are not very good and not convincing at all, i did not feel anything for anyone of them and except for Mandylor.who is a b movie actor the rest of the cast is virtually unknown.\n\nIts an okay way to pass the time if you like SCI FI and horror with good FX give it a go."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "bobbyjxxl",
        "review_rating": "1",
        "review_title": "Made me miss Dwayne Johnson.",
        "review_detailed_main": "And you thought the one with the Rock in was bad! I really must stop watching movies because of nostalgia for video games from my youth! Awful story, pretty abysmal acting and the lure of seeing Doom guy blowing away demons with a shot gun is short lived and not to mention hugely disappointing."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "metalfan82",
        "review_rating": "1",
        "review_title": "Literally watch anything else!!!!!!!",
        "review_detailed_main": "Starts bad, and doesn't get any better. I'll watch the 2005 version all day before I watch 30 seconds of this one again. Don't even get me started on the ending. As a fan of horror I sat through hoping this would get better, but it never did. Do not listen to anyone giving this a positive review. Save your time and watch literally anything else."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "iamandyhill",
        "review_rating": "3",
        "review_title": "Doom: The B Movie",
        "review_detailed_main": "Imagine a studio decided to remake the last Doom film to grace our screens, except they had no money, no actors and no substantial plot or character development and you've pretty much got Doom: Annihilation.\n\nWhilst there are a few Easter Eggs thrown in to keep the die hard Doom fans somewhat entertained, the cannon fodder characters, utterly predictable plot and an incomprehensible amount of checking if people are alright in the middle of a battle makes you feel like shooting the BFG into your own face.\n\nLt. Joan Dark (Amy Manson) was the only real thing that stood out in the entire film, and you could see they blew the VFX budget on the last scenes, which somewhat make up for the 90 odd minutes of your life lost in the run up.\n\nMaybe one for the utterly bored fans of the F Doom series but not really much else can be found on Phobos."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "vic_muresan",
        "review_rating": "2",
        "review_title": "No, just no.",
        "review_detailed_main": "This movie is just awful, from the acting to the plot middle an end. I didn't expect much, I always enjoyed playing the game on PC but this movie just took it to a new low. Would not recommend"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Abdulxoxo",
        "review_rating": "5",
        "review_title": "Average at best",
        "review_detailed_main": "This movie is one of the best in the low-budgeted-sci-fi-horror-movies category, believe me I've seen far worst movies than this. Now I don't have prior knowledge that it was video game adapted movie, but it took me by surprise. The effects/CGI was really good considering the budget, the acting's decent except for few of the actors eg Veronica actress.\n\nIt's a bit predictable tho 'cause you can tell right from the beginning those who will die and survive. And I found ending to be ridiculous.\n\nOverall it deserve more than 1 or 2 stars that most of the reviewers gave."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "xxsavvyxx",
        "review_rating": "1",
        "review_title": "What the hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "slipknotcrazi",
        "review_rating": "1",
        "review_title": "Can it be lower than 1 star?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tejadarules",
        "review_rating": "3",
        "review_title": "What in the heck was even that...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "verdunstrain-47346",
        "review_rating": "10",
        "review_title": "Brilliant for straight-to-DVD!",
        "review_detailed_main": "There's a lot of hate for this film and I don't know why? This is obviously a straight-to-DVD film but everyone in the reviews, treat it like it was a summer blockbuster.\n\nI thought this film was tremendous for the budget they obviously didn't have. The story was really good, entertaining and true to the original games. The acting from the female lead and the antagonist were surprisingly good. The lead was strong, believable whilst the antagonist underplayed their character which suited the character.\n\nCGI was really impressive, again for the budget, and the creature effects were reminiscent of 90's creature effects like from the Guyver films - which are very nostalgic for me.\n\nIn summary, a really fun B-movie! If you like b-movies and Doom and don't have big studio expectations, this is a great 90mins. It's the kind of film where if I were a Hollywood exec, I'd watch this and think the film is amateur, however, the director, writer, lead, antagonist and CGI/creature effects team have great promise in the industry."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Necrotard",
        "review_rating": "6",
        "review_title": "Doesn't deserve such a low rating.",
        "review_detailed_main": "The sets are great, and the writing, acting, special effects, and cinematography are passable. None of it was bad enough to yank me out of the narrative. The music was decent, but some metal would have made it feel more like Doom.\n\nA few of the action beats felt weak and the very end left a little to be desired, and I'm sure the budget is to blame. It feels just as cheap as the 2006 movie, but it has more gore and faith to the source material.\n\nOverall, I stayed entertained. I appreciated the faithfulness and I loved the Hell sequence late in the film, which I thought looked great.\n\nScrolling through the reviews, I'm seeing a lot of complaints about the fact that the lead character is a woman. I don't care. \"Doom Guy\" is a blank slate in the games and I honestly don't give a crap who fills his shoes. It's not like this scrawny little woman is pulling off absurd feats of strength. She's pulling triggers on guns.\n\nI've seen reviews call the movie \"feminist,\" just because the lead is a woman. Gender is NEVER brought up in the film in any way. There is no \"girl power\" message or equal rights agenda being pushed in your face. It's just an action movie where a small percentage of the gun-toting cast is female. I'm not insecure enough with my gender to get upset by this.\n\nI even saw one review that only brings up one negative: the marines say \"clear\" a lot. Really? People are so eager to hate this movie that they start nitpicking military protocol that's in every movie with soldiers in it?\n\nI came for demons and gore and that's what I got, with the badass Hell sequence being a cherry on top."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "adam_mitris",
        "review_rating": "1",
        "review_title": "I couldn't smoke enough",
        "review_detailed_main": "I give everything with negitive reviews a chance but dammmn. They are right."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Otte1",
        "review_rating": "1",
        "review_title": "I never give one star reviews but......",
        "review_detailed_main": "This is a movie made in a warehouse using personal computer adobe workshop graphics. And the person who did the graphics wrote and directed the movie, I believed all at the same time(not true but the movie feels that way).\n\nThere is not a tired cliche missed, movie is almost like a bad parody of Aliens with a college film budget. Just don't."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "nigelsandulak",
        "review_rating": "2",
        "review_title": "So much wasted potential",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "rjunkie-07020",
        "review_rating": "1",
        "review_title": "Yet more useless virtue signaling",
        "review_detailed_main": "No matter who played the man from every single Doom game ever made, this movie would have been bad. That said, the choice of casting here certainly did not help, at all. Do we really need yet another franchise where the main protaginists gender is changed? Are women out there REALLY clamoring for a female doom-guy? No. Ripley from Aliens was an incredible female lead, why? An original character. Joan \"the freak\" Ferguson from Wentworth, incredible female main character.....original. Janeway from StarTrek Voyager? Another great female lead. Brienne of Tarth from GOT, INSANELY AMAZING female character. Why the libs of Hollywood feel the need to keep swapping out established male roles with women, just for ticking the \"girl power\" box, is beyond me. Furthermore, whats with the casting? A 90lb girl whose 4ft nothing, is not exactly convincing as a badass. Would you cast Rick Morannis to play Braveheart? How about Elijah Wood as Thor?? It undermines women's push for more representation when, instead of creating new, fresh, original characters....Hollywood insists on just swapping out men for girls in established male franchises."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "johngreenfield",
        "review_rating": "1",
        "review_title": "Disappointing, boring, poorly written and frustrating",
        "review_detailed_main": "This was easily the worst film made since Dracula 3000. Don't watch this poor excuse of a film, you will begin to evaluate every life choice you ever made that could have contributed to viewing this movie. It makes Doom (2005) look like it was directed by Kubrick in comparison."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "bwc-maneke",
        "review_rating": "1",
        "review_title": "The Worst Movie of 2019",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jeremycrimsonfox",
        "review_rating": "1",
        "review_title": "Universal Gets It Wrong Again",
        "review_detailed_main": "After seeing this on Netflix, I have to agree this is so bad, it makes the original film look good. The main heroine, Lt. Joan Dark, is a bland heroine who fails to make as much of an impact that sci-fi heroines like Ellen Ripley and Sarah Connors made. Also, the acting is horrible, the monsters and CGI make the movie look like it was made with a low budget, and the fact that Amy Manson made an infamous tweet insulting the legend that is the Doomguy, and I can see why id Software disavowed this space junk posing as a film. Avoid at all costs."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "cristinamcj",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "What the hell was this...... !?\n\nBad acting, bad script, bad everything.... I felt I was watching something that came out of the Power Rangers 😖"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "poseidonsparadise",
        "review_rating": "10",
        "review_title": "Special doom movie right here !",
        "review_detailed_main": "I found out about this movie when i seen it on some movie news site I can't remember what site I heard about this movie let me tell you this was a great movie to me and I didn't know it was low budget and that's what made this so special the effects and effort was there this story didn't land flat to me it was great and I felt inside the doom universe all the way I also got resident evil vibes from this movie well done thank you to the actors director all who helped make this movie come to fruition thank you!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "fowldogg",
        "review_rating": "6",
        "review_title": "Don't believe the hate.",
        "review_detailed_main": "Pretty good low budget sci-fi film with decent acting, effects and some fight scenes. Overall very watchable if you don't get your expectations too hyped up. I liked it, would watch a second one."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "nogodnomasters",
        "review_rating": "5",
        "review_title": "No One is Allowed to Leave",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "claziano",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever seen.",
        "review_detailed_main": "This movie is not intended for young women. It's intended for young men. Women don't play DOOM. They never did and they never will.\n\nSo the fact that every male in this movie is only as tough as a fingernail model makes me wonder what the agenda is here. The agenda is to demasculinize young men.\n\nAnother reason being old isn't such a bad thing. I could have had to grow up with this foolishness.\n\nBesides the bad acting, a team of scientists deconstructed a man and reconstructed \"THEM\".\n\nI wonder what lame-brained Liberal girlie wrote this script. They couldn't say they reconstructed \"HIM\". And if it were a woman, I suspect she would have been referred to as \"THEM\" as well.\n\nThis gender-neutral nonsense is ridiculous. HIM and HER are apparently offensive terms now - because .000000000000000001% of the population are offended by the words.\n\nWait until somebody becomes offended by \"the\" and \"and\".\n\nHere's a quote from another review I like:\n\n\"No Doom Guy. There was a cameo of the guy from Wolfenstein, but he was dead. Just a bunch of SJW schlock. Doom Girl was all of 90 Pounds, about 12 years old, and was running around beating up 240+ pound dudes and demons. What a bunch of crap."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "TheFriendlySniper",
        "review_rating": "4",
        "review_title": "The \"Doom: Annihilation\" Drinking Game",
        "review_detailed_main": "Playing the \"Doom: Annihilation\" Drinking Game is quite easy. You and your friends simply need to take a drink each time a character in the movie shouts \"Clear!\". While watching this movie, you get the impression that they sent the cast for a day of \"military training\" and shouting \"Clear!\" every thirty seconds is all they learned to do."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "fciocca",
        "review_rating": "1",
        "review_title": "A big disappointment for all video game fans",
        "review_detailed_main": "Being a DOOM video game fan, I was curious about this movie. Since I watched the trailer I already knew that this was not going to be a nice product. I decided to give it a shot anyway. DOOM Annihilation looks and feel very cheap: locations lacks on details, for monsters seems that they used discount costumes, guns had an horrible design, especially the BFG9000, seemed a toy plastic gun.\n\nActing is awful, I don't know where they find these actors, but most of all, I would like to know why they had the british accent. DOOM was developed in America in the 90s, the DOOM 2016 video game had actors with american accent, why they decided to put british actors on this movie? It does not make any sense. Usually I would pass on this detail, but not in this case.\n\nThe most iconic character of the game is naturally the DOOM guy, and here there is not, at least in the 2005 movie with The Rock, they tried to make something that remembered him. Here, instead, we found again on front of the necessity to have a female hero, that will save the day. I am not against it, and I always support writers that creates positive female characters, but in this specific case, you are just ruining the spirit of the original concept.\n\nTruth is that DOOM is not easy to adapt into a movie, because the game itself does not have lot of plot: it is just a guy that fights against demons that are trying to annihilate the Earth. It would be nice if for once they would decide to create a real nice narrative universe that explains the origin of these demons, but it needs to be a well written script.\n\nBy watching this movie, I really reevaluated the 2005 one that was better conceived. This is just a bunch of really bad stunt scenes mixed to very cheap CGI, which, for a movie of this kind is essential. I think that people that worked on the movie,already knew that this was going to be a bad movie, so they simply put a really famous name on the title and then released it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thomasclark-55117",
        "review_rating": "1",
        "review_title": "Cute",
        "review_detailed_main": "Dora the explorers and Cybil the blue haired troll are under attack from rubbery, flame spewing Baby Crota's. This should be a free YouTube film. +1 for being slightly better then CW's Bat woman."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "S_Soma",
        "review_rating": "2",
        "review_title": "A game movie not even a fan would like.",
        "review_detailed_main": "Its a complete mystery to me why anybody would want to watch DOOM: ANNIHILATION. It is, literally, the same DOOM plot extant since, what, 1993? About the only \"new\" feature is that the \"portal\" through which the baddies come is an interplanetary, possibly interstellar, teleportation device. NOT a significant addition if it is, in fact an addition, and I'm not certain that it is.\n\nIf you're a DOOM fan, then you've seen this exact same thing many times in many games and movies.\n\nIf you're NOT a DOOM fan, then DOOM: ANNIHILATION simply reads as THE WALKING DEAD on Phobos except without any real plot.\n\nLiterally, and I mean LITERALLY, you could just watch a DOOM gameplay recording on YouTube and see EXACTLY the same thing: \"So, BLAM BLAM BLAM, read BLAM BLAM BLAM, any BLAM BLAM BLAM, good BLAM BLAM BLAM, books BLAM BLAM BLAM, lately BLAM BLAM BLAM?\"\n\nNOT interesting, NOT engaging, NO new territory covered, the ULTIMATE in predictability and repetitiveness. The PAINFULLY obvious ending SO apparently leaving the door \"open\" for a (God forbid) sequel takes the word \"tedious\" to a whole new scale.\n\nTiresomely, there were \"cameo\" appearances by a sawed-off, double-barreled shotgun and the infamous BFG9000 in the hopes that supposed fanboys would maybe get a stiffy. In the DOOM games at least, the lucky recipient of a BFG9000 blast would get blown entirely to pieces. In THIS movie, all that happens is targets fall down like narcoleptics. They couldn't even get that right. They actually did the same old thing, only wrong.\n\nI kept thinking, \"Surely they're not gonna do this, right? NOBODY is going to make this story AGAIN with absolutely NOTHING new or interesting in it? NOBODY would do that, right?\"\n\nYep. It turns out that somebody would.\n\nFrom the very first DOOM game, one of the more interesting elements in its intrinsically repetitive nature was the presence of really weird, surrealistic monsters, like giant, floating heads with huge horns and teeth. All of the human zombie-things were just sort of background decoration for ambience. I kept hoping to see some interesting monsters in DOOM: ANNIHILATION thinking that at least that might alleviate some of the tedium.\n\nBut no. Just interminable periods of waves of human zombies all shot in more or less the same way and occasionally stabbed with a pig sticker for \"variety\". In terms of monsters, all we get are fixed-teeth \"demons\" that are just guys in rubber suits striking \"kewl\" poses.\n\nDisclaimer: I was a HUGE DOOM fan. In 1993. This movie has caused me to retroactively detest it. It's that bad."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mick120359",
        "review_rating": "3",
        "review_title": "OMG NOOOOO !!!!",
        "review_detailed_main": "It's just a cheap and nasty rip off of the 2005 movie \"Doom\" staring the Rock. While some of the action is ok, so much more of it was utter rubbish, and the same can be said of the acting. I know a lot of films leave it open at the end for a follow on, but I hope that no one is stupid enough to follow this one up. I could probably write a lot more about this film, but to be honest, it's just not worth the effort, except to say, DON'T BOTHER WATCHING."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ReviewsMatter",
        "review_rating": "3",
        "review_title": "Doomed from watching this Doom film",
        "review_detailed_main": "I enjoy the Doom franchise films until today. Doom: Annihilation lacks action. The scenes were painfully slow, full of monotonous talking and no consistent storyline. Overall, this Doom addition is a let down in my humble opinion."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "french_fry_chelsea",
        "review_rating": "10",
        "review_title": "Don't listen to the critics",
        "review_detailed_main": "I really don't understand the negative criticism. Star Wars 7 and 8 were trash. This movie, with some flaws that could be improved with a greater budget, was amazing! A great script, characters you grow to feel attached to, and realistic sensible plot. Seriously, it's like the negative reviewers didn't even watch the movie. I got on IMDB because I expected this to be one of the few low-budget movies with a high rating. What do I find instead? It's been sabotaged with low reviewers for absolutely no good reason. Movie deserves an 8 for amazing acting, scripting, and director. Only downside were that the props and some cgi could be better."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "outsider4",
        "review_rating": "7",
        "review_title": "An adequate return to the Doom franchise.",
        "review_detailed_main": "I watched this movie called Doom: Annihilation. Based on the videogame we all used to play. And unlike the first attempt at the franchise, it was actually pretty good. It was filmed in Bulgaria on what was probably the catering budget for one of the Star Wars movies. It followed the game philosophy pretty well. The sets and actors weren't expensive but they weren't horrible either. CGI and special effects were not spectacular but quite adequate to move the story along. All in all I quite enjoyed it! A solid B movie that would have done ok as the second feature at the drive-in."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Slackshank",
        "review_rating": "1",
        "review_title": "Too bad to be even funny",
        "review_detailed_main": "When the first information was revealed that there will be new \"DOOM\" movie in the makes, I was thinking \"Oh man, surely it will be better than the one with Dwayne in it!\""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "viking-35630",
        "review_rating": "1",
        "review_title": "0 stars if I could, actually I'd love to give it negative stars.",
        "review_detailed_main": "The movies is so generic that it plays like a B grade zombie movie, except it's not exciting, its not funny, and there is zero nudity.\n\nI decided to end my night with this movie after Netflix recommended it. I mean hey, I'm a gamer, i enjoy video game movies. I have even been known to enjoy the double dragons and Mario movies occasionally. I've seen the Doom movie with the Rock, and I actually liked that one despite its flaws. Okay so back to this movie, I've wasted about 90 minutes of my life. Watching the \"strong female lead with a troubled backstory\" cliche that has overrun cinema has ruined yet another franchise honestly. This movie should of been Doomguy or Doomgal just destroying these demons and having some of the franchise mainstays in there, maybe even some easter eggs or nods to classic Doom. It is none of that, just 90 minutes of time you can never get back."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "spatookbien",
        "review_rating": "2",
        "review_title": "It's.... not good",
        "review_detailed_main": "The film is cheap, slow, underlit, boring and predictable. Don't recommend. That said, the incel outrage seen in other reviews over the film having a female lead is quite entertaining, so 2 stars rather than 1!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Scuppered by budgetary deficiencies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "bland",
        "review_detailed_main": "Scientists on Phobos are using ancient unknown stones to develop teleportation but it brings horrors and danger. Marines arrive in response to a distress call. Lt. Joan Dark is hated by her troupes. Upon arrival, they find a few survivors and the base under attack by the scientists who turned into monsters. This is a straight to video product and one could probably find it streaming somewhere. It's not particularly anything good. The actors are bland. The story is unimaginative. It starts well but the movie quickly stalls. Non of the characters are that compelling and the actors are second tier. It's a video game movie and nothing more than that."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "lexcamel",
        "review_rating": "1",
        "review_title": "OTHER GARBAGE LEFTIST!",
        "review_detailed_main": "The question is: How do you still invest in \"plots\" like this? It's a LOST investment! When will they learn? So many heroine women, history to be told and the \"producers\" INSIST in making films by misrepresenting characters and creating disturbances just to carry out \"PROGRESSIVE\" orders ????\n\nAnd the profit? STOP IT!!!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mitch-moor2",
        "review_rating": "",
        "review_title": "doom annihilation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "derangedxzombie",
        "review_rating": "1",
        "review_title": "A waste of time for everyone involved in the production",
        "review_detailed_main": "Yet another movie adaptation of a huge videogame turns out horrendous, because the wealth of source material is as usual, ignored.\n\nWhat is Doom? Going by the 2016 reboot that delves much deeper into the lore. It's about a race of humanoid beings from a dimension similar to or shared with Hell and it's demons. These humanoid beings fought against the forces of hell for centuries using primitive weapons (spears, swords) and had inhuman strength fuelled from the dimension itself. One apparent remaining soldier known as Doom slayer; a white humanoid male in a green power suit of sorts ends up on earth, after the UAC's scientific team led by a shady head scientist with ulterior motives, unlocks a portal to Hell on Mars during an excavation. An invasion of the demons to Mars and then Earth ensues, and the Doom Slayer awakens in a UAC lab and suits up, then uses an array of powerful weaponry both primate and futuristic to do what their race does best; kill the demons. They have minimal support from the outmatched UAC marines and an elusive shunned scientist Samuel Hayden, that had their brain or likeness put into a large robotic body.\n\nWhat is this film then? A female UAC marine and her team residing on Mars, use plastic looking assault rifles, one marine uses an LMG that makes a whirl sound like the games minigun despite being an LMG, bizarrely. And even the infamous BFG 9000, which is portrayed as a pathetic weapon in the movie. They use these weapons to take on..2 of the franchises weakest demons (possessed humans, that look like blue vampires in this, and imps, that look like people in rubber Halloween costumes). But they are at least on Mars and an excavation does at least reveal portals that unleash the demons. There's a head scientist named after the one in Doom 3 that came out about 15 years ago (why not use source material from the lore rich reboot 3 years ago?) The head scientist being the only character from the franchise, looks nothing like the character however, and no other character from the source material...including the Doom Slayer, you know, which the whole franchise pivots on, is even in the movie. The premise without any spoilers (not that there's an ounce of this movie to spoil) is the marine woman helps stop the paltry demon invasion with her team.\n\nWhat do we have then? A B-movie in every sense of the word that very loosely follows the story of the game and pays hardly any attention to the source material. Til the point it is an insult to have the franchises name on the films cover. There is a strong trend currently of taking existing franchises, particularly those with white male leads and replacing them with female leads of an often misandrist nature. Although the producers made a tweet inciting this, the movie doesn't have any of the typical dialog and story arc that show this. It is just a case of it being a bad film and paying no attention whatsoever to the franchise itself. Had an original movie been made with this lead character and some original idea's, maybe it would've faired better. Original idea's cease to exist nowadays though and this is the result, avoid."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Even worse than the predecessor...",
        "review_detailed_main": "Granted, the 2005 \"Doom\" movie wasn't a masterpiece, but at least it was watchable and enjoyable for what it was - a movie based on an old game franchise.\n\nNaturally, I dreaded sitting down to watch this 2019 movie titled \"Doom: Annihilation\", especially since I never even heard about it prior to getting the chance to watch it. But still, as a movie buff, of course I took the time to sit down and watch it, believing in giving every movie a fair chance.\n\nTurns out that this 2019 movie by writer and director Tony Giglio wasn't particularly impressive in any way. Sure, it was carrying the \"Doom\" title and is an addition to the franchise, but hardly a noticeable or worthwhile addition.\n\nThe movie feels low budget - you know that particular feeling that you get from certain movies that you watch. Some like this, of course, but I can't really claim to say that I am much of a fan of that, and it wasn't working in favor of the movie.\n\nNow, the cast in \"Doom: Annihilation\", was for the majority of the entire cast, unfamiliar actors and actresses, which is something I do like. So that counted for something and worked in favor of the movie, despite it being unable to make up for the movie's shortcomings and flaws.\n\nThe storyline was straight forward and require no brain activity to follow, for better or worse. It was good in the sense that you just sit down and watch this, not having to invest anything in it aside from time and whatever money wasted on renting or purchasing it. But on the other hand, it was so completely derivative and generic that it was bordering on being downright boring and laughable.\n\nThe CGI in the movie was fair for the most parts, despite the fact that the fire wielding and throwing creatures looked like something from a 1990s computer game. It was near impossible to take those creatures serious in any way.\n\nAs in terms of enjoyment and entertainment, then \"Doom: Annihilation\" is a weak entry in cinema. It hardly offered anything of any worth or value, and most definitely didn't bring anything new to the genre of movie adaptations based on computer games. Some times, you just stop and wonder 'why do they even make movies based on these games?'\n\nI endured the movie to the end. And while we are mentioning the end, then I will say that the ending here was a slap to the face with a cold, dead fish for us in the audience that actually gave the movie a chance and attempted to like it.\n\nAll in all, \"Doom: Annihilation\" manages to score a meager four out of ten stars from me."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "nahumthebest",
        "review_rating": "8",
        "review_title": "Been a Doom fan since the 2004 PC game & 2005 film",
        "review_detailed_main": "The movie felt low-budget. More CGI was needed. I'm giving it 8/10 w/ the hopes that there'll be a next Doom movie. The haters are ungrateful; at least we got a movie to watch. Please make another movie w/ more funding. The actors were fine and the storyline was decent. The ending was good. 8/10."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "siderite",
        "review_rating": "6",
        "review_title": "A formulaic plot, but exactly what I was expecting",
        "review_detailed_main": "When I think Doom, I always have in mind Doom 1 and 2, the original games, with the silly pixelated sprite animation and the weird sounds and music. It wasn't so much horror as cheesy action. So when you get another low budget movie called Doom, you can't really expect much. Silly weapons, evil demons, lots of shooting. And that is what you get, with some typical horror plot thrown in of experimentation with alien technology on Phobos, the compulsory arrogant scientist with a British accent, the brave soldier - which in this case is the really cute Amy Manson - and some bad CGI.\n\nIs it scary? Nope. You see everything coming a mile away. Is it funny? No. It takes itself seriously for some reason. It borrows the game elements: the levels, the weaponry, the colored key cards, and uses them in the plot, like they were supposed to make sense. Is the action amazing or the background story captivating? No. Like a blockbuster or a McDonald's burger, It's exactly what you would expect, with absolutely no surprises. The best part of the movie was how cute Amy Manson was."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Soodinum",
        "review_rating": "2",
        "review_title": "I'll Keep This Brief",
        "review_detailed_main": "To sum up the quality of this film, the main actress' name is spelled incorrectly in the opening credits. Yeah - that's the level of competency coming at you here.\n\nDon't get your hopes up if you're a Doom fan. You'll only be hurting yourself.\n\nI have it a 2 for SOME of the CGI. You'll know which bits. They're few and far between.\n\nOne good thing: you'll have a whole lot of love in retrospect for The Rock's Doom movie after seeing this."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "josedavid71",
        "review_rating": "2",
        "review_title": "As much of a fan I am...",
        "review_detailed_main": "This movie paled in comparison to the original and I'm aware that the original was also panned. This was a huge disappointment. I can't think of not one redeeming quality. The acting was bad (1 star) and the graphics were a bit better than the acting but not by much (1 star). The storyline tried to mimic the first but failed because of the previous reasons noted. So sad :0(..."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "madcama",
        "review_rating": "2",
        "review_title": "Is there pilot in iD Softare?",
        "review_detailed_main": "One of the worst movies I ever watched. Such a shame for this great game franchise."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "agnelroyichen",
        "review_rating": "2",
        "review_title": "Over exaggrated",
        "review_detailed_main": "The movie was not to the point. The cast did their part, eventhough the plot was not to the up most. The movie is watchable and has some violence. Overall the movie could have been made more bearable."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mtdube",
        "review_rating": "1",
        "review_title": "Another Uwe Boll film. Or rather feels like it.",
        "review_detailed_main": "Uwe Boll has a reputation for taking video game licenses and producing horrible movies. And this feels like he got a hold of this franchise and wanted to destroy it as well. He didn't but it definitely feels like it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "MrAfroSushi",
        "review_rating": "1",
        "review_title": "This Makes Resident Evil Look Like The Godfather",
        "review_detailed_main": "Dreadful... ABSOLUTELY DREADFUL!!! This movie does nothing with the source material it's trying to adapt based the awesome and energetic video games. The acting is trash, sets look like they're straight out of a rejected sitcom, the characters are one-dimensional and completely uninteresting in the SLIGHTEST! Also you can tell this movie has NO budget when it comes to the demons, they look like crappy CG symbiotes from Venom (no offense to that movie) that are also NOT SCARY at all. If this was trying to go for horror/action like Alien/Aliens, it failed epically! Avoid this piece of crap at all costs!!!!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thinkNik",
        "review_rating": "3",
        "review_title": "Sci Fi B Movie on a budget...",
        "review_detailed_main": "On the plus side:\nSeveral Easter Eggs from DOOM and Wolfenstein 3D games here and there\nThe Hell segment is the most enjoyable part of the film with proper CGi but it's...too short\nCan be fun at times\nWe've seen worse video game adaptation movies...\n\n\nOn the negative side:\nForgettable cast and subpar action, you won't care about any of the characters"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "apouwels85",
        "review_rating": "1",
        "review_title": "WTF - This is not Doom...",
        "review_detailed_main": "I'm a fan of the games and after the last movie I was confident that the movie will be better this time.\n\nBut it wasn't like that. In comparison the film from 2005 is the better one of both and closer to Doom than this one.\n\nThey just took any zombie story, rewrote something here and there and wrote Doom on it hoping to make some money out of it.\n\nFor me the movie is a disappointment.\n\nThis movie contributed to the fact that the big studios will consider it more than once to make a movie about a game which I think is a pity because there are many good games out of which you could make a good and entertaining movie."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Rumble_Down_Below",
        "review_rating": "10",
        "review_title": "Fun and faithful adaptation",
        "review_detailed_main": "If you like the original doom games. You'll like this. It's low budget but it's faithful and you can tell the filmmakers loved the game. Good story. The 2 leads were great. Ignore the haters."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "savarkar-12942",
        "review_rating": "7",
        "review_title": "I liked it for some reason.",
        "review_detailed_main": "I liked action and sound. Hated the doctor. People will be same no matter where they go."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jpncanovas",
        "review_rating": "1",
        "review_title": "The WORST movie ever.",
        "review_detailed_main": "Political correction always make a possible good film becomes the worst film ever."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "thatmaninblack",
        "review_rating": "4",
        "review_title": "Low-budget action-horror",
        "review_detailed_main": "I'll give it 4/10, but it's a REALLY generous rating...\n\nCheap looking set, weak CGI. The acting is okay I guess. The action is not good, but not horrible either. The characters are kinda weak.\n\nThe story should be just a side-quest in the Doom universe, not an origin story. It should be just the making of teleport, maybe a mix between The Fly/Zombie movies. They could just do that, get some ok ratings, buff out the budget for the origin story movie. But that's not what is happened. They had no money, but they made an origin story anyway, and it didn't work, of course.\n\nThe fact that the movie crew mocked the Doom fans, didn't help their situation, for sure. Now they are getting 1 star ratings all over their movie.\n\nIf you find the movie at Walmart for 1 dollar or something, or if it's on TV watch it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "samob-31952",
        "review_rating": "2",
        "review_title": "No doom guy",
        "review_detailed_main": "Terrible acting, the marines are pitiful only reason it didn't get 1 star was bc the visuals and the call backs to the series . Other then that dont waste your time."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "frankblack-79961",
        "review_rating": "2",
        "review_title": "Bad. Not horrible. Bad.",
        "review_detailed_main": "Sterile movie. No atmosphere with the music. Sets are weak. Props look closer to the Doom 3 video game than the previous movie. They had to be \"woke\" and put a female lead in. Poor acting all around. Mild entertainment from the chainsaw scene (1 min.). Worse than the first movie. Fail."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "nikola17",
        "review_rating": "4",
        "review_title": "not worst but i know at least how bad this film is",
        "review_detailed_main": "I loved Doom (2005) The Rock and Karl Ubarn i loved games as well but film Doom (2005) was a lot better and closer to game could made things better, could off put more monsters and creatures in it but i guess they didn't had money for it who know's but i liked Doom (2005) film but with this film believe me it's a lot worser then that it's cheap, good acting, good CGI, good story,and People can do a movie like this for pennies with a film like Hotel Inferno 2: The Cathedral of pain or you could do it in a style of Hardcore Henry how hard is that make a Doom movie mixed with Hardcore Henry and that film coast 2 million dollars that's not bigger budget film but at least that film is like Doom but not in a horror way. Hardcore Henry is low budget but the film got 2 million dollars but with this ? this can't get even 1 million but no film is cheap like it coast less then 1 dollar more like 5 cents of coast of this movie. i don't understand why this film could off got bigger budget film, could budget the\n\nmoney make the film bigger with a Hardcore Henry style with Hotel Inferno 2 Cathedral of pain style. cinematography is good but it looks like 2005 film that was filmed and locked up and cover up all story thats what it looks like of film. i knew this was going to proper bad - low budget, cheap actors, mediocre director & no involvement from the authors of the original concept and all the games and didn't see Hardcore Henry or Hotel Inferno a film done for much, Much Cheaper than to DOOM Annihilation. director doesn't know to have idea and involvement to mix up style of DOOM film to be like hardcore Henry A movie that looks a lot more Doom than a flick called Doom. Also, being direct to video doesn't mean you need to incorporate things like 'conversations about who stole whose underwear' into a Doom flick. .the director Tony Giglio is director i don't like but at least i liked 2 of his films Jason statham and Wesley snipes film Chaos (2006) direct to DVD film i liked. and low budget version of SWAT under siege 3rd film. but with this i don't understand why he wanted to make a DOOM film i just don't understand why he wasn't right director for it. it's because he wanted to make it\n\n\n\nTony Giglio pitched to Universal his idea for a new film in 2015 but initially declined. The success of the 2016 DOOM video game convinced Universal to proceed and commission a script from Giglio i don't understand why Universal gave script without not looking at his records of his films he did, why didn't they run threw give him interview say to him how are you going to make a DOOM film but Universal is being idiots just to give script to him when he has no involvement from the authors of the original concept and all the games it's like they don't give a crap they just threw script to him without going threw of what and how would make film into but HEY look he made it into like a direct to DVD it is a basically Doom: The Syfy Edition that could be easily shown in SC-FI channel. The project was announced in April 2018, with principal photography commencing soon afterwards and ending in June 2018, with additional photography following in early 2019. Doom: Annihilation was released direct-to-video on October 1, 2019. sadly why can't Universal get a budget at least 1-3 million dollar film can't make DOOM with a bigger budget.\n\nnow with this film lead actress (Amy Manson) Joan Dark known for Touchwood TV series, not another happy ending, T2 Trainspotting she did another TV series and movies. she is great lead character i liked she is worth it i love strong female action movies i really do but she has been given a bad script, and in a wrong film she can be actress who can play in Alien franchise or Predator franchise she is a very strong female character in this movie i liked her she was more enjoyable in film much more then anyone who play's in film. you have\n\nanother characters Daisy (Gina Phillips) known Jeepers Creepers, Love and Debate, Hijacked i haven't seen her since Hijacked and recently new Jeepers Creepers 3 as cameo but she did fine in film, Chaplain (Louis Mandylor) known my big fat Greek wedding, The Quest, so many another movies he wasn't in it as much but he is their. the action horror scenes where people are meant to be possessed by demons but they were zombies feels like i am watching Paul W Anderson very first Resident Evil (2002) but it's not in lab it's in space. throughout film one by one characters get wasted pretty quickly. and film looked like a looks like a school project, like you see this film in SC-FI channel in Tuesday night sadly i don't know how in earth someone would make a DOOM movie a direct to DVD that's shocking as well because i hope one day down the road i wanted to see big budget DOOM film just like (2005) DOOM with Rock. but no Hollywood don't learn their lessons with another (2005) DOOM flopped and if you hated (2005) DOOM i don't understand why ? but this film you should hate even much more and believe me it's worser then (2005) DOOM film witch i enjoyed. with this their is Easter eggs like helmets from game are in this movie and double barrel shotgun is in it as well just like\n\nin game and some others, the BFG weapon worked and looked better in DOOM (2005) what Rock uses, but in this film eh BFG looked like a toy like someone would bring it to comic con, and when main chick curry's BFG it's bigger then her like if you put it top of her head she would drop to her knees the gun BFG looks much, much more bigger then her look at imagine of her carrying it that's why the BFG looked fake that was stupid choice because that's for bigger person would carry that like Rock could carry that he is big just like BFG, in film sadly it's not same what you look at game or 2005 film, the BFG doesn't blow everything up at room. she shoots demons one by one it doesn't destroy everything sadly but it doesn't happen. (Amy Manson) Joan Dark good actress but the script and what she has been told to do is terrible in film but she is not terrible actress just script was rubbish. the props are awful and the FX must have been done in windows paint. the film is just okay to watch it's not worst film i ever seen in my entire life but i seen worser like House of Dead or Alone in the Dark those are worst. but this i liked because of lead actress and action was just fun and fast pacing but this wasn't great it's not something i want to watch all time i rather watch (2005) DOOM and that doesn't do any justice at all this is something you watch it for once then you move on and never think of seeing it again, it's not really of worst films ever in my opinion."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jwheeler0805",
        "review_rating": "4",
        "review_title": "The ending sealed it....One of the worst sci-fi movies I've ever watched.",
        "review_detailed_main": "This has a few redeeming elements, but they are highly overshadowed by the bad and ridiculous elements. Conceptually solid but highly predictable. Special effects are mostly passable, but some of the \"creatures\" are - even though supernatural in origin - really just crazed zombies with a new paint job. And the other creatures - supposedly \"demons\" are on par with something from Power Rangers. Some of the acting is decent, but the characters are paper thin and some of the dialogue almost draws an eye roll. And the ending...not sure if they wanted to leave room for a sequel or if they were going for the ambiguous conclusion sometimes seen in horror films, but it is so abrupt and non-conclusive that it almost seems like they simply never finished the script or ran out of money and couldn't film the actual end.\n\nIf you're going to watch a \"Doom\" movie, definitely go with the one with Karl Urban and Dwayne (the Rock) Johnson."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "KoolCatReviews",
        "review_rating": "2",
        "review_title": "Not realated to the video game and not very good",
        "review_detailed_main": "The connection to the video game is trivial the only thing I could tie to the video game was the BFG and the setting. Everything about the movie is pretty bad from the action to the lead role. The plot while being easy to follow at the beginning, by the end it makes no sense at all. Another game movie we didn't need and it's not even a good action romp."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "SharkL_official",
        "review_rating": "10",
        "review_title": "Why people hate \"Doom: Annihilation\" when it's actually a good Doom movie.",
        "review_detailed_main": "Hi everyone, I've been a fan of Doom since I was about 10 years old. I know, it's not the most child-friendly game for that age, but I casually played it and it has been a part my deep passion for the shooter video game genre.\n\nIf you have only discovered the Doom saga with the last two games, namely \"Doom 2016\" and \"Doom Eternal\" then in my opinion you should not even watch the latest movie adaptation of the series, namely \"Doom: Annihilation\". But let's start from the beginning: As we know, there have been a lot of movies that tried to revive the success of various video games in a cinematographic context, but unfortunately, having money is not enough. In fact, the authors need to have the right knowledge of the work on which they have to work on and also a minimum of passion in doing so. We saw how many movies based on video games are actually garbage such as the Uwe Boll movies, just awful...\n\nBut let me tell you that \"Doom: Annihilation\" was created in a totally different way; in addition to having personally seen it I was also lucky enough to talk with the director Tony Giglio. This movie was born because him is a true FAN of the genre, and not only Doom but also a fan of all the best old school FPS of few decades ago. Just think of the reference linked to \"Wolfenstein\" contained in the movie.\n\nSo you may be wondering: why was the movie judged negatively? I'm here today to try to clarify and convince you that maybe you watched this movie from a totally wrong perspective. Let's start from the beginning: Universal is the famous movie production company that currently holds the rights to produce a Doom movie. Therefore, it should be specified that these rights are limited exclusively to the old Doom games, which are: \"Doom (1993)\", \"Doom II\", \"Doom 64\" and \"Doom 3\"; this is a fundamental point since many people have unfortunately known the video game only through the 2016 \"reboot\" by Bethesta company (This videogame company does not want to sell the rights to a movie based on the games \"Doom 2016\" and \"Doom Eternal\" for the moment).\n\nBut in my opinion, this is not necessarily a bad thing. It can be for many who would like to see the Doom Slayer in frenetic scenes where he rips off demons with metal music and that's it. I have certainly appreciated all the Doom videogames released so far, but I always consider the classic Doom games as the best.\n\nReturning to Universal, this has certainly shown interest for an attempt to launch the Doom brand also in cinematographic context, but unfortunately it immediately failed with the flop of the famous movie with The Rock, and if we wanted to talk about this for a moment, I personally appreciated that movie, but it has obvious problems that cannot be ignored. I could go deeper, but we are here for Doom Annihilation and I would not like to dwell too long.\n\nNow let's get to it: Tony Giglio's movie\"Doom: Annihilation\" comes from a completely different pretext: the pure desire to do it, and at any cost! A passion that is hardly found in these contexts, so if you thought that Universal had produced this new movie to try to make money by spending little money, you are totally off track. The company has never proposed on its own initiative a new attempt to capitalize on the success of Doom franchise, in fact this movie exists only because an ordinary director wanted it, and somehow managed to get a small budget to work on it (really small).\n\nNow I'm going to talk about the movie itself; It's a movie that pays homage to the original story of the very first Doom videogame, more than it seems! But it also takes a lot from \"Doom 3\" and \"Doom 64\". Previously, the doomguy was not definable as a character, but the representation of the player in the role of the Doom marine, who is the only survivor of his group, and this is exactly the initial incpit!\n\nA group of marines is sent to the Martian base \"Phobos\" following a mysterious invasion. Then all the marines, except one, are killed by demons. So when it comes to Doom story, we know that all the characters are destined to end badly, except for the protagonist. The problem is that many people consider Doom a game based exclusively on an iconic character, but that's because Id software under Bethesda developed the story in this way, effectively creating the Slayer. But we must remember that the doomguy WAS mainly an ordinary marine who proved to be more skilled, and for this reason destined to face the demons.\n\nIn the movie we have as protagonist the lieutenant \"Joan Dark\". There would be many things to say about her, for example that it is also a reference to \"Joan of Arc\", but for this there is already another article written by other people. But what you only need to know is that she is the purest representation of the doomguy in this movie, as she is the only marine who proves to be able to get to hell. We can define her as doomgirl.\n\nI really appreciated the fact that the doomguy is not a specific character, but that he or she is the one who could get to the point of facing and defeating the demons. The starting point of the story of all dooms has always been this. We're not talking about a series like Duke Nukem that is mainly based on a specific character, namely the \"Duke\", and I think this is the best example: \"making a movie based on Duke Nukem without Duke Nukem\" that would be ridiculous. Doom is not like that. Now let's talk about the remaining of the plot: very faithful to the concept of teleportation and demons trying to invade the earth.\n\nI could talk for hours about how the antagonist of Doom 3 \"Dr. Malcolm Betruger\" is the most apt for this context, and how it has been adapted perfectly, going from being a character in a videogame to becoming the character of a movie, but I'm trying not to make this review too long, this to make sure that it is read by many people, so I could go deeper on another occasion. Speaking of demons, their appearance is clearly based on the chapter dedicated for the Nintendo 64 console, namely \"Doom 64\" (We even have the arch-vile!).\n\nIn addition to this, you can see all the stuff that seem to come directly from the classic Doom videogames such as: colored keys, the medical station, the portals of the archaeological excavations and the BFG with its GREEN plasma concentrate (unlike the BLUE version of the first movie)!\n\nSo, you can see that the author is a true fan of the classic Doom videogames, and has managed with a very small budget to make a movie definitely SUPERIOR to many shitty projects with millions of dollars wasted. It is clear that, in this movie, many action scenes do not shine in terms of spectacularity, but everything possible has been done to manage the little money available.\n\nDoom is my favorite shooter saga ever, and I enjoyed this movie as a tribute to this wonderful and spectacular saga. I much preferred a \"poor\" movie rather than nothing or a movie maybe with spectacular special effects but without the true soul of the video game. What I don't realize is that the only way to get more out of this is to start supporting and showing appreciation for small projects like this. Only then will studios like Universal decide to pour lots of money, but we must also be able to recognize the enormous difference between video games and movies. Even the ending (without spoilers) is very faithful to the original story; do you remember what happens at the end of the very first chapter of The very first Doom videogame? \"Knee-Depp in the Dead\"?\n\nHere. I would be really excited about a sequel. There was also the question of the fact that \"ID Software\" claimed not to be involved in development, but thank f**k I would say... ID Software works on videogames, they are not workers in the cinematography industry and has simply claimed an obvious thing. This means absolutely nothing, I have always found it ridiculous to bring up this fact just to criticize the existence of the movie. Like it or not as it should be, tastes are tastes. The problem is when people criticize in a \"objective way\" even though they are not experts of the original work.\n\nThis movie is in fact a small tribute, wanted by a fan, who certainly wanted to reinterpret the formula of the game in his own way, but this in the right way and with little money available. Try to see it for what it is and you will realize how beautiful and profound this movie is for us true fans."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "zacharylennard",
        "review_rating": "7",
        "review_title": "More faithful to the source material",
        "review_detailed_main": "Sure, Hollywood has been working on getting video game based movies better, like Detective Pikachu, Angry Birds Movie 2, but there's always a hickup along the way. What is really good about this movie is that it is far more faithful than the atrocity Dwayne Johnson was in. This movie would have been horribly received and wouldn't be able to recoup it's budget if more work was done to the movie if it was released into theaters, but still have the same plot, story, and characters at the same time. For a direct to video movie, it's not that bad. Yes, it doesn't have the Doom guy in it, which would be amazing. You have to at least give the people credit for trying with this. I enjoyed it overall."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "gann-50635",
        "review_rating": "3",
        "review_title": "Cheesy acting",
        "review_detailed_main": "The acting seemed akan to a on stage perfermance in comparison to a lot of other movies. Monsters lacked imagination. The first 'Doom' was better."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "beezar-66805",
        "review_rating": "1",
        "review_title": "Filmed in Stink-O-Rama!",
        "review_detailed_main": "If there's ever been a cliche in any cheapo sci-fi movie, you'll find it here. With no-name actors, wooden script, and well-below average special effects, it's completely laughable and as exciting as a dead roach in a public restroom.\n\nThere's not enough weed to make this watchable unless you're on the low end of the spectrum for idiocy."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "stephenhalasz",
        "review_rating": "1",
        "review_title": "CHEAP",
        "review_detailed_main": "Take the plot for Aliens, then add the monsters from Resident Evil. This was such a cheap knockoff I couldn't even finish the film."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jpickettiii",
        "review_rating": "5",
        "review_title": "Lacks monsters/demons 😢",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "gazzalodi",
        "review_rating": "1",
        "review_title": "What was the budget? A box of twinkies?",
        "review_detailed_main": "When the captain grabbed the escape hatch handles to turn them and the whole thing bent in his hands it was obvious this was going to be a cheap piece of crap movie. I think the studio seems to have forgotten that most people these days know how small military units are supposed to move. Did they even have a military advisor on set? The actors stumble around like a bunch of drunk college kids, flagging each other with their weapons, tripping over their own feet. If this is the stuff they left in the movie, how bad was the stuff cut out I wonder. Watching them go down the first ladder was cringe inducing. Did they even rehearse the scene? It was obvious the actors had no idea what they were doing as they tried to figure out what to do with their props while they climbed. It has nothing to do with the game Doom either.\n\nAVOID THIS MOVIE!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "patrickbivona",
        "review_rating": "3",
        "review_title": "What a waste...zombies?",
        "review_detailed_main": "A bad combination/rip off of Alien and Resident Evil. Bad acting, writing and directing. Don't pay to see this movie, wait until it's free."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "TahsinFaruque",
        "review_rating": "3",
        "review_title": "Barely okay for a Direct-to-Video Movie",
        "review_detailed_main": "For a low budget direct-to-video movie, this isn't actually bad. I could've enjoyed it much more had it a bit more decent acting from the characters. Some cheesy and horrible acting make the tense moment funny. The CG effects aren't that horrible considering the budget, the last CG-filled part is surely better enough than what I imagined. There were a lot of continuity errors, like in one scene you can see the protagonist's hair is wet and in one style, and immediately when she turns her head, it's dry and in a different style. There are tons of errors like this that are easy to spot. The trailer of the film was deceiving. It certainly is much better than that garbage of a trailer. Now onto the main part, as an adaptation of a game, how is it? Well, nope, not good. It is an okay horror film, but the only few related things with the games are the aesthetics. The setup is not even the same as the main game story. You can take it as a side-story, but it still doesn't relate to the game's story at all. Overall, for a direct-to-video movie, yeah it's enjoyable."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "bclivesinme",
        "review_rating": "3",
        "review_title": "\"Clear!\". Its clear, this is bad...",
        "review_detailed_main": "I was unaware that a new doom movie was made but here we are with another doom film. It's \"clear\" and obvious this films had a lot problems but the budget was clearly missing. It feels like the film was plagued with bad acting and bad direction from the get go. Most likely money was funneled and they were left with maybe a $8 mil project."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "toonarly",
        "review_rating": "10",
        "review_title": "Don't listen to the bad reviewers, who have never played the original game",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Brainpiercing",
        "review_rating": "6",
        "review_title": "Not nearly as bad as most of the reviews here make it seem! Actually entertaining and respectful of source material!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "goochncash",
        "review_rating": "3",
        "review_title": "WITW",
        "review_detailed_main": "What happened to the ending for the love cinema. If you like shoot em up zombie movies with terrible endings , enjoy..."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "douglasjeffreys-688-703001",
        "review_rating": "1",
        "review_title": "Such Potential, Such a Waste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jonesie123",
        "review_rating": "5",
        "review_title": "Not bad given the budget",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dankochenderfer",
        "review_rating": "2",
        "review_title": "Steaming pile of garbage",
        "review_detailed_main": "D list actors. Plot points stolen from Stargate. Asinine dialogue. What more could one want in a movie?... No one should waste 90 minutes of their life watching this horrid \"film\". But on the bright side, it makes the Doom film with the Rock look good in comparison."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mistynray",
        "review_rating": "5",
        "review_title": "Not a bad movie...",
        "review_detailed_main": "I liked-ish the first DOOM, watched it several times through the years. I ran across this title today and watched it. It was different... it kept me entertained and was worth the 96min. They done well for the little they spent to make it"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tilmonhocutt",
        "review_rating": "2",
        "review_title": "Piss poor Doom movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "doomslayer-74139",
        "review_rating": "1",
        "review_title": "Who looked at this and said \"yeah.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jorlando-06720",
        "review_rating": "1",
        "review_title": "New Drinking Game",
        "review_detailed_main": "Take a shot every time someone says \"clear\"\n\nYou'll be legless before you know it"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "msn6649",
        "review_rating": "10",
        "review_title": "Enjoyable Movie",
        "review_detailed_main": "All the Doom fanboys are marking this movie down. How ridiculous, this was a great movie and it did it's job of providing escapism for an hour and a half. Watch for your self is my motto, can't go by reviews all the time because I usually prove them wrong. Give it a go and don't join the stupid band wagon going on here."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "lutzifer-o666",
        "review_rating": "6",
        "review_title": "I actually quite enjoyed this for what it is",
        "review_detailed_main": "In comparison to the older doom movie, this is way more doomy. Still, just a mindless b-movie, but when you can overlook, that they did not have much money to produce this, it actually looks and feels like a cheesy story from a 90ies fps game and is fun to watch."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "packor",
        "review_rating": "1",
        "review_title": "I should give Doom(2005) 2 stars",
        "review_detailed_main": "Years ago, I rated Doom with 1 star, and this is just a little worse. Unfortunately, I can't go any lower than 1.\n\nThey really took sci-fi literally, and didn't bother to make anything realistic. Creatures that took 10 rifle shots die to 4 pistol shots; a pistol that couldn't have been high caliber since it fired about 20 bullets. Fireballs don't burn people. They just get bloody everywhere. All the bodies except for the special cases are intact, with blood smeared on them. A traumatized woman that wouldn't even speak somehow becomes calm and coherent as soon as she meets up with another character that she's not even close to.\n\nThe story feels like Rogue One, where nothing substancial actually happens, and it ends in a direction which is supposed to be a cliffhanger, but you know wat actually happens in the canon universe. The ending is just horrible, and the rest of the movie basically shows things being killed.\n\nI think some parts of the movie tried to have twist, mystery, or sci-fi factor. All of it felt like whatever. There were some stunts which they expected to pass for action. It didn't. The MC was more lucky than John Wick, and pretty much lacked as much in skill, as in they pretty much survived by blind luck, or just so they could get to that terrible ending."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "cravnsn",
        "review_rating": "1",
        "review_title": "Horrible in every sense",
        "review_detailed_main": "Take every element that goes into making a movie - Script, acting, directing, costume, sets...etal. and this one does all of them in the worst way possible. One of the worst all time films I have ever seen, and I've seen some really bad ones. Having a root canal without pain killers would be more desirable."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dejhaki",
        "review_rating": "1",
        "review_title": "Primary School Student Could Do Better",
        "review_detailed_main": "Here is the film in bullet points:\nThey ruined the story of Doom video game - unbelievably!\nPlot is completely childish!\nActing is poor!\nThe film is a real PC film!\nLast but not least, in this film like many others, you will see the portrayal of man and women in Hollywood: Men are stupid, coward and cannot look after themselves. Women, on the other hand, are independent, strong, intelligent and never make a mistake!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dremond82",
        "review_rating": "3",
        "review_title": "Plastic-covered ARs/AKs",
        "review_detailed_main": "To give you an idea of how this movie is put together, the \"futuristic\" battle rifles in this movie are just regular AR-15s and AK-47s with black plastic glued around them. This movie looks like a low-budget Sci-Fy Channel original from fifteen years ago, like Battlestar Galactica or whatever garbage was on TV back then. Cheap plastic sets, plastic-covered weapons, plastic body armor, no-name actors and cheesy lines. Skip this one and pull out the old original Doom with The Rock and have a much more enjoyable film experience."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "sinisha-52103",
        "review_rating": "1",
        "review_title": "My gaming experience is ruined.",
        "review_detailed_main": "My gaming experience is ruined. Movie is 0/10. UAC is the only thing that says \"Doom\""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "elliothetzer-58255",
        "review_rating": "5",
        "review_title": "This is not great but nowhere near as horrible as other reviews make it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "disturbedtacos",
        "review_rating": "2",
        "review_title": "Not DOOM",
        "review_detailed_main": "This makes the original movie look like Saving Private Ryan. It's just a generic zombie movie with a space theme and takes away the gore that makes those kinds of movies enjoyable. The BFG doesnt even blow anything up, it just pushing them back. Action is boring. Acting is mid grade B movie schlock. Guns look like cheap plastic toys. The villain's motive is as cliche as you can possibly get, you've seen it done a million times. All in all it's just a bad movie. I really dont understand why iD software would agree to have a , low budget, straight to video release of their biggest title even be made. This doesnt help the franchise, of anything it hurts it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "charlesjdillon",
        "review_rating": "1",
        "review_title": "This is not DOOM",
        "review_detailed_main": "I am not sure what this is. This is not DOOM. Looks like someone wrote a zombie monster space movie and filled in things with DOOM names.\n\nAs a long time fan of DOOM I have no words really to explain how bad this is."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "laurac-60143",
        "review_rating": "10",
        "review_title": "Why all the haters??",
        "review_detailed_main": "I gave this a 10 because there are way too many low ratings that are undeserved. This movie was better than the reviews, I normally don't even pay attention to these types, but this version kept me interested. If you understand that it is 1. Low budget and 2. Unknown actors, then perhaps you will enjoy it. Too many haters on here. Decent rendition, and not a waste of time to watch."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "lightingman-49653",
        "review_rating": "7",
        "review_title": "If you just want shooting and monsters it's enjoyable.",
        "review_detailed_main": "I actually thought it was pretty good.\n\nThis is coming from someone who thinks Star Trek Picard is idiotic.\n\nI guess I just go in with low expectations these days.\n\nI felt it stayed pretty close to the source material. Can't really see what the other reviewers are complaining about."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "garronsdad",
        "review_rating": "3",
        "review_title": "WTH",
        "review_detailed_main": "Making a movie based on the original Doom game shouldn't be hard! Not much of a plot just kick ass monster, guns & a lot of killing. Not attack of the Blue Man group!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "redn_path01",
        "review_rating": "2",
        "review_title": "Oof",
        "review_detailed_main": "What holds this movie back is not the lack of funding, which is evident in many places - lots of re-used sets that all have to be kept as un-gritty as possible so they can be used for other places of the facility, overall looking quite painted plywood-like, bad techy bits in nonsensical arrangements and hectic, claustrophobic camera cuts that try to make the place seem larger than it is.\n\nThat's forgivable if the writing can make up for it. Sadly it can't. At all. Did you think the last Doom game had a thin plot? It is a masterpiece compared to this.\n\nThe dialogues are on the level of what hollywood generally has produced in the past years - filled with cliches, sexual references that are out of place and plain dumb, and so much idiocy that you seriously have to wonder why the humanity of the future has not yet blown itself up. Rational thinking? What's that, can you eat it? Do they hire scriptwriters out of pre-school?\n\nClearly the only qualification for any and all jobs - be it scientist, engineer, pilot or military personnel - is that one is able to yell incoherent things in an angry way, and try really hard to get into someone's pants. Oh and consume alcohol of course.\n\nI've given it two stars because the exterior scenes of the ship are decenly done and of notably higher quality than the rest of the VFX shots. That still does not make this a watchable movie. If you must, fast-forward through it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "wrektrobot",
        "review_rating": "3",
        "review_title": "I've seen Gacha Videos Better than This",
        "review_detailed_main": "CGI looks like some highschool kid that just picked up Adobe AE. The writing was terrible. But hey at least we've got another strong female lead for dem Twitter likes."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "befan-23076",
        "review_rating": "1",
        "review_title": "Watched it out of boredom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "lemonreelz_drive-in",
        "review_rating": "",
        "review_title": "Why...just why...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Patient444",
        "review_rating": "3",
        "review_title": "Shaaame. Shame, shame.",
        "review_detailed_main": "Well I think it was almost as good as the first, the only problem here being that it appeared unannounced, no A actors and let's not forget that the first one was no good either. A straight forward movie, I guess somewhat linked to the game and that is about it.\n\nWill not recommend it, it has nothing to show for, brings nothing new, tries nothing new, it's as bland as it possibly can be, even for fans of the first movie or of the game, it will fail to bring any kind of joy. Simply put, a movie that does not deliver.\n\nCheers!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "granicd",
        "review_rating": "5",
        "review_title": "Getting closer but still no cigar...",
        "review_detailed_main": "They got closer to original but still not real deal. For what it is -Its a a passable straight to dvd movie.It seems to me like they are testing the water for a full blown hell and demons movie."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "minimal-tech",
        "review_rating": "1",
        "review_title": "My first review on IMDB ever",
        "review_detailed_main": "This is literally the worst movie I ever saw. Don't waste your time and money on it. Doesn't matter if it's \"cheap\" or not, it's absolut waste of time. P.S. burn all copies, bury them and fill concrete over"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kaineo",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "bgbrunocom",
        "review_rating": "10",
        "review_title": "doom in the right way",
        "review_detailed_main": "I think creator of DOOM game have to be thrilled of this creation - it's dark, it's simple, and capture another view of doom, and open the door to many sequels. If you know DOOM game from beginning and everything around that, that this is the right way. Thx."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "r-e-feldbauer",
        "review_rating": "6",
        "review_title": "Bad and worse",
        "review_detailed_main": "It opens like a bad soft core open film and then gets worse. The one guy says he's. gone through everyone's stuff,\" like a perv would.\n\nPeople need to stop making crap D00M films. It's ruining the greatness of D00M."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "athies",
        "review_rating": "2",
        "review_title": "Ogden Gavanaki sounds like the name of someone who would produce this...",
        "review_detailed_main": "The last movie I watched of 2019 was terrible. Why not start 2020 with what I expect to be a terrible movie.\n\nHow much did that actress get to stand so still in the background with her hands clasped?\n\nThat is some shoulder acting.\n\nJoan Dark took 5 seconds to come up with.\n\nI can tell how bad this movie will be based on how many comments I have already. Including this one.\n\nThe doctor has poor shoulder acting skills.\n\nClearly another Aliens take.\n\nIt's a big hunt.\n\nI do not approve of their movements. Standing in the middle of opening doors. Not checking corners. Just terrible.\n\nI'm gonna assume that huge backpack is for ammo.\n\nYou didn't try to tell them anything.\n\nThat's right. Spread out more.\n\nYou're ultra nightmare. That sounds pretty bad.\n\nAfter all these movies space marines really ought to start wearing mouth shields to keep the goop out.\n\n7.5 thousand years old is your proof?\n\nDidn't I see the chaplain in Saw?\n\nGenerating a chest fireball must make your extremities cold.\n\nTime for a speed run.\n\nNow we're down to nearly real time left.\n\nThe BFG.\n\nHigh tech future elevators still use cables? Probably for safety backup.\n\nLet of some steam Bennet."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "darkdementress",
        "review_rating": "3",
        "review_title": "Pretty standard low budget film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mmscovil",
        "review_rating": "2",
        "review_title": "Doom fans will be disappointed.",
        "review_detailed_main": "Even if you're a fan of Doom, there is no entertainment to be found here. But if you like watching indistinguishable characters without personalities wandering around sterile hallways, shooting rubber suits and blue people with plastic guns for 90 minutes, then you might enjoy this movie. But then again, you could just watch any SyFy Channel original film for free."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "buddah-22642",
        "review_rating": "2",
        "review_title": "DOOM fan's Disappointment",
        "review_detailed_main": "The 1st DOOM movie was awesome. This installment was the exact opposite. So the story and setting was \"doomey\" but the \"tuff guy's\". Well, was so poorly cast and acted I cannot put into words just how bad it was. The LT in real life could pull the skin off a Custard. The Aussie Special Forces guy a coward, yeah right. All the chicks fort like Segal but it was so full of BS it was hard to watch. Life is too short to watch rubbish like this."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "haydenluxford",
        "review_rating": "3",
        "review_title": "Overwhelming disappointment. Someone needs to protect the Doom IP",
        "review_detailed_main": "Note: Game developers had nothing to do with this film. Blatantly obvious.\n\nIf you do a video game movie, you _must_ work with some creative element from the video games development otherwise you're misfiring every note."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Roddingham",
        "review_rating": "2",
        "review_title": "Not sure why it was remade or why to watch",
        "review_detailed_main": "I'm the perfect demographic for a Doom movie. Middle aged male who has played the games on multiple platforms. However, this movie was not made for me. It was made for SJWs who by the large don't play Doom and most likely have never heard of it. I could go into the casting, acting, writing, sfx, etc. but, what's the point, they were all bad. So, I wouldn't recommend this movie for anyone."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mrouttt",
        "review_rating": "2",
        "review_title": "Believe it or not, it's worse than the 2005 Doom",
        "review_detailed_main": "The previous one was already in the abyss of what worse could be fuse with cinematography and video games.\n\nSome effects are quiet good. But the movie ends where it should have started.\n\nThe only good thing is that it's not 2 hours long."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "wyellen",
        "review_rating": "3",
        "review_title": "Not as bad many reviewed it.",
        "review_detailed_main": "It's watchable. Sure, you've got supernatural horror and SF mixed together. Sure, you have a politically correct female Marine who can beat up anyone, including supercharged zombies, and even demons, even though she's just an ordinary looking woman you see on the street any time of the day that can often use some help with heavy objects and reaching things on the top shelf. The space Marines as usual fail to take sufficient ammo for the situation and professionalism is sparse. And truth be told, they could have saved themselves a lot of grief using drones technology that exists today. But, the special effects aren't half bad and there's a lot of shooting."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "andiilie",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "I hope they are gona do DOOM: Annihilation 2 😁 And those who say that this movie is awful, they never saw an awful movie 🤣🤣🤣"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kezzie-28061",
        "review_rating": "6",
        "review_title": "Not as bad as people make out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "movie_ape_charlie",
        "review_rating": "1",
        "review_title": "What on earth were they thinking?",
        "review_detailed_main": "Some of the worst tropes and everything is sub par compared to the last Doom offering. What the hell is going on in cinema? I just can't even understand how this stuff gets greenlit and all that money spent, no, squandered on literally crap.\n\nThere is not a single redeemable thing in this film. Nothing."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tguedespereira",
        "review_rating": "1",
        "review_title": "why not follow the games?",
        "review_detailed_main": "In the games it is a badass male protagonist. Why change? Every video game movie guys change everything. I think The budget isnt a big problem. The problem is the diretor chance all the main idea."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jackgruber-58374",
        "review_rating": "1",
        "review_title": "A complete failure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "corytrevorson",
        "review_rating": "2",
        "review_title": "Doom: SJW Edition",
        "review_detailed_main": "Once you're introduced to the cast of characters, you're ready to turn it off. Doomguy is a woman here for some reason when, in the actual game, the protagonist is literally named \"Doomguy\". The supporting cast is diverse to the point of madness and none of them are likable. I understand that diversity is important, but blatantly shoe-horning it in there isn't good for anyone."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "talyn-28700",
        "review_rating": "",
        "review_title": "This is the best movie of the year... Oh wait I thought we were talking about Joker",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Tweetienator",
        "review_rating": "3",
        "review_title": "Does Not Rock",
        "review_detailed_main": "The Doom movie from 2005 with \"The Rock\" Dwayne Johnson was solid, but the rather low budget showed here and there. In comparsion, Doom: Annihilation is not a total fail but it is also in no way an improvement to the version with Mr. Johnson, but rather a movie with below average quality (compared to other movies of the horror sci-fi genre).\n\nTo me Doom: Annihilation is rather a waste of a fine horror sci-fi franchise with a lot of potential. The low budget of the movie shows, and there is no real improvement neither on the plot or acting, nor regarding setting or the special effects department. Watching, my hope for a good or at least solid Doom movie was very fast destroyed.\n\nThe movie with \"The Rock\" I will watch some day again, Doom: Annihilation I won't. The only question left: why someone even bothered to make Doom: Annihilation!?"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "mariodj74",
        "review_rating": "1",
        "review_title": "Is this a joke ?!",
        "review_detailed_main": "What is this movie ?? worst movie ever terrible acting and cartoon environment looks like they added color with paint. After watching 30 minutes of the movie couldnt tell if i was watching a zombie or Doom. garbage i dont know how bethesda allowed this movie to be made SHAME"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "johncomo-3",
        "review_rating": "1",
        "review_title": "SORRY, SORRY, SORRY",
        "review_detailed_main": "Words cannot describe words that are not yet figured out on man's imagination on the audacity to create such a flick...I mean...is there a gas pump nearby so I can burn this thing to flames...oof, I got a headache just talking about it...OMG, the end was ......you see where I want to go..."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Martinito_08183",
        "review_rating": "3",
        "review_title": "It wasn't as bad as i thought it would be, but it's still not good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "linuxuser0626",
        "review_rating": "8",
        "review_title": "More faithful than the \"rocks\" doom",
        "review_detailed_main": "I understand that the Dwayne Johnson doom was based on doom 3 but aside from a few coloring issues this was a great movie. Give this team enough money to make a sequel of equal or better quality because it fits with the games mythos. The sequel could be episode 2 and 3 of the freeware version of the original game. I openly admit a few cheesy lines but overall a great flick."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "bombersflyup",
        "review_rating": "6",
        "review_title": "Not bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "michaelgarykelley1994",
        "review_rating": "5",
        "review_title": "Not As Bad As People Say",
        "review_detailed_main": "I love Doom. All the games. The first movie. But this could've been a lot better, honestly.\n\nI think it's unfairly attacked, but I understand and agree with many of those attacks, like Doomguy-once again-not being in the movie. By now, he should've been. But it's hard to put Doomguy in the forefront of a sci-fi horror mystery film, and I completely understand it. Many folks are saying the female lead is an SJW thing, but I'd have to disagree. It doesn't come across like that to me, at all, but the movie definitely doesn't feel any closer to the games, as an adaptation. I get why fans would be mad. At least the first film adaptation had tons of gore and cool moments. It's very stylish, which is a plus. This film doesn't feel anywhere as cheap as most low-budget sci-fi flicks, but it certainly feels like a straight-to-DVD flick (which it is lol).\n\nI will say this: the last ten minutes or so were awesome, and I wish the budget allowed for way more of that. THAT was what cinematic Doom's film adaptation should be more like, by the time it ends.\n\nIn the end, I'd say the film doesn't drop the ball, but it certainly struggles to hold it still.\n\nIt's a big, dumb horror science movie, and it doesn't need intelligence (just like the games)."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "shaundillon67-609-187474",
        "review_rating": "1",
        "review_title": "Can films get any worse",
        "review_detailed_main": "Who in their right mind makes a movie this bad, do the actors feel any shame at all knowing that the general public will see this garbage, I truly recommend that you push this aside with the biggest barge pole you can find. No storyline, no fx, no decent dialogue and I've seen better acting at a chimps tea party, no wonder there are so many struggling actors if this is the best of their ability"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "askinga-11597",
        "review_rating": "2",
        "review_title": "Og doom was better",
        "review_detailed_main": "The original Doom even though that flopped to is better then this I was excited for this but it's just really bad"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "C0NSUM0",
        "review_rating": "1",
        "review_title": "I like minions",
        "review_detailed_main": "I really love minions. Every day when I was little I would watch Despicable Me, Minions, and Despicable Me 2. My house is plastered with minion wallpaper, my carpet is just a small child's rug with a minion on it. All of my clothes are blue and yellow. My shirts are all minion merchandise. I really love minions."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "damionjb_71",
        "review_rating": "",
        "review_title": "It sucked",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "iviovi",
        "review_rating": "1",
        "review_title": "this movie sucks",
        "review_detailed_main": "What a sh#t loald of f@ck what were they thinking with this one the effects are bad the caracters are trash this makes the 2005 look like a master piece this is the worst movie i have ever seen women belong in the kitchen not in starting roles in movies everything in this movie suck evertying is horrible"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "staunton-gary",
        "review_rating": "5",
        "review_title": "Aliens",
        "review_detailed_main": "I'm sure that Amy Manson (Lieutenant Joan Dark) based her character on Sigourney Weaver's Ripley from the Aliens movie, not that it's a bad thing, but it was a style that worked in the 70's-80's and didn't really work that well on this movie. Luke Allen-Gale, or should I say Daniel Jackson, did a reasonable job portraying that character, shame that it wasn't Stargate, he may have pulled it off. Overall, I would say that it just below average as some of the acting was a bit dubious. I would recommend it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "elsidaliaj",
        "review_rating": "5",
        "review_title": "Skip to 1:25 haha",
        "review_detailed_main": "Do yourself a favor skip to 1:25 and make it a short 10m film. That's what I did I didn't watch the first 1hr 25m lolol!\n\nEnjoy!"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "antti-makinen",
        "review_rating": "1",
        "review_title": "I want to drill a hole in my skull now",
        "review_detailed_main": "Okay, let's get the obvious out of the way. I made a conscious decision to view a Doom movie. I saw the previous one, I love many bad movies, and I approached this one knowing it would not be a deep and intellectual piece of art.\n\nThat said, I was still surprised. Normally I can suffer through even the worst movies because why the hell not, but about 40-45 minutes into this one, I just couldn't go on.\n\nThe script is basically nonexistent, the dialogue is so ridiculous it made my testes ache, and every single key character was like a cardboard cutout of what a dead skunk smells like.\n\nA space marine unit with a drunk pilot landing at a top secret military project site on one of the moons of Mars failing to communicate with each other or even hold their weapons in a way that doesn't look like elementary school kids playing pretend with sticks while dragging an unarmed civilian among them? Check. Cheesy nods to id software like exploding barrels and chainsaws (honestly though, I stopped watching before barrels exploded or chainsaws were used) with a corpse named Blazkowicz and a zombified scientist named Carmack thrown in? Check. Add crappy sound stage sets, sub-par visual effects, etc, and call it a day.\n\nMy head has a demon in it now. Please make it stop.\n\nThis just might be the worst movie I've ever attempted to see."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dragos_matei_serban",
        "review_rating": "10",
        "review_title": "What's there to hate about this film? Humanity has gone mad, this is a flawless piece of sci-fi I have rarely seen since 1979's Alien",
        "review_detailed_main": "Everything is good about this film. The script, the feeling, the acting (Dr Betruger was fantastically played).\n\nI am seriously opposed to anything woke and understand that some people disliked having the male Doomguy replaced with a female counterpart, but I didn't care. I just enjoyed the story.\n\nThe first really put to the test to the limit heroine since Ellen Ripley. She literally went into the place I had been dying to explore the entire Doom franchise- beyond the alien world- Hell. We hot some answers- who they are, what do they want.\n\nThis beats Event Horizon. And that movie was a 10/10.\n\nHow the bandwagon can get together and downvote this movie to oblivion is beyond me\n\nI watch every movie coming out since the 1970s, I have seen more than 10.000, NOTHING American is even half decent anymore. The only good movies being made anymore come from Asia (Parasyte), Italy (They Call Me Jeeg), Hungary (Kut, Kills on Wheels). People today downvote the only ones that are good!!! Like this one.\n\nRarely a western movie is even decent (this year I just liked the new Hercule Poirot Death on the Nile)\n\nHow is it possible that this masterpiece is rated 3, something on imdb?? Has the entire world.gone mad?"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Amazing_Wizard",
        "review_rating": "6",
        "review_title": "Cringy 1st 20mins, but then gets better and eventually good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "sverrehu",
        "review_rating": "4",
        "review_title": "Not unwatchable",
        "review_detailed_main": "This movie is not entirely bad, if you love Doom.\n\nSome actors are doing bad, but the main actors are doing decent. They all should have had more training in how to move like marines, though: The reason to run with bent legs is not just to be smaller, but to be able to keep the upper body steady to have a good aim. Running around with bent legs and jumping firearms is not the way to go.\n\nThe plot and the dialog is not at all good. This looks like a medium-budget film with a low-budget writing crew. Shame on the producers for that.\n\nIf you thought the first Doom movie was bad, there is no reason to see this one. I loved the first, and give this one a pass with mediocre grade.\n\nThere's a reference to John Carmack in this movie (as in the first). If you don't know who he is, this movie is probably not for you."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jackcave-78603",
        "review_rating": "1",
        "review_title": "Don't Bother",
        "review_detailed_main": "Feels like it was filmed in a theme park set, put its own unappealing spin on demon-design and suffered from a very heavy dose of laughable girl-power, lacked any bad/cheap-movie charm and lacked Doomguy. Was barely able to keep attention and my eyes barely stopped rolling. At least the 2005 film, though bad, was a lot more fun."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "carlodegraaff",
        "review_rating": "2",
        "review_title": "Bad sequel",
        "review_detailed_main": "They must not have been able to get ANY well named actors to star in the sequel and the quality of this movie showed it. All I can say is ABSOLUTE crap"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "theredbaron2007",
        "review_rating": "5",
        "review_title": "It's a dumb action movie based on a video game",
        "review_detailed_main": "There's not enough metal in the soundtrack.\n\nTheir \"combat helmets\" are literally just bicycle helmets with plastic moldings attached.\n\nUm I'm watching this movie for the second time. Maybe third. It's better than a lot of other stuff on Netflix.\n\nDoesn't mean it's good.\n\nI'm not an existing fan of the doom series, but this movie makes me want to play it. And isn't that kinda the point? Encourage people to look into the source material?\n\nYeahhhh not a great movie, especially compared to the legacy of the Doom games.\n\nIt is dumb, has action, and is entertaining me.\n\nBut I'm not taking it seriously.\n\nI'd love to see a faithful telling of the story of doom guy and his pet bunny.\n\nFull of like hardcore metal riffs, hell bring back the pov angle from the rock movie or hardcore Henry, and just make the bloodiest goriest first person shooter movie ever.\n\nLess story, more killing. Pull a star wars, but with the video games not books to fill in the holes. If you care to know. But like if you give us 90 minutes of like doom gameplay on screen, I'd watch it.\n\nNot remotely surprised by all the 1 stars."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "adamplandy",
        "review_rating": "1",
        "review_title": "Horror themed Red Dwarf - but with worse effects",
        "review_detailed_main": "With made-for-tv visual effects, dialogue as if this was the writer's first day being human, exploring the use of language - this film scores somewhere between stepping in dog mess barefoot and dropping toast butter side down. This movie is a tragic excuse of an IP tie-in. Prepare yourself for relentless horror tropes regurgitated one after the other. Also, no Doom-Guy, replaced by a lead who is as intimidating as a fart in the wind. Want a Doom Girl - cast Gkna Carano; she'd nail it. Dumpster Hell Fire movie."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "damon-47115",
        "review_rating": "5",
        "review_title": "For people who rated low to this movie",
        "review_detailed_main": "You people who say the rock one was better must not have thought before saying that at least this movie is about demons and some sort of hell like the doom games. The rock one was aliens on mars and had nothing and i mean nothing to do with doom in the slightest at least this one is trying. This one at least has demons and hell in it and is trying to input doom into it were the rock one didnt even try to include any element of doom into it. So id say as a personal player of doom and reviewer this one is as close as well get to doom unlike the 2005 version which had nothing to do with doom in the slightest."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "davidmball",
        "review_rating": "1",
        "review_title": "I tried, I really did.",
        "review_detailed_main": "I really wanted to believe the C-rank reviews while watching this but wow. It's almost impressive how awful this movie is. They start losing people and they're still just as blase about it as when they got there. The acting is garbage and the sets look like something from the 90's but in a bad way. Anyone who can stomach this and say it was decent is used to eating actual feces."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dargo888",
        "review_rating": "2",
        "review_title": "Worse Than Doom 2005!",
        "review_detailed_main": "Holy crap is this movie bad. There are so many things wrong with it that I cannot and will not waste my time mentioning as it will take all day to type it all out. The only reason I give it a 2 and not a 1 is because the budget of effects were decent for what they had to work with. Other than, this belongs in the dumpster fire. Congratulations to the director; you get an award for screwing up a super easy movie concept like Doom and somehow making it 5x worse than the previous title while trying to be serious."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "germangunna",
        "review_rating": "10",
        "review_title": "B-film Perfection",
        "review_detailed_main": "Idk why everyone is so negative abt this movie, it has good effects, great cast, and a good storyline. Overall 9.5/10, but there isnt an option for that."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kwenchow",
        "review_rating": "7",
        "review_title": "The action surprisingly intense, bloody gore and satisfy! A must watch horror movie! Bravo!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "katusch",
        "review_rating": "4",
        "review_title": "meh",
        "review_detailed_main": "The only acceptable part in this movie was the computer animated final scene. Why would you make a doom 2 without any know actors when you had The Rock in the first one? And seriously, didn't they have 500 more bucks to get a real looking BFG instead of that plastic watergun?"
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "kwithyco",
        "review_rating": "2",
        "review_title": "I Can't Believe It's Not Canadian...",
        "review_detailed_main": "...Or SYFY Channel. This was actually made in the US. But bad enough not to be. I really don't understand why this film was even made."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Amthermandes",
        "review_rating": "4",
        "review_title": "I've seen worse",
        "review_detailed_main": "While it's better than the current 3.6 rating would suggest, it certainly falls short of anything special. It takes the general theme of \"Starship Troopers,\" and fuses it with all the crappy parts of the \"Resident Evil\" series (which is basically everything after the first movie), and tweaks it with parts of \"Event Horizon\" and the video game series \"Dead Space\", and still manages to moderately disappoint.\n\nThe \"Doom\" game series has a reputation of being extremely violent, suspenseful, gory, and scary as hell. This movie does not represent any of that very well. It's well made considering the budget and everything else, but if you're a fan of the game series and the first movie, AND a fan of indie B horror movies, you might be part of a small group of people who'd actually enjoy the movie.\n\nThe acting is not good, but I've seen worse in blockbusters. The special effects are practical, for the most part, which earns a bit of respect. Some parts are genuinely creepy, and there are some direct references to the game series that are pretty cool. I like that the computer's name is \"Daisy\", an obvious reference to \"2001: A Space Odyssey\". But the writing is trash, the characters are cliche, the monsters aren't all that intimidating, and overall it's not scary at all. Some dudes in alien/demon costumes ain't gonna save this one. And it's not even that gory, so the gore hounds wouldn't feel satisfied at all.\n\nFun if you're with friends, and drunk or high probably, but not really worth it otherwise. Good try though, folks."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "Optophobic",
        "review_rating": "4",
        "review_title": "Mediocre At Its Best Moments",
        "review_detailed_main": "This is a cliché filled, generic film hoping to make a few extra dollars off of franchise name recognition. It does not feel at all like some agenda driven project by \"the Left\" but rather a poorly planned idea by someone who thought the Resident Evil film franchise is a series of masterpieces.\n\nThe writing is impossible for the actors to elevate which to some probably make the acting horrible. It feels written by someone who learned to speak English by watching Roger Corman movies. But there is really only so much the actors can do with the material given. I believe this is a first time director, at least it feels that way.\n\nThe sets are fine, but not always lit well giving some of the facades an extremely phony appearance. The special visual effects are adequate to the caliber of the rest of the movie. The practical effects are fine. It was nice to see practical blood (sometimes).\n\nThis movie truly feels like a Sci-Fi channel original film that everyone involved thought would be a theatrical release (except for the producers). This film doesn't really fit into the Doom video game lore. It works almost better as a Ghosts of Mars soft-reboot or RE: In Space.\n\nIt isn't as bad as most of the reviews make it out to be. But it still isn't good. And it doesn't quite cross that line of being so bad it's good either. Just mediocre at best.\n\nIt is currently on Netflix (Jan 2020) if you feel the need to watch it. Don't spend extra money on it."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "themythbustertmb",
        "review_rating": "1",
        "review_title": "Doom Slayer doesn't approve of this movie",
        "review_detailed_main": "Bad. Worst. The doom Slayer is on the hunt to kill this movie."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "dreamwalker-88-909603",
        "review_rating": "4",
        "review_title": "Just for the sentimental value for fans of the old computer game",
        "review_detailed_main": "Mix the scrips from the first movie with some Alien and then forget to hire good monster make-up artists or CGI editors .. and you will end up with this \"sequel\" to the Dwayne Jonson movie from 2005.\n\nSame kind of story: special team is sent to a far away place to investigate mysterious silence in communication.\n\nThe only thing that this movie did put in some effort in (imho) is the tactical movements of the soldiers. But then again, how hard can it be to navigate to some cargo containers that are light up in yellow, futuristic neon light?\n\nI was going to give this movie a 1/10, just as an honest rating of this B-movie. But then I did enjoy seeing a female protagonist and hero that was neither skinny nor excessivly muscular. She totally out acted her male counterparts and I was almost getting a little Alicia Vikander vibes from her. Hopefully she'll be getting some better scripts in the future, to help support her efforts in front of the camera.\n\nAlso, not all scenery was totally bad - even on a minimalistic budget - but sadly you never get the all anticipated POV storytelling anywhere in this movie. Most likely also due to the small budget.\n\nBut at least, this is a little enjoyable for all of us that have spent hours and days with the game back in the days. Remembering that the graphics in the first parts of this game-universe, would make Minecraft look realistic and multidimensional. =D."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "shyspyred",
        "review_rating": "3",
        "review_title": "This is an insult to the franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "tplin",
        "review_rating": "4",
        "review_title": "There's a decent adaptation in this mess",
        "review_detailed_main": "Let me start by saying you have to go into a movie like this with low expectations. Afterall, the track record for video game adaptations are pretty bad.\n\nThat said, the story of this version of Doom is actually pretty good. And up until the end and a few annoying expendable characters, it was pretty well executed. First of all, we actually have demons, zombies and a hint at Hell...unlike the complete absence of the Hell concept with the last one. It was as if the writers actually played the game and tried to respect it.\n\nOf course the budget constraints were obvious. The throw away characters were horribly acted, but the main characters delivered a passable performance. I'm not a huge fan of casting a slender female in the title role for a character that has been known as \"Doom Guy.\" The CGI for the gates are pretty laughable, but that's kind of expected."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "velcrofiredog",
        "review_rating": "9",
        "review_title": "What's with the hate?",
        "review_detailed_main": "In comparison to the Rock edition this is the Mona Lisa, it's not Amazing but c'mon it was fun, funny and had great action and a couple good jump scares better than all these lGBLT sponsored garbage out today. If you want an amazing film go see Joker if you want a fun action/horror this will be great..."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "ismailcemkaynak",
        "review_rating": "7",
        "review_title": "Good movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "BustedHalo",
        "review_rating": "4",
        "review_title": "Ugh, another strong woman saves the day movie without the strong woman.",
        "review_detailed_main": "Story-wise, it's okay sci-fi. Not a whole lot of references to the Doom video game it's based on. There are only a handful of monsters from the video game rosters that make an appearance in the movie.\n\nBut the biggest crime is casting puny waif-like actresses in the roles of \"special ops marines\". They have no visible muscle tone AT ALL and look like the type of women glued to their smartphone all day. So, these are supposed to be marines, huh? I guess the budget was too low to hire real bad*ss females. Sad."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "jcaternolo",
        "review_rating": "3",
        "review_title": "The only reason to give this movie a Chance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "andyajoflaherty",
        "review_rating": "5",
        "review_title": "Low budget, average game adaptation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "alexkzapf",
        "review_rating": "4",
        "review_title": "Good looking set pieces. Tv level cgi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "darter2003",
        "review_rating": "2",
        "review_title": "Horrible and yet I watched it all",
        "review_detailed_main": "This is clearly a power move to women's rights and they are just as strong as men. Kill all minorities, first let the males be weak, female is the only way to your survival. Maybe directors should play the game first before making a movie about a video game."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "borgiesblog",
        "review_rating": "3",
        "review_title": "Doom: Annihilation (Of My Brain Cells)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "matthewpeevy",
        "review_rating": "2",
        "review_title": "Really? You named her Joan Dark?! (Perfect Dark rip off)",
        "review_detailed_main": "I'm 2 minutes into this movie, and the lead character is a female named Joan Dark. A total rip off from Joanna Dark in the Perfect Dark game-a completely different game title! Really?? I can tell this is going to be a rough ride, but I'm going to sit here and endure it because it's Doom. But why did they have to green light this low of production quality for such a classic game? Frustrating.."
    },
    {
        "movie_id": "tt8328716",
        "movie_name": "Doom: Annihilation",
        "movie_rating": "3.8",
        "review_username": "negativec07",
        "review_rating": "5",
        "review_title": "Exceed My (Very Low) Expectations",
        "review_detailed_main": "Even as a big fan of the games, and the 2005 film being a guilty pleasure, I went into this with absolutely zero expectations given its almost universally negative reception. Whilst this is by no means a good film, it ended up being surprisingly better than I was expecting. The plot generally follows the games, where scientists on Mars' Phobos moon create a teleporter that unwittingly allows an army (well, 3 or 4) demons through. A small military squad gets sent to investigate, you can guess the rest.\n\nThe effects and cgi aren't too bad considering the very limited budget, but the props and scenery are where the cheapness really shows through. It's very obvious that they only had 1 monster suit, about 5 people playing zombies and 3 sets, which they use multiple times with different lighting. The guns look like they're made of plastic and the uniforms are like something from a paintball game. But despite it's many, many problems, it does at least feel like they tried with what little resources they had. There are a fair few references to the game, some which work and some that feel completely shoehorned in (such as the \"I'm your ultra nightmare\" line). Ultimately though it kept me reasonably entertained for 90 minutes, so can't really ask for more than that."
    }
]