[
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "classicsoncall",
        "review_rating": "8",
        "review_title": "\"When a person grows up, do his dreams become smaller?\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "deg-12",
        "review_rating": "9",
        "review_title": "Life as it is...",
        "review_detailed_main": "This film was a real surprise for me. I only saw one other Turkish film before this one (Vizontele Tuuba). The story may not be all that original but the way it is told is just wonderful. Lot's of humor (we laughed a lot) and real tragedy (we really needed that handkerchief at the end). I love the parts where you get carried away in the little boy's dreams. That surreal view shows us the differences in thinking between an adult and a child. The music is what you can expect from a Turkish film. You either like it or you don't. But it's never overwhelming. I really recommend this movie to everyone. And no, I am not Turkish!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ydurgut",
        "review_rating": "8",
        "review_title": "One of the best Turkish movies ever",
        "review_detailed_main": "The movie starts on the days of military government, which started Sep.12th, 1980, and lasted 3 years (Effects of this action against democracy lasted more than 15 years). A young socialist newspaper writer (Fikret Kuskan) loses his wife on birth of his only son on the very first day of the military action, because he can not find any help for delivery of the child. After 6 years past, the father was desperate to find any jobs on the papers, which are now supporters of the new order, and decides to return his father (Çetin Tekindor)'s home in a small village near Izmir: A house that he has left years ago fighting his father's wills to make him a person that his father would like him to be.\n\nI can not even summarize the rest of the movie, since one should see the movie himself/herself to understand the encounters of two strangers, father and son. One should notice the mother (Humeyra)'s role on the relationship (or non-relationship) of these two different men, and the grandson (Ege Tanman).\n\nIf you have a Mediterrenean blood, Greek, Italian, whatever, you will find many things in this movie. You don't have to be Turk to understand the emotional rivers in this movie. It really touches hearts of the Turkish people."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "snoopx",
        "review_rating": "10",
        "review_title": "An emotional roller-coaster of epic proportions!",
        "review_detailed_main": "Very rarely can you find a movie that can make a person shed tears of sorrow one minute, then laugh out loud the next. This is a heart wrenching tale that will make people look at themselves and how they can better their own family units.\n\nViewers will find that they will relate to one of the many stories within the movie. It's been a long time since a movie has made me feel this type of sadness and sorrow, followed by a warm fuzzy feeling right in my chest. An amazing film, with amazing people. The supporting actors complete what is truly an inspirational film. It has inspired me to be a better father and a better son. Watch this movie."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "aswins",
        "review_rating": "10",
        "review_title": "AWESOME - the word is not enough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ligertigon26",
        "review_rating": "10",
        "review_title": "Haven't seen it? oh watch it already.",
        "review_detailed_main": "I am always in search of great foreign movies.I had never seen a Turkish movie and then I decided to watch The Bandit(1996) and loved it! Without any effort i was able to find this masterpiece. I laughed, cried, loved every single minute of it! I first watched it in 2013 and today decided to watch it again.\n\nI have recommended this movie to many friends and each one of them liked it and each one also cried. I have always loved drama movies but this movie is more than that.\n\nGreat performances from everyone.Simple and Remarkable,a must-see! I will recommend everybody to watch this movie.\n\nThese type of movies are the victory of Cinema."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "denpolites",
        "review_rating": "10",
        "review_title": "A masterpiece that must be seen by everyone!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ethernaldreams",
        "review_rating": "10",
        "review_title": "An Incredible Movie",
        "review_detailed_main": "As I watched that movie, I saw the Turkish relationships in the best way that it could be shown. A very good choice of cast is the most powerful criterion of the success of the movie. Humeyra, the grandmother is a very talented woman in acting. Emotional scenes become more frequent while we see the movie to get to the end. Unfortunate events make the Turkish people get closer to each other. The movie shows that perfectly. Hospitality, love, grief, laughs... Everything is included in this movie. An emotional breakthrough. The movie also points on the elderly reality -now an impossibility- the torture, made by the cops.\n\nBetter to be watched by fathers and sons. Also, crying may occur, don't worry; too many people who watched the movie had the same."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "matrixus-1",
        "review_rating": "10",
        "review_title": "This movie will touch your soul and will not let go!",
        "review_detailed_main": "**** 10 out of 10 for this movie **** One of the best movies ever made worldwide.\n\nI write this review right after seeing this movie because I want to put down the emotions that stir me this second. I must admit that before watching this masterpiece I was a bit skeptical about it being a drama because most dramas I have seen evolve around irrelevant topics - but this movie will change the way you think.\n\nThe story is so heartwarming and real that it will move you far beyond anything you have probably ever experienced before. The actors do such an amazing job that you will sympathize with them and might indulge in some crying even if you are a male.\n\nEven if you don't cry this movie will touch you and will make you think about your own life.\n\nMovies that are able to and make you REFLECT and THINK about yourself, for my taste, are part of the best movies of all time because their messages are delivered in a way so that you will never forget them.\n\nGo see this movie and vote because this is not only the best Turkish movie ever, but one of the best movies ever made."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "melis-5",
        "review_rating": "",
        "review_title": "In case you come across 'Babam ve Oglum'...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "bane_13",
        "review_rating": "7",
        "review_title": "Simple and Remarkable",
        "review_detailed_main": "Anyone who watches \"My father and my son\" will eventually relate the movie to a family relationship they have lived. It is a perfect visualization of what people do because of their ego and what can actually destroy that ego. The movie makes the viewer ask \"what if\" questions about almost everything and the answers will be different for everyone. The acting is definitely remarkable with less experienced characters (including the little kids) putting on a display to remember when aiding patriots of Turkish movie industry. Overall I can say that \"Babam ve Oglum\" is a blending of great acting, wonderful script, and a real life story."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "scanan",
        "review_rating": "10",
        "review_title": "Clever, poignant, brilliant and \"human\"..",
        "review_detailed_main": "A simple story becomes a sad and poignant movie about ordinary people.. Every person I know who had the chance to watch this wonderful movie have cried -especially during the second half.. I applause everyone involved in the production of this magnificent piece of work.. Really brilliant work, presenting some top-notch performances (esp by Humeyra and Cetin Tekindor) and a clever collection of spectacular moments. No special effects, no superhuman strengths no fantastic landscapes.. Just human and the ordinary feelings. I felt some rush to call my mom and dad just after the movie to be sure that they are OK and to make them know once again that I really care about them. This movie makes you think deeper on values that make us human and also etches itself irreversibly to your memory by touching the deepest possible regions of your soul.. Highly recommended; a must-see! Do not forget your tissue papers because you probably will not be able to keep your tears from flowing...\n\nThanks Cagan Irmak, and continue to blow our minds away.."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Yolas",
        "review_rating": "7",
        "review_title": "Amazing movie",
        "review_detailed_main": "I've never really been a fan of Turkish movies.I always thought they weren't good enough, but I knew that some good movies were done in recent years.And I heard everyone talking about this movie, low budget but a great movie they said.I wanted to see it myself, and so i did.\n\nThe movie is really great.It tells us feelings, family, joy, laughter, sorrow, grief...It tells us life, but in a very sad way.I'm a cold blooded person, i cry rarely and never in public.I didn't cry watching this movie, but I really tried hard not to.The movie, scenes are incredible and also the music is wonderful.\n\nActing is very very good.Cetin Tekindor (grandfather) is the best in my opinion.He's one of the best actors in Turkey, but I think he did his best job in this movie.He talks Aegean Turkish accent perfectly.\n\nCagan Irmak, director of the movie did an outstanding job.I want to congratulate him for this masterpiece."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "princebansal1982",
        "review_rating": "5",
        "review_title": "An intense emotional drama",
        "review_detailed_main": "At its core \"My Father and My Son\" is another old man - young kid story done just right. While it is not as amazing or as stunning as many reviews proclaim it is still a very good movie. It is prone to sentimentality sometimes, but that is more of a cultural thing. While acting wasn't spot on in a couple of places, mostly everybody has done a very good job and though it may appear that the actors are overacting you have to keep in mind that different cultures have different norms and different ways of expressing emotions.\n\n\"My Father and My Son\" is not groundbreaking, but It is both touching and humorous without falling in too many clichés. A very good movie and a treat for foreign movie lovers."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "delasalsa",
        "review_rating": "9",
        "review_title": "The Mediterrenean way of life..",
        "review_detailed_main": "This is a very good movie without any doubt! During the recent years there have been made some movies that clarifying Turkey's 70s - 80s. As a person who has been experienced those years, the film became a very big sentimental burden for me. Those were the tough days for many. It is a very touchy story..\n\nHowever, it is not that what makes this film good one.. You don't need to know all Turkish history to feel the movie.. You don't need to be Turkish either.. This is emotion.. This is life.. The Mediterrenean way of life.. I guess in a Mediterrenean perspective the movie would appeal to many. I myself watched a lot of Italian movies with similar scenario. The life from a 7-8 yo kid's eyes gather things in a three-generational dimension.... There are many scenes that are going to be remembered long.. The first encountering of the kid and grandfather is really touchy.. The blood is thicker than water.. This is what so called about a FAMILY..\n\nBy the way\u0085 for the international audience.. Deniz is name of Turkey's one of the most famous leftish youth leaders in 70:s with a great charismatic personality. So, that's why the name of the kid is not at all a coincidence.."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "curreir",
        "review_rating": "10",
        "review_title": "A Must See!",
        "review_detailed_main": "Having seen a lot of Turkish films, I do agree with someone writing in this site that this is perhaps the best Turkish movie ever and one that can hold proudly its place amongst the best worldwide. Everything is perfect, direction, photography, acting, you cannot help but feel for its characters and identify with them, especially if you share the same location in the map, similarities in history and personality traits.\n\nI loved the child actor, he can make you smile and cry, but also the whole movie is about feelings, pain, sadness, anger, love, forgiveness and most important the joy of life.\n\nAnother strong point is the music, made by the Greek composer Euanthia Reboutsika. Gave the movie wholeheartedly a 10 rating! I wish there were more of its kind."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ashim_smile",
        "review_rating": "9",
        "review_title": "great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "onel",
        "review_rating": "9",
        "review_title": "Great acting in an entertaining drama",
        "review_detailed_main": "The acting was perfect in this movie from the kid (Deniz) to Çetin Tekindor (Hüseyin Aga). All player did their job in a great performance. Also the places the film shot was great. My grandfather lives in a similar village, and I used to go to there in summers in my early ages. I went to back again to my childhood when I was watching the movie. It reflects the life style of those places in a very good manner and reality. No detail was skipped. Also the director mixed the drama and joy in the movie very well so that you can laugh suddenly when you pity for something you see in the movie. This was, I think, a great directing success for the new generation director, Çagan Irmak. So, this a \"must to see\" film I think, especially for the Turkish viewers (It includes so much domestic features). But international viewers can also get a real good taste of it, because main themes (such as family bonds, love of son) in the movie are humane things."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "irosh_cal",
        "review_rating": "10",
        "review_title": "please watch this film..",
        "review_detailed_main": "I think,this movie is very special for Turkish cinematography.Cagan Irmak(If I were you,I would be careful with him.He is great man) told us dying for opinions and the importance of the family.While I had watched the movie,I perceive that I want to believe my imaginations in my childhood and never want to grow up.Congratulations Cagan Irmak!Because of you touched our hearts in a very beautiful way.In addition,I should thank Çetin Tekindor( If he was born in an other country,he will certainly be an actor such as Anthony Hopkins),Fikret Kuskan(no comment),Hümeyra,Serif Sezer,Ege Tanman(Sadik's son)..\n\nPlease don't be prejudiced against Turkish movies and watch this movie.You won't certainly be regretful.I think,everybody should watch this movie."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mehmetyaci-1",
        "review_rating": "10",
        "review_title": "One more chance for fathers and sons",
        "review_detailed_main": "Give him a room dad, he do not have any else place to go...\n\nIs the best and the most important Turkish movie written and directed by CAGAN IRMAK... He is a wonderful writer and director. Although his young age, he is more successful than other older directors. I recommend everybody to watch this perfect movie!\n\nActors and actresses were wonderful, time was expressed very well. It is impossible not to be touched and cry after watching the movie.\n\nDeveloping Turkish movie sector will have a very important affect on European movies especially with the help of this movie.\n\nCagan Irmak had proved his talent with his previous movie \"Mustafa Hakkinda Hersey.\" I hope more these kind of movies will be created in Turkey and Turkish movie sector will be developed with the help of good quality movies\n\nA PERFECT film surely not to be missed!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Xstal",
        "review_rating": "7",
        "review_title": "The State as a Tool of Terror...",
        "review_detailed_main": "The profound consequences that a state, in fear of its people, can have on those people. Achingly sad and sincere, riven with sorrow and emotion, the tragic effects on a rural family in Turkey in the1980s as a result of tyranny, despotism and control. Be prepared to bleed tears into a bucket as your outrage, sorrows and disbelief take hold, in a wholly believable story that could be retold in far too many places around the world, still is unfortunately and, most sadly, still will be while true democracy is ignored - although it is particular poignant the way it's performed here."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "pelin-albayrak",
        "review_rating": "10",
        "review_title": "Wonderful Film!",
        "review_detailed_main": "The director of Babam Ve Oglum is Cagan Irmak.Cagan is the best and the youngest director of Turkey.I believe that one day,all people will notice his ability.Before Mustafa Hakkinda Hersey and than Babam Ve Oglum... I don't remember crying like that before.Subject of the film is not only Turkey's problem,all families' problem. Subject is wonderful,music is wonderful,actors and actress are wonderful,director is wonderful so the film is wonderful! I hope most of people in the world saw that film and put in order their family's life.Picturegoers must saw that film....You LOVE this film like me!(don't forget to take with handkerchief to go to the cinema.)"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Vincentiu",
        "review_rating": "",
        "review_title": "impressive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mj_882",
        "review_rating": "6",
        "review_title": "Although this film has it's moments of magic, it's riddled with overly-sentimentality and melancholia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "milesdrawmer",
        "review_rating": "5",
        "review_title": "If your father treats you like rubbish you should still respect and love him (apparently)!",
        "review_detailed_main": "OK, this is a good film. Lots of people have already commented that this is a good film so I don't need to add to that, but I did have some problems with it.\n\nThe film is very Turkish, while that is not a bad thing I do think it appeal to audiences from other countries is limited. That nearly all the comments here about the film are from Turkish people shows that it appeals mainly to Turks.\n\nThe theme of the film is: blood is thicker than water. The moral of the story is: even if your father treats you like rubbish you should still respect and love him. The father/grandfather is unpleasant and self-centered. If my father was like this man I would never trust him with my son. But this is why Turks will understand this film better than some other people. This is not about being 'warm blooded' (as Turks like to believe they are), it is about being unable to survive without a family support system (even if that system is dysfunctional).\n\nTowards the end of the film the old man seems to have a turn around of character; but we have to assume that this is only temporary, and that he will later go back to be a horrible old man, because it is noticeable that no one likes him. And they have good reason not to like him.\n\nThe film is not really political, it dodges the political issues. The military coup is only used as a melodramatic backdrop. If fact the film also dodges the issues about family, about why we treat people they way we do and instead uses sentimental melodrama to pull on our heart-strings.\n\nI do not believe this can be the best film made in Turkey (as many people have written)."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "dr_mleysi",
        "review_rating": "10",
        "review_title": "A spectacular movie which deserves to be seen all over the world. , our hats are taken off !",
        "review_detailed_main": "Although that I am an Egyptian and I was not a fan of the Turkish movies until I watched this movie, I felt while watching the movie that I was in Egypt. The village life and the relations between the family members which are sometimes full of contradictions between the old and young generations of the same family. The role of the strong mother (Hümeyra) who is trying to do her best to retain the relation between her husband and her son into its normal course and how she is keen to get her family back together was brilliant that she make you cry and laugh in the same time. The father (Çetin Tekindor) whose sorrow when he lost his son made me cry although I tried to control myself. The oldest brother (Çetin Tekindor) his natural simplicity which he conducted in his role of a loving older brother whose ill youngest brother was being fed by his own hands while he is waiting for his destiny at the hospital. The little boy (Ege Tanman), no one can deny the ability of this young boy who is living in his dreams that his father is his hero even after his death, his maturity in acting is quite spectacular. Finally, I would like to that the brilliant director and the writer (Çagan Irmak), his control over his cameras and conducting the actors accordingly was above imagination. Sincerely, all the members who worked in this movies deserves our hats to be taken off for them. It will be a pity if that movie is not nominated for Oscars. Simply a spectacular movie which deserves to be seen all over the world."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "izmirlierman22",
        "review_rating": "10",
        "review_title": "Never Felt Like This In a Movie",
        "review_detailed_main": "This is the best Turkish Drama I have Ever Seen. In fact this is the best movie of Turks.\n\nStory, Acting, Music etc. everything was perfect.\n\nIt is about 3 generation. Father, Son n Grandpa. Most of the theatre cried many times and in the same scene we suddenly start smile sometimes they were more than smile.\n\nThis is my reaction in a scene :) => :( => :(( => :('' => :)I would like to celebrate Cagan Irmak and all the actors even children\n\nTurkish Movies are commonly made for money but this is not one of them but this will be the most movie ever watched in Turkey this year. I think this is also better than Gonul Yarası which is a nominie for Oscar nominies."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "bbuysal",
        "review_rating": "10",
        "review_title": "Simply amazing, drama at its best!",
        "review_detailed_main": "It's one of those films which really affect you deep. The movie somehow makes ordinary places, ordinary people and ordinary events become interesting. I think it's due to the way Cagan Irmak (writer and director) cleverly and carefully blends everything. The movie is definitely not like a Hollywood production, maybe more like a European film. The film has many enjoyable moments but it's mainly emotional. The actings are magnificent, the story is heart-breaking and the places are so real. All performances were remarkable, but I should say I was over impressed by Cetin Tekindor's (Huseyin Aga) acting. While the bitter truths about life and family relations are portrayed perfectly, the movie also reflects life from the innocent eyes of a child. Personally, the local rural village life took me back to my some good memories. There is no need to tell what happens in the film as enough is said in the plot summary. More would only spoil it. But, it should be noted that even though the plot may sound political, the film is actually not.\n\nThe movie came out without much advertising, but in short time became very popular - won many awards in Turkey and some in Europe. Not much to say... brilliant work. If you haven't seen it, I advise you watch it whenever possible. If you don't feel like crying in this movie, you will feel sorry for yourself."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "muhammed85",
        "review_rating": "10",
        "review_title": "A perfect portrait of family and problems associated",
        "review_detailed_main": "This is a movie that has a crying guarantee on almost anyone who would watch it. It portrays a family in turkey in the early 70's mainly concentrating on the relationship between the dad and the son.\n\nIt is by far the best Turkish movie i watched, and i really did not like most of them. This one is definitely in my top 10 best movies ever made.\n\nThe drama and comedy genre is so perfectly mixed that many times one will get the feeling of laughing and crying all at once.\n\nIf you have not watched this movie yet, get it. No matter what you will like it. Actors do a very good job and the director's is one which is not even one to mention, just EXCELLENT.\n\nThis movie will relate to everyone and will give you an emotional vibe.\n\nEnjoy"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "eyeslikeyours7",
        "review_rating": "10",
        "review_title": "Simply, a gem",
        "review_detailed_main": "Moms say it all what they feel for their children. but father-son love is always silent.\n\nonce i read in a book that if you find two people sitting together and are not talking with each other, most probably they will be father and son.\n\n\"My father and my son\" truly shows the intricacies of father-son relation, which is felt by most of us in an oriental society but this is how life is...............\n\nPerhaps sadik's father was right who doesn't dared to be radical when young which has kept him from being conservative when old.\n\nloved it.........."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ovd07",
        "review_rating": "10",
        "review_title": "Bored of those genetically modified tomatoes?",
        "review_detailed_main": "What makes this film \"exceptional\" is the diversity of human state. It bares the drama, the comedy and the tragedy in every single frame. One of the only titles I can think of is the Korean make \"Memories of murder\" in same sort.\n\nIt's not artificial, in fact I found it very humanistic in many senses. In todays cinema we are all bored of those genetically modified tomatoes and this is very important for especially Turkish cinema as it would hopefully be the first step of a new line.\n\nI hope you will all get a chance to see this title, but bare in mind that the amount of entertainment offered isn't as high but will teach you a lot."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "useful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mervei",
        "review_rating": "6",
        "review_title": "above average",
        "review_detailed_main": "indubitably, cagan irmak is one of the best directors in Turkey. It is quite clear that he is a talented person whose films are discernible from the other junk films. His TV-series called cemberimde gul oya was his masterpiece. Even though i am not a cry-baby, every Friday when it is aired, i cried so much that i usually have headache after each episode. His first short-cut film was also quite remarkable called bana old and wise i cal. When all of these considered, i went to babam ve oglum with high expectations yet i could not find something just above the average. The performances were perfect but the movie itself exploits feelings. If you want to cry do not miss it because it is nearly one hundred percent possibility that you will."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "cgnkyx",
        "review_rating": "8",
        "review_title": "Really good but overrated for sure..",
        "review_detailed_main": "i don't know if you watched the movie but i can easily say that this movie is one of the best of Turkish movies ever seen..good acting, good directing..etc. However it is not a perfect movie. I watched this movie 4 times.I enjoyed all of them but if i give a 10/10 it can be unfair. Nice traditional things, Good actors and actresses, very good directing and one of the movies which really enforces you to cry! I did not cry when i watched it but i m not gonna say that it will not make you cry..İt will probably..So watch it..Enjoy it..And for sure wait the director Cagan Irmak's real masterpiece!..He is really talented and gonna show you the real Turkish cinema.."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "asenkron",
        "review_rating": "6",
        "review_title": "Not spesific as it is exaggerated",
        "review_detailed_main": "In our country good films are shown as excellent because the absence of really good films.Certainly,this film is a good film but not deserve concept of \"cult\" or \"excellence\".I watched this film and thought that such stories are available in all of us.I don't understand why these kind of films are demanded in high density when adapted to moviescreen.\n\nThe reason that giving six point is the skill of actors and actress and some moments in scenario.For example stressing the damage of military stroke is affective.\n\nCagan Irmak gained remarkable prizes and prices from inner and outer authorities and saloons,lastly from FOX TV at about 1.000.000 $.According to me this film can be a good pre-news film,not the farther.Inasmuchas before I watched this film,surroundings by me had said that your tears would not cease to the end of the film.Although I am a sensitive man in my life,I was not affected as Turgenyev's \"Fathers and Sons\".Already I think that the actioners of the film inspired from the book with one difference that there was no little child in scenario.\n\nAs looking at the comments in IMDb about this film,people in Turkey don't has film comment culture.Repeting that this film can be wathced as pre-news film on TV."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Kdosda_Hegen",
        "review_rating": "5",
        "review_title": "Very soap operish.",
        "review_detailed_main": "This film while not bad, but was just cringe soap opera alike. Yes it has some good morals, but the cheesyness ruins it."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ssssgelojun",
        "review_rating": "8",
        "review_title": "my father and my son",
        "review_detailed_main": "I thought I would never forgive my father, and when I came out of jail in October, he came to see me. We met at Liuliqiao. His hair was white and his eyes were cloudy. The man full of power had disappeared. At that moment, I forgave him."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "user-1134",
        "review_rating": "10",
        "review_title": "This is victory of Turkish Cinema History",
        "review_detailed_main": "What can we say about Babam V Oglum... Tears and sometimes smiles narrate to us everything about movies. Thanks Çagan Irmak to present us what a great life story. By the way, Have you ever watch Tim Burton's movie of Big Fish??? If you watch to Babam V Oglum, You should see Big Fish. I mean both of the movies try to explicate father and son disagreement. Big Fish contains much more fantastical components then Babam V Oglum. If a foreign citizen watch the this movie, He or she can understand the real Turkish lifestyle and real warm-blooded society. We can not introduce ourself to foreign societies perhaps this movie introduce ourself more then us."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "l_rawjalaurence",
        "review_rating": "8",
        "review_title": "Unabashed Melodrama with its Roots in Yeşilçam",
        "review_detailed_main": "A huge hit on its first release in 2005, BABAM VE OĞLUM (MY FATHER AND MY SON) is an unabashed melodrama with the emphasis on excess.\n\nThe story is a straightforward one: Sadık (Fikret Kuşkan) has to deliver his first child alone, when there is no one to take his wife Aysun (Tuba Büyüküstün) to the hospital. The wife dies, leaving Sadık a single parent on the first day of the military coup taking place in the Republic of Turkey on 12 September 1980.\n\nTime passes: Sadık is imprisoned and tortured for his political views; but on his release, he leaves İstanbul with his son Deniz (Ege Tanman) to return to the family home near İzmir. He receives a frosty welcome from his father Hüseyin (Çetin Tekindor) who has never forgiven Sadık for quitting his studies in agriculture in İstanbul and turning to politics instead. The rest of the movie focuses on the way familial relationships change, as well as how people cope with an unexpected tragedy.\n\nDirector Çağan Irmak looks at the oppressive influence of the past on the present; not only does it affect relationships between Sadık and Hüseyin, but it significantly dictated Sadık's love-life too. Returning to his home-town, Sadık is at once attracted and repelled by its familiarity; those who have never left - even for a short time - remain blinkered in their world-views. On the other hand BABAM VE OĞLUM shows how families stick together in times of crisis, and can resolve their own problems so long as they are prepared to acknowledge them in the first place.\n\nThe narrative contrasts Sadık's story with Deniz's imaginative fantasies, in which the little boy positions himself as the hero. In the first part of the film they can be read as a retreat from reality, as Deniz tries to cope with the trauma of moving to a new town and coping with a new life. By the end, however, he has discovered that such fantasies might change, once he grows up. They will remain fantasies, but they will fulfill a different function in his life.\n\nThe film is full of major scenes of confrontation and reconciliation, with Irmak's camera-work designed to achieve maximum dramatic effect through the use of close-ups, panning shots, dissolves, and two- shots, complemented by a florid musical score (by Evanthia Reboutsika). Although the narrative celebrates excess - of emotion, of feeling and of reconciliation - it does not seem in any way forced. In fact, it is as convincing and emotion-provoking as the best Yeşilçam melodramas of the past. Clearly Irmak planned BABAM VE OĞLUM as an homage to the genre, and he accomplishes his task with élan. Definitely worth more than one viewing."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Muratcan3",
        "review_rating": "10",
        "review_title": "Stunning Film Ever Made",
        "review_detailed_main": "As a men that don't like dramas much, I really have been impressed so much. What a great film about a rebellious men, facing reality of life and his past. Maybe best style of expression cultural abyss between somebody and family. Almost all cast has strong background of theater of cinema. Huseyin (father of rebellious men) and his naive brother really acted worldwide quality. Especially naive brother was played so naturally. I wish, if it were nominee for Oscar as best film. In Turkey film awarded so many prizes in film festivals as best film, best actor, best actress, best supporting role ...etc. I think this film is really a milestone of a Turkish Film Industry. One of the best film ever seen without a doubt. I recommend everybody to watch."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mustafa-30",
        "review_rating": "10",
        "review_title": "The best drama of Turkish Cinema of all times.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "econom-1",
        "review_rating": "10",
        "review_title": "I have cried first time watching a movie in my life!!!",
        "review_detailed_main": "The film is famous with its ability to make people cry from beginning to an end. Although it may not affect a foreigner in the same way, for people who lived the era described in the film are moved. The film focus on the coup d'etat of 1980, and how it ruined the lives of idealist people, especially leftist. However, there is more than that... The drama of the small family is based on a contradiction between the traditions of the Turkish rural families and the thoughts of the youngsters of these families. This contradiction is in the minds of these young people as much as it is in their relationship with their parents. Thus, the film both judges and defends the Turkish traditional family structure, first by showing how cruel they can be when a family member is against the \"tradition\", and secondly by showing how compassionate they are when the same member of the family is in trouble. Consequently, the film may not mean much for foreigners but I should mention the fact that I have cried first time watching a movie in my 28 year long life!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "elsinefilo",
        "review_rating": "",
        "review_title": "Did we have to wait that long to make a decent movie on our \"coup d'etats\"?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "krenaras",
        "review_rating": "7",
        "review_title": "This movie will pull your emotional strings.",
        "review_detailed_main": "The beginning of this movie wasnt so great for me, it seemed like a cheap drama series. The music was overbearing trying to make you emotional, and it felt kinda cheesy. But as that was over and the movie started you got an actual feeling of the movie that was more authentic than the first part. Even then the music could sometimes be overbearing but it fitted more since we got to know the characters and things had more weight for us. Overall it was well shot, the acting was good. I expected this movie to be more political but it was mostly family drama about relationship between father and son. Although some things were exaggerated for the sake of emotional impact, the movie still held together without being a typical spanish or turkish soap opera, but it still has elements of them none the less. Although it pulled my emotions, I cant rate it very high overall. It gets 10/10 for emotional manipulation but it falls on other parts. Its a 7/10 for me."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "muhacir",
        "review_rating": "10",
        "review_title": "never-to-be-forgotten",
        "review_detailed_main": "In Turkey this film is still remembered and missed. And also hard to watch again because of its realistic scenario. People tried to hide their tears from others. Friends had gone together to cinemas but at the and of the film they left in a big silence.\n\nOf course you can say 'it's a local taste' but I said in that film there is a big universal issue for all people: family relation. I want to advice that film everybody that need to cry and thinking about the father, mother, brother, son, ...\n\nAnd absolutely this is the best Turkish movie ever. In Turkey that film never will be forgotten..."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "tylerberryman-70101",
        "review_rating": "7",
        "review_title": "Turmoil indeed",
        "review_detailed_main": "Man this was on the verge of being one of the best movies ever made and then it just stumbles to a weak climax in the end. OVerall i still really liked it but it had more potential. The story was awesome"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "s_isildar",
        "review_rating": "1",
        "review_title": "Umm..no",
        "review_detailed_main": "Am I the only one here who finds this movie pathetic? Full of cliché and overacting.. total waste of time. Sorry.."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "SnoopyStyle",
        "review_rating": "8",
        "review_title": "emotional eruption",
        "review_detailed_main": "Sadik struggles to find help as his pregnant wife gives birth. There has been a military coup and no one comes. His wife dies in the streets. He is a leftist writer and the military tortures him. Years later in poor health due to the torture, he takes his son Deniz back to his rural family home. He has been estranged from his conservative father since leaving for school in Istanbul. Intending to leave Deniz with his parents, his mother forces him to stay. The father and son struggle to come to terms in their relationship.\n\nThis is digging into a deep family rift and finds a compelling movie. I would prefer Sadik to look more sickly when he arrives back at the village. It meanders as the plot lacks an obvious ticking clock. That's why Sadik's sickness should be played up to make his end more inevitable. It culminates with one oddly riveting emotional eruption by the father. It is breath-taking in its rawness. It helps that these actors are unknown to me which creates a realism despite the surreal emotional eruption."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "sorunsal-1",
        "review_rating": "9",
        "review_title": "Warm and human",
        "review_detailed_main": "If you liked \"Life is beautiful\" you will love this movie too. My suggestion is to forget everything you heard about it before watching. Just let yourself to the warm effect of the movie without any prior expectations.\n\nNothing is as exaggerated as told in some comments. All the events in the movie could have been or is being experienced by ordinary people. The difference is that we ordinary people are trying to overlook our feelings but the writers and the directors slam us in the heart by showing how close we are, how our fears are alike.\n\nMaybe some day we can learn not to put any distance between the people we love whatever the conflict is between. Cause nothing is permanent in this world, but irreversible regret is. So question your ideals and principles and try compromising before letting them tear you apart from your loved ones."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "SHEINOL22",
        "review_rating": "10",
        "review_title": "That's what it had to be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "erkancmbz",
        "review_rating": "10",
        "review_title": "A masterpiece that every man should watch before he dies.",
        "review_detailed_main": "\"My Father and My Son\" is a movie that presents its audience with an emotional and thought-provoking story. The plot revolves around the father-son relationship and depicts this relationship through a journey filled with challenges. Particularly, the psychological state of the characters and the impact it has on their relationships stimulates thought among the viewers. Additionally, the music and visual effects of the film also create a captivating atmosphere that draws the audience in even more. Overall, \"My Father and Son\" is a production that will win the approval of audiences as it presents a sentimental and contemplative story.\n\nI quoted the words in the title from the yt comments of the movie, and it's a comment I totally agree with. It is a must watch movie when you are a child, a father or a grandfather. When I told a friend that I was going to watch the movie, he said, \"Are you sure? Don't burn yourself.\" aforementioned. And he was right. I was very upset watching the movie, but an excellent masterpiece is worth it."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "sabbamnguni",
        "review_rating": "10",
        "review_title": "Babam ve Oglum",
        "review_detailed_main": "I write this review right after seeing this movie because I want to put down the emotions that stir me this second. I must admit that before watching this masterpiece I was a bit skeptical about it being a drama because most dramas I have seen evolve around irrelevant topics - but this movie will change the way you think.\n\nThe story is so heartwarming and real that it will move you far beyond anything you have probably ever experienced before. The actors do such an amazing job that you will sympathize with them and might indulge in some crying even if you are a male.\n\nEven if you don't cry this movie will touch you and will make you think about your own life.\n\nMovies that are able to and make you REFLECT and THINK about yourself, for my taste, are part of the best movies of all time because their messages are delivered in a way so that you will never forget them.\n\nGo see this movie and vote because this is not only the best Turkish movie ever, but one of the best movies ever made."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "kingturkey-18695",
        "review_rating": "10",
        "review_title": "I watched the movie crying.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "An Evocative Portrait Of Father-Son Bondings That's As Heartwarming As It Is Heartbreaking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mujtabasaif786",
        "review_rating": "7",
        "review_title": "What a bounding of father and son",
        "review_detailed_main": "This movie is really emotional, it made me emotional. The relationship between father and son portrayed awesome. It was my first Turkish movie that I have seen and I liked it. The movie shows the bounding between family and relatives. I wish everyone lives like this."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "matlharekgomotso",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "Best movie I watched so far,I will repeat it! I learnt something from this movie about a family, loyalty,love and everything that requires one to see or know about life! I really can't wait to watch it again and make sure my family watch it with me and I know they'll enjoy it as much as I did ! !!!\n\nA family need a father to be strong and functioning very well..this are one of movies a person can watch to learn and to spend time doing with family and friends whenever you are free!! Language doesn't matter but message on it does!! I am happy with the movie and the characters actors are playing."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "alansabljakovic-39044",
        "review_rating": "7",
        "review_title": "Average",
        "review_detailed_main": "Emotional but i find nothing special about it. Good story but I think it is very average movie so its a 7/10 from me."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "sencanoytun",
        "review_rating": "5",
        "review_title": "Perfect..",
        "review_detailed_main": "\"Men don't cry\" a Turkish Proverb.\n\nHovever every men can wail loudly while watching this movie. After watching this movie you will feel the urge to hug your father or your son. Çagan Irmak depicted the time of crisis of Türkiye between 1960s an 1990s perfectly. In my opinion Çagan Irmak is the best director in Türkiye and he will be one of the well-known directors in the World. Also the cast of this movie performed well. Jokes and melancholic element are perfect balanced. On the other hand; your psychology can be underover because you can cry and laugh at the same time.I want to congratulate all these people who helped to film this movie. Some good things can be in Türkiye. You must see this movie.\n\nEDIT: Turkish voting madness crossed the line.. This film's avarege is now 9.0. I think it will be over it.. It's nice for Turkish Films but this film can't be better than GOD FATHER.. Think two times giving 10 for this film."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "hndblcn",
        "review_rating": "10",
        "review_title": "excellent",
        "review_detailed_main": "This movie is the most dramatic film I have ever seen, I advice you to see Babam and Oglum. Excellent actors were in this movie. There is another excellent point is that you can both cry and smile. Very interest emotion you can taste. The theme was very dramatic, There were a grandfather, a father and a son. I'm strongly advice you to see Babam and Oglum.This movie is the most dramatic film I have ever seen, I advice you to see Babam and Oglum.Excellent actors were in this movie. There is another excellent point is that you can both cry and smile.Very interest emotion you can taste.The theme was very dramatic, There were a grandfather, a father and a son.I'm strongly advice you to see Babam and Oglum."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "unalsedases",
        "review_rating": "9",
        "review_title": "excellent",
        "review_detailed_main": "The film was excellent. The atmosphere of Agean District, the accent people speak, the cars they drive ( Renault 12) was so original Particularly the performance of Cetin Tekindor (father) in having regret about the relations with his son after his funeral was outstanding. It was so effective that most of the spectators including me watching the film in the cinema could not help weeping. I think Sadik's son will be a great actor in the future. Because his performance at he age of 7 was remarkable.\n\nFikret Kuskan's performance also meets our expectations. The beginning of the film I think conflicts with the quality of the whole film, the only performance that did not fit the situation was the performance of Sadik's wife. She was so artificial, her appearance of pregnant woman was not convincing at all. Fortunately, her role was short. Overall, it was the best Turkish film I have ever seen."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "yummy_fruitsandnuts",
        "review_rating": "10",
        "review_title": "great movie..",
        "review_detailed_main": "Such a great piece of work is not something usual for Turkey. It's a touching film and as said before nothing to do with super-human powers, fantasy or effects.\n\nThere are some scenes, especially on the second half, which makes you burst into tears without you realizing. The relations between family members and the things happening are so pure and so human that everyone watching the film finds something familiar with his/her life.\n\nThe music playing at the end takes you somewhere else.( The soundtrack from Evanthia Rempoytsika- One more chance) I strongly recommend this movie to everyone!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "kayabay",
        "review_rating": "10",
        "review_title": "A warm drama almost no one can resist to cry...",
        "review_detailed_main": "Probably the best Turkish movie of the season 2005-2006. With very less public announcement, the movie grabbed the audience and the rest is history. I couldn't find the opportunity to watch it on the silver-screen, but the recently published DVD is also awesome with all aspects.\n\nCagan Irmak, with his movie \"Mustafa Hakkinda Hersey\" already put forward his magic in Turkish cinema industry, but \"Babam ve Oglum\" takes you to some place else, where you cannot stop the tears in your eyes. He is a genius in many ways, from the scenario to the realization...\n\nAll the cast, without any exemption are totally fit and every little detail, every gesture is almost precisely calculated... The little boy ( Ege Tanman )is a marvel, and I hope he's gonna stay that way all through his career.\n\nÇetin Tekindor ( the granddad ), is a theatre based actor and performs one of his best. Fikret Kushan ( the dad ) is already a Cagan Irmak favorite and is just perfect with no exaggeration. Humeyra ( the grandmom ) also performs one of her best in her career and let's you put a smile on your face in all those dramatic occurrences.\n\nI hope this movie will find a way to exhibit itself worldwide and warm up many hearts who need to examine the fragility of a father-son relationship.\n\nBravo Cagan Irmak !!! Thanks Avsar Film...\n\nPS. For anyone who reads this critic: if you have no way to watch the movie, insist on having the DVD, that'll be a classic in no time."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "uhus",
        "review_rating": "10",
        "review_title": "the triumph of unconditional love",
        "review_detailed_main": "The story of how people can love without expecting a return, unconditionally and how sacrifices can be done for this aim. A story which is an ode to family bonds. The movie is a superb mixture of splendid acting, touching script, divine melodies and unspoiled landscapes. Although it is closely related to the last 20 years of Turkey's realities and Aegean culture of the country, the story is highly above any borders, a true universal praise of humanity. Both laughter and tears exist and are very deeply knitted in almost every scene, resembling real life: you can find something of yourself in every character of the movie, you can watch your childhood within the eyes of Denis and realize that you have lived similar pains, sorrows and joys. A must see for everyone who considers her/himself to be a humanist."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "rasim-1",
        "review_rating": "10",
        "review_title": "Perfect",
        "review_detailed_main": "This is the best film I have ever seen. I watched 3 times in cinema, but still feeling bad and spirited as the first time..\n\nSadik, and his father and all others are fascinating. This film should be in the first top 3 of the top list for drama. Pls. pay attention and watch this film. You must feel lucky when you watch this film.\n\nAlso I have a few word about little Deniz.. I want a son who will be like this child..\n\nThank you to Cagan Irmak for this unique trace.\n\nWe will wait for new projects of Cagan Irmak. Many thanks again,\n\nRasim"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "cananbozemniyet",
        "review_rating": "",
        "review_title": "He's a pure Aegean boy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "rachelrose-87356",
        "review_rating": "7",
        "review_title": "Movie Review Profits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "851222",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "Greetings from Lithuania.\n\nEven if sometimes \"My Father and My Son\" (2005) goes a bit to sentimental, and some actions at the end of some characters feels more like a funny then real, i never lost interest in it when watching this movie. Script here is great - it is involving movie and directing was also top notch. Acting was pretty good mostly by actor who played grandfather and the one who played brother was a bit over the top i think.\n\nOverall, \"My Father and My Son\" is a good movie at the end despite some of its flaws. Its a touching story well made."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "DLochner",
        "review_rating": "7",
        "review_title": "Impressive performances",
        "review_detailed_main": "The turkish drama that tells the timeless story of a family torn apart by political unrest and personal tragedies. Director Özcan Alper takes the audience on an emotional journey through three generations, skillfully weaving between past and present.\n\nThe actors deliver impressive performances. Their on-screen chemistry is authentic and moving, elevating the bond between father and son to a deeper level.\n\nAlper's direction is nuanced and empathetic. He manages to intertwine the political tensions of the time with the characters' personal conflicts, resulting in a film that is equally historically relevant and intimate.\n\nOverall, \"My Father and My Son\" is a masterfully crafted drama that celebrates the power of family and the hope of reconciliation. It is a film that resonates long after the credits roll, prompting reflection on the bonds that shape us."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "dejohan27",
        "review_rating": "2",
        "review_title": "Medicore",
        "review_detailed_main": "I felt really sad as this is supposed to be on the highlights of Turkish cinema. I understand every country has its own ways of making movies, own accents and they can be different than the standard American way. The acting is very childish and amateuristic. The overall feeling is over-sentimental and pathetic. The plot of the movie is interesting, universal and something everybody can relate to but the execution is very poor. At the moment of writing this movie is at place 132 in the top 250 and I consider it not to be in its place at all. Unfortunately this is very mediocre cinema, interesting to see out of cultural interest."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "9",
        "review_title": "May God Bless Turkish Cinema for delivering The BEST FAMILY-EMOTIONS FILM EVER !",
        "review_detailed_main": "My Father and My Son (2005) : Brief Review -\n\nMay God Bless Turkish Cinema for delivering The BEST FAMILY-EMOTIONS FILM EVER ! I love those moments when the film is over and i am sobbing & sniffing. I love it writing a film review with teary eyes and wrenched heart. After seeing more than Ten Top class Family dramas in Hollywood, Bollywood and Indian Cinema finally i found something which i can call 'The Best Family Drama Ever'. Family emotions were never so new and never so touching before. I know Emotional Family Drama is nothing new, it's the same old story but i don't know how this film managed to pull off the same old stuff with such a new and innovative way? My Father And My Son is story of Sadik who left his father and Mother years ago and now is blessed by a Child. He returns to his Father and Mother's house so that his Son can have a Home. See there is nothing new or outstanding in the plot but the storytelling is New and Outstanding. The way film is narrated by a Child who is living Real Life and Fantasy together, the way things are mixed up, the way memories from old days are used, the way Father and Son relationship is explored, everything is so Emotional and for a change so Clever. I don't remember watching such an intelligent narrative in this genre. All actors make this one look like a real family, they create thier place in your heart because every character is different in nature and you are forced to love them all. Background Music is so beautiful and mesmerizing, i could feel it in all those emotional moments. Direction is Top Notch. A rare case when i don't have any complaints to make. My Father and My Son is a story for everyone who love thier kids, fathers and thier family and that's why it is Universal subject. It would be shameful for you if you miss this MASTERPIECE..\n\nRATING - 9/10*\n\nBy - #samthebestest"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Ilkerincirci",
        "review_rating": "10",
        "review_title": "the most emotional film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "enginsane",
        "review_rating": "10",
        "review_title": "A Real Masterpiece",
        "review_detailed_main": "Even if I'm a prejudiced person on Turkish movies, beyond some other great Turkish movies like Eskiya and Gonul Yarasi; \"Babam Ve Oglum\" is the greatest one i have ever seen. Not in only Turkish Movies criteria, above all else i have seen ever, I can easily consider this movie as my top five. The movie contains the exact Turkish family realities and anything \"Turkish\". The players in the movie are so flawless and perfect on their job; like Cetin Tekindor as a famous actor (I consider him as Antony Hopkins of Turkey) and the great actress Hümeyra are in the leading roles. Besides the players, the creative director Cagan Irmak is one of the greatest young directors in Turkey. A few cheer-up-scenes are not missing even though the movie affects the people with the very dramatic ambiance. This is a really must-see movie for the Turkish people and for foreigns, do not ever miss it if you find this movie somehow. It may be seen as i'm exaggerating the whole thing but i really think that this movie is a turning point in the Turkish Movie History."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mahirs99",
        "review_rating": "10",
        "review_title": "One of the best Turkish movies I have ever seen , perhaps the best.",
        "review_detailed_main": "A great film by Cagan Irmak.Before watching the film i was suspicious about the film. should i watch or would it be waste of time?.At all this is a Turkish film.But i am so glad that i have seen that Turkish Producers and directors also can make excellent movies. This is the second film of Fikret Kuskan I have seen , and i think i am being a fan of him.Greaat acting , just as real life.Also the other ones acting in film was great.Humeyra,Cetin Tekindor and the child.While watching the film you are not only watching , feeling living those times.If this film was an Hollywood production i am sure Cagan Irmak an Cetin Tekindor would be able to win Oscar.But unfortunately they give Academy Awardas only to US productions..."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "hilook",
        "review_rating": "10",
        "review_title": "The new \"Life is beautiful\"",
        "review_detailed_main": "Çagan Irmak, famous Turkish director did it again. His own scenario looks the 1980's from the Egean side of Turkey. The plot organization looks simple, The father decides turning back to home which he left after he had a big argument with his father because of his political choice at the school. Then we learn that he is going to die and the drama leads to an endless crying session. The performance of the grand father (Cetin Tekindor), the grandma (Humeyra) and the father (Fikret Kuskan)is great.\n\nThe latest Turkish movies and the performances of the Turkish artists getting brighter.\n\nAs a result I want to call Babam ve oglum ( My father and my son ) as a new \"Life is beautiful\". The movie is great for both the young viewers and the old ones since everybody can share the similar feelings in their life."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "skarasu",
        "review_rating": "10",
        "review_title": "This movie is one of the best ever made.",
        "review_detailed_main": "I can just say : \"Shame on you IMDb.\" You are scared about that this movie can be the best ever with our votes. So you just change your way of grading. Shame on you. This movie is wonderful. Just watch it and you will understand what i mean. It is better than the most of your top 250. But it is a Turkish movie and thats a reason enough to ignore it isn't it. I thought your site was one of the best sites on the Internet but now I see it is just a site that is not fair enough to accept that a movie made outside the US can be very good. I will never vote again for any movie here. Really I am very disappointed about you. You have to be honest. Just be that. This movie is unbelievable good. The actors are outstanding and the feelings i have had as I watch it makes me cry like i never did before. JUST WATCH IT."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "tarabya34",
        "review_rating": "",
        "review_title": "harikasin cagan!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "briancham1994",
        "review_rating": "6",
        "review_title": "Slices of life that don't add up to much",
        "review_detailed_main": "This film has true-to-life feel that makes the viewer feel as if they are part of a great family reunion. I loved all the small moments with the child's imagination, the falling out and the happy memories. The acting felt naturalistic and joyous, without any melodrama. However, I don't think these moments truly cohered into a whole. While there was a compelling narrative arc that developed the characters and the family's backstory, it didn't amount to much for me by the end."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ozcanfiliz",
        "review_rating": "10",
        "review_title": "Perfect mixture of drama and comedy!",
        "review_detailed_main": "I had rarely seen a movie which makes you cry and laugh at the same time. This movie shakes your emotions. The crew of the movie is perfectly selected. All characters without exception fits the characters they play. And also the adaptation to the local language spoken at the west side of Turkey is very successful from the side of the players. The musics are also well embedded. It accelerates the flow of tears from your eyes. Wherever you hear these musics you will get emotionally dramatic after all. I can say that this movie is at the top 10 movie ever played in Turkey. The writer/director deserves the best comment."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Movie_Rating_n_Ranking",
        "review_rating": "6",
        "review_title": "Only for drama lovers",
        "review_detailed_main": "The film focuses on a small peasant town, in the shadow of a large family. This brings out the humble and warm life of rural Turkey.\n\nThe story has a politically adverse context, but despite its importance it is left in the background to focus on a family drama. This is perhaps a double-edged sword, because although it has its appeal, the doses of suffering, pain and anguish exceed realistic parameters, becoming highly exaggerated theatrical acts. Some characters even fall into caricature, further detracting from the film's credibility.\n\nThe overall performances are good. The photography and direction are very well developed, taking the shots into creative territories. The soundtrack becomes repetitive, being one of the weak links in the technical aspects of the film.\n\nIn general, this is a product that is aimed at an audience that enjoys tragedies and family dramas. If you don't look for these ingredients in an audiovisual work, it may not be your type of film."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "gumby_x2",
        "review_rating": "1",
        "review_title": "Do Not Be Fooled",
        "review_detailed_main": "Based up reviews on IMDb I purchased a copy of Babam Ve Oglum from Turkey with English subtitles. It was not, as hyped, \"One of the best movies ever.\" Instead, it was a poorly done, trite melodrama that I forced myself, and I mean FORCED myself to watch for about 35 minutes. I'll admit, one does take a chance when he buys based upon the recommendations of other IMDb users, but sometimes the risk is worth the reward. I suspect that the movie was \"ramped\" up by users in order to increase its appeal, and it certainly caught my interest due to its seemingly high ratings. But let's not be fooled. The $30 I spent for this title, yes $30!, was a complete waste of money. Usually I will try to resell those purchases I make on Amazon and Ebay that don't meet my expectations, but in this case the movie was so poor that I threw it into the trash, not desiring to foist the same foolish film on others. My warning: stay away from this movie at all costs, even if it is offered to you for free!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "viyola",
        "review_rating": "10",
        "review_title": "Great movie from a genius director-writer...",
        "review_detailed_main": "\"When people get bigger, do their dreams get smaller...\" Great movie from a genius director-writer...\n\nCagan Irmak.He is a really genius.I think he will be the new face of modern Turkey.He is young and talented absolutely.\n\nI can not describe this movie in words.This movie is the best Turkish drama (and best movie) i've ever seen.I have not watched any movie like this.\n\nThe movie released on 18th November 2005, i watched it on 18th November (and also 3 times again later :) ).I cried,i laughed (of course not only me,everybody) .I feel proud of Cagan Irmak.He is a great writer, he is a great director.He creates new worlds on his every work.\n\nAnd the actors...Cetin Tekindor , Humeyra , Fikret Kuskan, Serif Sezer and Ege Tanman ... Everyone in this movie is so talented.The music is(composed by Evanthia Reboutsika ) minimal and wonderful.\n\nI wish the movie will be released in the other countries.Highly recommended. A must see movie."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Vartiainen",
        "review_rating": "10",
        "review_title": "About the meaning of home",
        "review_detailed_main": "Babam ve Oglum, or My Father and My Son, takes place at the start and in the aftermath of the 1980 Turkish coup, where the existing government was overthrown and a military junta took power. This took place on September 12th, and on that same night a left-wing journalist, Sadik (Fikret Kuskan), lost his wife in childbirth. We jump some years into the future as Sadik returns back to his childhood home in the countryside with his son Deniz (Ege Tanman).\n\nWhat I appreciate the most about this movie is how layered it is. How it tells so many stories at once. First of all, it's a great story about returning back home after having left it years ago. I too grew up in the countryside, and this movie tells it just like it is. About how it feels so alien, like the place has been frozen in time, but at the same time there's immediacy to it, certain purity even. It feels like home in a way city never can.\n\nIt's also a story about three different generations trying to build and rebuild bridges. About grandparents finding a connection with a grandson they've never met. About a son trying to reason with his father, both Deniz with Sadik and Sadik with Hüseyin (Çetin Tekindor), Deniz's grandfather. And as a sidenote, can I just state how much I loved the character of Salim (Yetkin Dikinciler), Sadik's brother, who stayed when he left. What a kindhearted, honest and utterly likable character.\n\nAnd yes, it's also a story about a certain period in Turkish history. But that stuff is not at the foreground. It plays a part in the narrative, but more as a source of causality. It's the reason why things happen, but not the focus. And I think that was the right call to make, in order for these other stories to have enough room to grow and shine.\n\nThis movie isn't widely known as of writing this review. And that's a shame. It has the depth, the expertise and the purity of message to be a true classic. I hope more people find it in years to come, because it surely deserved to be watched and appreciated."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "i_Raj",
        "review_rating": "9",
        "review_title": "Touches deep inside the soul",
        "review_detailed_main": "Son, father and grandson - the relation of this three generations with the family was knitted very exquisitely by the producer Cagan Imrak. Big thanks to him for this masterpiece. There are not many directors who could portray this type of intense realism into movies.\n\nStanding ovation for the cinematography! There are many subtle details which can only be understood by multiple watching. Special thanks to Evanthia Reboutsika for her outstanding music composition for this movie. Her music can stir all kinds of emotions.\n\nThe movie was a good example of character development. Especially pleased with the acting of the kid (Ege Tanman). He was just mind blowing. Hussain Aga sometime looked like Turkish version of Vito Corleone. At the time when Hussain said '.... if I stood like this, Nuran if I stopped Sadik, if I hugged him like this......' - this was probably one of the best scene in the history of movies.\n\nThere is no happy ending for everything in life. Like Deniz, it's important to accept reality - no matter how hard. It's necessary to move on. Some movies can portray this truth artistically. That's how they become milestone movies. This is one of the best Turkish movie I've ever seen.\n\nDon't just see, experience it."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Ahmad_pilehvar",
        "review_rating": "8",
        "review_title": "Emotional and very heartbreaking movie",
        "review_detailed_main": "It was a real emotional and heartbreaking movie about a father and a son relation,through the watching movie in couple of scenes I couldn't control myself and it made me weep. sometimes as father you should make right decision but you can't push your child very hard cause it could have an opposite effect. this movie has a great story and almost with good ending. the actors and actress were acting just perfect like it was part of a family real life."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "adibullahadib",
        "review_rating": "8",
        "review_title": "Masterpiece of Turkish cinema",
        "review_detailed_main": "When I started the movie I had not good feeling about this movie because of Turkish series and I guessed maybe this movie is like them, but it is not. It touched my soul! Made me cry and made me laugh.\n\nI really love Deniz!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "SHEINOL_22",
        "review_rating": "10",
        "review_title": "Perfect",
        "review_detailed_main": "My father and my son, this movie had a huge impact on me. It definitely left an impression that I will never forget for the rest of my life.\n\nFirst of all, I would like to say the following about the movie, this movie tells a perfect father-son relationship. At the very beginning, it is obvious that the beginning and the end of the story is tremendous.\n\nIf I talk a little bit about the story, we have two characters in the lead role, Sadik and his father Hüseyin. The character of Sadik goes to Istanbul to study, then he has a son and then he has to return to his father and then we watch how the father and son relationship happens.\n\nFinally, would I recommend this movie? I would definitely recommend it, it is the most beautiful and sad movie I have ever seen and if you want to cry, watch it."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "StanleyMarshall_",
        "review_rating": "6",
        "review_title": "Simply Life",
        "review_detailed_main": "As unique as it was made, this film's message was simply about what life is. People were born, have families, dreams and have conflicts along the way as they grow up. We get to see life in the perspective of a child who lives a life full of fantasy, an old men who lives his life in the past, and the man who contemplates about his old life and decisions but also looks forward to the future of his son. Though sometimes scenes were a little over dramatic, this is one film which was simple but meaningful."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Gunnar_Ingibjargarson",
        "review_rating": "10",
        "review_title": "Truly remarkable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "martinpersson97",
        "review_rating": "9",
        "review_title": "Important, masterful and beautiful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "kalay",
        "review_rating": "9",
        "review_title": "melancholy and vigorous emotion",
        "review_detailed_main": "Cagan Irmak seems to stir drama and comedy in correct dose. When you live intense emotion, there is comedy right behind. In this way, you are giggling, right behind when you fell with great sobs.\n\nCoup d'étates are always full of tragic and full of resentment. People separate each other with external factors and it takes time to bandage wounds and to forget about what were lived. 12th of September was such kind of phenomenon. Cagan Irmak did fine work on making movie about this fact.\n\nUsing local accents, authentic music in background, accomplishment of actors and actress are the main factors for being liked. The characters are very familiar to us and they are certainly assimilated from the life itself.\n\nDramatic wave walk with a swaying movement along the movie.\n\nOne of the last scene in which Sadik come out of camera and make a speech to this son should have been eliminated. This scene does not contribute to the story. If the marginal contribution of scenes is zero, cut them and make the movie simpler. This is the golden rule of film-making.\n\nI am pleased that Babam ve Oglum is a worldwide movie and we are in the right way to find a good position in this art world."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "xeynep-1",
        "review_rating": "10",
        "review_title": "touching",
        "review_detailed_main": "you will have a lot of fun, an also tears in your eyes... it's a touching film about family, son-father relationships and the political history of Turkey through 80's. Character dialogues and family scenes are so natural that it's inevitable to appreciate Irmak's success. Actor's performances are also clearly outstanding! The film talks about a close history of a country, by perfectly harmonizing the historical and political history with a totally personal and emotional relationship between sons and fathers. In Turkey, the film made such a great success that for months, it was really hard to find any tickets before reservation. Cagan Irmak is a great director who manages to make the audience feel the warmth of relationships and life, by creating natural scenes of village and city life, affairs between people and struggles of human with himself or outside."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "baglioglu",
        "review_rating": "10",
        "review_title": "it is worth to see- a family tragedy",
        "review_detailed_main": "The best Turkish movie I have ever seen. You will taste all kinds of feelings at the same time. The relationship of grandfather father and sun is illustrated excellently. Also the structure of Turkish family is described well. The local accent is used very well. Also the scenario is well structured and reflect the Turkish culture well. The beauty of Izmir is also worth to see in the movie. This movie will make a revolution in Turkish movie sector. I hope the director of movie will be a world wide director soon. If you liked this movie see the director's other movie \"Mustafa Hakkinda Hersey\". I will be looking forward to new creative movies..."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "MasterShifu",
        "review_rating": "9",
        "review_title": "Relevant and touching",
        "review_detailed_main": "This is absolutely one of the best family movies I have ever watched. Actors did a good job in portraying as a family (the love and hate, the comedy) especially the kid (Deniz) that's why they are part of the Top 250 movies of all time."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "tatliperi_asli",
        "review_rating": "10",
        "review_title": "My father and my son",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "engony00",
        "review_rating": "10",
        "review_title": "Must-see!",
        "review_detailed_main": "Being in top 250 is not a coincidence. Extremely emotional. Sadness, happiness, love, family relationships, in a brief, you can find every emotion that we have in the movie. Well acting, good screenplay, enough picture. One of my favorite."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "JakeBrinkman",
        "review_rating": "3",
        "review_title": "An emotional drama that never hits hard",
        "review_detailed_main": "This is an emotional drama that, after the opening scene, was never quite able to hit my heartstrings. The story has two, or arguably three, main characters. Some movies are able to pull this off, but this one never seems to provide quite enough background or personality behind the characters to make me feel emotionally attached to any of them.\n\nThe acting also played a role in my failure to connect. Many scenes were acted convincingly or adequately, but others seemed either unrealistic or overacted. In my opinion, the only consistent actor played the brother Salim, who was quite funny in several scenes (even if one of those scenes abruptly killed an emotional scene).\n\nA final comment is that the composer and director quite obviously did not cooperate for this film. Whenever background music is playing, the end transition never failed to be jarring. The music would stop or change in such a way that never failed to break any immersion I had in the film. It was very apparent that the director, composer, editor, etc. did not have any idea how to make a musical transition."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Leo_de_Aetas",
        "review_rating": "10",
        "review_title": "Best family movie ever made",
        "review_detailed_main": "From the acting and cinematography, the story was stunning and heart touching from the first to last scene. Must watchable movie for everyone"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "kristianinataleli",
        "review_rating": "9",
        "review_title": "The story is very deep",
        "review_detailed_main": "Its story is very deep,after as real life. Çetin Tekindor's acted was represent. More again, when Fikret Kuskan aka Sadik was dead. Visible he was hurt with Sadik's death. Its film is as puzzle. First, when Deniz was born. Not hot, not rain, suddenly Sadik was prison. After more far, I know the reason Sadik was prison, because his activity as journalist. Can accepted mind. Two, after death Sadik, when Deniz tried video camera from his grandpa. This really dream or not. For this,I can't more speak.\n\nEach film be a goof. The direction of camera when Sadik apologized with his dad, made a dizzy. Better that, after Sadik fainted, the camera was fading out. When Huseyin knew his son was fainting, directed the scene was fading in. But all the story is very good."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "selomania-08335",
        "review_rating": "10",
        "review_title": "Cry cry more cry :(",
        "review_detailed_main": "Best movie if you want Cry and hug your father. Çagan Irmak is perfect director."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "InTheBackdropOfOblivion",
        "review_rating": "9",
        "review_title": "Tends to exploit basic and common human feelings.Otherwise powerful.",
        "review_detailed_main": "I believe every Turkish Citizen living inside Turkey shall watch this film.It's a tragic thing,to watch is to be stumbled and lacerated continually yet it possesses some powerful scenes with serious implications.I must admit this film monopolizes on human feelings that are raw and the director expects a normal,social being watch it.That also means,tragedy orchestrated here doesn't uplift the soul(thus is hollow) and is nothing sublime if we run parallel to the definition of Tragedy put by Aristotle.Yet political overtones are real especially for the present day Turkey that faces brutal rule.Initial antagonism between the father and the son didn't seem very much convincing but this could yield something greater and penetrating in the later parts.In the end,I must admit one more thing.I CRIED."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "vaga-emre",
        "review_rating": "10",
        "review_title": "excellent",
        "review_detailed_main": "i saw this movie and it was great i think... i don't want to tell about this movie because you must watch... you must absolutely see this movie... this is the best film i have ever watch... i think if this movie was a Hollywood movie, it certainly take a lot of Oscar (best picture, best actor , best actress...). Especially Çetin Tekindor has a great performance...at one scene i was crying, after this scene i was laughing... i was feel all of sense... sadness, happiness, love, anger... in the end i was feel satisfaction... i will say again and again, this is a best movie of the world...this is a best movie of the world...this is a best movie of the world :)"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "volkan1542",
        "review_rating": "10",
        "review_title": "As usual, I was determined not to do what everyone does while watching this movie, but I couldn't resist myself when the second half of the movie started...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "abdulkadir-ersin",
        "review_rating": "10",
        "review_title": "This film is unbelievable...",
        "review_detailed_main": "I never cried on a film unless i have seen this film..This film shows how is important the family for Turks..i have seen this film 10 times and i cried all times..it's really perfect film...And this film has a lot of points..it's great thank you Turks..\n\nit's really great.... i think you should see this film. if you don't, you lose a lot of thing in your family life.. if you love your family, if you love your father, this film is for you.. i am sure that..\n\n10 lines are very..this film can't be explain with words.. that film must be seen...must be lived... i think it's enough about this film..i can't write more comments..Sorry."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "dcec-24641",
        "review_rating": "3",
        "review_title": "Fell off my chair laughing after around 90 minutes",
        "review_detailed_main": "The overacting.and clichéd melodrama just became too much. I'm not sure why this is being hailed as some great cinematic masterpiece, because it is anything but."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "khalid_ssb",
        "review_rating": "8",
        "review_title": "A must see Movie by all family Members",
        "review_detailed_main": "the movie tells the story and the suffering of a Turkish rebellious left-wing journalist who left his village where he used to live long time ago and went to Istanbul\n\ni never thought the Turkish drama will be as good as that\n\nthe movie staff perfectly demonstrate the real live in village, family, relationships, laugh, grieve and love\n\ndespite the great performance in this movie, this film has a great aims and facts everyone should understand about life\n\nthe movie is suitable to be watch by all family members and i recommend you to watch it with your parents\n\nwhile watching, some scenes may recall sad memory of yours so be alarmed, but i guess it's OK after all"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mehmeticme",
        "review_rating": "10",
        "review_title": "The Best",
        "review_detailed_main": "\"When people grow up, have they shrink your dreams?\" Babam ve Oglum is the movie for who say i never cry. This is not just a movie, This movie is as real as real life. The film is so emotional. You will be both happy and upset when watching the movie, because you will understand the value of life, decisions, family. I have watched a lot of movies but never felt that much. This movie really manages to connect with the audience. You should don't think, you just watch."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "bloodbilge",
        "review_rating": "8",
        "review_title": "Great Actor ; Cetin Tekindor and Very Good Movie for Turkish Cinema",
        "review_detailed_main": "Classic Turkish Cinema Style, different from Hollywood, far away from commercial tags, and more talented about showing the feelings in reality. there is no such pre-rendered emotional attacks , and yes sometimes -specially in comedy parts- so many absurd acting and personalities are popping up, but it is so natural end embedded into story and characters very realistic and pretty.\n\nFirst of all, yes, ' like the movie in generally but there is no such a thing that must be rated 9 or 10. if there is anything perfect in the movie that was acting power of Cetin Tekindor.\n\nFinal improving scenes and the dialogs were perfect. Cagan Irmak is also good director and writer but there is no new story about early 80s in turkey.\n\nIt deserves 8... You should watch it if you really like the humanism,emotional stories and movies which tells a story from a specific era in the history. Don't MISS IT!!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "rafi-jif-202-341132",
        "review_rating": "10",
        "review_title": "Par beyond Excellent",
        "review_detailed_main": "first of all i don't understand Turkish but with the help of sub i watched it simply its the best movie i have ever watched and i assume it will stay the same until end of my lifetime !! every single character in the movie was so perfect i was speechless\n\nstory line , screenplay , direction , background music , omg\n\nend point the three main characters A MAN AND HIS FATHER AND HIS SON all three character actors have done beyond imaginable ... his son i assume maybe 4 or 5 not sure gosh man ..\n\ni have watched movies in all genres Thriller : memories of murder (Korean) TO the body (Spanish) TO Triangle (English) Drama & Gangster : Shaw shank Redemption to Godfather Family : life is beautiful to Forrest gump Serial Killer & Horror : The silence of the lamb to The others\n\nbut Babam ve Oglam (my father my son) beats it all\n\ndon't miss the opportunity, its pure class in many ways as you may take it"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "cwmikebirmc",
        "review_rating": "9",
        "review_title": "A story of Turkish people",
        "review_detailed_main": "One of the important pieces of Turkish cinema. You can feel different emotions during the picture. One time you feel sad and then it makes you smile. You can see all the aspects of Turkish people and culture in the movie. Main characters are well played by great Turkish actors. To sum up, a fine piece to watch."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "rydan-00086",
        "review_rating": "10",
        "review_title": "True Story",
        "review_detailed_main": "I Love This Movie Because Of True Relation of one father and son i strongly recommend to every won please watch at least one time you must proud of your father and son bounding"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mehadialamsajib",
        "review_rating": "9",
        "review_title": "The best family movie yet, it's a masterpiece",
        "review_detailed_main": "One doesn't can do all the things, but the Director of this film has. What a realistic story man! What a story! I cried so many times while seeing this though\n\nEvery actor or actress did their best but the little boy could have done better i think. And the bonding Between a family! This film has shown so many masterpiece scene, and last one was is pure jam..\n\nOtherwise it's a feel good, must watch, intellectual family movie. It's my recommendation for all of out there"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "moritzherz",
        "review_rating": "5",
        "review_title": "Great, emotional drama!",
        "review_detailed_main": "To be honest I expected nothing from this movie, i just watched it because it is on the Top 250 movies list, but how else should you have ever heard of it? It is my first turkish movie, so I did not know what to expect and I have to say I got surprised how good it is!\n\nThe story is solid and comes with the emotional part. The ending was really satisfying and I have to say that it got me entertained. The movie is perfect for children as well, so you can watch it as a family. Only thing I missed was an english synchronisation, the subtitles are fine but I hate reading movies.\n\nSo if you never saw a turkish movie, this is the one you should watch!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mmustafad",
        "review_rating": "9",
        "review_title": "Magnificent!",
        "review_detailed_main": "Director Cagan Irmak has already proven himself in Turkish cinema.I think that's his best film. One of the most epic Turkish drama films I've ever seen. Maybe even the best. The acting and cinematography was nice."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "a-65018",
        "review_rating": "8",
        "review_title": "Incredible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "nnjimdb",
        "review_rating": "10",
        "review_title": "Very Emotional, Sensitive and Excellent. True feelings of Human beings!",
        "review_detailed_main": "This movie is directed very nicely. It brings us to the true word of emotions. Made tears in the eyes. Deeply shows the feeling of people, effection in a family and how attached everyone In a family is. Every actor gives their maximum to be a success. Very well satisfies of this movie!! A must to watch! Spread love in the short term of the life."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "tarlatanci",
        "review_rating": "10",
        "review_title": "Whatever you write, words are insufficient to describe",
        "review_detailed_main": "I live in turkey. I have been following Turkish cinema and other countries' cinema for a long time. I bet this movie is the most important movie in Turkish cinema history. The audience has been watching over and over again for years. He lost a lot who didn't watch. The script and casting options are enormous. You understand that the players play sincerely. Everyone will find a piece of themselves in this movie. This movie is the story of you, me and all of us"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ovgu",
        "review_rating": "10",
        "review_title": "Don't miss any moment with beloved ones, never!",
        "review_detailed_main": "Best movie and script of all time. This is undoubtly true for most of the watchers of rhe movie."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "yadavanita-18093",
        "review_rating": "10",
        "review_title": "These stories with happy endings should always be told to others",
        "review_detailed_main": "Perfect blend of reality and fantasy in a heart-warming flick from turkey, which has elements that many of us could relate and find us in the characters shoes. The acting is done beautifully by the cast which seems just like everyday household talks with turns of happiness and sadness. Everyone should once try to see this movie, stepping aside the language barrier and enjoy it's charm."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "HawkeyeXXX",
        "review_rating": "10",
        "review_title": "The Best Movie in the Turkey",
        "review_detailed_main": "In Turkey this film is still remembered and missed. And also hard to watch again because of its realistic scenario. People tried to hide their tears from others. Friends had gone together to cinemas but at the and of the film they left in a big silence.\n\nOf course you can say 'it's a local taste' but I said in that film there is a big universal issue for all people: family relation. I want to advice that film everybody that need to cry and thinking about the father, mother, brother, son, ...\n\nAnd absolutely this is the best Turkish movie ever. In Turkey that film never will be forgotten..."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "hamidullahgenc",
        "review_rating": "10",
        "review_title": "This Movie Has Now Gotten Its Place",
        "review_detailed_main": "In Turkey, the leftist and rightist groups were set against each other in the early 70s and later on these \"revolutionists\" and \"idealists\" not only killed each other but also engaged with the police in clashes of arms. Both groups went as far as to do bombing (or they say it was the work of the Western ideologies in play along with the secret state in Turkey). Then the Army staged a coup on September the 12 in 1980 and made thousands of arrests and significant amount of torture went on in the prisons... They even hanged 50 people that were found guilty(!) as they tortured hundreds of people (at least 171, proved) to death... And to this day the good people of Turkey suffers the consequences... Now, if we say that this movie tells one of the many stories of that era, it is absolutely true as \"the father\" had seen the torture and mistreat in the prison for what he had done nothing wrong... His heartbreaking story also reveals so many levels of the culture of Turkey and the bigheartedness of its people... Last but not least, if you ever claim that you have seen \"drama\", and your eyes won't just stop \"shedding tears\"; I kindly dare you watch this piece of art!.. I say it is gut-wrenching as well as mesmerising!.. So, no point in denying that the top 250 it belongs to!.."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "sinefili",
        "review_rating": "9",
        "review_title": "Easy and deeply impressive",
        "review_detailed_main": "Çağan Irmak is the face of the drama genre of Turkish Cinema. Always a simple narrative films. But deeply affect us. Because the handling is as simple as the fact of our lives. We see ourselves in the mirror while watching his movies in theaters. As all Çağan Irmak movies Babam & Oğlum has managed impressive as all this its is deeply.\n\nWhen the period is based on the script of the film we see the stressful times in Turkey. Family ties. Family relations in the Aegean region.\n\nAt the end of the movie we see death of the father and we sad. But also we saw grandchild finally getting his grandfather. Also we are happy! That is what melodrama."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "8",
        "review_title": "Very Good",
        "review_detailed_main": "A lot of people cried after watching this movie. I never cried, but it is a beautiful and touching film. But the little boy in the lead role was always repulsive to me, maybe that's why I never got emotional while watching the movie."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ttsailor",
        "review_rating": "10",
        "review_title": "The best drama film I've ever seen",
        "review_detailed_main": "It's the only movie that made me cry. I've never been bored watching."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "azizkayihan",
        "review_rating": "10",
        "review_title": "An amazing film that shows coup and post-coup issues!",
        "review_detailed_main": "Babam ve Oğlum (My Father and My Son) shows the post-coup relations between people and in families in Turkey. In Turkey, on the countryside having higher education have been seen as an act of communism by many during the 50s and 60s. This brought families, and family members against on another.\n\nThe film mainly focuses on the grudge between a father and son which lasts for many and you can see those in many Aegean towns; people can really hold on to their grudge for years, even if it is something not really that important.\n\nCombined with where and when the story goes on and with really good acting and crew, this is a really good film worth sparing your time."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "kaankiska",
        "review_rating": "10",
        "review_title": "Beauty of being plain pure and sincere...",
        "review_detailed_main": "Great loss if still didn't watch... Art is in the most cases hidden in the reality. It is mostly diversity that makes the cast attractive. İf that makes you lough a second after you cry it is something. A very kind approach to human kind. A clue to hold back to cultural ties. A movie never been boring for even a second."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "ilhanparlak",
        "review_rating": "10",
        "review_title": "cry & smile",
        "review_detailed_main": "as a man who has watched this film a few times, i fill with tears even as i read the comments here. just watch it, u will have a very special experience. just to fill the lines needed:), another thing that i find out from this movie and the comments about this movie is that people from different cultures and geographies can feel the same emotions about family, father&son etc. this film can touch anybody's heart as i see"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "mohamedmohsen-67491",
        "review_rating": "9",
        "review_title": "Touching !!",
        "review_detailed_main": "Definitely one of the most touching and emotional movies to watch .. could be considered as best or maybe one of the best movie to represent the Turkish cinema.\n\nNot every day you could found a movie about a father-son relationship. One day you are a son, the other day you become a father . Until then , you cannot feel or understand your father's behaviors. It tells you also how could the pain bring any family together,\n\nThe script and dialogue were well-written with very emotional scenes. The first and second line of actors were superb ."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "orhantahin-98806",
        "review_rating": "9",
        "review_title": "great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "drmuhammedsamiduru",
        "review_rating": "9",
        "review_title": "Sadik and Salim",
        "review_detailed_main": "\"My name is Sadik, my brother Salim. Have you been so scared of us, have you wanted to give direction from the beginning?\"\n\nIt's not what his father hoped. Sadik became a child who rebelled against the meaning of his loyal name. Salim, on the other hand, is healthy, and contrary to the meaning of his name, the son who has a bit of understanding. What a meaningful movie. What deep."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Rifat_Rock_Don",
        "review_rating": "9",
        "review_title": "Never Felt Like This In a Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "krational66",
        "review_rating": "9",
        "review_title": "Me and my father.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "zeekwunlau",
        "review_rating": "8",
        "review_title": "Crying mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "danielpereira-ramirez",
        "review_rating": "9",
        "review_title": "A common feeling to many in this world.",
        "review_detailed_main": "An excellent film, not extraordinary, but it appeals to a feeling that many of us who belong to countries that have suffered dictatorships have: the intense pain inflicted on thousands of families with loved ones who have disappeared, tortured and massacred in the most cruel way. Fortunate are those who have not suffered closely. By far I liked Salim's role more, apart from the boy whose acting is compelling. The other aspects of the film are of good manufacture. PD: Translated with google, you shoul enable posting in other languages."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "zzhhhqing",
        "review_rating": "9",
        "review_title": "The two loves between father and son deeply moved me",
        "review_detailed_main": "The two loves between father and son deeply moved me, especially when the old man finally opened his arms to make a hug gesture. Through the gaps and contradictions between father and son in an ordinary family, let us experience the warmth of the family, no matter how far away from home, I believe that people who wander outside, whether they have their own new home or not, The inherent sense of belonging can only be truly felt at home. The gap between children and parents is also easy to eliminate, because no matter which side, they are deeply in love with each other."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "dickconradie",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "\"My Father and My Son\" (2005), a Turkish film directed by Irmak, is a poignant and beautifully crafted drama exploring the complexities of family relationships. The story, centered around a strained father-son relationship that evolves through tragedy, is told with deep emotional resonance and authenticity. The performances are superb, with each character bringing a heartfelt depth to the narrative. The film's portrayal of generational conflict, reconciliation, and the enduring bonds of family is both moving and relatable. Its subtle direction and evocative cinematography enhance the storytelling. A touching and thought-provoking film, it's a testament to the power of forgiveness and understanding."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "serdarbulud",
        "review_rating": "9",
        "review_title": "One of the most important works of Turkish cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "erginaylak",
        "review_rating": "10",
        "review_title": "True 10/10",
        "review_detailed_main": "No movie has ever moved me as much as this one! I cried like a hysterical mad woman. The acting is superb, the little boy is amazing !"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "gsamshib1",
        "review_rating": "10",
        "review_title": "A must-watch for family lovers",
        "review_detailed_main": "This film is a true cinematic gem, combining breathtaking cinematography with a well-crafted screenplay that keeps viewers engaged from the very first frame to the closing scene. Every shot is meticulously framed, and the visual storytelling enhances the emotional depth of the narrative. The screenplay is expertly structured, creating a seamless flow of moments that build toward a profound emotional payoff. The story itself is not only captivating but also deeply resonant, leaving a lasting impression long after the credits roll.\n\nWhat makes this film stand out is its exploration of universal themes that transcend borders and cultures. While the world is undeniably rich in its diversity-filled with people of different colors, backgrounds, traditions, and principles-the film reminds us that when it comes to family, we are all fundamentally the same. This core truth, that family bonds are a shared experience across humanity, is beautifully portrayed in the film, allowing audiences from all walks of life to connect with its message on a deeply personal level.\n\nThe story touches on the complexities of human relationships, particularly within the family dynamic, revealing the tensions, sacrifices, and love that define these connections. It speaks to the universal struggles of family life-the misunderstandings, the unconditional support, and the moments of pure joy-that are familiar to everyone, regardless of where they come from. This powerful message resonates deeply, reminding viewers of the shared bonds that unite us all in our experiences of love, loss, and belonging.\n\nThe film is not just a visual spectacle but an emotional journey, weaving together layers of storytelling that evoke both thought and feeling. Its ability to balance moments of subtle beauty with raw, heartfelt emotion makes it a unique viewing experience. In every scene, the film seamlessly blends visual artistry with a deeply human narrative, creating a work of art that is both moving and visually stunning.\n\nIn conclusion, this is a film that transcends entertainment, offering a rich and meaningful reflection on the human condition. It touches the heart in a way that few films do, blending emotion and beauty in every scene. It is a must-watch for anyone who values family, storytelling, and the shared experiences that make us all human. This film is not just a story-it's an experience that will stay with you long after you leave the theater."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "utku_kobe_1993",
        "review_rating": "10",
        "review_title": "A masterpiece",
        "review_detailed_main": "Such a great movie with the Turkish traditional relationship with the family members and the movie gives the audience the best feeling of drama. One of the movie which should be watched!"
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "h-28658",
        "review_rating": "8",
        "review_title": "Nice family movie.",
        "review_detailed_main": "A very emotional film about a man who returns back to his village home with his kid. The father son relationship is beautifully captured."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "DogukanGultakti",
        "review_rating": "8",
        "review_title": "mopey story and family relationship",
        "review_detailed_main": "On an individual basis, I like this movie because it includes everything about the family relationship as dram, sadness, humorous, compassion, hatred which are actually explain family relationship. Besides, movie starts from 1980 Turkish coup so we can learn Turkish history as well as we can understand difficult situation on that time in Turkey. Also, we can enter the child's world who is a motherless. I do not know someone who did not cry in this movie. I remember my grandpa and my father when I watch this movie, I remember my childhood with amazing soundtracks. Both \"my father\" and \"we will meet again\" songs are so emotional and mopey and these songs help me to trip down memory lane because all childhood memories are actually mopey for me."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "a-07779-75123",
        "review_rating": "8",
        "review_title": "The father son relationship is beautifully captured.",
        "review_detailed_main": "A very emotional film about a man who returns back to his village home with his kid."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "azadav",
        "review_rating": "10",
        "review_title": "An emotional masterpiece",
        "review_detailed_main": "An emotional masterpiece.An extremely special way of presentation.must watch..."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "paulvarghesedu",
        "review_rating": "10",
        "review_title": "Live Life on Screen",
        "review_detailed_main": "The people are so original like they are really living on their life. Makes me cry through out the movie."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "raghavmittal2003",
        "review_rating": "10",
        "review_title": "It's a must watch movie ! Will be always in my top 10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "spicy_bee",
        "review_rating": "9",
        "review_title": "A simple yet complicated life",
        "review_detailed_main": "This movie is setup like some regional Indian movies except there are no songs to dampen the mood. It is a beautiful depiction of simple rural life in Israel following a contrast in city life that is mixed with turmoil and conflict. It covers three generations of a family coming together.\n\nThe movie depicts how you can never forget your roots or stay away from it and whatever happens life comes full circle. You can each take your own meaning out of the movie, the father may regret his actions as his heart is filled with his childhood memories or it may just be a recollection of his simple life. The sons imagination runs wild and is amazing to behold while the grandfathers stubbornness stays grounded in reality.\n\nIt is a nice family drama and the movie captures all of it beautifully till the end."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "berkebalkan",
        "review_rating": "10",
        "review_title": "Every good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "Massimovic",
        "review_rating": "10",
        "review_title": "Perfect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "timucinhatipoglu",
        "review_rating": "9",
        "review_title": "AWESOME",
        "review_detailed_main": "This film is so emotinoal. The only film which I cry. Cetin Tekindor is very succesfull artis in Turkey and aslo Director Cagan Irmak is very popular in Turkey. I strongly advice you to watch this masterpiece."
    },
    {
        "movie_id": "tt0476735",
        "movie_name": "My Father and My Son",
        "movie_rating": "8.2",
        "review_username": "hkjnsvqcdf",
        "review_rating": "",
        "review_title": "The Mediterrenean way of life",
        "review_detailed_main": ""
    }
]