[
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "bertbert",
        "review_rating": "5",
        "review_title": "Mediocre Horror",
        "review_detailed_main": "OK, so it isn't the best horror movie ever made, but it also isn't the worst.\n\nThe premise is reasonable (for a horror) and despite a few plot holes the film manages to build the suspense. Alba's acting is not exactly award winning, but she does enough to avoid you disbelieving the character.\n\nThe biggest gripe I have is that the ending is a bit of an anticlimax. After the build up (I think there should have been a bit more with the apartment residents) it just fizzled out.\n\nOverall I wouldn't rush out to buy the DVD, but if there isn't anything else on, you could do worse."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "BA_Harrison",
        "review_rating": "4",
        "review_title": "Another blinking remake!",
        "review_detailed_main": "With virtually every successful Asian horror movie of the last few years having already been remade by Hollywood, it was only a matter of time before Gin gwai (AKA The Eye) got the treatment, despite the original not really being all that great (I found it fairly entertaining, but unexceptional\u0097my rating: 6/10).\n\nJessica Alba plays Sydney Wells, a blind violinist who receives a cornea transplant only to discover that her new set of peepers allow her to see much more than she had originally bargained for: Sydney can see dead people!! Aided by her doctor, she attempts to unravel the terrible secret behind her scary supernatural power.\n\nDirected by David Moreau and Xavier Palud, The Eye is a totally unnecessary and dreary remake that copies parts of original verbatim, alters scenes that should have been left well alone (the creepy cafe meat-licking scene has gone, and the downbeat ending has been swapped for a typical Hollywood crowd pleaser), and totally botches what should be the scariest bit of the whole film (the lift scene is VERY disappointing).\n\nTake my advice: If you've already seen Gin gwai, then stay away from The Eye."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "DICK STEEL",
        "review_rating": "6",
        "review_title": "A Nutshell Review: The Eye",
        "review_detailed_main": "So I haven't watched the original Eye movie by the Pang Brothers, but I guess with remakes these days, it doesn't really matter, since most of the time, the Hollywood remade version pales in comparison with the original, despite having a bigger budget, bigger stars and of course, better visual effects. And what almost always seem woeful, is the attempt to try and recreate the atmospherics for a spook fest that Asian horror had perfected, and I'm inclined to suggest that they should adapt the storyline (since there's a creative dearth of ideas), but leave the mimicking of mood at the door.\n\nThis is probably the first movie that Jessica Alba marquees, and comparisons would be abound for those who've watched the original to compare her to Angelica Lee's performance. But really, I don't think it matters, since all you need to do is to look scared. As blind violinist Sydney, Alba escapes the need to act blind given the cop out of using shades, coupled with the fact that her transplanted eyes allow for the camera to be out of focus for the most parts.\n\nThings start to get interesting when she begins to see shadowy figures borrowed straight out of Pulse (yet another Asian horror remake), and these all get conveniently debunked by her doctor Paul (Alessandro Nivola who stars as the hopeless, formless Gavin Harris in the Goal movies), because if you're blind for so many years, your brain needs some major time out to absorb all the new sights you're constantly bombarded with. So goes as with standard horror fare, that those who can see spirits when others can't, are classified as nutcases. Alba's no scream queen as the proceedings don't allow her to exercise her lungs, and I swear there are just too many of those waking up from nightmare moments, and the clock ticking around 1:05am.\n\nBut credit is due though to the scenes which aim to frighten, and some did hit the mark even though they're the usual tools to surprise from the bag of Boo tricks. There are, to me, a major unexpected moment which I had to nod in acknowledgement of not seeing it coming (I had thought otherwise), but unfortunately, that was it. The latter half of the journey became a road trip movie which seeked answers, coupled with Hollywood's preoccupation of having to explain and show everything, leaving little to your imagination since everything was spelt out. While the story's not at fault, the way it's presented made this look like a standard mystery thriller, without the mystery, and without the thrills.\n\nAnd the finale was a little lacklustre as it seemed to be styled in Final Destination fashion, making it look like it had no more rabbits to pull out of the hat. The Eye had plenty of neat visual effects, and although there are some beautiful stunts involving glass shards and the walking through of objects, special effects alone do not make a horror movie spine-chilling. Looks like there's some major sty in this eye."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "applesauce91-2",
        "review_rating": "3",
        "review_title": "It Could Have Been So Much More...",
        "review_detailed_main": "I really wanted this movie to be good. Really. I think Jessica Alba is an extremely talented actress, and I had high hopes for this movie. J horror remake, interesting premise, Jessica Alba...sounds good so far.\n\nBut this movie left me disappointed in when I saw it last night. The movie relies on cheap thrills that aren't frightening to the mature moviegoer. I should have expected this, as it was rated PG-13, but the theatre full of screaming 11 year olds at every jump was quite irritating.\n\nWhen it was all over, The Eye left me wanting more. The only thinking and mystery in the movie is done for you and the \"science-talk\" from Alba seems unrealistic. It relies on loud noises and horror movie clichés at every turn. The Eye is a definite popcorn movie. It may be entertaining for younger viewers, but if you want a deeper and more engaging story, look elsewhere."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "dfranzen70",
        "review_rating": "7",
        "review_title": "Blurry around the edges, but still a fine sight",
        "review_detailed_main": "The Eye (2008) I knew going into the theater that this would be a bit scary. OK, maybe traumatizing. I had a LASIK procedure done a couple of years ago, and although I wasn't blind beforehand, I did have pretty bad eyesight. I know a bit about the trepidation - perhaps even outright terror - one feels before undergoing an operation on one's eyeballs. I still get a little skeeved when I see a closeup of eyes, come to think of it.\n\nJessica Alba plays Sydney, a blind concert violinist who has a double corneal transplant, and of course things go wrong. Not with the surgery itself, but with the psychological aftermath - she sees dead people. And dead things. And undead. And so on; it looks like she's tapped into a spiritual world, or something. No one else can see what she's seeing, which is par for the course in movieland, but all of the demons and smoke and fire and other sfx seem extremely, utterly, real to Sydney.\n\nAlba is excellent, showing that she has more than just two (or three) talents to show the world. Her Sydney is appealing in her vulnerability; Alba, a beautiful young woman, manages to make you feel as if her character could, indeed, live in your world: less glitzy starlet, more three-dimensional person. Of course, she's still a knockout, and she IS a supremely talented musician, and she DOES live in a super-posh apartment in a high rise, but still. Alba shows wonderful range, from tender to fragile, without giving up any sincerity. The movie hinges on her ability to sell the audience on her character's Everywoman (to a point) status, and I think she delivers.\n\nSome of you may be thinking you've already seen this movie before, when it was called Blink. In Blink, Madeline Stowe played a young woman who lost her sight as a child (as did Sydney) and then grew up to be a talented violinist; after a new eye operation temporarily restores some sight, she sees things. Just like Sydney. Huh. Still, this isn't a redo of Blink, it's a remake of a Chinese film called Gin gwai. Asian films have made the rounds of Hollywood in recent years (The Ring, The Grudge, Dark Water), and although the remakes usually don't have the subversive bite of their original counterparts, some of them hold up rather well when inundated with high-tech CGI. The Eye does use special effects, but it uses them - pardon me - to great effect; you're not overwhelmed with attention-grabbing CGI.\n\nThe biggest debit in the movie is the love interest, Sydney's doctor, Paul (Alessandro Nivola), who seems dull and unimportant, although his believing in and trusting Sydney is a linchpin for moving the plot. He just seems vacant and stiff, hardly a commendation of Nivola's acting abilities. (Think of a younger Dylan McDermott.) On the other hand, a good counterbalance to Nivola is Parker Posey as Sydney's concerned sister, who, although she doesn't immediately buy into Sydney's rantings, does empathize and attempt to understand a bit better than the hunky doctor.\n\nOverall, The Eye is a tense, shudder-filled movie that manages to dress up a recycled plot with dead-on performances and evocative cinematography."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "esnow1",
        "review_rating": "3",
        "review_title": "Cookie cutter rip-off with unneeded changes",
        "review_detailed_main": "If you watch this movie, be aware that Gin-Gwai (The Eye)came first. There have even been two sequels. The third one was called The Eye 10 as a marketing ploy by the US director. It is truly awful, so avoid it like the plague.\n\nThat being said, the thing that both US influenced versions have are a total lack of creativity, suspense, or originality. It is a pity that Ms. Alba chose this role, as it was merely a shell of the original film. Every scene was reproduced in a typical US-dumbed down format, with typical cheap Friday the 13th scares thrown in. This version ironically lost sight of the original vision of the Pang Brother's classic. Instead, they change key plot elements to \"add to\" the suspense, IE: American audiences can't think, so we have to hold up a sign that says \"SCREAM\".\n\nDo yourself and others a favor and rent, or even better buy a copy of the original. You will not be disappointed. Sadly, the same cannot be said for yet another cheap, unimaginative, 80's camp pile of garbage rip-off in the mold of The Grudge, Hide and Seek, and Dark Water. Don't even waste your time downloading this tripe."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "rooprect",
        "review_rating": "7",
        "review_title": "Good movie but NOT for horror fans",
        "review_detailed_main": "If you're looking for a pulse-pounding horror thriller, you won't find that here. If you're looking for a spooky ghost story, you might want to move on. If you're looking for blood & guts & body parts, don't even waste a minute of your time.\n\n\"The Eye\" isn't so much a horror flick as it is a supernatural drama.\n\nThis film is a remake of the 2002 Chinese \"The Eye\" which I haven't seen, so I can't (and probably shouldn't) compare the two. I thought this was a nicely done film, more of an intimate character study than a scary \"gotcha\" flick. In that respect it's similar to \"The Sixth Sense\", and not just the story. Like \"The Sixth Sense\" which was a slow moving psychological drama that just happened to have dead people in it, \"The Eye\" takes a personal approach as well. And while that may bore the audience members who are expecting some screams, it ultimately results in a film with a little bit more to say than your average screamer.\n\nJessica Alba (\"Sydney\") does a great job of playing a woman who has been blind since age 5, a loner, someone who doesn't seem to have many connections with people and she likes it that way. The underlying theme is that her blindness makes her feel unique, exempt from the real world. When she regains her sight after 15 years by a corneal transplant, it's not necessarily the wonderful experience you'd expect. There's a scene when she comes back from the hospital to a surprise party, and the scene is filmed with unsettling, distorted closeups of strange faces. It perfectly expresses the confusion and claustrophobia of not just a blind person gaining her sight, but that of an introvert being forced into society. That enough could've been enough for a feature length film: how a woman deals with the \"gift\" of sight which she doesn't really want. But it doesn't end there. She starts seeing dead people, too.\n\nWhile we never really feel like Sydney is in any deadly peril, there are a few very effective surprises which, I gotta admit, quickened my pulse a few notches. Also the \"shadow men\" were very creepy, and if you want to see a real shocker, check out the bonus features where we learn that the shadow men are not cgi graphics, but it's an actual dude... a sort of living skeleton who looks just as bizarre in real life than on screen.\n\nThe 2nd half of the film becomes a mystery as Sydney tries to figure out why she's getting these disturbing visions and what she's supposed to do about it. Again, no hair raising car chases or shootouts here, just a thick atmosphere of the unknown.\n\nLike I said, I haven't seen the original Chinese film, but I can tell that the American filmmakers were trying to add a degree of backstory. In the bonus features they talk about the science of \"cellular memory\" (the idea that donated organs possess characteristics that are imparted to the new recipient). So I can assume that this is less of a visceral shocker (like the original?) as it is an intellectual approach. There's also the psychology bit I mentioned above. And it also touches on the idea that artists, musicians & creative thinkers are more sensitive to supernatural events (Sydney is a concert violinist). In short, \"The Eye\" sacrifices the raw approach of a typical action-horror flick, and instead replaces it with more of a slow-moving, scientific or \"rational\" approach to the supernatural.\n\nDepending on your preference, that's a good or bad thing. I can go either way depending on my mood; once in a while I like to think, whereas other times I just want to see Freddy slice some people to ribbons. \"The Eye\" definitely falls on the thinking side of that scale. Other thinking horror flicks I recommend are \"Exorcist III\" (one of the BEST), \"The Others\" with Nicole Kidman, and of course \"The Sixth Sense\"."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Carrigon",
        "review_rating": "2",
        "review_title": "The Eye of Boredom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Simon_Says_Movies",
        "review_rating": "7",
        "review_title": "A Monkey Theorum Movie",
        "review_detailed_main": "The infinite monkey theorem states that a monkey hitting keys at random on a typewriter for an infinite amount of time will eventually produce the works of Shakespeare. Coincidently, this same theory applies to the onslaught of Asian horror remakes that is stomping Hollywood into submission. If enough of these films are remade, then eventually one will be acceptable, and alas it has happened.\n\nThe Eye, starring Jessica Alba is directed by two relative first timers by the names of David Moreau and Xavier Palud, and they can certainly create a film that boasts certain elements of stylish direction. Unfortunately, along with the good, it seems that all of this style of remake fear deviation from a backbone template. Not to give anything away to those who are not familiar with Asian horror remakes, but one element that is consistent is that the basis of all the evil happenings is from a spirit looking for salvation of some sort. While The Eye, does choose to spin this cliché slightly, it is afraid to go all the way.\n\nSuffering from total blindness after a childhood accident, young beauty Sydney Wells (Alba) is given a chance at an eye transplant that will allow her to see for the first time in decades. Not surprisingly, she begins to see things that ought not to be. Aided by an appointed shrink, played by Alessandro Nivola, they confront the visions and try to track the donor eyes back to their sinister source. This journey is bounds more intelligent then the average horror story, and the standard for dumb decisions is cleverly hidden by the fact that Sydney is fully or partially blind for most of the film. This presents a cushion of forgives per se, as her lack of sight can lead her into frightening situations, without appearing ignorant.\n\nAnd there are certainly some frightening \"boo\" moments; uniquely accentuated by a well used pallet of sound. There are also exactly three expertly executed scenes, worthy of recognition. The first is a scene in which a blurry eyed Sydney looks into the mirror for the first time with creepy consequences; the second features a member of the un-dead accompanying her in an elevator and the third takes the form of an intervention between a mother who has recently lost her son. If The Eye had presented more scenes of this Claiborne, it certainly could have been something special. Instead, the ending descends into the mediocrity, which at first seemed more then acceptable, but took off into a sixth sense meets final destination action spin off; which although still thrilling, did not fit the tone and atmosphere of the former acts. The \"blurry vision\" that is used early on with some skill, is overused by the end, the flashbacks replace the more effective quick cutbacks and it simply does not hold onto its success.\n\nThis is however Alba's best performance, and although not saying much, this shows there is hope for her future acting career. While more films like The Eye would be welcome, I think it better to forfeit the Asian remakes all together, then to wait for the monkey's second draft.\n\nRead all my reviews at: http://www.simonsaysmovies.blogspot.com"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "matthewmatcalfe",
        "review_rating": "2",
        "review_title": "Jessica Alba Kills Another Movie Dead",
        "review_detailed_main": "Jessica Alba's complete lack of acting skills is pretty obvious to everyone, except apparently movie producers.\n\nMaybe it's because they're blinded by the countless photographs she takes in various conditions of undress.\n\nRegardless, here again she gives yet another frightfully bad performance. So bad that you can't really even call it a performance.\n\nJessica Alba was born to be a bikini model and that's exactly what she should do. She shouldn't act, but if she really feels she must, she could at least take some acting lessons.\n\nThe Eye will die, like all Alba movies, because of her complete lack of talent and skill."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Juliusus",
        "review_rating": "10",
        "review_title": "Why does everyone hate this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "maxmillion99",
        "review_rating": "7",
        "review_title": "Effective scares and an excellent dramatic lead performance from Jessica Alba",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "grangers-1",
        "review_rating": "5",
        "review_title": "Alba reminds us that you may want to check where that donated organ came from.",
        "review_detailed_main": "Jessica Alba plays a woman who undergoes cornea transplants in a remake of a Chinese film of the same name.\n\nThe moment she opens her eyes she starts to see things that aren't there. These include (a) a number of grim reapers, (b) recently dead people, (c) vivid images of someone else's past premonitions, and (d) a director and editor who aren't sure whether their making a horror film, thriller or a 'who dunnit?'.\n\nThere is a faint oriental air to the film with does add a bit of mystery. This is essentially a relatively cheaply made Alba-vehicle. There is no-one else in it other than a periodically appearing sister and a doctor who you never quite get interested in as he has nothing of worth to say.\n\nYou do jump from minor shock every now and then (but then an unexpected rapid orchestral crescendo does that to most people).\n\nThe film is similar in feel to Sarah Michelle-Gellar's The Grudge. You are left with a similar feeling when you leave the cinema; a resigned \"it was okay\"."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "DrBlood2006",
        "review_rating": "1",
        "review_title": "I see boring people",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "rlange-3",
        "review_rating": "7",
        "review_title": "Better than I expected it to be. Alba's acting was quite good",
        "review_detailed_main": "It would be hard to describe this one as scary, but it definitely had some eerie moments and scenes and overall was entertaining. While I'm pretty skeptical about the underlying concept, i.e. \"cellular memory\", there are clearly a number of adherents and it's worth popping the keywords into a search engine -- like Alba did in the movie -- to better understand the underpinnings of the film.\n\nOverall I thought The Eye was well acted by both leads, as well as the supporting cast. Alba and Nivola carried the plot by encouraging us to suspend disbelief at some of the less credible incidents. The scenes of Alba playing violin featured superb talent on the part of the orchestra, both musically and visually and helped anchor the film at both ends.\n\nThe one real drawback was that it was slow at times, and a little boring. But it was too intriguing to abandon before the end, where the pieces were neatly tied together.\n\nOverall worth watching and mildly thought provoking."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "gavynhelfyre",
        "review_rating": "3",
        "review_title": "Not worth your time",
        "review_detailed_main": "I had a hard time watching this movie. Everything that worked in this was directly lifted from the original, everything else... didn't.\n\nThe director tries to built tension in places where none exists. The screen writer tries to \"improve\" on the mystery of the original but the results don't work, giving itself away from he very first \"vision\". The acting was below par for most of the cast, with characters coming off as two dimensional for the sake of moving the plot along- and Jessica Alba needs to realize she gets film jobs for her looks not her talent.\n\nAnyway, if you're thinking of watching this, don't. It's not scary. It's not suspenseful. It's not even original. It's a waste of your time and money. Rent the original or watch another film instead."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "robertallenandersonjr",
        "review_rating": "7",
        "review_title": "Not as bad as people make it sound",
        "review_detailed_main": "The Eye was not a great movie but it's not horrible either. It was about an average movie. I was not expecting a lot going into seeing this movie. If you are expecting a lot going into this movie it will not be good but if your just looking to see a movie and thinking its going to be good you might actually like it. Pretty much the whole entire beginning and almost all of the middle was boring and just had very sudden scenes that would get you to jump out of your seat. The rest of the movie was when it started to kick up and get good. Jessica Alba finally started to find out what she had to do and what was going on with her and people around her. Thats when the action started and it had you on the edge of your seat. For the most part it was pretty slow moving and boring but then it kicked up it was good. If the first hour of the movie was like the end it would have of been an excellent movie. So if your looking for a pretty scary movie with lots of things that pop out at you go see this. The story was actually pretty good as well. The fact that it made you wait to find out why she became blind was well done. The acting job Jessica Alba did was good as well. The visual effects for this movie were also awesome."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "weemonk",
        "review_rating": "1",
        "review_title": "Eye ryhmes with why and that is the question",
        "review_detailed_main": "And so it is that yet again American producers and writers can not think for themselves as yet another remake goes wrong.\n\nI liked the original Pang Bro's version. They do some good films. I had no faith that this remake would do the source material justice in any way and it didn't. I don't quite understand how all the Japanese/Chinese/Korean/Thai remakes miss the mark. Maybe it's the $$ signs that the American rip off artists see and care about most.\n\nThe Eye manages to keep the basics from the original film but looses the tension and atmosphere. It's such a disappointment. Just a bit more work by the writers and they might just have managed to translate to American audiences what the Pang Bro's original film did. Even having 2 directors on this film could not recreate the freshness of the original. What we end up with is another run of the mill, quick scary images and quick scary noises, horror remake. The characters are flat are you really don't care for them. The story is not as involving as it should be and really isn't the best . The realisations near the end of the film in the original which catch your attention and make you think are completely lost in this remake as you really don't care and haven't been given enough reason to care about the main characters.\n\nThere's no point in commenting on the actors or such as the generalisation now for these remakes is that Hollywood and the big shots care only for money and have not got the foggiest idea of how to be original or to take a concept and pay homage to it's source material and ideas. It's a shame the lamen out there don't culturalise themselves with world cinema - if they did, we wouldn't suffer crappy remakes. Shame people are too lazy to read subtitles."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "amparosupelano",
        "review_rating": "6",
        "review_title": "Descent thriller",
        "review_detailed_main": "First am going to admit I didn't watch the original. Am not a guy that likes to watch foreign films, so I will spare you with any comparison. The movie at the beginning moves sort of slow. They do put some parts that are meant to scare the viewer, but they did seem contrived and really didn't scare me. But as the movie plot thickens, the movie starts having a real story, and it does entertain the viewer, not just a gimmick of spooky special effects, with absolutely no plot. I would give this movie a 6.5. It turns very solid towards the end.\n\nI do agree it could be a little bit tedious at the beginning, but if you are a guy that has the patience, towards the end, it picks up well. Not the scariest movie ever though, but in the end, it did deliver. I've seen way worse, and I think some are being somewhat to harsh.\n\nSolid move, a 6.5."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "claudio_carvalho",
        "review_rating": "4",
        "review_title": "The Awesome \"Gin Gwai\" Reduced to a Mediocre and Noisy Remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "poisonedsodapop",
        "review_rating": "10",
        "review_title": "Loved it!",
        "review_detailed_main": "I'm not a fan of horror in any way but my friend really wanted to see The Eye and I went with him to see it. I do like Japanese horror and seeing as The Eye was a remake of a Chinese film I hoped to enjoy it (if that makes any sense). I hadn't seen the original but my friend gave me a summary of the original so I knew what to expect.\n\nSo I can easily say I loved it. It was well done and kept me interested the whole way through. The film effects were very believable (I won't reveal what they were for those who don't know the plot) and the story was a good one. I think if you're looking for a horror movie with a ton of blood this is definitely not the one to see. It's not a movie with a serial killer who kills everyone off. But if you're into supernatural thrillers then this is definitely what you're looking for. A little bit of mystery with the right effects to still make you jump."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "drownsoda90",
        "review_rating": "7",
        "review_title": "\"These Are Not My Eyes.\" -- Slightly Better Than Most Would Expect.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Crackhouse2",
        "review_rating": "1",
        "review_title": "Had to take my eye off it",
        "review_detailed_main": "To be quite honest, with this trend of Japanese horror films being given the western re-rub you can't help but feel they're just being used as premade films for Hollywood to churn out with the current hottie of the hour at the ship's helm. The Grudge wasn't too bad, still a bit eery, same goes with The Ring, but all this does is sets itself up for a barrage of Scary Movie 5 jokes. From the get go it didn't really appeal to me, I think the commercial psyched me out more and not even that was that effective. More often than not, if not always, the translation is never half the film the original was. Before they're remade the Japanese aren't afraid to have that little bit more dialogue to get a little more tension, whereas here they just cut to the chase before you even realise the scene has been set. Anyways, enough of my opinion on Hollywood and these remakes, on the whole, couldn't watch it to the end, bored me stiff, watch something which might actually scare you like Pet Cemetery or 1408, but i don't recommend you watch this suitable for kids nonsense."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kxok630",
        "review_rating": "3",
        "review_title": "Idea had potential, but this Eye ends up an Eye-sore",
        "review_detailed_main": "They've done it again: taken a highly successful foreign-made horror movie, and smeared it with lousy interpretation and cheap horror \"jump out at you\" scares for a fast food trash fest that is an insult to the original. The film makers bank on a high profile name for box office dollar signs, which invariably turns out to be a actor that wouldn't be convincing in the horror genre if you slipped a snake into their sleeping bag.\n\nThe movie victim this time is Gin Gwai (from Hong Kong), which boasted clever writing to advance the intrigue of the main character's plight, and effected the terror in a logical and eerie way. A blind woman (an accomplished violinist) undergoes an operation which gives her sight. Along with normal vision, she unfortunately gets psychic vision as well. Not a bad premise (although it's been done a few times in the past), but this film just takes the idea and runs it through a meat grinder.\n\nJessica Alba is woefully miscast in this potentially complex character whose terror we are supposed to experience vicariously. I was too busy laughing to believe she was blind, experiencing the gift of sight for the first time, being menaced by nightmarish visions; let alone feel for her or care about her ultimate fate. As a result, the outcome is anything but scary; cartoonish is a more accurate description.\n\nMore laughs than scares. Jessica is at least pretty, but that's all she has to offer in this inept affair. See the original version, instead."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Magellan Grey",
        "review_rating": "7",
        "review_title": "Jessica Alba Tour d' Force...",
        "review_detailed_main": "Jessica Alba carried herself very well in this movie. Her characterization is very believable. This is definitely a tour d'force for her. The story is good and the supporting acting is also very believable. I have to question the violin playing coaching. Jessica's \"playing\" movements were very weak. The movement of the bow was totally unconvincing. She kept bowing up and down out of sync with the flow of the music. That is the fault of the coach. I've seen better fake violin and piano playing. But this is minor to the rest of the movie. As I said, Ms. Alba was wonderful in this film. The film itself had lots of great shocks and twists. When it comes out on DVD I am definitely buying it."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "Alba in Another Stinker",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "candidaheaton",
        "review_rating": "6",
        "review_title": "Giving this movie a 6",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MovieAce93",
        "review_rating": "4",
        "review_title": "a pointless and extremely \"hollywoodnized\" remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "dbborroughs",
        "review_rating": "7",
        "review_title": "Better than most recent Asian horror retreads",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Good scares, big flaws",
        "review_detailed_main": "We have just gotten over the big craze that was Jessica Alba, which I felt so bad for the girl, someone gets brutally publicized and rubbed in your face for how hot they are and how hot you'll never be, they tend to become box office poison and bashed by the public. So naturally when The Eye was released this year, it didn't make number one and was automatically canned as a bad movie; me? I just preferred to wait for the rental, I watched The Eye at home the other night and actually it wasn't as bad as I was expecting from some of the comments here on IMDb, I was expecting this to be a terrible movie. Normally most of the American remakes of Japanese horror films are, but The Eye does deliver some good scares, until the ending. Not to mention, bad casting, Jessica Alba is fine, the script is bad, and for a blind woman who lives alone, she dresses very well and her hair is perfect. The script just wasn't realistic and the actors over did a lot of the movie and it makes you just want to scream at the screen.\n\nSydney Wells is blind, lives alone, plays the violin, and everyone just loves her. She finally gets an eye transplant, everything seems to be going fine, until well, I figured out from this movie, don't just ask if you donor was health, a non smoker, non drinker, drug free, also, ask if they saw dead people. Because that's Sydney's problem, she is seeing people die right in front of her and she has to learn what this power was meant for and must find out about the donor and her creepy history.\n\nNow The Eye has some creepy moments, though I'm not a big fan of the jump scares, they got me a few times. But once again, the CGI, it's very noticeable and cheesy, was it just me, or did it seem like the creatures that took these people's souls to wherever, were just a cheap rip off of Ghost? Not to mention that the script was cheesy and the ending wasn't up to par with what this film could have been. I know there are lovers of the film and there are haters, but I can't help but be between because the movie had potential, there are just some flaws here and there. Jessica Alba being perfectly beautiful throughout the film, the lines, the way it seems like every \"crazy\" person really does act crazy throughout the film and shows everyone how crazy they are, just you'll see what I mean if you watch this film.\n\n5/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "8",
        "review_title": "The Eye makes for a very entertaining thriller...not mind blowing but very good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "hu675",
        "review_rating": "7",
        "review_title": "Technically well made film has its moments but you wish, it was much better.",
        "review_detailed_main": "Sydney Walls (Jessica Alba) has been blind by the age of five. Since that unexpected incident, she still lived a good life and also playing the violin quite well in a group orchestra. When she's getting her eye sight back after years being blind. At first, she has a tough time seeing things and especially gets blurry to her see. But after a few days later... she starts seeing things that are not supposed to be there like the rooms would be changing, quick flashes of disturbing images and people are not what they seemed to be. At first, her doctor (Alessandro Nivola) and not even her own sister Helen (Parkey Posey) would believe her. Sydney slowly realized that she could see the presence of the supernatural that exist in the real-life, thanks to her new set of eyes. Now Sydney tries to find out, who was the person's eyes she has now and what does it want before it's too late.\n\nDirected by David Moreau and Xavier Palud (Ils) made an modestly entertainment supernatural thriller with a few elements of horror. Alba is actually quite good in the lead, she gives an better performance than i would expect from her. But the screenplay by Sebastian Gutierrez (The Big Bounce \"2004\", Gothika, Snakes on a Plane) has one thing that truly never delivers in his script, it's not even scary or creepy sadly. Although i never seen the original 2002 Hong Kong film of the same name. I am sure, the 2002 version is much better. For many Hollywood remakes these days, i tried to watch the originals first before seeing the hit or miss Hollywood remakes. Which it is very rare, a Hollywood remake would be just as good or even better than the original.\n\nDVD has an sharp anamorphic Widescreen (2.35:1) transfer (also in Full Screen) and an strong Dolby Digital 5.1 Surround Sound. Originally, this movie was supposed to be come out last year in the fall but Lions Gate change the schedule for a early winter 2008 release. They felt the movie needed some major re-shoots. Which the filmmakers Moreay and Palud didn't felt it was necessary. Editor of the movie Patrick Lussier (Who's best known for editing some of the better Wes Craven films and Lussier also directed films like \"Dracula 2000\" and the two direct to videos features) actually did the re-shoots himself and this version was probably more toned down than the filmmakers originally intended.\n\nGutierrez's script is certainly nothing new, since it reminded me of \"Blink\" and even \"Gothika\", a script that Gutierrez's wrote. The picture does has some interesting moments at times but the script is predictable and you could see the climax coming before the movie ends. You wish, the movie ends in a more satisfying disturbing note but it never happens. It is probably why Moreau and Palud disowned the final cut of their first Hollywood production. The happy ending seems out of place with the rest of the feature. Overall, it is worth seeing for Alba's role and her fans will liked this movie even more than others. Fans of supernatural thriller will be somewhat disappointed with this picture. Watchable but nothing memorable. Also available in a Two Disc Set. Super 35. (***/*****)."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "metacracker",
        "review_rating": "1",
        "review_title": "Predictable movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "ominosity",
        "review_rating": "1",
        "review_title": "I wish I was blind so I wouldn't have seen this awful film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "disdressed12",
        "review_rating": "7",
        "review_title": "freaky",
        "review_detailed_main": "this film is a remake of an Asian film,which seems to be all the rage these days,and has been for quite some time.who knows how long this trend will last.anyway,i haven't seen the original,so i can't compare the two.as for this remake,i liked it for the most part.it has some pretty freaky moments alright.it's not really scary Per Se,but it is definitely unsettling.Jessica Alba is not too bad in this movie.in fact she does a better job than i thought she would.aside from being a remake,the premise of this movie has been done before in probably two movies,the names of which escape me.there are a few slow moments in the movie.but mostly it's good.i really liked the ending.i though it elevated the movie a bit.i wasn't expecting it to end the way it did.for me,The Eye is i a 6.5/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "the_last_galerian",
        "review_rating": "1",
        "review_title": "Epic Fail.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "mm-39",
        "review_rating": "6",
        "review_title": "More suspense than a horror movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "4",
        "review_title": "Watching with one eye shut",
        "review_detailed_main": "In \"The Eye,\" a remake of a Chinese movie from 2002, Jessica Alba plays a blind woman who gets her sight back thanks to a successful cornea transplant. The only hitch is that with her new eyes - which were donated by a young lady with psychic powers - comes the unasked-for ability to see into the spirit world and predict the future.\n\n\"The Eye\" might have been an interesting film had it focused solely on how a once-blind girl learns to adjust to life in a suddenly sighted world. Instead, we're subjected to an inane, gimmicky thriller in which the heroine improbably manages to run across either a dead person or someone doomed to die just about every time she turns a corner.\n\nThere's no end of point-of-view shots in which ghouls jump out and yell \"Boo!\" at the audience, but the whole thing is about as scary as a youngster dressed in a bedsheet doing the same thing on Halloween."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "UniqueParticle",
        "review_rating": "7",
        "review_title": "Quite enjoyable for what it is",
        "review_detailed_main": "Jessica Alba does a great job for someone whom was blind and gets new eyes. Many unorthodox things start occurring in her daily life that I'd say is very effective! The cinematography and effects are incredible! I also like the person that reviewed this mentioned monkey theorem that's a very interesting concept, seems accurate too. The horror is superb although I'm sure the original is a thousand times better!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "the_wolf_imdb",
        "review_rating": "1",
        "review_title": "Another movie killed by conversion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "nicolas-174",
        "review_rating": "10",
        "review_title": "Great movie, very scary",
        "review_detailed_main": "I disagree with all the very snobby critics about this movie I read here. Who cares if it is the sequel of another movie a book or an essay, this movie is well done, very scary and Jessica Alba is doing a great performance. Overall you can't be disappointed. It is in my opinion much better than the 6th Sense which has better reviews, even if Bruce Willis is kind of lame in this movie and the end is Kubrickesque... So if you want to rent this movie and have a great time, it is a really good movie for the regular mob like me, and you will spend a really scary night... Note that the end does not disappoint, you don't feel frustrated like most Shyamalan movies for example!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kevin_crighton",
        "review_rating": "7",
        "review_title": "Finally, a remake worth watching!",
        "review_detailed_main": "Sydney Wells plays violin with an orchestra. She is also blind. After an operation to restore her sight, she begins seeing things. Are they after effects of the operation, or is something else going on....\n\nIf anyone has read the reviews I post on the IMDb, they will know I'm pretty scathing on the trend for remaking horror movies. I wish that Hollywood would try and make something new, instead of either remaking old or foreign movies. The fact that the vast majority of the remakes aren't that good certainly doesn't help.\n\nThe Eye is a remake of a Korean movie, which I saw a few years back, but only vaguely remember. And while there are faults with this remake, I have to admit it's not bad.\n\nJessica Alba as Sydney gives, I think anyway, her best performance in a movie so far. She has to carry the whole movie, and if she's not convincing, then the movie will fall apart. But she holds the movie well, and convinces not only as a blind woman, but also a violinist. And when the creepy events start happening, she conveys the terror required well.\n\nAs for the rest of the cast, only Alessandro Nivola as a doctor trying to help her really registers. The rest only have small parts to play in the story.\n\nThe direction by David Moreau & Xavier Palud is good, and they actually pull of some scary moments. The script, written by Sebastian Gutierrez is okay, and from what I remember of the original it's a good adaption.\n\nIt's not a movie that will be remembered as a great horror tale, but despite my reservations about it being YET another remake I did enjoy it for it's running time."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "whittandwhitt",
        "review_rating": "3",
        "review_title": "Just another rip-off of an Asian movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Red_Flag",
        "review_rating": "4",
        "review_title": "Trust me, your better off not seeing this one.",
        "review_detailed_main": "Another day, another J-Horror Remake. And while \"The Eye\" may have its up sides like most others this only succeeds in making you want to revisit the Japanese original. Jessica Alba is an odd actress. How is it that she can go from brilliance (Sin City) to utter rubbish (The Eye) and while the movie may suck she and the rest of the rather assembled cast do their best at trying to reconstruct the feel of the original. Witch only furthers the ultimate question. Why even bother remaking a film that A) is a hell of a lot better than the remake and B) already appeals to a massive audience.\n\nAnd while \"The Eye\" might not stoop to the \"Unwatchable\" level of \"One Missed Call\" or \"The Ring Two\" it still isn't very good. It provides solid scares but little to no atmosphere. Witch any fan of the original will know is the bedrock of any Japanese Horror film. One of the poorest scripts of the year combine dull plot twists and some of the driest and overused duologue of all time \"I'm seeing....\" a line quickly followed by Alessandro Nivola \"Dead People\" line. A truly cringe worthy moment. The eye does have some up sides as I'm sure I have mentioned before. One the surface it's a highly polished fright fest and at a mere 90 minutes it clearly doesn't outstay its welcome. At heart it even manages a fearsome physiologic connection with the audience that should keep you gripped for most of the film. Even that can excuse the reasoning of why you would chooses to see this over the original.\n\nSydney Wells (Jessica Alba) has been given the gift of sight, but it comes with a horrifying price in the English-language remake of Danny and Oxide Pang's The Eye. The double corneal transplant was to open up a new world for Sydney, a concert violinist whose blindness has plagued her since childhood. With the help of Dr. Paul Faulkner (Alessandro Nivola) and sister Helen (Parker Posey), Sydney's operation and recovery seemed to be on the road to success -- until horrific images start to tear their way into her newfound vision.\n\nWhat's worse is that these episodes appear to foreshadow future deadly events, leading Sydney on a mission to track down the person whose eyes she has inherited and discover what kind of mystery from beyond the grave lies before her. The film is directed by David Moreau and Xavier Palud, the duo behind the acclaimed 2006 French terror flick Them, and is produced by Tom Cruise and Paula Wagner under their Cruise/Wagner production banner.\n\nIn all \"The Eye\" is one hell of a mixed bag. Jumping from ridiculous plot twist to another and whilst the frights are solid and the acting is commendable it's just not enough to excuse such a shabby script and cheerful ending (that doesn't actually occur in the Japanese original)The best thing you could do would be to go rent Gin gwai to see how a real horror film should be done as it still remains one of my favorite J-Horrors just behind \"Ringu\" for now though this is a half decent placebo."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "brokensilent",
        "review_rating": "6",
        "review_title": "Mediocre film, great for if you don't question anything.",
        "review_detailed_main": "This was one of those movies that wasn't great but it wasn't bad either. It's just not one I'll remember in a week or so or one that will make it's way to my library. I was waiting for some shocking twist, something that you didn't see coming... I'm still waiting. You knew how it was going to end from the beginning and that was such a disappointment. There were many holes in the story that bothered me to the point of where it disturbed my capability to just sit back and enjoy the story. The characters weren't very well developed though the actors themselves did a great job. And on top of all of that, they had a preview for the sequel on the rental... I've never seen that before and I have to say, I was unimpressed. After seeing the first one, I'm content with not seeing the second. Like I said, this wasn't bad but it wasn't really necessarily good either, it's just there."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "nmullin",
        "review_rating": "1",
        "review_title": "Worst movie ever created..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "vinsond21",
        "review_rating": "7",
        "review_title": "New eyes that give more than an eyeful",
        "review_detailed_main": "Sydney Wells, an accomplished violinist, is cool, calm, collected - and blind since the age of five years due to a firecracker accident. One day, after going through an eye transplant operation, she gets her sight back, but the new eyes give her more than what she had bargained for, as she can now not only see the natural world but the supernatural as well. Jessica Alba gives an effective, heartfelt performance as a young woman who undergoes the traumatic experience of reliving the horrifying end of the donor's life, night after night. She is able to convey her character's feelings of fear, doubt, rejection and empathy. While the original version of The Eye has tighter moments of suspense, this decent Hollywood take will be enough to satisfy those who are viewing this story for the first time."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Jamie_Seaton",
        "review_rating": "",
        "review_title": "good Japanese remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Diethaus",
        "review_rating": "5",
        "review_title": "Another Failed Asian Horror Remake",
        "review_detailed_main": "First if you haven't seen the original 2002 The Eye written and directed by the Pang Brothers then you need to. It is an essential horror film. Hollywood does this time and time again. Hollywood Finds a wonderful original idea whether it is a film from the past or from oversees and completely screws it up. This isn't a situation where someone reads the book and believes the book is better than the movie. This is a situation where an original film was dumb down, explained, changed for the purpose of marketing it to a teen or early 20's audience.\n\nFrom the very beginning directors Moreau and Palud failed to create appropriate atmosphere. Creating atmosphere sets the mood, interest, and attention level of the audience. If this is done incorrectly then a thin line is created between the viewer and the film. Jessica Alba's character was one of the many flawed aspects that did not create the emotional attachment. Her acting ability is very limited. The Doctor played by Alessandro Nivola was taken in the wrong direction. His hard love did not work at all. I hate to keep going back to the original but the doctor patient relationship was much more believable. My scare level, involvement, and interest were all there during the original but not for this remake. And again mood and atmosphere was the devastating factor causing a point of failure for this film. It felt more like a Drama then Horror. If you want to see a great American remake of Asian horror check out The Grudge but skip The Eye remake."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "huggabunchable",
        "review_rating": "6",
        "review_title": "Suspenseful I suppose",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Bernie4444",
        "review_rating": "3",
        "review_title": "Ground out another cheap remake.",
        "review_detailed_main": "This must be the latest movie-making trend. Back in the sixty's, they made a lot of cheap Clint Eastwood spaghetti westerns that made money. Little did the public know that the stories were borrowed from Japan?\n\nNow someone is trying pitifully to recreate the success of the Eastwood films with such films as \"Dark Water\" a remake of \"Honogurai Mizu no Soko kara\". They did not learn their lesson as now we have \"The Eye\" a cheap remake of the Hong Kong film \"Jian Gui\". When will they ever learn?\n\nYes, it is the standard formula artist who gets a new set of eyes that contain the memory of the donor. Now she sees dead people and must decipher the reason.\n\nThis has been done a lot better many times before. And I am sure this is not the last time. The film passes time but has no great insight. To make it scary they turn the volume up 10 times the voice level and for Blu-ray lovers they have lots of flashy things. Somehow I do not remember her getting her eardrums fixed also; so how come she can hear dead people as well?\n\nJessica Alba is cute and plays her part well. But not well enough to stop the fast forward button from being pressed."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "pepekwa",
        "review_rating": "8",
        "review_title": "better than expected",
        "review_detailed_main": "I don't know why this movie gets such Luke-warm ratings on here, its probably because Jessica Alba gets a bad rap and some people are very snobby on here whenever someone does a remake of a supposedly classic film. I judge things in their own right and I found this to be a very entertaining horror-thriller with a few scenes that really moved me. Alba was very good as the blind violinist thinking she's losing her mind when she starts seeing unusual things with her new-found sight, the director kept the suspense building nicely and the pivotal mirror scene was both shocking and powerful. I didn't see any \"cheap thrills\" here which is what some here alluded to, there was no expense spared at the end when Sydney finds out her true purpose."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "motoxtom-1",
        "review_rating": "7",
        "review_title": "Great Job till they ruined the end!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "SkullScreamerReturns",
        "review_rating": "5",
        "review_title": "Quite ordinary supernatural thriller",
        "review_detailed_main": "I don't know what to say about The Eye. It wasn't bad but not very good either. It clearly feels like a 2000s mainstream horror film. That impression comes from these aspects: a good looking woman as the lead actress, spooky supernatural things happening, and the movie not being the most scary or extreme horror film. Something you would see in early 2000s when you casually went to cinema to have something to watch while destroying popcorn.\n\nJessica Alba is not too bad, she's believable when the main character starts to become distressed by the weird things she sees. But I can't exactly say why the character feels a little bit empty for me. She's a little bit cardboard character, and I feel like I don't get immersed in the story enough. The story itself has a very interesting concept but in the end the movie wasn't as good as I expected. It too often feels like a cliché with the scares. There was only one moment when I really felt some chills. It's a movie with a lot of potential, but I feel like all the potential wasn't met.\n\nIf you really like supernatural thrillers where the ordinary world mixes with ghostly stuff then this is ok to watch, but don't expect anything too classic."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "suggaswt33",
        "review_rating": "6",
        "review_title": "Good enough",
        "review_detailed_main": "This film had enough essence to keep you interested for the entire 97 minutes, but doesn't prove as memorable once you leave the theater. The plot is somewhat new and fresh if you haven't seen the previous versions, and Alba finally showcases acting talent. Her portrayal of the blind is honest and relatable enough to draw the audience in. The other actors are good enough for their roles. The special effects are good and so is the editing. The underscore is suiting, especially when Alba plays the violin. Although classified as thriller or horror, the movie proves more suspenseful than anything else. Overall I rate this movie a fair 6 because it was well done but not good enough to watch again."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "nothing particularly good",
        "review_detailed_main": "Violinist Sydney Wells has been blind since age five. She receives a cornea transplant to recover her sight. She slowly regains her vision but also gains mysterious hallucinations. She makes friends with a patient Alicia (Chloë Grace Moretz) at the hospital. Her sister Helen (Parker Posey) who feels responsible for her blindness tries to help. Dr. Paul Faulkner (Alessandro Nivola) is her new doctor helping her to adjust.\n\nBased on a Chinese horror, this is a pretty slim movie with few actual frights. It doesn't have any moodiness for atmosphere. It's not particularly creepy. The vision isn't handled with the best imagination. It's a lot of music cues to highlight visions. My question is why does her visions talk to her if she only did the eyes. So she sees not only memories but the future, death, and ghosts. It's a mishmash of random interior movie logic. There is nothing particularly wrong in this movie aside from the fact that there is nothing particularly right. Then there is the climax which isn't setup that well and seems to come out of nowhere."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Tweekums",
        "review_rating": "7",
        "review_title": "Decent enough horror remake",
        "review_detailed_main": "This film is centred on Sydney Wells; a violinist who has been totally blind since an accident that occurred when she was five years old. She has an operation which should restore her sight; at first what she sees is blurry but her doctors assure her that all went well and she should soon be able to see normally. As it improves she starts seeing things that others can't; ghosts. She also has a recurring nightmare about people dying in a fire. Convinced these must be memories of the donor she determines to find out who donated her corneas and what happened to that person.\n\nI thought this was a decent enough horror/chiller, although I did enjoy the Hong Kong original more. The premise is good and it delivered some mildly scary moments without resorting to excessive violence and gore. There is also a sense of mystery about Sydney's nightmares. On the downside the scares were only mild; it could have done with more creepiness. The acting was solid; most notably from Jessica Alba who impressed as Sydney. A young Chloë Grace Moretz is a delight as a girl who befriends Sydney while she is in hospital. The effects are decent enough even if some are obviously CGI. Overall I'd say this isn't a must see but is worth watching if you don't want anything too scary."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "hendry-robert",
        "review_rating": "3",
        "review_title": "The Eyes OF Laura Mars",
        "review_detailed_main": "There was a film like this made in 1978 which stars Faye Dunaway and is a lot better than this one. The 1978 one is actually scary, this is not I simply have very little to say on this one and cant understand the good reviews because it was boring and very predictable. I actually thought I was watching a made for TV movie.\n\nI don't blame the actors and certainly not Alba but it does show that the script and storyline can really let down actors and actresses. Alba in a Tarantino or Rodriguez movie is a different person. She is practically mystical when she works with them. In this however she is simply normal. Not that that's bad, she cant be mystical in every movie, but its a good job this wasn't her first big break or I fear we would never have seen her again. I'm also sure that on paper this looked like it was going to be a much better movie to work on."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "maryvinzant",
        "review_rating": "7",
        "review_title": "A Solid 7 out of 10.",
        "review_detailed_main": "I enjoyed The Eye. I took my 13 year old and one of his friends to see this movie. I don't believe it was gory enough for their age group. I recently saw the original Japanese version on t.v. The Japanese version is better but this was a good movie. Lots of gotcha moments without the over done gore. The acting was good. Would have been nice to see the romantic aspect played up more between Alba's character and the the doctor. The Eye stayed very true to the original story line but with fresh interpretations. If you liked The Grudge you will like this movie as well. But again, I feel that the Japanese versions are better. Just a good all round scary movie. I will watch it again when it comes out on DVD."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "JoeB131",
        "review_rating": "3",
        "review_title": "Cribbing off the Asians again.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "bvanjab",
        "review_rating": "10",
        "review_title": "Great story, great acting, interesting theme!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "mikey0108",
        "review_rating": "7",
        "review_title": "Pretty Decent but could be better",
        "review_detailed_main": "I have not seen the original so i cant really compare the two. But after just recently watching this film i must say it doesn't deserve all the criticism i have read in reviews about it.\n\nThe story is pretty good but was limited to what could be done with it due to the story itself. Also after reading some reviews on how horrible the acting was, I have to disagree, I think apart from the odd one or two scenes the acting was good enough. What i think could be done better though, are the parts that try to frighten the audience. Admittedly i jumped at one scene, but to be fair it depends on what people find frightening. However i don't really know myself how to make these \"Fright Scenes\" more scary.\n\nThe ending was rather decent as well although in my thoughts was slightly predicted after seeing to many movies with ghosts or what ever you want to call them.\n\nOverall i think this movie was pretty good and doesn't deserve all the criticism I have read in other reviews, but like i said i haven't seen the original so i cant compare. The acting wasn't horrible like some reviews make it sound but other people are entitled to their opinions.\n\nFor me 7/10 or 6 at the lowest."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "ben101-1",
        "review_rating": "1",
        "review_title": "crap",
        "review_detailed_main": "made almost scene for scene from original. so whats the point?\n\nthis is really a sh*t movie. buy the original for less than ten dollars on ebay'. PS. if its a horror why are the scenes so brightly lit?\n\njessica alba is a plank !!! maybe a pretty plank but a plank none the less. this is aimed at the same people that thought the departed was good. crap crap crap. crap.!!! stop remaking great films and turning out dross! you wouldn't replace the mona lisa with one drawn in crayola would you? Now REC. has gotten the treatment,rumours of the departed 2 and the chaser on the way,and don't even talk to me about Bangkok dangerous. PLEASE!!!Don't watch this movie!!!go to HKFLIX or whatever,buy the original!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "animor01",
        "review_rating": "2",
        "review_title": "Typical remake...it stunk!!",
        "review_detailed_main": "***Spoiler Warning***\n\nHaving owned the Chinese version of The Eye, I wanted to see the American remake of the film--and compare it to the original, and the remake delivered as I expected...a total disappointment!! Some scenes, however, stayed close enough to it's original predecessor, but the scares were just plain cheap. Having loved the \"why are you sitting in my chair\" scene in the Chinese version as Wong Kar Mun was learning calligraphy, I could not wait to see what they did on this one; the scene took place in a crowded restaurant! I couldn't realize that the woman standing in front of Sydney Wells was a ghost until she looked around to realize nobody else acknowledged this apparition...and the scare was a total cheap spoof!! The ghost in the Chinese version comes towards Wong Kar a bit slower, but her appearance makes her creepier--that was scary...the loud track in it adds the kick to chill my spine every time I watch that scene.\n\nMoreover, the death of Ying Ying was saddening for Wong Kar since she had a good friendship with the little girl, and it made the drama great, plus it helped in convincing Dr. Lo to believe his nephew's claim that Wong Kar could see ghosts. The scene with Sydney Wells having seen Alicia Millstone walk away with a demon(yes, I called it demon) out through the door was just quick and cold--almost insignificant; as if she didn't even care! I'm surprised Alicia didn't just tell Sydney \"see you later, alligator\" on her way out!! I could not tell whether she was dreaming or if she actually got up. either!! All I could do to this point was just roll my eyes and almost shout curses at the movie screen with disappointment; but I wanted to see how the ending sequence was executed in the remake.\n\nOf course, Sydney and her new boyfriend/doctor saved everybody from the exploding truck--as far as the story went...everybody lived--and cost Sydney her new sight. Wow...I'm surprised Dr. Faulkner and Sydney didn't get on a white horse and rode into the sunset!! In the original version, however, Wong Kar Mun attempted in vain to get everybody out of their cars--they all saw her as if she was insane; and by ignoring her warning, it cost everyone of them their lives as the fuel tanker holding up the traffic exploded--geez, even the rat in the sewers got fried...and Wong Kar Mun was blinded by the flying debris once again.\n\nOverall, the Chinese version proved much more superb by a mile ahead--but that is my opinion, nonetheless. Of course, many viewers have a big problem with reading subtitles; they prefer a dubbed movie over a subbed any day of the week, and remakes at times are the best substitute as far as they think. However, if the remakes continually become one disappointment after another just like this one, please just stop doing them overall.\n\nAs the phrase goes: \"If it ain't broke, don't fix it!\""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "lizxypopcornkid",
        "review_rating": "6",
        "review_title": "Truly memorable",
        "review_detailed_main": "This is my opinion absolutely brilliant , if your looking for a scaryish movie this is the one to watch , perfect for teen sleepovers from ages 12 and up I recommend to watch as some scenes are horrific to watch (hanging scene) . but overall I loved this movie Jessica Alba is brilliant in the portrayal of Sydney !"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "gialli",
        "review_rating": "5",
        "review_title": "Jessica Alba goes horror and does it good.",
        "review_detailed_main": "Sydney Wells(Jessica Alba) is blind since an accident when she was a child.She have hopes to get to see again after an eye transplant,but she soon realize something is wrong.Starting to see dead people and horrifying visions from the former owner brings here closer and closer to insanity.This is an American remake of the Asian smash-hit Pang Brothers Gin Gwai(The Eye) from 2002.I think The Eye remake is an alright movie but not anything more.It has a few jump scares and Jessica Alba does here acting good. If I have not seen the Asian one maybe I would have liked it more.Anyhowe its an OK time-waster,a solid movie with good special-effects and overall good acting(not any Oscar performance) and as I said surprisingly Jessica Alba is good as the lead actress.First movie in America for the French Directors David Moreau&Xavier Palud with an OK result.Slightly recommended,I give the remake of The Eye 5/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "inkblot11",
        "review_rating": "7",
        "review_title": "Seeing too much can be hellish, as a cornea transplant recipient soon learns",
        "review_detailed_main": "Sydney Wells (Jessica Alba) has been blind since she was five, the result of an incident with firecrackers. Yet, she has been successful getting around on her own with a white cane and dedicating herself to music, becoming a first chair violinist for the Los Angeles Symphony. Big sister Helen (Parker Posey) is there when Sydney needs help and is very protective of her sibling, believing that she, Helen, was responsible in part for Syd's handicap. Good news arrives when doctors decide to do a cornea transplant operation; one Sydney had at age twelve failed. It works. Sydney can see. But, oh horrors, soon Syd is seeing visions of terrible events; fires, dying children and the like. The surgeon recommends a therapist, Dr. Paul (Alessandro Nivola) as he often works with patients of newly restored sight. In the beginning, no one believes Ms Wells, including handsome Dr. Paul, that she is having visions. Eventually, however, the doctor agrees that something odd is happening and believes Syd when she says she MUST KNOW the donor of her new corneas. In due time, the couple travels to Mexico to uncover secrets. Are their lives in danger? This interesting film, somewhat a descendant of previous movies dealing with cornea transplants and the consequences, has some scary images but is not a true horror film. Yes, its part fantasy in the visions Sydney inherits but it mostly deals with real people grappling with real problems. Alba and Nivola are wonderful as the two main characters and the script, direction, sets, and costumes are quite fine. Why not keep your eye out for the dvd or download in the future?"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Blindingly dull",
        "review_detailed_main": "I knew this remake of the Asian hit was in trouble from the pre-credits opening sequence, in which a lame, CGI ghost is superimposed on the screen. With that to start us off, how much worse could it get? Soon after you begin watching, THE EYE reveals itself to be a humdrum viewing experience. The story, still so memorable (although it's years since I last saw the Chinese hit), involves Jessica Alba's character undergoing a cornea transplant after which she begins seeing the spirits of dead people. So far so SIXTH SENSE, you might think, but the supposed scare scenes in this flick are so well telegraphed in advance that only a blind viewer won't see them coming.\n\nWorse still, they make use of dodgy CGI apparitions – the bane of the modern Hollywood ghost film. I'd like to see, just once, a movie that doesn't utilise these appallingly fake computer creations and allows mood to speak for itself. The storyline is vapid and uninteresting, and Jessica Alba (FANTASTIC FOUR) just doesn't cut it as a believable heroine – her acting starts grating on the nerves after a while and she never convinces as a frightened victim.\n\nEvery ghost film cliché is trotted out one after the other, leading to a saccharine ending that too-neatly ties everything up. I urge viewers to check out the original, on the offchance they haven't seen it, as it absolutely thrashes this one. Case in point: the celebrated elevator scene. In the original, it's one of those sequences that I had to watch behind splayed fingers, a truly disturbing horror experience enhanced by subtlety and a chilling soundtrack. Here, it's merely silly, utilising ludicrous CGI work of ghosts floating through walls and the like.\n\nDirectors David Moreau and Xavier Palud previously made the outstanding French horror film THEM, but on the strength of this they should go back to film school."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "nunemkh",
        "review_rating": "7",
        "review_title": "could have been a little better.....",
        "review_detailed_main": "The original version of the eye was really great, I enjoyed it allot. Then again so was this movie. It wasn't as good and had allot of negatives but anyways let me put it simply. THE GOOD: Very scary film, suspenseful. The sound mixing was awesome, like the scene in the Chinese restaurant, love the sound effects there. Good creepy imagery from the ghosts in this movie, I also loved what death looked like in this film. It really was an honest remake and I feel it did it's best. THE BAD: I would have kept somethings from the original movie in if I was the director, like that scene were there's a man standing in the freeway as if it were a sidewalk. Jessica Alba was alright but I would have gone with someone like Naomi Watts or Kate Hudson. The ending could have been done better. I would have picked some different locations for this movie, LA and Mexico just didn't feel right.\n\nAll in all this is a watchable movie, just not buy-able."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "wolfsrain13",
        "review_rating": "1",
        "review_title": "Worst remake ever even fathomed",
        "review_detailed_main": "I'm not even being harsh.. This is a disgrace to the original. The first time I heard they were making an American version I was skeptical but I didn't know it was going to star Jessica Alba. Other than her acting I was just plain disappointed with the movie's horror. I have two questions: Did the director/writer even watch the original movie? And why do Americans need to remake Japanese horror movies? It's like admitting that we don't have any imagination left to think up a scary film that isn't a hack and slash movie about violence and sex. We have even resorted to remaking comics, T.V. shows, foreign films, and classic movies into cheesy remakes. I am disappointed in the film industry as of late."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "n_limit3",
        "review_rating": "10",
        "review_title": "are you kidding me?",
        "review_detailed_main": "This must be a joke! THIS IS NOT A BAD MOVIE,NOT EVEN CLOSE TO BAD. What is wrong with you people saying that it is made for 'Americans that don't think' and other stupid things, well yes I agree, Americans can't think but it has NOTHING to do with this movie! It was great! I think the statement 'American's can't think' has more to do with you because when the movie was labeled as 'cover' you just thrown it to the rubbish movie-can. CAN YOU THINK? And another thing that shocked me, like this is an American movie, w00t? HOW?IN WHAT WAY? For the ones that made this statement, guys, do you even know what you are talking about? Just because it is a copy of another movie and this is 'made for Americans'(which I totally not agree) this movie has nothing even close to horror American movies, were you watching this during sex with your girlfriends? All in all, Jessica Alba made a very good performance, the directing was GREAT, sound, image and story very good. So okay, this is not an original movie, everybody likes original movies but DO NOT, I REPEAT, DOOOOOOOOO NOOOOOOOT think that if it is a copy it is rubbish, you are just stupid for thinking that. Originality is to be appreciated but most of the times I have found covers/remakes a lot better, and that is not just for movies. And what is all the fuss about 'this movie is stupid, just a lame remake of the original', there are soooooo many remakes and so many covers and so many movies inspired by others that are appreciated, but if the producers labels it 'cover' then it must be bad,right, if they say nothing about 'well I inspired myself from....etc' then the movie is good? That is just wrong. Did you know that saw is a cover from the movies 'the cube'? Neah you probably don't know,everybody loves saw,I don't,after seeing cube it was just 'deja vu', but still, saw was a great movie. Anyway stop talking rubbish about this movie, I felt quite thrilled and exhilarated watching it and I do not know what person in the right mind(that was not making sex during the movie) wouldn't enjoy The eye!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Taffu",
        "review_rating": "7",
        "review_title": "Not so bad, but not the best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "michaelRokeefe",
        "review_rating": "5",
        "review_title": "The eye's have it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "spirit_pulse",
        "review_rating": "5",
        "review_title": "Seen it all before",
        "review_detailed_main": "An average film unfortunately. We've seen these ideas in previous films Blink and The Mothman Prophecies. The whole foresight of impending disaster and the beautiful girl who is given someone else's eyes only to regret the decision is not a completely new concept. This is a remake of a Chinese film which I imagine would be somewhat better than its Hollywood counterpart. The film centres around a girl who's been blind since she was five and receives a cornea transplant to restore her sight. After said surgery, cue weird visions, seeing ghosts etc, along with a plot twist that anyone could figure out, and we are left with a serious sense of Deja Vu. Jessica Alba delivers an average performance, in a film thats all been done before. One to watch on a quiet month."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "moviewizguy",
        "review_rating": "6",
        "review_title": "How can you believe your eyes when they're not yours?",
        "review_detailed_main": "Sydney, a young, blind violinist is given the chance to see for the first time since childhood through a miraculous corneal transplant. As Sydney adjusts to a dizzying new world of colors and shapes, she is haunted by frightening visions of death itself capturing the doomed and dragging them away from the world of the living. Terrorized and on the brink of insanity, Sydney must discover whose eyes she has inherited, and what secret visions they have held.\n\n\"The Eye\" is certainly not a bad film. However, it's not also a really good one. Overall, this film can be seen as one of the better horror remakes released this time, excluding \"The Ring.\" What is different about this film s that there are no little girls with long hair! Isn't that surprising?\n\nThe film does a well job holding your attention until the end, although it's a bit dull around the second act. This film also managed to pull off some effective scares but not enough to satisfy horror fans. Surprisingly, there is some character development here, something you don't usually see in your horror remakes.\n\nUnfortunately, you can't help but think this film borrows a lot from previous films, most notably \"Final Destination\" and \"Ghost\" and even \"White Noise 2.\" The performance by Jessica Alba is decent, although nothing special.\n\nOverall, this is a decent remake with some effective chills and an explosive ending that would leave you well, interested, since nothing else in the movie is a surprise. Give this a rent if you're interested."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kels-errific",
        "review_rating": "2",
        "review_title": "Why, oh why, the eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "fire-58",
        "review_rating": "6",
        "review_title": "Above average, not the best worth a watch",
        "review_detailed_main": "Got this movie on blue ray the other day and was really really interested I thought it was going to be a hit out of the park but sadly i was mistaken.\n\nBut it must be said that this movie was pretty good. It should have been much much better then it was.\n\nJessica alba was smokin hot as usually and played the part very well The movie really went all over the place and really took a long time to get to the point then ends. You have to watch it. it is worth it there are so many worse movies out there for you to watch At the very least the subject matter of the film in very interesting."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MavDee_The_Token_Asian",
        "review_rating": "3",
        "review_title": "What An Awful Remake(Although I Haven't Seen The Original)",
        "review_detailed_main": "I just watched this movie yesterday.I though that this movie was gonna be good and scary.But i was wrong,terribly wrong.The movie was boring,there were some scenes that made me jumped.And the rest of the just kept more boring,thanks to Jessica Alba.She called herself an actress,she can't even act!I'd like to see some talented actresses as Sydney Wells, like Sarah Michelle Gellar,Naomi Watts,Kate Hudson....Jessica was a bad choice for the female lead role.I would find and watch the original \"Gin Wai\" to see the different between an awful remake and an awesome original. I suggested you not to watch this piece of crap."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "deaks25",
        "review_rating": "7",
        "review_title": "Well worth a watch",
        "review_detailed_main": "I've always been into horror films, but when I was 12 years old I saw A Nightmare on Elm Street, since then no horror has ever lived up to standard, and horror's in general always, always disappoint, so far as they barely make me jump at all and in the case of teen horror's, are just plain boring.\n\nWhen I was convinced to watch The Eye I was very sceptical, Japanese remakes often are the biggest let downs of all, usually trying to cover up how bad they are with huge special effects. However, The Eye, while far from perfect, has managed to do something that no horror has been able to do for years, it scared me. Not completely, but enough to make me jump out my seat and make my heart pound.\n\nThe story is very clever, engaging and intriguing throughout, though if you're looking for a horror with lots of action then look elsewhere.\n\nJessica Alba's performance does help to carry the film when it might have fallen down, the effects aren't trying to dominate the story and there is some brilliant tension, in fact so much so, at times I wanted something to happen so I could burst, the scene in the lift is a particularly good example of serious tension, partly because of the mystery of what might happen, but also the tension of what might happen to the character, who you do develop a connection to, you don't want her to die, a trick Hollywood horrors often miss in my opinion.\n\nVerdict: Not perfect, no where near in fact, but so much better than the usual rubbish Hollywood knocks out and well worth a watch, word of warning though, if you're looking for action and all out violence, don't bother."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "reynolds-20",
        "review_rating": "5",
        "review_title": "hilarious",
        "review_detailed_main": "OK, so i saw this movie on Saturday night, thinking id be a really scary flick. It wasn't. Actually, it was quite funny. I mean the whole theater was busting out laughing, and i just couldn't stop. Jessica Alba puts on a good performance, but the storyline is so funny that it doesn't matter. It does all make sense in the end(why she can see the dead), but still. The storyline has potential, but some of the things said in the movie are prepostraous, and just make you laugh. I only jumped once, because it tries too hard to be scary. I'm really hoping Scary Movie 5 spoofs this, because it definitely can. I would give it a 4/10, but because it's so funny, i give it a 5."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "JohnHowardReid",
        "review_rating": "10",
        "review_title": "A Knock-out from Start to Finish!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "paul_haakonsen",
        "review_rating": "6",
        "review_title": "Watchable American cash-in remake of Asian successful movie...",
        "review_detailed_main": "Well, if you are not already familiar with the 2002 Hong Kong/Singaporean original movie \"The Eye\" (aka \"Gin gwai\") from directors Danny Pang and Oxide Chun Pang, then I suppose that there is some great enjoyment to be found in this 2008 American cash-in remake of the original Asian movie, sure.\n\nFollowing the original script fairly much, but with room for deviations, then the storyline told in \"The Eye\" is actually quite adequately entertaining. But in my opinion, these American mutations of cash-in remakes of original Asian movies are just shallow copies that essentially are fully and wholly unncessary. And yeah, that is also the case with the 2008 American remake. But as I mention above, if you haven't seen the original movie, then there certainly is some entertainment to be taken away here.\n\nJessica Alba actually does a good job in the lead role, here in directors David Mareau and Xavier Palud's 2008 movie, and that is my honest opinion. She actually made the movie watchable, especially so since I am not fond of American remakes of Asian successful movies.\n\nVisually then the special effects in \"The Eye\" were good and believable, which is something that is rather important in a horror movie such as this. So the special effects team definitely carried out their task quite well and made it work.\n\nDespite of my aversion to American cash-in remakes, then I will have to be objective here and say that the 2008 American version of \"The Eye\" is not a bad remake. Sure, it was unncessary, as the original 2002 movie is a great movie. But the 2008 version does offer good enough entertainment, despite it being a cash-in remake.\n\nI am rating \"The Eye\" a six out of ten stars, which I also rated the original Hong Kong/Singaporean movie. Watch this one if you don't enjoy movies with subtitles or movies that are not with English dialogue, but if you ask me, always go with the original, every time."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Siloty",
        "review_rating": "5",
        "review_title": "alright, but could've been more",
        "review_detailed_main": "yeah alright its already been established this film is a remake. but not all remakes are total flops.\n\nJessica Alba was alright acting her role in this movie and i was impressed by her performance. Alessandro Nivola was pretty decent as well.\n\nthe problem with this movie a mate of mine and i noticed was it went for the double scare, it would pull you in, scare you and just when you thought it was over, it would get you again. this was pretty much the only scare tactic it used so after a while, you could tell when a scare was soming and it would fail to make people jump.\n\nthe ending was kind of predictable and a little disappointing but not too bad of one either.\n\na decent movie that moderate fans of scary movies would probably enjoy."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "jimbo-53-186511",
        "review_rating": "5",
        "review_title": "Flawed as a horror film, but the story and concept are quite intriguing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "paulclaassen",
        "review_rating": "6",
        "review_title": "Creepy and scary!",
        "review_detailed_main": "Jessica Alba stars as blind violinist Sydney, who finally gets the opportunity to regain her sight with a cornea transplant. She receives the eyes of a deceased woman, but soon after the operation she starts getting scary visions. These creepy visions are the donour's final images.\n\nDr Paul Faulkner (Alessandro Nivola) - who did the operation - can't understand Sydney's visions and try to convince her she is merely adjusting to being able to see again. However, he, too, soon realizes something far more sinister going on, and together they embark on a journey to unravel the mystery.\n\nPrepare yourself for jump scares galore. Some of these jump scares are actually frightening, but many of them are also due to loud jump scare music. The film literally has a scare-a-minute, so you'll pretty much be on the edge of your seat for the duration of the movie.\n\nThe visuals are good, but will scare the hell out of you! I really enjoyed the film's final act. If you're planning a movie night with the hopes of scaring your audience, 'The Eye' is the perfect choice."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "hazemhassanein",
        "review_rating": "5",
        "review_title": "Better watched out of focus",
        "review_detailed_main": "Ok I have a confession to make, I usually put something on my bedroom TV for the sole purpose of defusing my brain enough to put me to sleep. And yes, I blame my parents here, not enough bedtime stories in my childhood I guess. This process requires a certain type of movies interesting enough to disengage my mind but not complex enough to challenge it. Interesting time burners you might say.\n\nSo yes, The Eye was my lullaby of the night, and don't get me wrong, it fits the profile quite well. The idea is interesting for me coz I did read an study earlier on behavioral changes of heart transplant patients. Jessica Alba is cute and relatable but unfortunately I doubt any academy awards in her career. I also liked that guy from Face/Off just for the nostalgia of his scenes with Nicolas Cage. Also the tension builds up quite decently so that's fun.\n\nNevertheless there's a tiny little detail that ruined my sleep routine: the flaws in the plot are obvious enough for me to start an hour and half of my favorite mind game: spot the plot hole.\n\nI'm not a fan of spoiling things for others so I'll let you test your own score yourself but since this one is in the trailer I guess this one is ok was able to make my peace with the theory of the scenes projected to her brain from the special eye she got, but why oh why is she able to hear things?!\n\nAnyway, don't do what I did, it's a simple movie that doesn't deserve too much scrutiny. Enjoy it holistically and keep the details out of your focus."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "mindcat",
        "review_rating": "6",
        "review_title": "Not bad considering its remake and genre",
        "review_detailed_main": "I came away pleasantly surprised since most supernatural thrillers Hollywood produces travel a narrow water line between desperately stupid and disgusting scripts and acting.\n\nThis film impressed me, that there may still be some producers and script writers who continue to take this film genre seriously.\n\nNo bad slashers, excessive blood, horrid sex scenes. The film just about held its own from start to finish. To understand where the script is headed, you really need to watch it all way through.\n\nThere were some odd scenes however. I don't know of any hospital as dark and deserted as the one used here. Perhaps it was more for effect, rather than realism. But, this film did not have annoying smart mouthed and brats characters as many.\n\nI rented the DVD and felt I had not wasted my money. Believe me its tough these days to rent, watch and then avoid throwing up.\n\nThis film will satisfy."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "5",
        "review_title": "I'm dreaming things I've never seen!",
        "review_detailed_main": "No, seriously, that's a line in this. What, you mean you have an active subconscious? Is it legal to be that ignorant as an adult in a first-world country? This is yet another Americanized remake of Asian horror, and it completely blows it, as is usually the case(seriously, other than The Ring, they all suck; they don't even wait very long to do them). I think it says a lot that what this is based on uses shadows and vague, if at times grotesque, images, and this uses rising flames and outright explosions. The pretense of this being sophisticated is immediately tossed out the window, as this opens with glamour shots of Alba(honestly, other than Sin City, can you think of a passable performance of hers?), just barely going with showing her perspective with the other senses(what's with the Daredevilling? It was a mere five years old at this point, and it didn't do well), and covering up that she is nothing other than eye-candy, in this as in everything else she's in. They fail in their attempts at making her likable, as she's selfish and, well, they forgot to give her a genuine personality(there is *no* drama in this, no emotion is evoked; can you keep from chuckling at her in the bandages?). Pollux Troy is obnoxious and the two have zero chemistry, and every other character is one-note and boring. Is anyone acting in this? It had 90 minutes to capture my attention, and it didn't. Why is Posey playing \"normal\"? Did she walk onto the wrong set? Moretz... *that's* Hit Girl, who everyone is praising as a great young talent? Did she learn after appearing in this? At least they did that accurate to the original, with the friend at the hospital not looking like a female. Oh, they have sequences from it. They're often carelessly rehashed(at times downright phoned in), once they run out they simply repeat them, and they detract, rather than add. A couple are stripped of their relevance. Of the new things included, only one is interesting, and none of them impact the whole. This can't go ten minutes without *something* happening(several occurrences are out of nowhere and could be cut and it would only get shorter; this is in such a hurry, nothing is allowed to linger or sink in), and with no build-up, it doesn't \"work\"; we don't care. It tries *way* too hard, constantly throwing crap at us. The jump-scares are dumb. Those can be great, they aren't here. A couple of things are dumped into this with no effort made to render them effective. The bland and manipulative score is kind enough to let us know when this is meant to be creepy - you know, like the laugh-track on a sitcom. Fear the sound of a spoon being dropped! Find yourself in the grip of pure terror at the sight of ghosts that are pale *and* nearly have pronounced facial features! Is this for real? I don't think the duo of French directors were right for the subtle tone this ought to go for; I might give Ils a chance. What's to be afraid of in this? The scientific explanation removes any anxiety that might have been established(in my case, none)! Why is this so tough a concept? If we don't know, we'll be wary of it. When we do, we can label it and calm down. The latter is *not* the goal of this genre. This refuses to let the viewers use their imagination, using cheap and obvious narration(that of Gin gwai wasn't actually bad), as well as dialog, to spell *everything* out. The editing and cinematography aren't devoid of skill, but they're over-stylized, with, for example, a handful of quick flashes of meaningless \"freaky\" sights. After a lousy conclusion(nope, they didn't bother to fix the last third, in fact, they worsened it), they run the ending credits over schlocky pop to incite audiences to run out of the theater. I'm left with numerous questions, not all of them spoiler-free. What's with the surprise party? Was there anything to it, since we don't meet these people again? Wouldn't they know not to rush her like that? Who would take a chain-smokers donated liver, as it's probably not in that good shape? Where did all that smoke go, from one second to the next? Did they do all they could to locate and hire the most white Mexican I've seen in my life(xenophobia much?)? How does this manage to be quite *this* average(the FX are reasonable, and of all the aspects of this, they're the best as far as quality goes)? And finally... why? Well, that one, I can answer. Profit. A lack of respect for cinema-goer intelligence. The irrational idea that the prospect of reading subtitles is enough to deter people from these(right? C'mon, don't let something that meager talk you out of a movie). There is a ton of disturbing content and mild to moderate violence, a little strong language and a few instances of nudity. The DVD comes with four featurettes(one of them insisting that parapsychology is real) coming to a total of 20 minutes, 11 minutes of deleted scenes and half a dozen trailers. I recommend this to those who enjoy leering at Jessica. 5/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Dodge-Zombie",
        "review_rating": "7",
        "review_title": "Definitely a good adaptation.",
        "review_detailed_main": "Out of all the movies of this kind I think this one actually stands out for acting. It's well shot even if some of the effects have dated.\n\nI'm pretty sure it's some of Jessica Albas best acting though I'm not sure that's really saying a lot with some of the movies she's done.\n\nI enjoyed this movie and think it works really well.\n\nI'd definitely recommend it to people that like a bit of a mystery."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "r_m_griffiths",
        "review_rating": "2",
        "review_title": "Bad movie.. Bad.",
        "review_detailed_main": "Wasted potential. The only 2 creepy scenes were thrown in and never expanded upon.\n\nCould have started 30mins into film. Ending was...well excuse the pun.. But you could see it coming.\n\nLead charater was dull and frustrating.\n\nWaste of time."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "towhidmahee",
        "review_rating": "10",
        "review_title": "Not as Bas As people are saying",
        "review_detailed_main": "Just watch it If You love unique style Horror ... it's a very unique story and different from other horror stories .. Jessica alba did really well ! I like the concept of the Seeing the soul takers before someone's death ... This movie is very underrated tbh ! Worth watching..."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Pairic",
        "review_rating": "7",
        "review_title": "Don't Blink",
        "review_detailed_main": "The Eye (2008): US remake of the Pang brothers' Hong Kong horror film. Jessica Alba plays the concert violinist blind from the age of five who receives corneal transplants. Things quickly turn strange, she has visions of fires, people being killed violently. She even walks through a ghost and then sees their body on the ground. The ghost was also startled and is then led away by a shadowy figure. Realising that some visions are of the past and others are of the future which is not immutable she goes in search of the donor's identity, to discover how they died. There are elements of a road movie in here as well as she journeys to mexico. The horror is well handled, she learns that seeing the dark silhouette means that people are at risk of death. This results in an existential terror whereby she wants to lose her sight again. Convincing people that she hasn't gone insane is another problem. Only one doctor is (eventually) convinced to accompany her on her odyssey as the film hurtles towards a grand guignol climax. Much better than a lot of critics would have you believe with convincing acting from Alba. Directed by David Moreau and Xavier Palud, scripted by Sebastian Gutierrez. 7/10."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "leplatypus",
        "review_rating": "4",
        "review_title": "Actually, Jessica needs for sure a new pair to choose better scripts (Screen)",
        "review_detailed_main": "I admit my only motivation to see this movie was Jessica Alba, because i am a fan! She's a new star with a career to built and I liker her simplicity with this business.\n\nBut, she seems doomed because she can't find a great role to act: FFs movies are limited for drama. \"Sin City\" is very visual.\n\nAnd \"The Eye\" is blind! It isn't very scary, and any shows of \"X-files\" has more twists that this movie. Worse, Jessica isn't very convincing but the rest of the cast is at the same level.\n\nA disappointment... I am pretty sure that there won't be a \"The Eye 2\" but i will be interested to see the Chinese version, or at last, its trailer!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "thomvic",
        "review_rating": "2",
        "review_title": "For people who don't like subtitles...please try to read!",
        "review_detailed_main": "I had seen the original version long before this came out. And the original was chilling, built up suspense and had very good acting.\n\nJessica Alba - if this is the reason you went to see this movie, well then you're not going to get much because everything else in this film waters down the scares so much it is laughable. It relies on very deceptive thrills that are pretty predictable and Alba isn't really much of an actress in my opinion - or at least not in this film.\n\nThe ending also, while it stuck with it, was altered to make it, in my opinion a more easier explanation for the conclusion whereas the original had a much more dramatic touch to it which was probably one of the main disappointments about this version.\n\nI had a feeling this was going to be bad. I really am trying to get over my prejudice for American horror remakes. Don't get me wrong because some have been decent - The Ring for one, but this one has given me more of a bias towards them than ever."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "gavin6942",
        "review_rating": "6",
        "review_title": "Surprisingly Decent Remake... Alba Shines",
        "review_detailed_main": "A young woman (Jessica Alba) has been blind since a childhood fireworks accident. Now an adult, she receives a cornea transplant from an unknown donor (which is apparently a routine procedure, at least in this world). But the cornea comes with something of a curse: the donor had the unfortunate ability to see the dead, and it's no surprise that in many cases the dead hate the living. Can the curse be lifted?\n\n\"The Eye\" is a remake of an Asian horror film from a few years ago, also titled \"The Eye\". As I was a fairly big fan of the original, I was hesitant to give the new one a chance. But of course, we always have to see the remakes to see what was changed and if they were able to make the film better. The selling point that pushed me from having no interest to a mild interest was Jessica Alba, who I'm happy to say does a fine job here and looks the best she's looked since \"Idle Hands\". Blind, even. The good news here is that unlike many remakes, this one isn't a complete stab in the back of the original. In fact, I rather liked it for the most part... which surprised me at first, and even more so when I found out this came from the writer of that legendary flop \"Snakes on a Plane\".\n\nThe general plot remained the same, with an eye transplant that allows the recipient to see ghosts. And some of the creepier ghost scenes were maintained. Notably, the floating man in the elevator. This stood out as the most disturbing part of the first film, so I'm glad they were able to reproduce it in such an effective way. Beyond that, there are some departures, not all of which are bad. Whereas \"The Grudge\" remake took pains to keep the story set in Japan, \"The Eye\" feels no compulsion to remain on the Asian continent. I think this was a wise move, especially for American audiences. This also allows the introduction of the Mexican \"bruja\", which would have been out of place before.\n\nOne issue I had was the nature of the scare tactics the film uses. The original relied more on a dark atmosphere, with the only \"jump\" scene that really stood out being the \"what are you doing in my chair?\" scene (you know what I mean if you saw it). Now we have jump after jump after jump. That's bush league horror movie material, designed to frighten teenage girls so they clutch their boyfriends. Where's the real psychological terror of having your eyes turn against you? But, I admit I jumped, so I guess their plan worked.\n\nI'm also skeptical of the idea that tissue samples can retain the memories of the donor. Especially in such small organs as corneas. So, it was a bit hard for me to swallow the idea that she'd gain full witch powers. I can accept seeing dead people (and yes, there is a \"Sixth Sense\" reference in this movie), but why can she hear them? Why does she usually see the dead, and at other times she can see the future or entire rooms? Why do some people get carted off by death and others relive their deaths over and over? A lot of questions are raised and not really addressed. What really confused me was the inconsistency of some people's ghost appearance. Some (such as elevator man) look like their dead self, while others (report card boy) look perfectly fine.\n\nI will have to side with the original, first out of courtesy and second because it's simply the better film. The 2008 Alba version has its perks (such as Jessica Alba, and Chloe \"the Dakota Fanning of Horror\" Moretz), but also falls into too many of the Hollywood trap. Style over substance, dangling plot lines and more. While it was still good and I wouldn't discourage you from seeing it, I will say I'm rather pleased that a sequel is not currently in the works (though who knows)."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Jacques98",
        "review_rating": "2",
        "review_title": "At least it had quality.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "popopcms",
        "review_rating": "7",
        "review_title": "Better than I thought",
        "review_detailed_main": "Me and my friend went to the movies last night. There was nothing really good out, and this had the closest time. So I thought why not, it looked a little decent.\n\nI left the movie pleased it had good scares and most of the acting was acceptable. The only reason I wasn't to excited about it is because they always seem to put out a billion movies a year like this.\n\nThere was some funny parts where your not suppose to laugh, which kind of ruined the mood. This movie is mainly just a good DVD popcorn movie. And there isn't to much blood for those who geek out with gore.\n\n7/10- movies theature 8/10- DVD"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "refahaalqahtani",
        "review_rating": "3",
        "review_title": "Not worth watching",
        "review_detailed_main": "Boring scenarios till the last 10 minutes........."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "sol1218",
        "review_rating": "6",
        "review_title": "Seeing is Believing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Edvis-1997",
        "review_rating": "3",
        "review_title": "3",
        "review_detailed_main": "It's just very bad movie. Compared with other films that were made also in 2008 the quality,acting,plot and special effects in this movie just sucks. Don't waste your time by watching this film."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "SamJamie",
        "review_rating": "8",
        "review_title": "An underrated & thrilling chiller.",
        "review_detailed_main": "The Eye is a 2008 American supernatural horror-thriller film directed by David Moreau and Xavier Palud, scripted by Sebastian Gutierrez, and starring Jessica Alba, Parker Posey, Alessandro Nivola, and Rade Serbedzija. It is a remake of the Pang Brothers' 2002 film of the same name.\n\nSydney Wells, a violinist, undergoes a cornea transplantation surgery to regain her eyesight. Upon recovering from the operation, she sees terrifying visions from the alternate paranormal world.\n\nThe Eye is a terrifying treat for horror junkies, as Alba's nervous wreck visionary wards off being attacked by apartments and restaurants, while dealing with a bad case of occult organ rejection, proving transforming Asian horror into American horror isn't so bad when the filmmakers respect the source material."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "tylerrosin",
        "review_rating": "7",
        "review_title": "Review of The Eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "mickus1983",
        "review_rating": "1",
        "review_title": "worst movie ever",
        "review_detailed_main": "the storyline sounds stupid, but I thought I would give it a go.\n\nA women who gets an eye transplant and then begins to see aspects of the doners life. OMG who would even allow this to be created? Perhaps if they had of put some creative action into the plot, the movie would have got away with it, but they didn't.\n\nIt was really really boring. I had to fast forward through most of the first part, and halfway through I ended up turning it off.\n\nIt was just too boring.\n\nBetween the dramatic \"gasps\" of the main character and looks of horror, there was NOTHING!!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MrGKB",
        "review_rating": "5",
        "review_title": "Another \"glad I found it at the library\" film...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "silasrp",
        "review_rating": "6",
        "review_title": "A bit of disappointment",
        "review_detailed_main": "A good movie, but not a great movie. At the beginning we have the impression that we will see a fabulous movie. But in the middle, the history became a bit of \"water with sugar\", with a predictable love story. The way that the director found to explain the appearance of the shadows and because they appear, not is the credible too. Explanation too simple to a problem so complex. I was expected a more strong reason to all events that previous the clarification. Alessandro Nivola is not a great actor, need improvements. In many moments he don't act in a credible way. Jessica Alba show that is a versatile actress, and she is the best in the movie."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Captivating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "well-duh",
        "review_rating": "3",
        "review_title": "Silly Film",
        "review_detailed_main": "Never good when the bulk of a movie's core story is 10 seconds of narration rather filming the drama.\n\nMaybe a little subtler but commercially this is another sexploitation film. Weak sexploitation at that. Still it obvious the film wouldn't make it to DVD with an ugly or completely uninteresting looking woman as star. The subconscious savagery appeal to men is that, through most the movie Alba appears as a beautiful woman so crazy and helpless that she would be unable to defend her virtue or effectively report when you take advantage of her. For women the appeal is identification with a woman having justification for masturbatory self-absorption, a fantasy return to youthful attention seeking. Alba's character gets \"daddy\"-like attention from her supporting doctor without the film ever providing any good reason.\n\nSure the film has other messages but unfortunately these are too weakly presented to be the basis for commercial appeal. The supernatural element of the source story is basically all but lost. See the TV show \"Ghost Whisper\" if you want to add a supernatural story to the sexploitation (and better sexploitation for men too).\n\nHow does the film fail so badly? Well the real story is in the last 19 minutes. First the movie spends 25 minutes of \"action\" in an extremely slow setup before the first hint of entering the main idea. So you know more than you need to about life before the eye surgery. Lots of stalker appeal I guess.\n\nThe slow setup might be because the rest of the movie has so little to say. The movie spends way too much time in blurry vision mode. It takes 20 minutes for normal stuff to come into focus. She doesn't see everything clear until around 55 minutes into the film. I guess this is to encourage you to believe the main character is nuts because she jumping around way before you can see a reason for it. In fact this film ought to be called \"The Ear\" because for 2/3 the time she is hearing stuff far more than seeing it.\n\nThe writing and directing is so bad that I think most people would have problems figuring out what the big deal was from the first 60 minutes, if they hadn't heard the movie synopsis before seeing the film. At least not until the character tells you something with only 30 minutes to go. Oh there are a couple fuzzy hints earlier but nothing definite. Then a support character reveals the bulk of the story in 2-3 sentences with only 20 minutes left in the movie. Then you get the first validation of the main character's reality a minute later...not good timing, especially as it has never really been questioned until this point. There is only 10-15 minutes left in the film before there is a hint that the main character has a goal or something to resolve -- and it still isn't clear."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "yusufpiskin",
        "review_rating": "7",
        "review_title": "Absolutely creepy and unsettling.",
        "review_detailed_main": "Love this movie an old favorite from the mid-2000s. The golden age of horror. It isn't like good but it's a rollicking good time. Decent scares. Cool ideas. The man in it stinks but it has Parker Posey. Jessica Alba sure does her best."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "TheMovieDiorama",
        "review_rating": "3",
        "review_title": "The Eye managed to blind me with its mediocrity.",
        "review_detailed_main": "Another American remake that pales in comparison to the original, this time written by the same individual who wrote 'Snakes on a Plane'. Need I honestly say more? A blind woman undergoes a cornea transplant allowing her eyesight to return, but soon starts experiencing horrific visions. The primary premise is nearly identical to the Chinese original, where specific plot devices are replicated to precision such as the infamous elevator scene. However, all of the atmosphere, horror and thrills are removed to make way for a horrendously bland remake bolstered by an incredibly dull screenplay. These characters were lifeless. The sisterly bond between Alba and Posey was nonexistent and the forced romantic affair between Alba and Nivola lacked spark. Come on! Alba sure is a pretty fine woman but are you seriously suggesting you would jeopardise your entire career for a patient you've known for two days? There came a point where I thought \"she's going to say it...hang on\" and then momentarily she exclaims \"I see dead people\". I was done. From a ghostly boy endlessly searching for his report card to an elderly woman wandering hospital corridors, these spooky entities contained zero scares although accompanied with a few jolting jumps occasionally. Alba's performance was a mixed bag. Her attentiveness towards the blind acting was captivating, with minor details such as placing your finger in a cup whilst filling it adding much authenticity. Conversely though, her standard acting was wooden, flat and vapid. Fake laughs, fake smiles, fake pouts. So much fakery that you could smell it a mile away. The industrial accident was somewhat hauntingly beguiling and held my attention for a span of three minutes. The rest was just a wearisome experience. Needed to give my eyes a rest. Oh, that's without mentioning the constant blurry perspective that garnered me a headache. If you didn't like the original, this lifeless interpretation will certainly make you appreciate it more. Wait, you smell that? Yes, Alba's fakery still lingers..."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "jhobdell",
        "review_rating": "7",
        "review_title": "Barely horror...as usual, but I'm not complaining!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kjinky2000",
        "review_rating": "2",
        "review_title": "Not good, very disappointing",
        "review_detailed_main": "This movie was not good; I thought the performance of Jessica Alba was adequate at best. And what was up with Parker Posey? She could have phoned her performance in. Stick to comedy, Parker, you're at your best with the Christopher Guest movies (i.e, Best in Show, Waiting for Guffman, etc.). The story line verged on ridiculous, and there were a few loose ends left unexplained. Maybe a better editing job would have improved this movie. If you are a fan of the horror movie genre, I would give this movie a pass. There were a few good \" jump in your seat\" moments; but in general, this was a movie that didn't need to be made, the original Hong Kong production \"Gin Gwai\" was much creepier."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "ultravioletboy",
        "review_rating": "10",
        "review_title": "Great remake! I love it!",
        "review_detailed_main": "I have to tell you that I live in Thailand, so we might have a different opinion in the same movie. I've watched the original version. It's one of the best horror movie that I haven't seen. In the remake version, I think that they've made the ghost scenes more scary, more exciting and more interesting! I've jumped all the time!(Except the old woman scene). Alba is one of the best thing in this movie. I can't imagine if the main actress in not her! The movie might be...(you know what I mean!). I've really enjoyed this film. I want to tell you that the best way to enjoy this movie is watch it in the theater or watch it alone in the night at your home!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "jtncsmistad",
        "review_rating": "6",
        "review_title": "\"The Eye\" is worthwhile Scoping Out",
        "review_detailed_main": "\"The Eye\" starring Jessica Alba is the second mystery/thriller I've watched of late focusing upon a blind symphony orchestra musician. I give it the nod over \"In Darkness\".\n\nAfter all, how tortuous can it really be looking at JA for an hour and a half?"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "PedroMGA",
        "review_rating": "4",
        "review_title": "Seriously...stop trying.",
        "review_detailed_main": "When is Hollywood going to realize that they just cant top an Asian horror movie with is own imagination, let a alone copy one? thats even worst because real horror lovers already had the top experience with the real one, and they just cant \"eat\" a fake imitation? isn't bad enough to completely destroy American cinema icons like aliens and Predator? And the top of that, they choose Jessica Alba. Cmon, let her stick to FHM and max men magazine shootouts...\n\nI would recommended all people that had the fortune of not seeing this movie, to see the original, cause its one of the top Asian horror movies."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "be-peace",
        "review_rating": "",
        "review_title": "Remake of a Japanese supernatural take on an American movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "5",
        "review_title": "The Eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MattyGibbs",
        "review_rating": "7",
        "review_title": "Decent",
        "review_detailed_main": "A young blind woman has her sight restored but comes to see disturbing visions. She must try and find out why the visions are occurring and what they mean.\n\nThe Eye isn't an out and out horror relying more on tension than blood and guts to get it's scares. It's nicely filmed and fairly engrossing throughout with a few jump scenes.\n\nJessica Alba does a good job in the lead role displaying a nice sense of vulnerability.\n\nAlthough it is not a great film by any means there is more than enough here to make this an enjoyable watch. It exceeded by admittedly low expectations and is worth a viewing."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "well-duh",
        "review_rating": "3",
        "review_title": "Silly Film",
        "review_detailed_main": "Never good when the bulk of a movie's core story is 10 seconds of narration rather filming the drama.\n\nMaybe a little subtler but commercially this is another sexploitation film. Weak sexploitation at that. Still it obvious the film wouldn't make it to DVD with an ugly or completely uninteresting looking woman as star. The subconscious savagery appeal to men is that, through most the movie Alba appears as a beautiful woman so crazy and helpless that she would be unable to defend her virtue or effectively report when you take advantage of her. For women the appeal is identification with a woman having justification for masturbatory self-absorption, a fantasy return to youthful attention seeking. Alba's character gets \"daddy\"-like attention from her supporting doctor without the film ever providing any good reason.\n\nSure the film has other messages but unfortunately these are too weakly presented to be the basis for commercial appeal. The supernatural element of the source story is basically all but lost. See the TV show \"Ghost Whisper\" if you want to add a supernatural story to the sexploitation (and better sexploitation for men too).\n\nHow does the film fail so badly? Well the real story is confined to the last 30 minutes. First the movie spends 25 minutes of \"action\" in an extremely slow setup before the first hint of entering the main idea. So you know more than you need to about life before the eye surgery. Lots of stalker appeal I guess. I think that they tried to let the story develop Blair Witch style though with professional cinematography. Of course Blair Witch is a \"unedited bad home video evidence\" idea that is really only interesting once -- at least viewing end to end.\n\nThe slow setup might be because the rest of the movie has so little to say. The movie spends way too much time in blurry vision mode. It takes 20 minutes for normal stuff to come into focus. She doesn't see everything clear until around 55 minutes into the film. I guess this is to encourage you to believe the main character is nuts because she jumping around way before you can see a reason for it. In fact this film ought to be called \"The Ear\" because for 2/3 the time she is hearing stuff far more than seeing it.\n\nThe writing and directing is so bad that I think most people would have problems figuring out what the big deal was from the first 60 minutes, if they hadn't heard the movie synopsis before seeing the film. At least not until the character tells you something with only 30 minutes to go. Oh there are a couple fuzzy hints earlier but nothing definite. Then a support character reveals the bulk of the story in 2-3 sentences with only 20 minutes left in the movie. Then you get the first validation of the main character's reality a minute later...not good timing, especially as it has never really been questioned until this point. There is only 10-15 minutes left in the film before there is a hint that the main character has a goal or something to resolve -- and it still isn't clear."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "pncwillevans",
        "review_rating": "7",
        "review_title": "Great but there was better",
        "review_detailed_main": "Certainly one of the better movies in the theater compared to the competition.\n\nI did enjoy this rendition but saw better aspects from the Pangs' original construction of the movie when done in Hong Kong. Why it had to be dumbed down for us Americans, I will never know, but it probably has to do with executive level interferences.\n\nThe suspense was excellent, but could have been outstanding with the aspects they have shown in other works they developed. The acting was great, I think the cast showed the appropriate levels of intensity.\n\nOverall very pleased and certainly worth the price of admission or rental."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Sherparsa",
        "review_rating": "1",
        "review_title": "quite successful @ creeping you out with horror scenes ...",
        "review_detailed_main": "... but failed with a crappy story!\n\nat least 7*** for the technique, direction, story telling and tolerably good acting ... but the story itself sucks, especially in the last border scene ... if it weren't for Jessica Alba's beauty, i'd have quit watching in the middle of movie ..."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Bored_Dragon",
        "review_rating": "6",
        "review_title": "\"A woman receives an eye transplant that allows her to see into the supernatural world.\"",
        "review_detailed_main": "5.4 on IMDb, Metascore 36, and a brief description from the title say it all about this film. I had to watch it because, after all, there are Jessica Alba and Chloë Grace Moretz in the same movie, and I'm not sorry that I did, but the film is ok at best and nothing more than that.\n\n6/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "motionlessinblack",
        "review_rating": "4",
        "review_title": "TERRIBLE",
        "review_detailed_main": "No. Don't watch, super time consuming and I couldn't find myself having the attention spand to sit through it. Not scary or creepy just kinda boring"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "toz451",
        "review_rating": "8",
        "review_title": "I Loved It!",
        "review_detailed_main": "Yes, it borrowed a bit from the Sixth Sense, but it put its own spin on the theme of seeing the spirit world. Alba was amazing as were the supporting cast. Well done movie!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "joiningjt",
        "review_rating": "7",
        "review_title": "I didnt see the original Hong kong release so just rating it on it's own merit!!!",
        "review_detailed_main": "Jessica Alba's best film and it's quite entertaining. It's no conjuring but it's a well made film and I didnt see the original Hong kong film so I'm not burdened with comparing them. I liked the special effects the acting the story and the excellent ending. It's not a classic or the next conjuring or similar but if you haven't seen it. You'll enjoy this film and it fits a lot into a short time."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "weasl-729-310682",
        "review_rating": "4",
        "review_title": "Not So Good",
        "review_detailed_main": "I adore the thriller genre and I loved the premise described so I bought the movie. I also like Jessica Alba; she's great in \"The Killer Inside Me\".\n\nI don't claim to be an expert film critic, so I don't really know if it is the director or what, but this film with a good actress, and great premise falls flat. It just fails to hold my attention.\n\nI think I want to seek out the Chinese original; hopefully, I can find it with English subtitles. The first version must have been good for folks to think they could make money recreating it.\n\nI played it again tonight, got sick of it (boring and not engaging at all), then put in \"The Killer Inside Me\"."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "Have you seen my report card?....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "WilliamABW",
        "review_rating": "7",
        "review_title": "It may not be the gripping thriller that some might ask for, but as a chilling horror movie, The Eye is skillfully terrifying",
        "review_detailed_main": "It may not be the gripping thriller that some might ask for, but as a chilling horror movie, The Eye is skillfully terrifying. The Eye, a remake of the 2003 Hong Kong film Gin Gwai, is about a young blind woman named Sydney Wells (Jessica Alba) who, after receiving a cornea transplant from an anonymous donor to get her eyesight back, begins to see (and even hear) terrifying visions of ghostly beings and dark images of death that no one else can see. Understandably, the most effective fright scenes take place at night when Sydney is alone in her bedroom. Even though most of the scares here are predictable and in part the result of jump shocking thrills, they nevertheless work. I came to find myself dreading the scenes where Sydney goes to bed, and sighing with relief when she woke up. The alone-in-the-dark scenes are fun, horrific rides, greatly helped by great camera-work and Marco Beltrami's eerie soundtrack. However, the film deserves kudos for having more than one scary scene in crowded, brightly-lit places - a café, an apartment hallway, a highway, a restaurant. Although The Eye does not, for the most part, live up to the original, fans of Gin Gwai may be pleased by the many scenes in this remake inspired from the original, most notably the classic elevator scene. Unfortunately, like so many other movies I've reviewed, it's the third act of The Eye which causes a drop in my and most of the professional critics' scores. This part of the film focuses too much on who Sydney's donor is and why she is experiencing visions, and it does so poorly. The climax of the film, although having cool visual effects, is a huge mess story-wise, having very little to do with the main plot of the film. However, I really don't believe I'm being very generous in giving this film a positive rating, as the downsides of the ending don't outweigh the superb thrills of the first half. This 2008 remake The Eye is recommended to any fan of supernatural horror."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "nlk87",
        "review_rating": "4",
        "review_title": "This movie was good, you're crazy to disagree!",
        "review_detailed_main": "After seeing so many negative low rating reviews for this movie, \"The Eye\" (2008) I HAD to add my 2 cents into the mix. Sometimes it baffles me to see box office hit films that continues to keep making money & sequels & how they are universally loved by millions & the ratings & reviews are sky high but after watching it, I'm like, \"seriously..?\" & then films like this 1, \"The Eye\" (2008) & people just complain how they think it's terrible, & again I'm like, \"seriously..?\" This movie had a good script, cast, settings, CG, & creepy scary looking angel of death creatures.. & even though my rating is 4/10, rating system is alot different than everybody's. So 4/10 means it's good, I enjoyed it, I'd recommend it to others, & definitely rewatch it again. See, to me, this movie is ALOT better than \"Star Wars\" \"Indiana Jones\" \"GOT\" & .. ETC..."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "christopherjnewsome",
        "review_rating": "7",
        "review_title": "It's ok",
        "review_detailed_main": "Its a ok movie nice to watch when you have the time but its just a American remake of the movie Naina but its funny to watch and see how they all most did the same movie with all most the same set up in words and camera just take the time to watch the two movies and you will see. I dont know what to say more about this but i would have to say would be nice if they would put in when they remake a movie from a other part of the world that the movie is based on this other movie would be a nice touch that way people can see what the movie was before and after we change it some times a lot is lost when you do stuff like this."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Imaculata",
        "review_rating": "3",
        "review_title": "An insult to the original",
        "review_detailed_main": "How can anyone remake a movie, and then remove what made the movie so great to begin with?! The shocking ending. They changed the ending! This remake is not only an insult to the original, but a crime against film making. You take a really good Asian suspense movie, replace all the suspense with cheap jump scares, and then chicken out with the shocking ending. The people who made this need to apologize. This was a shameless cash grab. Plus, Jessica Alba can't act to save her life.\n\nDo NOT watch this movie! You owe it to yourself to watch the original, and ONLY the original. Its not like an American audience can't read subtitles, so just do yourself a favor. Go watch the original with subtitles already.\n\nMerciful Zeus, how could they remove the shocking ending?! How can you do that?! I just don't understand it. Seriously, what is the point?! If you're going to remake a movie, why take out what made it great to begin with?!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MartianOctocretr5",
        "review_rating": "6",
        "review_title": "Eye see ghost creatures! And they don't know they're in a remake. . .",
        "review_detailed_main": "This hastily done version of an oriental horror film (Gin Gwai) is the cinematic equivalent to a microwavable TV dinner: easy to digest, but a soon forgotten item that was nothing special.\n\nIt plays out something like a conglomeration of Eyes of Laura Mars, 6th Sense, and Ghost. This movie (or rather the one it's remaking) adds enough that's new to make the movie able to stand on its own. Many oriental horror movies focus on a vulnerable, everyday person (easy to sympathize with) being menaced by an unseen, apparently paranormal being. The interest and scariness of the story is maintained by knowing only what the character knows, as they gradually learn what the entity is and what it wants.\n\nThe director makes a fair attempt to maintain this approach by building the suspense with logical plot development. However, some events seem to be randomly thrown in that don't advance the story. Another weakness is the use of corny horror genre crutch of \"jump out at you suddenly and scream loudly with the volume increased\" in some scenes.\n\nJessica Alba, the sun-drenched beauty, might seem to be a casting blunder, more suited to Bay Watch \"eye candy\" joke films than a role that actually requires her to act. Frankly, her poor acting history reputation kept me from paying my hard-earned money at the box office, when I saw her name in the cast. When the film became free on cable, I gave it a chance, not expecting much. Alba's performance, while slightly marred in places by over-emoting, was overall her best to date, and actually a strength to the movie. She makes Sidney, a blind violinist who begins to experience terrifying visions of tragedies after receiving vision-restoring surgery, a believable person to care about.\n\nIf you can find the original Gin Gwai, watch that. If not, settling for this weaker version can kill some spare time when you're bored."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kanaifu",
        "review_rating": "4",
        "review_title": "Looses tension and focus towards disappointing end premise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "GOWBTW",
        "review_rating": "9",
        "review_title": "You have to see it to believe it!",
        "review_detailed_main": "Jessica Alba is a force o be reckoned with. In \"The Eye\", she plays Sydney Wells, a blind woman who gets a second chance with new eyes. However, the donor had a secret that would send her world Topsy-turvy. The eye Sydney has can see things that normal people would dread. She can see into the world of the supernatural! The person who died had the ability to see beyond, and the neighborhood in her country got spooked. Her new eye may have scared her, but it was put into good use when the explosion occurred out on the border which claims the eyes. But not her spirit. Syndey enjoyed being able to see again, but she knows now to view the world around her without sight. Very mild horror, can be a bit scarier though. With a plot to be known for. There are other movies dealing with second sight. This one is sexier and entertaining which I liked. A MAJOR KEEPER! 3.5 OUT OF 5 STARS!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "hellosunshine",
        "review_rating": "7",
        "review_title": "The Eye is something to behold",
        "review_detailed_main": "I understand this film is targeted as a horror film and it did just that. I was scared some moments and didn't understand some sections either and I'm guessing it's because the transition to an English script did not translate over well. It was a good movie and Jessica Alba plays character correctly however in some points I was confused on the things she could that perhaps a true blind person would not be able to...so in general it was not believable that she was blind.\n\nIf you are looking for a horror movie to give you a few screams or yelps...this is the movie for you..however if you prefer a horror movie that builts up on a story...then please move on."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kairingler",
        "review_rating": "4",
        "review_title": "stereotypical over-hyped",
        "review_detailed_main": "i thought this was a very strange movie,, sorta like final destination in some ways,, a girl loses her sight at 5 yrs old. now in her 20's i presume she has surgery to see again... now she has visions,, nightmares , all kinds of crazy stuff happening to her, she wants to find out who her donor is, at first the dr. is very leary to give her that information, eventually he does,, it appears that cells have some kind of memory,, so her donor's eye's are telling her something,, but what is the whole key.. Jessica Alba i thought could have done way better. it seemed like she was going thru the motions in this movie., it was hard to make sense of, it isn't very clear till the end of the movie,, i 've seen better,, so i really can't recommend this one."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "atinder",
        "review_rating": "4",
        "review_title": "Not that good but it still better then the Bollywood remake of The Eye!",
        "review_detailed_main": "The Eye (2008) Is a Remake of Gin gwai (2003), This is not even first remake of Gin gwai (2003) as Bollywood remade this before Hollywood as Naina (2005), I have see bits of Naina (2005) on You tube as my God they movie look absolutely terrible (it's so it's looks funny).\n\nI was not looking forward to this remake at all, as Gin gwai one of the best ghost story to come out i the last 10 years, Which I found really scary and creepy.\n\nI was really disappointed in this movie as they took some from the Original movie, it just did not work with Hollywood remake.\n\nI hated the way Change grim Reaper in this movie, made it look more scary with really poor silly CG1 effects.\n\nWhich makes the movie lose a lot of it potential, The original made them look more realistic and found a lot more chilling as well.\n\nI did like some of the new scenes that added into the mix, which I think was decent and The acting was really really good as well.\n\nAs for the second remake of Gin gwai, This is worth one Time watch at least!\n\n4 out of 10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "lajos-szel",
        "review_rating": "6",
        "review_title": "Perfect ingredients don't always equal a perfect food",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "sorinapha",
        "review_rating": "3",
        "review_title": "A useless, over-glossed remake of a damn good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "6",
        "review_title": "Engaging enough thriller",
        "review_detailed_main": "The Eye is a slight horror thriller in which may have been a remake of a foreign film. With no expectations, the film relatively kept ones interest more than expected. It features decent enough scares for a PG-13 rated film and has an engaging story. Although somewhat predictable and loses focus in the end, it is solid for its genre and what its intentions are for.\n\nMost of the criticism and low ratings seem to come from those who have seen the original and hold it to such high standards, and of course they compare the remake to the original and nitpick at this remake making it seem worse than it is."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "dasaunders-1",
        "review_rating": "3",
        "review_title": "Wow",
        "review_detailed_main": "Wow, I'm actually not even surprised at how corny this film was. I told myself before i went into the theater last night that it was not going to be worth my while, but the benefit of the doubt preceded. The beginning was most likely the most exhilarating part in the entire film, for i had no clue what was going on. However, from that point on The Eye dragged me along from one cheap thrill to the next. Also, all the acting seems forced. If your looking for a movie to be engaged in, this is not the one for you; however if your looking for a movie to give some undivided attention to that special someone then this is it. The only praise i can give to this movie is that Jessica Alba is sexy and that it kept me awake(but not for a good reason). Movie goers beware."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "merrywood",
        "review_rating": "5",
        "review_title": "Incompetence goes Big Budget (spoilers, please)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "m-siddharth93-746-157778",
        "review_rating": "8",
        "review_title": "An under-rated must watch",
        "review_detailed_main": "The main goal of watching a movie is entertainment, this is one of the movies that meets it. Every time you insert a disk or open a file, what you will be watching is not necessarily going to be an Oscar winner and most times I prefer it not to be.\n\nThe story line is awesome, Asian horror flick based after all. But the directing and the final twist is what makes this movie better than the original. This movie has been really under-rated and is a must watch, it has done quite well on most parts for scaring me (I watched tons of horror and I started doubting that if scaring someone through movies even possible).\n\nTo be honest, after watching tons of horror flicks, this one gave me a fright after a long long time. It's saddening how horror these days have turned into torture porn, blood and gore. The reason most horror flicks don't pass the 6.0 IMDb wall is because they are unoriginal work patched and covered in lots of CG and loud screams to hide the poor effort, leading to the only \"twist\" by killing the protagonist.\n\nAfter watching this movie I did not feel like, \"God, why did I watch this?\" It goes into one of the movies without which my life would be incomplete and I would be missing a good experience. Concluding, a movie with some clean horror and an interesting storyline (that's all it takes to make a good horror movie)."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "damianphelps",
        "review_rating": "6",
        "review_title": "Feels Similar To The Grudge And The Ring",
        "review_detailed_main": "The Eye is a little hit and miss but does overall give the view enough to be satisfied.\n\nThe last 30 minutes is a nice crescendo with some pretty cool moments.\n\nIt does drag a little in the middle.\n\nNice story, good fun :)"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "wjlloydroberts-26317",
        "review_rating": "4",
        "review_title": "Audio disparity.",
        "review_detailed_main": "53.50 minutes in and I paused it to read some of these reviews and write one of my own. First impression. I had to raise the volume to hear the dialogue. (I have a sounds system that can make your ear drums rupture and bleed at high volume.) Next thing I am jumping out of my chair to reduce the volume back to a comfortable level and now I can't hear the dialogue again. So I am supposed to be scared by loud noises instead of a well writen plot with cleverly directed suspense? Hmm? I do not like or apreciate cheap tricks like this so I am glad I didn't pay to see this at the cinema. I don't care what the rest of the movie is like or if it's any good. My interest ends here with this review. This movie is not for me. BOO!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "alexpeychev",
        "review_rating": "2",
        "review_title": "Movie Review: The Eye (2008)",
        "review_detailed_main": "\"The Eye,\" directed by David Moreau and Xavier Palud, is a supernatural horror film that explores the chilling consequences of gaining the ability to see beyond the realm of the living. Released in 2008, it is a remake of the 2002 Hong Kong-Singaporean film of the same name.\n\nThe story follows Sydney Wells, played by Jessica Alba, a talented concert violinist who has been blind since childhood due to a tragic accident. After receiving a corneal transplant, Sydney's sight is restored, but with it comes unsettling visions of terrifying events and ghostly apparitions. As she struggles to make sense of her newfound ability, Sydney uncovers a series of mysterious deaths connected to her donor, leading her on a journey to unravel the truth behind her visions.\n\nJessica Alba delivers a compelling performance as Sydney, portraying her character's vulnerability and fear with conviction. As Sydney grapples with the horrors she witnesses, Alba effectively conveys her emotional turmoil, drawing viewers into her harrowing experience.\n\nThe film's eerie atmosphere and suspenseful pacing contribute to its overall effectiveness as a horror film. From the ominous whispers heard in the darkness to the chilling encounters with supernatural entities, \"The Eye\" maintains a sense of dread that keeps audiences on edge throughout.\n\nVisually, the film is striking, with cinematography that enhances the eerie ambiance and surreal nature of Sydney's visions. The use of light and shadow adds to the film's sense of foreboding, while the ghostly apparitions are rendered with haunting realism, heightening the film's suspenseful moments.\n\nWhile \"The Eye\" offers plenty of scares and tense moments, its strength lies in its exploration of themes such as identity, perception, and the unseen forces that shape our reality. Through Sydney's journey, the film delves into the psychological toll of experiencing the supernatural and the blurred lines between the physical and spiritual worlds.\n\nHowever, the film does suffer from some pacing issues, with certain scenes feeling rushed or underdeveloped. Additionally, some plot elements may feel familiar to fans of the horror genre, detracting from the overall originality of the story.\n\nOverall, \"The Eye\" is a chilling and atmospheric horror film that delivers plenty of scares while offering a thought-provoking exploration of its supernatural premise. With Jessica Alba's compelling performance and a visually striking presentation, it is sure to leave a lasting impression on fans of the genre."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "jackkilby",
        "review_rating": "6",
        "review_title": "I See Dead People!",
        "review_detailed_main": "This might be the longest episode of \"Ghost Whisperer\" I've ever seen! J-Love looks surprisingly like Jessica Alba, but where is Bruce Willis? It's not a terrible movie! I should probably check out the original foreign version , and I liked the film overall. I actually like \"Ghost Whisperer\" so I'm really not complaining. I really don't care much about character development or story lines. I'm just a dude who likes movies.\n\nThe ending is kind of \"cornvenient\" Wow! I was trying to say this movie was good, but...\n\nIt ended up being wrapped up in a weird...bow! Kind of like when you pour a soda too fast and the fizz starts to pour over....and you drink it before it hits the table!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "milesd-90529",
        "review_rating": "3",
        "review_title": "Oh Dear.",
        "review_detailed_main": "Simply put. Jessica Alba ruins this movie with her usual wooden acting. She should never have been given the part. But hey she was a big name back then. A more rounded and polished actor could have brought so much to this movie. As it is. Give this a miss. Jessica Alba does nothing good for this flick. Oh and the ending is just eye rolling (pun intended) and made me hit the stop button.\n\nIt's a yawn fest because of you know who."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "guynaba",
        "review_rating": "6",
        "review_title": "Regular, not good",
        "review_detailed_main": "This movie could be much better than really is; in my opinion the plot could have been better worked and there are some parts that should be better explained.\n\nAlthough I don't think Jessica Alba is the right person to do this character, I think she did a great job as the blind musician that receives a cornea donation.\n\nHowever, the movie claims for more atmosphere, more breathtaking moments and more dynamic directing. It is not even close to be a scary movie, if that was the original intention. It's a nice movie for the times you have nothing else to do, but it's not a must-see, definitely."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "acdalpiaz",
        "review_rating": "5",
        "review_title": "Not realistic. It was just OK.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "6",
        "review_title": "a fairly generic horror movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "LeonardMonichi",
        "review_rating": "4",
        "review_title": "just another remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "rosie_17-49-456710",
        "review_rating": "8",
        "review_title": "Tense thriller",
        "review_detailed_main": "Really enjoyed this film. Interesting concept with a good performance by Jessica Alba"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "webmaster-3017",
        "review_rating": "7",
        "review_title": "HK Neo Reviews: The Eye",
        "review_detailed_main": "Tagline: A more than credible effort for a remake\u0085\n\nReview by Neo: The Pang brothers were famous for one film and it is really the only film that qualifies them as great directors. The Eye established the Pang Brothers entrance into HK and later into the Hollywood adventure, but in all truthfulness, while their films are always beautiful and stylish to look at; the substances in recent times have been largely questionable. Using the words from Bey Logan, the Pang Brothers have \"a great eye\" and vision and story of The Eye is easily their best effort to date. With Hollywood running out of ideas, it is just the norm to remake films from the best of Asia and most notably the Oscar Winning film Departed. While the aforementioned flick is questionably good, it somehow still managed to win the Oscars, despite being ten times worse than the original Infernal Affairs, in Neo's honest opinion. It is double injustice when you think back in 2002 Oscars; Infernal Affairs did not win the Best Foreign Film Award. Luckily, the latest remake of The Eye is able to hold its own and does so efficiently and effectively as a thrilling that is exactly thrilling. Now that's a rare sight in Hollywood.\n\nPerhaps the funniest aspect of this review is that Neo still haven't mentioned his favourite Hollywood hot tie, in Jessica Alba. In previous reviews, Neo would have already declared his love of the aforementioned hot tie, just to remove any sort of bias that he maybe concurring towards. Still, The Eye all, but confirmed that Alba can act and the good news is that she is still hot as well. In a comparison of Angelica Lee and Jessica Alba, both playing the same role, there is no doubt each is better in their own ways, Lee is certainly a better actress and Alba is way hotter. With that being said, Alba more than holds her own in this role and the result is being able to hold onto the audience from the start till the very ending. Now that's an achievement to be proud of.\n\nMoving on, there are some scenes that are worthy of special mention for instance the exhilarating final bus bomb sequences as well as the recreation of the Chinese restaurant haunting sequences. You know a movie isn't bad, when it is at the very least thrilling and at times exciting.\n\nAll in all, The Eye is good, because the original story is a good one, but some credit must still be given to the director for executing his own imprint into a remake. With that being said, there is no point comparing the original to the latest remake, as each is targeted at a different audience. While the Pang Brothers have a great eye and style, the US version cares more about being efficient and effective than anything else. Still, The Eye somehow manages to be an adequate movie and as far as remake is concerned, it isn't half bad and having Alba in the mix always help, especially when the current reviewer is a male\u0085 (Neo 2008)\n\nI rate it 7.5/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "ctomvelu1",
        "review_rating": "5",
        "review_title": "Ghost whispering",
        "review_detailed_main": "A remake of a Chinese flick THE EYE tells the tale of a woman who has had corneal transplants and begins seeing apparitions and having bizarre visions of inexplicable events. Nothing really makes sense until the last few minutes of the movie, but that's OK. Some suspenseful moments, but too many jump shocks that quickly wear thin. And Jessica Alba is OK, but just OK, in the lead. She's pretty but not much of an actress. To be fair, very few Asian ghost/horror movies play particularly well in their American remakes. The ending looks like it could have come from THE MOTHMAN PROPHECIES or any FINAL DESTINATION film, only it's not executed as well. There are also bits lifted from GHOST WHISPERER. And there's a recurring spectral character who may remind some of the obnoxious paper boy from BETTER OFF DEAD. Stick with BLINK starring Madeleine Stowe, which tells a similar story."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "battyereviews",
        "review_rating": "3",
        "review_title": "Bland acting, drab story and dissatisfying conclusion",
        "review_detailed_main": "Let's begin with the positives, shall we? 1. Interesting concept; the film's premise (even though it's a remake) remains intriguing. 2. The progression of the narrative; the film's narrative is consistent, up to the end, at least.\n\nThey're the positive aspects of this film. As for the negatives, oh, dear. I, personally, had numerous problems with the film, namely one Jessica Alba. Alba's performance is tedious, somewhat forced and ultimately lacking in any emotional empathy, shall we say, that she has, or, rather, is supposed to have, with her character. She was nominated for the Razzie award for Worst Actress 2008. No wonder. As for the other performances, they seemed to lack conviction, and, as a result, were equally mediocre. Moving on to what characterises most horror films; tension and suspense. This film was, again somewhat lacking, apart from a few effective jump scares, however, there were a few 'cheap scares' present, also, which were infuriating for the avid horror film fan. However, what irritated me most was the script; totally devoid of interesting dialogue, utterly dry, abrupt and forced. The climax of the film (without spoiling anything) conformed to the aforementioned criteria; abrupt, dissatisfying, predictable. To conclude, it's not really recommendable, especially for admirers of the first film."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "kendotec-1",
        "review_rating": "6",
        "review_title": "Spooky but not frightening",
        "review_detailed_main": "I didn't know much about the movie or it's original idol but after watching it i'm not disappointed.\n\nJessica Alba in this movie plays a blind woman who get's an eye transplant and soon after the operation begins to see strange things. First that seems to be normal because of the aftereffects of the operation, but later she learns that those are not optical Illusions or the like but a sideeffect of the transplant she got, she sees what the former owner of her eyes saw.\n\nThe acting is not too bad, on the other hand no one probably will receive an Oscar for the performance, but everyone seems to catch a drift of the characters they play and so the movie is somewhat believable. There are some special effects that are integrated into the scenes fair enough to not look ridiculous or bad.\n\nI liked the story though I also saw 'blink' 10+ years ago, but that wasn't a negative influence for my viewing pleasure, maybe because I cannot remember much of 'blink'.\n\nIf you like Mysterymovies and Jessica Alba you probably wanna see this, if not, well it's still a well made movie, maybe a little slow at times but nice to watch nonetheless.\n\n6/10"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "helmutty",
        "review_rating": "5",
        "review_title": "The Eye",
        "review_detailed_main": "We all know it is a remake of the Chinese horror movie. I did not watch the original version. I watch it just to see more of my favorite actress, Jessica Alba. The plot seems slow and I had difficulties watching the first half an hour. I thought it would be thrilling and heck, it was not. The ghosts appearance are predictable. Once a ghost appears, there is talking and then in the next scene, another ghost appears and this continues. It is not bad but it is still not good. I did not really feel the suspense.\n\nThe story: Jessica Alba acts as Sydney Wells, she received eye transplant and she can see a bit but soon as the plot unfolds, she starts seeing ghosts and spirits. And she starts screaming. She then take up the courage to find whose eyes she had. This is all for the story. It is disappointing yet I had a bit of fun watching it. I can't really call it a horror movie but a mystery movie.\n\nOverall: It is another remake of another Asian horror movie. They always use the pretty actress to star in it. It does have its moments and that is all. Jessica Alba and the good moments scenes are not enough to change the story. If you like watching remakes, I guess this is another remake that light up your way. I like remakes, they are not bad but it depends on what I am watching."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "ashleybrownmedia",
        "review_rating": "7",
        "review_title": "Surprisingly decent.",
        "review_detailed_main": "From what I'd seen critics had lined up to pan this film, so for several years I didn't worry about it, and admittedly I've not seen the original version.\n\nHowever it's been bouncing around netflix recently and so I thought 'why not give it a go!?' - and do you know what? I was pleasantly surprised. It's never going to win any Oscars - but then again, I don't think it was made with that in mind, but for what it is it's a very solid film.\n\nThe reason why I've given it a seven instead of a six (and it's not just due to the fact that Jessica alba is gorgeous) is because it does something that few horrors do nowadays, it actually builds a feeling of dread and suspense, playing off of the main character's blindness and sudden ability to see things very well. I'm not one for jumping normally but the sound is used to great effect here, and as I was listening through headphones I got it full throttle!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "MovieGuy01",
        "review_rating": "4",
        "review_title": "Nothing like the original...",
        "review_detailed_main": "I did not really like the remake of the Japanese horror film The Eye, It had nowhere near the creepiness of the original film. The story is about. a violinist called Sydney Wells. She accidentally blinded by her sister Helen since she was five years old. She has a surgery of cornea transplantations. but while she is recovering from the operation, she realises that she is seeing dead people. With support of her doctor Dr. Paul Faulkner, Sydney manages to find who the donor of her eyes was. So she travels to Los Llanos in Mexico to try to solve the mystery of her visions and what she is seeing. I do not think that it is necessary to keep making remakes of films this has been the problem with recent Asian films"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "tostesarantes",
        "review_rating": "6",
        "review_title": "Good for a boring saturday night.",
        "review_detailed_main": "Probably because I had none expectation about this movie, it really seems good to me.\n\nI really enjoyed the story, and be pleased for its non abuse of exaggerations and cliches commons on horror movies. They didn't lost the point in the middle of it, trying to add many spectaculars things just to make the film longer.\n\nNevertheless, the end is so predictable thal almost disappointed me, but not that much. It worth the watch."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "nickpedersen",
        "review_rating": "4",
        "review_title": "Badly executet",
        "review_detailed_main": "The movie could have been good, because the story is interesting. But there is no build up! And the scares are not scary! Stupid wantabe jumpscares that only works the very first time!\n\nJessica Alba looks great as always, and I think she does okay being blind."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "playerette34",
        "review_rating": "9",
        "review_title": "A girl has an eye transplant which allows her to see into the supernatural world.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "towards-the-within",
        "review_rating": "4",
        "review_title": "Was it supposed to be scary?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Theo Robertson",
        "review_rating": "5",
        "review_title": "Bland Rather Than Blind",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "mattkratz",
        "review_rating": "8",
        "review_title": "impressive!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Alex-372",
        "review_rating": "8",
        "review_title": "Nice Chiller",
        "review_detailed_main": "This is a very good movie, with plenty of chills and a good plot. The problem may be that we have been watching years of The Ghost Whisperer, Medium, the X-Files and The Mothman Prophecies (Richard Gere, Laura Linney, Debra Messing).\n\nThe problem with television today is that there are such high standards of writing and production, that it almost makes movies irrelevant.\n\nSo if you are an impressionable mid-teen, this might be just new enough to you to be enjoyable. If not, mid-way you are saying \"But what do the ghosts want from Jessica?\". Anyway, the scares are pretty good, Jessica Alba is delectable. However, Allessandro Nivola must be the most unsympathetic and uncharismatic leading man in a long time."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "concsubstance",
        "review_rating": "8",
        "review_title": "Great thriller, and horror movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "zergio0",
        "review_rating": "10",
        "review_title": "Does its part very well.",
        "review_detailed_main": "I've got to say that I really liked this movie. Yes, it's not something superior or great but I rated it with 10 starts because it does its part very well. It is very entertaining and surprisingly spooky as well. Jessica Alba plays a very likable character that you get to like instantly. Overall the acting is very good from everyone. The girl that plays the donor and looks like Jessica Alba's sister Fernanda Romero does a very good job, although her parts are in Spanish I liked how you get to understand her through her emotions.I think though that they could have extended the donors story a bit more so we could understand the story better. Anyway if you wanna see something entertaining go see this movie, its good fun."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "mark_german07",
        "review_rating": "9",
        "review_title": "one good remake.",
        "review_detailed_main": "I have seen the original version of THE EYE and thought it was genius! when i heard about the remake i was just hoping that they don't mess it up.\n\nwell they didn't! for me the remake of THE EYE is good. the story line is good. and Jessica Alba's performance is surprisingly brilliant. in some parts i can feel her pain.\n\nthere were some scary parts but all of them are effective.\n\nthis movie is not really a horror film like many expected. it has drama and psychological thriller.\n\nfor some people they say that its the worst film ever because YOU JUST Didn't GET THE STORY!!!!! watch it again maybe the second time around you'll get it.\n\ni'll give this movie a 9/10.\n\ncompare to the original i'll give this 7/10.\n\ni recommend people watching this. this is one movie cannot be missed!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "sithwargod",
        "review_rating": "9",
        "review_title": "Awesome Remake, still not as good as original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "rutc",
        "review_rating": "9",
        "review_title": "Excuse Me",
        "review_detailed_main": "I see a lot of comments about how Jessica Alba is a terrible actress? Personally, I think she did a wonderful job in The Eye, not because of her looks.\n\nYes. The Eye was originally from a Japanese Film called Gin-Gwai. I have not seen Gin-Gwai yet, but hopefully I ll get to see it soon.\n\nI gave The Eye 9/10. I thought it was a magnificent film and I would definitely watch it again.\n\nThis movie wasn't as scary as I expected but the movie itself was very entertaining. The movie was a bit confusing at start but the end sums it all up. I strongly recommend all of you to watch this film."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Dontyoutrustme",
        "review_rating": "10",
        "review_title": "ummm...",
        "review_detailed_main": "Ya no need for the negative comments about this movie it was put together very well the story was awesome and Jessica alba is a GREAT actor. This movie is not meant to scare you outta your wits its a thriller its NOT a horror.\n\nThis movie is worth Seeing if you have good taste in movies, and understand stories well and it was written and directed Perfectly\n\nThere is nothing to change about this Jessica Alba is a wonderful actress and deserves an award of some sort for this.\n\nA movie this well done does not deserve to be shot down like that really shows you know the hard work that goes into writing and directing. RETARD"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "elcolombiano1123",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "I cannot see how you people think this movie is horrible!!!!! You people pay attention to the plot and other stuff while you should be paying attention to the movie itself. Jessica Alba can act and people that say she cant are just really jealous that they cant do anything and are just sitting around hating on all these actors and movies!! The Eye was a great film!!!! It was scary, funny, and had action! Whoever says that this movie isn't worth your money. Please!!!! This movie is the total bomb and therefore you should watch it. Yes, its a thriller and its really good and don't hate on Jessica Alba because she is very sexy and she can act way better then those people say she cant.She is a really good actor. I don't see what was so wrong about the plot. The movie was meant to be scary; not for nerds to judge every little detail about the movie and also just because some of you people cant understand Spanish doesn't make the movie bad. It makes it even better!!!! This movie is a thumbs-up all the way!!!!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Joekingfans",
        "review_rating": "10",
        "review_title": "It's Like An Episode from Rod Serling's \"Night Gallery\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Jan_geuns",
        "review_rating": "10",
        "review_title": "Goosebumps while watching",
        "review_detailed_main": "Surprisingly an amazing movie! There where moments i got goosebumps after realising what was happening! That is an amazing feeling if a movie can do that to you."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "miss-murder-xx",
        "review_rating": "8",
        "review_title": "One of the better remakes",
        "review_detailed_main": "For those who want to believe in the supernatural but just cant see reason to, then this is the movie for you. Sure it doesn't prove that ghosts really exist but when you whilst you watch it almost seems they do. I don't particularly think that it did need to be re done but I think that it turned out better then a lot of other remakes. The movie is about the supernatural so I think it makes it scarier. It's something that could actually be real. Compared to your usual horror film where it's based around a monster like character. This film proved to be suspenseful, exciting, and scary and makes you want to believe in the supernatural."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "arsenalfcclubwearegunners",
        "review_rating": "10",
        "review_title": "Bingo 👊🏻 Horror lover",
        "review_detailed_main": "What A Great And Brilliant Movie it was, I Highly Recommend You all to watch as it gives The horror, suspense and most of all the story line was so much good that i didn't get my eyes off for one second from the screen.... Great One, Must Watch ItWhat A Great And Brilliant Movie it was, I Highly Recommend You all to watch as it gives The horror, suspense and most of all the story line was so much good that i didn't get my eyes off for one second from the screen.... Great One, Must Watch It.\n\nIt's so beautifully made and once you start watching you can't stop. The ending I bet your going to say this isn't what I expected. Oh no! Who could have guess this. I'm trying not give any spoilers but if you haven't watch this I don't know why your still waiting buddy . I don't know why 🤔 I really think that i Alessandro Nivola is resembling with Ryan Reynolds in this role."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "tabitha-willson",
        "review_rating": "9",
        "review_title": "...And finally a review that doesn't say the movie sucked!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "nick_fb",
        "review_rating": "8",
        "review_title": "Good Stuff!",
        "review_detailed_main": "I think this film really proves that Jessica Alba can act! She has been typecast as a pretty girl / eye-candy, and not given a chance to prove her acting ability.\n\nWhile this film has faults, as do all films, I think it proves that she can connect with emotional reactions, and facial expressions needed for serious roles. She plays the part well, and can really display the anxiety and paranoia that can be felt when someone 'looses their mind'.\n\nMaybe everyone will disagree with me, which is fine, but I, for one, am very impressed by Jessica : Her portal of Sydney as a character is very believable, and very different from the type of roles she's been typecast in. She proves that beauty can also have acting wings : Go you!\n\nSo there!"
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "greekdx",
        "review_rating": "9",
        "review_title": "caprtivating horror flick",
        "review_detailed_main": "Here is a relatively tough horror movie starring jessica alba In this film the actress plays a violinist who had an eye injury 10 years ago and recently had an operation at the urging of her sister with very good results.\n\nBut this one had a twist side effect . She was seeing ghosts while in her sleep or being awake, as well watching shadows moving around her or her house transforming into an unknown cave.\n\nHer psychologist doctor called it \"cellular memory\".\n\nDesperate to understand what happened to her, she searched for the background of the eye donor found in Mexico. The doctor followed her and discovered a young girl. The neighbors thought the girl was a fortune teller (she was misrepresented as a witch ).\n\nMore details in the film. There are many extraordinary scenes to see that conclude the story.\n\nI found the film quite exciting With many twists and turns in the story and lots of horror elements regardless of what other commentators here on the site say\n\nConclusion 9/10 with a film that captivated me with the way it was shot and cutting/creepy and captivating effects and Jessica Alba shining in her role. This is the best roles I have seen amog a handful of others that include also the funny good luck chuck and fantastic 4."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "whlane92",
        "review_rating": "8",
        "review_title": "\"Not bad,\" says the person who didn't watch it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "ACHOUI-Badis",
        "review_rating": "9",
        "review_title": "Shouldn't be dismissed so easily",
        "review_detailed_main": "While The Eye remake may not be a perfect movie, it certainly doesn't deserve the harsh criticism it has received. Initially, I rated the film a 7.5, but I'm giving it a 9 to counterbalance the overly harsh reviews. Although I haven't seen the original Chinese version, I believe this remake delivers some solid moments that provide a decent, thrilling experience. It may not be a full-fledged horror movie, but as a soft thriller, it keeps you engaged and curious about the ending, which, while not highly elaborate, was satisfying enough to wrap up the story. This film shouldn't be dismissed so easily."
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "JoeytheBrit",
        "review_rating": "",
        "review_title": "Double Vision.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0406759",
        "movie_name": "The Eye",
        "movie_rating": "5.4",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Very familiar, even if you're not a horror buff",
        "review_detailed_main": ""
    }
]