[
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "MuviFan73",
        "review_rating": "5",
        "review_title": "Not as good as Rohits previous movies, seems desperate!",
        "review_detailed_main": "Story: During 93 Mumbai blasts 400kg RDX was used. The terrorists plan to detonate rest 600kgs in current future. Sooryavanshi and his team are in charge of neutralizing this havoc. Will they succeed? If yes than at what cost?\n\nCinematography & Direction: Average (Typical Rohit Shetty). A power pack entertainer which most of people would enjoy.\n\nActing (& music): I am not great fan when these things come. For example, we see Javed as comic artist so his portrayal failed. The comic nature of Vanshis to jumble up names is far away from fun. Vanshi aka Akahay looks old and comparison with other officers like Javed feels desperate. I liked Simmba's part although where he explains the consequences. Music was average.\n\nFinal Verdict: Singham and Simmba were better movies. I can't believe we waited so long for this movie. Disappointed."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sndpkumar",
        "review_rating": "5",
        "review_title": "Pathetic screenplay and dialogues",
        "review_detailed_main": "The dialogues and screenplay are too cliche. Could bear it for more than 20 mins. Not even half way there when compared to Singham 1. The dialogues made me puke . Too dumb and pathetic ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "imaryan-79408",
        "review_rating": "6",
        "review_title": "isse acha singham dekh leta",
        "review_detailed_main": "Movie lose it's pace and cringe jokes are also unsteandable., intrest losing moments wierd music selection , same story un countable movie , movies has long runtime it makes and no wow moments , in short predictable."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "winak",
        "review_rating": "3",
        "review_title": "Garbage that needs to be canned !!!",
        "review_detailed_main": "I am amazed that in this day and age of the \"evolved audience\" that there are still subscribers for such drivel. It's the audience that encourage directors like Rohit Shetty to dish out such crap and expect to make a profit. A few car wrecks, slow motion walking, sunglasses wearing top cop who single handedly destroys a network of terrorist sleeper cell. Wish combating real life terrorist were that simple. To top it up the movie makers prey on people's patriotism and emotion by seemingly dedicating the movie to the brave men of law. Wow quite a scam to get money from your wallet to their coffers. Akshay Kumar should know it takes more than just hanging from helicopters, making snide remarks and belittling others in a movie to be respected as an actor. Katrina presence was barely felt in the movie. I guess at 38 her days as a leading actress is winding down. Ajay Devgun and Ranveer were thrown into the pot just in case the audience got tired of Akshay's antics. Folks this movie didn't work for me."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vitthalmisal",
        "review_rating": "10",
        "review_title": "Well made blockbuster by rohit Shetty",
        "review_detailed_main": "A bit lengthy but well made movie epic blockbuster. Best action scenes of akshay kumar very nice acting and screenplay. Salute to our police officers Shetty cinematic universe."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "6",
        "review_title": "An average masala entertainer boosted by Rohit Shetty's unique idea of Cop-Universe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nickpatelhere",
        "review_rating": "1",
        "review_title": "Waste of time and money! Disappointed!",
        "review_detailed_main": "Very boring storyline, the logic is missing in the movie and the plot was boring. It is noisy and an absolute waste of time and money. Acting is also poor!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "haleyw-47428",
        "review_rating": "10",
        "review_title": "Amazing, awesome and wonderful content",
        "review_detailed_main": "Sooryavanshi is a 2021 Indian Hindi-language action film directed by Rohit Shetty and produced by Reliance Entertainment, Rohit Shetty Picturez, Dharma Productions and Cape Of Good Films, based on a script by Yunus Sajawal, Farhad Samji, Sanchit Bendre and Vidhi Ghodgadnkar and an original story by Shetty. The fourth instalment of Shetty's Cop Universe, it stars Akshay Kumar as Anti-Terrorism Squad chief DCP Veer Sooryavanshi opposite Katrina Kaif with supporting cast of Jackie Shroff, Gulshan Grover, Abhimanyu Singh, Niharica Raizada, Vivan Bhatena, Sikandar Kher, Nikitin Dheer and Jaaved Jaaferi. Ajay Devgn and Ranveer Singh in extended cameo appearances reprise their roles of Singham and Simmba from the franchise's previous films.\n\nKumar's character was announced towards the end of Simmba that served as a character introduction of Sooryavanshi. Initially locked for theatrical release on 24 March 2020, it was postponed due to the COVID-19 pandemic in India. The film was scheduled for theatrical release on 30 April 2021. In April 2021, the release date of film was postponed indefinitely due to the rise in COVID-19 cases and lockdown in Maharashtra."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "a_filmcritter",
        "review_rating": "6",
        "review_title": "Bollywood needs to stop with these patriotic movies",
        "review_detailed_main": "I'm unsure about other viewers but I am very tired of the same patriotic films. Same enemy, same concept, same way of direction/sequence of events, etc.\n\nThis movie had a lot of different actors in it, but didn't make much of a difference. Bollywood needs to get better writers, directors and creators. We need something new and different, even though I'm sure these movies are bringing in box office numbers so I doubt it'll change.\n\nThe dialogue wasn't as cringe, though there were many unfunny moments. The Tip Tip Barsa Pani song and overall romantic storyline with Katrina felt out of place; the movie could've done without it. The story brought in Ranveer Singh and Ajay Devgan for that blockbuster cast - but this movie could've done without them.\n\nOverall, it was a good action movie - didn't have high expectations and wasn't disappointed."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "irajbhattacharya",
        "review_rating": "3",
        "review_title": "Not worth the time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "arinavchandayc",
        "review_rating": "10",
        "review_title": "Good film",
        "review_detailed_main": "Adjusting the -ve reviews that these ssr aor boycott Bollywood fans will give without watching the film. It's a must watch and totally worth a hype best movie of rohit shetty till date , moves at a really fast pace so no chances of getting bore , ofc if it's a rohit shetty film then laws of physics are defied but story is worth a watch."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Filmwalla",
        "review_rating": "6",
        "review_title": "Mess With Mass Taste!",
        "review_detailed_main": "Everyone know this film is target for massy audience and there is no quality element.. I'm not that type that's why i didn't enjoy that type_ For entertainment factor it has some action sequence and I think they didn't hold any special creativity also story is really cliche with no any twist.. And surprise element already spoiled for everyone.. That's why i didn't expected too much from this film and I am satisfied not too much but I really think this is theatre piece.\n\nDon't think that this film is crap it has many Amazing moments and this thing everyone expect from the ROHIT SHETTY film.\n\nI really think that this film doesn't honour too much for police cause sooryavanshi character portrait is good but the depthness for this character is really terrible. Also KAT performance hold flat.. Also songs are ok ok.\n\nOtherwise there is nothing to spoil for this film cause director sir already spoiled it from trailer as well as posters!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "navsingh1",
        "review_rating": "1",
        "review_title": "Only Masala and boring too",
        "review_detailed_main": "Avoid the movie. It's filthy masala movie. Downfall of Akshay. Difficult to watch full movie. Boring, predictable and low class. There are better movies and series to spend time and money."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "eldreddsouza",
        "review_rating": "1",
        "review_title": "One of the worst masala films I've watched in my life.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "maliksadaf-15475",
        "review_rating": "",
        "review_title": "That's kind of an anti-pakistani film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "manishmanjul-96345",
        "review_rating": "10",
        "review_title": "Love it",
        "review_detailed_main": "Akshay Kumar - Wow Ajay Devgan - Wow Katrina Kaif - Wow Ranveer Singh - Wowowowowowoow.\n\nStory - 😂\n\nAction- 😂\n\nSong - 😂\n\nEntertainment - 👍👍👍👍👍👍👍👍👍\n\nThis shows if you want to make a movie be specific to your audience. Nobody watches Rohit shetty for sense or class . It has to be gun shots, flying cars , amazing entrance , gravity defying stunts and some slapstick comedy .\n\nWell you will get it all here .\n\nGo watch Sooryavanshi this diwali."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "karthikpatil-24849",
        "review_rating": "7",
        "review_title": "One time watch",
        "review_detailed_main": "See movie for akshay kumar only , typical bollywood masala. Action is good , story is typical bollywood.\n\nThey tried good story , But could do better."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shaikhirshad-41223",
        "review_rating": "3",
        "review_title": "Totally Disappointed.",
        "review_detailed_main": "After Simmba I have huge expectations from Sooryavanshi because of Akshay Kumar and Rohit Shetty coming together. But the mess the director has made in this movie is a huge disappointment. Predictable old story with terrorism angle which is not a good story at all and just repeated in every typical bollywood movie. Second thing there is not a single combat action sequence that will make you satisfy. Only the second half of the movie is little bit interesting because of RANVEER SINGH and his comic punches. Otherwise whole movie is boring and dull. Just don't expect too much because it will led you a huge disappointment.\n\nBgm is the only saving factory in this movie...."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "mundeparth",
        "review_rating": "10",
        "review_title": "Judge It as Masala movie and You would Love it",
        "review_detailed_main": "First Of all My rating Is 7 stars But Just because Of These SSR bots I am Giving 10 stars So that Average Is Well adjusted.\n\nI would Just say That if You love entertainment and You don't want To Use Your brain Then This Movie is For you and It's really well made . This Time The Action Is also not that Over The Top If Consider Akshay Kumar's Action , He performed stunts which were quite realistic but Ajay and Ranveer Were Really bad And over the top .\n\nI won't discuss negative Points as Everyone Knows about The flaws Of a Typical Masala movie.\n\nI Would just Prefer You to watch This movie If you love entertainment and action . Rest is Your choice."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nadkarnisumeet",
        "review_rating": "7",
        "review_title": "First experience after 18 months!!",
        "review_detailed_main": "Sooryavanshi review :\n\nFinally something for the theatre owners to cheer about. Also for us, the audience!!\n\nThe first major Bollywood theatrical release since March 2020 (Baaghi 3 was the major release just before Corona struck us); Sooryavanshi can be called an ideal festive dhamaka to pull back the audience to cinema halls which have sadly, been shut or running empty since then...\n\nRohit Shetty's cop universe extends to Veer Sooryavanshi (Akshay Kumar), an ATS officer, who along with Singham (Devgn) and Simmba (Ranveer) take on the terror group (Jackie Shroff and company) planning to blow up Mumbai once again. À la March 1993.\n\nAkshay is in top form again after Bell Bottom (2021) and the Bangkok action stunts are a treat to watch reminding us of his daredevilry in Sabse Bada Khiladi (1995). Katrina Kaif, playing his wifey, sizzles the screen in the remixed 'Tip tip barsa paani' number from Mohra (1994) though I preferred Raveena's sensuous jhatkas from the original. Yea, the plot is typical '90s stuff but cleverly updated to present times.\n\nInfact, the first half is a breeze watch with all the action, emotions and drama unfolding at a super fast pace. Rohit even brings a secular touch in a particular scene where Muslims help Hindus to take Ganpati idol from Mandir to a safe place in course of a terror strike even as a remixed \"Chodo kal ki baatein...Hum Hindustani\" song plays in the background. Pop bhaichara, indeed!!\n\nPost interval, the film dithers and withers a bit as the screenplay appears to be in a tearing hurry to introduce its two main cameo characters - you know who!!\n\nRanveer Singh and Ajay Devgn make their grand entry and then, Shetty completely lets the action department take charge. Which ain't a bad decision at all as the stunts are imaginatively executed. Notably, the continous shot of Ranveer bashing up a dirty dozen is superb. Taalimaar!!\n\nThe dialogues are massy, the technical aspects are okey dokey and the end finale promises to carry forward the franchise with a Singham sequel. Clearly, the focus is to entertain. Nothing more. Nothing less. And that is important...in the current times when audience hasn't been to theatres since early 2020. In that sense, Sooryavanshi truly achieves its objective. And thats why it should be seen. Only in theatres please!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "aniruddhawaghmare",
        "review_rating": "1",
        "review_title": "overrated",
        "review_detailed_main": "Nothing original nothing new just same old deshbhakti crap over and over again acting was cringe, dialogues were terrible as ever VFX were weak director just relied on action and same old hero heroine's love songs thing which was even more terrible.\n\nStory was copied just like every other Rohit Shetty movies he didn't think about anything or did any research for the movie he just thought he was making a cop universe movie which i hope he thinks again and do something original for once and on that top Akshay Kumar, Ajay Devgan, Ranveer Singh and katrina kaif the most talented stars did the most terrible acting i was disappointed by Ranveer he was so good doing original stuff this just ruined his Career i am never watching his movies again."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ck-38431",
        "review_rating": "9",
        "review_title": "MEGA BLOCKBUSTER🔥",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "witra_as",
        "review_rating": "6",
        "review_title": "Diwali entertainer with same old plot",
        "review_detailed_main": "Rohit Shetty's cinematic cop universe finally happened. A Diwali entertainer with same old plot you can just sit back and watch without thinking too much. Romantic elements were forced a bit but Akshay gave knockout performance in both action and comedy aspects."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "crahulsingh",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Same storyline with stunts done by bodydouble.. thinking why one spend money for this film.. boring and waste of time. Could have been much better.. Good script is required."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pulsar-16",
        "review_rating": "3",
        "review_title": "Your average hate Pakistan movie",
        "review_detailed_main": "Some Pakistani terrorists, bomb blast, deshbhakti, remind muslim that indian muslim good, pakistan muslim bad etc etc.\n\nAkshay movies are getting boring now. He is losing his touch. His comedy is bad now."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "eselimgaming",
        "review_rating": "10",
        "review_title": "Fully Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "manojkasotiya",
        "review_rating": "",
        "review_title": "Bollywood's losing it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "SoumikBanerjee1996",
        "review_rating": "6",
        "review_title": "Hardcore Shetty Fans Would Be Pleased!",
        "review_detailed_main": "Being the most anticipated fourth entry into the much celebrated 'Cop Universe', Sooryavanshi has got everything the hardcore Rohit Shetty fans have been eagerly waiting for!\n\nOverly dramatized Action Pieces? Check!\n\nObnoxiously Loud Dialogues? Check!\n\nWitty, Inconsequential Humour? Check!\n\nExplosions? What do you think? Again Check!\n\nAt the same time, once more we got to witness the same weaknesses these films tend to possess! Incompetent storytelling, inadequate depth and amongst all; the most glaring issue is the lack of rationality & logic.\n\nNow, don't get the wrong idea; this wasn't a bad movie by any means! And I'm sure persistent supporters of this franchise would be reasonably appeased!\n\nFor me though, It was just another generous massy entertainer, nothing special!\n\nThe Humour was good, the underlying statement about unison and brotherhood; that was a neat addition! Likewise, the Actions; despite being primarily over the top and disorganized, I was having quite a fun ride; not gonna lie.\n\nEspecially, in the last half an hour, it was pretty great."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hussainmerchant",
        "review_rating": "1",
        "review_title": "Worst movie of Akshay",
        "review_detailed_main": "Overrated and absolutely opportunity wasted. Rohit is not at all a good director. He can only direct action part of movie but a movie does get hit only coz of action so he needs to stop directing...Akshay needs to stop over acting."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "awaisraza-69519",
        "review_rating": "10",
        "review_title": "Very nice film",
        "review_detailed_main": "I see this film , it is an interesting film , I also say my friend and cousins to watch this film , in this film each and every character is very interesting , each and every character paly a very nice role ,"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "grarunkumar1994",
        "review_rating": "6",
        "review_title": "Rohit Shetty's best in the last decade.",
        "review_detailed_main": "The last watchable Rohit Shetty film was \"Chennai Express\" in 2013, but that was hugely thanks to SRKs charms and comic timing, which Shetty managed to ruin in Dilwale. Simba although decent is not an original work. Sooryavamshi was surprisingly entertaining with jokes that actually makes us giggle and action scenes that doesn't force Newton into depression. Honestly the hand to hand combats is one of the good ones that came out from Bollywood in recent times.\n\nAkshay, amidst all biopics, managed to do a good action film and thanks to Shetty, the scenes are pretty good.\n\nAlthough it was fun to see Singham and Simba since multistarrers are always a welcome idea, Ranveer Singh has reached the time where his 'pseudo hyper' behaviour has become irritating. Forgivable here since Simba is a character, but he isn't entertaining anymore.\n\nKudos to shetty for improving the quality of film making post Dilwale and other pile of forgettable craps. If he keeps up to rational zone in stunts and comic scenes, he can very well helm a Mission impossible like film soon.\n\nCons- Plot is predictable Story is cliche.\n\nTried too hard to white wash govt moves and forced scenes on 'Hindu-Muslim' unity. Why?\n\nAkshay looks really old especially on side shots of face.\n\nMovie could ve been a bit shorter.\n\nKatrina Kaif was wasted for just 10mins of entire movie, failed to create an emotional attachment to characters.\n\nPros- Good action scenes on Bollywood standard.\n\nDecent CGI.\n\nCasting is real good esp Javed Jaffrey.\n\nSome jokes work.\n\nIs it bad? Not as previous shetty movies.\n\nIs it good? Maybe.\n\nIt sure is entertaining."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "IPyaarCinema",
        "review_rating": "3",
        "review_title": "Enjoyment no, Headache Yes",
        "review_detailed_main": "Review By Kamal K\n\nRaising the curtain with '93 blasts in Mumbai, the story focuses on a major chunk of explosive material left from the blast, linking it with a couple of fugitives who managed to escape back then. Veer Sooryavanshi (Akshay Kumar) is handled the mission by his superior Kabir Shroff (Jaaved Jaaferi), who though was the star of solving the '93 bombing case but he still regrets some of the choices he made.\n\nSooryavanshi, along with managing his family issues with wife Riya (Katrina Kaif), investigates the missing RDX which, they get a leak about, could be used for multiple bomb blasts in Mumbai. With help from his old colleagues Simmba (Ranveer Singh) & Singham (Ajay Devgn), Sooryavanshi races against the time, hoping to stop the ticking bomb avoiding a lethal disaster.\n\nI expected from this year's biggest hit movie that it will be successful in giving good comedy and action. But despite being a mass entertainer, the film does not get any kind of entertainment. There was no crispiness in the action scenes. The very important helicopter chase scene's VFX looks straight out of a low-budget-high-ambitions movie.\n\nThe only good thing about the movie was Singham's entry.\n\nPostive -\n\nLittle Bit Comedy Singham's Entry\n\nNegative -\n\nStory Horrible Direction Overacting and lack of acting Poor Vfx."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kajane",
        "review_rating": "10",
        "review_title": "SOORYAVANSHI has it all stars, scale, action and entertainment.",
        "review_detailed_main": "SOORYAVANSHI has it all stars, scale, action and entertainment. Rohit Shetty (the director) presents a Blockbuster package this Diwali.\n\nTeam Rohit Shetty has done exceptionally well. After Chennai Express, it's the second best film of Rohit Shetty equaling Singham and Golmaal I.\n\nAjay Devgan & Ranveer Singh make an appearance in the last 30 mins of the film and that's when things get really explosive. Ranveer in particular is superb with the righ balance of comedy and action."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "avishekmoitra",
        "review_rating": "7",
        "review_title": "Well Done, Rohit Shetty",
        "review_detailed_main": "Based on terrorist attacks in Mumbai, The film follows DCP Veer Sooryavanshi, an ATS officer who's aim is to sabotage and to prevent the terrorist attacks in Mumbai by the Islamists, who were responsible for notable terrorist attacks in Mumbai.\n\nRohit Shetty promised us to give enough action, humor and entertainment in theatres but lacked some logic in the climax and better storyline.\n\nAkshay Kumar delivers serious but humorous performance in the film. Katrina Kaif's performance is okay and of course not to forget about Simmba and Bajirao Singham. Their performance in the climax was the main highlight of the film. Action sequences are breathtaking and realistic, cinematography is top notch, the songs remind us the nostalgia and freshness and visuals are next level.\n\nAn out and out next level Rohit Shetty style action flick and he kept our promise by expanding the cop universe series. In my opinion, it is the best cop franchise in the history of bollywood cinema.\n\nIf you are Rohit Shetty action film fan, then this film is a great popcorn watch."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "d_dhawan2000",
        "review_rating": "1",
        "review_title": "Repeated Formula by Rohit Shetty.",
        "review_detailed_main": "Police vs Bad guys sprinkled with forced humor. Rohit Shetty has become so repetitive, That his movies are like old wine in the new bottle. Acting of the main leads is also predictable, its a shame the such seasoned stars fails to bring something new to the table...One time watch...with popcorn...while watching just leave your brains outside the cinemas. Don't expect anything out of the ordinary."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Soul_Snatcher",
        "review_rating": "1",
        "review_title": "Bollywood's finest drivel",
        "review_detailed_main": "You won't have any brain cell left after watching this sham. The dance, action and acting were so cringy that would motivate you to give up completely on Bollywood. With all the controversies surrounding Bollywood of late, people have given up on it, and the Rohit Shetty films don't do any favors. As usual, if you're into brainless cringy action drama, go for it.\n\nIt'd be great if Rohit Shetty stops making movies. Thanks!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "thproegnet",
        "review_rating": "",
        "review_title": "Akshay Kumar is more than a huge star, he's a fantastic actor.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "imdadsimri-03055",
        "review_rating": "6",
        "review_title": "Only salman khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hmaravind-24605",
        "review_rating": "1",
        "review_title": "Bad Movie",
        "review_detailed_main": "Today i watched this in Gopalan cinema bengalore.. After i feel money is wasted. All are talented actors but story in very bad. Worst action. And comedy not entertaining. I don't recommend this rubbish movie. -1/5."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "marthakats",
        "review_rating": "10",
        "review_title": "Super fun for Action/Thriller Movie Lovers",
        "review_detailed_main": "Amazing movie!!!! Bravo Rohit Shetty for the great work done!!...reminds me of the crimes affecting the society today. Thumbs up to Akshay Kumar for playing his role as a cop perfectly. Katrina on the other hand looks superb as always. Ajay D. & Danveer did wonders in this one!! Definitely would re-watch it again n again!!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rajeev-vlal",
        "review_rating": "7",
        "review_title": "OK",
        "review_detailed_main": "Ranveer Singh should stop his obnoxious overacting. Spoiled the whole movie. This movie needed some serious actors which some better direction. This franchise needs The Family Man type direction."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "romanakawasia",
        "review_rating": "1",
        "review_title": "Don't Ruin Ur Karma",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "umeezkhan",
        "review_rating": "10",
        "review_title": "Katraina kaif",
        "review_detailed_main": "Last Time katrina kaif happy to see ranvir singh great movies love at.\n\nOne thing i note no action on this movie means no fight.\n\nLast seen very interesting enjoy lot of love with each other."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "devarshmdavecool",
        "review_rating": "7",
        "review_title": "Overall Good, but weak execution of climax.",
        "review_detailed_main": "Yes the climax according to me was poor, they could have done better. But the film till climax was nice. The entry of Akshay Kumar, Helicopter Scenes were so good, TIP TIP was also good and none the less Background Score was also nice and chilling. Katrina's role was like no more than 15 minutes. And it was Simmba's entry which was thrilling and filled with more Entertainment rather than the Singham's one.\n\nSo it is could have been perfect if the climax was properly executed. You will surely love this one on big screens."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vluckylkv",
        "review_rating": "1",
        "review_title": "What is rohit shetty trying to do??",
        "review_detailed_main": "What is rohit shetty trying to achieve by making a cop universe?? Just like singham 2 and simba, sooryavanshi is worst addition to his cop universe. This movie has only masala no story, no acting at all. I always wonder why rohit shetty movies does very good business even though his movies are very very bad."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Laqshayaroraofficial",
        "review_rating": "1",
        "review_title": "Watch it in theatre if you hate your money and your brain.",
        "review_detailed_main": "This movie is so utterly stupid, there is no storyline, there is a difference between masala and stupidity, they think audience is stupid enough to like this movie. Watching this movie in theatre is like giving money to three cops for doing nonsense things."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "mdhole-64570",
        "review_rating": "10",
        "review_title": "A must watch movie",
        "review_detailed_main": "Rohit shetty has done excellent direction in this movie, also the actors akshay kumar, ajay devgan have acted brilliantly, its a must watch movie for akshay kumar fans also the story and plot of this movie is very engaging which keeps your eyes tight on the screen."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shreeinfo-19099",
        "review_rating": "",
        "review_title": "WASTE OF MONEY AND WASTE OF TIME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tajimcom",
        "review_rating": "6",
        "review_title": "Nothing New",
        "review_detailed_main": "It is very predictable. Nothing new. Same story which we have seen multiple time but good to watch in theatre after a long time. Typical Rohit Shetty movie. Some comedy punches are nice.\n\nClimax scene is also good when Sooryavanshi, simmba and singham fights together."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "dr-abhijitdasgupta",
        "review_rating": "3",
        "review_title": "MIXTURE OF MANY MOVIES NO SUBSTANCE ONLY GLITTER",
        "review_detailed_main": "SOMETHINGS ARE TAKEN FROM HOLIDAY WHICH IS ITSELF A REMAKE. THE MOVIE FOLLOW THE SOUTH INDIAN TEMPLATE ONE OPENING SEQUENCE THEN THE ROMANTIC TRACK THEN THE PLOT MOVES FORWARD. THE PLOT IS WAFER THIN BASED ON PAPER NEWS NOTHING UNPREDICTABLE. SINGHAM IS ONLY AT LAST 15 MINS THOUGH HIS SCREENTIME IS NOT MORE THAN 6 7 MINS. UNNECESSARY COMEDY OF RANVEER SINGH IN SERIOUS MOMENTS IS A LETDOWN. THE MOVIE AS A WHOLE FROM ACTION TO PLOT EVERYTHING IS A AMALGAM OF MANY MOVIES AND SCENES."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "alphaq-63642",
        "review_rating": "10",
        "review_title": "My review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "m-ramanan",
        "review_rating": "7",
        "review_title": "If you dont search for logic and story, this will entertain you..",
        "review_detailed_main": "RATED 7/10 Language: Hindi Source: Netflix\n\nRun of the mill story and execution, what else we can expect in the masala movie... the best part is the movie presentation is watchable and Akshay's comedy works out in most of the places... Highly predictable story and heavy mass masala action sequences... This one is to forgot all worries and just enjoy the pure masala bollywood.\n\nIf you dont search for logic and story, this will entertain you.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Gupta_m",
        "review_rating": "1",
        "review_title": "Nothing coherent",
        "review_detailed_main": "What are punjabi songs doing with marathi characters? What is the real need of a romantic number in a cop-based action plot?\n\nJust commercial elements and nothing else."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sammyzoe-47570",
        "review_rating": "10",
        "review_title": "Best Bollywood movie",
        "review_detailed_main": "Very interesting movie with an amazing directors, the time waiting for this movie is really worth it, with the way Akshay Kumar made some mind blowing skills and stunts, it's really worth watching.\n\nHis acting skill is very unique.\n\nThis is the best Bollywood movie I have ever watched.\n\nI suggest you watch also."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tkmce2008",
        "review_rating": "7",
        "review_title": "Rohit Sherry's Cop Universe needs work but Akshay Kumar shines bright as Sooryavanshi!",
        "review_detailed_main": "The wait has been pretty long. Fans like me have been dying to watch the first (Indian) cinematic universe come together since March 2020. And has the wait been worth it? It has for Akshay Kumar's character but not so much for the trio; which is why I left the theatre less enthusiastic than I entered it.\n\nVeer Sooryavanshi is a part the Anti-Terrorist Squad. His team has been trying to track down 600kgs of explosives that was buried someplace in India after the 1993 blasts. When they arrest a sleeper cell agent, a chain of events unfold potentially putting the nation in danger.\n\nAkshay Kumar returns as Veer Sooryavanshi after his character was teased at the end of Simmba. Akshay's police avatar is the most believable of the lot (among the three) given that he performs most of his stunts and they are less over the top. Also, it is always a delight to watch him onscreen especially when he seems committed to the role. Co-star Katrina Kaif doesn't have much to do (that was a given). Ranveer Singh & Ajay Devgn, who reprise their roles from Simmba & Singham enter the film only during the climax. This doesn't give the trio sufficient time to bond and their scenes feel rushed. Would have loved to see more of them together. Devgn also explicitly announces Singham 3.\n\nThis is the first film in the Shetty cop universe that has an original story. And this works in the film's favour to an extent (better than the other three). But the plot is mostly the same: old- terrorists with unfinished business, religious divide, the hero preaching to anyone who will hear & some harmless work banter. Nevertheless, it is a mass entertainer and it is the perfect excuse to return to the theatres."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "Sadly pathetic",
        "review_detailed_main": "Rohit Shetty lost it here big time. Dont know as to why he made such a movie, so much out of line, merely on hate, misrepresentation and to promote a negative stance.\n\nAkshay Kumar, well this surely is start to his end.\n\nThere is no Rohit Shetty fun / jokes in this one. There is no comedy at all and the few pathetic ones are so badly timed.\n\nKatrina Kaif, guest appearance.\n\nJackie Sharoof, horrible approach choosing the role\n\nWaste of time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Feel-the-truth",
        "review_rating": "1",
        "review_title": "Who made this movie?",
        "review_detailed_main": "Who really directed this movie? Was it Rohit or Narendra?\n\nAnother propaganda movie in the era of the fascist BJP government.\n\nThese type of movies have been done to death and quite frankly are now very very boring.\n\nBollywood has no backbone, and it is clear what some of bollywood has signed up to.\n\nThe movie is a bore fest, nothing that has not been seen before, shoddy acting, the film has been designed to incite voilence.\n\nI was really hoping to see something fun after a very tough pandemic, wasn't expect this. IF I had known I would not have gone."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ngenogeff",
        "review_rating": "10",
        "review_title": "Amazing Movie",
        "review_detailed_main": "What an amzazing movie done byAkshay Kumar , Ranveer Singh , Ajay Devgan, and Katrina Kaif. This ia the best movie i have ever watched .Thank you guys."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "premmgor",
        "review_rating": "7",
        "review_title": "Movie Premyy's honest review",
        "review_detailed_main": "Honestly, Sooryavanshi is nothing but an average typical Bollywood flick that expanded Rohit Shetty's cop universe. The Highlights: BGM, Ranveer Singh, witty dialogues. It seems The story, Action sequences, and Screenplay could have been much better. Frankly, not up to Rohit Shetty's other films. Recommended! 😄"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "baruaritesh",
        "review_rating": "3",
        "review_title": "Same old story with cringeworthy dialogues",
        "review_detailed_main": "This over patriotism bug of Akshay Kumar is destroying his movies and that of his directors. Rohit Shetty falls into the trap this time.\n\nA centuries old plot and storyline. Cringeworthy dialogue writing are what are the main villains of this plot. This film was touted as the one getting audiences back into the theatres, but what a disappointment. Same old Pakistan bashing.\n\nKatrina Kaif as usual is an accessory heroine and adds absolutely no value. Im addition she destroys a classic song ( where is the originality of sognwriters?). She's a -4 when rated out of 10.\n\nThe only bright spots in the movie are probably the scenes with Ajay Devgn and Ranveer Singh. The movie picks up post Ranveer's entry and Ranveer's brilliance carries it through\n\nI wonder if these \"Established Actors\" actually read and study all aspects of the movie before signing them.\n\nMy rating is only for Ranveer Singh's part and that of Ajay Degvn's."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nirmaljay-48409",
        "review_rating": "10",
        "review_title": "Sooryavanshi is not only easy on the eyes.",
        "review_detailed_main": "Let me make it clear in advance that this is the first film I have watched in cinemas since the pandemic, and my intention was clearly to enjoy a masala action movie. Sooryavanshi is not only easy on the eyes, but is also charming to senses if entertainment is what you're looking for. It's not a very complex story; it's rather easy to follow and enjoy whatever the film has to offer, ranging from the stunning action sequences to music to bits of humor. This is a proper \"mass\" movie designed for fans of escapist cinema and especially the action genre aficionados. Rohit Shetty has proved that he can make movies which can please crowds and make sure the average viewer exits the auditorium with a sense of satisfaction."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "cooldwijen",
        "review_rating": "7",
        "review_title": "It's not 10 starrer nor it's a 1 starrer",
        "review_detailed_main": "The movie could be 30 mins shorter and crisper but for the entertainment value it offers its 6 or 7 starrer. I don't understand the hate coz it is showing the villains from one particular country or religion."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "SouravChakraborty_P1",
        "review_rating": "1",
        "review_title": "Nonsense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "zkhan-57402",
        "review_rating": "10",
        "review_title": "Overall Good action movie",
        "review_detailed_main": "First half is absolutely stunning. It has the elements of making a well researched, credible and blindingly fast blitzkrieg that makes you sit up. The second half unfortunately has a typical Rohit Shetty film written all over it, and literally tears down, systematically, everything that the story had built up. It turns into an average Bollywood potboiler, with chest beating supercops, overflowing machismo and adrenalin, and mindless, endless action and spraying of bullets from all sorts of machines possible."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Perspicuity1",
        "review_rating": "6",
        "review_title": "It's not 'Sarfarosh' or 'Special 26', but it's not as entertaining as Simmba either.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vishaltaywade",
        "review_rating": "1",
        "review_title": "Director of soorywanshi is udhav thakhre 😆😝",
        "review_detailed_main": "What rubbish of this movie, all things are whitewash of Maharashtra govt.\n\nDon't make a joke, The 1993 Mumbai Blasts planted by Congress party 🙏 This thing is not shown in the movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "anishmachamasi",
        "review_rating": "1",
        "review_title": "repetative action. same thing in every movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "lsolution",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "This is one of the Best movie eve I have watched. Good acting, good scrip and perfect story. The Hero's in Khakhi are back with the audience welcoming them with Seetis. All d good cops n bad boys acted very well. Not too much of naach gaana band bajana. Best of the best and Good Luck for the Sooryavanshi Team."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "harshg-32332",
        "review_rating": "7",
        "review_title": "Decent time pass movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hXz0r3",
        "review_rating": "1",
        "review_title": "Kids Comedy - not action, crime or thriller!",
        "review_detailed_main": "Very disappointed with everything in this movie from story to direction and acting.\n\nWhy was this even made?\n\nOr just first movie after pandemic expecting revenue from people?\n\nComplete waste of time, money and 0 entertainment.\n\nI wonder if there was negative ratings on Imdb, this movie should top.\n\nSome leading actors should resign for same acting in all movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "marthakats",
        "review_rating": "10",
        "review_title": "Super Fun Hit for Action/Thriller Movie Lovers",
        "review_detailed_main": "Bravo Rohit Shetty for the amazing production!!! One of a kind movie where the characters blend/ fit perfectly with their roles. Akshay Kumar as usual played his role as a cop perfectly to end terror attacks."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Ketch_Rajath",
        "review_rating": "6",
        "review_title": "Crackers Of Entertainment 💥🔥",
        "review_detailed_main": "Sooryavanshi is an action packed movie, Hit Machine Rohit Shetty has done an amazing job.\n\nComedy timing of Akshay Kumar & Ranveer Singh is commendable and Ajay Devgn entry is awesome."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rdxrdx-979-692231",
        "review_rating": "1",
        "review_title": "Entertainer... really?? 😅😂",
        "review_detailed_main": "It's a complete baseless movie with repeatedly Tadka moment that we have seen in many movies. Akshay Kumar looks too old in appearance and action scenes...again he failed like Bellbottom. Katrina is same like her earlier movies. Nothing is special in story. Direction is Rohit Shetty style..pls change ur mindset..it's 2021 not 2010...finally I say only one word...'Not Interested\""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "akbarrkhan",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "I really liked this movie very much the directions and the action are amazing and actors are also given their best in acting . I highly recommend to everyone please watch this movie .. thanks."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jadavmayank-19834",
        "review_rating": "7",
        "review_title": "Worth to watch in cinema's",
        "review_detailed_main": "Movie is fine I viewed some of the reviews from IMDb and their is some negative reviews I read it.i think there is no need to be harsh on this movie look this is not movie where you find logic and drama because this is mass masala movie ya I agree the fact that movie had some negative things in it but you can watch it with your family in theatre movie won't disappoint you.it has enough entertainment.\n\nLet's talk a about some negative points Movie has background music but they play everytime although it doesn't needed at their time.\n\nAnd they repeated religion equality in india so many times well everybody knows that why they again and again repeat I don't know and few scenes are very forced."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shumailzafar",
        "review_rating": "1",
        "review_title": "Crap!",
        "review_detailed_main": "Pathetic writing, over acting, its look like a bhojpuri movie didn't expect this piece of crap from rogit shetty and akshay kumar. Same islamophoabia feeding in bollywood."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "acolytes_nirvana",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Any movie with Ranveer Singh is a waste of time to watch.. His time is over and new talented actors should be given chances rather than these bunch of pathetic overrated actors. This movie is nothing but a hype ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "awaisraza-69519",
        "review_rating": "10",
        "review_title": "Very nice film",
        "review_detailed_main": "I see this film , it's an interesting film , I also say to my friends to watch this film , in this film each and every character is so interesting , each and every character of this film play a excellent role ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "aushro",
        "review_rating": "1",
        "review_title": "Another disaster from the most disastrous talentless but lucky director",
        "review_detailed_main": "Even don't follow any kind of hype about this cartoon because it will going to kill ur precious time, money & a peaceful mind.\n\nI m sorry to say but it's true."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "amarnamisr",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "The direction of this movie is fantastic. The action scene was also amazing. It was a great movie. The directors and actors also did their job really well."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "PANDIAN120621",
        "review_rating": "6",
        "review_title": "AN AVERAGE COMMERCIAL POT BOILER.....",
        "review_detailed_main": "Same old wine in a same old bottle...rohith shetty fails as a stunt choreographer...Akshay tries to save this film but fails due to a predictable plot and a immatured screenplay.... Overall a below average film for shetty fans."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "mohitjawa",
        "review_rating": "1",
        "review_title": "ROHIT SHETTY PLEASE STOP MAKING MOVIES",
        "review_detailed_main": "Rohit Shetty is one of the worst directors in Bollywood. He should be banned from making any movie. I wonder who made him a Director! Remo D'Souza, Prabhu Deva and Rohit Shetty are spoiling Bollywood at its best. They have no sense of making movie, always same story,same action scenes.. This movie is so utterly stupid, there is no storyline, there is a difference between masala and stupidity, they think audience is stupid enough to like this movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "uh-87465",
        "review_rating": "10",
        "review_title": "Good movie with a great storyline",
        "review_detailed_main": "This movie has.great storyline awesome acting by actors.also movie has great stars of this time Ranveer Singh,Ajay Devgan and. Akshay Kumar had done amazing job. Really apperciate their hardwork."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "worldcitizen-52267",
        "review_rating": "6",
        "review_title": "Crap Movie Masala without Taste !!!",
        "review_detailed_main": "The movie lacks direction and story telling. The short coming of this movie is direction and lame dialogues.\n\nThe concept story was good with excellent star cast. However Rohit Shetty failed to do justice to story by trying to put too much masala. This guy just need to learn the balance between panache and gravity. Attempt to fit too much masala on story's expense\n\nWhat is also shocking is movie's attempt to justify and provide reasons why muslims terrorists performed acts of terror. I dont know why bollywood time and again try to do this.\n\nOnly watch if you have nothing else to do."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "princesabraham",
        "review_rating": "1",
        "review_title": "Worst in the cop universe",
        "review_detailed_main": "Hugely disappointed. The intro of Akshay is very low key and that very much sums up the rest of the movie. Movie is so bad that you actually feel happy when Simba and Singham come in. Not that it was way out of the box or something but just because it comes as a relief to the torture. Knowing that the same actor has done a crazy thriller such as Baby, makes it more torturous. You on various occasions think, did Akshay not find it ridiculous..??\n\nOld 90s movie just made in 2019. No logic whatsoever."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sharmilad-44132",
        "review_rating": "1",
        "review_title": "Waste of money and time",
        "review_detailed_main": "It's terrible without capital T. Worst ever acting of Akshay kumar. Don't watch it unless you agree to trash your money. Extremely bad storyline. Don't waste Re. 1 on this flop film."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "marvibhagat",
        "review_rating": "10",
        "review_title": "Great movie!",
        "review_detailed_main": "It's very awesome movie. Great acting by akshay kumar and katrina kaif. Concept is very good. Family movie. Everyone should watch this🙌🏻🙌🏻. Direction of this movie is also fantastic and lead roles played their characters so much versatile... Songs in movie are also superb. Have touch of some old songs like \"tip-tip barsa paani\" was awesome."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "abhi-16044",
        "review_rating": "7",
        "review_title": "Too much action !",
        "review_detailed_main": "It's a good family entertainer. But there are lot of action scenes which at times brings headache.\n\nOtherwise it has good music, stunts, direction which will make you feel value for money movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "coolhunk55",
        "review_rating": "3",
        "review_title": "Only the title is good, not the movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "victor_h_marx",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Great movie, with great acting and direction. This surprised me from start to finish. Strong scenes that captivate the viewer, with a lot of action and a beautiful drama behind it all."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vyankateshimpressions",
        "review_rating": "7",
        "review_title": "Good story but poor action and acting at the end",
        "review_detailed_main": "Good story and awesome acting by akki till the last 20 minutes. Well unity combination of hindu and muslim was shown .Good emotional drama and comedy till the interval but In the last 20 min movie was just a chutiyapa like in very serious fighting situation they are doing comedy .that was not fair at all. They shown mumbai police is better than black cats commando when singham fought alone with 3 terriosts. That was totally chutiyapa on peak. Overall avarage 💯💯"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pulkitkedia",
        "review_rating": "1",
        "review_title": "Time and Money wasted",
        "review_detailed_main": "The entire time and money got wasted. Would have instead gone to a temple where I would have got peace and the money would be used to feed and educate the poor."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ahsannawaz-96295",
        "review_rating": "10",
        "review_title": "Sooryavanshi is amazing movie.I have watched at many times.",
        "review_detailed_main": "Sooryavanshi is amazing movie. I have watched at many times. It's dialogue and it's music themes are very nice. All songs of this movie are very good."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "divyeshkareliya-61244",
        "review_rating": "7",
        "review_title": "Worst casting dialogues and story",
        "review_detailed_main": "Worst web series are better than this movie.\n\nJust because of post covid theatres reopening people are watching it.\n\nWaste of money. Bad dialogues. Boring story. Misuse of resources. Unnecessary branding."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Tamashha",
        "review_rating": "4",
        "review_title": "Worse Rohit Shetty movie ever",
        "review_detailed_main": "Went to see a movie in theatre after almost 2 years, but was a total disappointment. Bad action, childish VFX and poor direction. Last 2 years was the evolution of web series and one big thing i have noticed is that web series are far superior then the big screen movies in term of direction, screenplay and the intensity they create."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pan-pandey",
        "review_rating": "3",
        "review_title": "Kuch bhi dikha rehe hai yaar.",
        "review_detailed_main": "The movie was goot at first but becomes super bad towards the end.\n\nIt has many problems some of them are...\n\nThe romantic angle doesn't fit at all.\n\nThe terrorists are super dumb, don't know where to hide the bombs.\n\nWhat's the use of other two police officers i.e. Ajay and Ranveer ?\n\nThe movie is a about sleeper cells, but nothing much is shown about sleeper cells.\n\nThe movie is super loud, it can damage your ears."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shripednekar",
        "review_rating": "7",
        "review_title": "Action comedy .",
        "review_detailed_main": "Perfect combo of action and comedy. Perfect to relax your brain nd just watch it nd chill. Ignore the negative reviews and go for it. Its worth it.\n\nYou dont need to use your brain yo understand it. Just sit relax enjoy and have fun."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vikaspharma",
        "review_rating": "1",
        "review_title": "One of the worsted movie",
        "review_detailed_main": "One of the worsted movie ever seen.\n\nI don't like. I would like to give 0 star ⭐ but this option is not available hence I have to give minimum ratinge."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vivaksahu",
        "review_rating": "10",
        "review_title": "good",
        "review_detailed_main": "The storyline is unique and nothing can defeat the facts on which the movie has been made. Rohit Shetty has nailed it with his directional skills.\n\nRohit shetty great director good movie all team all the best."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sunnyujjawal",
        "review_rating": "6",
        "review_title": "decent mass masala entertainer",
        "review_detailed_main": "Sooryavanshi is a decent mass masala entertainer movie which you can enjoy with your family. Also, people who love logical and realistic movies stay away from this film. It is not a full paisa vasool movie but it is neither a poor or bad movie. I personally found Singham 1 and Simmba better than this film."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "neetuchoudhary-90313",
        "review_rating": "1",
        "review_title": "DON'T WATCH IT",
        "review_detailed_main": "Only katrina is looking beautiful . Everything else is waste of time and energy. We are bored of same acting of Canadian Kumar. Background music is good.\n\nOne word review - Waste."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pmdc-80707",
        "review_rating": "10",
        "review_title": "thw impressive movie",
        "review_detailed_main": "So sweet akshay the most beautiful trailer i hope the movie will bestlike trailer. Akshay kumaar is the most talented actor. Sooryavanshi will be in the trending movie in 2021 2022."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shailendravermag-12060",
        "review_rating": "6",
        "review_title": "Average movie but last 30 min are very poor",
        "review_detailed_main": "Movie goes overall at good pace till Ajay Devgan and Randeep enters. There entries were made at GOD level which is very very wrong.\n\nOver all movie is good but as soon as Ajay/Randeep enters and do all GODs act movie becomes boring and worst."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "dhiraj-yahoo",
        "review_rating": "1",
        "review_title": "Tip tip barsa pani, pani ne aag bujhai",
        "review_detailed_main": "Akshay is just trying to make as much money before he stop getting any more movies. Watch Money Heist and learn how to create action scene. Rohit Shetty is so overrated director Doesn't know a thing other the nonsense action shots and repeating same music in all movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rahulvaidya055",
        "review_rating": "1",
        "review_title": "Pathetic movie",
        "review_detailed_main": "Don't waste your time and money on this movie. Poor special effects, predictable and poor story line, bad single faced acting by akshay kumar and katrina kaif."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "anikad-67803",
        "review_rating": "10",
        "review_title": "best action movie",
        "review_detailed_main": "I have seen this movie so many time. This is the best movie in 2021. I love Akshay Kumar and all other actress. Overall love this movie. Special thanks to the director for gift us that this type of movie 🖤"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "aijaz-hussain",
        "review_rating": "6",
        "review_title": "Watch it for Katrina Kaif",
        "review_detailed_main": "Katrina Kaif, the most successful and hottest actress ever shined brilliantly in this movie. Her beauty, sensuality, and acting were all amazing. Go watch this movie for her. Katrina, you are a Queen!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "avinashkesharwani-78430",
        "review_rating": "1",
        "review_title": "Predictable Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "alphaq-63642",
        "review_rating": "10",
        "review_title": "Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pandeykaushik",
        "review_rating": "7",
        "review_title": "Good and entertaining",
        "review_detailed_main": "Very nice movie, rohit shetty is family entertainer, always give a good movie, same old story but presentation is good, i like it paisa vasool.akshay acting is excellent, if u want entertainment, then watch it good masala movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sangeetha-02199",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": "This is the worst movie I've ever seen! Same old story nothing new! There is no logic at all.acting is average! Total waste of money and time.not worth watching at all!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "dasromen",
        "review_rating": "10",
        "review_title": "Ignore",
        "review_detailed_main": "Ignore all those negative reviews, most of them are fake coming from people who haven't even watched it. I have watched it and I will say that it was totally worth the time and money."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "dewakkhatri",
        "review_rating": "6",
        "review_title": "Good esque",
        "review_detailed_main": "This movie is a solid 6 for me, I expected way less from this movie before stepping into the theatre, a little bit of nonsensical action sequence is a given. But there were a few too far fetched sequences and loopholes, that eventually kinda messed up the movie experience. Otherwise, was a good movie.\n\nP. S. Props to Rohit Shetty for keeping the flying cars to a minimal!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "parth-95945",
        "review_rating": "1",
        "review_title": "Don't waste time on this cheap one",
        "review_detailed_main": "Same ghisi pitti story.\n\nPathetic. Glorifying one K2 as always 3rd grade. Don't waste your time on bullydawood. Typical shetty movie without head and tail. Humbug action and pathetic screenplay. Overacting ki dukaan Ranveer is cheesy and cheap..I wish I could give a 0."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "anukritianupam",
        "review_rating": "1",
        "review_title": "nothing new",
        "review_detailed_main": "Have seen these kinda movies in pata.. nothing new.. not a fan of action and stunts, as these are performed by stuntsman .. even though none of the actors would agree for that.. big actors cant make a movie hit but a good script cam.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kunalambyah",
        "review_rating": "7",
        "review_title": "Rohit shetty's movie always goes fire",
        "review_detailed_main": "Nice movie i loved it from action to screenplay and punching dialogs are awesom and i sure that everyone loves it. Akshay kumar once again acted nicely and ranvir and ajay devgan entry is mind blowing."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Kaatil29",
        "review_rating": "4",
        "review_title": "Typical masala",
        "review_detailed_main": "Watched sooryavanshi yesterday\n\nMy review: the film had no new element, same remake songs, same indo-pak rivalry & jokes that are not at all funny. In my opinion whole movie is forced just to announce Singham 3. Rohit sir we know your love for ajay sir but this is not the way.\n\nMost disappointing thing is the song 'Tip tip barsa paani' there was never a need for this song in the film. Singham's entry was too hyped but couldn't deliver upto the mark, Although i enjoyed simmba's comedy, it was not needed in the climax scene.\n\nThe only good thing about the film was the temple scene, where the Hindu-muslims harmony can be scene. The bangkok chase scene was just not needed.. they should learn from 'DON 2' how to present a good chase scene. Although i didn't liked the film, my friends loved it.\n\nI can totally understand why they loved the film. Its not a good sensible movie but can be enjoyed with friends & family. A typical mass entertainer for audiences who love to whistle in theatres. Katrina's acting was pathetic, it's been 19 years and she still can't act.\n\nAkshay kumar can't even cry perfectly, he's just made for comedy movies and he should stick to that. Have seen every akshay kumar films and can say for sure he can't cry in screen. First half was very slow & dull, never for once felt excited before interval. 2nd half was decent.\n\nOverall it's a decent one time watch for mass audience and everyone should watch it once to support our theatres & bollywood. Expected more from Rohit sir but it's okay he is also human. Waiting for Singham 3 and hope it will not disappoint us.\n\nMy ranking (4/10)"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "florguerra-47929",
        "review_rating": "10",
        "review_title": "Great movie congratulations",
        "review_detailed_main": "This movie looks very interesting to see with friends. I have to do some research on its history and well, congratulations on making this movie, friends."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "poojamohapatra-81420",
        "review_rating": "6",
        "review_title": "No newness in story",
        "review_detailed_main": "Another action packed movie with no newness in story. Typical Rohit Shetty's flying car,blast sequences, multi starrer cast & big budget movie. The movie is running well only because of cast & mass audience preference. Overall, it's not that pathetic, entertaining one."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "iSatchit",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "Don't waste your valuable time behind this one.\n\nNothing in the movie deserves appreciation , its terrible I still don't understand how does a film like this enter the 100 cr club."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "smsatbhai",
        "review_rating": "6",
        "review_title": "TYPICAL ROHIT SHETTY CAR BASHING SAGA",
        "review_detailed_main": "First of all, perfect Bollywood masala movie to pull crowd for a theatrical release.\n\nPositives - 1. Akshay Kumar has aced the portrayal of a superhumanly police/army/intelligence officer in typical big budget patriotic/cop movies, hence he nails the role of ATS officer Veer Sooryavanshi.\n\n2. Well paced story line and very few unnecessary sub plots.\n\n3. Adrenaline pumping background score specially during chase sequences, goosebumps can be felt.\n\n4. Effective communication of communal unity, patriotism at multiple instances.\n\n5. Worthy acting by supporting cast and antagonists.\n\nNegatives - 1. Poor comic timing and overacting by Ranveer Singh. Why on earth a cop would crack PJ while diffusing RDX explosive about to burst in 1 min. ???\n\n2. Unnecessary sub plot of Sooryavanshi's love life. To be honest, the love story adds nothing to main plot and serves no purpose in pacing the track of movie.\n\n3. Illogical action and chase sequences which defy all laws of nature. Rohit Shetty needs a mature approach to direct action as audience are not living in 2010.\n\nSummary - Decent one time watch provided you don't think too much about logic.\n\nJust chill, relax and enjoy the adrenaline rush !!!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "amitnarad",
        "review_rating": "4",
        "review_title": "Entertainment",
        "review_detailed_main": "VFX is not upto the mark.\n\nMusic and songs is good.\n\nSome of dialogues are fabulous but not sutable too story.\n\nWhy is Katrina kaif in this movie she is average in hole movie but song tip tip barsaa paani she is looking very hot.\n\nOverall only 1 time watch. It's ok ok movie to watch.action, acting, back ground music of Akshay, Ranveer Singh, Ajay Devgan is fantastic."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "akkid97",
        "review_rating": "2",
        "review_title": "Typical fictional cop action movie",
        "review_detailed_main": "While watching movie your reaction will be like this Illogical,kuch bhi, nonsense and bakwas. Grow up bollywood. Dont bore audience with same typical script."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "baifakar",
        "review_rating": "10",
        "review_title": "It became one of my favorite movie 😍😍",
        "review_detailed_main": "Sooryavanshi is one of the best movie I have ever seen. Performance of all actor and actress are Excellent👍. It deserve more than 10 stars. Akshay kumar is one of favorite actor."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sriramthestranger",
        "review_rating": "6",
        "review_title": "Let the cars fly!!!",
        "review_detailed_main": "Its a Rohit Shetty cop universe and one thing I liked is how the 3 cops were bought in the final scene. There are good hilarious moments and its just watch and enjoy. Not for logical fans!!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kforkandarp",
        "review_rating": "2",
        "review_title": "A typical Rohit Sherry Movie, Nothing New",
        "review_detailed_main": "The film was sheltered since a year and and a half , strangely edited, unwanted songs , quick acting of Akshay Kumar as he does back to back films , over acting of Ranveer Singh ,story goes up then goes down, lack of good dialogues, over action ,good lil special appearance of Ajay Devgn , overall definitely not a must watch movie,failed to entertain the odience, Akshay, Katrina , Ranveer, Rohit fans may will like the movie, otherwise overall a disaster ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kp-24309",
        "review_rating": "10",
        "review_title": "This movie is really good.",
        "review_detailed_main": "Akshay Kumar He's doing very well.\n\nHahahahahahahahahahahahahahahahahahahahaha Akshay Kumar He's doing very well.\n\nHahahahahahahahahahahahahahahahahahahahaha Akshay Kumar He's doing very well.\n\nHahahahahahahahahahahahahahahahahahahahaha."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kushalasthana",
        "review_rating": "1",
        "review_title": "Super flop film.",
        "review_detailed_main": "Super flop film. Film lacks script. Its a waste of time movie. Would strongly recommend not to see this movie and waste your hard earned money. No acting, no music, no screenplay. Total waste of time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hyozah0827",
        "review_rating": "10",
        "review_title": "Great novie",
        "review_detailed_main": "The movie was really entertaining, the comedy was fun, some scenes were hilarious i couldn't stop laughing and omg the cast was amazing they perfectly portrayed their roles in the movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "surajkailase",
        "review_rating": "6",
        "review_title": "Decent",
        "review_detailed_main": "A decent one time watch bollywood action masala. Even it's Rohit Shetty movie, still it felt there was some good action missing. Katrina's acting is getting badder day by day."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "amritmali",
        "review_rating": "1",
        "review_title": "Wrost movie most of scenes copy paste",
        "review_detailed_main": "I request to all viewers please don't waste your money go watch this movie in theatre most of scene copy paste and whole movie is wrost and over acting ki dukaan Akshay (over acting ) and Ranveer third class actor Ajay sir is good so ajay sir ke liye Thode din baad dekh lena."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bapi-khulna",
        "review_rating": "3",
        "review_title": "same boarding politically driven hate story",
        "review_detailed_main": "It's 2021 how come people expect this false and resist story still will hit? Minority insulting story and this would hurt many peoples believes.\n\nCan't expect this lousy production from this director.\n\nWeaK story Unrelated cast Overall poor Time wasting."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "lasfarjaafar",
        "review_rating": "10",
        "review_title": "Great film",
        "review_detailed_main": "A really liked this masterpiece film.\n\nAkshay Kumar, Ranveer Singh, Ajay Devgan, Katrina Kaif , thank u for acting together in this film akd i hope there is more films in the future and will be a great addition to the team."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "adorableanchaljune",
        "review_rating": "6",
        "review_title": "No story",
        "review_detailed_main": "Watch if you're a Rohit shetty fan.... I expected smthing different from Akshay and Rohit but movie didn't offered anything new..... Only one time watch...Ajay, Akshay and Ranveer scenes r enjoyable 😉"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "brijnanavati",
        "review_rating": "1",
        "review_title": "Don't waste money!!!",
        "review_detailed_main": "Typical Bollywood masala with no sense🤢🤢 Nothing to say about latest released all Bollywood movies👎👎👎👎\n\nPlz indian Audience now grown up and don't waste money, time on this movies....\n\nIf you really want to watch something than watch Korean drama/series, we learn something which is relevant in our life😊😊"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nirmaljay-48409",
        "review_rating": "10",
        "review_title": "Sooryavanshi is not only easy on the eyes.",
        "review_detailed_main": "Let me make it clear in advance that this is the first film I have watched in cinemas since the pandemic, and my intention was clearly to enjoy a masala action movie. Sooryavanshi is not only easy on the eyes, but is also charming to senses if entertainment is what you're looking for. It's not a very complex story; it's rather easy to follow and enjoy whatever the film has to offer, ranging from the stunning action sequences to music to bits of humor. This is a proper \"mass\" movie designed for fans of escapist cinema and especially the action genre aficionados."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "badaamit",
        "review_rating": "6",
        "review_title": "For true filmy",
        "review_detailed_main": "This is totally Rohit Shetty type of movie action drama acting entry of all 3 actor is own type of music which is good, so this is one time watch movie..... 😍😍😍"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kashif-04259",
        "review_rating": "2",
        "review_title": "Same old story with a different title",
        "review_detailed_main": "So there is nothing new in this Movie, same old script and story telling, everything is pretty much predictable. Just to make it more interesting, Ranvir and Ajay are doing their cameos. Ranvir's over acting and Ajay's Singham style is unbearable. In the last two years of pandemic we have seen much better Movies on Netflix,Amazon Prime and Zee. Just because it has a big star cast doesn't makes it a good movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tabs-62226",
        "review_rating": "10",
        "review_title": "Never Expected Bollywood Can Produce Such A Great Movie",
        "review_detailed_main": "At first I thought this movie will be like some old movies made in Bollywood but No I was wrong. It is actually pretty good. I enjoyed every moment of it. Director has done a great job for this movie. Akshay Kumar , Ranveer Singh , Ajay Devgan, Katrina Kaif all made this movie perfect. Because there were so many popular actors in this film, it was not boring at all. It was my best time spent watching movie after so long. It just refreshed me and my family. Hope Bollywood will produce this kind of movies more in the coming future. And if you are reading it upto here and haven't watched the movie yet, then I highly recommend you to go and watch this film."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vkap-13252",
        "review_rating": "6",
        "review_title": "Cheesy, corny but still a one-time watch for the cast",
        "review_detailed_main": "This has the usual poor jokes that Rohit Shetty loves and the level of dialogs is juvenile (e.g. Dev aaya gun leke for Ajay Devgn's entry). But still this multi-starrer is entertaining.\n\nBefore the intermission, the movie is actually an interesting thriller but then turns progressively cheesier and from thriller to a not-funny comedy. I wish they had stuck the first part's theme & tempo.\n\nAK is the lead and fun to watch. KK is attractive as usual & not required to do much acting (which is good). Ranvir Singh's entry marks the downward spiral of the movie. His Simmba role continues and is not really funny or thrilling. Jackie Shroff is impressive in his role and a relief from Rohit Shetty's corny dialogs and the usual distractions for communal harmony and what not.\n\nWorth watching one time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "abhishektripathi-28675",
        "review_rating": "1",
        "review_title": "Torture to watch",
        "review_detailed_main": "Realy it was a punishment to sit there and bear this non sense.\n\nNo direction, no screen play , senseless action, no story.\n\nBrave hearts r advised to take d risk."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ptandiya776",
        "review_rating": "1",
        "review_title": "Quite entertaining but nothing new",
        "review_detailed_main": "South industry has made way better movie on cops, this one isnt that good. If you love good stories then dont watch. The film is over long too. It feels bored after first half."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "taranpreet-14499",
        "review_rating": "7",
        "review_title": "Sooryavanshi Review",
        "review_detailed_main": "Movie is overall good but story is very simple and average . Acting of all actors is good except Katrina Kaif . Action is also good . Experience in theatre only ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nikinusa",
        "review_rating": "1",
        "review_title": "SERIOUSLY!!!",
        "review_detailed_main": "Back in the 70's and 80's Movies Hit or Flop was decided based on the story line and the acting that was played by the actors in the movie. Back then, actors didn't had Six Packs or muscular, but they had top notch acting skills.\n\nNow days, an actor have to have Sic Packs and Muscular and actress needs to be 0 size....and in the name of Acting, they are all garbage, plus the story line of movies, they seriously have nothing to say. All repeated storylines with different actors, remakes and over and over crap.\n\nI don't see anything new in this movie plus Act wasn't that Super either. Repetitive storyline and Over Hyped Entertainment and nothing else."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "harsh-73-846569",
        "review_rating": "1",
        "review_title": "Disapponting Movie, Poor movie not worth the watch in theaters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hoangducthang-55055",
        "review_rating": "10",
        "review_title": "Movie Sooryavanshi surpasses Indian blockbuster Annaatthe to achieve \"miracle\"",
        "review_detailed_main": "The film's Anti-Composition Squad officer, played by veteran actor Akshay Kumar, is joined by previous films' superbugs (Ajay Devgn and Ranveer Singh) for an epic showdown of wits."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sunnydownunder",
        "review_rating": "7",
        "review_title": "One time watch for sure",
        "review_detailed_main": "Good comic timings, good action and at least some reasonable story behind Rohit Shetty series of films... Entertainer indeed!\n\nKatrina was just a glam doll and had nothing to do in the movie.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "eswarsai-13259",
        "review_rating": "1",
        "review_title": "Total headache",
        "review_detailed_main": "Rod movie with lot of cringe and overaction It's better for Akshay to stop doing these type of movie.one needs to keep their mind in their homes fridge to bear these kind of movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Geeta352",
        "review_rating": "2",
        "review_title": "What a Waste of Time!",
        "review_detailed_main": "I was truly disappointed with this awful film. It was so unrealistic and extremely loud. The storyline was pure nonsense. The acting was absolutely awful. I am a longtime fan of Akshay and Ajay, so it hurt to watch them making fools of themselves. Don't waste your time watching this junk!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ts-85601",
        "review_rating": "7",
        "review_title": "Masala entertainer delivers what it promised",
        "review_detailed_main": "Sooryavanshi delivers exactly what you expect from a Rohit Shetty film. Cars blowing up, over the top action, stylish policemen saving the world. The film could have been better without some boring secular scenes weighing on the runtime. Overall a decent family entertainer."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pritenpatel-07134",
        "review_rating": "4",
        "review_title": "Terrible.",
        "review_detailed_main": "Since none of Akshay kumar's are above 7-8 stars. Even Rowdy Rathore is 5-6 I guess, I decided to watch this movie.\n\nThis Movie Could have been better if it was shortened to 1.5 hours to 2 hours, But this is like 2.5 hours of boredom. Really Bad, Starting is good, but then boredom starts to kick in.\n\nIt has concepts of \"Holiday\", and \"Baby\" movie, just dressed them into police to make it a cop movie.\n\nEven the Terrorist were Shown as Foolish.. :D I have never seen a Movie which shows Terrorists as Foolish as they have shown in here. Which is extremely Stupid.\n\nAnd I have seen many movies which Does not obey any logic, this one is one of them, But the Only question is why it needs to be 2.5 hours one.\n\nWaste of time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hoangthangla",
        "review_rating": "10",
        "review_title": "Movie Sooryavanshi surpasses Indian blockbuster Annaatthe to achieve \"miracle\"",
        "review_detailed_main": "Katrina Kaif with her beauty and acting ability, she took the character to the next level. And it contributed to the huge success of the film.\n\nThe film's Anti-Composition Squad officer, played by veteran actor Akshay Kumar, is joined by previous films' superbugs (Ajay Devgn and Ranveer Singh) for an epic showdown of wits."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "biswassushobhan-67695",
        "review_rating": "7",
        "review_title": "Terrorism one of the biggest threat to mankind today",
        "review_detailed_main": "First of all I will say there must be more movies which spread awareness among people about how dangerous terrorism is for human beings. How police and great Indian Armed Forces fight against terrorism by giving their supreme sacrifice. Unfortunately there some people and country in the world which still support and fund terrorism. We need to expose those people as well! Excellent acting by Akshay, Ajay and many others. Overall excellent film."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "priyaarg",
        "review_rating": "1",
        "review_title": "Why is Bollywood so obsessed with same masala",
        "review_detailed_main": "Rohit Shetty Really Needs to understand we are done with the same kind of story writing and direction, We want something new, This movie serves you Nothing New to be precise. And moreover same old actors and their typical acting style makes it even more boring n unworthy.\n\nPLEASE DONT EVEN WASTE A SINGLE PENNY OF YOURS ON THIS."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "duykhoautccodt",
        "review_rating": "10",
        "review_title": "an interesting movie",
        "review_detailed_main": "Perhaps this is the most meaningful movie I've ever seen, the director chose a very reasonable setting, the acting of the characters is also very impressive, making viewers unable to leave the screen, a great movie, everyone should see."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "haklaster",
        "review_rating": "7",
        "review_title": "A tribute to 90s Akshay Kumar action films with a grander scale",
        "review_detailed_main": "SOORYAVANSHI is an out an out commercial masala action film. Movie for the big screens.\n\nMovie with a repeat value.\n\nPositives:\n\nACTION. Best action among all cop universe movies. It is because this time it is not over the top. Akshay Kumar performing those round house kicks, parkour, Helicopter stunt, Bike chase, gun shots and hand to hand combats was an absolute treat to watch and his fitness is impeccable. The action scenes of Akshay Kumar will remind you of the 90s action he used to do.\n\n\n\n\n\n\n\n\n\n\nNegatives:\n\n\n\n\n\n\n\n\nKatrina Kaif had nothing much to play but she adds to the glamour part well specially in Tip Tip Barsa Paani. Her chemistry with Akshay looks good.\n\nJaved Jaffery was good in his role.\n\nDirection by Rohit Shetty is good. It's an improvement and his best film post Singham (2011).\n\nSongs were decent except the romantic number.\n\nSome dialogues were really good and impactful.\n\nOverall from a movie point of view 6.5/10 Entertainment value - 8/10\n\nA superb commercial entertainer after a long time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sumit7480",
        "review_rating": "1",
        "review_title": "Let him remind Akshay is faltu actor",
        "review_detailed_main": "He is faltu actor,does same type of acting everytime, which was boring now unbearable,he hates hindu gods and want money from Hindus, save your money his movie not worth a single penny."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shersamal",
        "review_rating": "1",
        "review_title": "Wasted my rs350 at inox for this movie",
        "review_detailed_main": "Actors really acted well but the direction of the Rohit Shetty is really very pathetic. Really disgusting movie and mainly the storyline which is very simple. Its not even one time watchable."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "brindhatup",
        "review_rating": "10",
        "review_title": "Good Movie",
        "review_detailed_main": "It's absolutely enjoyable.\n\nRohit Shetty has created his own brand of colourful, action, excitement, megastars, and Akshay Kumar has played his usual role. Katrina looks stunning and performed admirably. The storey is not novel, but the execution is excellent, and it is action-packed with good background soundtracks, vivid scenes, humour, and a super climax. Don't anticipate or judge, simply enjoy yourself at this festival."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Rishith_Shetty",
        "review_rating": "7",
        "review_title": "Not bad",
        "review_detailed_main": "Quite good movie. I have seen a movie after 18 months so I am quite impressed but I must say that Singham was way better than this, Story is a 7/10 and action is a 9/10 but the character is a 5/10. This brings my overall rating to a 7/10. If you are not someone who streams web series then this is a good movie for u but for everyone else, there are way better web series and movies out there."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "mohitsuryavanshi",
        "review_rating": "1",
        "review_title": "aweful",
        "review_detailed_main": "Waste ...Bollywood needs a rude awakening ..need some quality and substance in their movies. Overhyped and unneccesarily loud . Lot more to learn from some simple yet meanigful malyalam movies . ........................................................................................................................................................................................................................................."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rokibulr-31983",
        "review_rating": "10",
        "review_title": "That's awesome",
        "review_detailed_main": "First of all the script of this movie was nice. Particularly Katrina Kaif was outstanding. When the movie was released I was existing to watch this movie. Finally yesterday I watched this movie and got much entertainment."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "swethavoleti",
        "review_rating": "7",
        "review_title": "A film for the masses",
        "review_detailed_main": "There's nothing new about this movie that's for sure, and it's all very Bollywood. But that is what makes it watchable after almost 2 years of coronavirus drama. It's nostalgic and filled with energy so dare I say, it's a must watch for anyone who wants some mindless entertainment."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sharmakuldip",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "This is one of the worst movie of Akshay Kumar. Vfx is bad, songs are bad, Akshay's acting is bad and also weak story line. Same wohi ghisa peeta masala movie by Rohit Shetty."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "artisinghnyc-50544",
        "review_rating": "1",
        "review_title": "Enough of Akshay and boring action",
        "review_detailed_main": "Sick of seeing 10+ Akshay movies every year! He's so boring and monotonous. Rohit Shetty is just a single act pony. He's got zero variety. Oh lord, and Katrina... I think wood has more emotion.\n\nSpend on Immortals if you want star studded action. This one is a complete waste of money."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "prashantbhagat-93041",
        "review_rating": "1",
        "review_title": "Bakwas bollywood masala film",
        "review_detailed_main": "Extortion racket, blackmailing, murderers(Hiren murder case). Also they have links with underworld(P Sharma and Nayak). They have turned a blind eye to drugs business in Maharashtra. Ex-commissioner is running away from investigation.\n\nMumbai police in movie:\n\nShown as Heroes were they are seen cracking terrorist and drugs links. Riding fancy sports bikes and hanging from helicopters. Blowing up stuff through rocket launchers.\n\nI have stated facts here. If you still wanna be blinded by all this then the choice is yours.\n\nPS: Not all officers are corrupt but things shown in this is far from reality."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "duykhoautccodt",
        "review_rating": "10",
        "review_title": "An amazing movie",
        "review_detailed_main": "This is a very good and impressive movie. It is very interesting and does not take too much time. Have fun listening to the book. Watching once can make you remember forever."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "thegamegkht",
        "review_rating": "6",
        "review_title": "Police is coming?",
        "review_detailed_main": "Army is needed to handle bombs And terrorists not just the police and other cops... This seems more like a surgical strike of some kind on ATS.\n\nAnd then everyone goes War mode on.\n\nIT IS WAR."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "gjujare",
        "review_rating": "1",
        "review_title": "Complete Hogwash Far from Reality",
        "review_detailed_main": "This movie has the same old rhetoric not worth it same story line involving gangsters along with murderers extortion from gang & criminals glorifying mumbai police which is far from what reality is it's time we realize and take decision to boycott such movies with out any substance !!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "totantai",
        "review_rating": "10",
        "review_title": "Well worth watching and looking forward to.",
        "review_detailed_main": "Well worth watching and looking forward to.\n\nSooryavanshi follows DCP Veer Sooryavanshi, the Chief of India's Anti-Terrorism Squad, as he attempts to protect Mumbai from one of the worst terror attacks in history. The Sooryavanshi character was announced towards the end of Simmba that served as an introduction of the film. Singham and Simmba in extended cameo appearances reprise their roles from the franchise's previous films."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tv-24487",
        "review_rating": "7",
        "review_title": "Need more closer to reality",
        "review_detailed_main": "Action scenes are shot with better reality but still carry the old 'Indian celebrity theme' with BGM and unnecessary comedy in serious situations. Women character roles are much lesser making movie men oriented, and gender bias in Indian movies can be readily seen. Action scenes still has some 'anti-science' actions."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ahmxii",
        "review_rating": "1",
        "review_title": "Only Masala!!",
        "review_detailed_main": "Now Bollywood has only that old India Pak rivalry stories and got no more another story to portray in a movie.\n\nI don't know how an Indian audience watches that old RR in every movie and enjoys it like that its first time. Bollywood should move on from old crap and do something different."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "fatjonkaloci",
        "review_rating": "10",
        "review_title": "They brought this original story very nicely.",
        "review_detailed_main": "Very nice. They brought this original story very nicely. In fact, I was expecting this movie in March, but because of Covid I had to wait November. Reception, it's worth it. Very good production of Reliance Entertainment. Play of Actors, Aksay Kumar, Katrina Kaif, Ajay Devgn, Ranveer Singh very professional. I was very pleased."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vinayakjoshi-58788",
        "review_rating": "6",
        "review_title": "Nothing Groundbreaking",
        "review_detailed_main": "Action scenes are like literally done to death. Nothing new Which we haven't seen. Need innovative ideas now. Running in Terrance or bike chase to a helicopter..all been seen. Take inspiration from MI or James Bond on making action scenes more stellar."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vikaskumrai",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "Too Much unnecessary action, poor direction and repetitive scripts make the story line predictive. Short advice..... Better spend your valuable time and money somewhere else but in watching the movie with heavy expensive ticket."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "skazharuddin-26032",
        "review_rating": "2",
        "review_title": "Honestly This Is below avarage movie",
        "review_detailed_main": "Expections bohot tha, but nikla Ghanta, 1st half pura boring tha, Akshay Kumar ka ohh screen present tha hi nehi, jaise Jaab Singham ka entry hota hai, kya entry h Ajay Devgan ka Akshay pura udd jaata hai, ishe kehte hai screen present, Ranveer Singh ja Comedy bohot achcha tha, but overall yeh movie below avarage hai."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "farhathomar",
        "review_rating": "10",
        "review_title": "Must watch flim",
        "review_detailed_main": "I watched this movie in theatre and absolute familiy movie, Great action , perfect script and direction by rohit shetty and great acting by akshay Kumar, katrina kaif and cameo by ajay devgan and ranveer totally nailed it.....Must watch flim in theatre."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pvsavla",
        "review_rating": "6",
        "review_title": "Bollywood movie with a subtle message",
        "review_detailed_main": "Sooryavanshi has been made into a typical Bollywood/Hollywood movie based on part history, with a subtle message sprinkled with some entertainment, comedy and lot of Hollywood style car races and action. It starts on a serious note but loses grip on seeing romance happen so easily & quickly, although story in the background keeps the audience tied up as terrorism is such a serious phenomenon in India. The movie is recommendable, but action in the end was prolonged a lot, which robbed us of some charm and time. The main reason for recommendation is the relevance of the topic and its subtle noble message for which we need to thank its producers."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sanjibanipanigrahi",
        "review_rating": "1",
        "review_title": "This movie is so bad I had to write a review.",
        "review_detailed_main": "The audience has matured over the years. Sadly, Rohit Shetty and his actors are behind times and offer a bad movie that will make you cringe. The acting is over the top. The story makes no sense."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "amosunibikunle",
        "review_rating": "10",
        "review_title": "Akshay Kumar , Ranveer Singh , Ajay Devgan, Katrina Kaif you guys have done a good job i will love to see more from you keep up the good job i cannot wait to see the next movi",
        "review_detailed_main": "Akshay Kumar , Ranveer Singh , Ajay Devgan, Katrina Kaif you guys have done a good job i will love to see more from you keep up the good job i cannot wait to see the next movie you guys will produce i am a grate fan thank you for this wonderful movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "akgunesh",
        "review_rating": "6",
        "review_title": "An average masala film",
        "review_detailed_main": "I liked the film because of the massage about Hindu-muslim subject and also because of rohit shetty. Film is not unique but not a bad film, you can enjoy it."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "samsameerkhan",
        "review_rating": "1",
        "review_title": "One of the worst movie of 2021",
        "review_detailed_main": "Whi same wahiyat and boring storyline....save ur money...disaster written all over it.,,no story,pathetic acting ,ghisi piti songs as maxm are remakes...so it is better to avoid watching this movie and saving your money.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nisansalasanda",
        "review_rating": "10",
        "review_title": "Entertaining action and thriller movie.",
        "review_detailed_main": "Wasn't confident about this film but after watching it can be considered as a very entertaining and interesting film with good action scenes. The BGM, stunts, action scenes kept me going till the end of the film."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shyamkarnake",
        "review_rating": "7",
        "review_title": "Paisa wasool",
        "review_detailed_main": "Thats a diwali blast from Rohit Shetty....only Indian Director can bring This type of Craze in movie.... Gr8 Action Comedy from Akki sir too.... ...,......,........,..........,..\n\n."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "harpreetmailbox",
        "review_rating": "1",
        "review_title": "Pathetic and Worst",
        "review_detailed_main": "I wish if I can give 0 star. Worst masala movie. Akshay kumar n AD both trying make people fool on the basis of senseless emotions and fake deshbhkathi type content..It looks so fake and action sequences are seems like comedy movie.. Now a days its trends, in which make fake deshbhkati movies, Put lots of hindu muslim angles and make money....\n\nOh God, Katrina Kaif.. What she was doing in this movie.. Even her song tip tip barsa pani was very very irrelevant and irritating...Untimely songs and comedy...\n\nBig time disappointment 😞"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sufiyankham-63607",
        "review_rating": "1",
        "review_title": "Pure cringe.",
        "review_detailed_main": "When will we move on from illogical over the top cheesy movies like this. Scenes are stupid. Acting below par. Dialogue are disconnected. Character have no depth. We deserve better."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "harishsahu-57188",
        "review_rating": "10",
        "review_title": "great",
        "review_detailed_main": "Fun watching, especially on big screen. , all performances are very good. Action sequences are fantastic. Why the bad ratings? Just go and enjoy this one."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kshizj",
        "review_rating": "6",
        "review_title": "Great first half, mediocre conclusion",
        "review_detailed_main": "I was mildly suprised by the first half of the movie. There was proper chracter development, good story build up even if with some mediocre acting. The action scenes are great too (only in the first half).\n\nI walked into the theater with very low expectations and by the intermission, I had pretty high expectations. Alas, that's probably my mistake. The 2nd half is a big let down.\n\nFor the sake of it, they had to add an item song. The action scenes are over exaggerated and the story goes down the drain too. Most of the 2nd half is used to sensationalize the protagonists.\n\nThe one thing the movie does absolutely right is in choosing the actors for negative roles. There are more than one negative characters in the movie and all of them are brilliant."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ertahir",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Terrible movie impossible action scenes and same old plot one man against the whole dam of villains even the songs are remakes this whole bollywood is remake. When will bollywood learn from south movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "miansafwataligul",
        "review_rating": "10",
        "review_title": "A Fantastic dramatic entertainment movie by none other than Rohit Shetty.",
        "review_detailed_main": "I really love the idea of how Shetty has related a past with the contemporary issue. How he progressed the movie the flow of it all was marvelous. How the past attack had some left over traces and how they were tracked.\n\nI would like to specially point out the VFX part of this movie which I think has improved significantly when compared to older movies of SHetty. All the actors have given it their whole heart, especially katrina kaif, how she was able to assist a police officer in his work how she expressed her frustrations at moments, her love etc. Everything bang on. Love the movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "emeraldhettiarachchi",
        "review_rating": "6",
        "review_title": "A good story with a bad execution",
        "review_detailed_main": "The story was good, cinematography was good, art direction was good. But the acting of Akshay Kumar and Katrina Kaif was bad. Action sequences are unrealistic and most importantly there were unwanted songs. And the music of this movie was bad. And the main soundtrack 'Sooryavanshi' was felt like it was made for a comedy movie.\n\nWith this kind of story and cast, a good director could make a good movie. But it's Rohit Shetty, what else to expect other than a movie with bunch of unrealistic action sequences and bad execution."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pathannaseema",
        "review_rating": "1",
        "review_title": "Only one word review thrid class movie",
        "review_detailed_main": "Guys don't waste your pricious money and time Bollywood is dead and finish same ghesa pita story nothing new only katrina looking good in the movie thats it so boring akshay Kumar stop doing such nonsence movie zero stars."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "imteshalkarim",
        "review_rating": "7",
        "review_title": "Great for a Diwali action flick",
        "review_detailed_main": "Bang for buck entertainment!\n\nStory and direction were great and as always, Rohit Shetty's stunts featured big here and very well upgraded in terms of scale of the said stunts.\n\nThe plot was tight and narrative, though with a few potholes. Story was very well thought of and executed well enough in script. One need not dig too deep into the story to find flaws, the purpose of this movie was seat-edged action and it delivers it fabulously.\n\nYet, one only part that bothered me was a very misplaced romantic song played right on cue during a time when the plot was thick with seriousness.\n\nOverall, it was a great joy to watch.\n\nDiwali celebratory fireworks was this movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rishijaiswalsmart",
        "review_rating": "1",
        "review_title": "horrible 90s copied plot a typical Bollywood masala movie",
        "review_detailed_main": "Typical bollywood masala movie without logic and no new story line don't waste money in theatre watch any good content on Netflix instead of that..rest it's up to you."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "seemabhangu",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Only watch if you have time to waste. Boycottbollywood so they stop producing trash. Only watch if you have time to waste. Boycottbollywood so they stop producing trash."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "oliverjeff",
        "review_rating": "10",
        "review_title": "combination of three big cinema heroes are awesome",
        "review_detailed_main": "I haven't seen the three big bollywood big star in one movie ...i was very exicted before launching of movie but after i saw this movie i'm really happy a."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ifanbhuiyan",
        "review_rating": "6",
        "review_title": "Old plot+Masala movie = Time Pass",
        "review_detailed_main": "You can predict every scene and story, horrible acting by Katrina but giving this a 6 because of Rohit shetty's unique idea of merging all the cop movies. Hope to see Chulbul Pandey in the new Singham sequel."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "agarwalkrishnam",
        "review_rating": "1",
        "review_title": "What a PATHETIC boring movie..",
        "review_detailed_main": "This is just a same plain boring repeated OLD Cop thief Cat mouse story.. where not even the actions scenes are interesting this time..\n\nStory is too much predictable which does not generates any curiosity.\n\nHaving too many stars also spoils the interest.\n\nSongs are mediocre. Story is below average and acting is so much over the top that you get drastically BORED.\n\nI am going with generous 1 out of 5 stars.\n\nDo some shopping, spend time with family instead of posing yourself to this torture."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nirfan-18820",
        "review_rating": "10",
        "review_title": "Must Watch!!!",
        "review_detailed_main": "Akshay, Ajay, Katrina And Rohit Altogether created dhoom. The movie started and the interval and then the movie again started then the climax, all this too 2 and a half hours or may be more than that but it felt like everything happend in a wink or blink. 18 months long wait for Cinema justified."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ravipsingh",
        "review_rating": "7",
        "review_title": "Best action movie",
        "review_detailed_main": "Best movie of Rohit Shetty after the Golmaal 1 and Singham 1. There are some flaws but after all it's action Masala movie. If you are looking for a entertainment this is best movie for you."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "damodarchari",
        "review_rating": "1",
        "review_title": "save your money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shivkarunakar",
        "review_rating": "10",
        "review_title": "Reivew",
        "review_detailed_main": "Best movie ever i have watch. Story action sab mast hai or ranveer entry is awasome yaar. Kat and aksay jodi mast hai jabardast rohit setty is best director."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sameerkhan666",
        "review_rating": "7",
        "review_title": "Typical affray",
        "review_detailed_main": "This is a definite typical affray of the Bollywood industry. One star deleted to bring a bad image of the neighboring country. This is high time we bring peace in our world. In the name of entertainment and nationalism, we cannot sell war and hatred. To a point I really felt the dialogues matched that of Gadar movie, one such example is when Sooryavanshi talks to the opponent about how he forgot his past, that dialogue was ditto copy of Gadar and the previous scene before that too somehow typically felt like that of Gadar. Katrina did a good job. Mere Yaaraa Song by Arijit Singh and Neeti Mohan was very mesmerizing. The wildcard entry of Singham and my favorite Simba was also worth watching. This is a definite typical affray of the Bollywood industry. One star deleted to bring a bad image of the neighboring country. This is high time we bring peace in our world. In the name of entertainment and nationalism, we cannot sell war and hatred. To a point I really felt the dialogues matched that of Gadar movie, one such example is when Sooryavanshi talks to the opponent about how he forgot his past, that dialogue was ditto copy of Gadar and the previous scene before that too somehow typically felt like that of Gadar. Katrina did a good job. Mere Yaaraa Song by Arijit Singh and Neeti Mohan was very mesmerizing. The wildcard entry of Singham and my favorite Simba was also worth watching. And did somebody say: Riya who loved rain. Well people who are big fan and mindful watchers of Bollywood movies would definitely know where this character is coming from. Half Girlfriend, in this movie/book Riya character loved rain. Among series of stars, two given to Nikitin Dheer's personable rendition."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "javed1703",
        "review_rating": "1",
        "review_title": "Just Boring",
        "review_detailed_main": "Same typical bollywood heroic story , nothing new just same mashala plot. Repeated rohit shetty movies actions with car nd all, poor direction and acting."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rohitraj-92406",
        "review_rating": "1",
        "review_title": "Dumb movie of the year",
        "review_detailed_main": "Never think about going for this movie. Look for reviews before you decide to watch this stupid movie. Rohit shetty is anyways one dumb director, on top of it storyline itself is zero. All star casts has been used to lift this movie, they have miserably failed. Make sure this movie should go to dustbin to stop making this type of non senses. Thank you."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "harshh-75292",
        "review_rating": "8",
        "review_title": "Diwali Gift from Akshay Kumar and Rohit Shetty.",
        "review_detailed_main": "My Rating is 8/10 \"1\"Star cut for Katrina's Acting and third class Hindi \"1\"Star cut for Trailer.they show 90% of story in Trailer Even masss scenes\n\nONLY WATCH IN CINEMA,Oly for masss Audience."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "madanmarwah",
        "review_rating": "7",
        "review_title": "Thrills and action in this cop universe",
        "review_detailed_main": "The self styled avengers of India are here to kick terrorist ass and they make a thorough job of it as cops Simba, Singham and Suryavanshi get together in the climax. We are informed that this is a \"cop universe\" and hopefully more movies will follow. This is a typical Rohit Shetty movie providing never ending full on masala entertainment. So get your popcorn and settle down to see some jaw dropping action, cars crash landing or getting blown up and general mayhem. Not a scratch on our heroes, the hair and goggles in place even as they bash up the baddies and as they jump up and somersault they keep shooting them down with alarming accuracy. Yes there is a story but who needs it anyway. Its all been done before. We are given an elaborate introduction by way of visuals of the 1993 serial blasts and 26/11 attacks before being informed that some strikes are planned by terrorists which must be quashed. So Suryavanshi to the rescue. He is not only daring and brave but also smart and diplomatic as he lectures a hostile crowd on the difference between good and bad muslims thus convincing a Maulana to permit him to arrest the criminal. Since the terrorists are in good number, Suryavanshi takes help of Simba and Singham to eliminate all of them and both willingly oblige. Akshay Kumar will thrill the audiences as usual. The movie provides \" no questions asked\" entertainment for the masses. The bonus is a sizzling dance number by Katrina Kaif."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pragyasriva",
        "review_rating": "2",
        "review_title": "The movie is made for rikshawala audience",
        "review_detailed_main": "The alter ego of saman's movies primarily focussed on sadakchaap audiences, heavy dialogues, katrina pathetic acting, zabardasti ka patriotism, ott performances.....better watch netflix series squid gamed in the safe premises of ur home."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sahilpatelpcb",
        "review_rating": "10",
        "review_title": "Top Cop universe",
        "review_detailed_main": "Rohit shetty yet again delivers a massive hit, the movie has some amazing sequences plus the action it leaves you glued to the screen especially the second half is full of entertainment and enthusiasm."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "thunderxhacker",
        "review_rating": "6",
        "review_title": "Sooryavanshi is a 2021 Indian Hindi-language action film directed by Rohit Shetty and produced by Reliance Entertainment, Rohit Shetty Picturez, Dharma Productions and Cape Of",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "indrajitbagal-83079",
        "review_rating": "4",
        "review_title": "Why this film has been made?",
        "review_detailed_main": "Poor screenplay, overdose of moral speeches, unrealistic action and fighting sequences, overacting of Ranveer Singh, poor acting of Katrina, overdose of background music 'Sooryavanshi....' in almost every scene of Akshay, unnecessary and forcefully inserted unnatural comedy sequences between terrorist investigations, degradation of one of the best songs of 90's 'tip tip barsa pani' by poor choreography and poorly remix music."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "magadalwarmayur",
        "review_rating": "8",
        "review_title": "And the universe expands",
        "review_detailed_main": ": I was very sceptical about this film. But Rohit Shetty and his team handled this film very gracefully.\n\nIt was entertaining it had some jaw dropping action scenes and it is as witty as his previous film.\n\nThis is the most realistic film Rohit Shetty has directed but all the realism goes to dustbin once Ranvir Singh (simba) arrives after that it is just another Rohit Shetty film.\n\nAkshay Kumar has done good job but the scene stealer is gulshan grover and ajay devgan even with their limited screen time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jambhai-01647",
        "review_rating": "7",
        "review_title": "Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vijaysharmadec",
        "review_rating": "1",
        "review_title": "Wastage of money, the same formula movie of Rohit shetty",
        "review_detailed_main": "Wastage of money. The same formula movie of Rohit shetty, better to watch any other show in any OTT platform, didn't went with any expectations,yet utterly disappointed..."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "prakashessu",
        "review_rating": "2",
        "review_title": "IN Making a cop universe they forgot Entertainment",
        "review_detailed_main": "A Honest Review - Rohit directed it well, some new stuff but it's a mass movie it should atleast be full of Entertainment factors its more about telling you there is more to come atleast make this movie right give a proper story but its a fire cracker without a Boom . A fan or not fan be honest it's not the mark as we expected at the end of simmba."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kartikmishra-94723",
        "review_rating": "10",
        "review_title": "The best movie of akki I have ever seen",
        "review_detailed_main": "My rating is 9 but giving 10 bcoz of these idiot ssr bot fans so that good average is maintained plz do not listen to these bots if you are a lover of action masala movie then you will love it for sure and in last Ajay is just killing with his action Katrina was not used by the makers much but overall she did a good job and akki is just lit🔥 best movie of this cop series of rohit shetty."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ssscvrce",
        "review_rating": "6",
        "review_title": "Disconnected plot! Watch it if you nothing else to do!",
        "review_detailed_main": "Switching from one scene too another without connecting dots, the very problem faced by many indian directors, same old religion sympathy, too many car shots, nothing for katrina kaif and just being begged, Rohit if you make movies like All the best and add comic scenes, that is ok, but taking a national topic and making it funny is cringe! Watch if for passing time and not by taking out time from a busy schedule."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hrishikeshcharkel",
        "review_rating": "1",
        "review_title": "Simply skipping the movie",
        "review_detailed_main": "Boycotting this movie due to karan johar involvement that's it.\n\nI love Malayalam movies which deserves much more than these kind of mindless movie.\n\nWaste of talent Promote there hidden agenda.\n\nCinema is toolbar for some Actor's."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "adityarai-70056",
        "review_rating": "10",
        "review_title": "Awessssommmmeee",
        "review_detailed_main": "One of the best movies of Akshay Kumar. The kind of action you get to see and the entries of all three cops is bang on. It was a good decision that they didn't premier the movie on ott."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "agarwaljayant-88135",
        "review_rating": "6",
        "review_title": "an average movie",
        "review_detailed_main": "Sooryavanshi review :\n\nFinally something for the theatre owners to cheer about. Also for us, the audience!!\n\nThe first major Bollywood theatrical release since March 2020 (Baaghi 3 was the major release just before Corona struck us); Sooryavanshi can be called an ideal festive dhamaka to pull back the audience to cinema halls which have sadly, been shut or running empty since then...\n\nRohit Shetty's cop universe extends to Veer Sooryavanshi (Akshay Kumar), an ATS officer, who along with Singham (Devgn) and Simmba (Ranveer) take on the terror group (Jackie Shroff and company) planning to blow up Mumbai once again. À la March 1993.\n\nSooryavanshi starts off with the right intent, pace, narrative and sentiment. The backdrop is the 1993 serial blasts in Mumbai, and the masterminds giving the cops a slip, but leaving a live imprint behind - if 400 kg RDX were used for the blasts, where are the remaining 600 kg? Fast forward to 2007, 40 Lashkar operatives from Pakistan sneak into India and commerce sleeper cells all around the country, awaiting instructions from the chief Omar Hafeez (Jackie Shroff) to start another siege. Advance to the current day, Bilal (Kumud Mishra) the key mastermind of the 1993 blast returns to India via Maldives, releasing the cache of the 600 kg RDX from an inconspicuous house in Sawantwadi, and activates the sleeper cells, under the leadership of Riyaz Hafeez, Omar's son, swearing to burn the nation down. Riyaz has another axe to grind with the Mumbai Police, to avenge the death of his elder brother Sooryvanshi is good but it is not upto the mark the way we audiences were expecting it .But it was good to be back in theatres after Covid-19."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bi_ju",
        "review_rating": "1",
        "review_title": "Pathetic stuff",
        "review_detailed_main": "Bollywood is short of ideas, that's the reason they have borrowed the story line from some old outdated action movies of 90's. The movie has nothing new to offer other than song and dance coupled with terrorism angle and action thereforth."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "stbhardwaj-53460",
        "review_rating": "10",
        "review_title": "Biggest entertainer of the year",
        "review_detailed_main": "Hats off to the our best director Rohit Shetty Sir, what a punching dialogue Mind blowing can't explain.\n\nFully paisa vasool And acting of Akshay Kumar sir osm Specially that dialogue-- \" Garbhwati\"\n\nFully enjoyable surrounding ..."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pajjun",
        "review_rating": "7",
        "review_title": "Fairly Entertaining.",
        "review_detailed_main": "If you are looking for an Entertaining Classic Bollywood Masala movie as your first movie after lockdown in theaters. I suggest go for it.\n\nDon't look for logic and exceptional acting performances because there are none but overall Movie is good. Just Enjoy your experience.\n\nAnd Ignore Katrina as she Ignored Acting in the movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "niazijeelani",
        "review_rating": "1",
        "review_title": "Only watch if u r looking for brainless movie",
        "review_detailed_main": "Just watched sooryavanshi in the morning show . I was eagerly waiting for this movie over a year and finally yes today it got released. Movie starts well with good visuals . The director introduced all the characters in starting of 15 minutes and builded a base for the second half. The first half started well but going on it could make you feel bore in some scenes and the first half will be end with a mass interval . The second half is so gripping that you won't know how the film has been completed. Akshay kumar and Katrin kaif scenes are well developed and asusuall Ranveer singh and Ajay Devagn completely pulled their characters .\n\nThe drawback of the film is songs. I think there is no need of having songs in this film . Except Aila re Aila . This song is a eye feast for all Akshay kumar fans . The highlight of the film is Background score which totally makes you get goosebumps in action sequence.\n\nThe story is quite old but the execution and development is good . Overall you can watch a perfect movie with your family for this festive season."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jkaur-38399",
        "review_rating": "1",
        "review_title": "Rubbish worst film",
        "review_detailed_main": "Don't waste your time and hard earned money making useless so called entertainers/actors rich. Jaago janta they Bollywood is making fools of you if you continue to watch their rubbish films."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "madmax46",
        "review_rating": "9",
        "review_title": "The film has all the elements, attitude, style, showmanship and heavy-duty star power!",
        "review_detailed_main": "Veer Sooryavanshi, Akshay Kumar has successfully taken over the mantle from his predecessors (Singham and Simmba), and with a generous dose of flying and somersaulting cars, this one is quite a bumper Diwali entertainer for you. And if you are a fan of high voltage action movies, go lap this up!\n\nThe film revolves around the concept of revenge, 'An eye for an eye, makes the world blind.' While the story itself plays it safe (basic and predictable), the action is risky and rousing (Rohit Shetty and Suniel Rodrigues). The sequence where Akshay is chasing John (Sikander Kher) is a visual delight.\n\nAkshay Kumar delivers a knockout performance. From his seeti-worthy entry to the relentless gunshots -- he justifies her super cop act. Apart from the high adrenalin physical encounters there are umpteen high drama chases, with cars, bikes and helicopters as Akshay Kumar displays his unquestionable action skills. Overall, it's an Akshay show all the way with his star power and screen presence looming large."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "saadamanindia",
        "review_rating": "6",
        "review_title": "The weakest yet in the franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ankitsinghankit-30554",
        "review_rating": "1",
        "review_title": "Boycott Bullyweed #SSR #Meme_Police",
        "review_detailed_main": "Stop glorifying #Meme_Police. It's a bunch of idiot whose aim is to juice your money in the name of Loda star collaboration.\n\nDon't waste your money and time for this cringe content."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rajneshranjan",
        "review_rating": "9",
        "review_title": "Best movie of 2021",
        "review_detailed_main": "A movie that shook to the core. Please watch this movie guys. I recommend Rashmi Rocket as it has every emotion that we as an audience need in a film. Rohit, you are a gem! Best movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vinayningoo-03478",
        "review_rating": "7",
        "review_title": "But i must say a complete family entertainer.",
        "review_detailed_main": "A Good entertainer from the house of ROHIT SHETTY PICTUREZ. The cop universe of Rohit Shetty is finally coming under notification andgaining popularity.\n\nEntertainment wise the movie is good, some flaws here and there can always be ignored becuase the more one notices the flaws the more the loss of entertainment. The tip tip barsa pani recreationis good and is a rage and has gone viral over social media already.\n\nAction sequences have been shot well by JOMON T JOHN the cinematographer and as usual the action sequences are well co-ordinated by SUNIL RODRIGUES and not to miss DESIGNED by our very own ROHIT SHETTY.\n\nBut a must watch for a complete family entertainment and great fun after a good while and specially with the current on going scenario and depression where SOORYAVANSHI is great dose of laughter and good action."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "abhyuday-tandon",
        "review_rating": "1",
        "review_title": "Insanely predictable and disappointing 3 hours of constant virtue signalling.",
        "review_detailed_main": "The movie has a very weak plot and relies entirely on cast strength to carry the movie. They do an appallingly poor job of managing emotions. This movie felt like it was written by a child with zero writing skills. At one point they'll be on an extremely impactful and distressing scene making you feel sad/enraged and in just the next scene the characters start throwing cheap jokes and gags as if they didn't just witness gory murder right in front of them seconds ago. The movie has no sense on how to transition from a sad scene to one with lighthearted comedy and often mixes the two which clearly shows how insensitive the writers are. Around 30-45 minutes of screen time is wasted on unnecessary sermons on religious peace and virtue signalling on how people of different religions should interact. The songs in the movie are absolutely unwarranted for, they appear out of nowhere and with zero conjunction to the plot. The soundtrack is extremely loud and out of sync with the scenes. The writers also do a terrible job with antagonist's backstory, the way they portray the wretched psychopaths makes you feel like the writers want you to sympathise with them. Don't even get me started on the endless plot-holes. Having liked the movie Singham a bit, I felt I could go and watch this movie for the pompous and exaggerated fight scenes, however I couldn't be more disappointed. This movie doesn't have a single decent action sequence, all scenes are gunfights with the main characters having 100x plot armour. Overall this is probably the worst movie I've ever watched and wouldn't recommend it to anyone with a functioning brain."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "premsinghps-18289",
        "review_rating": "10",
        "review_title": "A Must Watch..",
        "review_detailed_main": "This Rohit Shetty Cop universe which included Akshay Kumar is the best in all.. the best entertaining gift on Diwali... A must Watch.. Loved it... although a typical Rohit shetty film, in which Akshay kumar is the best value addition.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bhatiasexy",
        "review_rating": "6",
        "review_title": "Honest review",
        "review_detailed_main": "An absolute mass entertainer and a complete paisa vasool movie i would say. Hats off to akshay kumar, ajay devgan, rohit shetty & all the makers of this film, they really nailed it!! The story of this film is very decent, the songs, dialogues, action sequences, cinematography, background score everything is very superb. Katrina's performence is very dull in this film, she could have done better. Talking about the first half, the first half of this film is good but has very unnecessary overdramatic scenes, the second half is very much impressing... especially the last 30 mins of this film won't disappoint you, it will make you laugh & emotional too... with ranveer & ajay's entry the film feels very completed and has a really stylish ending. Overall this movie is really awesome to watch on a big screen, its actually made for theatrical experience, so do not miss this wonderful film.🙌"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jomy-augustine",
        "review_rating": "2",
        "review_title": "Way below average",
        "review_detailed_main": "Dialogues, stunts, direction everything is below average and felt too amateur.. hardcore fans of Rohit Shetty may like the film but not a movie lover. Casting is to blame most."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "prateekthakur-24034",
        "review_rating": "1",
        "review_title": "Cliche",
        "review_detailed_main": "Waste of time, Cliche ,outdated,exaggerated , obsolete,obnoxious, only watch when u have nothing to do in life. Only for illiterates. Exasperating movie. Same old boring concepts and cliche dialogues.nothing new in whole movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "anask-47674",
        "review_rating": "6",
        "review_title": "Cliché but FUN!",
        "review_detailed_main": "Typical Rohit Shetty film.\n\nLoved the comedy, though.\n\nRest is all cliché and to be honest, a little cringey.\n\nAkshay did well in comedy scenes but lacked the intensity needed at serious moments.\n\nRanveer and Ajay did great, and frankly, if they had more screen time than this even by a minute, I would have forgotten Akshay is the protagonist."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "coolpv-07273",
        "review_rating": "1",
        "review_title": "Another overrated COP movie.",
        "review_detailed_main": "I don't understand the logic behind another masala cop movie. Neither the story makes sense nor the acting.\n\nThis movie falls flat on all counts be it acting, direction, cinematography, design and production.\n\nIf some people think that making a masala post diwali will incur them profit ,then they are fooling themselves.\n\nI have lost my 210 rupees and 3 hours.\n\nSave yours ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "darkbhattarai",
        "review_rating": "9",
        "review_title": "Akshay Kumar Show",
        "review_detailed_main": "It is a Akshay Kumar show, comedy, action scenes are brilliant. Sooryvanshi is a complete entertainer movie. You can enjoy this movie only in cinemas."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nikhil141088",
        "review_rating": "7",
        "review_title": "Below average movie BUT...",
        "review_detailed_main": "Its a typical Rohit Shetty movie. First half has story while the second half has non-sense level action. Its way too loud with the title music. Ajay Devgan cameo is disappointing, although Ranveer Singh's cameo is refreshing. Katreena Kaif is forgettable. She is only there for the \"tip tip\" song. Its surprising that in 2021 there are two out of blue full length songs in the movei. It breaks the flow.\n\nThe reason I gave it 7 stars rather than 3 or 4 is because of a positive Hindu-Muslim stance taken by Rohit Shetty, This is desperately needed in our country which is being increasingly getting polarized and divided. I truly believe Bollywood can do what our politicians, media and general twitter/Facebook public has failed so far.\n\nThe scene where Muslims help carry Ganesh statue is quite touching. The background score of \"Chodo kal ki baatein kal ki baat purani\" is very apt. Brought a tear in my eye.\n\nKudos Rohit Shetty and more courage and support for others to follow!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "xcmqh",
        "review_rating": "1",
        "review_title": "I've been robbed",
        "review_detailed_main": "Started off ok, thought I was in for a gripping serious story with a bit of meat to it- ended up being vegan.\n\nJust like every other gimmicky Bollywood movie, started going down hill just before the interval- Honestly couldn't wait for it to be over.\n\nThe way they've portrayed certain religions is border line offensive- I was shocked to see big names in Bollywood even agreeing to scripts like this.\n\nBy the end I got the sense that the director may think Hindus/Indians are greater than all others- I'm sure he didn't mean it to come across like that- but it did (I'm and Indian myself)\n\nDo not recommend wasting precious time on this one."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "puranjanbasak",
        "review_rating": "9",
        "review_title": "Sooryavanshi",
        "review_detailed_main": "Sooryavamshi is an action crime thriller directed by rohit shetty. Here are the positives and negatives:\n\nPerformances-akshay kumar is a perfect fit for this role. He can do both comedy and intense scenes with perfect ease. To my surprise, katrina kaif has given a nice performance. Her dialogue delivery was pretty good compared to her old performances. The supporting cast is pretty good.\n\nBackground score-what a brilliant background score!! You can literally feel the thump in your heart whenever the title theme plays in the background. Especially, the entry sequemces of the three superstars is epic.\n\nSound mixing-one of the finest sound mixing i have ever seen. Mixing the gunshots with background music is a pretty tough job and they have done it superbly. Impressive!!\n\nAntagonists-when the team of antagonists include stalwarts like jackie shroff, kumud mishra, gulshan grover and all you have to know they are not leaving it easy. A perfect team of antagonists.\n\nIf you try to find logic in it you are searching for the wrong notes. Go to the theatres, enjoy the film and entertain yourselves. This is a proper mass entertainer. I rate it 9 out of 10."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "imrancsk",
        "review_rating": "6",
        "review_title": "Good Climax Decent Comedy With Ghajab BGM",
        "review_detailed_main": "Sooryavanshi Is Movie Ki Hype Bahut Thi Aur Yeh Movie Us Hype Puri Tarah To Nahi Lekin Acchi Khasi Khari Utarti Hai Movie Ke + Point Climax Comedy Kuch Action Scene And BGM Movie Ke _Point Story Me Kuch Naya Nahi Tha Movie Ke Villain Bhi Kamzor Hai Ek Line Me Kahu To Movie Is Good One Time Watch."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "samrjb",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "What a waste of Money and Time .Totally Garbage rubbish Movie. Watch it at your risk. Irritating and Overacting. Bollywood has no originality these days ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "muzamil1986",
        "review_rating": "1",
        "review_title": "WHY MUSLIMS ARE TARGET?",
        "review_detailed_main": "Bollywood always TARGET Muslims and Pakistan. This is not good at all. And bakwas movie , dialogues. They must open their minds wide and move on. Also acting like cartoons."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "cs_rahul_prasad",
        "review_rating": "10",
        "review_title": "Akshay Kumar In & As Sooryavanshi Is High On Style, Show And Action Thrills. Rohit Shetty Perfectly Made This For Big Screen !!!",
        "review_detailed_main": "Rohit Shetty has brilliantly expanded his cop universe over the years - keeping the audience engaged and die-hard fans of the genre on the edge. After the Singham series (headlined by Ajay Devgn) and then Simbaa (starring Ranveer Singh), now storms in Sooryavanshi (Akshay Kumar), amidst much fanfare, drama, and blaring theatrics. Sooryavanshi's character was subtly announced towards the end of Simmba. The film has all the elements, attitude, style, showmanship and heavy-duty star power expected of a Rohit Shetty offering.\n\nSimilar to Simmba, even this cop action saga is narrated by Ajay Devgn, who reminds us of the several terrors attacks which Mumbai has encountered since the 1993 serial blasts to the 2008 terror attack on several landmark locations in Mumbai, including The Taj Mahal Palace, Mumbai and Chhatrapati Shivaji Maharaj Terminus (CSMT). The story in film unfolds as the biggest attack is yet to happen in the city, as some sleeper cells from Lashkar have been activated and it is found that 600 kilos of RDX left over from '93 serial attacks is being used for the purpose.\n\nEnter DCP Veer Sooryavanshi, with a solid mission and a lot of garam khoon to protect the city from another big attack. He is so committed towards his duty that even his family, wife Riya (Katrina Kaif) and son Aryan come second to his mighty task at hand.\n\nWith the cross-border plot, the film revolves around the concept of revenge, 'An Eye For An Eye, Makes The Whole World Blind.' While the story itself plays it safe (basic and predictable), the action is risky and rousing (Rohit Shetty and Suniel Rodrigues). The chase sequence between Veer and John (Sikander Kher) on the streets of Bangkok is a visual delight.\n\nAkshay Kumar delivers a powerful, praise-worthy, knockout performance. From his seeti-worthy entry to the relentless gunshots - he justifies his super cop act. Apart from the high adrenalin physical encounters, there are umpteen high drama chases, with cars, bikes and helicopters as Akshay Kumar displays his unquestionable action skills. Overall, it's an Akshay Kumar's show all the way with his star power and screen presence looming large. Katrina Kaif looks stunning on screen and her sensual moves to the iconic song 'Tip Tip Barsa Paani' is undoubtedly clap-worthy, but you can't not think of the original 'Mast Mast' girl of Bollywood, Raveena Tandon.\n\nAjay Devgn's and Ranvir Singh's smashing (quite literally) entry in the second half elevates the film and adds the striking punch. As Bajirao Singham and Sangram Bhalerao respectively, the three actors steal the show in the final 20 minutes of the show where they have performed together.\n\nThe ensemble cast, which includes Jackie Shroff as the leader of terrorist gang Omar Afeez, as well as other group members Gulshan Grover, Abhimanyu Singh, Kumud Mishra and Nikitin Dheer, makes a substantial contribution to the plot's progression. Jaaved Jaaferi's portrayal of ATS head Kabir Shroff, on the other hand, perfectly plays his serious cop part.\n\nWhile the background score of Sooryavansi sets the mood, the songs are not particularly memorable. The revamped version of 'Najaa' is an earworm, but we don't get to hear it in the film. However, the trio dancing to Daler Mehndi's 'Aila Re Aillaa' is entertaining.\n\nVeer Sooryavanshi, Akshay Kumar has successfully taken over the mantle from his predecessors (Singham and Simmba), and with a generous dose of flying and somersaulting cars, this one is quite a bumper Diwali entertainer for you. And if you are a fan of high voltage action movies, go lap this up!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "lotekguy-1",
        "review_rating": "7",
        "review_title": "....aaand for the save - heeere's Ajay!!!",
        "review_detailed_main": "Big Ajay fan. He's the reason I picked this one, and I had to follow a meandering plot, with time-lines that made no sense, until he finally burst (literally and figuratively) onto the scene. But it was worth the wait. What an entrance! That, plus the ensuing action sequences delivered all the over-the-top, just shy of campy, butt-kicking heroics any of his fans could hope for.\n\nProps to Akshay, as well, for his fine job in the fights and chases - especially doing his own stuntwork in the helicopter bit. Jackie Chan would have been proud to have that one on his highlight reel."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pulkitsharma-16053",
        "review_rating": "1",
        "review_title": "Worst Experience",
        "review_detailed_main": "One of the worst movie I'm ever watch...! Completely time waste, story is too slow & same as Mumbai & Attack. Request to everyone please don't go & watch these type of stupid movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nksarker-19829",
        "review_rating": "10",
        "review_title": "BEST OF ALL AKKI STARRER",
        "review_detailed_main": "Rohit Shetty is known for all his remakes. But this one seems to be his best till date.\n\nMuch better than Singham/ Singham 2/ Simmba....\n\nKatrina's top notch performance in Tip Top Barsha overshadowed 90s song. And you would never feel it's remake\n\nAnd Akki- he's the main USP. SOORYAVANSHI. Not like agent from Baby but an ATS CHIEF."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "uvaish-93905",
        "review_rating": "6",
        "review_title": "40 Terrorist but 400 killed",
        "review_detailed_main": "Nice movie but the climax dint match with the movie. 40 sleeper cell terrorists were told to be involved in the blast but in the climax fight, they have showed 400 terrorists 😂"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jumaanah",
        "review_rating": "1",
        "review_title": "Time is of great value. Please protect it!",
        "review_detailed_main": "I went to watch the movie thinking that three cops who have acted well in their own respective movies coming together will be fun, but little did I know that I was a getting a ticket to hate on myself for making such a poor decision. If only I could get those 2.5 hours of my life back sigh. Time travel machine! We need you!!!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "seemaseema-72218",
        "review_rating": "9",
        "review_title": "An Awesome Masala Movie",
        "review_detailed_main": "Story Was Predictable but in the way it has been show it was mind blowing really this movie is only made for theatres just go and watch this awesome movie ajay devgan acting was jext level boss."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "aniketmittal-60520",
        "review_rating": "6",
        "review_title": "Are you soooo bored ? then only you can watch sooryavanshi !",
        "review_detailed_main": "If you are planning to watch this movie put your brain at home and just enjoy the movie. And If you are a Akshay or Ranveer or Ajay fan then you can watch this. Some action sequences are good, nice bgm, and final showdown is awesome . Songs placement are not great except one Patriotic song and mere yaara but movie has so many cheesy dialogues and why veer has name amnesia ? No clue. But overall it is a one time watch if you are bored."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "dharmaksha",
        "review_rating": "4",
        "review_title": "Bad acting",
        "review_detailed_main": "The movie's story is very similar to holiday and many contents are copied from other movies (as usual). It has some inspirations from Jack Ryan scenes (just a lil). The action was rather good and a little grounded (as compared to other Rohit Shetty movies). Story was not very good it had poor screenplay and worst of all Akshay Kumar and Katrina Kaif were very disappointing. I rater liked Ranveer Singh's acting. The CGI was also very good all the helicopter and blast scenes felt very real."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ritupareekrp",
        "review_rating": "1",
        "review_title": "Why we fools are tolerating these kind of content",
        "review_detailed_main": "Where poor story, screenplay, and repeated same stunts in every bullywood movie, please do watch other regional and South movies much better than these, thse content are meant to be misleading to our society boycott drugollywood."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jigx_kumar",
        "review_rating": "7",
        "review_title": "A solid 7",
        "review_detailed_main": "Although the movie is not as funny as Simmba, you can expect a much more solid argument. The movie explains almost from moment zero what is happening and why, a \"solid\" and realistic why, which makes the movie much more captivating than the previous one.\n\nThe movie tries to have a romantic perspective as well with throwbacks to the romantic relationship between the main couple (Akshay Kumar and Katrina Kaif), although most of it could simply be removed from the movie and no one would really miss it.\n\nA huge plus and a major look out in this movie is how the director tried to play with the camera in the last fighting scenes, specially the fighting scene recorded with a single camera in one single take in which Ranveer takes down 4/5 villains in a row - hats-off!!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bijuphysio",
        "review_rating": "1",
        "review_title": "Below average",
        "review_detailed_main": "Nothing new ...same story repets..boaring ,overacting .Rohit shetty should understand the audience choice. Dont waste money. What is the role of Katrina cant understand .Predicted story outline."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "aggarwaljai-85398",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "Not sure why there's hate around it but I enjoyed the movie. It was all predictable and not suspenseful at all but was fun.. could have been better in terms of action sequences."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kunal-90206",
        "review_rating": "6",
        "review_title": "Good story but made with Rohit Shetty style",
        "review_detailed_main": "Good story but made with Rohit Shetty style.\n\nImagine if the same story directed by Neeraj Pande and that too with Akshay Kumar, definitely have achieved more ratings."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "yuvichetan",
        "review_rating": "1",
        "review_title": "Worst Movie... Don't waste yr Time and Money",
        "review_detailed_main": "Dear bollywood , raise yr standard in making movies .\n\nNow signing stars are not going to help in collection .need some script Same gheeshipiti script !!\n\nDon't waste yr money and time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jambhai-01647",
        "review_rating": "7",
        "review_title": "About moive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "arjitmathur",
        "review_rating": "1",
        "review_title": "Meme Police",
        "review_detailed_main": "Movie irony is they are trying to show Mumbai police in good light but truth we all know. Another thing stop fooling people around Mr Shetty no one now going to watch Meme Police movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "srirupaghosh-chaudhuri",
        "review_rating": "1",
        "review_title": "Erm, unbearably nonsensical movie",
        "review_detailed_main": "& why is Katrina the lead actress? Her dialogues were ridiculous & Tambe's wife had much better role & screen presence! The movie is like shoving religious Based BS down one's throat! Rating it 1 for Ajay Devgan; remaining so called leads were just terrible!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bedanishh",
        "review_rating": "9",
        "review_title": "OK Action Thriller",
        "review_detailed_main": "Rohit shetty's cop universe eventually befell. Entertainer with old vintage plot you may simply take a seat and watch with out wondering too much. Romantic elements have been compelled a bit but Akshay gave knockout performance in each motion and comedy aspects Ajay (Singham) also show his nice capabilities. All the component are good enough however there's lots over acting of Ranveer Singh (Simba) that's why it's not so good at the end."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "roopalkatiyar",
        "review_rating": "1",
        "review_title": "Bakwas movie",
        "review_detailed_main": "Nothing new.. waste of time.. dont waste your money... Same ghisi piti story again... boring.. and overrated action which spoils your mood and give you headache.. Bollywood needs ti stop making such type of movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sandeepshrimali-23582",
        "review_rating": "10",
        "review_title": "Pure Masss!!!",
        "review_detailed_main": "Sooryavanshi is out and out an engaging action packed film. Akshay Kumar as always acted brilliantly and Rohit Shetty's direction makes this a perfect family entertainer."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "murtazashabbirms",
        "review_rating": "6",
        "review_title": "WORST FILM IN THE SHETTY'S COP UNIVERSE",
        "review_detailed_main": "To start off,it didn't look like katrina is acting for years,her dialogue delivery looked like someone was forcing her to speak out her stuff AK was ok but the best acting was done by the villians of the film.comic seasons seemed forced except the bit from anil Charanjeet and Ranveer singh.action sequence were not upto the mark except the last bit and someone tell me WERE THE 40 PEOPLE RESPAWNING?...why did it take so long for so less people to die?...moreover screen play was ok but overall the movie was average."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "hitmanorval",
        "review_rating": "4",
        "review_title": "Over rated and nowhere close to original Singham",
        "review_detailed_main": "Same old formula, tacky dialogues, stolen songs and the movie makers are making crores and crores by looting us, the stupid audience.\n\nGolmaal 1, Singham 1 were really well made movies with so much originality. Rest all rohit shetty movies are utter crap.\n\nPositives - Only when the 3 heros combine at the end, the movie feels really good.\n\nNegative - Quite a few. To start with plastic expressions Katrina Kaif. No change in her facial behaviors whatsoever. Just watch the sad scenes in the movie and you shall be able to relate to what I want to say.\n\n2> Unnecessary comic timings in a serious situation, no issues with that though but the execution was not at all up to the standards.\n\n3> Songs are a big let down and were not actually required in this movie.\n\n4> Unnecessary love angle which does not fit at all in the flow.\n\n5> Lots of other issues which you will see when you watch it.\n\nAll in all, masala entertainer but not worth the ticket prices that people will pay across India.\n\nI am sure all the fans like me will still go to theatres and fill in the banks of these already super rich people but take a word of advise, save the money and do something that you love.\n\nIf you are still loyal to Rohit shetty and the bunch of actors, pls go to a normal theatre and save the hard earned bucks because you can never expect any returns from Bolly mafia :)\n\nOne time watch in theatres (If you wanna make them rich) Can be watched few times on TV\n\nCheers."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "amanmish",
        "review_rating": "9",
        "review_title": "Good story",
        "review_detailed_main": "Great influential characters that depicted every character in a very creative way. Best movie I have watched with my family and going to watch it again with my friends. Classic! Good story."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jambhai-01647",
        "review_rating": "7",
        "review_title": "Movie review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rajesh-12918",
        "review_rating": "1",
        "review_title": "SUPER FLOP MOVIE OFTHE YEAR",
        "review_detailed_main": "Akshay should immediately retire...no one is interested to watch his movie anymore. Waste of Time & Money. Shame Shame. Same cut paste story with poor acting...nothing new. Boycott Bollywood Movies & save our nation. This is a SUPER FLOP MOVIE OFTHE YEAR !!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "boy13",
        "review_rating": "2",
        "review_title": "Good potential being wasted",
        "review_detailed_main": "The movie starts well makes you think that it will have some good action scenes intense terrorist plots. But no it just doesn't take off from the ground. It keeps dragging along. So many situations arrive when story could have interesting scenes and build into a storyline. But the director refuses to do anything worthwhile. It feels like Ferrari is being driven on first gear. The story never takes off. However, during last 1/3 of the movie, it feels like the director just gave up and found it too stressful. He just told his crew members that he is going home and bored with this movie stuff and pack off. Movie suddenly goes into comedy mode with the entry of Ranvir Singh and Ajay Devgan. It makes the movie totally laughable and unbearable. It keeps you wondering what's the point of this whole movie? Katrina Kaif pathetic acting and Ranvir's overacting drags it down further."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vibhus-17780",
        "review_rating": "6",
        "review_title": "Decent",
        "review_detailed_main": "A typical bollywood commercial movie . Yes, it has flaws and some cringe elements , but it was bearable . Story was simple , and predictable screenplay , if they had done something interesting in screenplay , definitely it could've been a good family entertainer . Comedy worked in most of the places . Cast done decent job . Singham and Simmba movie crossover was something new ( Rohit Shetty's cop universe ) . Few action sequence were good to watch . Music was average . Overall a decent family entertainer to watch ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sorendinu",
        "review_rating": "1",
        "review_title": "Nothing new",
        "review_detailed_main": "Time waste movie Bakwas action without logic Rip physics Resturn my money.\n\nAkshay kumar choose those only copy story And copy song Nothing new in this movie Nowadays Akshay kumar only doing business Nothing serious ness in his character Copy action Copy song Copy story Nothing new."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "anit_mumukshu",
        "review_rating": "1",
        "review_title": "You can guess from the trailer",
        "review_detailed_main": "This movie comes into the category of Dabangg 3. And it's worse than simba.\n\nStop giving movies to this old actors.\n\nLaxmi bomb flop/ bell bottom bad/ now this high budget movie is also on the way.\n\nTwitter will boycott Ram Setu and OMG 2.\n\nThis old man's career is finished."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "Aditya_Srivastav_23",
        "review_rating": "10",
        "review_title": "Comedy Action Packed Movie",
        "review_detailed_main": "I'm so glad I kicked off my diwali on a dhamakedar 💥 note with #Sooryavanshi , great plot , action choreography especially in the climax is really great , lot of nicely choreographed shootout & combat sequences , the music too especially the thumping background music felt great to hear in the theater & #KatrinaKaif surprises in a really awesome attention grabbing , superbly & sensually performed dance moves in a really nice updated version of #TipTipBarsaPani."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ravising-50434",
        "review_rating": "1",
        "review_title": "Time and money waste",
        "review_detailed_main": "Total waste of time and money. Don't waste your energy for anti nationals like Akshay. Based on Bombay attcks which were planned by these anti nationals. Time to export Akshay to Canada. That's where he belongs."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "movie_goer82",
        "review_rating": "1",
        "review_title": "IMDB should start -ve rating system",
        "review_detailed_main": "This movie was so bad that I wish IMDB had -ve rating system and -10 out of 10 could be given.\n\nRohit Shetty and his silly stunts along with childish comedy is not bearable at all. And on top of that watching Buffoon Ranvir, Zubaan keasri chhap Ajay Devgan along with Canada Kumar was torture."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "muskanrawat-17671",
        "review_rating": "10",
        "review_title": "good",
        "review_detailed_main": "The Storyline is good and some scenes could hurt Islamist and communist section of the society but the movie tries to gives a good mssg of brotherhood but with what happens regularly in Bangladesh and Pakistan with minorities and what happens on a regular basis in Kashmir Kerala Bengal and many Islamic majority regions in India is not concealed frm anyone...Acting of Akshay and Katrina has been superb as it has always been."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "imrudrabha",
        "review_rating": "1",
        "review_title": "Nothing New",
        "review_detailed_main": "It will be great if people can invest their valuable time, and money in something valuable and worthy. Bollywood's reality is far different from what they pretend to be in the movies. All these are just the ways of soft influencing. Jaago public jaago. Justice for Sushant Singh Rajput sir. Jai Hind\n\nKind Regards, Rudrabha Mukherjee."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "johnsmith-79117",
        "review_rating": "10",
        "review_title": "I always like Akshay Kumar..The movie was good.",
        "review_detailed_main": "I always like Akshay Kumar..The movie was good.. Katrina Kaif is as always good.i don't wanna give any spoiler so i will not talk about internal movie.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "satyabratamishradfos",
        "review_rating": "1",
        "review_title": "Sooryavanshi review",
        "review_detailed_main": "Disaster....worst movie of rohit shetty ever...no logic no magic......first day first show with only 30 percent audience in our city .....stardom 😅😅😅😅..."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ytyrt-51290",
        "review_rating": "10",
        "review_title": "So good fantastic movie",
        "review_detailed_main": "Thisis really nice movie it is fantastic movie it is amazing movie I like this movieKatrina kaif has done nice acting. Her skills showed that she is India's fastest sprinter. She had the very nice to compete."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "coolsourabhy",
        "review_rating": "1",
        "review_title": "Fake",
        "review_detailed_main": "Please show reality of police not fake story.\n\nWe all know that what police actually does with people not all but some.\n\nYou cannot clean police image just showing mind created story if you have guts to show what the really police is."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "akshai78",
        "review_rating": "1",
        "review_title": "People over hyping the movie because cinemas are opening up again",
        "review_detailed_main": "Just watched this movie, let me tell you I ain't one of those blind mindless fans who will just like this movie regardless of how it is just because I'm happy cinemas are opening up again\n\nWith what the trailer showed me the film looked decent but what a disappointment it is. Very weak screenplay , story has nothing new and I was hoping to see more of the cross over cop universe of Singham and Simba but we did not get much of that.\n\nLet me tell you first Ranveer Singh is the most overrated actor ever he is a clown and have no idea why this man has fans he is an over actor and seems like he is on drugs\n\nAkshay Kumar is decent but he is showing his age also he does overact in this movie\n\nAjay Devgan is the only grounded and decent light of the movie\n\nKatrina Kaif is there for just eye candy her crying emotional scenes are just laughable\n\nThe VFX looks fake...the songs are all copied\n\nPlease don't give fake reviews of this awful movie saying it's great when it's not just because cinema halls are opening. Film is bad and people just admit it."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bajwarajnish",
        "review_rating": "10",
        "review_title": "Different from the original franchise",
        "review_detailed_main": "Acting was too class Humour was ok Action scenes osm Script was different from simba and Singham.\n\nThis role is made for Akshay sir.\n\nAnd ajay sir entry gave me goose bumps."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sardjoekanti",
        "review_rating": "1",
        "review_title": "Really?",
        "review_detailed_main": "Baseless! Don't waste your time or money on this movie. It's the same kind of storyline they are using and fooling people who are watching. But it is our fault. We were blindfold by these fake stars and their thinking and living but not anymore. No MORE! So spend your time well."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "navuno",
        "review_rating": "10",
        "review_title": "Action is superbbb",
        "review_detailed_main": "Acting is superbbb. I am just speechless by the performances of all the actors. A must-watch movie with your friends and family. A mind-blastic start to the weekend. Binge-watching! Very good."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ferraris-26407",
        "review_rating": "1",
        "review_title": "Ek dum bakwas movie",
        "review_detailed_main": "Save your money, this movie is absolute rubbish. If you do decide to watch this trash, pls leave your brain at home. No story, just pure rubbish on screen and a headache is all you'll get after watching this movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sjubaid",
        "review_rating": "10",
        "review_title": "About some good point of view.",
        "review_detailed_main": "Saw this movie twice, its perfect for me.video regulation, screen play is good to see.according to our society script is very good. Recommend it for must watch."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "mahapatronomit",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "Idiotic movie.... No logic no story... Scenes are mostly copied... I don't know why they are making movies like this... Full Time waste and total disappointment..."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "diptiparekh-97110",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "I m fan of Rohit shetty sir bt ths was one very disappointed movie.plus Akshay kumar he is looking so aged and not at all powerful. Kat was although looking good bt acting no comments."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kingoflordsudhir",
        "review_rating": "10",
        "review_title": "Best ever",
        "review_detailed_main": "We all want to a good box office in bollywood cenima and this movie has ability to do it. We all enjoy it as my opinion on this movie, best ever at all."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "sahilmaini-49055",
        "review_rating": "1",
        "review_title": "Horrible Movie",
        "review_detailed_main": "Cliche story. Making fool of public on name of story. Keep on selling age old action. When bollywood hero's are going to act and stop relying on the cinematography and editing\n\nGrow up bollywood."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "userhk-39533",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "What a blockbuster movie from rohit the blockbuster director. And what a acting Akshay sir ajay and ranveer ( simba ) . And specialy Katrina kill it man . Just love the movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "himanshuskarki",
        "review_rating": "1",
        "review_title": "Terrible screenplay - Bollywood will die if such non sense continues",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kprashanntt",
        "review_rating": "1",
        "review_title": "bekar movie",
        "review_detailed_main": "One of the worst ever seen.\n\nDidn't expect from Akshay.\n\nAnd why does the review should be 150 words when the movie is not meaningful for even 150 seconds."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jeevanvisyara",
        "review_rating": "1",
        "review_title": "Worst Movie No storyline. Stupid movie",
        "review_detailed_main": "No storyline, overrated no entertaining same old story Bollywood film nothing interesting. Akashy Kumar over acting. I think Akashy Kumar should play daddy role according to his age, instead playing lover boy image."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "deveshkumarshrivastav",
        "review_rating": "10",
        "review_title": "Mass entitener",
        "review_detailed_main": "Baap level action and presenteson,directon is suparb but storyline is predictable !\n\nAgar aap dhasu aur fadu action ke shaukin hai to jaldi se apna ticket book kijiye aur enjoy kijiye aur haa es movie bgm aap kaan kya aapki gand bhi phaad sakta hai eska bgm hi es movie ka plus poin hai !"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jeevanvisyara",
        "review_rating": "1",
        "review_title": "Terrible Movie Akashy Kumar over actor",
        "review_detailed_main": "The movie is not worth watching Akashy Kumar is over acting too many songs for no reason, You better of watching nice Hollywood movie then Bollywood. Dont waste your time."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kalethiel",
        "review_rating": "10",
        "review_title": "Very good movie I love it to watch",
        "review_detailed_main": "Its was really great I love the movie. Please be help the create an the link impossible used hacker yet stop sot the link impossible stop the hacker yet stop the free man and got my payment task please."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "divyanka-36824",
        "review_rating": "1",
        "review_title": "Rate it 1 .. Quality of movie is like cheap Chinese",
        "review_detailed_main": "Worst movie ever had. Overaxting ki dukan..no logic.. baseless script.\n\nKhatro ke khiladi wala third grade action.. third grade editing.\n\nThird grade acting..Rate it 1 .. Quality of movie is like cheap Chinese product."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kishori-02321",
        "review_rating": "1",
        "review_title": "Isko 1 star do sb.. bhot ghatiyaa movie hai",
        "review_detailed_main": "Ye sare chor hai.. india. Audience ko vs remake aur ghatiya kahani proste haj..aur khud malayi khaate hai.\n\nAkshay ki sare movie south remake hai . Upcoming v sare remake hi hai."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rahulbd-03853",
        "review_rating": "1",
        "review_title": "Idiot director.....",
        "review_detailed_main": "A high level worst movie again from Rohit shetty. ... He has no minimum sense to make a real screen... Just funked up movie.. A big time in Depawali has to have a good movie from good director... Not an from idiot... Just list time... I will never smwatch him idiots movie again..."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bhaggu-83003",
        "review_rating": "10",
        "review_title": "Fab movie",
        "review_detailed_main": "Perfect diwali movie.. fab action comedy, emotion... Akshay kumar.. u rock man.. loved the movie.. u made the theater felt like stadium. It's beyond expectations... Bgm was terrific.."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "khuthejatulkubra",
        "review_rating": "1",
        "review_title": "Brainless Rohit shatti",
        "review_detailed_main": "I am disappointed badly went with family to watch a movie after long time movie is just senseless masala movie with zero storyline.the same stupid action and its not so good to watch a 55 year actor romancing with a 35 year old lady . Music is so bad above all there is no PSO are being taken care in cinema.we regret a lot .only 1 star do not waste your time and money just go for a walk with someone you love."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "uyennguyen-80292",
        "review_rating": "10",
        "review_title": "Akshay Kumar, Ranveer Singh, Ajay Devgan did a great job on their part.",
        "review_detailed_main": "The movie is suitable for viewing entertainment, not to hack the brain. The action scenes are shown at a medium level and the effects are not too high. I think we should not ask too much for a movie with such action content."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vermaajay-73049",
        "review_rating": "1",
        "review_title": "Kya tha ye...",
        "review_detailed_main": "Let's start with the fact that the director is worse the lead actor is overrated and the dialogues are even worse than the usual. The last so called action sequence where nsg commandos enter wearing bullet proof jackets and the goons are showering bullets using automatic rifles there these three actors are fighting back without any cover and jackets. The whole movie is a scam not a worth waste of time. Watch Eternals atleast they have a better story and action."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "bhaggu-83003",
        "review_rating": "10",
        "review_title": "Fab , fantastic, mind blowing ,",
        "review_detailed_main": "Fabulous movie.. what action scene's , story , direction , n yes akshay kumar.. u always rock... This movie can be experienced in theater only.. jabardast movie..."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ausafayyub",
        "review_rating": "1",
        "review_title": "Same storyline.",
        "review_detailed_main": "Dull and tooo much of action. Bollywood needs to get over this genre. Excessive masala with no sense of filmmaking. Akshay must do more movies like special 26 and khatta meetha."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "zarayasin",
        "review_rating": "1",
        "review_title": "Not even a 1 time watch a no watch",
        "review_detailed_main": "Very general nothing new. Unrealistic action, dialogues from supporting characters seemed dubbed. The movie was very anti Pakistan. Named lots of different terrorist lots of different Muslim names as though from a Muslim name book. Jokes were crude and unfunny. Female lead hardly had a strong role or much screen time as in most Rohit Shetty films. Plot was predictable indian cops vs Pakistani terrorists which has been done a million times. Rohit Shetty movies are getting bad to worse as are his comedic references as each movies passes by. I left at the interval thats how terrible it was. Waste of money, pointless, robotic and divisive. Why do opposite countries have to always be enemies why can't they be portrayed as friends instead of us vs them. Ridiculous and horrible. Not worth the watch."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vipinbhskr-29216",
        "review_rating": "1",
        "review_title": "Worst screenplay by actors",
        "review_detailed_main": "Low grade action sequence. It could be better but they didn't.. Rohit shetty you can't hit always like the old strategy, try something new that audience doesn't expect."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "koushig-926",
        "review_rating": "10",
        "review_title": "Good move.",
        "review_detailed_main": "Katrina kaif has done nice acting. Her skills showed that she is India's fastest sprinter. She had the very nice to compete. Super movie............................................................ good move..............."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "benifitsamit",
        "review_rating": "3",
        "review_title": "Bhut buri trha flop",
        "review_detailed_main": "Itna wait kerwaya... Itni buri movie Bhai jab corona Chal rha tha Tbhi Nikal dete Ye Zeher bhi.... Foolish movie. What is the use of Katrina in movie, why R. Sing why Ajay... Old car stunts, everything is so predictable."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rakeshkumarrt",
        "review_rating": "9",
        "review_title": "Underrated",
        "review_detailed_main": "Suryavanshi deserves far far far more praises than it is actually getting. Some solid performance from everyone. Too good....... very amazing movie.,......"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "judgesinghnabi",
        "review_rating": "1",
        "review_title": "Don't like drugs mafia no hero",
        "review_detailed_main": "This is to inform you that I am not interested in Drugs mafia any body movie.our demand justice for Sushant Singh Rajput Completely bollywood boycott."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "avininjas",
        "review_rating": "1",
        "review_title": "Boring! poor screenplay !",
        "review_detailed_main": "Finally releasing after 19 months, Sooryavanshi is nothing short of a celebration of mainstream Hindi cinema, Totally waste of time. No story.. There's no sense in movie storyline. Poor acting.. Repeated Formula by Rohit Shetty. Police vs Bad guys."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "manshishukla",
        "review_rating": "10",
        "review_title": "excellent",
        "review_detailed_main": "The scene where akshay met katrina with a bullet on near heart, the chasing of villain with family, javed jaffery explanation of marriage to katrina, the scene where akshay met a guy who have same problem of forgetting names are hilarious, tip tip barsa and.mere yaara are only two songs which are good."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "abhilash-76640",
        "review_rating": "1",
        "review_title": "Terrible Horrifying",
        "review_detailed_main": "Movie starts with a full fledged Speed.. what's going around is hard to Understand like Radhe. A character's Screenplay is over without know why he is in the movie.. it's a terrible Experience.. if you are ready to spoil and waste your diwali you can go and cheack out👍"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "joyboyer",
        "review_rating": "10",
        "review_title": "Blockbuster Film of 2021!!!",
        "review_detailed_main": "I didn't have any type of expectation from this film because I'm not a big fan of Massy films, but this film hasade me fall in love with Massy films as this is a Wholesome Entertainer For Everyone. Each and Every performance in this movie were not that great but it was upto the mark. Cinematography and songs are Average , Screenplay is fast paced and engaging and story is also Good but predictable. Watch this movie if you need Entertainment."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "qtfxftsbv",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "Time waste money waste dimaag ka dahi wahi purana raag.\n\nMuch awaited ? Why was it awaited . We all knew deep down ki wahi basic story honi hain . Simbaa and Singh am are for name only .. just to promote in trailers.. I feel so irritated why did I go to watch this movie 450 rupees I should have done something better with it Disappointed."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "vrajmehta-76160",
        "review_rating": "10",
        "review_title": "Best 🍿🎥✅",
        "review_detailed_main": "I'm so glad I kicked off my diwali on a dhamakedar 💥 note with #Sooryavanshi , great plot , action choreography especially in the climax is really great , lot of nicely choreographed shootout & combat sequences , the music too especially the thumping background music felt great to hear in the theater & #KatrinaKaif surprises in a really awesome attention grabbing , superbly & sensually performed dance moves in a really nice updated version of #TipTipBarsaPani . The character , plot driven moments as well as the emotional & humorous moments are really nice & nicely balanced . It also makes an attempt at tugging at your anti terrorism & religious sentiments & rightfully succeeds in that department . Entire supporting cast including @GulshanGroverGG & others really make an impact with whatever screen time them . Nice 1st half even better 2nd half as the ATS are in a race against time to diffuse a bunch bombs . The presence of Singham & Simba in the climax is nicely weaved & is a moneyshot moment that elevates the concluding portions of the movie . Singham's brief standalone moment in the climax is really nice which is a teaser to #Singham3 . This is @iamrohitshetty 's best movie yet I wonder how he'll top it off in the next installment of the universe looking forward to it 👍"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "wrelfdibny",
        "review_rating": "1",
        "review_title": "Cringe",
        "review_detailed_main": "Not worth your time. Same old storyline. Same old tactics to give to chills but failed miserably. Same old one man army saving out country. Incredibly unrealistic, just another movie to cash our Patriotism."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "chet-ahuja",
        "review_rating": "1",
        "review_title": "Same nonsense same cliched dialogues",
        "review_detailed_main": "500 bucks for a 5 buck ott movie.. oh for love of hindi films and good ecosystem ..pls stop such scripts coming out.. can 3 heros save the movie , i doubt it."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tusharonline-58734",
        "review_rating": "1",
        "review_title": "Stupid story....glorifying terrorists... Shown police as dumb",
        "review_detailed_main": "Over hyped movie. Unbearable story and acting. Have glorified terrorist action. Police has been shown as dumb fold. Don't even waste your time watching it over Netflix. Ranveer Singh 5mins scenes were the best part of the whole movie. There are better movies n sitcoms to watch on OTT platform based on police force."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ravindusenadeera-97250",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "You can get excellent experience by watching this movie. This is very nice and emotional movie that I have ever seen. I invite you to watch this movie and get this experience."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "skingprajapati",
        "review_rating": "2",
        "review_title": "Cringe level infinity",
        "review_detailed_main": "Old story , B grade Dialogue , Katrina Kaif only for one song's acting 🤢 , Family entertainer k naam pe Kamasutra wala dialogue-Cringe Punch lines , Religion Sentiment.\n\nOnly one thing i Enjoyed villains entry amd dialogue bas in ko dekh k hi lagta he ki ha bhai koi to overacting nhi kr rha he Jackie Shroff ko dekh k lagta he sala sach main he mumbai ko uda daale ga. And also Ajay and Ranveer are too good."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "singhalshubh-40636",
        "review_rating": "10",
        "review_title": "bahtreen picture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "architcygrp",
        "review_rating": "1",
        "review_title": "Sooo bad",
        "review_detailed_main": "Highly disappointed.. Waited soo long. But not worth spending your haed earned money Soo bad guys Dont waste money.\n\nPoor action Fake CGI Poor acting Poor story."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "pravdeepak",
        "review_rating": "1",
        "review_title": "Whats wrong with Bollywood?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "patel-14153",
        "review_rating": "1",
        "review_title": "Bakvas movie",
        "review_detailed_main": "Overrated movie, not worth don't spend money on these movies instead use that money to make buy pataka and enjoy busting with kids and families.stop making these bullywood people richer with your money."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "rajvirbangsi2527",
        "review_rating": "9",
        "review_title": "Nice",
        "review_detailed_main": "What an execution man! The storyline is unique and nothing can defeat the facts on which the movie has been made. Rohit Shetty has nailed it with his directional skills."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nakenergy-78627",
        "review_rating": "1",
        "review_title": "Rohit Shetty - overhyped mediocre film maker",
        "review_detailed_main": "Some people just survive even though they dish out ridiculous movies like Rohit Shetty. To be fair some have been entertaining but most are repetitive. Shetty claims to be an action director but the action is so poor - haven't seen realistic action since Sholay with all the tech around in Hindi Cinema. In addition the cringy slow motion which is only done for unachievable action. This director doesn't give anything new - the same old stuff, fleecing the audience, chalta hai! However, there are other choices and thank you OTT for that, for e.g Suriya's Jai Bhim blows this Suckvanshi away!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "lindokindo",
        "review_rating": "1",
        "review_title": "Buddas",
        "review_detailed_main": "All r budde become hero in urduwood. Below average movie. Totally waste of money ita better to buy some stocks for future. Urdu wood misleading people by this fiction movies."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "priston-98590",
        "review_rating": "1",
        "review_title": "Same old rubbish",
        "review_detailed_main": "Bollywood churn out the same old rubbish expecting people to lap it up. Well, those days are gone. People are wise to what else is out there and this doesn't measure up. Female actresses get side lined once past 35 but the old men of Bollywood just keep on going romancing women half their age. It's a load of rubbish, save your money and time. Bollywood is so yesterday!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "randima44",
        "review_rating": "10",
        "review_title": "Tremendous movie! You will love it till end",
        "review_detailed_main": "Sooryavanshi was one of the greatest movie I have ever watched in the Indian Cinema. From start to the end, movie is amazing .The music, action, and the story is made to amuse the watchers till end of the movie. Akshay Kumar's action was rocking though out the show and I honestly enjoyed the movie very much.\n\nTeam Rohit Shetty has done a tremendous job here. This is undoubtedly the 2nd best movie of Rohit Sherry after Chennai Express.\n\nIf you are a Indian movie lover, this is a must watch movie!!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "archanarai-97029",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Bollywood is a sinking ship...all together trying to save it...old actors playing the lead with Young actresses...and age old story of good and bad...hope bollywood soon gets its lessons and mends it's ways."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "jeevuni",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Nothing new! Nothing original! Golmal action scenes repeated with Katrina doing nothing.\n\nIt would be better if I had not watched it, would have been even better if this movie was never made ."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "ravindusenadeera-97250",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "You can get great experience by watching this movie. Very nice and emotional movie that I have ever seen. I invite you to watch this movie and get this unforgettable experience."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "nomanalivenow",
        "review_rating": "1",
        "review_title": "Nice comedy",
        "review_detailed_main": "Hahah. It's so funny and hilarious to see rhe vegan Indian beating up Pakistanis in movies. I wish they could do 1% of it in real life. This flick is one of my fav comedies. 3 vegan men fighting 1000s of their enemies....the tea was fantastic. Hahahah. 😆 🤣 😂 😹 😆 🤣 😂 😹 😆 🤣"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "mkmoizcreation",
        "review_rating": "1",
        "review_title": "Waste of time and waste of money",
        "review_detailed_main": "Totally bakwaas movie .\n\nTheater me nind bahut acchai aai aaj ... Bakwaas movie hai ...south ki copy hai ... Akshay face was terrible like 80 years old person 😂😂😂😂😂😂 So boring."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "covidaligarh",
        "review_rating": "10",
        "review_title": "Diwali Dhamaka",
        "review_detailed_main": "The movie is more then super and riding high on action comedy and the Plot of the movie. Akshay Kumar is a highlight of the movie, but I admit that every one do justice with thier role in a movie, A good Family entertainer at the diwali."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "shadabsiddique",
        "review_rating": "1",
        "review_title": "Bad movie. Poor plot. Not a rohit Shetty movie.",
        "review_detailed_main": "This is surely not a Rohit Shetty movie. It seems he got carried away by the stupid narrative. Same old Akshay kumar. He is our modern day Canadian Indianised version of Manoj Kumar. Poor plot. Katrina Kaif still cannot act. Movie like Jai Bhim is like 10/10 and this one is not even 1/10. I stopped watching half way. Difficult to tolerate."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "abhishak-69193",
        "review_rating": "10",
        "review_title": "Awesome movie with a beautiful message unity",
        "review_detailed_main": "Great work, must watch movie. Akshay as usual done a fantastic job. And Katrina looks glamorous even though. R. Singh and ajay devgan cameo is more than a cameo role."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "kirtitrivedi-27937",
        "review_rating": "1",
        "review_title": "Pakau",
        "review_detailed_main": "Don't waste ur money.. Better boycott druggie Bollywood.\n\nThese few old age actors think thy r owners of Bollywood.. They want more and more money.. Only they can work and no newcomer would ever get chance."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "padmashripanda",
        "review_rating": "10",
        "review_title": "Enjoying and action packed movie!",
        "review_detailed_main": "The movie is fantastic & a together family watch movie ! It has comedy , romance and the best action packed scenes!! Rohit Shetty's direction proved it again , that it is the best one ! I really loved it and I would love to watch it several times !! Good job done by all the characters in the movie!"
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "aakaashmehra",
        "review_rating": "1",
        "review_title": "Canadian Actor Again with Worst Acting Skills",
        "review_detailed_main": "Canadian man (Akshay Kumar) have most disaster movies in his film career. He is the man who get National Award for worst movie Rustom and Amir didn't get National Award for his Epic performance in Dangal. How pathetic is this. He get every goverment ads because he is accept BJP Dallagiri."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "tahnya110",
        "review_rating": "3",
        "review_title": "Hindus will love it",
        "review_detailed_main": "A pro Hindu movie made my Hindus to as usual make Muslims look like creepy weapon wielding terrorists.\n\nAkshay Kumar looks like an old prune in a tried and tested clichéd hero (Hindu police man) vs villain (Muslims) movie with no unique plot or climax.\n\nDefinitely a pass. Unless you're an Indian nationalist anti muslim Hindu. Then you will love the movie."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "msunando",
        "review_rating": "5",
        "review_title": "Action getting the better of the content",
        "review_detailed_main": "Sooryavanshi starts off with the right intent, pace, narrative and sentiment. The backdrop is the 1993 serial blasts in Mumbai, and the masterminds giving the cops a slip, but leaving a live imprint behind - if 400 kg RDX were used for the blasts, where are the remaining 600 kg? Fast forward to 2007, 40 Lashkar operatives from Pakistan sneak into India and commerce sleeper cells all around the country, awaiting instructions from the chief Omar Hafeez (Jackie Shroff) to start another siege. Advance to the current day, Bilal (Kumud Mishra) the key mastermind of the 1993 blast returns to India via Maldives, releasing the cache of the 600 kg RDX from an inconspicuous house in Sawantwadi, and activates the sleeper cells, under the leadership of Riyaz Hafeez, Omar's son, swearing to burn the nation down. Riyaz has another axe to grind with the Mumbai Police, to avenge the death of his elder brother.\n\nDSP Veer Sooryavanshi (Akshay Kumar) is the supercop with the ATS leading the Intelligence Bureau inputs. An experienced, successful and time tested policeman, Veer meticulously follows through in his swashbuckling style to thwart the destructive attempt. He isn't alone in the fightback, and is ably supported by the NSG, Singham (Ajay Devgn) and Simbba (Ranveer Singh) in this all out action adventure.\n\nThe first half is absolutely stunning. It has the elements of making a well researched, credible and blindingly fast blitzkrieg that makes you sit up. The second half unfortunately has a typical Rohit Shetty film written all over it, and literally tears down, systematically, everything that the story had built up. It turns into an average Bollywood potboiler, with chest beating supercops, overflowing machismo and adrenalin, and mindless, endless action and spraying of bullets from all sorts of machines possible. Starting from NSG helicopters airlifting vehicles laden with RDX, and terrorists laying siege of the ATS headquarters blow the original content into impunity. Add to it some repetitive and jarring comedy about Akshay Kumar's \"disease\" of forgetting names, a lamenting widow's sermonising Katrina Kaif about holding the family together when the former's husband's pyre is burning and a contrived reason behind Katrina taking her young son to \"safety\" from his father make Sooryavanshi's second half rather laughable. Honestly, the serious buildup of Sooryavanshi was decimated the moment Ranveer Singh's Simbba swung into action, and then on, the film almost unstoppably hurtled downhill."
    },
    {
        "movie_id": "tt9531772",
        "movie_name": "Sooryavanshi",
        "movie_rating": "5.9",
        "review_username": "lovekumar-69736",
        "review_rating": "10",
        "review_title": "Blockbuster movie",
        "review_detailed_main": "Sooryavanshi Blocbuster movie Osm Acting Akshey Ajay Ranver Osm Comedy With Action movie Heart touching Movie Sooryavanshi And Movie is Story Osm All are Very Good."
    }
]