[
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "BA_Harrison",
        "review_rating": "4",
        "review_title": "Bigger doesn't mean better.",
        "review_detailed_main": "I've been a big supporter of writer/director Tom Six and his taboo-busting Human Centipede films since the beginning: I rated the first film 8/10, and gave the jaw-droppingly twisted sequel 9/10. The only reason I didn't give Part Two full marks was because I believed that Six still had a few tricks up his sleeve and would probably surpass himself with his third film.\n\nAs it happens, I was wrong.\n\nAs far as the controversial content is concerned, the film delivers numerous scenes that live up to Six's notorious reputation, kicking off with some sexual abuse, before proceeding to serve up such sordid treats as the torture of a prisoner with pans of boiling water, a nauseating castration scene, the insertion of a gun barrel into a man's stoma, the consumption of human testicles and dried clitorises, some wound-rape and coma-rape, and, of course, the creation of not just the biggest human centipede yet, but also a human caterpillar, the surgical process for both depicted in graphic detail.\n\nBut while the film doesn't wimp out on the deviancy, it does suffer from two major problems that make it a very unsatisfying experience overall. The first is the prison setting, which is so implausible that it renders the whole movie utterly ridiculous. The first two films, while unlikely, were at least vaguely plausible: it was possible to believe that a raving lunatic might try to stitch a few folks ass-to-mouth out of curiosity, but the notion that the head of a large correctional facility could do the same, with the co-operation of his staff, is absurd in the extreme and seriously detracts from the film's overall effectiveness as a shocker. Even when viewed as a black comedy, it's still a dumb premise.\n\nThe second issue I have is with Dieter Laser (the actor who played Dr. Heiter in the first film): his performance as sadistic warden Bill Boss is hugely irritating, the guy drawing out every single syllable at the top of his voice to the point where I would have liked to have seen HIS mouth sewn to someone's ass just to shut him up. Laurence Harvey (bug-eyed star of the second film) is also crap, but at least he's not quite as annoying. Both guys are out-acted by porn-star Bree Olson, who is also a whole lot easier on the eyes.\n\nIf the subtitle 'Final Sequence' is to be believed, this film sees an end to the Human Centipede series; it's a hugely disappointing way to wrap things up. Let's hope that Six's next film sees the director back on form: we need something to flush away any memories of this rather obnoxious mess."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "dtwmstewart",
        "review_rating": "2",
        "review_title": "Anticlimactic",
        "review_detailed_main": "I was genuinely expecting more of the same. A horrific and disturbing body modification style horror but I actually found myself becoming bored with the incessant and insipid screaming of Dieter Laser and the profoundly bad acting of Laurence Harvey.\n\nThe First two movies were polemical and somewhat uncomfortable to watch. They were disturbing and, in many ways, were unique.\n\nThis final installment was just annoying to watch. It did not shock and the actual, 'centipede' part didn't even happen until very late in the movie.\n\nThis movie was a massive let down and the radical departure from the stylistic form of the first two movies ruined it in my eyes.\n\nLet us hope this really is the last sequence."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Theo Robertson",
        "review_rating": "2",
        "review_title": "Let's Hope It Is The Final Sequence",
        "review_detailed_main": "Bill Boss the warder of a tough maximum security prison watches the European art house black comedy films involving the human centipedes and invites the films director Tom Six to see how viable this would be in real life\n\nI can't say I was a massive fan of the original HC . I missed out on the sequel and only watched this one because I had the opportunity of seeing it free and contains the bizarre casting of Eric Roberts and former porn star Bree Olson. On top of all that there seemed to be a meta-fictional aspect of director Tom Six playing himself and the trailer looked good . What's wrong with investing a couple of hours in blackly comical horror ?\n\nWell to be fair the trailer is accurate in a way of \"Meglomaniac abuses power and really pushes the boat out\" but the execution is dreadful . Dieter Laser looks totally camp in the trailer as Bill Boss and while the performance is bearable in a two minute trailer it's not in a feature length film . I can understand that he's not supposed to be taken seriously for a moment but that's not really the point as he shouts , squeals and uses lots and lots of swear words while inflicting violence on people . It's not satire we're watching but absolute farce and Laser becomes painfully irritating , so much so that you find yourself looking forward to Eric Roberts appearing if only to see a calm and reserved performance . Yes chaps you read that right - Eric Roberts probably gives the most calm , rational and realistic acting performance in the entire movie . I suppose you could also give Tom Six a back handed compliment in making a sequel that is a billion light years removed from the original movie but nothing about it really works and in cinematic terms it feels like a juvenile delinquent who wants to shock the adult world but just ends up looking silly . Take this insult:\n\n\"Not even the corpse of a spastic would want you . Now f--k off\"\n\nThat's probably the most witty line in the film and I've come out with funnier compliments throughout my entire life which hopefully says more about THE HUMAN CENTIPEDE III than it says about me"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "DarthVoorhees",
        "review_rating": "",
        "review_title": "If it's sole purpose was to troll mankind it is a masterpiece...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "stephendaxter",
        "review_rating": "1",
        "review_title": "If i believed in giving films a 0, this would rightly qualify",
        "review_detailed_main": "There are no words in the English language (that i can use here) that can accurately describe how utterly terrible, awful, and just downright dumb this 'movie' was. May i first ask who wanted this movie to be made? What? No-one? OK, THEN WHY ON EARTH DID TOM SIX DECIDE TO MAKE THIS Piece OF GARBAGE??? There is no way, any sane human being would believe that this was in any way imaginable a good idea. It has some of the worst acting i have ever seen in my entire life from every single person in this film and will someone tell Dieter Laser to STOP BLOODY SHOUTING EVERY DAMN SENTENCE LIKE WE ARE 100km AWAY, JEEZ. And on top of the god- awful acting it comes accompanied by the worst scripts in history, and a plot that made absolutely no sense whatsoever, in fact, there was no plot for 90% of this thing. This is 'The Human Centipede' right? SO WHERE WAS THE CENTIPEDE FOR THE FIRST HOUR AND 20 MINUTES??? I honestly do not know which was more difficult to sit through, the surgery (or lack thereof) or that piece of garbage that was the culmination of bad acting, writing, directing and everything else. There were a few times where the film showed signs of trying to be satirical and even self aware but it was so ridiculously dumb that by that point you just want to gouge your eyes out. I don't even know why i am still wasting my time talking about this when i just wasted an hour and 40 minutes of my life watching it. So here's the score and if you want to subject yourself to torture be my guest because i'm out. - 0.3/10"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "vlm00004",
        "review_rating": "1",
        "review_title": "Biggest s*** I've ever watched, and I've seen many",
        "review_detailed_main": "Let me be clear, I rated this movie with a 1 because 0 is not available.\n\nI actually liked (well, it had some good parts) the first one, and thought the second was terrible, but this final sequence was absolutely stupid, boring and lacked everything a normal and even a bad movie should have: SOMETHING INTERESTING.\n\nSeriously, I've watched several stupid movies full of sharks, octopuses and all that s*** and I've never seen a movie so stupid as this one.\n\nPS: Kudos to Tom Six for being capable of making both disgusting but interesting movies and also terrible and completely stupid movies. He sure has a gift. A stupid one, but still a gift."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "arfdawg-1",
        "review_rating": "1",
        "review_title": "HUGE Disappointment",
        "review_detailed_main": "The Plot.\n\nBully prison warden Bill Boss, leading a big state prison in the US of A, has a lot of problems; his prison statistically has the highest amount of prison riots, medical costs and staff turnover in the country.\n\nBut foremost he is unable to get the respect he thinks he deserves from his inmates and the state Governor.\n\nHe constantly fails in experimenting with different ideas for the ideal punishment to get the inmates in line, which drives him, together with the sizzling heat, completely insane.\n\nUnder threats of termination by the Governor, his loyal right hand man Dwight comes up with a brilliant idea.\n\nA revolutionary idea which could change the American prison system for good and save billions of dollars.\n\nAn idea based on the notorious Human Centipede movies, that will literally and figuratively get the inmates on their knees, creating the ultimate punishment and deterrent for anyone considering a life of crime.\n\nI LOVED the first two....especially the second which was really surreal.\n\nTrust me...this movie is horrible. It's made for three dollars and all it really can be distilled down to is a screaming pseudo Nazi.\n\nThere is no real plot like the first two.\n\nThe production values are way inferior as well.\n\nI was SO hoping this would be good.\n\nIt's not.\n\nIn the slightest."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "HarryPotterIsGarbage",
        "review_rating": "1",
        "review_title": "Jumped the shark with this sequel",
        "review_detailed_main": "If you've recently been introduced to the Human Centipede series, I suggest just checking out the first two movies and completely ignoring this 3rd installment. This one tried to be comedic, which is a major disappointment. Fans of this series loved the first two movies because they were very dark and twisted. Tom Six seems to not understand this and only wanted to make a comedic sequel just for the sake of it being \"different\". I've seen this happen with other horror sequels, and it never turns out well. The comedy itself was in bad taste.. as a few others have pointed out.\n\nYou know a movie is going to be bad when you have a porn star (Bree Olson) as one of the main cast."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "ryanb1238",
        "review_rating": "2",
        "review_title": "Avoid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bljonathan",
        "review_rating": "2",
        "review_title": "Migraine inducing boredom",
        "review_detailed_main": "The standard for torture porn isn't exactly high but it isn't so low that you can substitute being a passable well made film with torturing the viewer with boredom, which this final installment does.\n\nThe first two at least had some kind of passable narrative and were decently shot and edited. This on the other hand can't get the basics right. The acting is god awful. Its worse than just being flat because the main character, governor Hughes, yells out every damn line he has. Even after this it still somehow has the problem of NOT BEING ABLE TO HEAR/UNDERSTAND WHAT THEY ARE SAYING. The audio is pretty poor. The dialogue at times is muffled by the soundtrack, which is pretty pathetic. How long is the film? 2hrs and 20 minutes! If you are going to make a piece of crap then at least make it 1hr and 30 max.\n\nSo what about the \"plot\"? Governor Hughes is shown the first two films first thing in the film. You would think that the main character, Hughes, a over the top Texan loudmouth psychopath who abuses his prisoners, would get the idea that he has been shown the film because his accountant wants to do it for real. Nope. Instead we have a long drawn out tour of the prison. There is though a decent message to the film about the state of prison abuse and the contempt of the Americans to actually care. Sadly it beats you over the head with it in the final 20 minutes of the film.\n\nAs for the gore there are two decent scenes. There is a waterboarding with boiling water and a mutilation. I would not watch the film just to see those scenes simply because it is surrounded by 2 hrs of yelling and boredom.\n\nHuman Centipede is a sad, and surprisingly tame and boring, end to the series."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "moviesmaniax",
        "review_rating": "4",
        "review_title": "The taste will never leave your mouth // instagram: moviesmaniax",
        "review_detailed_main": "\"The taste will never leave your mouth\", don't eat anything while you watch this, you have been warned. This was one of my anticipated horror films of 2015 and I must say I was really disappointed. With the film's big premise and ambition, it turns out to be ultimately dull throughout with little entertainment here. The film is filled with perversely sick moments, immaturely psychotic performance, and shocking GORES that's intended to make you puke and gross you out instead of making a gleefully enjoyable one to watch. One of the main problems here is the performance of Dieter Laser which make him looks like Marlon Wayans going pull psycho which is amusing to watch for like 5 minutes and the rest is just childishly annoying and just dull, making the film laughable and looks like a parody of itself. Another problem is how the story drags out and we have to sit through the whole psychotically dull act and vulgarly racist dialogue before the final sequences happen which is nothing that surprising since most of them are already shown in the trailer. Overall, The Final Sequence is crude, vulgar, perversely sick, over-the-top in its violence and chessily insane performance, yet still ends up too dull to enjoy even for the fans of the genre.\n\n>>C-<<"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "elsa-62973",
        "review_rating": "10",
        "review_title": "A \"not for everyone\" funny comedy horror",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "in1984",
        "review_rating": "7",
        "review_title": "Tongue-in-cheek Gore Horror",
        "review_detailed_main": "7.5 of 10. Picking up where the other 2 films left off, but not as a literal sequel. There's an unexpected side-step as the filmmaker decides to both make a new centipede film and change the setting and plot. This is definitely more over-the-top and humorous than the straight out gore and psychological horror of the other 2.\n\nIn the end, that makes it a smarter, more enjoyable film for those looking for more than a film testing their ability to watch through the most painful, gruesome, and disgusting scenes.\n\nTom Six steps out from behind the pen and camera to become an active character in this film to both openly acknowledge his fame and to create a sense that this is actually happening. Like the other films, the ending definitely isn't happy. It is, however, consistent with the earlier films and bizarre enough that it should please those seeking the horror/gore originality that probably got them to watch it initially."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "fthurston-29424",
        "review_rating": "1",
        "review_title": "So, so disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jackmeat",
        "review_rating": "4",
        "review_title": "Interesting way to make sequels, but still just bleh",
        "review_detailed_main": "My quick rating - 4,1/10. Don't listen to any nonsense about how violent/gore filled this is. It just isn't. The movie leads itself to being a sequel within a new movie premise taken a step further from how part 2 was to 1. Kudos to Tom Six for making sequels that don't follow the traditional role, but smack him at the same time for being so pretentious to think a film fan won't see right through his arrogance. Multiple scenes of what Tom considers humor point this out entirely by being long, drawn out scenes with Deiter Laser (Bill Boss) acting like a complete jackass overacting a joke to the point that would make Jim Carrey cringe. Basically the story in a nutshell (about all you need) is a deranged prison warden (Laser) decides at his last straw to use the ideas from the Human Centipede movies to punish criminals and deter further offenders to ever break the law. This revelation is made when the governor (played by, wait for it, Eric Roberts) gives Boss 2 weeks to get his prison in order. What better way then take all the prisoners and sew them ass to mouth together, right? Anyway, back to the gore, a scene or two MAY have been considered \"gross\" years ago, but there is nothing to raw at all. Some of the humor is quite funny in a very dark way (his idea of health food is one of them) but the overshadowing of the poor acting is a deterrent (in other words, yes, it is a b- budget movie BUT it was so painfully obvious the actors were purposely acting bad to become a b-budget movie) So again the numbnut,Tom Six, thinks he is outsmarting the audience with this backasswards attempt at laughs. These laughs tend to come more from suggestion and the cheesy attempt at being an exploitative film(women should love a secretary named \"Tits\") All and all, it has the pros but is to outweighed by the cons. Good news, it was only supposed to be a trilogy, so we may be spared of another one."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "gooooogleisevil",
        "review_rating": "2",
        "review_title": "100% Medically, and Even More Intellectually Full of S***!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Sleepin_Dragon",
        "review_rating": "1",
        "review_title": "Please invent a way to unsee a film",
        "review_detailed_main": "I want to make it clear, this was not a film of my choice, friends put it on and I was made to watch it. I didn't like the original, not because it was badly made, it just ain't my bag.\n\nFor the first time I intended to give a film zero out of ten, but as I can't do that it gets a one.\n\nIt's actually not particularly scary, I didn't find the subject material as sickening or gross as the first one, it's actually a really boring film, lots of shouting and screaming. Why did it need to go on for so long.\n\nI've never been the greatest fan of Eric Roberts, I think he's poor in it, but Dieter Laser is dire, he's so bad it's almost as if someone bet him to ham it up as much as possible and take the P**S.\n\nBest bit of the film, the final credits, on par with a driving test, agonising!!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "danfiorante",
        "review_rating": "1",
        "review_title": "Rewatch Salo because there is nothing redeeming about this iteration",
        "review_detailed_main": "What can only be described as the directors best attempt at a Pink Flamingos inspired exploitation film centered around his brainchild franchise. It's juvenile, bloated, the dialog is almost so unintelligible that one could imagine there was no script at all and the actors instead improved their way through the meandering plot that makes true B films like the Room seem like a summer blockbuster by comparison.\n\nIf you want gore, watch martyrs, Salo , a Serbian film, etc. They have accomplished this in a much more refined, intelligent and coherent manor with a plot that stands on its own.\n\nIf you want gross out camp, watch any of Waters films.\n\nIn closing, I can't really say outside of boredom and curiosity that there is a reason to watch this. Although, if their aim was to create a movie you would never recommend to anyone, well, they've hit their mark.\n\nEdit: For those wondering, I actually liked both predecessors, with the sequel being my favorite. This one however .."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Platypuschow",
        "review_rating": "3",
        "review_title": "The Human Centipede III : Well it was certainly memorable",
        "review_detailed_main": "The first Human Centipede movie had a certain novelty factor about it. It was meant to shock and it succeeded, thus making it somewhat watchable.\n\nThe second was a disgusting mess with no redeeming features and would likely be in my bottom 100 movies ever made.\n\nThis, is an odd creature.\n\nSo the antagonists from both previous movies return, but they both play different characters! In the second movie the first movie was made out to be exactly that, just a movie. In this one both the first and second are supposed to have been movies.\n\nStill with me?\n\nAdding an element of humor this third part is undeniably memorable but not for the right reasons. It aims to shock once again and pulls out all the stops in doing so.\n\nCredit where credit is due, the lead takes the character and makes it his own and saves the film (To an extent). The Human Centipede III is disgusting, and there is barely a story but it has moments that are very hard to get off your mind so it at least succeeds there.\n\nNot for the faint.\n\nThe Good:\n\nDieter Laser certainly makes for an interesting character with Billy Boss\n\nThe Bad:\n\nShock for the sake of shock\n\nNo real storyline"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Robborg2003",
        "review_rating": "2",
        "review_title": "Very disappointing waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "cyberknight",
        "review_rating": "1",
        "review_title": "I laughed out load, once!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "marmak9384",
        "review_rating": "10",
        "review_title": "Nothing like the two previous movies",
        "review_detailed_main": "OK I gave an excellent to this film and I will justify my opinion. Having seen the two previous human centipede movies I expected something similar in this movie, just a bigger centipede, but NO! That wasn't actually the case. There was an actual plot, a story, great characters and one hell of a performance from Bill Boss! Yes there is sickness and violence but come on I mean if you're not into those things you are not going to watch a movie called the human centipede go watch something else. There was plenty of dark humor and it was very well directed. If you just step out of the attitude 'ewwww that's gross ' you'll see that it's actually a good film of its KIND! I don't know about you but I'm kinda tired of watching the same old college- students-lost-in-the-woods-killed-by-a-maniac films. Well done."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "izay142",
        "review_rating": "6",
        "review_title": "100% Politically Incorrect",
        "review_detailed_main": "The Human Centipede was shocking in concept alone, not to mention filmmaker Tom Six's unflinching approach to the actual acts. It arrived at the tail end of an era of torture porn horror films, including the final entry of the Saw franchise a mere six months later, but took the genre in a new direction with the inclusion of a mad-scientist angle. Dieter Laser chewed the scenery as Dr. Heiter, carrying out an experiment that Six still insists to be 100% medically accurate.\n\nIf The Human Centipede was shocking in concept and followed through with execution, the sequel somehow managed to increase both creativity and shock value. The Human Centipede II (Full Sequence) has moments of absolute brilliant excess in the actual nitty-gritty of the film's abuse and degradation under the thin pretense of medical experimentation, but the real genius comes in the actual concept of the movie's plot. Rather than keep the same villain from the first film, the sequel is about a nearly mute psychopath named Martin (Laurence R. Harvey), whose obsession with The Human Centipede film leads him to carry out his own makeshift experiment. This time around, the promise was for carnage that is 100% medically inaccurate.\n\nHere's where things get tricky; now I have to review The Human Centipede III (Final Sequence) having already explained that the first sequel doubled down on both creativity and shocking gore. Anyone who has experienced the first two films will first and foremost want to know if the film manages to top the prior two. The answer is yes, but not in the ways that you would expect, and likely not the way most horror fans would have hoped. In terms of shocking sequences, The Human Centipede III comes nowhere close to the previous installment. On the other hand, this is the most striking in terms of political and social satire, fittingly given the tagline \"100% Politically Incorrect.\" And the film still has its hand at excess, though this time it comes in the form of Dieter Laser's delightfully over-the-top performance.\n\nFor the rest of the review and more visit www.rizayreviews.com"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "samgellard-83556",
        "review_rating": "5",
        "review_title": "Weakest in the trilogy but a decent watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Howling_at_the_Moon_Reviews",
        "review_rating": "2",
        "review_title": "Sitting through this was the real torture",
        "review_detailed_main": "All right guys, I literally never do this... in fact, I have NEVER done this... but I absolutely hated this movie (and I did not feel this way about the first two)\n\nNot even 10 minutes in and it was so wildly cringe I wanted to erase it from the face of the earth, let alone just my tv screen. It was this weird mix of a wannabe Mel Brooks movie, a soft core and an awful Troma movie. Honestly, it was just all around irritating with it's incessant yelling and melodrama.\n\nThe script was bad. The acting was bad. The concept was tired and silly. I thought that the warden did good as the doctor in the first movie, but this was just... insufferable. His delivery was... well, out of this world... quite literally. It was like an alien trying to poorly imitate the human inflection. It got to the point where it was almost incomprehensible.\n\nEverything they were attempting to do with this movie stylistically was apparent... I understood the schtick and the vibe, but it was wildly unsuccessful. To be quite honest, to date, this is the worst movie I've seen. Again, I've literally never said that. The only good part about this was inmate 297 just cause he was kinda hot lol\n\nAlso, as a side note, there's nothing cool about superfluously throwing around the n word for no apparent reason either.\n\nThe only reason I finished this movie was because I think it's unfair to write a review on a movie that you didn't complete... but dang...and the fact that I had to sit through this for almost 2 hours is an actual crime. All I can say is I hope they enjoyed the process and had fun on set. 1.5 rounding up to a 2 because... it was literally a completed film. That's it. Would not recommend."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jboothmillard",
        "review_rating": "5",
        "review_title": "The Human Centipede III (Final Sequence)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Could Dieter Laser be the worst actor in history? Perhaps...but his performance as the Warden is clearly the worst performance I've seen in years!",
        "review_detailed_main": "I have an unusual hobby. I like to occasionally watch horrible films, as I find many of them unintentionally funny. Because of this passion, I have seen every movie in Harry Medved's \"The 50 Worst Movies\" and nearly all of IMDB's infamous Bottom 100 list. However, of all these bad films, one I simply could not bring myself to finish was \"The Human Centipede II\" as I found it so overwhelmingly disgusting, stupid and awful that I simply couldn't finish the job. This made my watching \"The Human Centipede III\" something I really did NOT look forward to doing! Should I have paid more attention to my brain and simply refused to see this third film? To put it bluntly...yes.\n\nWhen the film begins, you can't help but marvel at Dieter Laser as he plays the crazy Warden. I couldn't believe how bad an actor he was and what a horrible performance he could give as this very, very stupid character. Warden Boss is like a cartoon character....so evil he's utterly ridiculous. He overacts constantly and is so dumb and awful you just need to see and hear him to believe it! Additionally, his heavy German accent simply made it sound as if he'd JUST learned English a few minutes before attempting this role! Is he completely to blame? No...the writer and director must own some of this as well, though I strongly suspect they were penguins as I cannot imagine a person directing or writing THIS poorly. His character is 100% sadism and 100% stupid....to the point where he becomes tedious....and dumber than Tor Johnson in \"Plan 9 From Outer Space\"!\n\nOverall, this movie was SLIGHTLY less disgusting than the prior film but the utter stupidity of the script and Laser put it in a class all by itself. I would clearly place this in a list NOT of the worst 100...but worst dozen films ever made. It' THAT bad...that pointless...that offensive...and that amateurish. A truly awful pile of dog vomit of a film...with a loud, brash, obnoxious no-talent leading it all in the form of Warden Boss!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "hannahsutcliffe",
        "review_rating": "1",
        "review_title": "Appalling",
        "review_detailed_main": "This has to be one of the worst movies I have ever seen...and I have seen a lot of terrible movies. First of all, the characters are all completely unlikely, so as an audience, we do not care what happens to them one way or the other. Secondly, most of Bill Boss' dialogue is yelled instead of spoken. This makes it both extremely annoying and inaudible (I actually had to put subtitles on to understand what he was talking about). Don't even get me started on the forced, fake American accent the accountant put on throughout this shocking excuse for a film. Seriously, what was all that about? I like gore in a movie. I do. I am a horror movie addict, but even the scenes of torture were not even scary. Maybe I'm just desensitized now, but I just found the first 'Human Centipede' to be much sicker. So disappointed in this movie - DO NOT WASTE YOUR TIME!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "ur1bro",
        "review_rating": "1",
        "review_title": "Vile",
        "review_detailed_main": "If you like puking up your popcorn while watching a movie, this might be right up your alley! There is nothing even remotely good or horror related about this movie! It is a horrible film, but hardly justifies as a 'horror' film. It is nothing more than plain filth! The writers or creators of this garbage should be ashamed of themselves."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "onelifefreak",
        "review_rating": "5",
        "review_title": "My Review on The Human Centipede 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "FlashCallahan",
        "review_rating": "2",
        "review_title": "And Pythagorus called Three a noble number.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "silvergun",
        "review_rating": "9",
        "review_title": "A brilliant Dark humoured Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "SushiStoner103",
        "review_rating": "7",
        "review_title": "A Massive Pile Of Sh*t (Pun Intended)",
        "review_detailed_main": "This Film is a violation to cinema. Director Tom Six presents the third installment to the repulsive franchise (The human Centipede) fingers crossed it truly is the \"final sequence\". It's offensive at all measures, unforgivably insane and transparently foolish. This film rebelliously dismisses the boundaries of film-making and goes overboard purely for shock factor. Dieter Laser's performance was unnecessarily over the top and gave me a headache, however his insults were priceless. There were no character developments resulting to thin emotional attachment towards the leads, but that's obviously Mr. Six' intent as he only cares about its obnoxious content which still lacked fluency and substance.\n\nThe cinematography was descent but seemed like it was heavily inspired by Robert Rodriguez' style. The practical effects were extremely realistic and the lighting really set the tone which promoted the environment. With these few excuses of my 3/10 rating out of the way, what annoyed me most about this film besides its shameful acting, and crummy direction. Is the fact that Tom six proves to me how cocky a film-maker can become, he plays himself in this excuse of a film and there are literally scenes where characters praise his previous movies and asks for his autograph, like SERIOUSLY?\n\nThis film is like a bad hangover, it leaves an unforgettable after taste of discomfort and dread. The unintentionally hilarious dialog is its saving grace but at the same time it's no way near forgivable for its constipated plot and pacing. This film takes everything the previous films left out and gives them laxatives and then splatters them onto the screen, is this what you call art Mr. Six, take a good hard look at your career and tell me if you're proud to put this on your resume? After my viewing I brushed my teeth twice and had a long shower. A terrible movie in terms of entertainment and quality, at all costs stay away.\n\nFinal Rating (Popcorn Metre) 9%"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "tv2-434-370475",
        "review_rating": "",
        "review_title": "Interesting series ends with a whimper",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "tjstiller",
        "review_rating": "2",
        "review_title": "Tom Six - The Poo-Poo Bandit",
        "review_detailed_main": "Dieter Laser does not disappoint completely, but Tom Six does. He lied to us. I expected depraved evilness; instead, he delivers \"shitty\" comedy. The actors tried hard as possible, but how great can a movie be that makes a throw back to the first two movies every four minutes. The first two movies are classics, but this one is worse than Jason X. Jason X makes fun of itself, but at least shows some decent gore.\n\nIt would be better to be left in the middle of the human centipede at the end of the first one than to have to sit through this movie again.\n\nMaybe now that we watched this movie we can volunteer at a nursing home or soup kitchen, just to know own human existence is more than one disappointing Tom Six movie."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "MattBrady099",
        "review_rating": "2",
        "review_title": "Sick and dull",
        "review_detailed_main": "As I said before my curiosity is my true enemy.\n\nThe story in this third entry of the Human Centipede series, with returning stars Dieter Laser and Laurence R. Harvey banding together as a new villainous duo aspiring to connect over 500 human bodies together.\n\nDo any of you remember my review of The Human Centipede 2 where I said I'm not going to watch the other one just because I was that grossed out and angry at the time, and I also didn't know they were making a third movie at the time of that review. I just found out a couple of days about this movie and how it was the final which I had the thought of \"Oh god I'm going to watch no matter what I'm I\", and I sure did. I know some of you are thinking \"Matt why on earth would you watch this movie since you hated the last two movies and what are expecting from this disgusting film series\". I know I should know better and I originally had no plans on seeing this one since I still think the second movie is the worst horror movie ever made, but since I already seen and review the first and second movie I thought to myself \"Why not finish this horrible franchise of torture porn\". These no surprise this movie sucked big time but what really surprise me is how boring the movie is.\n\nI hate the fact that this movie is self aware of the others movies as the character's watch and talk about them and how they look like them even when it's the same actor. The other thing that really grinds my gears while watching this movie is how the character's treat the movie director Tom Six (Yes he's in this movie playing himself) like a god to film making, even when he's not and he's just another Eli Roth clone.\n\nDieter Laser makes a return in this movie and his acting in this movie is so over the top crewing up the scenery that it got to the point that it annoyed the crap out. His character in the movie is so annoying I mean oh my god although the movie he never stops yelling and he was being a total tool to everyone around him. I mean every scene this guy is on he's always screaming, knocking things over and yelling on the top of his lungs and it really got on my nerves to the point were I turned down the volume just to enjoy the silence.\n\nThe whole movie is deep inside and out ugly just ugliness. Everybody in this movie is awful human being and how this movie treats women is unspeakably awful.\n\nNow Human Centipede 3 isn't as horrid or disgusting as the second movie I mean I almost throw up watching that movie. Yeah you get your graphic and gory violence in this one, but this time I didn't feel the need to throw up and take a shower every minute like the second made me do.\n\nOverall The Human Centipede 3 is a dull mindless Peace of sh*t gory feast that only sick in the head people would find enjoyment."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "nboyle11",
        "review_rating": "1",
        "review_title": "I don't even know",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Stevieboy666",
        "review_rating": "2",
        "review_title": "Utter poop!",
        "review_detailed_main": "A mad prison warder (Dieter Laser) is talked into creating a huge human centipede by his twisted accountant (Laurence R Harvey). Both of these characters are truly awful, and both of them are played by truly awful actors, I found them to be near unwatchable. The temptation to hit the ffwd button was great. The first movie was incredibly twisted and unoriginal, yet very light on gore. With part 3 Tom Six goes for comedy and gore, but jokes about such things as female circumscim aren't very funny. The film clocks in a around 100 minutes but there's no centipede until the last 10. This film is awful, the reasons why I'm scoring it 2 and not 1 out of 10 is that there is some good gore, plus it has Bree Olson and Eric Roberts in the cast (I bet he keeps quiet about this one!) I hope this is the Final Sequence. Abysmal."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "FollowtheWolves92",
        "review_rating": "1",
        "review_title": "Easily in my Top 5 Worst Films of All-time.",
        "review_detailed_main": "Let me start off by saying i actually thought the first 2 Films were decent (Second one being the best) so i was fairly excited to see what kind of twisted ideas Tom Six had lined up for the final film in the trilogy. But then when i heard it was going to be a comedy i thought: \"This can't end well\" and my suspicions were right, not only was it not funny, but there was no aspect of this film that was enjoyable at all. The Acting is bad. Dialogue is awful. Writing is overall horrendous.\n\nThe thing i hated the most about this film was the main-character, i could not understand a word that he was saying because every single word that came out of his mouth would be him shouting at the top of his lungs.\n\nCompared to the second film, this one is pretty tame in terms of gore/violence so don't expect it to top the second.\n\nIt's a shame because it could have been a decent trilogy and would have been fun to marathon with some friends...but alas. So all-in- all, give the first and second a chance because they are pretty decent and original films but just make sure you skip this abomination."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "flicklover",
        "review_rating": "1",
        "review_title": "I was begging for it to end!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "videorama-759-859391",
        "review_rating": "1",
        "review_title": "The worst centipede of them all",
        "review_detailed_main": "This is it. This is the one you've been waiting for. Not such a disappointment. No. One of the worst movies I've ever seen, and the worst of this sick franchise: Yes. There are many sick moments for you sick gore hounds who crave sick guilty pleasures, one, the first or second bloody moment, ala Zero Dark Thirty, only with hot water. The story almost has you, dangerously contemplating on whether performing the practice of joining 500 violent unruly prisoners, head to bum cheek, forming the biggest centipede yet, would work in the real world. But it would have some prison guards heavily contemplating this too. But this is totally inhuman, where here's a prison that's way understaffed, inundated with bedlam. But hey, this is a movie, and quite a sick depraved, repellent one, where our leads, from the previous two return. The man running the show is (Laser HC1) who's consistent and inane shouting, really got on my goat, the truly most annoying thing, may'be the only annoying thing in this film. Playing the assistant governor, is (Harvey HC2) donning a Southern accent, again, playing a pathetic pitiable character. And we have a hot female blonde receptionist with big jugs, who sternly obeys Governor Laser's commands, mostly of sexual services and whims. Eric Roberts is wasted as a visiting governor. This third centipede may not be as bad as you expect it to be or not. There are predictiabilities in plot, as in Roberts change of heart, and Laser's betrayal in the finale. What we're left in with the Human Centipede 3, besides 500 pi..ed off actors with bad backs, act are a lot of tasty sick instances in a mess of a film . Even director Six, gets in on the act, playing himself, but throwing in quite a good performance as himself, the film maker, seeing at first hand, if the operation of 500 bad buns joined together, will work. This was the part they left too late of the movie, where there wasn't blood shed here."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Dodge-Zombie",
        "review_rating": "5",
        "review_title": "The shouting spoils it.",
        "review_detailed_main": "This could of been a better film had it not been for all the shouting. I mean it's still just trying to be shocking but at least attempts some humour.\n\nProbably the worst acting and effects of the 3 movies.\n\nHowever I suspect it would be easier for some people to watch than the second movie."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "mrgums-87207",
        "review_rating": "10",
        "review_title": "This movie is the embodiment of disgusting",
        "review_detailed_main": "I'm only giving a 5/10 for this movie because of Dieter Laser. This movie is raunchy and only really made for shock value, but Laser's performance is so funny. It's the only thing that makes this movie watchable. He's over the top crazy, and vulgar, yet his performance is just honestly hilarious. I really bet his throat hurt making this movie because all he does is scream. This movie definitely isn't for the faint of heart."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "xilourikia1984",
        "review_rating": "7",
        "review_title": "Spit on your democracy...",
        "review_detailed_main": "Tom Six made a brilliant movie! He mocks the western world, how we're shutting our eyes to the people drama, Africa, Islam, China, Mexico etc. We don't care about the worlds real drama, we just want it to be covered so we can continue our fake happiness. It's not horror,it's black comedy. You got 7/10 from me. I saw from the other reviews that no one heard your scream, Dieter Laser's scream was yours, about the injustice. They know... See the movie people, don't get confused by the superficially reviews that don't understand the deeper meaning of this movie. Well done Mr Six, you made a masterpiece! Greetings from Greece, spit on the fake democracy of rich leaders that don't care if we live or die."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "papadopoulou_elen",
        "review_rating": "1",
        "review_title": "Just wasted 1,5 hour of my life",
        "review_detailed_main": "Unfortunately for me, I have not seen the first two movies. Therefore,I had no idea what this movie would be like.\n\nNonetheless I was somewhat prepared (thanks to the title and the poster) for many gory disgusting scenes.\n\nLittle did I know; this movie made me feel sick and bored at the same time. There was no plot whatsoever, the actors' roles were simply frustrating, and the only feeling that emerged at the end of the movie was anger (1,5 hours of my life wasted) and disgust (contemplating how twisted a man's mind can be depicting such \"beautiful\" ideas)..\n\nI searched for symbolic scenes and hidden meanings, through cheeky humour and absurdity, but unfortunately I was incapable of finding any.\n\nThe only thing I managed to gain from this movie, was that I just stretched my patience's limits.."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "rancill",
        "review_rating": "4",
        "review_title": "Really?",
        "review_detailed_main": "This film is an insult to fans of the first two films. I have waited for this to be released for a long time and it was only shown in two cinemas in Melbourne I managed to get along to the Belgrave screening were Laurence Harvey was appearing best bit about the night! It seems to me this movie was made as a cash in as the main character was so over the top it was almost laughable did Tom Six appear just to be part of the fun? The first centipede film was OK an original idea well done. The second centipede was great a good idea taken to its logical conclusion and really unsettling . The third? I really couldn't see the point other than shock value but by the time anything happened I was sick of all the nonsense that was being said. If you have not seen either of the first two films it would be a good idea not to start here. This film was a big disappointment to fans of the first two films. Human centipede two is the best!!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "esteban_dm2",
        "review_rating": "1",
        "review_title": "Pure disgusting crap",
        "review_detailed_main": "Just stay away unless you want to complete bottom rated movies ranking or something like that. This is worst quality sh\"t ever made. And coming from me, who enjoyed the first installment, alright. Here is a new low as repulsive cinema is concerned.\n\nSo you are warned."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "StevenFlyboy",
        "review_rating": "1",
        "review_title": "Part 3 is as stupid as part 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "MikeRydal",
        "review_rating": "5",
        "review_title": "A feel-good romp if ever I saw one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "trashgang",
        "review_rating": "3",
        "review_title": "only a 3 for some gory shots",
        "review_detailed_main": "4 years we had to wait to see part 3 in this shocking franchise. The whole horror world was talking about part 1 and they were right, it was shocking and disturbing in so many places. The second part did go a step further and delivered the goods as it should be, excellent stuff.\n\nBut what a let down is this part. The only thing we get is an annoying leading role who talks a lot and really isn't funny or frightening at all. I was waiting to see the horror coming in like the previous parts but it never came. Never ever did i liked it, sure, here and there we do have some horror and gory moments but that doesn't make a good flick. The centipede is there at the final of the flick but you really have to wait over an hour before it's made and even that isn't shown. Only one face being stitched to one's ass that's all.\n\nMaybe for some Daisy (Bree Olson) will be worth checking out, voluptuous blond coming out of the XXX genre and doing what she does best, looking sexy.\n\nPart 3 is just boring as hell, doesn't deliver a thing, what have you done Tom Six? Is it asking to be attached to a human centipede??\n\nGore 1/5 Nudity 0/5 Effects 2/5 Story 0/5 Comedy 0/5"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bluntbuff",
        "review_rating": "2",
        "review_title": "Final Sequence of the previous two films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "samuel_legassick",
        "review_rating": "1",
        "review_title": "Watch Reactions Here - Also Review",
        "review_detailed_main": "I hated it. This is why: Review here: http://www.thewildbore.com/2015/08/human-centipede-3/\n\nWatch us watch the film here: https://www.youtube.com/watch?v=-Q02s1xaCag\n\nSafe to say I really, really didn't like it - and I liked the first two!\n\nWhen you make one of the most talked about horror films in recent times, then once you hit the third instalment there's always an expectation. In director Tom Six's case, this doesn't necessarily mean an improvement in quality, instead it's how far can he push the boat out and really disgust his audience. Unfortunately with Human Centipede 3, he fails on all fronts."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "kelleydschick",
        "review_rating": "10",
        "review_title": "Full pede",
        "review_detailed_main": "I just gotta say that ol dude went full pede.. buff said"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "sol-",
        "review_rating": "6",
        "review_title": "Prisoners",
        "review_detailed_main": "Whereas the first 'Human Centipede' was mostly just about pushing boundaries, the second chapter was delightfully self-referential, focused on a character inspired to create his own centipede after watching the first movie. With 'The Human Centipede 3', writer- director Tom Six takes this self-referential angle even further, focusing on prison staff inspired by the first two movies who invite Tom Six to supervise their construction of a real prisoner human centipede. Dieter Laser - who was the lead actor in Part 1 - is the prison warden and has several amusing lines as he declares that the first two 'Centipede' films \"stink\" and calls Six \"an infatuated toddler\". Six's cameo is a lot of fun too; same goes for his choice to retain Laurence R. Harvey playing a totally different character. Six trips up though by giving Laser free reign to go as over-the-top as he likes as the warden, driven insane by heat. It is a distracting exaggerated performance and one that unjustly takes up most of the screen time, with the construction of Laser's centipede left to the final quarter of the movie. In short, those who liked the self-referential elements of Part 2 will still find a lot to like here, but those in it for the shocks and graphic imagery may be disappointed. And for those who did not like either aspect of the second film, what are you doing reading this review?"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Jamarlie",
        "review_rating": "1",
        "review_title": "This is NOT The Human Centipede",
        "review_detailed_main": "Probably one of the most awful movies I have ever seen. Not because it is a Human Centipede film, don't get me wrong on that. I am a huge fan of the first two parts, just because the psychological analysis of a serial killer is something that makes for a really good splatter and horror movie.\n\nBut this movie is different, the movie starts with the actors of Dr. Heiter and Martin, which was odd but I kinda liked the idea. The movie however then started to taper off really quickly. You can tell from the get-go that Tom Six just ran out of ideas, he just wants to show offensive violence for the sake of offensive violence. You can most easily compare this to a child not being obedient and doing something bad just to get attention from his parents. This is exactly what this movie feels like, there is no hidden message in this one that made me watch the movie twice (or fully even once for that matter) just because of the way how dull and stock this movie is.\n\nThe main character is merely an over-exaggerated cliché-psycho which does not fit into the human centipede series at all. Dieter Laser was a whole lot better in the role as Dr. Heiter, it was just suited for him. He was a somewhat introverted, deranged psycho-doctor, which was great. He fitted perfectly into his old role, this just looks like a brute-forced attempt to plaster a new, completely unauthentic image onto him which has him feeling like: \"Hey, I do this, because it looks weird, this is how the average person would describe a psycho, I am so original right now, please give me attention, I am such a psycho\".\n\nMaking him a prison-warden does not fit him, half of the time you can't even understand him properly through all the tirades and conniptions of futile and pointless yelling with which he tries to convince the audience of his authenticity as a clumsy cartoon psycho. The only thing he will convince you of though is that he is NOT suited for this role and that you can even give bloody \"Toy Story\" more credit for it's realism and authenticity.\n\nThe only impressive thing about this entire movie is Laurence R. Harvey, after the second Human Centipede movie I just really came to realize what a great actor he actually is. His role in the old movie was so fitting for him, in this one he almost seems like a new person, just an incredibly good actor. That's about the only upside this movie has. Poor, Tom Six, really, REALLY poor. And I was a fan of the series. Couldn't even get to the actual \"Centipede\"-part, since this movie bored and grossed the living hell out of me. Not because of the splatter but because of what they did to this otherwise incredibly good series of movies. In other words: The only really cruel thing that happens in this movie is that all the work and reputation Tom Six built himself up is getting splattered through this one blight in an otherwise great movie history.\n\nDon't watch this if you are a fan of the series, seriously, you will just pull down your own opinion about the entire sequels."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "djquazer06",
        "review_rating": "1",
        "review_title": "Oh dear god",
        "review_detailed_main": "I'm not even gonna give this film an extensive review, it's awful, and should have been shelved before it got filmed.. even Eric Roberts couldn't save this tripe.. if it was possible to give a negative 100 rating this still wouldn't have been enough. If the first film was all about the unusual and an excellent piece of art house film making, then this has to possibly be the worst film ever made."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "alan-marsden",
        "review_rating": "1",
        "review_title": "I have no words",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "dntdm6",
        "review_rating": "1",
        "review_title": "It deserves less",
        "review_detailed_main": "I'm going to diverge from everyone else's thoughts here and say it: Tom Six is insane. The first film was bad, the second was more than enough...but this? What is with Tom Six and his need to write trash like this? No prison warden in their right mind would allow 500 prisoners to be sewn together like that. No governor would even go along with that. Again, what is it with Six and these god awful movies? If I could give this sorry excuse of a film a zero, I would.\n\nEric Roberts cannot save this film. Dieter Laser, for all of the awesome work he did in Lexx, cannot and has not saved two of the three films in this insipid series. Lawrence Harvey? Please god, don't subject me to any more of his \"acting\", period. And as for the porn star of the movie, Bree Olson? Stick to being a mattress actress, lady. No one is going to take you seriously. And now, back to the film itself.\n\nI would rather be boiled alive in 500 degree water than watch this again. I would rather tear my own eyes out than watch this ever again. Hell, I would watch Shatter Dead a thousand times over this film, and that says a lot right there. For the love of god, don't buy this, people. Don't even think of watching it. You'll thank me (and yourself) later on for it."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Hellmant",
        "review_rating": "1",
        "review_title": "I wish I could like these films!",
        "review_detailed_main": "'THE HUMAN CENTIPEDE III (FINAL SEQUENCE)': Zero Stars (Out of Five)\n\nThe third (and supposedly final) chapter in writer/director Tom Six's notoriously famous body horror flick trilogy (dating back to 2009). It has both the lead actors from the previous films (Dieter Laser and Laurence R. Harvey) playing different leading roles in this installment. The movie also features supporting turns from Eric Roberts, Tommy 'Tiny' Lister, Bree Olson and Robert LaSardo. The story deals with an insane (and very sadistic) warden, that decides to turn his entire 500 inmate prison population, into a human centipede. The idea for the madness comes from his accountant; who was inspired with the idea, by watching the first two films (obsessively). The movie has been severely panned by critics, and movie watchers alike; it has a 9% positive rottentomatoes critic score (with an average rating of 1 out of 10) and an average IMDb user rating of 3.5 out of 10! I admire movies that push creative limits; but this film is far too offensive, to give it any real credit.\n\nBill Boss is a racist, sexist and completely insane prison warden (Laser); who's constantly trying to gain respect from the inmates, he watches over. He tries several different sadistic techniques, to beat the prisoners into submission (including castrating one, and disfiguring another, by water-boarding him with boiling water). When his job is threatened by the governor (Roberts), his right-hand man, and prison accountant, Dwight Butler (Harvey), suggests the idea that they turn all of the prisoners into a 500 person long, human centipede. Boss sees the idea as the ultimate form of submission, and loves it.\n\nThe movie is about as vulgar, crude, disgusting and offensive as a film can get! I saw both previous installments, which I gave both zero star ratings to, and although this installment isn't quite as dark, and gory, as the others; it's still even more disgusting and tasteless. Like the other films, in the trilogy, it's one that will always stay with me, in a very haunting and disturbing way. I respect filmmakers that try to push the boundaries, of what's acceptable and normal, but these films are far too immoral to give the writer/director (Tom Six) any credit for. The only purpose any of these movies have, is to get an uncomfortable physical reaction from the viewer; there's nothing intellectual about them at all (no hidden meaning). I wish I could like these films, and admire them for being so bold, but I can't. 'THE HUMAN CENTIPEDE III (FINAL SEQUENCE)', like the other two chapters, is one of the worst movies I've ever seen!\n\nWatch our movie review show 'MOVIE TALK' at: youtu.be/vvaTQ0fcFUQ"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "iamtherobotman",
        "review_rating": "1",
        "review_title": "I can't believe i've just sat through the whole film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "DiscoStu222",
        "review_rating": "2",
        "review_title": "Drivel",
        "review_detailed_main": "I have a love of low budget cult movies so am far more tolerant than your average man, I have seen bad acting, bad storytelling, directing etc before but this really is an absolute mess of a movie.\n\nI enjoyed the first centipede, it was a sick but somewhat inspired piece of cinema, obviously not for everyone but I had a lot of respect for Tom Six after that. The sequel had its moments, much of the inspiration had gone but the casting of Laurence Harvey was good. I like the black and white but it appeared Tom was beginning to run out of ideas and simply riding off the first movie.\n\nThen comes this repugnant amateurish pile. Where to start with its problems? The acting is beyond terrible, the dialogue even worse, you cannot make out what Dieter Laser is saying most of the time which is surprising since he shouts almost every single line. Laurence Harvey worked well in the second movie but not in this one, he is not a good actor and his attempt at an American accent is laughable. Bree Olson is what she is, a porn actress trying to get into mainstream, I kinda feel sorry for her as she is extremely ill treated throughout the film and Eric Roberts chews the scenery like never before despite his brief appearance. One or two of the inmates do OK but in general the acting is as bad as you could ever see. Not a stellar cast by any chance but they should be capable of more, in my opinion this is down to dreadful direction, what Tom Six was thinking when he extracted these performances I will never know. Did none of the actors or film crew take him to one side and explain how ridiculous it was? The story is incoherent and without substance but even the best storyline couldn't hope to come through with the performances as poor and over the top as they were. There are a couple of gore scenes which are decent and certainly make the eyes water, Tom Six at least maintains that.\n\nIt is a shame that this franchise has ended so weakly. I hope it isn't the end of Toms career but he needs to prove he isn't just a one sick trick pony. However, one thing is certain, I will remember Dieter Laser for the most ridiculous, over the top performance of all time."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "alwilliams-89720",
        "review_rating": "1",
        "review_title": "Self Indulgent, Egotistical, Sadist Gore Porn",
        "review_detailed_main": "I love the first movie, and was entertained by the 2nd one. But this was made solely for a select audience. An audience I hope not to come into contact with.\n\nThis was not an artistic expression from a genius or was it ironic. This was a movie made as if someone literally just get's their rocks off making sadist gore porno movies. There was not one redeemable aspect to this movie - A Neo Nazi finding a solution to America's Prison issues? OK.\n\nIt's just mainly a collaboration of taboo gory, sexual, sadistic scenes put in one movie for those who are solely into this to get off on. Mainly Tom Six. Pretty much the same way a cereal killer escalates what he calls his art. So has Tom."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "9",
        "review_title": "A comical and politically incorrect ending",
        "review_detailed_main": "The trilogy concludes with this installment that, rather than being horror, is more of a black humor thriller. It is grotesque, strong, disgusting and funny. It has many murky and explicit scenes that shocked me and made me laugh a lot. Tom Six wanted to finish the trilogy with a lot, although with some limitations. At least the film becomes politically incorrect by resorting to certain stereotypes in the characters, giving this film a South Park-style humor. It's not the epic, horrific ending that this trilogy could have had, but it's entertaining and good to pass the time having fun with its loud and gross scenes. My rating for this movie is 9/10."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "7",
        "review_title": "By turns the most outrageous, and most easy going, of the series entries",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nIn the sweltering desert, highly strung prison warden Bill Boss (Dieter Laser) is under pressure from Governor Hughes (Eric Roberts) and his assistant to run a more humane and effective prison. His assistant eventually persuades him to copy Tom Six's idea from the Human Centipede films, and hook all the prisoners together ass to mouth, creating more of a 'human caterpillar' than a centipede.\n\nGiven the massive furore over the last film, which struggled to secure a certificate in the UK despite being more of a post modern, tongue in cheek variation on the original and far less upsetting, this third and , we're promised (hopefully, really) last instalment in the HC franchise, has arrived with far less fanfare and, as such, probably far less anticipation. Since neither of the first two got really great reviews (especially, quite rightly, not the terrible second part!) it could be that the demand for the third part simply isn't through the roof, and in spite of having the most excessive and disgusting idea of them all, there's been no attempts to ban it. But it's a strange cookie all of its own.\n\nThis time round, the emphasis seems to be purely on laughs, with references to the first two films included, and everything played up for the most campy effect possible. Even the HC concept has been blown to the most outrageous lengths imaginable, and has more of a silly element attached to it, which, with less sympathetic victims isn't so unthinkable, even if the poster itself is enough to twist your mind. There's certainly no way lead star Laser could be doing anything but playing it for laughs, turning in the most hammy, overboard, comical performance you can imagine. The irony of having him, as the star of the original film, co starring with the star of the sequel in totally different roles isn't lost on anyone either, especially not, it seems, director Tom Six.\n\nThis is a series that certainly hasn't played out in what you'd call the 'traditional sense', gradually turning into a bizarre parody of itself as it's gone along, but it's secured something of a cult following for itself anyway, and this is probably the most enjoyable entry, coming from the angle of a non sick, easy going mind. ***"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "issachar",
        "review_rating": "1",
        "review_title": "Totally ruined",
        "review_detailed_main": "Again, it's really hard to write minimum of 10 lines for this awful title. I just want to rate it.\n\nI like the first two Centipedes, it's sick, it's really sick. I do have high expectation on Centipede 3.\n\nFor 1:42, most of the time it's just meaningless yelling and anger.\n\nOccasion sick scene that I expected better than the previous episodes, but nah... it's ugly, it's okay, but not what Centipede should be.\n\nThere's no plot at all, making Centipede 3 very hard and very boring to watch.\n\nIt's sad that this is the final sequence, I just hope they try harder."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "3",
        "review_title": "A disappointing climax, \"Human Centipede III (Final Sequence)\" is ambitious in its goals, but tragically comes off as a ludicrous, oddly-tame mess of a film...",
        "review_detailed_main": "Oh, Tom Six. How I admire you. For all of the grief people give you over your films, it cannot be denied that you have a drive and ambition, and have been instrumental in bringing body-horror one of its most unique franchises of recent time.\n\nAnd I certainly cannot speak ill of the man's talents. The first two films in his infamous \"Human Centipede\" trilogy are oddly and undeniably solid pieces of cinema, with good, competent direction, wonderful visuals and even some great self-aware meta-humor. (I particularly admire the second film, which I find to be a tragically underrated and misunderstood piece of pitch-black satire.)\n\nBut unfortunately, it appears Icarus may have flown too close to the sun during this third outing, as \"Human Centipede III (Final Sequence)\" suffers a slew of issues and problems that hold it back as not only the worst film of the trilogy, but also one of the most disappointing horror and comedy films of recent memory. It's honestly surprising how much of a step-down the film is.\n\nThe film follows prison warden Bill Boss and his assistant Dwight Butler (played respectively by Dieter Laser and Laurence R. Harvey, who both portrayed villains in the previous films). Boss is a violent, depraved, cannibalistic nutcase who believe extreme violence and torture are the only things that can keep his prison under control (just wait till you see what he eats for lunch!), while Dwight is a meek man forced to go along with all of his schemes. However, upon seeing the first two \"Human Centipede\" films on DVD, Dwight hatches a plan to control the inmates- put them all into one of the titular \"Human Centipedes\" (Which connect multiple people via a seamless digestive system by connecting the mouth of one to the anus of another) to make them easier to control, and make them the ultimate deterrent to those who would otherwise consider a life of crime.\n\nWhile this is indeed an interesting-enough set-up for a climactic and insane finale, the fact is, the film crumbles under it's own desire to be depraved and up-the-stakes presented in the first two films, all while also trying to do something new.\n\nThe film reaches too far and stretches itself thin from the first moment to the anti-climactic finale. (Don't worry, I won't spoil anything, but I will say fans of the first two films will likely be let down by the final 15 minutes.) Actors over-act madly, gore is thrown in by the bucket-full, language goes full-bore into nonstop profanity, the \"ick\" factor is piled on with taboo after taboo being broken... yet it feels so vapid because it's so far over-the-top it can no longer be identified as either horror or comedy. And as a result, the film becomes too cartoonish (and thus feels shockingly tame in comparison to the previous two) to be taken seriously in any way. Even as a self-parodying comedy, which its clearly striving to be, it's too much.\n\nParticularly Dieter Laser... Good lord, Dieter. You were the best thing in the first film, yet in this third entry, you single handedly destroy the entire film with your scenery chewing. Laser's Bill Boss is the \"Jar Jar Binks\" of horror- a cartoon that wouldn't appeal to anyone over the age of 5 due to nonstop \"silly antics.\"\n\nReally, the only good things about this film to me were a humorous cameo by director Tom Six himself, and one brilliant joke revolving around whether or not the concept of a human centipede would violate a doctor's Hippocratic oath.\n\nI'm really disappointed by this film. I enjoyed the first and adored the second. And I do admire the intent behind this third film- bringing the series even further into the realm of broad, perverse, satirical comedy. It just doesn't work because it doesn't know when to slow down or stop.\n\nI give it a 3 out of 10."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Leofwine_draca",
        "review_rating": "1",
        "review_title": "Every bit as bad as the previous two",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "grantss",
        "review_rating": "1",
        "review_title": "The worst movie I've ever seen (and I've seen over 5,000 movies)",
        "review_detailed_main": "A brutal, deranged prison warden, Bill Boss, knows no limits or laws when it comes to maintaining discipline in his prison, and in carrying out his sadistic urges. Then, influenced by watching the Human Centipede movies, his sidekick Dwight suggests that he create a human centipede out of the prisoners. It will cut their food costs...\n\nThe original The Human Centipede was disgusting in its plot, but not very graphic. This was a redeeming quality, as it left a lot to the imagination, and left room for a plot. While not good, it turned out to be not as bad as expected.\n\nThe second film had far less redeeming qualities. It was graphic in its violence, surgical scenes and centipedal scenes, and very disgusting, and gratuitous. Plot was quite basic. Overall the movie was pretty bad.\n\nThis, the third movie, is even worse than the second. Concept is even more gross than the first two movies and the movie is quite graphic. Plot is close to non-existent - things just lurch from one random scene to the next, with the only plot aim being the creation of the centipede.\n\nSo, far incredibly bad. However, taking the movie to new heights (or its it depths?) of craptacularity is the performance of Dieter Laser as Bill Boss. I have not seen a worse performance in the history of cinema, or anything (and I've seen Kristen Stewart \"act\"). His \"acting\" consists entirely of shouting and massively overacting. Yes, some of this is the director's fault, but there is a limit. Even insane people do not act that deranged.\n\nAwful beyond belief."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bchristopherwarne",
        "review_rating": "1",
        "review_title": "Words fail me",
        "review_detailed_main": "This film is so bad it's virtually indescribable! Parts 1 and 2 of this series were no great shakes, but at least they proved the 2 main actors and director Tom Six were halfway competent at their jobs- so what the hell happened here? Was it SUPPOSED to be so awful that it was almost unwatchable as some sort of in joke?? It's hard to know where to begin. The plot (clearly a rather clumsy satire of the U.S. Penal system as run by the likes of the notorious Arizona sheriff Joe Arpaio) makes no sense, even as a comedy. The acting, by everybody concerned but particularly the 2 leads is beyond excruciating- it's painful at times to watch. Even gore hounds will be disappointed- the actual centipede seems like an afterthought, not appearing until 10 minutes before the close, and the occasional disgusting moments (a castration, colostomy bag being ripped out etc) utterly fail in their attempts to shock- quite simply because the film's badness is more shocking than anything that could possibly be put on screen. Is it worth seeing as a curiosity, to see how a movie COULD be this bad? Possibly, for the first few minutes, but then boredom quickly sets in- this isn't one of those films that's so bad it's funny. It's so bad it's actively unpleasant and annoying to watch.....avoid, like the plague!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jsuknewsofficial",
        "review_rating": "1",
        "review_title": "Hollywood institutional racism disguised as a B movie",
        "review_detailed_main": "In the first film there's a Japanese guy as the head of the centipede as the mad doctor is German. In this film there is flat out racism from the lead character including racial slurs and attacks against prisoners. As well as this, when there is a prison riot , a black man is seen punching a woman. The lead character is loud obnoxious and racist to the point it seems as if the 4 chan neo nazi edge lords posts on the internet seem like Disney. This doesn't get any better as the film progresses and the ending is just racism again. Of course this guy wins. Imagine viewing this film through the eyes of the alt right neo nazi movement, they would be cheering him on and laughing. The character is also heavily misogynistic, even raping a woman as she's in comatose after being beaten up. There are no other attempts to flesh out his character, no biting satire. Just a nazi rambling and doing offensive stuff for the sake of it. It's like a glorification of it. Whatever subtext that pretends to be about American justice systems falls flat as it's not explored enough and the racism seems by the numbers for Hollywood Institutional racism. In the same way that the second film made mental health and abuse victims look like psychos, (another Hollywood trope,) this film is nothing more than glorifying racist attacks and neo nazi thoughts. In a very loud and obnoxious way."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bobby_3008",
        "review_rating": "",
        "review_title": "The best prison movie since \"The Shawshank Redemption\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Satyabrata14",
        "review_rating": "1",
        "review_title": "Wtf",
        "review_detailed_main": "One of the worst and irritating movie ever created..."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "chamberscory221",
        "review_rating": "1",
        "review_title": "Utter Rubish",
        "review_detailed_main": "A total rediculous movie; just so horribly cheesy and off the rails .: like I had to fast forward through much of the cheese."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "guitardawson",
        "review_rating": "8",
        "review_title": "Loved it!",
        "review_detailed_main": "Dieter Laser is brilliant! I have never known an actor who could make me feel so incredibly uncomfortable so consistently. He did it it the first Human Centipede and delivered throughout this film. This movie is exactly what I expected it to be. It was disgusting and vile and I won't be able to erase it from my mind. But that's why I watched it. I felt the same revulsion after watching the first film, but it quickly became one of my all-time favorite horror films. I won't say that this one is as good as the first one, but it's a fun ride ride if you are a fan of the genre.\n\nParanormal Activity fans should just skip this one and stick to horror lite. You won't get it. This is for hardcore horror fans. With all of the pile of crap B movies out there that truly suck, I am amazed that there are so many 1 star ratings here. This film was well acted, well written, and very entertaining. I suspect many of the poor reviews are due to disgust and the actual movie. Or maybe it was the lack of nudity? Who knows. Watch if you dare."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bryank-04844",
        "review_rating": "7",
        "review_title": "'The Human Centipede III: Final Sequence' definitely worth seeing if you can stomach it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "zmilojevic-08107",
        "review_rating": "1",
        "review_title": "Stupid.",
        "review_detailed_main": "This film is an insult to good taste. I don't recognize any segment of the film as positive. Very stupid...I dont know what to say anymore."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "alpzgopal",
        "review_rating": "1",
        "review_title": "Wow, very possibly the worst film I've ever watched!",
        "review_detailed_main": "Not sure why I was even drawn to the final part of the series maybe because I recognised some familiar actors but wow their movie careers must have really hit rock bottom to be a part of this.\n\nBad acting is an understatement, sometimes feels like I was watching a comedy, plenty of gore but that's about it, no particular plot.\n\nI really hope this is the last other the human centipede saga.\n\nSave yourself your time and don't bother watching even if you feel compelled after watching the first two films it really doesn't get any better.."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jcj86-429-287764",
        "review_rating": "4",
        "review_title": "The Trojen Horse of bad movies!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "rameshwarsinghcharan",
        "review_rating": "1",
        "review_title": "Prisoners",
        "review_detailed_main": "Just bad behavior on prisoners I think Third degree torture"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "El_Ingeniero",
        "review_rating": "1",
        "review_title": "Shame, it could have been the perfect ending to the trilogy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "minttu85",
        "review_rating": "5",
        "review_title": "Hilarious",
        "review_detailed_main": "Okay, i watched half of the first one. Then i had to throw up, it's was so disgusting and i kept feeling sick many days after that. And that's the reason i haven't seen the second one.\n\nBut i decided to give this a chance. It's not horror. It's comedy. I laughed so hard watching this.\n\nThis movie is so bad and ridiculous that it is actually very very funny. I find Bill Boss hilarious. He is so sick, twisted and weird. So i have to say i really enjoyed watching this.\n\nBut if you liked the first one, you are probably not gonna like this. As I said; comedy."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "nms1982",
        "review_rating": "1",
        "review_title": "crap with a side of poo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jtindahouse",
        "review_rating": "8",
        "review_title": "Six manages to ramp it up again",
        "review_detailed_main": "The original 'Human Centipede' was a brilliant idea for a film. The trailer alone was truly shocking and made any horror/gore fan adamant that they had to see it. The idea alone was enough to carry the film and the results were indeed brilliant and shocking. Then there came the problem that writer/director Tom Six wanted a sequel, in fact a couple of them. The idea alone was no longer going to be shocking enough to carry them. He had to up the ante. And that's exactly what he did with 'The Human Centipede II (Full Sequence)'. In fact he upped it possibly more than he needed to. It truly was an incredibly shocking film, with one scene in particular really standing out in my memory. The only problem was that made upping the ante again for part three even tougher. Did he manage it? All I can say is he gave it a hell of a try.\n\nThe movie really is carried by the lead character of Bill Boss, played by Dieter Laser who also starred in the original. In what must have been an exhausting performance to pull off, he is simply going full throttle from scene one to the dying seconds of the film. He gives it his all and he pulls it off. The character is captivating to watch and wonder what he is going to do next. Laurence R. Harvey, the star of part two, also returns in a little more toned down role this time, as do some other actors in smaller parts. In fact even Tom Six himself makes an appearance this time around.\n\nIt goes without saying that this film won't be for everyone, however I absolutely loved it. A number of scenes are again truly shocking and the overall plot of the film is nothing short of fascinating. It's far from highbrow, Oscar winning cinema, but then it never sets out to be anything of the sorts. It's there to entertain its audience and that it does in spades."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "The Goriest but Worst in the Series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jordan2240",
        "review_rating": "7",
        "review_title": "Thought it was hilarious",
        "review_detailed_main": "Obviously, a lot of folks didn't like this movie. Not sure if they were expecting more gore, or found it too disgusting, but of the centipede trilogy, this is the one I laughed at the most. I was hoping for a bit more gore (what can I say, I'm a fan of the gore-fest), but the overacting and dialog that made fun of the first two films and characters had me cracking up, and I'm sure it was the intent of the movie to be comical. Laser's constant screaming did make it difficult to understand what he was saying, but his body language made up for it. As some have criticized, it does take a bit long to get to the sequencing, and you don't see the detail that the other films had, but by this point, since most have seen the other two films, its more the idea that's important than the execution of it. But be warned, there are still scenes that will make you squirm a bit."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "dutchchocolatecake",
        "review_rating": "1",
        "review_title": "one wasn't enough. but three? come on",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Sergio_Gorgone",
        "review_rating": "1",
        "review_title": "Tom Six - the dutch approach to killing a concept!!",
        "review_detailed_main": "Giving a 1-star is no easy feat. Having watched the first and second Human Centipede - I became intrigued as I like films that provoke me and sometimes dry-heave with disgust.\n\nNow had the third movie been the very first - well then the tone had been set for a psycho-comedy that would shock and somewhat disgust you.\n\nI was hoping for this movie to be the ultimate, elaborate and final twist to end a controversial theme with a blowout (no pun intended).\n\nIf you still haven't been acquainted - then my suggestion is - either watch this third installment and don't watch the two first ones OR watch the two first ones and skip the third.\n\nThe two recurring leads are as ominous as we have seen - but are sorely mistreated script-/direction-wise.\n\nIt's a mess and thoroughly sad - the only positive to be said about it is that it makes Sharknado 1+2 look like masterpieces but that is a depth of movie-depression I refuse to submit to.\n\nAdvice = Skip it! It's not worth it."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "MisterAW",
        "review_rating": "1",
        "review_title": "Trash.",
        "review_detailed_main": "This is honestly the worst piece of garbage excuse for a film I have ever seen. There is not a single aspect about this \"movie\" is enjoyable whatsoever. It does not deserve any further interpretation than that."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "kaibanbelubo",
        "review_rating": "1",
        "review_title": "The worst movie ever?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "paulo_blank",
        "review_rating": "4",
        "review_title": "Made to offend",
        "review_detailed_main": "This movie is not entertaining, funny or scary. It is not even gory enough. It is just offensive. I would give this movie 1 out of 10, but I can not complain about the movie content because I expected to be offended when I downloaded it. It is just a shame that the director made a 3rd part with the unique intention to offend. The movie had a good chance to make a good horror comedy, grindhouse style. Dieter Laser is a good actor, he could have delivered a great character with a better script. Laurence Harvey is a face made for a horror comedy, Eric Roberts is a Hollywood pun face, Bree Olsen, well, she is hot and Tom Six is a no boundaries director. But this 3rd part is just a boring, chauvinist, racist movie. What is the point of the raping parts and the constant degradation of Bree Olsen and Laurence Harvey? Make us laugh? Make us feel shocked? It just offends everyone, and I think this was the director mission and the reason I give it a 4, he accomplished his mission. If you want to be offended, watch it, no other reason can be found to download it, this movie is just a boring 2 hrs offensive tryhard."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "knxcholx",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I hate everything about this movie. Somehow the director managed to make the third even more grotesque than the first two. The fact the actual human centipede they construct is so long, makes it so dumb and pointless."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "angellaura-93153",
        "review_rating": "1",
        "review_title": "Why was this movie made?",
        "review_detailed_main": "I think the if making of this movie was to offend. Agitite aggravate. Upset everyone. Anybody anywhere.and anything. It would work. Have to be very open minded. And Realize .it just a movie...."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "avonnightprincess",
        "review_rating": "2",
        "review_title": "Not Worth the Effort",
        "review_detailed_main": "I cannot believe I actually sat through this whole movie. It was tediously painful and the \"shock value\" stuff was just lame and overdone. Don't get me wrong; I love a good horror movie, and B movies are awesome. However, this piece of swill should have just ended up on the cutting room floor. Even though it was an hour and 42 minutes long, I felt like it had stolen at least three times that worth of joy from my life.\n\nSeriously, it's the crappiest Human Centipede film and really not worth the time or effort it takes to watch it. And it's definitely an effort! The acting is atrocious, the characters are one-dimensional and the script is just awful. I can laugh at bad movies with the best of them, but this one gave me very little to work with and takes itself too seriously to actually be a decent \"bad\" horror film.\n\nI made an IMDb account JUST SO I could review this horrific train wreck of a film. It's terrible. Save yourself the tedium of watching this crap. It's not worth it!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "MajmunX",
        "review_rating": "10",
        "review_title": "One of the BEST \"B\" Movies ever made! **minor casting and story spoilers**",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "koopakid-31665",
        "review_rating": "6",
        "review_title": "definitely my least favourite out of the three, still enjoyed watching it",
        "review_detailed_main": "Oh boy was this movie a ride, i watched the movie for the shocking and disturbing content, and while this had it's moments (one near the end about death row inmates specifically) that really caught me off guard, it was more of a black comedy instead of a disturbing horror movie. That being said, for what it is, it's actually pretty good (though sort of over the top acting which i wont fault since it was the intention).\n\nwould i recommend it? its definitely not for everyone but it is enjoyable for an over the top black comedy, and it does have its funny moments"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "zachdeitz",
        "review_rating": "1",
        "review_title": "I could give it a 0 sadly",
        "review_detailed_main": "This movie is HORRENDOUS the worst movie I've seen in my life and I've seen a lot of movies i could not stand this shitty movie ugh it has the worst acting writing and cinematography I've ever seen in a movie EVER i don't understand how this movie can even get a 2.9 it should have a big fat ZERO"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "TheCinematicMind",
        "review_rating": "1",
        "review_title": "Repetitive, tame and lifeless!",
        "review_detailed_main": "The Human Centipede: Final Sequence (Tom Six, USA, 2015)\n\nWell what can I say about this one! A bloody lot actually. I will be the first to admit I actually like the first movie, despite the premise of course not medically accurate, it managed to get black comedy in the middle of disturbing scenes. The second, while uncomfortable to an extent when it began getting repetitive after a while and I don't care for the characters or the acting in it. However, the direction, cinematography and Laurence R. Harvey saved the film giving it a grim, unclean environment. Now (for the final time we hope), Final Sequence this time is about the Warden Bill Boss (Dieter Laser from the first) of an unpopular prison that is threaten closure from many riots, medical costs and staff turnovers by Governor Hughes (Eric Roberts). Bill is a drunk, insane, loudmouth individual who rants and drinks throughout trying to control the prisoners and the fear of termination. However, his right hand man Dwight (Harvey returning from the second) suggests the possibility of creating a human centipede of 500 people as a solution.\n\nSo the idea of this movie is it is a self aware satire on the series and American Prisons. Tom Six in an interview stated this will be the sickest Human Centipede film yet. Ironically, it actually turns out to not be very gory and oh boy, it's bloody tame (for some people, I think it could be an advantage). The gory moments are brief and really not shocking because we're not interested or care about any of the characters. Honestly, the whole movie is ranting, drinking, suggestion to make Human Centipede, Bill rejects the idea, some brief scenes of the prisoners, sexism to the character of Daisy (Bree Olson) and it repeats over and over until the last 30 minutes. The production values are completely cheap in comparison to the previous with the colour grading of orange to the over-the-top acting mainly from Laser (who was uncomfortably disturbing, yet darkly comic in the first) gives one of the most exasperating performances in recent years.\n\nThe self-awareness of the fact how they mention the fact the previous movies are messed up feels like a cheap excuse of defending the film and forces it throughout to the point a cameo from Tom Six comes in to giving an impression that he wants the series to be over! Lastly, because of the repetition of the plot structure, the pacing truly drags and feels more lifeless as it goes on. In conclusion, I wasn't offended by the film, that must surprised you. However, I state this film is smug, tame, repetitive and lifeless! Really, I don't want this film to be banned at all, instead how about we watch the great controversial films and remove this as a popular controversial film!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "nexmorbussbi",
        "review_rating": "1",
        "review_title": "I would rather endure anal surgery, performed with a piranha, than watch this again",
        "review_detailed_main": "This was quite literally, the worst movie I have ever seen. I don't feel it should even be called a movie. Tom Six is a damn moron with a snuff fetish who, unfortunately for the world, was in a position to produce a film. The entire thing is absolutely bloody awful. The \"gore\" is bland dog turd, there is very few actually shocking scenes, it's as if a mentally retarded pigeon watched the first two movies and defecated this one out. Nearly two hours of Dieter Laser screaming his irritating bloody lungs out with his enormously effing annoying voice. It was so bad that for the first time since discovering IMDb many years ago, I actually made an account. Just to post this review. And posting this review without using profanity has been INDESCRIBABLY difficult."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bravosiguenza",
        "review_rating": "2",
        "review_title": "The Room (2003) meets Hostel (2005)",
        "review_detailed_main": "What if Tommy Wiseau decided to direct and star in a body horror film? The answer would definitely look like the final installment of the Human Centipede series.\n\nFrom highly-improbable scenarios to disappointing technical issues, Human Centipede III is a lesson on the things a movie should not do.\n\nI'm certain that HC fans were expecting the most bizarre and graphical depiction of the creation of the ultimate mouth-to-anus chimera, but practically only a glimpse of the beast was shown during the anti-climax. Same with the \"Human Caterpillar\". Probably as a black comedy this movie could work: Dieter Laser character's yelling lines were absolutely hilarious, as well as the scenes where he pushes his secretary out of the office. Also, when have you seen a Governor that looks as unkempt as the one in the movie? Even the appearance of Tom six himself was risible (remember the music that played every time he drives his Mercedes into the prison?).\n\nConclusion: If you have watched the previous HC films and you are bored to hell, watch this. If not, well, don't bother and watch the first one."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "lois-lane33",
        "review_rating": "1",
        "review_title": "Even Adolph Hitler would be disgusted by this movie.",
        "review_detailed_main": "This film has my vote for worst film of all time. Ever. It is a cinematographic abomination. It could even be called an atrocity of sorts. Its that bad. The first two were horror/exploitation movies that had a semblance of a plausible plot line but this films plot line is so far off the mark it's past Pluto. Its as if the guys who dreamed up this jewel had moved to Colorado and had spent all their time getting high which has obviously broken their minds completely. To call it crap is to be way too nice-I don't think anyone has ever made such a bad movie in the entire history of cinematography. Its absolutely disgusting. The plot of the film revolves around how the entire population of a small maximum security prison are basically killed by the warden-a bad man played so badly it was like really watching a madman at the controls. Films like this one should not be shown anywhere, especially in the current climate of pop up violence that has frequently happened in relationship to cinemas. I wonder if this film or something like it was playing in the cinemas that were part of the recent spate of cinema shootings in America. This film is dangerous. As such it should probably be banned and the master copy dropped into a deep ocean trench."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "bowmanblue",
        "review_rating": "3",
        "review_title": "It's officially lost its mojo",
        "review_detailed_main": "Yeah, I admit it – I actually enjoyed 'The Human Centipede' – a film so depraved that many a Hollywood film critic actually claimed that its creation spelt the end of moral and intellectual cinema as we know it. Okay, so it wasn't Shakespeare, but then it wasn't meant to be, was it? It was meant to push the boundaries and generally gross us out. And it did just that. So I classed it as a success. And so did the public in general, as it spawned a sequel. Granted the next instalment took a very different path, but I enjoyed that one too (to my shame).\n\nTherefore, I was always going to give the third one a crack. And, from the start I was actually quite impressed\u0085 the film chose to reunite the (wonderfully creepy) stars of the previous two films and put them together on screen. How could this film possibly fail? It did.\n\nIt was rubbish. I'm sorry. I know I should try to back my opinions up a little more eloquently than that, but I really can't think of anything else to say. I was so disappointed. If you've seen the first film (and if you're considering watching a story about human test subjects being sewn together in the most disgusting way imaginable I suggest you start there) then you'll know the lead was the evil German doctor. Like I said, he's back here (only as a new character) and yet all he does is shout. Loudly. Rinse and repeat. In fact, he shouts so damn loudly that I could barely hear what he's shouting about due to his accent. It seems that he's been told to act like a lunatic and he does just that. Unfortunately, it's too over the top to be believable and it totally ruins the whole film. Well, that's the start of 'Part III's' ruination.\n\nThen there's the gore. Or should I say 'lack of it?' Seriously, these film's selling points are that they gross you out. Most of us who invest our time into them are happy that there won't be a gripping and thought-provoking story with deep and emotional character development. We just want sickness. And we don't get it from Part III. It's just more of the same, only less graphic. We've seen it all before in the past two instalments and we've therefore seen it done better.\n\nIf you're as weird as me in that you actually enjoy watching films like this, stick to the first two. Ignore this one. It really is pretty bad. Or watch Kevin Smith's 'Tusk.' Even that was better and at least had some snappy dialogue added to the mix.\n\nPart III = avoid."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "imogen-19369",
        "review_rating": "1",
        "review_title": "Literally the Worst Film I've ever seen",
        "review_detailed_main": "First two films intrigued me as they were horrific so thought I'd give this a go.\n\nThe gore took about an hour to come in and the plot was utterly ridiculous"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "OrangeFlamingo",
        "review_rating": "1",
        "review_title": "Sadly, sadly bad",
        "review_detailed_main": "I was scrolling through netflix trying to find a movie to pass the time on a dreary afternoon and to my surprise found THC3 and was wild with excitement. I was a fan of the first two just because of how twisted they were, and after hearing Six say that this was going to be the most gruesome yet, I was very eager to see it. What a disappointment.\n\nI made it through the first 17 minutes before I got incredibly irritated with Dieter Laser screaming all of his lines (seriously, everyone who's said that that's all he does is not lying. he LITERALLY screams ALL of his lines) and I started to just fast- forward to all of the gore/torture/death scenes to see what was in store. huge huge letdown. They're few and far between and they're total crap. There's little to no gore and they're very under- dramatic, if you consider that a thing. In my opinion, part of a good torture/death scene is the pain and suffering of the victim and there is just none of that. These people must have botched pain receptors.\n\nThis whole movie is a mess and a failure. I hate to say that because i really love Tom Six, but this should have never happened. It's like he spread the word that there would be a third movie and when it came time to start filming he was like \"damn, i really don't even feel like doing this anymore\" and he just let it go and let whatever happen. There probably wasn't even a solid script and everything was likely done in one take, whether it was satisfactory or not. Everyone involved just wanted it to be over. I hope to see another film come from the beautifully disturbed mind of Tom Six but for the love of god, please no more human centipedes."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "flyerx",
        "review_rating": "10",
        "review_title": "Trashy",
        "review_detailed_main": "But the best movie of the trilogy. Also i really liked Dieter Lasers role."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "tonypeacock-1",
        "review_rating": "1",
        "review_title": "Final Sequence, hopefully final film in this franchise",
        "review_detailed_main": "The film is an awful end to the trilogy about humans who share an alimentary tract to form a 'human centipede'. Stars, and I say that with some sarcasm from the previous two films return as new characters in a top security United States prison somewhere in the desert. In that respect it is like a Carry On film. That is where the similarities end. Dieter Laser, the mad German doctor from part 1 is now Bill Boss, mad warden of the prison. He seems to have psychological issues and is very highly strung about being unable to control the prison population. The little guy from part 2 is the 'accountant' of the jail who comes up with the idea of a prison centipede to ultimately cut costs and control the population.\n\nThe film is very boring for large parts. Sick in others. Even the director/producer Tom Six presents himself in on screen cameos proud of his devious medically accurate claims. The film did not receive the same amount of pre-publicity regarding censor cuts than part 2 and is filmed in colour in this episode. That said I still would never recommend this filth."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "heshtiaghy",
        "review_rating": "1",
        "review_title": "inappropriate",
        "review_detailed_main": "!It's really strange to me how every single part of the three dirty and inhumane films won several honored awards !!!!! I'm sorry for you ... Just look at the movie. You see, in a few countries, the ban is forbidden (the countries that have freedom of expression), and I think it's right and you should not be allowed to play the whole world and be treated with the film's agents. I read somewhere that movie director Tom Cutx is almost the day he did not receive email, call, or message of death to people, and was happy about this and said that then, it's obvious that the movie has hit so much that you want to kill me! I've been horrified for horror genre films, and I've seen many of the films in this genre, and when I hear or read that, you can not see the movie as horrible as I can, but I really suggest that if one does not see this movie, I say, I'm sorry to see this movie, really a dirty and anti-human, trust me and do not see it. I know, unfortunately, when you say that you do not watch the movie, or do not do it, you can see the worse person, but in this case, I'm sure after seeing the film I was talking about you saying that I would listen to it ... I saw 2 parts and I did not see 3 and I would not see. If you see I took the time and I wrote this whole text for this, maybe even 1 person would not have bitter experience with my words. It's okay, a brief summary of the film, for why I say I should not see the movie: The name of the thirty-sixth human film in which one human scientist hurts and savagely shoots it! Yes sweetie !!!!!! That's the name of the movie is a thousand pence! So that the first person is the first person in the mouth and the second hip in the third person's mouth and ... And when the first person eats, the feces leave the last person, for example, the 15th! And ugly scenes ...\n\nHorror genre films with supernatural themes, Slasher and ... And I do not think the genre of this film is horrible."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "pauljamesross",
        "review_rating": "1",
        "review_title": "Ridiculous!",
        "review_detailed_main": "Deplorable DIRECTOR! Deplorable STORY! Deplorable ACTING! Deplorable movie franchise!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "steffer70",
        "review_rating": "1",
        "review_title": "By far the worse movie I have ever seen",
        "review_detailed_main": "Why oh why people spent time, effort, energy and money to make this movie is beyond me. I enjoyed the two first movies but seriously people, quit while you're ahead. This is definitely 102 minutes of my life I will never get back and I had to apologize for having friends over to watch it with me. And yes, it is that bad. I'd prefer having watched paint dry."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "mrdonleone",
        "review_rating": "1",
        "review_title": "Funny crap",
        "review_detailed_main": "Mind you: not many movies are as stupid as THC3. That's reason enough to watch it, I guess. Some lines in its dialogue are priceless. Yet by calling itself unrightly the third part of a great horror series it has destroyed the other films. Mistakes are all over. I never wanted to imagine those two creeps of the first movie as bring losers: making them speak English destroyed their original characters. So disappointing... Just don't take this one too serious and you'll find yourself enjoying it quite a bit. It's digesting!!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "ziggy-linda",
        "review_rating": "1",
        "review_title": "Atrociously dull",
        "review_detailed_main": "I was expecting this film to be the most shocking and gruesome one so far, but was totally let down. There is no 'centipede' part until right at the end of the movie (half way through I was wondering if I was watching the right one!), and the centipede idea has been changed so it's much tamer than the first and second movies. Plus, the shock factor is over in the first half of the movie with the whole torture theme, so when the centipede theme comes in, it's just uninteresting.\n\nI also came very close to turning it off several times because of The Warden's incessant unintelligible shouting/shrieking. Completely over the top, drawn out, and genuinely very annoying to listen to."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "boscarobert",
        "review_rating": "1",
        "review_title": "Wrong time and location",
        "review_detailed_main": "The action in that movie should be placed in 1942 in Germany , not in USA. The plot is terribly wrong and a lot of movies make the same mistake , ignoring the real laws and human empathy As I sad earlier , that movie should be about Holocaust"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "paul_haakonsen",
        "review_rating": "3",
        "review_title": "This movie was very unnecessary...",
        "review_detailed_main": "I must admit that I had some great reservations about sitting down to watch \"The Human Centipede III: Final Sequence\", especially since the first movie was mediocre and the second movie was even less entertaining than the first movie. So the third - and hopefully last - installment in the franchise didn't exactly have the cards dealt to it in its favor.\n\nThe cast in \"The Human Centipede III: Final Sequence\" was of somewhat a mixed handful. It was so bizarre to see cast from the first two movies in the franchise return to the movie, but in different roles. That just made for some very confusing associations. And Dieter Laser had a very peculiar way of acting and performing which seems comical and so out of tune, which added a distracting element to the atmosphere of the movie. Much of the time it was like watching a spoiled child trying to lash out in frustration and anger. Actually, it was very disruptive to the rest of the movie, because it was hard to take him serious in the movie. And just how they got the likes of Eric Roberts and Robert LaSardo to show up in a movie such as this was just beyond me.\n\nAt least the dialogue was very much in tune with the rest of the movie, being every bit as forced, ridiculous and weird. Most of it didn't really make much sense, and it didn't really help that most of it was delivered by a whacked out Dieter Laser. It should be said that there is some pretty hefty racial slurs, profane language and such being used in this movie, so do take that into consideration if you are easily offended by such foul language.\n\nThe characters were entirely weird and offbeat, especially most of the inmates in the prison. I mean, their behavior was just so strange that it would happen only in the movies.\n\nThere are some very graphic stuff taking place in the movie, and that might be upsetting to some viewers. But then again, going into watching a movie such as this, then you know what you are getting yourself into, of course. I am a seasoned horror and gore veteran, but even I was finding myself cringing at some of the scenes portrayed in this movie.\n\nNow, I don't really understand the idea or concept of putting the actual DVDs of the former two movies into this third movie. Sure, I get it that it was to present the idea that the events in this movie was based on the events taking place in those movies. But come on, that was just unfathomably cheesy, even for this franchise.\n\nIt was clear already in the second movie that director and writer Tom Six should have stopped with the completion of the first movie, because it has been a steady decline down a steep hill since then. And \"The Human Centipede III: Final Sequence\" didn't prove to improve on the franchise in any particular way.\n\nThis 2015 third installment into \"The Human Centipede\" franchise had a few moments of cringe-worthy visuals, but it was hardly a movie that stood apart from the previous two, and it didn't bring much of anything new to the franchise.\n\nI have seen it now, and color me unimpressed."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "casperwassenaar-83034",
        "review_rating": "8",
        "review_title": "the absurdity and craziness of life is shown in this movie",
        "review_detailed_main": "I am surprised by the mostly negative reviews for this 3rd chapter. It is a bit unfair since this is quite a unique movie with a great insane lead role.\n\nI loved this movie; the Bill Boss character played by Dieter Laser shows humanity in its ugliest and craziest form....and i love it that a movie can create that feeling.\n\nLife itself is bizarre and crazy and this movie shows us that. It is exactly the message what director Tom Six wants to address; life is bizarre and there is no logic in it.\n\nSo please don't take this film too serious; enjoy the acting by Dieter Laser and just be amazed by the absurdity of the main character. His acting is great; i have never seen a more disturbed and deranged person in a movie. I love it; it has been years that i can recall a movie that gave me that feeling.\n\nThis movie grasps the insanity of life itself; therefor it is worth watching.I liked it very much."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Sandcooler",
        "review_rating": "3",
        "review_title": "Really poor attempt at grindhouse",
        "review_detailed_main": "The first one was difficult to sit through because it was boring. The second one was difficult to sit through because it was nauseating (which I can respect, because at least that was the intention), but this third one stands out by just being incredibly irritating. In an interesting twist (the only interesting thing about this movie) Tom Six tries to go for a full-on comedy, but the guy's just a really terrible writer and settles for one lame self- referential joke after the other. It also doesn't help that the two leads (Dieter Laser and Laurence Harvey return as new characters, because oh we're so freakin clever) are really struggling to get through this material. Laurence Harvey was actually pretty good in the second one, but he easily has the worst American accent I've ever heard. And I could barely understand Laser when he spoke slowly and with a normal voice, I sure as hell can't understand all his yelling in this one: I can't even make out when one word ends and the next one begins, let alone laugh at whatever his lines are. Oh, and the one actual clever idea Six had, the one he somehow based three movies around? The human centipede shows up long after you've given up, so the audience doesn't even get what it wants (is this...what we want?). The second one has its merits, forget about the rest."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "allan-97915",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "I have watched all three of the Centipede movies. While not everyone's cup of tea numbers one and two were I thought serious attempts to explore an admittedly disgusting premise. But with Human Centipede III I'm pretty sure Tom Six is just screwing with us. Everything about it Is just plain awful. From the acting, to the story, to the plot, six is just playing with his audience."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "savethemudkipz",
        "review_rating": "1",
        "review_title": "just bad...",
        "review_detailed_main": "Usually I think people are harsh on horror movies but anything greater than a 1 star is generous. The movie is 90% yelling for no given reason, the actors are awful. The movie borderlines on parody but tries to be serious at times, both aspects fall completely flat. At least the other two films were somewhat set in reality, this one is comical to the point where the \"Governor\" and also the creator of the series both make cameos and the Governor is perfectly cool at the end with the human centipede and THE END. Literally as soon as the centipede is made the movie is over, anticlimactic isn't the word. Sometimes horror movies are so bad it's good but this is so bad it's just really bad. Skip this movie at all costs. This movie is just plain stupid"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "macmurphy-10086",
        "review_rating": "2",
        "review_title": "What the actual hell?",
        "review_detailed_main": "What on earth have I just watched?? The other 2 were quite good, but this was absolute drivel. The boss man had a face you just wanted to punch and the whole thing just dragged on far too long. Avoid."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "datorsiers2",
        "review_rating": "2",
        "review_title": "Hopefully it is the final one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "filipemanuelneto",
        "review_rating": "1",
        "review_title": "No more centipedes!",
        "review_detailed_main": "I think this is the first time I write a review about a movie that I have not been able to watch until the end. I firmly believe, after seeing this film, that Tom Six should have some serious mental problem, and I am very sorry because I have never had anything against him personally. I sincerely hope that he will stop working at the movies and be very happy in any other profession.\n\nIf \"Human Centipede\" and the sequel that was inexplicably made afterwards were very bad movies, this movie set the record. Again, there is no real script here but a context and a cause. The context is the prison world and the cause is the madness and insanity of the guards and prison director who decide to build the \"centipede\" with hundreds of prisoners whom they think should be punished more severely. The mistakes continue, that \"medically accurate\" crap is no longer convincing and is clearly being used with sarcasm and the characters are deeply void.\n\nRepeating what I wrote for the second movie, I've never been a fan of gore movies, despite being an admirer of horror movies. Blood and fluids do not scare me, and I honestly do not feel like watching a movie if I suspect it's going to make me throw up my lunch. If I tried watching this movie it was just to be aware of the extent of the crap I already knew he had. I really hope it's the end of the centipedes."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "kosmasp",
        "review_rating": "1",
        "review_title": "Medical my ...",
        "review_detailed_main": "Well I don't have to spell the last word out, but (!) you get the point (and the double bun ... I mean pun - did it become a triple right now?). Now if those jokes make you laugh, you might be onto something. Unfortunately even in being \"funny\", this misses out on character traits. Why would the boss act like he doesn't like Human Centipede when he is exactly the same character like the one we are seeing in the movies? So while this is a movie within a movie within a movie - it is rather juvenille than clever.\n\nThe director is a funny bloke and Dieter Laser is channeling him or his reactions to critics of his movies. Whatever the case, he relishes in everything thrown in his way, so me rating this 1/10 makes him happier than if I had gone 4 or 5. You're welcome Mr. Six! A nod to another critic (Ebert with a non score for the first Centipede, not the only movie that did not receive a rating by the way) is also part of the movie.\n\nSo again, you may find certain things funny (and he is inventive, if rather explicit and vile), but overall this never really does anything other than try to provoke the strongest possible reaction (laughing out loud or feeling the puke running through your veins). The casting is quite nicely - with quite a few familiar faces"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "pahaake-474-839610",
        "review_rating": "1",
        "review_title": "So bad I had to review",
        "review_detailed_main": "If -100 was a score, it would still be too generous.\n\nI don't review movies, this was SO bad I had to.\n\nIt's rare that I don't at least make it 15 minutes into an absolutely awful \"horror\", this insults the word, movie - but I couldn't do it.\n\nThe acting is horrific.\n\nThe direction is horrific.\n\nThe casting, you ask - horrific.\n\nThe script - what's a word that's more horrifying than horrific?\n\nThe only thing not horrific about this film is.... Hmmm... Nothing.\n\nOK, so maybe this is a horror film. I actually found myself feeling insulted by the stupidity. If you like a \"movie\" that actually disgusts you from the first scene and continues to slap you in the face with stupidity and poor acting - watch on.\n\nI love bad movies - this thing is an insult to bad movies. Everyone associated from this tripe should be banned from film for eternity.\n\nI could go on, but this title isn't worth it. Oh wait, your first clue should be that Eric Roberts is in it. After this, he should have his SAG card pulled - assuming he didn't after his last 50 atrocious \"on screen\", cough \"home video\", appearances. No offense to Mr. Roberts, but I mean come on - he has to know he's a terrible actor on his best day."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "poshwithjenniferorlando",
        "review_rating": "8",
        "review_title": "Some people didn't get this movie",
        "review_detailed_main": "And it shows. Mr. Six, Master Trolling level achieved."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "vitalymakievsky",
        "review_rating": "5",
        "review_title": "Not bad just too long.",
        "review_detailed_main": "The movie is a bit winded and long, but this is what you audience demand, so soak-up your time and enjoy.\n\nThis film is ridiculous to an extreme, sure poor acting and other quality issues. But I think the acting of the lead was on point with the theme of the movie.\n\nAll the talk of poor production value is a bit overused. There is not a chance that a major production company would support such a move.\n\nJust enjoy it for what it is. I tired skipping through certain scenes because it does get a bit dull, but then I realized I was missing goofy moments that makes this film watchable.\n\nAgain, if this movie was just 30 minutes shorter I think it would be a pleasant ride."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "The_moan_of_all_moans",
        "review_rating": "1",
        "review_title": "Tom Six needs a new career (after a 10 year stint in a psychiatric ward)",
        "review_detailed_main": "Due to the baffling cult following the previous two films had garnered, the completion of a trilogy was inevitable. Of course the first two films where vile and had their fair share of shocking scenes, but this one...well this takes a whole new shape, and makes me question if Mr Six should be put in a straight jacket and thrown in the looney bin.\n\nThe first film was all about a disgraced surgeon and his delusional, yet accurate, curiosities about the medical possibilities of a human centipede. The horror that followed was all in relation to that initial idea.\n\nThe second was that of a fanatic and his urge to duplicate and elongate.\n\nThis however, boasts racism, sexism, barbarism. It is full of torture, gushing with grotesque analogies (those i could understand)and just a film full of hatred that has clearly been clogging Mr Six's disturbed mind. Yes, many of these topics have been highlighted in countless films, but in most, they have purpose or are handled with decency. There are scenes in this film that are quite simply horrific: Rape, Castration, kidney intrusion.It's perverted and verges on being inhuman. The prisoners are stereotyped in the most blatant way, in what people will describe as an attempt at humor is just an insight into how this directors mind works.\n\nBut worse than all of that, is the acting. Yes the most important part of a film. Dwight Butler (Played by \"Human Centipede II\"'s very own fanatic Laurence R Harvey) is horrific. His Texan accent is atrocious and he is made to look like a bald, bloated Hitler. He was slightly effective in the 2nd film because they played to his \"strengths\"; he was creepy and... well ....that's about it. Dieter Laser also comes back to the \"franchise\", now playing Bill Boss, the wicked warden. It is his acting that is the worst, i say again...the WORST acting i have ever seen. No exaggeration, this is abysmal. All he does is scream nonsensical, indescribable, psychobabble throughout. Be prepared to turn on the subtitles, because you'd have more chance breaking the enigma code than understanding what he is saying. I have to wonder if in the midst of twirling about acting like a complete imbecile, if he thought he was creating an acting masterpiece. Well folks, i can assure you he wasn't.\n\nAs for Tom Six, well i can only hope he is committed."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "noah-65732",
        "review_rating": "2",
        "review_title": "Hopefully it's really over now...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "InaneSwine",
        "review_rating": "2",
        "review_title": "Stupid bungle of a film",
        "review_detailed_main": "I saw the first one twice. I began watching the second one before switching it off half-way through, then building up the courage to finish it a few days later. I managed this stupid bungle of a film in one sitting. I got what I probably deserved - copious amounts of gore, an unfathomable story and some terrible, terrible acting.\n\nI was somewhat impressed with Dieter Laser's performance in the original film, but he is easily the most exasperating aspect of this one - he seems to have confused shouting and bawling at the top of his lungs with acting. What seems really saddest of all though is that he, his co-stars and director Tom Six - who makes the most self-aggrandising cameo in cinema history - seem to genuinely believe that they are making a seriously important work of art. In actual fact, Final Sequence is one of the most grotesque works of alleged art in recent memory."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "CasualReviewer",
        "review_rating": "1",
        "review_title": "Stay away.",
        "review_detailed_main": "This movie...this movie is one of the worst movies in existence. While the various components like acting, camera and more are not the worst I've seen the plot alone makes this movie a zero star piece of crap. The first two movies were bad enough but this one beats you harder than life itself. Watching this movie is equal to rubbing my eyes against a cheese grate while swallowing curdled milk that sat out for a year. Some people compare this tripe to other gory movies but this makes every other movie a dream in comparison. The entire time watching this I didn't just feel like retching, rather I felt immeasurable guilt for wasting my time watching it. I kept thinking \"I could go and learn a new language or help homeless people or just watch another damn movie. Stay away from all three movies at all costs. Even if the first had any merit for some sick man, the two that follow can be enjoyed by anyone besides someone who likes torturing people for his amusement. For all the awfulness that are these movies, I have one positive thing to say. They. Are. Finished and thank god for that."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "anatole_axel",
        "review_rating": "1",
        "review_title": "really another disgusting movie???",
        "review_detailed_main": "Why on earth would someone be so messed up in the head that people would like what goes on in this movie. Honestly just think about this for a second. How much shame and humiliation these actors must suffer because of just going along with this. Oh well they aren't very good actors if they are stupid to be in a movie this vile and disgusting. i mean just the plot i read disgusted me. thank god i will never see the movies. but i am sick and tired of them continuing to make more. and i hope the producers and directors read this review so they know how much their movies suck!!!! i mean seriously you all should be ashamed of yourselves!!!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "tomgillespie2002",
        "review_rating": "1",
        "review_title": "May this series now be laid to rest on the cinematic dung-pile",
        "review_detailed_main": "When The Human Centipede was released back in 2009, it became an instant talking point with both gore-hounds giddy at the prospect of such a repugnant idea actually making its way onto our screens, and those concerned with the idea of cinema reaching the very bottom of the barrel for the last dregs of bad taste. Of course, the result was nowhere near as horrific as many had thought. While it may have featured a scene of characters passing faeces directly from bottom to mouth, the whole thing was rather amusing, if ineptly made. Director Tom Six was keen to ensure that the hype wouldn't die down for the sequel, and did so by creating one of the vilest and most humourless shockers in horror history, and undoubtedly one of worst excuses for a movie ever made. It's a relief that humour has found its way back for part three, as is the presence of the word 'final' in its title. But that's where the positives end, as this is yet another button-pushing, attention-seeking vanity-project for Six.\n\nPsychopathic prison warden Bill Boss (Dieter Laser) rules over his inmates with an iron fist, punishing those that step out of line by breaking bones, removing testicles, and waterboarding with boiling water. With the violence spinning out of control, Governor Hughes (Eric Roberts) pays Boss a visit, informing the maniac that if he doesn't get a hold on things soon he will be fired and replaced. Having seen his brutal methods fail to bring the prisoners under control, Boss finally listens to his diminutive accountant Butler (Laurence R. Harvey) and his problem-solving idea. Armed with DVDs of The Human Centipede 1 and 2, Butler's scheme is to force the inmates to live out their sentences arse-to-mouth with their fellow incarcerates in one long, horrifying... well, you get the idea. With disgraced, struck-off prison doctor Jones (Clayton Rohner) on board in the hope of keeping his job, Boss and Butler even bring in Tom Six himself to discuss whether or not the director's claim of the procedure being 100% medically accurate is in fact correct.\n\nIt was admittedly an interesting move to make The Human Centipede 2 about a disturbed individual's reaction to seeing the first movie, but performing the same trick again simply reeks of narcissism, especially considering Six's decision to place himself within the narrative. While the second entry aimed to simply upset and disgust its audience with no trace of nuance, part three is all about the humour. Although rather than laughing, you'll be checking the running time to see how much you have left to endure. To Six, comedy is all about shouting, and Laser screams, rants and swears for the 100 minutes, stopping occasionally to munch on some dried clitorises imported from Africa or force his assistant Daisy (porn actress Bree Olson) to perform oral sex on him. Anyone voluntarily watching this film are here for one reason - to see the human centipede. It appears around the 85 minute mark, so there's a lot of arm-waving and general unpleasantness to get through before the big pay-off, which only appears on screen for about 5 minutes. I never thought I'd complain about the lack of poor souls being monstrously stitched together to form one grotesque digestive system, but that's The Human Centipede for you. Hopefully this series can now be laid to rest on the cinematic dung-pile."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "nhbxxx",
        "review_rating": "5",
        "review_title": "One scene is worth the price of admission alone!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "david-43978",
        "review_rating": "8",
        "review_title": "Sick, sick fun!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "mostafaalaa-99818",
        "review_rating": "1",
        "review_title": "Basic review",
        "review_detailed_main": "Worst movie/disgusting/don't make any sense Creepy who made this is sick and I hate Tom six"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "vengeance20",
        "review_rating": "5",
        "review_title": "The Weakest Entry Easy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "JontheLobsterLover",
        "review_rating": "3",
        "review_title": "Put your expectations away for this one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "Kanzaki_ken",
        "review_rating": "4",
        "review_title": "A bit good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "zachdeitz2",
        "review_rating": "1",
        "review_title": "Ewwwww",
        "review_detailed_main": "This is the most annoying piece of sh*t I've ever seen I'm even surprise it got higher then a one this movie is terrible never see it you will waste your time this is the worst movie I've ever seen i don't understand how people can like this movie i am all for having opinions but this is the one exception were i just could never talk to u just EWWWW!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "TheRedDeath30",
        "review_rating": "3",
        "review_title": "Apparently Mr Six is Out of Ideas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "joshjack-35680",
        "review_rating": "3",
        "review_title": "Mediocre....",
        "review_detailed_main": "Not very good compared to the first and second films. Very dull and boring. And takes away alot from the first two films"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "ademitch",
        "review_rating": "8",
        "review_title": "'FEED yourself the final chapter...'",
        "review_detailed_main": "Tom Six and his Human Centipede films seem to produce a 'Marmite' response in people. They either love them or hate them. I must admit to being a fan of the films and enjoyed the first two very much.\n\nPart 3 is the final part in the Centipede trilogy. Like the second film it is connected only by the human centipede theme. Very much in the style of a human centipede itself. Each 'segment' is unique but linked together with the other parts.\n\nPart 3 is brash, over-the-top, crazy, ludicrous, revolting and hilarious in equal measure. It's probably the most humorous of all the films with the dark comedy mixed in with almost theatrical farce. The film is a parody of itself with Tom Six giving the middle finger to those all thought the topic and subject matter of 1 and 2 was objectionable and 'should be banned'!\n\nPossibly the best thing about Part 3 is the performance of Dieter Laser from the first movie. His portrayal of psychotic prison warden Bill Boss is quite something. Almost exhausting to watch but gloriously offensive.\n\nChances are that you won't see anything quite this crazy on film for some time. Granted, it's not going to be to everyone's taste. I think you have to 'get' the humour of Tom Six to enjoy it but if you have seen the first two and enjoyed them then this is a must see."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "arthur_tafero",
        "review_rating": "1",
        "review_title": "Sex and Violence Unchained - The Human Centipede 3",
        "review_detailed_main": "The first film was bad, the second one was a bit worse, but this one is absolutely the worst. It is just silly; an hour and change of a bad joke told by terrible actors and a silly screenwriter. The only accurate element in the film is the behavior of an American politician. Everything else in the film is pretty much a bad joke. Salo is one thing, but a prison version of Salo just does not make the grade. Trying to combine the sex and horror genre with the prison genre failed.\n\nSo, this series has accomplished what few other film series have; going from bad to worse three times with a rating of 3 or less. One would be hard put to match that record. The lead actor was funny for five minutes or so, but then became cartoonish, as were all the other situations in the film. There are better ways to do sexual fantasies."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "baileycrawly",
        "review_rating": "4",
        "review_title": "A Case of Bigger Not Being Better",
        "review_detailed_main": "Honestly, everyone who makes it through all 3 of these movies should be rewarded, because it takes a special kind of person to see the original and come back not once, but twice, looking for more. In this supposedly \"final\" entry in the Centipede film series, Tom Six really ups the stakes by sticthing together 100 people in a prison setting, letting loose anything and everything he can possibly think of to shock and revolt the polite society. This film is a middle finger to political correctness and, despite being the weakest entry in the film, it really succeeded well in that regard. Dieter Laser's brutally hateful character gets a ton of screen time, yelling at the top of his lungs at anyone, everyone and everything. Demanding castrations and eating the remains. It really doesn't leave anything to the imagination, and there are no lines or boundaries they aren't willing to cross. Laser (who played the evil doctor in the original), unfortunately, is a little bit too committed to this part, overacting to the point of being either satirical or unintelligible. It's the kind of thing you would watch to be able to say you've seen it (\"I watched every entry in the Human Centipede trilogy!\"), but not something you would ever put on for a casual Saturday afternoon viewing. Not something you would unwind to, and definitely not something you would watch for a date night or house party. I'm glad I watched it, but I couldn't recommend it."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "chow913",
        "review_rating": "1",
        "review_title": "Apply Razor To Wrists and Repeat",
        "review_detailed_main": "Well what can be said about the conclusion to a trilogy of horribly made dark comedies? It does stay true to the first two films as being completely devoid of any entertainment value.\n\nThis time the production quality far worse! Worse than the first two films? How bad could it really be? I'll sum up the production quality this way, it's the worst I've ever seen for a Bree Olsen film! Yeah, that's bad!\n\nI've actually heard some defense of Tom Six's film making as being \"realistic\" and \"gritty.\" NO! It's just lazy. If the director doesn't care about the camera being in focus, the set being lit, off set noises remaining on the soundtrack, or actors missing their lines and not doing a second take it's just lazy. It shows the director doesn't care and the audience will respond in kind.\n\nDieter Laser returns in the lead as a Southern prison warden. A German actor doing a bad Southern accent fails for laughs on every level. NONE OF THE ATTEMPTED HUMOR works on any level!!! And this is 75% of the movie, Dieter Laser acting like Boss Hogg.\n\nThe other 25% are attempted gross out scenes of prisoners being raped in their kidney's and the cannibalization of human testicles. True to the first two films this gore is just plain silly rather than disgusting or morbidly humorous.\n\nSo what does any of this have to do with the human centipede? As the poster reveals, the warden concludes that the best way to maintain order in the prison is to create one giant human centipede. He gets his inspiration from watching.... 'The Human Centipede.' Because a movie within a movie worked so well in the second film.\n\nHence the few brief moments of the human centipede are only seen in the climax, which you could have gotten by just looking at the poster.\n\nSo if you're having any morbid curiosity of seeing this film. Don't!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "JackBrookes96",
        "review_rating": "1",
        "review_title": "WORST FILM I HAVE EVER SEEN!!",
        "review_detailed_main": "Where to even begin. If I could rate this film -100 I would. After the first two films I wasn't expecting anything spectacular but this was something else. Less than 30 minutes in and I'd already thrown up! The acting was atrocious and the storyline was even worse. Genuinely struggled to watch the film it was that bad! I seriously wonder where people come up with these ideas, and how it's made over 16 thousand pounds in the box office absolutely baffles my mind. Makes me wonder what the budget was! I cannot even put into words how bad this film is. The fake American accents were diabolical and the whole idea is ridiculous! I would love to meet the director to ask him what is wrong with him! I think I would actually rather sit and watch paint dry! 1hr 45mins I am never going to get back!!"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "wrignwu",
        "review_rating": "4",
        "review_title": "Tame compared to the first two",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "RodrigAndrisan",
        "review_rating": "3",
        "review_title": "The comedy of s..t",
        "review_detailed_main": "It's the same s..t as before only this time has some sarcasm and it's evident that makes fun of the American society. And, this time it has even a big name in it, the veteran, the most workaholic actor of all time, Eric Roberts. Plus a former porn star Bree Olson, which has some qualities of comic actress too, besides her physical qualities, especially tits and ass. Dieter Laser is not bad in the role of sadistic prison director, the only thing is he's repeating himself in all forms, gestures, facial expressions, would have been much better if they had made an effort, together with Mr. Six, to exploit more of the comic scenes and situations."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "hakobyanhakob81",
        "review_rating": "10",
        "review_title": "Brilliant profound movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "antoniokowatsch",
        "review_rating": "8",
        "review_title": "Different but good",
        "review_detailed_main": "I personally liked the flair of the first Human Centipede movie the most. The sequel was not really my cup of tea but this particular movie took me by surprise. It wasn't really \"scary\" in the traditional sense that is classically associated with the Horror genre but it was really entertaining in its own special way. If you have a twisted sense of humor this movie is going to have you rolling on the floor laughing. It was literally one of the funniest movies I've ever seen. I just couldn't stop laughing: The whole movie was basically a succession of clever jokes that were occasionally interrupted by a couple of nasty and gross torture scenes.\n\nConclusion: this movie isn't really part of the continuity that the first two movies shared but rather a movie that's supposed to be a grand finale.\n\nThe first movie was pretty much a thriller and had you rooting for the people who fell victim to Dr. Heiter's insane experiment. The sequel was just messed up and featured mental abuse as well as self- mutilation. All in one it was very disgusting on all levels possible. The third installment of the franchise however is in my opinion a well thought out comedic take on the prequels. Furthermore Tom Six (the director) had a cameo appearance which made for some good meta- jokes. Something that is rarely seen on screen these days. It suffices to say that I liked it very much. If you have a dark sense of humor, as do I, you'll love it, too."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "banditking-11857",
        "review_rating": "10",
        "review_title": "The \"Final Chapter\" is a fun, gory film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "theclawnhammer",
        "review_rating": "10",
        "review_title": "amazing...",
        "review_detailed_main": "I expected a terrible movie; torture porn....something akin to the last few saw movies or CGI sci-fi channel crap which has ruined the horror genre for the last decade plus.\n\nWOAH. Was i surprised by this one; I enjoyed human centipede1 for simply the train wreck of it all, but felt it wasn't that entertaining and certainly horrible in terms of its acting outside of Dieter Laser. But more about him, in a few...\n\nThis movie was the most enjoyable movie i've seen this year; no joke. I laughed from the first moment; I sensed that Tom Sixx was trying to make political statements with this film, and he did, and that he had to go over the top to be poignant, was appreciated.\n\nDieter Laser, who is in his 70s(!) and plays the racist sadistic sheriff, is absolutely riveting. I simply cannot believe how great and BRAVE of a performance he gives in this film. From interviews on you tube, where many (speculate that Dieter is also vile) you get a sense that he poured his soul into this role, and all the passive aggressive feelings he had about Nazis from his youth seeps thru in this role. One cannot see him in this role, and not be reminded of the third Reich, and what it takes to simply have no humanity. Tom sixx does not shy away from showing the very real sexual deviancy connected to how we seek punishment. Also, Dieter Laser reminds me of sheriff joe from my state of arizona. Its uncanny, especially the ego and bravado by which he devours everything around him like the snake he imagined when playing this role (more info discovered from his interviews on you tube.) That is why he wears snake cowboy boots; its a nod to the animal he used as homage to his performance via his method acting.\n\nIf you go into this movie hoping for loud techno, and boobies, and one liners, and feeling good for some hero to rise up and triumph...thats not this movie. If you want to watch perhaps the blackest comedy i've seen in many years, which is also a mirror imo for our culture and the joy we take in the torture of prisoners... well... this is your movie.\n\nI still can't believe how much i like it. cheers world"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "naarsill",
        "review_rating": "10",
        "review_title": "Best film of an incredible trilogy",
        "review_detailed_main": "This was the best for two reasons: most shocking of the trilogy as well as the most humorous, in a very macabre way. I would have preferred to see Bree Olson's character's labia cut, boiled and eaten and the testicles on the plate fully masticated.\n\nThe joke is on American audiences if they think the director is sick or this is a new cultural low. United States of America's morals and cultural attitudes are indicted here by a genius director and it's a dark satire that Stanley Kubrick would be rising in his grave if he could see it. The incessant yelling, racism, violence, sexual depravity is all a major part of American society, this movie is extremely relevant. This makes Dr. Strangelove seem like a 1930s silent film."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "mauvemage",
        "review_rating": "8",
        "review_title": "Eat crap and lower crime!",
        "review_detailed_main": "What a wonderful movie! I mean the first Human Centipede had the strong shock effect, the 2nd film cleverly explored what could happen if a fan of the original became obsessed with the 'human centipede' concept.\n\nThis one brings back the wonderful lead actors from the first 2 films and creates a vision of pure hell and does it will splendour and laughs. How anyone can really knock a film with porno cutie Bree Olson playing a hot secretary is beyond me, but in a 'mainstream' role, she's really good.\n\nSet in a maximum security prison in a boiling hot southern state, a crazy governor and his loyal assistant create the ultimate deterrent!\n\nIf I ran the world, I would do this to the worst criminals, the Guantanamo inmates would REALLY have something to complain about.\n\nIf you like movies to be bold and fun, this is the film for you."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "catteberry",
        "review_rating": "10",
        "review_title": "Out standing",
        "review_detailed_main": "Quite frankly the finest piece of cinema ever produced"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "djdauwish",
        "review_rating": "10",
        "review_title": "Masterpiece horror dark comedy",
        "review_detailed_main": "One of the horror dark comedy I have watched more than ten times...Trust me William Boss character is outstanding 😄😁😆Respect to director Tom Six"
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "abachmaier",
        "review_rating": "8",
        "review_title": "A unique,interesting and gory film!",
        "review_detailed_main": "I disliked the first human centipede film. It was not funny enough or graphic enough so it was in a Gory area. The 2nd film was amazing! Well,not like \"Citizen Kane\" amazing LOL. I found the absence of color and no dialogue from the main character to be interesting choices for Tom six to make. It was very very graphic though and i found myself enjoying the tamer scenes of for instance Martin sitting at the dinner table as his mother verbally abuses him and finding out what made him into a psychopath as opposed to the scenes of him putting barb wire around his penis and having sex with the unfortunate girl at the end of the centipede. Anyway,I would give the 2nd film an 8/10. Now, onto the 3rd film. The film stars the 2 doctors from the previous films playing different characters. The doctor from the first film is the warden of a prison where he is struggling to maintain order. The doctor from the 2nd film proposes the idea of making a human centipede from all the prisoners to teach them a lesson. The film has sort of an exaggerated color scheme which i found to be appealing although some have complained it looked \"cheap\". I didn't find the main characters to be annoying as others did either. It was a good blend of horror gore and comedy in my opinion."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "roythedog",
        "review_rating": "10",
        "review_title": "I actually enjoyed this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "markhale-22640",
        "review_rating": "8",
        "review_title": "The human centifruge",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "StevePulaski",
        "review_rating": "8",
        "review_title": "Can't wash this taste out of your mouth with Listerine",
        "review_detailed_main": "How many franchises can you say managed to realize their potential and hit the nail on the head with their third and, in this case, final film? The Human Centipede III (Final Sequence) is the only example I can think of, as it works off of two contemptible predecessors that did nothing but squander such a grotesque but devilishly intriguing premise. While the first film ran out of gas after about thirty minutes, and the second, despite attractive, saturated black and white cinematography, found itself nothing more than a tired array of vignettes bearing shock value, the third film takes a more slowburn, structured approach to the concept of a human centipede. It relies on character development, commentary, and a cross between the disgusting and the humorous to make a film that exploits its concept for just about the last ounce of energy its able to muster before we conclude one of film's most perplexing trilogies.\n\nOpening by showing the end credits to The Human Centipede II, in a manner to how that film opened, we find ourselves inside a prison complex run by Bill Boss (Dieter Laser). Boss is a loud, domineering, and unbelievably miserable guard, demanding respect from his inmates who, in turn, return nothing but the same hatred he shows to them. Alongside Boss is Dwight Butler (Laurence R. Harvey), his chubby and more level-headed accountant, who usually supplies him with the brains he's lacking, and Daisy (Bree Olson), his secretary who also serves as his sex slave.\n\nBoss spends most of his days making life a living hell for the inmates who disrespect him at every turn, and it isn't until Governor Hughes (Eric Roberts) visits the prison and orders a cleaner, more humane atmosphere does Boss realize he may need to straighten himself and the prison up. With that, Dwight, in the mix of his fascination with the first two Human Centipede films, suggests to Boss that, in order to create a less violent atmosphere and discourage crime all together, the two of them could hire surgeons to create one long, five-hundred person human centipede out of the inmates at the prison. Boss loves the idea and immediately gets to work, even going as far as hiring Tom Six, the real-life director of The Human Centipede films, to offer his own personal input.\n\nLaser gives his most intense and hilarious performance to date, going absolutely over-the-top with his role, making his \"mad doctor\" performance in the first film seem minimalistic in comparison. Laser is a force of nature in this film, constantly yelling or looking as if the veins in his skull are about to rupture, making for a performance of true power and conviction throughout the entire film. Harvey, in addition, creates another character that is interesting by his very nature, only this time, he's given more of a developed role than what was seen in the second film. Together, the two form a sick, twisted, but often very amusing, duo that impress in nearly every scene.\n\nWhat The Human Centipede III achieves that the previous two installments couldn't bother to muster is some resemblance of narrative order rather than capping out on senseless shock value or running their own premises dry. Six takes more of a slowburn approach to the story here, allowing us, the audience, to explore the prison environment with Boss and Dwight, and find ourselves inside an environment rather than being onlookers or observers into it. Despite numerous situations being disgusting, the film, like its predecessors, is remarkable in how grounded and professional it remains in look and feel. These films do not feel like low-budget, low-grade cheapies, but bear a distinctly clean, accomplished look that some medium/high-budget horror films can't normally achieve.\n\nBut most importantly, the fact that The Human Centipede III takes story, character, and even societal commentary about the prison system and institutional punishment all into consideration makes it a more enjoyable film rather than a sick exercise in depravity. This is a film one can actually enjoy as a film rather than being mystified at the shock value behind the idea. There's more to appreciate about Six's craft and the talent of Laser and Harvey that surfaces because of the care and attention brought to the forefront here.\n\nI'm sure many who will read this review will roll their eyes in confusion and disbelief. In my opinion, that's one of the milder reactions one could have to this film and a positive review of it. But it's important to recognize the series's original roots and how it has evolved with its final installment. I've long held the belief that a good film can be made from just about any, if not all, premises under the sun and Human Centipede III only makes me affirm that belief. It came from being shock that couldn't sustain an entire film and shock value that only grew more and more tiresome when built upon continuously to something truly worth remembering and praising. The Human Centipede, with its third and final film, surpasses the stigma of its gut-turning idea and becomes a realized and convincing story; it's the definition of a series that ended just as it was getting going.\n\nStarring: Dieter Laser, Laurence R. Harvey, Bree Olson, and Eric Roberts. Directed by: Tom Six."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "filippakg",
        "review_rating": "10",
        "review_title": "I have never laughed this much during a film before",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "lhvoliveira",
        "review_rating": "8",
        "review_title": "The movie entertains, ignore the bad reviews",
        "review_detailed_main": "I saw the three movies in different contexts, and I must say that I liked this film, it's completely different from the other two, not least because it has a much more comic side. People might not be expecting it or wanting something else, but honestly I think it's a good movie and I can't even understand why so many negative reviews. I would have to review the movie too, but I felt compelled to write this review after seeing so many negative reviews.\n\nAnd I even say more, of the three films, this is the one I can say I like the most, because it doesn't take itself so seriously, but of course, it's stupid to compare them because they are completely different."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "unknownegri-88845",
        "review_rating": "10",
        "review_title": "One of the most entertaining movies ever!!!",
        "review_detailed_main": "I never wrote a review for any movie in my life, but I felt the need to do this for this one.\n\nFirst one was ok.\n\nThe second one was an alright horror movie, let's just leave it at that.\n\nSo I watched the third one with 14 other people.\n\nAt the first 10 minutes I was overwhelmed by Dieter Laser's acting. It was so over the top and it left me so confused, then 5 minutes later I was just hoping for more and more from him. You can feel that He gave it his all and it is such a joy watching him (I never laughed so hard in a movie) Watch it and unless you are easily offended, you will have a good time."
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "McEwansExported",
        "review_rating": "",
        "review_title": "How did this film franchise get so bad?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1883367",
        "movie_name": "The Human Centipede III (Final Sequence)",
        "movie_rating": "2.7",
        "review_username": "jprizzotto",
        "review_rating": "",
        "review_title": "WORST MOVIE EVER MADE! AVOID IT AT ALL COSTS!",
        "review_detailed_main": ""
    }
]