[
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Captain_Couth",
        "review_rating": "6",
        "review_title": "Revenge of the 80's: Multiple sequels.",
        "review_detailed_main": "Police Academy 3 (1986) The inmates are now running the asylum. Mahony and company are now instructors at the place they once attend. Running out of ideas and funny situations, the film starts to repeat (ad naseum) many of the gags and punchlines from the first two films. While new characters are being added to the series, a few old one decide to leave (for good). If you notice, the bigger the star Steve Guttenberg becomes, the lesser screen time he gets. Oh well.\n\nSlightly recommended. If the producers have thought with their heads instead of their pocket books, they should have put this series to bed instead of dragging it out and running the series until the wheels and the engine fell off."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "bkoganbing",
        "review_rating": "6",
        "review_title": "To Save The Old Alma Mater",
        "review_detailed_main": "Police Academy films are a weakness of mine, they are stupid, vapid, idiotic and funny as all hell. I do so love these characters and they are in top form as the goofball graduates from the first Academy come back to save their alma mater.\n\nIt seems that budget constraints have forced Governor Ed Nelson to close one of the two Police Academies. The first one is run by clueless Commandant Lassard as played by George Gaynes. The second is a discipline factory run by the nemesis of the graduates from the second Police Academy movie, Sergeant Mauser, played with relish by Art Metrano now a commandant of that Academy.\n\nSo a contest is to be held to see which one stays open and our regulars, Steve Guttenberg, Bubba Smith, Michael Winslow, Marion Ramsey, David Graf, and Leslie Esterbrook go back to help the captain they made life hell for as cadets.\n\nWhen you think about it, are the Police Academy movies any different than the classic Keystone Kops? A lot of the same gags are used and a lot more of them that could never have been got away with back in those days. But the idea is the same, an irreverence for law enforcement in the funniest way.\n\nThese are not films to write elegant tomes about, they are films to laugh whatever part of your anatomy off you want."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "4",
        "review_title": "Basically the same thing as one and two combined.",
        "review_detailed_main": "Yes, combine the first two movies take away most of the cussing and raunchy jokes and you have the start of the very stale Police Academy sequels. I enjoyed the first two films, and I will say this one had some laughs, but way to much wrong with it to be considered even an okay film. The only redeeming factor is that once again G.W. Bailey is absent and the more funnier Mauser is in this one with his assistant Proctor. They made for most of the humor and Mauser's absence in the next film stands out to me. The story has two police academies in an area and one of them is to be shut down. Mauser is in charge of one, and granted how did he get an academy since the last movie is a rather good question. One wonders is this supposed to be a sequel and for the most part other than this strange turn it seems to be. Most of the jokes have been done, Bobcat is back and you wonder why. He was good in the last movie, in this one his presence is overkill. I thought how Mahoney in the first film got into the academy there is no way Bobcat could have. So all in all the start of very weak sequels and you will begin to know the jokes by heart."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Big Movie Fan",
        "review_rating": "",
        "review_title": "It's Back To School",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "5",
        "review_title": "PG time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "jaxson-2",
        "review_rating": "7",
        "review_title": "Great for a Sunday afternoon...",
        "review_detailed_main": "In this sequel, the same slapsticks that have been used in the first two movies are apparent and that's what makes it fun to watch. Michael Winslow, who plays Jones, has once again entertained me with his vocal prowess. Also Hooks' (Marion Ramsey) timidness is easily shrouded by her tough side always saying \"Don't move, dirtbag!\"\n\nSteve Guttenberg (Mahoney) didn't need to stretch his role for this one. It is still fun to watch after 13 years of it's initial release. One of a perfect movies to watch on a lazy Sunday afternoon."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "EijnarAmadeus",
        "review_rating": "2",
        "review_title": "The third and last entertaining of them all",
        "review_detailed_main": "Almost boring but still pretty funny. Mahoney, Jones, Hightower, Lassard and some news...as Callahan, the big breast woman and some more pathetic policepeople.\n\nTwo years after the original. And I don't like to call this a good comedy - it's still okay.\n\nIt's the same type tough - falling into boxes, the chief's goldfish almost dies, Callahan kicks a bad-guys ass while flirting with her boobies, Mahoney makes jokes about Lassard and Jones makes sounds. There you go - the whole movie! Role dice: 3"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Mister-6",
        "review_rating": "7",
        "review_title": "They're \"Back\" and they're bad....",
        "review_detailed_main": "While still suffering from the humor limitations of being rated PG, \"Police Academy 3\" has sight gags enough to make it worth watching a few times (at least more often than \"Part II\").\n\nThe gang's all here and trying to train a new line of cadets in their own image (poor cadets) while Lassard (Gaynes) tends to his goldfish and tools about in his modified golf cart.\n\nEven Bobcat Goldthwait returns as Zed, this time training to be a force of good. His scenes breathe a lot of life into this affair, as he screams at doors until they fall down, terrorizes his fellow cadets, hot wires police cars with his teeth and sings at the most inopportune times.\n\nEveryone else has at least one good scene, maybe two. And considering how many are in the cast, that leaves room for a lot of good scenes. Even Georgina Spelvin is back from the original and, bless her, she makes good, too (though not as hilarious as in the original).\n\nThis is about as good as the sequels get, so look no further for laughs than \"Police Academy 3: Back in Training\". Definitely Bubba Smith's finest hour.\n\nSeven stars. Good job, officers."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "The-Sarkologist",
        "review_rating": "5",
        "review_title": "Another Training Episode",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "departed07",
        "review_rating": "7",
        "review_title": "The best of the series",
        "review_detailed_main": "Police Academy has made over seven films plus a toy lineup and a dumb TV show. But from all of the Police Academy movies, this one had more laughs than the original and the rest of the sequels. The whole premise of Police Academy 3 is that Lazard's squad is being challange by former Academy member Mouser for best cadet school, its up to Lazard and his gang of misfits from Mahoney, Hooks, Jones, Hightower and Tackleberry along with Zed and Sweetchuck and that Japanese guy from Revenge of the Nerds to win the game and proved that they are better than Mouser's school. Yes, it has its flaws, but the laughs keep on coming and that's what i liked about this one.\n\nThree out of Four stars."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "MovieAddict2016",
        "review_rating": "1",
        "review_title": "Why? Oh, why did they keep making more?",
        "review_detailed_main": "Police Academy should've stopped after the second film. But nope. They decided to make 7 or 8 films, and two series. What kind of dopes ran these films? Anyway, MAYBE watch this on a saturday or sunday afternoon like I did when you've got nothing left to do. Other than that, don't waste your money on it. I stopped watching these films after the 4th. I'm sad to say I even saw that many. Once again, only Bob Goldthwait make this worth watching. Even then, it's hard to bear. 2/5 STARS-only because compared to the later sequels, this isn't even bad!\n\nJOHN ULMER"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "malkane316",
        "review_rating": "8",
        "review_title": "quick reviews!",
        "review_detailed_main": "Here we go\u0085I don't care what anyone says, this is funny. Yes the series gets worse with each film, but any of the first 4 are better than any American Pie, or any teen comedy ever. The characters have already been established, with the main additions being Bobcat Goldthwaite as Zed, who is endlessly funny, and Mauser as the rival Cmndt. Plot? There are two Police Academies; one must close so a series of competitions are set up to see which is better. Mauser recruits Copeland and Banks from Lassard's school as traitors, but Mahoney and crew eventually prove the better. But these movies are not about plot. Some would say they're not about comedy, or anything else, but as a kid, nothing made me laugh more than these films. And they still do. Jones makes loads of noises, Tackleberry watches his in laws punch each other, Mahoney makes his usual comments, but Zed and Procter are my favourites here. The Blue Oyster Bar is back, and other scenes that keep me laughing are the arrival of Sweetchuck to the Academy, crashing into the car, and Zed singing to make a door fall. I see why people find these completely irritating, but I'm pis*ing myself thinking about them. While I was reading some of the (mostly negative) reviews of this, where people were slagging off the parts they didn't find funny, I was in stitches. May say something about me-but that's something I'm not ashamed of.\n\n8 out of 10"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "jhaggardjr",
        "review_rating": "7",
        "review_title": "Nearly as funny as PA2; not as funny as PA1",
        "review_detailed_main": "\"Police Academy 3: Back in Training\", the third movie in the comedy series, is a funny second sequel to \"Police Academy\". \"Police Academy 3\" has almost the same amount of laughs as \"Police Academy 2\". It's just a tad below the second movie. However, both movies can't top the original. But like \"Police Academy 2\", \"Police Academy 3\" is much better than some of the other sequels that followed.\n\n*** (out of four)"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "2",
        "review_title": "Running on, and affected by, fumes",
        "review_detailed_main": "New recruits, the old ones running the place. Yeah, that's about it for the plot. They need to impress blah blah blah. Do you even care? I don't. We've heard it a million times before. It's nothing but an excuse for the terrible jokes and gags, which, I might add, are mostly(when this is actually trying to be funny, and it actually doesn't seem to be doing any such thing for half of it) repeated ad nauseum from the second(I didn't think it could get worse than that one... they managed it) and, I hear, the first. It all culminates in a pretty unconvincing chase. The obnoxious stuff is multiplied. This is racist and disgusting. And the guy who's driving that suddenly speaks English, from one moment to another. Characters we've seen before are made cadets, for no reason. Smith can't act. In fact, the performances here are awful. Bobcat Goldthwait is himself more in this(why are people laughing at it? Let's be honest, he probably suffers from serious mental problems). No one would behave like the people in this do. At least there is a hot chick, and a little proper, if very basic, martial arts in this. There is strong language in this. I recommend it only to those who refuse to heed the warnings. 2/10"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "mcfly-31",
        "review_rating": "",
        "review_title": "Still goin' strong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Karl Self",
        "review_rating": "5",
        "review_title": "I just LOVE a man who eats shrimp that way!",
        "review_detailed_main": "I have a lot of sympathy for the Police Academy venture, and the third episode does still pack quite a few memorable scenes, but especially in its second half (starting with the party), it does run out of steam and becomes formulaic. I didn't like the megaknockers-meets-Chinaman affair between lieutenant Callahan and cadet Nogata, and the denouement (academy staff and cadets prove their worth by riding around on speedboats) is total hogwash.\n\nThis third part got a lot of exposure, and many people assume that, because it's somewhat bit shoddy, the previous episodes must have been just as lacklustre or even worse, which really isn't the case.\n\nIt still works as brainless fun, especially if you fast-forward through that final marina chase segment."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Anonymous_Maxine",
        "review_rating": "6",
        "review_title": "\"It's a matter of the mind being mightier than the bosom.\"",
        "review_detailed_main": "I gotta admit, ladies and gentlemen, I don't really find this stuff amusing anymore, but for some reason the Police Academy movies are still their own brand of fun. I was just reading through some of the message boards about the movies on the IMDb about what peoples' favorite scenes were from part 3 and from the series as a whole, and not one of the scenes mentioned was genuinely funny to me anymore. I remember when I was a kid I loved the movies unconditionally and used to drive my brother insane because I always wanted to watch them, but I can't really remember if I just found the movies fun or if I actually got some good belly laughs out of them. Regardless, the vast majority of the comedy has not dated well, but they are still an amusing romp through the hilarious clothing and comedy styles of the 80s!\n\nThis time around, Commandant Lassard finds himself in a bit of a moment of crisis as the governor decides that it is no longer financially reasonable to maintain two police academies (the other one headed by the beloved Lieutenant Mauser from part 2), and so one of them will have to be closed. Which academy will be closed depends on performances during a period of observation by an evaluation team.\n\nNeedless to say, Mauser employs the help of the hilariously idiotic Proctor and the same two goon cadets, Copeland and Blanks, who have been employed by both Mauser and Harris to create problems for our cast of heroes since the first movie. In order to save Lassard's academy, and their own beloved alma mater, from being closed, all of our favorite Police Academy cast members have been brought back from Their First Assignment to become instructors at the academy and ensure that the place looks good.\n\nSo there you have the setup and the basic plot, and other than that it's essentially exactly the same movie as the first two. The characters are the same, the music's the same, the good guys and bad guys are the same, just the skits are different and this time we have the addition of a few negligible characters, the token geek (Sweetchuck), the token Japanese guy (who really serves no other purpose than to grin like an imbecile and become mesmerized by Callahan's prodigious bosoms), and also the ridiculous additions to the force of Fackler's nutty wife and Tackleberry's nutty brother-in-law. You know, the guy who is always trading punches with his own father. Can you imagine putting a police uniform on such a man? Only in a Police Academy movie!\n\nThere is not really anything of special note that happens during the movie, although it is a little revealing that this is arguably the funniest installment in the entire series. In keeping with the two preceding movies, we are introduced to the characters in the same way, by glimpsing them in their current lives before the needs of a new movie call them back to the Police Academy world. Hightower is dressing up as an old woman in order to catch purse snatchers in the park, Tackleberry is playing safari in the backyard with his brother-in-law, Fackler is trying to prevent his wife from joining the force (in a scene eerily reminiscent of his first scene in the original movie), and Mahoney is a\u0085women's basketball coach?\n\nWhatever, it doesn't matter what they're doing, their current occupations or pastimes or whatever are just little jokes as they're introduced into the movie. Unfortunately, it's hard to imagine a time when Mahoney's constant flirtations were not as purely creepy as they are now. And that mischievous grin he gets when he's about to play a trick on someone. I need a lot of beers before that's funny, although I would be lying if I said the Police Academies aren't a lot of fun after the beer count enters the double digits.\n\nUnfortunately, there is also a definite feeling that in this installment the movie has turned into even more of a series of goofy jokes. Of course, the whole series is a bunch of goofy jokes, but I think that the second sequel is the first time when the characters that we know are used to throw in some moronic sight gags in order to get a cheap laugh, like when Tackleberry pulls out his gun and shoots a payphone because the operator refuses to relinquish her quarter, or Proctor getting locked out in the hallway ass-naked by a prostitute. On the other hand, my beer count was getting up there by this point, so I found both scenes to be pretty funny.\n\nIt is important to realize that director Jerry Paris developed most of his directing experience on television comedy series, which may have something to do with the, ah, conspicuous lack of subtlety in a lot of the sight gags in Police Academy 2 and 3. It's interesting to consider the impact that his personal directing experience before coming into the Police Academy series may have shaped the series as a whole, which moved in that direction and then never managed to get away from it. Ad now it seems that Steve Guttenberg is attempting to put a Police Academy 8 in motion, in which case I can only hope that he doesn't try to reinvent the series, although I have a feeling that it would take nothing less than a total reinvention to make yet another sequel worthwhile"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "4",
        "review_title": "Alright it's true, it should have ended long ago!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "And then there were three. Steve Guttenberg said \"no\" to being in this or any other sequels that may follow, a good choice. Quickly rushed into production to capitalize on the successful first films. From an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them. This is probably the worst of the sequels, with nothing to laugh at. By this film the series became even more unwatchable and somehow even more redundant. It's the kind of film that tries to show that a small story can be much more meaningful than a larger one -- and fails."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "TheOtherFool",
        "review_rating": "3",
        "review_title": "Worst of the bunch?",
        "review_detailed_main": "So it's yet another Police Academy... who knew this wouldn't even be the half of it? In this one the well-known recruits of the first Police Academy has to learn the tricks to the new batch, including Sweetchuck and Zed, who we saw in Police Academy 2.\n\nToo bad this one doesn't have a story in it, or it should be that Lassards Police Academy is rivalling Hausers (but aren't they always?) because one of them has to close down. And that's about it... now this is wearing thin!\n\nThe last scenes include an old-fashioned but hardly entertaining chase scene but overall this movie doesn't bring anything new to the concept. Even a bit boring at times. Loved Zed in this one though...\n\n3/10."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Bored_Dragon",
        "review_rating": "6",
        "review_title": "There should be more of Michael Winslow",
        "review_detailed_main": "The third film sticks to the recipe established by the previous two, but why change the winning combination. The same cast in the same roles once more performs the same jokes in a slightly changed environment. The movie does not bring anything new, but the old stuff did not become boring just yet. Pouring sand in the desert will not be able to drag people to the theater forever, but for now it still works just fine. You will not be thrilled, but you will relax and have a good time.\n\n6/10"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "mentalcritic",
        "review_rating": "1",
        "review_title": "The title is a giveaway...",
        "review_detailed_main": "The Police Academy concept always worked best when the action was set in the titular environment, ie when a new bunch of misfits are being trained. Which is ironic, because of the seven (with an eighth apparently on the way) films, only this and the original stick to the formula. While stagnation is never a good thing, a franchise like Police Academy should be encouraged at every turn to do what works best.\n\nThe title also sums up the entire plot, although a little effort also goes into the setup. Essentially, there have been two police academies in this town for a while now, and the city's administration has decided that it cannot afford to keep both open. The decision as to which will be closed at the end of the current graduating class is to be made on the basis of which class performs better in the eyes of an evaluation committee. The winner is never established in a manner that would put it beyond a shadow of doubt, at least to a completely cynical viewer, but the whole film is about the journey, not the result.\n\nA major plot hole exists in the shape of the two types of recruit the academies display. The Mauser academy looks more like a front for the Aryan Union or the like, and the Lassard academy remains a haven for the usual mob of misfits, only this time without any stoolies among the recruits. Correct me if I am wrong, but if the mayor has decided that none of the usual discriminatory factors used to screen the intake of each police academy no longer apply, shouldn't that decision apply to both academies? Or indeed every academy that the city (or state) has?\n\nThat aside, this was the last film Art Metrano appeared in before an accident left him unable to walk. Like Street Fighter did for Raul Julia, this is the kind of memorial you wouldn't wish upon any actor's career, regardless of their output. Not that he is particularly noticed in this episode. While Harris isn't present to make him redundant, the overcrowding of the cast doesn't leave him with a lot of things to do. He is unmemorable enough that nobody really noticed his absence from future PA films, or films of any kind for that matter.\n\nA more skilled actor such as George Gaynes, for example, is able to use the minimal screen time he gets in order to make his character memorable. As the near-senile commandant who is supposed to be the focus of sympathy, he makes his mark well. Why he's never been in anything more substantial in the past twenty years, I will never know. For the rest of the cast, hitting the one note they are capable of is perfectly sufficient, and considering the proliferation of so-called a-list stars who cannot even achieve that much these days, I think some cast members deserve more credit than they get.\n\nThis is truly Bobcat Goldthwait's film. As the latest recruit at the Lassard academy, he goes into a literal overdrive of screaming and nervous tics. It is an odd testament to the man's talent that he can literally make this work as a comedy act. What made Mahoney so loveable and funny in the first film, Zed exploits to greater heights. When Steve Guttenberg refused to come back for episode five, they should have offered Bobcat the sky to take his place. The results of them not doing so are now a matter of historical record.\n\nI gave Police Academy 3 a one out of ten. On a purely intellectual level, it is less than zero, but in terms of pure fun, it scores a few points. Those who have to follow a series should be advised that this is the last of the PA films that this could be said of."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "james_cocos-snowboots",
        "review_rating": "9",
        "review_title": "An ensemble cast that beats \"It's a Mad, Mad, Mad, Mad World\"!",
        "review_detailed_main": "Mahoney is the ultimate lady-killer! Hightower shines in his element; drag! Sgt. Jones is the ultimate human beat-box! Police Academy 3 is the best of the series. The main characters have been established and are now free to indulge in the astonishing comedic interplay that is the triumphant hallmark of the Police Academy series. With the addition of the always gut-busting Bobcat Goldthwait as Cadet Zed this marks the finest moment in 80's comedy history. The only thing that would improve this movie is the addition of Gilbert Gottfried to the cast. It is difficult to pinpoint any highlights of this movie because there are so many, but if you like Police Academy, you will adore \"Back in Training\". Spencer Tracy, Milton Berle, Sid Caesar, Buddy Hackett, Ethel Merman, and Mickey Rooney need to take a backseat to the new American Comedic Heroes: Steve Guttenberg, Bubba Smith, David Graf, Michael Winslow, Marion Ramsey, and Leslie Easterbrook."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Woodyanders",
        "review_rating": "7",
        "review_title": "Somewhat lesser, but still enjoyable entry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "2",
        "review_title": "Didn't laugh once",
        "review_detailed_main": "POLICE ACADEMY 3: BACK IN TRAINING was where the series all started to go downhill for me. Throughout this movie I didn't laugh a single time, as every single joke is either low brow, unfunny, or so far telegraphed in advance that you're simply sitting around and waiting for the punchline. The character humour that fills the movie is a mere repeat of what's come before, while the new characters hardly test the talents of the writer.\n\nSteve Guttenberg and his buddies are back, this time getting involved in the training side of things due to a threatened department closure. There are plenty of familiar faces around but every single one of them is given very little to do other than to play up to their character's stereotypes. Others, like a returning Bobcat Goldthwait, just turn out to be irritating beyond belief. And don't get me started on the incessant racial stereotyping of the Japanese guy..."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Some Laughs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "LeRoyMarko",
        "review_rating": "4",
        "review_title": "Starts to wear thin",
        "review_detailed_main": "There's still funny moments. But there's fewer and fewer of them. It's actually a good thing that the movie isn't too long. Even then, the final scene at the marina is way too long. There's a few good laughs and it's good to see some of those idiots again. Mahoney, Callaghan and of course Tackleberry... Nice recruits too! Especially Zed and Sweetchuck. But the franchise is truly going down. Great again to see the Toronto skyline and some city landmarks. Don't rent this one. Try to get for free on cable or at the local library like I did. Seen again at home, in Toronto, on January 1st, 2007.\n\n59/100 (*)"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "nicholls905-280-546911",
        "review_rating": "6",
        "review_title": "Only decent sequel",
        "review_detailed_main": "Police Academy was rushing films out after the success of the first film. This is the best of all the sequels and one could forgive the first sequel. The key to this having a coherent storyline is the direct connection with the first film. The film is still deeply flawed and suffers from a ratings reduction for the youthful audiences. The film will have its fans, but it is no where close to the original. Fun and fitting for a certain age group, but not great."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "MovieAddict2016",
        "review_rating": "1",
        "review_title": "I agree wholeheartedly with the tagline...",
        "review_detailed_main": "They're back. Again. They will be four more times. And there's absolutely nothing you can do about it whatsoever.\n\nCarey Mahoney (Steve Guttenberg) is back with his band of dim-witted officers of the law in this second (*gulp*) sequel in the \"Police Academy\" series. This time the half-baked, half-mixed plot involves Commandant Lassard's (George Gaynes) Police Academy being threatended to shut down when the city announces one of its academies must close due to funding. A competing academy schemes deviously in childish ways to get Commander Lassard's new cadets to screw up and therefore make Lassard's academy look bad (resulting in the city closing it down) -- and so Carey Mahoney and co. are brought in to restore peace and point out the bad guys for who they are -- typical, immature bad guys in a very, very cliched script!\n\n\"Police Academy 3\" is the starting point of a very ill-fated series; a series whose downfall began with the very first (and which should have been last) entry, and is now starting to become something so disgustingly hideous and vile that it makes you want to close your eyes and whine. Okay, I'll admit it, as horrible as the first two were, they were passable in a strange sort of way. (It's amazing, the kind of thing that will entertain you at 3:30 in the morning.) But \"Police Academy 3\" is just awful -- the type of so-called \"comedy\" that isn't as much a comedy as it is a gigantic sore. I watched it on a truly lazy Sunday afternoon -- which may be why, in my original, older IMDb review, I said it was the type of comedy for people too lazy to mow their lawns on Sundays (something I usually do but had put aside on this particular day for...this...)\n\nSurprisingly, the film was directed by Jerry Paris, the man who helmed Part II in the neverending series. He is both an accredited actor and director, appearing in \"The Untouchables\" (the TV show, that is), \"The Dick Van Dyke Show,\" and directing some classic television programs, including \"The Odd Couple\" and \"Happy Days.\" Guessing from the outcome of the two films, you'd never guess that he has any background whatsoever.\n\nWhy Warner Bros. thought shoving him towards the general direction of the director's chair was a good idea is beyond me, but the man obviously suffers from a rare disorder among men named Ican'tdirectavitis (a noun meaning \"incapable of directing even if the fate of mankind depended on it\"). Jerry Paris obviously favors dumb sight gags over intelligent humor. He would be great for some kind of \"Three Stooges\" remake that I hear the Farrelly Brothers are getting into -- but physical comedy also needs timing just as much as humor of the more psychological kind, something the Farrelly Brothers are good at. (Comedic timing is their perfection.)\n\nBut poor Jerry Paris couldn't always have been that bad, what with all those television shows behind him. He's \"Vintage Hollywood.\" Note the \"Vintage\" part. The man simply lost his touch in the later years, which is quite evident through this putrid material. Jerry Paris passed away in 1986, the year \"Police Academy 3: Back in Training\" was released into theaters nationwide. With all respect to the man, maybe the fact that he was on his deathbed during the filming of the movie had something to do with its amateuristic style and incompetent humor.\n\nSteve Guttenberg remains unfunny for reasons I pointed out in my recent review of the original chapter in this neverending saga. The movies themselves remain disgraceful for noted reasons, as well. But Bobcat Goldthwait and David Graf remain the only two capable comedians in this film -- and their talents are wasted. I enjoyed the character of Tackleberry (Graf) in the first and second film, and Zed (Goldthwait) in the second. They saved what little was left of the series. But not here -- even they cannot lift this film from becoming a boggled mess of unfunny sight gags, flatulence gags, sound gags, and more sight gags.\n\nThere's nothing more shameful than sequels being shipped out one-a-year in an effort to contribute to a pointless, loathed film series -- it's the most evident sign of a cash-in-franchise ever conceived by the scandalous thieves in Tinseltown. Did they expect the remaining small numbers of fans to turn up for...this? Steve Guttenberg, the man with no shame and sense of morality, even turned down the fifth film in this series. The sad thing? Nobody ever said anything about missing him.\n\nThe tagline for \"Police Academy 3: Back in Training\" is \"Run for Cover!\" Out of the thousands of films I have seen, this tagline is one of the most fitting of all time.\n\n\"Run for Cover!\"\n\nI couldn't agree more.\n\n1/5 stars."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "HK_Key-Si_HK",
        "review_rating": "6",
        "review_title": "Falls a little short compared to the first two movies...",
        "review_detailed_main": "The third installment of the Police Academy series falls a little short compared to the first two movies, but it is still quite entertaining! Especially because Bobcat Goldthwait aka Zed now also joined the police force. If you found him too crazy in the last part, this will not change now, because he hasn't changed either! Also Tim Kazurinsky aka Sweetchuck found its way into the uniform and he Bobcat are incredibly funny together. The role of Brian Tochi nowadays would be marked as politically incorrect, but thankfully we're in the year 1986 here. Back then people were not so buttoned up and even though Brian only plays a supporting role, he makes you smile with his performance."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "5",
        "review_title": "Run-of-the-mill sequel with ordinary trappings , jokes , antics , chases and funny scenes .",
        "review_detailed_main": "Routine follow-up with usual ingredients , mayhem, giggles , entertainment and lots of fun. From the beginning, they were a breed apart. They were raw, inept, blunderheaded civilians who signed up for the Police Academy. And they became raw, inept, blunderheaded cops. The misfit Police Academy is already graduated creating a special but bumbling team to accomplish a training for new recruits . Then, the bumblers in blue took to the streets to confront a crime wave . And somehow refrained from waving back. Now the lovable lunkheads with the fun-track minds are at it again. Determined to save their alma mater from getting the ax during a state-wide budget slash are the gifted, goofy original Police Academy grads: Mahoney, Hightower, Tackleberry, Jones, Hooks and Callahan, all led by the befuddled but unbowed Cmdt. Lassard. Also in the arresting cast are several returnees from the school's second adventure, including meddling Cmdt. Mauser. Now that's the kind of school people can trust, the kind of school whose grads fight crime with slapstick instead of nightsticks. Those goofy oddballs in blue are going to tangle with the pinhead punkers. The Police Academy regulars, from meathead Mahoney to the others impeccably inept cops are back again to answer law enforcement's most uproarious role call. Take off with the original cast... and some new recruits as they take to the streets and the skies to fight crime . On land, on sea, or in the air, no place is safe from them! Assignment: new recruits . Objective: Laughs. Hold everything! The cadets are training for an all new adventure ! The alumni of Commandant Lassard's Police Academy (1984) return to the school to train new recruits and prevent its closure. The Law Enfarcement Saga Continues!. Run for cover!. A Completely Arresting Comedy Hit!. An open-and-shut case of nonstop laughter !.\n\nPolice Academy 3 has the most dangerous assignments and in this second sequel to original Police Academy (1984) , there's humor , thrills , pursuits , action and abundant diversion . Funny and very cheerful film filled with action-packed , thrills , hilarious set-pieces, tongue-in-cheek , amusement and lots of humor . The premise is simple and plain , as a misfit , botcher squadron from the known police force is assigned to train rookie cops and subsequently to undertake a confrontation to a dangerous gang . Director delivers a professional work but with no much interest , his knack of getting the most out of characters and situations without ever going over the top making for some very big laughs . This production pays tribute to previous film , taking parts here and there , and repeating former sketches. The jokes and frolics come as thick and fast , hit and miss as usual and it is done in good spirit if not always in good taste . Fun picture with accent on sight gags , and humour that stems from the diverting roles established in other movies . The sympathetic cast formed by the motley band of misfits giving charming interpretation causing confusion , laughs and chaos . Showing up habitual actors in the popular series, such as : Seve Guttenberg as the constant prankster Mahoney, Bubba Smith as the hunk Sgt Hightower , David Graf as gun-lover Sgt. Tackleberry , Michael Winslow as Sgt. Jones , Marion Ramsey as Sgt. Hooks , Leslie Easterbrook as busty Lt. Callahan , Art Metrano as Comdt. Mause and adding a newcomer cadets : Tim Kazurinsky , Bobcat Goldthwait and Shawn Weatherly . While G. W. Bailey had hoped to return as Lieutenant Harris, but was passed over in favor of Art Metrano as the antagonist in this film , but he appeared in Police Academy 4 and others sequels . In addition, David James Elliott's film debut ; Doug Lennox and porn-actress Georgina Spelvin reprised their roles from the first film Police Academy (1984) as the main bad guy and the hooker. However, original cast members had allegedly complained about losing screentime to the new cast members. It contains an attractive and lively score by Robert Folk , series' regular , including the classic leitmotif . As well as atmospheric and appropriate cinematography . The motion picture was uneven and professionally directed by Jerry Paris , but with no originality . This was Jerry Paris' final film. It had originally been the intention that this film and Police Academy 4 (1987) would be shot back-to-back, but Paris was too sick during production for this to work, and so Jim Drake was hired to direct the next film .\n\nThe series produced by Paul Maslansky , being based on the characters written by Neal Israel and Pat Proft , they focused on a storyline involving those roles the audiences were most responsive to in the previous films , the episodes of the Police Academy is as follows : Police Academy 1984 by Hugh Wilson . Police Academy 2: Their First Assignment 1985 by Jerry Paris , James Signorelli . Police Academy 3: Back in Training 1987 by Jerry Paris . Police Academy 4: Citizens on Patrol 1987 by Jim Drake . Police Academy : Assignment Miami Beach 1988 by Alan Myerson. Police Academy 6: City Under Siege 1989 by Peter Bornerz . Police Academy: Mission to Moscow 1994 by Alan Metter . And Police Academy the series 1997/1998 , 26 episodes by Neal Israel, Paul Maslansky, Pat Proft ."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "phubbs",
        "review_rating": "6",
        "review_title": "Police Academy 3: Back in Training",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Back in Training",
        "review_detailed_main": "A few years ago I watched Police Academy, which became one of my favorite comedies, but I never could find any of the sequels. Even though I have been warned that these sequels are not any good, I'm still curious, I just finished Police Academy 3: Back in Training last night and even though it's not as funny as the first Police Academy film, it still has a few decent laughs. I think the ratings here on IMDb are so low because a lot of people are not giving these movies a good chance. If you wanna see these sequels, just have an open mind to it, because some of these sequels are still pretty funny. I liked having the gang back together, even good old obnoxious Zed, and they've added a few new characters to the story that are so much fun to watch.\n\nDue to money shortage, the governor has to cut one of the two police academies in the city. The way to choose which academy is going to last is a competition, to see which pulls out the best trained policemen. So the class of 1984 is back to help their academy out and help train new recruits, including our villain from the second Police Academy, Zed, has decided to clean up his act while picking on a poor little nerd, Sweetchuck, but end up being quite the funny pair together. But the other academy is going to do whatever they can to sabotage and win the competition away from Lasard's Police Academy.\n\nNo, this isn't by any means a pure comedy that has you constantly laughing, but it still delivers a few good moments. I know he is getting little obnoxious, but Michael Winslow with the voices, I loved when he was training a student and making noises like she was a bad driver, then he stopped and said \"ok, if I hear any of those noises, you fail\". Back in Training is worth the look if you're interested in seeing the sequels, I would recommend it, Back in Training has it's laughs, just have an open mind and have fun.\n\n5/10"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "hellraiser7",
        "review_rating": "9",
        "review_title": "Return to the Academy",
        "review_detailed_main": "This is my second favorite in the series, it's also kind of a childhood gem of mine as this was the first in the series I've ever seen and one of the first comedy films as well. Seeing this as a kid I just thought is was funny and cool the concept of colorful characters becoming police officers let alone actually making the police procedural genre fun.\n\nNot much to say, the plot is sort of the schools in competition cliché, it's really no contest as with these stories you can easily predict which school will win, but I didn't mind as it's really in the presentation that counts.\n\nWe pretty much see Lasard's academy is in competition with Mouser's academy, yeah that dirtbag Mouser actually forms an academy of his own, how the heck he could of accomplished this in a short amount of time let along a person of his preference is anyone's guess but hey it's \"Police Academy\" I rolled with it.\n\nWe see the contrast between both Mouser's academy and Lasard's The visual and physical gags are funny as usual, and this film has a lot of them which to me made the film feel like I was watching a live action cartoon. From seeing duo dynamics like Sweet Chuck and Zed, it's just funny how much unintentional grief Zed gives Chuck. As well as the training as we see the new recruits, they're not perfect but their doing their best and the recruits character traits actually do work to their advantage in some places. Like in the door kicking scene we see Zed just scream loud at the door and it goes down, man Zed's kind of has \"Black Canary\" scream ability.\n\nOne of the highlights is the party scene where we see two sections, where Lasard's Police Academy is parting and having a good time, it was cool seeing Callahan and Hooks both sing a cop rock song, then of course everyone else is dancing and having a good time. Seeing that I'd join Lassard's academy as they know how to have a good time.\n\nI really like the final act which is in the series seeing the characters along with the new recruits on the field in action. I really liked seeing how each of them had a hand in capture and apprehension of the gang of crooks. Like seeing Jones and Takashi both fighting together in a decent martial arts battle, it's always nice seeing the two comedic actors display their martial arts training.\n\nThe water chase is one of my favorite chase scenes of all time, it's the typical police chase but this time it's on the water. It's really cool just seeing Mahoney and company just ride on those Wave riders, which to me are my favorite kind of vehicle on the water as their practically aquatic motorcycles.\n\nIt was just really exciting seeing the characters just trying to catch up to the villains, I remember being on the edge of my seat thinking \"c'mon, c'mon, get them\" and just seeing them do those jumps with the wave riders and boats was cool.\n\nSo overall, if you're a fan of the series or even a new recruit this sequel is worth a tour.\n\nRating: 3 and a half stars"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "kevin_robbins",
        "review_rating": "6",
        "review_title": "Probably better than Police Academy 2",
        "review_detailed_main": "Police Academy 3: Back in Training (1986) is a childhood favorite that I recently rewatched on Tubi. The storyline follows the police academy preparing to cut back on budget and courses offered the following year. To decide which programs and classes are cut, the two commandants that oversee the school will have a competition to see whose program stays. Commandant Lassard will bring back some old students to help his current students prepare for the competition.\n\nThis movie is directed by Jerry Paris (Police Academy 2: Their First Assignment) and stars Steve Guttenberg (Short Circuit), Bobcat Goldthwait (Scrooged), Michael Winslow (Spaceballs), Leslie Easterbrook (The Devil's Rejects), George Gaynes (Tootsie) and Bubba Smith (Gremlins 2).\n\nI always adore how many original cast members always return for these sequels. Seeing an update on where they are and what they're doing is always fun. Tackleberry and Hightower remained two of my favorites and Bobcat was awesome in this film as well. Easterbrook was absolutely gorgeous and the scenarios, especially the training scenes were awesome. I also really liked the ending with the boats and jet skis. The movie does a really good job with the hijinks and was probably better than Police Academy 2.\n\nOverall, this was a great installment in the series that's absolutely worth your time. I would score this a solid 6/10 and strongly recommend it."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "5",
        "review_title": "Police Academy 3: Back in Training (1986)",
        "review_detailed_main": "Part three brings back some of the old and also promotes incidental characters to bigger parts. Zed, Sweetchuck, Fackler's Wife, Tackelberry's brother in law etc. are all now becoming police officer. It doesn't add as much intrigue as you would think, as most of the humor still relies on the characters we know and love. Mauser is the villain again, but is joined by the 2 ass-kissing cadets from the first film. The two academies going head-to-head is never really given enough room to develop, because we only see things from one side. We are just told how well the other academy is doing. It should be enjoyable enough for fans."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "jellyneckr",
        "review_rating": "",
        "review_title": "Pretty funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "pmtelefon",
        "review_rating": "3",
        "review_title": "Not so hot",
        "review_detailed_main": "\"Police Academy 3: Back in Training\" ends up feeling a lot longer than it actually is. The chase/fight scene at the end goes on forever. Before that, the movie is not much better. The material is just not there. There are some laughs but not enough to make it worth while. The cast is likable and many of the characters are very funny, especially Lassard. But overall, \"Police Academy 3\" is a pass. Honorable mention: a dreamy Leslie Easterbrook."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Back to Square 1(?)",
        "review_detailed_main": "Not exactly, but we do get back to where this all began. Just with a different premise. And this actually is Police Academy ... curious to see if the others have any connection left. Even the second movie left the building - no pun intended. But since we do progress story wise, we do get new recruits. Most of them we have seen in the previous installments in other roles - obviously since now they decided to become cops.\n\nThere are situations that work fine (and pairs that are really nice) and then there are things that are not as swell. We do get a callback from the first movie where we get a character who had quite an impact with her scene in the first movie ... no further explanation necessary ... I did re-watch the first three and will watch the other ones too, but took a break for a second from them. I doubt they'll get better. I am curious who'll stay until the end ... I don't remember that. Sometimes it also does not make sense. Leslie Easterbrook comes back for this one after sitting the second one out for example ..."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "torstensonjohn",
        "review_rating": "4",
        "review_title": "Still funny, but starting to lose control",
        "review_detailed_main": "The franchise of Police Academy has become a cult phenomenon among individuals. The writing is essentially poor with adult satire and humor that draws on the audiences complex nature at stupidity. The characters do the routine, Mahoney goes after the girl and pulls pranks, Jones motors his mouth into an array of sounds, Hightower shows his superior height and strength, Tackelberry is gung-ho and watches his in-laws continue to punch one another, Zed and Sweetchuck continue their love/hate relationship.\n\nOne portion of the film is the Blue Oyster again makes it's appearance. It's laughter, it's comedy, it's raw and it again begins to lose it's luster in this film."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "filipemanuelneto",
        "review_rating": "7",
        "review_title": "More of the same, but with quality and fun.",
        "review_detailed_main": "This is the third film in the memorable \"Police Academy\" franchise, which was a remarkable success during the 80's and 90's. Of course, it's old stuff, but it's curious how, even today, many people remember these films, which are still quite easy to find on TV in Portugal. In this third release, the quality and freshness of the comic material is still remarkable, and the film manages to keep up with the two predecessors with relative ease.\n\nThe plot continues to be the Achilles heel of these films, but it gives us what is essential to sustain an hour and a half of different antics, with some mixed action: with expenses rising, the city decided to extinguish one of the two training academies for existing police, one being our well-known academy, led by Commander Lassard, and the other a rival academy, meanwhile formed by Commander Mauser. Seeing things get complicated, Lassard turns to Mahoney, Jones, Hightower and other law enforcement officers already well known to all of us for help, knowing they are the right people for the mission.\n\nContinuing the efforts of the previous films, the crew and cast members are virtually the same as in the previous film. Jerry Paris, who had directed the previous film, remains in charge of the production and manages to give a great sense of cohesion to all the work developed. The bulk of the cast is present again, giving us more than we've ever seen, without surprises, but managing to live up to our expectations very well. We have Steve Guttenberg in the role of Mahoney, but giving the character more maturity and a sense of responsibility. Michael Winslow gets more attention in this film, and better material to work with and showcase his vocal gifts. Bob Goldthwait also gets more attention and more refined material, and along with the hilarious Tim Kazurinsky, he's going to be one of the funniest course cadets at the academy (in fact, the two actors complement each other amazingly). Also Art Metrano manages very well and gives his character a touch of elegant cynicism, being the ideal target for the mischief of others. Leslie Easterbrook also has more room to show value, achieving in this film one of the most interesting works of her career. David Graf, Bubba Smith and Marion Ramsey keep the same record we're used to, no big surprises.\n\nThe film retains the production values of its predecessors. In addition to good filming locations and good costumes, the special effects are of good quality and the action scenes here received a more attentive treatment and they work very well, especially in the final part. The editing was well executed and the fast pace of the film doesn't tire us, although at times we feel that it is nothing more than a collection of situational and verbal jokes, one after the other, and not a comic feature film."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Uriah43",
        "review_rating": "3",
        "review_title": "Failed to Distinguish Itself from Its Two Predecessors",
        "review_detailed_main": "In an effort to cut costs the decision is made to eliminate one of the state's two police academies. As a result, a special task force is sent to both academies to determine which one is the best. The first police academy is headed by \"Commandant Lassard\" (George Gaynes) while the other is run by the villain in the previous movie, \"Commandant Mauser\" (Art Metrano). Being the good guy that he is, Commandant Lassard has every intention of playing by the rules and in that regard he hires some of his best former cadets to hopefully save his academy from the chopping block. Unfortunately, Commandant Mauser is perfectly willing to do whatever it takes to win and for that reason he has two of his own men infiltrate the other academy in order make it look bad. Now rather than reveal any more I will just say that this film fails to distinguish itself from the previous two movies in large part due to the fact that it rehashes the same worn-out gags without hardly any variance at all. A joke gets old after the first time or two. Add in a very lengthy and boring chase scene at the end and even the presence of Bobcat Goldthwait (as \"Zed\") couldn't save this movie. Below average."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "glenn-aylett",
        "review_rating": "7",
        "review_title": "Saturday night fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "3",
        "review_title": "A long way from non-stop laughter and hardly arresting",
        "review_detailed_main": "The best of the 'Police Academy' films will always be the original by quite some way. It isn't great and will never be a favourite comedy or overall film of mine, but it clearly knew what it wanted to be so it was easy to take it for what it was and what it set out to do.\n\nIt was followed by six sequels, and none of them were as good or even on the same level as the first, though admittedly some are worse than others. Most of them are actually being pretty bad or worse and lose what was enjoyable about the original in the first place. After a tolerable but vastly inferior first sequel, the quality worsens with 'Police Academy 3' while not being one of the series' worst.\n\n'Police Academy 3' is not irredeemable, then again this is coming from somebody who always tries to find something good in mediocre or less films. A few cast members fare well, those being Michael Winslow, David Graf and Leslie Easterbrook. George Gaynes is always watchable and is here too even with his material not being as meaty or as funny.\n\nRobert Folk's score is robust and infectious and there is a bit with a scooter and a car that is quite amusing and the best timed of all the gags.\n\nUnfortunately, too much of the cast have little to do or have lost what made their characters work before. Steve Guttenberg has lost his spark and enthusiasm, while Marion Ramsey does little with a character that has nothing to her and, while a high-point in the second film, Bob Goldthwait is even more unsubtle and tries far too hard here that it's irritating.\n\nSadly there are nowhere near enough laughs, maybe a couple of minor parts work but there are no real highlight scenes really (which the first two had) and the rest of the gags are poorly timed, feeling laboured and with some abrupt shifts from one to another, parts that are more grossly crude than anything remotely amusing and too much of it has a style of humour that feels far too toned down, which makes the film feel leaden and bland.\n\nProduction values look rushed, like there were severe time and budget constraints, while what little there is of the story (most of it close to non-existent rather than thin) is an incredibly lazy-feeling replay. The climax goes on for far too long and a lot of it is ineptly staged and the low point of the surprisingly amateurish direction. The script throughout takes the dumbness way too far and some of it is pretty puerile to insulting degrees.\n\nOverall, the IMDb taglines listed couldn't be more ironic summing up a weak (but worse was to follow) entry. 3/10 Bethany Cox"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "DarylJGittings",
        "review_rating": "9",
        "review_title": "Still fun",
        "review_detailed_main": "Although, the series is showing a lack of new and original ideas Police Academy 3: Back in the Training is still fun.\n\nThat state decides that they are no longer for the funding to run two separate Police Academys. It's up to Lassard's Academy to go up against Mauser's Academy to see which one is going to remain open.\n\nIf you wanted to show Police Academy to a young child or someone who doesn't watch R-Rated movies, this is a watered-down version of the original film. Someone lift directly a few of the gags from the first film.\n\nCertain jokes are still funny, even if we've already seen them a few times.\n\nThe running time keeps getting shorter as the series goes on. Again, if you liked the first two movies, you'll like this one too."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "thehappychuckler",
        "review_rating": "6",
        "review_title": "Silly Passable Entertainment",
        "review_detailed_main": "I give the third installment in this franchise a passing grade. Just. And I have a few reasons why. Michael Winslow is still hilarious when he is making sound effects, Lance Kinsey is great as the dim-witted Lt. Proctor and it is crazy to see Bobcat Goldthwait playing Zed and all his antics going through training to become a cop.\n\nHere one of the academies must close so it is between Comdt. Lassard (George Gaynes) and Comdt. Mauser (Art Metrano) to see who will be shut down. So, most of the grads come back to help Lassard out. Plot wise she is pretty thin, but their are some laughs to be had. Also very funny to see Proctor at the Policeperson's Ball.\n\nUnfortunately, although they received the same rating from me this one is not as good as part 2. Also is starting to show some need of a good boost of originality as some of the characters (I feel half of them) here really do not bring anything new to their character. Sadly, I think it was all down hill with the next installment on."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "bronsonskull72",
        "review_rating": "4",
        "review_title": "* * Out Of Five",
        "review_detailed_main": "This time the cadets (Guttenberg,Smith,Winslow,Ramsey, Maher and Graf etc) go back to school to mold new recruits in their own image and help Lassard (Gaynes) keep his academy which Mauser (Metrano) is aiming to steal in this good natured but ultimately mediocre sequel. Police Academy 3 certainly has it's moments, mainly from Winslow and Goldthwait but this is running very low on inspiration and while I'll defend this one as well as Police Academy 2 for being underrated, it's obvious that this is a series that went to the well way too many times. Also the action sequence at the end is very well done, i've seen worse in action movie. This is where the producers should've pulled the plug on the franchise.\n\n2/5 Matt Bronson"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "DJE-fan",
        "review_rating": "",
        "review_title": "Silly, but fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "New Material Needed",
        "review_detailed_main": "Apparently, the mayor of Metropolis has not changed her position on relaxing the conditions for new cadets. The latest crop of police cadets are just as strange and ill-fitted for the job as the first crop (Mahoney and crew). Being that there is a new group of cadets only two years after a graduating class it makes me wonder: is the turnover that high or is crime still so bad they need more and more cops?\n\nCommandant Mauser is back as the main antagonist. The city is shuttering a police academy and it's between Mauser's and Lassard's. Mauser being Mauser, he wants to make Lassard's academy look as incompetent as possible so that his academy gets closed instead of his own.\n\nWhat lousy options: Lassard or Mauser. Lassard is insert-common-insult-here to refer to his diminished mental capacity. You can say short of a full deck, not the sharpest knife in the drawer, not the brightest bulb, etc.--anyone would fit the bill. And Mauser is such a shameless sycophant that it's sickening just watching him. But these are the options.\n\nMost movies can't stay watchable by the third sequel and Police Academy is no different. To begin with, PA3 was incredibly racist.\n\nWithin the first 30 seconds of Cadet Nogata (Brian Tochi) appearing on screen they used every known stereotype to describe him. He was shown in line, in a cadet uniform with a Japanese-to-English book and a silly smile on his face. I'm surprised they didn't have him dressed in a Japanese robe with samurai swords instead of a gun. When Mauser saw him and did a double take he went into full bigot mode.\n\nMauser: \"Proctor! What's the story here with Fu Manchu?\"\n\nProctor: sifting through attendance sheet, \"I don't have a Fu Manchu.\"\n\nMauser: \"I'm talking about the stir fry shrimp from out of town!\"\n\nProctor: \"He's part of an international exchange program, he's here to study our methods.\"\n\nMauser: \"I'm not teaching my cadets how to use a wok.\"\n\nProctor: dumb laugh.\n\nMauser: \"Ship him off to Lassard's. They could use a good sushi chef.\" Then turning to Nogata he says, \"no offense eh?!\" Because that's the way you close all offensive statements to make them less offensive.\n\nEven dismissing the racial vomit Mauser was spewing I couldn't get past Zed (Bobcat Goldthwait) and Sgt. Jones (Michael Winslow). Bobcat was probably born annoying. His role consisted of yelling and slurred speech. I know that's his schtick. It's terrible.\n\nAs for Michael Winslow: give it a rest. The sound effects thing was cool at first because it was a novelty like, \"how is he able to do that?\" Now it's like, \"why is he still doing that?\" If I were Winslow I'd be upset that they only have me around to be a sound effects man like I have no other talents.\n\nPA3 was the same stuff different day. They even had the nerve to show the Blue Oyster again, for the third time. Like any halfway decent comic, Police Academy needs new material."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "mattkratz",
        "review_rating": "6",
        "review_title": "Ok at best",
        "review_detailed_main": "I think the formula is starting to run a little thin here. I liked the boat chase scene, and there were some good laughs, and I like Michael Winslow's impressions, but the first two movies were better. You might like it if you are a fan of the series.\n\n** out of ****"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "gcd70",
        "review_rating": "2",
        "review_title": "Scraping the bottom of the barrel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "s-woodier",
        "review_rating": "7",
        "review_title": "Back In Entertaining.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "zhixiong",
        "review_rating": "5",
        "review_title": "Decent sequel",
        "review_detailed_main": "One of the most memorable characters in 'Police Academy' is Sgt Larvell Jones (Michael Winslow). In the film, he was poking fun at badly dubbed Chinese kungfu dialogues and made an extremely high but absolutely pointless jump in front of the bad guys. It was a hilarious jump. His creativity in generating sounds is also impressive. The sound effects genuinely came from his mouth apparently. Unfortunately, this is the last appearance of Mauser (Art Metrano) because he broke his neck in 1986. The 'Police Academy' series is going strong with its eighth installment coming out in 2006.\n\nMao points: 5/10"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "OllieSuave-007",
        "review_rating": "7",
        "review_title": "The best of the first four academy movies!",
        "review_detailed_main": "This is the second sequel to Police Academy, where the city's two police academies, one is under the eye of Commandant Lassard (George Gaynes) and the other under Commandant Mauser (Art Metrano), enter a little \"competition\" to see who can do a better job at protecting the city in order to keep themselves from closing (due to limited funds, the city is considering closing down one of the academies). As a result, Mauser recruits Sgt. Blanks (Brant von Hoffmanand) and Sgt. Copeland (Scott Thomson) and instructs them sabotage Lassard's cadets, while Sergeants Mahoney (Steve Guttenberg), Hightower (Bubba Smith), Jones (Michael Winslow), Tackleberry (David Graf) and Hooks (Marion Ramsey) try to train the new cadets to hopefully save their academy.\n\nThe acting continues to be pretty good with this film and I thought the entire cast did a good job in their roles, each one giving a unique and humorous personality, like Jones' funny sound effects, Hooks' shy voice, Tackleberry's forceful weapon tactics and Hightower's giant, intimidating stance. Mauser continues his villainous but funny character and Proctor continues to be the slapstick and bumbling assistant to Mauser. The addition of Cadets Zed (Bobcat Goldthwait), Sweetchuck (Tim Kazurinsky) and Cadet Nogata (Brian Tochi) added more humor and charm to the story.\n\nThis movie goes at a more quicker pace than the previous two films and the plot seems to be more intact and intriguing, from the sergeants training the cadets to all the running gags at Mauser's and Proctor's expense. Jerry Paris did a good job in the direction and the script by Gene Quintano is much more captivating; you get a lot of police action and some thrilling moments. And, Robert Folk's toe-tapping Police Academy theme deserves an honorable mention.\n\nOverall, it's the best of the Police Academy movies - at least the best of the first four.\n\nGrade B"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "mark.waltz",
        "review_rating": "5",
        "review_title": "When it comes to a film's legacy, it's the public that decides",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "coasterrd",
        "review_rating": "10",
        "review_title": "possibly the funniest of the series! number 4 comes close.",
        "review_detailed_main": "wow! I laughed my ass off once again! Ive been a fan of the series for some time [except for Police academy 7 ARRRG] bobcat and sweetchuck are definetly crowd pleasers! I did not like the 2nd too much because bobcat was basically the bad guy. but this one and the 4th they are a team! if you are into goofy not rauncy humor [first one was though] see this film but FOR THE LOVE OF GOD DO NOT SEE NUMBER 7!!!!"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Edge49",
        "review_rating": "6",
        "review_title": "Pretty shallow entry",
        "review_detailed_main": "This one didn't have much substance to it. The plot was weak and the comedic scenes were pretty rare. Like all of these movies, the characters make the movie! All are pretty unique and memorable. I bet they could all have their own spinoff movie."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "adamjohns-42575",
        "review_rating": "3",
        "review_title": "Not doing so well.",
        "review_detailed_main": "It takes half an hour to start to get funny. I think it's because there are too many characters and it's a bit silly.\n\nThe characters are still all there, but they're stories are so far spread out that you don't get to connect with them so well as part of the bigger story, which isn't bad, although a very typical eighties comedy/action film and a bit \"James Bond\".\n\nI have always had a soft spot for Proctor, so I did like seeing him unclothed. Other than that it's the Mahoney show again, but with Zed screaming all the time.\n\nThere is nothing so bad in it, but nothing so good either. Not quite middle of the road, because it's not good enough for that.\n\n328.95/1000."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "d1senior",
        "review_rating": "",
        "review_title": "\"The mind is mightier than the bosom.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "utgard14",
        "review_rating": "5",
        "review_title": "Watchable but cracks are starting to show",
        "review_detailed_main": "Steve Guttenberg and the rest of the police academy alumni from the first film that graduated to the force in the second film return to the academy to help Commandant Lassard (Punky Brewster's dad). Apparently the state can only afford one police academy so Lassard's cadets must compete with another academy, run by Mauser (Art Metrano) from the last film. Pretty flimsy plot but it puts our favorites back in the familiar surroundings of the first film, presumably with the hope of recapturing that movie's magic. There are new recruits this time around, with the standouts being Brian Tochi and part 2 returnees Bobcat Goldthwait and Tim Kazurinksy. Nice to see Leslie Easterbrook back. She was missed in part 2. Beautiful Shawn Weatherly, a former Miss USA and Miss Universe, is Guttenberg's love interest here. There are some repeated gags and jokes from the previous two movies, as one might expect from a sequel. The series is already starting to get desperate. Still, the likable cast and pleasant tone keeps things light and enjoyable."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "A lying meter.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "acetylcholinenjoyer",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "brdavid-429-96270",
        "review_rating": "6",
        "review_title": "Watchable, funnier than the previous, but still nothing more than jokes back to back",
        "review_detailed_main": "Police Academy 3 is definitely one of my favorites of the series. I like the odd numbered ones over the even numbered ones. Back in Training has great and funny moments, but over all it lacks in any sort of character development. We gain nothing about the interactions of our original line up. None of the characters truly have time to grow like they did in the first one. None of the original characters really interact with each other except with the new cast and perhaps a few times here and there.\n\nThe ending is definitely a step up in production, but the movie is just one slap stick joke after another and never comes close to any kind of potential it could have had. It's just a popcorn movie. Still one of the better ones but no where near as good as 1."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Police Academy 3: Back in Training",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "MJB784",
        "review_rating": "3",
        "review_title": "Those wacky cops are back.",
        "review_detailed_main": "After the other two Police Academy movies that hit first place in the box office, this Police Academy movie is pretty silly or out of control when it comes to slapstick. This time, Commandant Lassard (George Gaynes) and the rest of the gang on patrol decides to make a network that people who want to become officers could join in. Although, they have to train with other new members that just came in as well. Isn't a movie like this kind of crummy on slapstick? I would understand the first week the movie came out that it would hit first place since the other two movies did, but not the second week."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "rossrobinson",
        "review_rating": "10",
        "review_title": "fantastic",
        "review_detailed_main": "Police Academy 3: Back in Training was made in 1986, i thought that this movie was another fantastic movie. I love Police academy because it is funny and the actors and the actresses were fantastic, i think they have been fantastic in all of the police academy movies. I give this movie 10 out of 10."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "kluseba",
        "review_rating": "6",
        "review_title": "Many great ideas but a bad ending",
        "review_detailed_main": "The third part of this unique police movie series presents us a weaker story line than the second movie but a few great surprises. Some really great and unique actors from the second movie, as the rebellious punk Zed and the shy and rather conservative Sweetchuck, come back and play the new cadets of the police academy to save the honour and future of it because one out of two police academies must close its doors do to too elevated costs. It's a brilliant idea that the charismatic villain Mauser from the second movie is also back in here and the chef of the second police academy that confronts Lessard's academy. Of course, Mahoney, Tackleberry, Hightower and all the other are also starring in this very funny and entertaining flick, this time as instructors instead of cadets as in the first movie. It's very funny to see all those weird and unique characters in those reversed roles.\n\nAs you might have noticed, this movie still has a high amount of great ideas, funny scenes and entertaining passages that puts the third part on the same level as the first two movies. The reason why this part got one point less from me is the ending. The motorboat chase scenes are simply too long and ultimately quite boring and I think that a real ending is missing as the movie ends somewhat quite suddenly after the chasing scenes. The should have cut off three minutes of the chasing scenes and added them at the end of the movie in my opinion. The movie ends as if the producers have been in a hurry or lack of imagination.\n\nBut this only negative point doesn't change a thing that this flick is perfectly entertaining and should please to anyone that has seen the first two parts. After having watched this movie for the very first time I was still really looking forward for the fourth part."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "gwnightscream",
        "review_rating": "5",
        "review_title": "\"Pretty Good Sequel!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "jaws!",
        "review_rating": "",
        "review_title": "the forth best in the series!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "HorrorDisasterGuy-90617",
        "review_rating": "5",
        "review_title": "Watchable, but wasn't that good for a sequel",
        "review_detailed_main": "There's so much you can do for the franchise and this one is alright. The returning characters are now have to teach new recruits to become police officers. It feels like a rehash of the first movie, but instead the older characters are now the teachers of the newcomers. There's also a side plot with the villains which isn't that expanded on and isn't that interesting. The movie has the same type of humor as the previous movies which some work, but it basically the same type that gets old quickly. I found the movie to be enjoyable during the training scenes and the climax itself is pretty fun to watch the boat chase in it.\n\nOverall, the movie is fun, but isn't that good compared to the first movie."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "elo-equipamentos",
        "review_rating": "6",
        "review_title": "Proctor naked on G-private club!!",
        "review_detailed_main": "The Third Police Academy continues with same formula, same actors's behavior, But Art Metrano don't match with Lt. Harry played on first one by G. W. Bailey, the usual gags are spreading by all characters in their early skills, the highlights are the same Leslie Easterbrook with those huge air bags, Winslow with those fabulous imitations, but there is a character who stolen the picture, Lance Kinsey as Lt. Proctor in a priceless sequence, walking naked on street reach to an bad area and find a door and get in a G-private club, well there a lot of them there, it pay the picture itself, also Metrano gave us some too, when his lost your eyebrow and be happy when Proctor make a female eyebrow on his face, all others character has the same usually done, as l said above backing in training has some good moments that worth to see!!\n\nResume:\n\nFirst watch: 1993 / How many: 2 / Source: TV-DVD / Rating: 6"
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "jacobjohntaylor1",
        "review_rating": "4",
        "review_title": "Worst then Police academy 2 and that was awful.",
        "review_detailed_main": "This pretty mush might has well be a remake of the first movie. It is not really a remake but is might as well be. Police academy 2 is a better movie. And that was pretty bad. This is an awful movie. It very boring and not funny. The story line is awful. Michael W.i.n.s.l.o.w is a great actor. He wasted his talent being in this awful movie. It so mush like the first one. And the first one is boring. It is even more boring then this one. But still this very boring. Leslie E.a.s.t.e.r.b.r.o.o.k is great actresses and she wasted her talent being in this awful movie. I can believe people like this movie. It is so stupid and not funny at all."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "SkullScreamerReturns",
        "review_rating": "7",
        "review_title": "Part 3: Losing some momentum but still pretty good",
        "review_detailed_main": "The third Police Academy film is still a good one. Zed and Sweetchuck who were introduced in the previous film now get more space to goof around. New characters arrive to the academy (Kirkland's brother, Fackler's wife for example) but they don't bring in much anything important. Luckily there are a lot of great characters from the first two films. I think this movie has a lot of funny moments but as a whole it's a little bit more mishmash than the previous two. Especially the waterjet chase in the end has always struck me as a bit boring, too long. I think the decline of the series slowly stars here but despite the flaws it's still a fun movie that provides good laughs."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "Back to the Academy",
        "review_detailed_main": "The Governor is closing one of the city's two police academies. Mahoney (Steve Guttenberg), Hightower (Bubba Smith), Tackleberry (David Graf), Jones (Michael Winslow), Hooks (Marion Ramsey), and Callahan (Leslie Easterbrook) return to the academy to help Lassard (George Gaynes) train the new recruits and fend off Mauser (Art Metrano) who runs the other academy.\n\nThe good thing this time around is that they've returned to the academy. The gang is together again. Mauser being at the other academy is a minor obstacle. Half the fun of the series is to play pranks on Mauser. There are still pranks but it's more difficult to set it up naturally. The gang's hijinx is getting a little tired. Bobcat Goldthwait as a cadet is great. There are some good and some bad in this movie. It's a mix bag."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "breakdownthatfilm-blogspot-com",
        "review_rating": "6",
        "review_title": "A tad better than the 2nd but still goofy as hell",
        "review_detailed_main": "Normally the second sequel to a franchise is the worst of the trilogy. Occasionally there are exceptions to the rule but this is less likely to happen. The adult R-rated Police Academy (1984) comedy may have not contained the classiest of jokes but it had its moments. The characters all had their own personalities and trademarks. The slapstick was doable and many a time it was all over the place. The area that really suffered was the lack of development for every character because of it being overly packed with roles. This is what happens with ensemble casts though. The same goes for its sequel Police Academy 2: Their First Assignment (1985). The difference between that and the original was the addition of new and the omission of older characters. Without rhyme or reason, the missing characters are never mentioned. Comedic value was also recycled at times although some of it worked as well. No doubt with both being fairly popular among its fans, the third film in the series would revolve around the same kind of antics.\n\nIn Police Academy 3: Back in Training (1986), the plot deals with returning characters from the last two films becoming the trainers to the next incoming class of cadets. Unfortunately of the two academies, only one will remain - Comdt. Lassard's (George Gaynes) or Comdt. Mauser's (Art Metrano). The governor (Ed Nelson) felt only one academy was needed so Lassard's alumni want their police academy to win. The alumni to return are Mahoney (Steve Guttenberg), Hightower (Bubba Smith), Tackleberry (David Graf), Jones (Michael Winslow), Hooks (Marion Ramsey), Callahan (Leslie Easterbrook) and Fackler (Bruce Mahler). For this sequel, the script was written by Gene Quintano and surprisingly it's slightly better. As of today Quintano is best known for writing Loaded Weapon 1 (1993) and Sudden Death (1995). What's different about this entry as to the prior one is that the original cast is in a teaching position now. Seeing Mahoney, Hooks, Hightower, Fackler, Jones and Tackleberry at the same level as Callahan shows they have grown.\n\nEven some of the individuals from the first sequel have some growth. Characters like ex-criminal Zed (Bobcat Goldthwait) and Sweetchuck (Tim Kazurinsky) learn to get a long as cadets. The comedic gags are also somewhat improved since last time. Anything dealing with Comdt. Lassard, Zed, Hightower, Jones or Hooks should get plenty of laughs. Comdt. Lassard is goofier than ever and reminisces to Leslie Nielsen. Zed, although hard on the ears makes use of his fluctuating vocal chords to his advantage. Hightower continuously gets props for being a lovable bear that's tough as nails. Hooks even gets to train some as well instead of sitting at a desk all day. And Jones, well he's always the master of sounds. Although Mahoney is the lead character, his colleagues get a fair share too. The focus is distributed rather evenly this time, which is nice. However that doesn't leave the writing without its problems. Some of the returning characters do not get a lot of focus. Copeland (Scott Thomson) and Blanks (Brant Van Hoffman) get shorted on this.\n\nLance Kinsey as Proctor continues to report to Mauser but also doesn't get a lot of attention. Two new cadets Kirkland (Andrew Paris) and Nogata (Brian Tochi) have their moments but don't contribute much. Tochi would end up voicing Leonardo in Teenage Mutant Ninja Turtles (1990) and its sequels. Lastly there's a new love interest for Mahoney named Cadet Adams (Shawn Weatherly). She's by the far leaves the least impact. This is the least of the story's problems though. Again previous characters have vanished without a trace. What happened to Tackleberry's girlfriend who loved guns? What happened to Mahoney's partner who ate garbage all day? No explanations are given whatsoever. And although the slapstick is slightly funnier than before, there are still homophobic and racial jokes thrown in from time to time. The last issue clearly visible to viewers will be that there is no real antagonist. Yes Comdt. Mauser wants to off Comdt. Lassard's academy but aside from that, random villains show up with no motive. What's the point then?\n\nJerry Paris directed again for this entry in the series. With his direction, the overall look and feel has not changed. The same could be said for Robert Saad as the director of photography. Though the cinematography has changed hands over the last couple of films, Saad's work looks very similar. There's plenty of lighting to see what needs to be seen. For once the final showdown also doesn't take place in a city either. So that's different from a view perspective. Saad would later provide camera-work for The Rainbow Boys (1973), Cannonball Fever (1989) and Sleeping Dogs Lie (1998). Robert Folk again composed music. It is weird though that he isn't credited when he was the one who made the theme for the franchise so recognizable. It's hard to say if the tracks are just being recycled even if a lot of it sounds the same. At this point though, hearing the flutes and drums at the beginning is all a fan would need. When the trumpets come in, everything is heroic and proud. No synths in this orchestra and that's okay.\n\nBy no means is it a vast improvement from the last entry but it does feel more enjoyable. It still contains continuity problems, unnecessary supporting characters and a major antagonist is barely around for this. Yet the music is still lively, the slapstick is slightly funnier and the main actors use their roles to their advantage."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Police Academy Rocks!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "Petey-10",
        "review_rating": "8",
        "review_title": "Safing the academy of fools",
        "review_detailed_main": "Commandant Lassard's Police Academy is in jeopardy to be closed.That must be prevented.There are some new recruits, including the old gang member Zed.Police Academy 3: Back in Training is from 1986.It's the second and the last of these movies directed by Jerry Paris, who died that year.There is pretty much the old cast there with Steve Guttenberg playing Mahoney.And Bubba Smith playing Hightower (also seen in drag).David Graf is Tackleberry.Michael Winslow is Jones.Marion Ramsey plays Hooks.Leslie Easterbrook plays Debbie Callahan.George Gaynes is there with his gold wish playing Eric Lassard.Art Metrano reprises his role as Mauser.As does Lance Kinsey as Proctor.As does Tim Kazurinsky playing the geeky Sweetchuck.And Bobcat Goldthwait, who was seen in the previous part as the hyperactive Zed, reprises his role.Shawn Weatherly plays Cadet Karen Adams.Bruce Mahler is Douglas Fackler and Debralee Scott his wife, who wants to be a cop too.Ed Nelson plays Governor Neilson.Brian Tochi is Elvis Nogata.Andrew Paris is Bud Kirkland and Arthur Batanides his father, and their beating up each other again.George S. Robertson plays the part of Chief Henry J. Hurst.And Georgina Spelvin is seen as Hooker again.This is a very nice sequel with a lot of funny stuff.Like Proctor's naked adventure.Or the karate moves by Jones and Nogata.And some great action, like the chase on water in the end.Not recommended for people with no sense of humor."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "We Are Now Beginning to Reach Dangerous Waters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "videorama-759-859391",
        "review_rating": "8",
        "review_title": "3rd entry, an infectious Academy of non stop laughs, I tell you",
        "review_detailed_main": "Contrary to wide opinion, I presume, this cheesy number is consistently funny, as if the movie involved a lot of short skits. As one of two academies has to close down, the bumbling Lassard's being one of them, our favourite recruits return, to train a batch of new fish. We have some more screw ups, involving Zed from number 2, plus a cute little guy with glasses, a laughing stock who bunks with Zed. We have a role reversal in one scene, featuring the accident prone, Fachler, this time the one hanging on the front bonet for dear life, before being flung off in the academy grounds, by his resilient (obstinate) wife. Speaking of laughing stock, did I mention Proctor having a bad night, when being robbed of his whole attire by that notorious, under the podium lady, played by real life adult star, Georgina Spelvin. Proctor is one character, involved in dirty play, and we know who the others are, in making sure this academy falls on it's face. But good always triumphs evil, most of the time. We have a great speedboat chase sequence, Winslow looking so cool. What's funny if classic, is his non formal introduction to the new recruits, where he uses his vocal talents once more. They come in handy especially in fighting ar..kissing. If almost surpassing the first PO, but really with anything, how can you beat the original, this short sharp sweet academy has so many funny moments, I'd be spending tonight and tomorrow, going through all of them. You're better off watching the movie, where you could bust a rib, laughing, somewhere through this watch. Total hilarity."
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "shotdowninflames",
        "review_rating": "",
        "review_title": "worst movie....period!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0091777",
        "movie_name": "Police Academy 3: Back in Training",
        "movie_rating": "5.4",
        "review_username": "KGB-Claw",
        "review_rating": "",
        "review_title": "very bad.",
        "review_detailed_main": ""
    }
]