[
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vinay_payyapilly",
        "review_rating": "7",
        "review_title": "After the mindless films that preceded it during the Diwali weekend, Talaash comes as a breath of fresh air",
        "review_detailed_main": "The movie opens with a random accident involving a popular film star that seems to defy all explanation. It also introduces the main protagonist, Inspector Shekhawat (played gloriously by Aamir Khan). The rest of the movie details how the good inspector peels away the mystery surrounding the accident. Along the way, he also battles his own demons in the form guilt for his child's untimely death in an accident.\n\nThe movie is scripted well enough to keep you interested all the way to the end, even if the end if a tad bit tame.\n\nFive-star performances from all the leading characters ensures that you are sucked into the mood and world that Reema Kagti creates. Nawazuddin Siddiqi gives another stellar performance to follow-up on his performance in Gangs of Wasseypur. Rani Mukherjee redeems her acting credentials after the disaster of Aiyaa. Kareena Kapoor is competent. However, it is Aamir Khan who steals the show with a highly nuanced performance which I am sure he will rate among his finest.\n\nThe music from Shankar-Ehsaan-Loy is very complimentary and at no time does it intrude, as it is want to do in Hindi films, into the story-telling. Instead it is very much part of the story-telling and at times even takes things forward.\n\nThe movie is another feather in the cap of Zoya Akhtar who has penned the story and screenplay along with the director Reema Kagti. The credits for the dialogs are shared between Farhan Akhtar and Anurag Kashyap.\n\nAfter the mindless films that preceded it during the Diwali weekend, Talaash comes as a breath of fresh air and bears a promise that Bollywood is not all about assuming that the audience is a collection of sheep waiting to be sheared."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "7",
        "review_title": "In quest of the unknown with Mr. Perfectionist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "nikhil-damodaran",
        "review_rating": "7",
        "review_title": "Worth Watch",
        "review_detailed_main": "Well, As is the case with any Amir Khan movie, this was also eagerly awaited. And to a certain extent the wait is worth. This is essentially an eccentric police officer who tries to work his way out of a traumatic personal experience.\n\nWhile the personal experience is a major turn in his persona, keeping him sleepless at nights and increasing the spread between him and his wife; it comes at a time when an important case is at hand.\n\nWho is the murder? What was the motive? All these are questions which grip you till the end and as an when the story tires to clarify itself, you find more riddles.\n\nTill this part where the protagonist searches for the killer holds up tightly. Where lies the mystery is for one to believe and disbelieve. The proverbial mystery is where lies the search (taalash)...\n\nIts a worth watch, but don't bank on a really logical ending. Its up to your faith to accept somethings!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "an intriguing sensitive suspense drama that is not meant for all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vivek-ramasha",
        "review_rating": "7",
        "review_title": "Not by Aamir's Standards, but still a good movie.",
        "review_detailed_main": "Good movie. Brilliant plot and great direction. Aamir Khan, after a long wait of three years since his last blockbuster, 3 Idiots, has given another potential blockbuster. Movie is simply amazing.\n\nPlot is the back bone of the movie. Director, Reema Kagti, has successfully tried to keep the mystery going through out the movie.\n\nSuspense is highly underused genre in Bollywood. I can count decent Bollywood suspense movies on my fingers. My till-the-date favorite being 36 China Town, which is now replaced by Talaash. I hope this movie's success(which is going to be tremendous, but not even close to 3 Idiots), motivates other top actors and directors to exploit this genre.\n\nAamir Khan was very convincing as a cop. His character(Surjan Singh Sekhawat) was flawed and that's what I liked about it. Its a trend in Bollywood to make the protagonist, perfect, having no flaws at all. Ironically, Mr. Perfectionist's character in this movie was most flawed.\n\nEven though he has been better, Aamir's acting in this movie was by no means, bad. He was good. But he's been better.\n\nOut of Kareena and Rani, in my opinion, Rani was better. She was just perfect at what she was doing. She was living it.\n\nKareena, I think, yet again like Heroine, was trying too hard. She is one of the best actresses if not the best in Bollywood. So no one can say she was bad. Its just, out of three, she takes the third spot.\n\nBiggest drawback of the movie was its music. Some scene lacked thrill because of poor background score.. Some songs were a bit dull as well.\n\nOverall, movie was good. A MUST watch. Go for it. If not for Aamir then for a very rare Bollywood thriller."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Fella_shibby",
        "review_rating": "10",
        "review_title": "Mesmerizing plot aided with top notch acting n soulful tracks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "gauravsharma-bunty",
        "review_rating": "7",
        "review_title": "Expect the Unexpected!!",
        "review_detailed_main": "I was waiting for Talaash from a long time and wondering what new Aamir has added into his new film. Talaash was very nicely narrated and holds you till the end. But somehow I feel disappointed when the movie moves on to the climax. It was not the kind of a movie Aamir usually do. Mostly all of his previous movies where really good and add something new to the Indian cinema. But this one, despite being a very good movie, failed to become a masterpiece. See, this is what we always expect from Aamir Khan, a masterpiece! Cinematography was good, acting superb but somewhere it was lacking the X-factor. Rani Mukherji with no makeup added the depth to the role on the other hand Kareena was looking as glamorous as always. Aamir Khan as usual did the best. Nawazuddin Siddiqui did what he is best in....acting!! The script keeps you holding throughout. All in all it is a good movie to watch but I feel that the climax could have been made better and more sensible.\n\nDefinitely a one time watch and worth watching at least once."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "arohimittal",
        "review_rating": "10",
        "review_title": "Kareena steals the show for me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "xxxanand",
        "review_rating": "7",
        "review_title": "Talaash.... A search goes decently",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "insomniaac112",
        "review_rating": "10",
        "review_title": "Best Indian movie in recent times,Exceptional!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "leonambik",
        "review_rating": "7",
        "review_title": "Talaash is definitely good but not awesome..",
        "review_detailed_main": "Believe it or not there have been many movies of Suspense genre in last few years which are better or at least equal to it; to quote a few of them are- HIDE AND SEEK, 404- error not found, KAHAANI and many more! But all of them lack in the star power of Aamir Khan and that's the reason that most of them did not caught the attention of Masses!\n\nTalaash is a different style mystery which unfolds well in a decent way, with a gripping story and brilliant performances! Everyone delivers his best here, from Aamir to Kareena to Rani and even the supporting cast! Story is fresh, smart and keeps you hooked up till the end! Kagati's Direction is good too! Music is decent, melodious and suits the mood of the movie; and appears to be an integral part of it! Everything else from setting to cinematography is fine!\n\nBut inspite of all these the movie definitely does not live upto the expectations and hype created ! It shows that still we have miles to go!\n\nAs the Aamir requested not to reveal the suspense and it's very essential for any mystery movie (Remember the end of the movie \"DHUND\" which states- \"This is the end but please do not tell anybody!\"). So I will not talk about it, however I would quote a statement of KAREENA given in an interview that:- \"TALAASH MINUS KAREENA IS NOTHING .....!!!\"\n\nFinally I would like to say that Talaash does pass the litmus test but Not With Distinction, It is definitely Good but not awesome!!! RATING- 7/10 !\n\nFor more Join MovieMaster at- http://www.facebook.com/moviemaster2012"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: Talaash",
        "review_detailed_main": "The ubiquitous Bollywood cop role. Salman Khan showed how to make a blockbuster playing one in Dabangg, which spearheaded his series of hit after hit from the year 2010, before others such as Abhishek Bachchan, John Abraham, Ajay Devgn all jumped on the bandwagon playing no-nonsense cops in that khaki-brown uniform. Having been absent from the big screen for close to two years now since Mumbai Diaries, it's been years since he last played a cop, and Mr Perfectionist himself Aamir Khan now returns to playing a law enforcer sporting a handsomely thick mustache, and you can be just about sure the choice of his project has that uniqueness, that you're in for quite the spectacle.\n\nTalaash boasts the involvement of Anurag Kashyap and Farhan Akhtar writing its dialogues, from a story written by sister Zoya Akhtar and Reema Kagti, the latter taking up directing duties as well. It's a story that deals with pain and reconciliation, wrapped around a police investigations surrounding the mysterious car accident of a famed Bollywood actor, which opened up a Pandora's Box of blackmail, secret rendezvous, femme fatales and cheap prostitutes, and as Aamir himself puts it, is more of a suspense than a thriller.\n\nThe film opens to a jazzy opening credits tune Muskaanein Jhooti Hai, before we bear witness to the aforementioned car accident and death of a famous actor, which is mysterious in circumstances as we bear witness to the car's travelling late at night in the city's seedier side, before an inexplicable swerve, followed by an accelerated plunge into the sea. A high profile investigation begin, headed by Inspector Surjan Shekhawat (Aamir Khan), with clues being set up very quickly for the audience, but yes, we know these little teases in principle characters are nothing more than to prep us for what lies beneath with more than meets the eye.\n\nBut the irony is that even this investigations is nothing more than a front for the more dramatic story that Reema Kagti and Zoya Akhtar want to tell. Surjan and his wife Roshhni are very much estranged, no thanks to the tragic death of their son in a boating accident that can very much be attributed to the negligence of both parents. Both of them take responsibility and deal with their loss in the most personal of terms, one in immersing himself in his job, while the other relies of psychiatric help and modern medicine, before turning to the spiritual in order to find inner peace, much to the chagrin of Surjan. It's been some time since we last saw Aamir pair up with Rani Mukherjee, and their scenes together evoke much of the emotions filling up Talaash, making it fabulously gloomy with an air of sadness all round as they grapple with their emotions. The Jee Le Zaraa by Vishal Dadlani perfectly encapsulates this, and unequivocally my favourite song from the film.\n\nThen there's the other pairing with Aamir Khan and his 3 Idiots co-star Kareena Kapoor, who plays the prostitute Rosie, whom Surjan finds solace in, and their relationship bordering on the will-he-or-wouldn't-he, especially since they grow closer, and the cop starting to confide a lot more personal feelings with her. She's someone who can provide clues and leads in his investigations, but this professional relationship becomes quite compromised, and having Kapoor play the seductress who tempts, allows for temperatures to be raised especially since the visuals just seem to love capturing her at her best angles. While Kareena may have turned up the va-va-voom factor by many notches, my vote goes to Rani Mukherjee for her very daring plain jane getup, sans makeup for the most parts, in order to play a mother in mourning, and for that inability to reconnect with her husband.\n\nReema Kagti's film provided a balance with romanticized moments and hard hitting reality in its visuals, capturing the underbelly of society that Surjan has to delve into for leads, and introducing us to those who will seize opportunities to break out of their rut. There's a subplot involving a suspect's personal runner which highlights how desperation drives those who have not, to try and get the better of those who have, with great risks involved. And Talaash has that mesh of genres put together in pure Bollywood fashion, making it appeal at least in parts to a broad spectrum of audiences, with suspense, the supernatural, investigative drama and relationships taking turns to put their imprint on the narrative.\n\nI've developed that trust and leap of faith with Aamir Khan and his choice of productions to work in, and Talaash is that perfect welcome to return in a leading role, ably supported by Kareena Kapoor and almost being upstaged by Rani Mukherjee in her stereotype-busting turn. A strong emotional core to the story also helped to lift this beyond the many mediocre productions of late, and goes to show that when Bollywood gets its act together, it's a force to be reckoned with, and a delight for any audience anywhere to experience. Highly recommended!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sidin",
        "review_rating": "7",
        "review_title": "A Magical Thriller...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "margirahul",
        "review_rating": "5",
        "review_title": "The Plot was generalized to the General Viewers But Not for the Nerd Viewer.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vinay1493",
        "review_rating": "",
        "review_title": "Amazing movie by itself, but could have been a masterpiece...!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "An Interesting Noir-Mystery!",
        "review_detailed_main": "Reema Kagti's much awaited 'Talaash' is An Interesting Noir-Mystery! Its well-written, crisply directed & fabulously acted, but, in no means, is it remarkable. Reason? The Suspense lacks weight.\n\n'Talaash' Synopsis: A cop, a housewife and a prostitute get entangled in a mystery that links their lives in unexpected ways.\n\n'Talaash' has an utterly masterful first-hour, with the drama as well as the characters working big time. The second-hour too begins well, but the actual suspense of this story lacks weight. It isn't bad, but it doesn't offer shock-value. Kagti & Zoya Akhtar's Screenplay is masterful in parts. How one wishes if the suspense was better. Kagti's Direction is mercilessly moody, adapting the film's structure most accurately. Cinematography is perfect. Editing is razor-sharp. Art & Costume Design are good.\n\nPerformance-Wise: Aamir Khan delivers superbly. He plays the tormented protagonist with force. Kareena Kapoor is excellent, as always. Rani Mukherji is terrific in a small, but significant role. Nawazuddin Siddiqui is gloriously scene-stealing in a meaty supporting role. Raj Kumar Yadav is highly competent. Shernaz Patel is haunting.\n\nOn the whole, 'Talaash' isn't flawless, but it surely is an interesting watch."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "iyer-venkatesh2",
        "review_rating": "8",
        "review_title": "Overall a good watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "till-the-last-day",
        "review_rating": "6",
        "review_title": "Talaash (2012)-An One Time Watch Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "siddhantgiri1994",
        "review_rating": "10",
        "review_title": "\"Talaash\" has a style .",
        "review_detailed_main": "What will you believe , what do you believe , what can you believe? These are the questions asked in this movie. Will you believe some fact that has been already established in your knowledge-book as a ridiculous lie.This movie will appeal to many and also be repelled by many.These types of movies are already made in 'Hollywood' but you have to see this.This has got it's own style,own setting , everything else to fit into the mood of an Indian cine-goer.People may say that it has been inspired by many Hollywood movies and is made after the success horn is blown but my friends it is not an entire remake like a 'Salman' movie . The acting is outstanding by everyone , as usual the dialogues of 'Farhan Akhtar' fit into the dark,mysterious and painful mood of the story but this time 'Farhan Akhtar' delivered some hard hitting dialogues.It maybe because e was accompanied by 'Anurag Basu'.Many people spread many rumours but don't trust those. This movie is shot during the night time to give it a dark mood , you can say neo-noirish type and is perfect for this flick which will hold you to your seats. After almost 2 years ,that after 'Kaminey' this is the movie which really counted as a dark movie.You will see characters having self-introspection,characters fighting with their own life and pain.They will be trying to escape but something beholds them and doesn't let them go.Forget what'Raja Sen' said(actually he rated it 2.5/5) , trust me and go for this.I hope you won't regret."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rraghav",
        "review_rating": "6",
        "review_title": "Above average to sum up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "princeeross",
        "review_rating": "9",
        "review_title": "Yet another masterpiece by the Genius!!",
        "review_detailed_main": "The movie as the name suggests is a \"talaash\" for viewers who till the very last moment keep guessing about the various incidents that unfolds before them .. The movie has been wonderfully scripted and directed.. Barring the last 10 minutes there isn't a single instance in the movie where it gets a little monotonous. All the actors have done a wonderful job especially Mr. Siddiqui who can take a bow.The plot of the movie is strong and can be regarded as an edge on thriller.The background score is very well composed and keeps the viewers interested.. Overall,as anticipated Talaash lives up to the expectation and delivers a powerful punch."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "dcoolsam",
        "review_rating": "6",
        "review_title": "Good Movie, 'The End' could have been better",
        "review_detailed_main": "Hi, I watched this movie first day first show.\n\nOverall the movie keeps you glued to your seats almost till the end. Just when you think you are going to experience an awesome resolution to the suspense and riddle the movie has plotted, movie gives you some not-so-logical solution to the mystery.\n\nAlso, the movie moves with a sluggish pace, I felt.\n\nOverall the movie is good. Acting of all the people is quite good. Just that the end of the movie is NOT so good, it could have been much better. I thought it would be something like CID. :)))))))\n\nAnyways, you can watch it once in theater, if you're a movie buff.\n\nJee Le Jara, song is more than awesome :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "silvan-desouza",
        "review_rating": "8",
        "review_title": "Aamir is back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "biplabc77-545-54109",
        "review_rating": "6",
        "review_title": "Do not get caught up in the hype...Talaash is just another Hindi movie.",
        "review_detailed_main": "I booked tickets for Talaash as soon as the tickets went on sale three days before the release date. Unlike most of you reading this review, I was not lucky enough to have the benefit of reading reviews.I wish I had waited.\n\nThe movie is gripping at times though ever so often the pace slackens and sometimes becomes a crawl. I heard several members of the audience yawn loudly in the second half. With a better director and tighter screenplay, the movie could have so much better. What I found most annoying was the climax - it is quite ordinary and borders on the ridiculous.\n\nI heard in the news today that the movie has done business of INR49cr. in the first three days of release. I strongly believe the collections speak less about the quality of the film and more about the smart advertising and marketing that Aamir and his team has done. Similar to Ghajini, the movie has been released simultaneously in large numbers of screens across the country so as to maximize collections before word of mouth spreads.\n\nPlease do not go to the theater with high expectations - you will be disappointed."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "raginimehta475",
        "review_rating": "2",
        "review_title": "Good try but lost it's way in mid of story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "naw_nwa",
        "review_rating": "7",
        "review_title": "Watchable just till the climax",
        "review_detailed_main": "So keeping in mind to not disturb any one else's movie experience by giving out any spoilers ,, i would like to review this movie in short. All the AAMIR KHAN bluff of great movies is likely to get over after this one, he had a great time for last few year. Let me give points to just sum up how i felt about different aspects.\n\nEntertainment - 4/10( A few laughs and mostly u will keep searching in your head)\n\nActing - 9/10 ( Especially Nawazuddin sahab)\n\nSuspense - 8/10 (The core of the suspense was terrible but the unfolding was great.\n\nDirection - 6/10 ( Some scenes really awesome, but some just bore u to death)\n\nPlot- 5/10 ( The way it was hyped , \"THE ANSWER LIES WITHIN\",, if this was another country ,, the producers would have been sued for giving wrong info of the services the consumers paid for)\n\nOverall- 7/10( Its a really watchable movie than the crap bollywood is producing these years,, don't go with ultra high expectations,, not memorable,and even if would be good if u don't't watch M NIGHT SHYAMALAN movies,,, ohhh and yes one point i gave extra just for Nawazuddin siddique)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sal_maan12",
        "review_rating": "",
        "review_title": "Talaash leaves you thinking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sunildaswaney-63642",
        "review_rating": "9",
        "review_title": "EXCELLENT MOVIE",
        "review_detailed_main": "\"TALAASH\"is an excellent film,in every sense of the word,be it the direction acting,screenplay, editing, story and music. Definitely one of Aamir Khan's best movies."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "asha-albert",
        "review_rating": "7",
        "review_title": "A study in loneliness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kamalbeeee",
        "review_rating": "8",
        "review_title": "Feel good movie..!!",
        "review_detailed_main": "Really it surprise me even i had watch this flick on second time..and i can easily predict the climax...but still its worthful to watch...all castings are soo good...nice screenplay and story...awesome..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "beep-checkey",
        "review_rating": "7",
        "review_title": "A good refreshing break from the recent mainstream bollywood outings, but still in the end I was left a bit unsatisfied",
        "review_detailed_main": "The movie is weaved out of two fabrics, one of a crime-noir with many interesting and mysterious characters thrown in and the other of a drama about a couple dealing with the death of their only child.\n\nThe film introduces you to a promising plot dealing with the mysterious death of a movie star, and as the first half progresses the plot gets laden with many characters. As revelations continue to pop in the 'search' gets intense and just before the intermission the plot gets seated at a juncture beyond which the 'search' only looks more promising. But then comes the second half and the plots veers off in a different direction altogether, the intense buildup gets diluted, the story becomes sluggish as the psychological tribulations of a couple suffering from a tremendous loss take center-stage.\n\nFor those who were expecting a taut thriller the first thirty minutes or so of the second half transform the movie into a momentarily vapid experience. The complete shift of focus makes you ponder over the possible entwinement of these two fabrics but because these two fabrics were not rolled out simultaneously but in steps your interest in the mysterious story which was supposed to be the backbone of the plot begins to fade. After a while that story is picked again and as the plot borders its climax the intensity gets built up again. The climax is one which you could have expected around ten minutes before it actually happened and though it fits in the scheme of happening in the plot somewhere you feel that you have been left unsatisfied.\n\nThe problem is not with the plot or its climax, but with the weaving of the two stories in the plot, the transition from thriller to drama did not seem to be too smooth to me. Although the glimpses of the psychological quagmire in which the parents are stuck are shown in the first half but the way in which the story of the distressed husband and his closeness to a prostitute takes the centre-stage in the second half makes you doubt if the story of the dead movie star is actually that important.\n\nAamir as the policeman and the troubled householder, Rani as the grieving wife and Kareena as the mysterious prostitute were good in their respective roles, but the best performance of the movie, in my opinion, was by Nawazuddin Siddiqui who portrayed the character of a cripple named Tehmur. Siddiqui really blossomed in the character, he was really into it.\n\nOverall it is a fine movie and worth at least one watch. The climax, I must say, though not entirely satisfying is at least unique. Nothing like anything you have seen recently in mainstream Bollywood."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ankitkumar313",
        "review_rating": "10",
        "review_title": "Some people have a habbit of making amazing movies! Aamir",
        "review_detailed_main": "It will be injustice to say the movies was dark! Well The male lead was exceptional he is just growing in stature day in and day out. If bollywood has started making some really heart touching exceptional movies then a huge amount of credit goes to none other than Aamir. Kareena and Rani were equally good too. Not to forget nawazuddin (faisal from gangs of wasseypur).\n\nBollywood's future is bright man. We have started thinking while making movies and brave directors and actors are willing to work on different stories not thinking about commercial success.\n\nI am going to watch it again and again and again....\n\nAamir - The real king khan of them all... TOM HANKS of India....\n\nOnce in a while a song comes that you will keep singing in your head... jee le jara is such a song. Muskanenin jhooti hai was equally good.\n\nMUST WATCH FOLKS 10/10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "MovieNewsAndUpdates",
        "review_rating": "6",
        "review_title": "A great Start with an Unexpected end",
        "review_detailed_main": "Well, its an Aamir Khan's movie, one ought to watch it. The thought that crosses many people's mind. It is expected to have a lot of curiosity when it is about Aamir Khan's film. Every film of his has something new to offer. Well, does this movie do justice to the others?? For me, it did not. After having seen him in movies like Rang de Basanti, Taare Zameen Par, 3 Idiots and many more this one definitely kept me engaged but disappointed in the end. The movie had a great start and one could never get a clue of what is going on even after the interval for a while. Now i understand that like me many people have their habit to think a lot about the possibilities of the end while watching a thriller, this succeeds in doing that for sure. But the important point is that does it leave you satisfied?? Well, to me the end definitely did not go down well and considering it as an Aamir Khan movie i expected a much better end than what i got to see. There was a a very major discrepancy which one might notice while watching the movie As far as the performances are concerned there can never be any questions on the three lead actors performances. The other important role played by Nawazuddin was also very convincing and it is good to watch him on screen especially after GOW Now i am not blaming Aamir Khan for the kind of end but i am definitely surprised that how did he opt for a movie which would leave the audience dissatisfied. With all that being said many might yet enjoy it because of the tricky storytelling and there is nothing wrong with it"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "bharat047",
        "review_rating": "8",
        "review_title": "One thing is for sure, those who do not like Taalash are those who are going to like Dabanng2",
        "review_detailed_main": "One thing is for sure, those who do not like Taalash are those who are going to like Dabanng2.. Amazing thriller! I didn't even get up in the interval to grab up my favorite cheese pop-corn; all the time was trying to speculate who the \"killer\" is and what is the link between all the small divisions. Trust me, if you do not know the story your mind is also going to join in this Taalash, trying to figure out the missing link.\n\nIf i say superb acting by Amir Khan, Kareena, Rani, Nawazuddin; If i say Superb dialogues by Farhan Akhtar; If i say Superb Lyrics By Javed Akhtar; If i say superb story by Reema Kagti and superb Direction too, I won't be lying.\n\nThe movie might be slow for some non-compatiable souls out there, but trust me every single line spoken in the movie is a necessity. Go for it not because it is a Aamir Khan Movie..but for you will be watching a really good thriller this year after Kaahani.\n\nMy rating 4/5"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "thevikingkid",
        "review_rating": "7",
        "review_title": "A Refreshing Change!",
        "review_detailed_main": "Talaash is a welcome change from the current lot of seriously bad Bollywood movies. The movie immerses you head on into the plot which for me personally is what I look for in good movies. Great cinematography and Ram Sampath's background score create an eerie and dark vibe of a semi thriller movie. If you have seen the movie Kahaani starring Vidya Balan, this movie is another great addition to the genre of Indian suspense thrillers.\n\nAamir Khan is at his serious best as Inspector Shekhawat playing the role of an insomniac cop. Kareena on the other hand played her character flawlessly and oozed beauty and seduction with ease. Nawazuddin also played an impressive role.\n\nAlthough I have similar Hollywood movies (naming them would reveal the suspense), it was the acting which really took the film to another level. If you are sitting at home wondering whether or not to watch this movie, take my advice.. WATCH IT, preferably during the night :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sunnyyroy",
        "review_rating": "1",
        "review_title": "See it to believe its stupidity",
        "review_detailed_main": "Few goes to watch a movie to see the camera work, few even go to check the cinematography, few for background score and music.....If you are one of them, you will fall in love with Talaash.\n\nBut if you are expecting a taut thriller, sorry it was painfully slow for a thriller. With so many narrations going in parallel - a mysterious accident, a depressed couple, a psychic and the Mumbai underbelly, the movie was simply shifting its focus from the main plot. The movie is filled with so many unnecessary characters and their sub plots, that even the mystery takes a backseat which only revives when a call girl suddenly (after a change of heart) reveals some secrets to inspector Shekhawat out of sheer generosity of saving her!!!! Then again the director remembered that she is indeed directing a thriller. Good.\n\nNawazuddin Siddiqui though brilliantly essayed his character (best from the movie), but by the time the movie ends you are left wondering what is the significance of his character with the main story (even without his character, the story would have ended the same way) or what was the need for having unnecessary characters like the one who played his love interest???? Still thinking!!!!!\n\nBeing promoted as a thriller, the movie was test on your patience. Till the climax, it was going as a decent thriller at best and the only thing that could have saved this sinking ship was the CLIMAX. But alas, the CLIMAX proved to be the ultimate drawback. The most escapist form of an explanation, a thriller can ever think of. But still everything depends on the execution, which was good till that point of time, but after the \"TWIST\" was revealed it was all a downhill. And even when the mystery is solved, the director was not yet done, she took another 10 minutes to complete other formalities. I would have rated it 3 till the climax. But the last 30 minutes are extraordinarily stupid and bizarre.\n\nThose who crave for intellect and thought provoking movies (which Talaash has been promoted as) please be aware of this....!!!! It could have been a decent fare, ruined completely by the horrible climax."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "deepak71681",
        "review_rating": "7",
        "review_title": "Rehash of Hollywood films with Indian sensiblities",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jahangirhussain74",
        "review_rating": "",
        "review_title": "Certainly not one of Aamir's best performances!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shravansingh2491",
        "review_rating": "10",
        "review_title": "An almost brilliant baked suspense cake !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "siddharthmjhala",
        "review_rating": "7",
        "review_title": "A great Hindi production after a long time",
        "review_detailed_main": "As usual Aamir movies have lot of expectancy and he always delivers, this time is no different. A superb combination of Thrill and mystery. Happy to see B-town coming up with such an awesome movie. No extra action, No extra dialogs just a perfect blend of superb acting and an gripping story. The flow of the movie is fabulous, and believe me you feel the interval disturbing to break that flow! People say no social message from this movie yet I found a message sidelined in the film of respecting every human being. A must watch, perfect movie from Mr. perfectionist. have to give it 10/10! And even after knowing the story you feel like watching it again and experiencing the thrill all over."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jun_es10",
        "review_rating": "10",
        "review_title": "Good concept for an Indian movie",
        "review_detailed_main": "i don't know from where should i start .... movie started with a very slow screen play but it gets it peak every single second as it moves ahead. it a great mixture of some tremendous ideas and the director quite effectively manages to display them :) Actors where great as usual.\n\namir khan 9/10 kareena kapoor 9/10 rani mukherjee 9/10\n\ni thoroughly enjoyed the movies mystery throw its every up and down ... its a must watch movie :)\n\nthe last twist that the movie has is one great hell of a shock , the one u have never expected through out the movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sandhirflora",
        "review_rating": "6",
        "review_title": "Talaash of a decent story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "bonaparte_abhi",
        "review_rating": "8",
        "review_title": "Good but not great",
        "review_detailed_main": "Talaash.. good movie but not great.. build up was good.. but it the end they just ruined that build up.. acting was good, direction was good.. even songs were rightly placed.. \"Jee le zara\" done wonders when it put into right place.. still it was lacking something.. to be honest i didn't liked the climax.. they could take another angle of the movie.. build was soo great that i feel, after all that, filmmakers didn't know what to do in the end.. still much much better than all the crap movies releasing nowadays.. i would go for 8.5/10 cuz expectations were very high from aamir khan and it doesn't satisfied me upto that point.. still i would say go and watch it.. :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Auraa",
        "review_rating": "6",
        "review_title": "brilliant storytelling, but not an 'aamir khan movie'",
        "review_detailed_main": "I went to watch this movie with loads of expectations but was rather disappointed! It wasn't a lame or boring movie but it just wasn't upto the mark! the \"Aamir Khan mark\"! Its thrilling plot keep the audiences confused and guessing till the end,the dialogues have a rare dramatic overtone which made it a spine chilling thriller till the first half but basic flaws and slow pace ruined the thrill. It was predictable with no exceptional climax! whatever was the climax, it was obvious from the first shot and all I expected throughout the film that the 'obvious' would just be a misdirection!Aamir Khan role required little to no effort on his side, Kareena maintained the auraa of mystery and charm around her character throughout the film, Rani Mukherjee and Nawazuddin Siddhiqui seemed comfortable in their roles too. The music score was perfect and there were two or three good compositions as well. But even with all these positive points the movie is a let down. It's one of those one 'word'climaxes where you know one thing and the whole movie is an open book! For the last 10 minutes you sit there with an expression of 'dafuq, did I just watch!'In short, it is a one-time-watch, rather a good one after a long run of pathetic movies, but don't expect bloodcurdling suspense since Inspector Shekhawat isn't Sherlock or Singham, but is the 'good'cop with chronic insomnia and family issues! Nothing innovative!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rahul-pandey2191",
        "review_rating": "8",
        "review_title": "'Talaash' is a tale of love lost, fatal attraction and above all the quest to solve a perfect crime.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "aaravpanti",
        "review_rating": "7",
        "review_title": "Talaash is character driven, imaginative, emotional and an intense crime mystery.",
        "review_detailed_main": "Talaash is one of the few better films that I've seen in 2012. The movie is basically about the search of two aspects, one of them which I believe has a universal appeal. That aspect is to get on terms with 'loss' in your life of someone special and close to your heart. Other aspect is the suspense behind an accident, the twist, the mystery.\n\nBoth these aspects make it a very emotional journey of suspense and thrills. Also that emotion intensifies as the screenplay progresses and it is amazingly portrayed by the lead protagonist, Aamir Khan as Inspector Sekhawat. He is brilliant and this is one of his best, intense acts, a complete 180 to his role in '3 Idiots'. Kareena Kapoor's subtle mannerisms and screen presence is one of the reasons to keep you interested throughout the movie. She stands out and for me this is her best act and characterization of 2012. Rani Mukerji and Nawazuddin Siddiqui, both do a good job with their given screen time.\n\nRegarding the story, some of the reviews say its shamelessly copied from Hollywood flicks. Maybe there are similarities, but nevertheless I enjoyed it. Also it depends on whether you like the twist or the unfolded mystery in the movie or not, which is a personal choice. I personally admire Zoya Akhtar and Reema Kagti for bringing on such a suspenseful and thrilling narrative to the screen among the sea of stupid masala movies this year. The music and background score is good.\n\nSpecial mention to the cinematographer K.U. Mohanan, one of the underwater sequences in the climax is so beautifully picturized that it will remain with me as one of the highlighted moments of Talaash. The direction of Reema Kagti is really good as she maintains the curiosity in audience till the end. Talaash is character driven, imaginative, emotional and an intense crime mystery. If you like this genre, its definitely worth a watch."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "gupta-d-tanmay",
        "review_rating": "1",
        "review_title": "a perfect example of how you can ruin an amazing movie",
        "review_detailed_main": "The movie a amazing, gripping story and you are in aw right until the point the suspense is out and frankly it ruins the whole movie. The build up is so good that you are expecting the unexpected but all you really end up with is utter disappointment. It felt as if writers brought it to a point where they did not know what to do with it.They cud have done wonders with what they had but sadly so they ruined it. It was like a Long Island Ice Tea with perfect mix of all the ingredients and then cherry at the top, some people love the cherry and they like it but honestly others might find it revolting. So to summarize they had the perfect recipe and they actually obliged by it right until the point where they though they cud get a bit funky."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "aayush-vij",
        "review_rating": "7",
        "review_title": "A perfectly executed search! (well, almost)",
        "review_detailed_main": "Hindi cinema has not seen a lot recently as far as suspense thrillers go. There was a time when the genre used to thrive in the Bombay film industry with films like 'Madhumati', 'Woh Kaun Thi?' and 'Teesri Manzil'. Director Reema Kagti almost does a perfect job in resurrecting that very genre with 'Talaash'.\n\nThe film starts off by showing us the seedy underbelly of Mumbai with the hauntingly jazzy 'Muskaanein Jhooti Hain' (crooned to perfection by Suman Sridhar) playing in the background. No sooner than we have settled, a car crashes into the sea out of nowhere. The owner of the car in question is a well-known actor and the case is soon handed over to Inspector Surjan Shekhawat (Aamir Khan). Shekhawat, it is revealed, is in a failing marriage with Roshni (Rani Mukerji) as they have drifted apart after the accidental death of their son for which he blames himself. As a result, Shekhawat is totally immersed in his investigation and on one night, he comes across a hooker, Rosy (Kareena Kapoor) who helps him in cracking the case.\n\nThe film has probably the most terrific first half seen in recent years. The bad news is that the second half is a letdown and the big revelation is an anti-climax and leaves you asking for so much more. Don't get me wrong, it is more than a watchable film and is much better than most mainstream potboilers to have come out this year. It's just not as good as one has come to expect from an Aamir Khan starrer.\n\nPerformance-wise, the supporting cast does a good job and the standout performers are easily Rajkumar Yadav and Nawazuddin Siddiqui as Shekhawat's deputy and the odd-job guy at a brothel respectively. Shernaz Patel doesn't have much to do and does her part adequately. Of the leads, Rani Mukerji gives an understated performance and should be given credit for not letting her character become a caricature straight out of a soap opera. Kareena Kapoor brings an element of oomph and sensuality to her role and gives a terrific performance. But it is Aamir Khan who is the heart and soul of this film and he gives it his all, his physique, his expressions, his dialogue delivery, all contributing to his performance. Watch out for the scene where he finally comes to terms with his loss.\n\nTechnically, the film stands out brilliantly. The cinematography by K.U Mohanan perfectly captures the dark side of the city of dreams and somewhat contributes to the chills. The score by Ram Sampath is groovy, haunting and goes in accordance with the theme and thankfully does not jar the narrative of the film. It's the dialogues that are a big letdown, considering that people like Farhan Akhtar and Anurag Kashyap were involved and Kareena Kapoor gets some of the cheesiest lines in the film.\n\nOverall, this film is nowhere near a bad attempt at reviving the suspense genre and is worth a watch. If only the end was more satisfying...."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "niksmelbindia",
        "review_rating": "10",
        "review_title": "Awesome Movie, Must watch Gripping performance",
        "review_detailed_main": "Just watched this movie.Mind blowing performance from Aamir Khan again. Nawaz Siddique is future Nasurrudin shah of Hindi film industry. Story is simply good not a copy from anywhere which makes it stand out from recent movies. Kareena is very good and Rani has a small but effective role. Ram sampath is new age Ar Rahman what a nice score. overall a pleasant experience a supernatural drama of a kind.Only weakness sometimes a bit slow but overall an awesome movie. The story is of a cop chasing murderer but final twist leaves you spell bound at least it left me spell bound . Hopefully this movie will help the dying genre of supernatural films in Hindi film industry. If you have seen woh kaun thi you will love this kind of film. Its not like Johny gaddaar but more supernatural sought of thriller then regular murder mystery. Aamir as i said above is super as father of the dead child and even as inspector shekhawat."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "darshancruz",
        "review_rating": "7",
        "review_title": "Talaash does meet your expectations, but not the hype surrounding it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "mdobaid777-387-527769",
        "review_rating": "9",
        "review_title": "****This review contain Spoiler****",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "viralpatel15",
        "review_rating": "6",
        "review_title": "enthralling, absorbing, sluggish, dramatic, and a bit disappointing",
        "review_detailed_main": "Talaash is enthralling, absorbing, sluggish, dramatic, and a bit disappointing. It might become blockbuster at box office however it is lackluster in terms of its speed. It establishes fairly well and build up was excellent with three of four suspenseful plots running together. But it looses its appeal in the middle where movie goes on a wild search of its characters, becomes recurring and monotonous. Eventually when the suspense opens up, it gives a feeling of \"finally\" or \"really!!!\" Climax neither gives you shock nor surprise, it rather gives you a pleasure that finally it is over.\n\nTalaash is technically good, sound mixing is phenomenon, songs fit in very well and helps to move the story, dialogues and silences both produces good humor in an otherwise dry movie. Aamir Khan is controlled and realistic, Kareena Kapoor is delightful and sexy, Rani Mukherjee is natural and luminous. Nawazuddin Siddiqui totally rocks in entire movie and his performance remains one of the biggest positive. Story, Script and Screenplay are not so brilliant and had this not been an Aamir Khan movie, would have been disaster at box office. ~ Viral Patel~ ratemovieshere.com"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "pranav_2001",
        "review_rating": "9",
        "review_title": "Great script",
        "review_detailed_main": "Aamir Khan has got himself into a very good habit. He cannot stop making movies with substance and class written all over it... and you will adore every moment of it!\n\nIt is not easy to make a movie \"likeable\" without adding some humour or action or romantic sequences. Talaash manages to win our hearts by not only having a great script but a symphony of great acting by every soul that you see in the movie, including Pinky, the dog. Talaash starts off by showing some random events which seem to have no connection. It gets a little long and frustrating in between with your brain trying to figure out the connection between these events.\n\nAamir Khan looks impeccable with his theatrical skills as a police officer, but I felt that his role was a little too soft w.r.t his image of an encounter specialist. Other than that, Aamir's role can fill up your heart with emotions. Kareena has a gift of acting and she uses it very well. She will actually convince you that she is a real prostitute; I guess the experience from 'Chameli' paid off :-). Rani not only suites her role but brings out the best in it. IMHO, you will not get to see a better professionalism among any other set of actors than what this movie puts forth.\n\nBut as I mentioned before, the story is what will leave you flabbergasted, although it might also make you wonder if the story was inspired by a Hollywood movie, but that's debatable. The initial confusion that the movie creates will all clear-up by the time movie ends. All the random pieces of puzzle fall beautifully into right place and bring your mind at peace. What keeps the movie real is that you never feel that songs interrupt the set of sequence in the movie. The songs actually bring out the essence of the scenes.\n\nMy suggestion: If you are looking for a smart movie this weekend this is it. Not sure if taking kids to this movie would be a 'smart' choice!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "abhisheksaha-619",
        "review_rating": "7",
        "review_title": "A Completely Different Kind of Supernatural Thriller, a Niche Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "mail-428-139623",
        "review_rating": "9",
        "review_title": "Thank You Aamir khan for this Awesome Movie..........Completely different subject ! ! ! ! ! ! ! ! ! !",
        "review_detailed_main": "My Review On \"TALAASH\" Movie\n\nAs usual \"Aamir Khan\" movies have lot of expectancy and he always delivers, this time \"Yes the answer lies within\". A superb combination of \"Thrill and Mystery\". No extra action, No extra dialogues just a perfect blend of superb acting and a gripping story which is completely different from others. The flow of the movie is fabulous & \"CLIMAX\" gave me some goosebumps, Must Watch, Perfect movie from Mr. Perfectionist. Deserves 4/5 & even after knowing the story you feel like watching it again and experiencing the thrill all over. You can't afford to miss this flick.\n\nHats Off To Aamir Khan, Kareena Kapoor, Rani Mukerji & Nawazuddin Siddiqui."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rockyvj",
        "review_rating": "7",
        "review_title": "Dramatic version of \"sixth sense\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "imprakrut",
        "review_rating": "1",
        "review_title": "Talaash: The search for a thriller begins.",
        "review_detailed_main": "Talaash was expected to be a suspense thriller, the movie had a real suspense building up with the cinematography and good performances by the lead actors, music is quite nice but the nothing that you will go back home humming outside the theater, maybe there wasn't a need of songs to do the job for the film. But as soon as you see the climax you feel sorry for the 2 hours you wasted earlier, simple not logical. When did aamir khan do such films with this type of plots. For the thrill there are no scenes where you would be off your seats.\n\nTalaash could have been a masterpiece with a better climax,and a faster screenplay.Aamir Khan's movie doesn't live up to the standards as in the earlier films. This is a genre, suspense thrillers are rare in bollywood. So maybe you should go for a show, but i is nothing that you should regret of you miss."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sharadk2006",
        "review_rating": "7",
        "review_title": "Talaash works...a rare interesting bollywood mystery thriller!",
        "review_detailed_main": "First of all, Talaash is not Kahaani and so people please stop comparing! Talaash is a well made mystery thriller with a frivolously handled climax. However the way the movie unfolds gives you a hint of something mysterious to happen. As a matter of fact, the starting song sequence itself had a spooky mysterious feel. The director is playing in between real and surreal and it is never easy to make such movies as you have to convince people about something they don't believe in! But still the director has done a brilliant job to make people keenly interested with the gripping pace and story. The second half is a bit dull but only relatively. In fact many important sequences unfold in second half. Different aspects of human behavior are traversed and handled proficiently.\n\nAll in all, Talaash works. It's just that the climax is frivolously/amateurishly handled but still I will give it to the director for daring to make such a movie in bollywood where everyone else is playing with same old romance/comedy/telugu action genre. Hopefully the next one will be far better by her! For this one, please be more receptive and don't watch this movie with your presumptions! 7/10 from my side."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "DesiBaba",
        "review_rating": "8",
        "review_title": "A treat to watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ragingbull_2005",
        "review_rating": "7",
        "review_title": "Brilliant movie ruined by a run of the mill ending",
        "review_detailed_main": "A film star dies when his car falls into the sea. There are mysterious circumstances surrounding the accident. Inspector Shekhawat(Aamir Khan) is the investigating officer. He has his own ghosts to exorcise as had lost a son to drowning. He blames this to his callousness and is unable to sleep at nights. He is moving away from his wife(Rani Mukerji). He barely talks to or becomes intimate with her. One such night while trying to find the clues for the case, he meets a prostitute(Kareena Kapoor) who unexpectedly begins helping him with what is proving to be a baffling case. His lonely wife has come in contact with a lady who claims to talk to their long dead child. The acting by the leads is top notch which is to be expected. Amir Khan, as the still grieving father and the sometimes angry and always efficient policeman, is fantastic. Rani does justice to her small role. But for me, Kareena was the star. She acted brilliantly in her important role and looked breathtakingly beautiful. Nawazuddin Sidiquuii as a paralyzed man who plans on getting rich by blackmailing is astonishingly good. The story is quite good in the first half. After a good buildup, it fizzles out completely by a run of the mill ending which is sure to draw boos from the crowd. But I loved the direction which tries to capture the mood of the underbelly of Mumbai, the background score and the songs and the performance. 3.5 out of 5."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "yashotejas",
        "review_rating": "10",
        "review_title": "In Indian cinemas.... u cant gate anything better than this... EPIC movie !!!",
        "review_detailed_main": "to speak about this movie... i just don't have words... if u like quality movies.... just go for it!!!\n\nbest suspense, best actors, best music, best direction and the best story... u just cant get anything better than that... must watch !!! this movie deserves at least 8 stars... underrated... :( Karina looks pretty... script is perfect... this movie has two different parts with no relation with each other in the start.. but after the twist they looks no different...\n\nwell, about amir khan... he is just too good !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "zikriafaheemcoolfriend",
        "review_rating": "6",
        "review_title": "Good Movie But Not An Amir Khans Superhit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "aamirs_kfupm",
        "review_rating": "8",
        "review_title": "Good and unconventional",
        "review_detailed_main": "Movie started well and pace is well maintained as the characters added into it. Overall is a suspense movie appeared more like Hollywood one rather than a bollywood commercial romantic or masala movie. Aamir performed well in his role of a police officer with his personal traumas trying to solve a mystery. Rani's role looked a bit incomplete as more could have been added to it. Kareena's role was better and unfamiliar for her but she appeared a bit more mature for the role.\n\nMusic is another good aspect of the movie and songs added well with the story.\n\nOverall it is a very good one but not sure how it will taken by someone looking for a more entertainment package after 3 idiots."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "yunusitboss",
        "review_rating": "6",
        "review_title": "Talaash (U/A)- Hindi --------my Rating : 3/5 WATCHABLE",
        "review_detailed_main": "Talaash (U/A)- Hindi --------my Rating : 3/5 WATCHABLE\n\nKhiladi 786 Review coming soon....\n\nFor more reviews and Hot news ... Just LIKE this page\n\nhttps://www.facebook.com/MovieReviewByYunusIrshad.\n\nTalaash (U/A)- Hindi --------my Rating : 3/5 WATCHABLE\n\nIt is a clean psychological thriller with a great twist.....\n\nVERY GOOD: *Suspense and thrilling aspects with a major shock in second half.... *Music - all songs were superb.... *Background sound : sound was superb in the car crash in first scene *Trailer : made to watch.... *Title : perfect as the entire script \"SEARCHES\"......\n\nAVERAGE: *Story : very complicated if u miss a single scene then u are out of the script...... *Screenplay: very slow but second half was good .... *Direction : nothing special * Dialogues : good but not be praised....\n\nVERY BAD: *No action sequences... *No proper Romance and cleavage.....\n\nFINAL VERDICT: It is one time watch movie.... but aamir disappoints us.... watch it CLEARLY......\n\nA cop, a housewife and a prostitute get entangled in a mystery that links their lives in unexpected ways."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "usmanstar16",
        "review_rating": "10",
        "review_title": "Taking Bollywood to new heights !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ruganblue",
        "review_rating": "6",
        "review_title": "Aamir would have chosen the movie while suffering from insomnia !!!",
        "review_detailed_main": "Bollywood movies succeed only because of hype and promotion.This movie is another example of how a good movie is hyped as one of the best in India.\n\nWith all due respect to the film, Reema and Aamir, this movie is not a substandard movie at all.It is a good movie,with a good screenplay.But it is in no way exceptional !!!\n\nAamir is a person who always chooses the plot of the movie with some responsibilities. But I do not know how could he endorse such things in his movies - because he always show cases himself as a person with some social cause!!!\n\nThis movie doesn't need an Aamir, and Aamir should not have chosen such a movie!!!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "mandavyakapoor",
        "review_rating": "3",
        "review_title": "Disappointment!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sloppyteen",
        "review_rating": "6",
        "review_title": "Confused Genre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "surfy78",
        "review_rating": "10",
        "review_title": "Great movie....interesting/unexpected ending",
        "review_detailed_main": "As an Amir khan fan,i waited for the movie eagerly.Went with my family on 1st day with high hopes and believe me, the movie was above our expectations.From the start, the movie jump started with a bang and it continued through out. After every scene you would think, u got the plot but you cant predict until you reach till the end of the movie. The entire movie is full of thrill and suspense.The movie goes in proper sequence and you would hardly notice any flaws anywhere. Every character fits with his/her role.\n\nIf you are in search for a thriller, this surely is going to be your cup of tea....definitely 10/10 score for the movie as u cant predict the ending...."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "anjanashrestha2",
        "review_rating": "6",
        "review_title": "So so",
        "review_detailed_main": "I think the best part of the movie was the Kareena factor. She has been able to get through not only the main character but also the audience with her charming, mystical and (com)passionate ways. She makes you feel that she has the remedy to your every pain. Rani Mukherjee is convincing as a grieving mom. She has portrayed a perfect character for someone who understands the plight of her husband and someone who is trying to get back to life herself. I think Aamir Khan's role could have been better off played by somebody else. There is nothing unique about his role. For a person known to experiment different kinds of roles, it looked like he's acted scenes that have in parts been played by many other actors in the past. The plot of the movie is just okay enough to keep you on it. I wouldn't say it is very interesting. There are some loopholes if you keep looking. There is a thin line between being able to grip your interest and making you fall below the interest level. The main weakness of the movie is that there are many worlds that have been connected together not very strongly. E.g. Aamir Khan's police life combined with the victim's world combined with the prostitute world combined with the slummy goon world combined with Ranee's miserable world combined with the supernatural world combined with Aamir-Kareena relationship combined with Aamir-Rani relationship did not actually seem to fit perfectly with each other for some reason. Just watch the movie if you want to watch another Aamir flick!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "marvalyz",
        "review_rating": "8",
        "review_title": "A Bold Move As Always...",
        "review_detailed_main": "... only this time it is a bit farther away from the expectations of a movie-goer looking for some fun over samosas.\n\nThat however does nothing to bring down the brilliance that is Talaash. It is a venture into a territory where many a popular names wouldn't dare step foot into. It provokes thoughts and entices emotions and all the while it stays utterly true to life.Just because it's a movie shouldn't always mean it can sell us false hopes and I think Aamir Khan is the only actor who finds solutions to life's problems in each of his movies and Talaash is no different.\n\nIn all fairness I think it must have been quite a challenge to bring down the level of sub-text to digestible degrees and to fit the moods of mainstream audiences. But what a masterpiece it could have been! Nonetheless the final product is every bit a gem in itself. The music entwines with the night life and the night life is the movie. Rani stands and delivers her character like it is her. Kareena got me here ! She shines like herself in the movie. The sleaze mixed with cheap dresses and make-up give her the character that would define her forever: Never has she made another character her own the way she does with Rosie or Simran? Then there's Aamir. He looks disconnected in the beginning like he is grappling with Surjan Singh but if you wait it out & follow the undertones you'll know why. He can never do any wrong now, can he? I will be watching it again. & like my most favorite actor I don't care if the movie brings in the crores or not.This is cinematic brilliance and above all it hits home. Lastly, respect for Farhan Akhtar & Anurag Kashyap for sharp dialogues that bring the storyline into focus and ring well during the flash-backs. Much respect for Reema Kagti and Zoya Akhtar for bringing to life such a brave subject. Kudos to everyone for the entertainment!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "amit_sinha62",
        "review_rating": "7",
        "review_title": "Talaash....Answer to Different Cinema lies in this",
        "review_detailed_main": "I am writing this review after 15 days of the movie being released, but I have still not been get over this movie though I have watched it twice. Many readers would think me crazy that what all I saw in Talaash, that the movie has grown over me so much. I would not have been able to answer this correctly, had I not seen it second time. Talaash starts with the dirty yet beautiful screenplay showing the underbelly of Mumbai. The starting scene where a man is walking with a guitar, pimp, customers and prostitutes are standing outside neon lit shady bars, an old lady on the footpath just staring are mixed together to show the other side of Mumbai . The story is good and the screenplay is such that this can be used as an example to teach students of cinema. All the actors in the movie have played their role close to reality. Aamir Khan as a normal cop who is as puzzled with the case as all other cops is the beauty of the character and I doubt that any other current star could have done justice to this role. Rani Mukherjee as his wife and Kareena Kapoor as a prostitute are other examples of perfect casting. I would love to do Special mention for two other actors - Nawazuddin Siddiqui and Rajkumar Yadav who is the new breed of class actors and leaves their impact even in a small role. Talaash is not an out and out suspense thriller, in fact it's a Suspense and Emotional drama with paranormal message attached to the whole film. Can you think of any other Bollywood cinema where emotional scenes are as strong as the suspense of the movie? Aamir Khan is a grief stricken father who has lost his 8 year old kid and is a restless human being. He is investigating the accidental death of a young Film star and is in the search of the answers to his death. He meets a prostitute Rosy, played by Kareena Kapoor who not only provides him information about the case but also soothes his grief and pain. Rani Mukherjee plays the role of a disturbed wife of Aamir Khan and them as a couple is not able to bring joy to their life because of their son's death in an accident. The emotional scenes between them take you to another level of the film. However, when the film ends, you find that the answer to the death of the Film star is not as important as the answers to his grief and guilt. That's where the story scores points; also I feel that the pace of the movie has been deliberately kept a bit slow as increasing the pace of the movie might have confused the audience. All the characters in the movie have been carefully built where there is a very line between them being an evil and good. The simple love and friendship between the pimp Nawazuddin and an age past prostitute looks real and keeps you thinking even when you walk out of the theater. The music is good and I have started respecting Ram Sampath even more. I love the background scores especially Muskanein jhoothi hai and Jiya lage Na; though all the other songs are good too. The best parts of these songs are that they are not forced upon you, but they help you to get in the rhythm of the movie. Talaash is not a perfect movie and I would also not say it's a cult movie. I would say that this movie should be watched because of the story, screenplay, and background music by Ram Sampath, class acting by all the actors and a perfect mix of mainstream and art cinema. I didn't like the suspense of Talaash in the end and I wished that Reema Kagti and Zoya Akthar could have written a slightly different climax. But No movie is perfect and you can ignore this deficiency to watch a good cinema. However, if you are bogged down by the climax, than I doubt that you will like the movie. Also, don't hope for an edge of the seat thriller as I guess it was never meant to be made like that. So go and watch Talaash and enjoy a different cinema which is set in the dark but will show light to the different kind of cinema. My rating is 7 out of 10."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Rehan7",
        "review_rating": "10",
        "review_title": "Great direction",
        "review_detailed_main": "Talaash : A very rare Indian thriller\n\nMy rating : 8/10\n\nUnfortunately many fans across India and Pakistan won't find this movie interesting because they are addicted to either lame comedy or chocolate love flicks.\n\nI wouldn't say the story is great but the direction is brilliant, some of the shots taken are amazing.\n\nFor people who hated the movie , i would suggest : Go watch Om shanti Om or Rab ne bana di jodi :p\n\nP.S : No Offense"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jsutariya",
        "review_rating": "6",
        "review_title": "Good movie with great performance from Amir",
        "review_detailed_main": "I went to the theater with very high expectations. And why shouldn't I? well, It is Amir's movie. Amir's performance in this movie is just outstanding. Navazuddin Siddiqui is also great. The movie goes real slowly and at the mid you are almost out of the track. You will ask yourself where the movie is heading to? There was a murder mystery at the beginning and what is going on now? Just then everything is like getting back on track. But at last you will feel like it was not an \"Amir's movie\". It was a \"Vikram bhatt movie\". I liked the movie But I had liked it more if it had been a murder mystery without any supernatural entities. The climax just spoils everything.."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "deathproofx7",
        "review_rating": "8",
        "review_title": "My review",
        "review_detailed_main": "The unseen hero in this movie is the cinematography.Mumbai was never seen like this earlier.The night life of Mumbai,de-glamourised.Editing comes next,as it set the grip and pace.And then the background score.The screenplay was praise-worthy.The story could have been better or perhaps could have gone into some really never-been-there territory.Or,you can be content my shelving it in the classic noir section.Overall,it's better than standard Bollywood fare. Aamir Khan's acting is notable.I personally,feel acting in cinema should have a restrained characteristics.otherwise,it's look like a stage-act or theatrical.One can feel the grip that his character has over his emotions."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jshinde13",
        "review_rating": "7",
        "review_title": "Another good one from aamir but could be more better than this",
        "review_detailed_main": "This is another good piece from reema kagati ,zoya and aamir. The base of movie is very strong. Story is also good but can be predictable at some places except from climax cleverly take a twist at last. As usual aamir,rani and karina did their job perfectly. Reema also directed film very well as she reveals the clues in very sharp manner. After a long time I saw a class cinematography and nice back ground direction in bollywood . But there are also loop holes in this film also this is not aamir's film that means what we expect from aamir about this film ,this film doesn't work on our expectation. The main reason about it, the story goes very slow in whole film it didn't peeks a speed which we needed in such film as we already saw in \"KAHAANI\". Sometimes it diverted from its path for a little while. There are some scenes in films which can be avoided or can be made shorter. Sometimes we saw that movie is not moving forward and at next while it goes far forward. Well by the overall it's a good movie I suggest if you really have some patience to watch such classic thriller movie which sometimes slow you down to reveal truth and you are aamir's fan then you not only can enjoy this movie but also keeps in memory this for best direction and story\u0085."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "fahadraz",
        "review_rating": "4",
        "review_title": "Imperfection from Mr Perfect....",
        "review_detailed_main": "I have just seen the movie in cinema yesterday and i was disappointed. Very very weak direction and story. Could have been better. That's what i m not expecting from Mr perfect. Acting is good but the movie is not the complete package. If i have to recommend the movie for someone, i shall only recommend it because of its music. Music is awesome by the way don't miss that. It is not a cinematic movie for sure. Just a ordinary movie with a hype called Mr Perfect and a bunch of leading actors. Movie doesn't reach up to the desired limits. I wonder if i obtain some good story from any bollywood movie releasing now a days. I rate this movie 4.5 out of 10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "cinish",
        "review_rating": "7",
        "review_title": "Great songs , great performances - risky subject",
        "review_detailed_main": "Aamir Khan is the one who brought us to watch the movie. Aamir has been surprisingly consistent at producing one great movie after another and that too with a diverse spectrum of subjects. Subject of Talaash also had that element of risk. I think Aamir did well to take the risk in the light of the story.\n\nThe best part of the movie are the excellent songs. I was completely struck by the song 'Jee Le Zara..' with excellent lyrics , music and feel. It is the kind of song that you can carry away with you and use to pacify you in hard times. The song 'Jiya Lage Na.. ' is equally excellent with a more catchy composition. The other songs are all great too as I listen to them.That is one comment that can be made risk-free : go watch the movie for the songs.\n\nThe treatment of the movie is emotional, dealing closely with the emotional turmoil that the protagonists of the movie are undergoing. The dark tension is convincingly captured for most part. The presentation of the climax is pretty good and surprising but thereafter there is a dragging treatment in the same manner which bordered on annoying. It is like a teacher presenting a controversial subject and pushing it as the students listen hiding their disinterest.\n\nKareena has done so many prostitute roles that she is carrying the role off with surprising ease. Rani has done a convincing job too as the housewife. Aamir has been great too.\n\nI would recommend the movie anyways.It can take some edit - the drag I mentioned earlier - I would cut out the digging scene , shorten the last scene.\n\nCinematography of Hindi movies has been amazing in recent times. Talaash was great as well."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "deepchatterjee2007",
        "review_rating": "10",
        "review_title": "Outstanding, Mesmerizing, Spellbound and WOW !!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "saurabh-97",
        "review_rating": "7",
        "review_title": "Higher Expectations",
        "review_detailed_main": "I never miss a Aamir khan movie,could not miss this one,i had high hopes but did not stand properly,it was not that bad.The movie is really slow,they take time to introduce each character into the story,what I like d is when it started to feel boring,there is a new twist in the story,which makes you interested in the story,I liked how Kareena kapoor comes gives hints,but she also takes such a long time,Aamir khan is acting good(like always),the background music is apt in may scenes,and the cinematography is sexy.The direction is also good,the ending is not that great because the title says answers lies within,but those answers do not satisfy us.Go for this movie because we will get to see a movie which has a style of 70's crime movies,we will enjoy it."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jitendersan_ssc",
        "review_rating": "10",
        "review_title": "This is one gem of a movie u cannot miss !!! - bollywoods first real thriller.",
        "review_detailed_main": "10/10 movie.\n\nWhatever rumors u heard about the killer or not .. they are not true ... this is an absolute gem of a movie ... and as some reviews suggested the main hero of the movie is the script and thats true but the actors did a splendid job as well . You would have never seen such a movie in Bollywood ever .. this stands in the league of Sixth sense, Mechanist, Shutter Island .. All i can say is u have any expectations from this movie they will be shattered in a good way . This is one Gem of a movie u surelly cannot miss .. for all ages and all movie lovers :) . As the going says Amir Khan can never disappoint u and he does it again ... the wait was worth it :) next on cards is Dhoom 3 :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "devesh070",
        "review_rating": "7",
        "review_title": "Great suspense movie after Kahaani",
        "review_detailed_main": "Just watch the movie first day first show. Movie is much more like drama suspense in the movie there is all about murder case .When film start one of famous actor died, how he died , what happen to him, what kareena kapoor is doing there, what happen to aamir's child. The film is all about this.\n\none thing I like most is when at the last 30- 40 minutes left for movie to end at that time you didn't want to move your eyes from the screen and didn't want to get disturb that was the best part of the movie But movie some time got too slow but editor can't cut those part from movie because that is base of the story of the movie . one thing I like to say if you are going to watch after thinking that aamir kahn film come after \"3 idiot\" or after long time it must awesome movie like that movie don't make your expectation that high this movie is above average movie. You must go and enjoy the movie"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "aol-rup",
        "review_rating": "10",
        "review_title": "Talaash Review",
        "review_detailed_main": "I just saw Talaash today . If i have to describe the movie in words , its is fantastic , incredible , breathtaking . The cast which includes the Mr. Perfectionist Aamir Khan , Kareena Kapoor and Rani Mukherjee is enough to pull the crowds to the theaters . Dialogues by Farhan Akhtar and by Anurag Kashyap are just incredible . Reema Kagti has shown class as a top notch director . Aamir Khan as Inspector Shekhawat gives an incredible performance as ever . Kareena Kapoor has essayed the role of the prostitute Rosie , to perfection . Rani Mukherji has given a brilliant performance too . The other actor , who has really shone besides the main cast is Nawazuddin Siddiqui . I have become an ardent fan of his acting . Just see the variety of roles he has played , starting from Asgar Muqqaddam in Black Friday , Gopi the coward bandit in Paan Singh Tomar , Criminal in Sarfarosh , Faizal in Gangs of Wasseypur 2 ,IB officer in Kahaani . He like Aamir Khan is just mesmerizing in terms of body language besides incredible acting skills . I would like to see Aamir and Nawazuddin together in more films . For me Talaash is a movie which I would not hesitate going again and again to see in theaters . Talaash is for connoisseurs of Cinema and is an ideal addition to your VCD /DVD library ."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Niaz_Morshed",
        "review_rating": "7",
        "review_title": "A thriller film!",
        "review_detailed_main": "If you go 7 years back, aamir khan's latest movie was Mangal Pandey then\u0085after that he did Rang De Basanti-Fanaa-Tare Zameen Paar-Dhobi Ghat-3 Idiots and now this Talaash\u0085apart from Dhobi Ghat this one got the weakest script that aamir worked, in recent times\u0085Talaash was one of the few highly anticipated bolly movies of the year, its an aamir movie! aamir-rani-kareena together for the first time, farhan akter and anurag kashyap was involved with dialogues and story, so expectation level was high\u0085film was not bad, but not great.\n\nIt's a thriller film, but the director seemed confused at times about where to emphasize\u0085the story was not strong enough to build the suspense that a better thriller-mystery film requires\u0085overall aamir-kareena-rani all did their best, but am not satisfied...Saying again, its not a bad film, not a great one (like we are used to with Aamir -Films!) either."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "abhishekdixit011",
        "review_rating": "10",
        "review_title": "great movie",
        "review_detailed_main": "awesome movie. great suspense.... aamir you rocked.\n\nStory starts with an ostensible accident of a star followed by police investigation.Chief investigation officer is played by Aamir Khan. The story of Talaash is not only about suspense element ,suspense is just a part of beautiful lesson portrayed in Talaash i.e. \" Coming to terms with loss\". Go with high expectations and you will be pleasantly shocked to see the brilliance.\n\nSongs Jee Le Zara and Muskanein look exceptional on screen. a must watch movie for everyone. it will break all box office records. everyone must watch this movie. after 3 year a movie of aamir khan but totally worth it."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "drvivu",
        "review_rating": "6",
        "review_title": "starts well but ends badly",
        "review_detailed_main": "well i have always been a huge fan of aamir khan. just watched talaash. it starts well. all things forms perfect platform for movie. in midway movie takes unusual turn and ends in a disaster. a cop who himself is much depressed then he thinks his wife is. all because of guilt he was suffering from insomnia and depression. his behavior was irritable which confirms the diagnosis of depression. an accident case which he is investigating turns his life upside down. already depressed cop starts investigating a case. the positives about movie - acting by aamir and kareena life of prostitutes who are neglected by people is mentioned well negatives - depressing ends badly watch only if u are big aamir fan..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "dr_abrar0017",
        "review_rating": "4",
        "review_title": "Disappointing Aamir This Time....",
        "review_detailed_main": "I went 100 km from my town to see this in udaipur but what i got was not i really expected , a very good theme which was stretched into 2.5 Hour mystery Drama but i think this theme and story could be placed into 1 hour TV episode ,it was SO slow that i got asleep-ed twice in the theater ,i was watching thinking that the movie will pick the pace but before it could catch the pace it was all over ,Last 10 minutes was the best when every thing was revealed but before that was so so slow this could have been a great movie ,i can see extreme possibilities of Improvement so much display of prostitution too much Dark scenes ,very silent and slow dialogs ,and very Much helpless Aamir after watching two great movies namely Rang de basanti And 3 Idiots I was expecting another Great Movie but it was not as expected but i would appreciate Aamir on this Attempt of giving India a Good Thriller with Decent Make up"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "abhijitsky",
        "review_rating": "7",
        "review_title": "Not expected from Aamir",
        "review_detailed_main": "The movie is average, yes but it should be without Aamir. I didn't expected this stuff from Aamir. The movie is unscientific. Aamir was always know for his social message, . Nways but movie is average..With breathtaking acting by Rani Mukherjee, and awesome beauty of Kareen aKapoor, acting of Aamir Khan has always been good. Rani looks so beautiful in its role. After 3 year Ammir khan , didn't come up with bang. The movie is 2 and half year.Plot is very good And songs are awesome.It is one time watch movie At the end of movie you might be banging your head.But one has to give one chance to AAmir. Let see which will be aamor next movie.Ammir hiimself seems unsatsified with the script.Hence he is doing promotion not the extent of 3 idiots So in concusion it is typical bollywood masala movie"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "consultanttiju-acme",
        "review_rating": "10",
        "review_title": "Simply Superb :)",
        "review_detailed_main": "'Talaash', i went for this movie with lots of expectation as its an Aamir Khan Movie and i didn't get disappointed. I salute Aamir for giving such an incredible movie after a gap of three years. He is the only Indian Brand who always gives best with a variety. I think this is his best performance till date and he deserves a national award. Also for me 'Talaash' is Aamir's best movie till date (personally i liked it more than all his past flicks). Apart from Aamir, Kareena, Rani and all other actors gave a realistic performance. Direction was perfect as well the screenplay too. I am damn sure that the makers took lots of effort to shape the movie because its very difficult to convey the story without any loopholes. In short i will say it is a movie with a realistic first half, little dragging second half with an outstanding climax. Don't miss it guys."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "chetankumarverma",
        "review_rating": "6",
        "review_title": "In all and all, good movie with twist in story lifted from famous Hollywood movie(s).",
        "review_detailed_main": "First of all those who were expecting Talaash to be a fast moving suspense thriller, it disappoints!!! 80% of movie revolves around a couple suffering from a trauma of losing their child. Director Reema Kagti may be believes in optimum utilization of resources thats why almost in every frame, u can find either Aamir, Rani or Kareena. She gives character artists very little to perform except for Nawazuddin Siddiqui (may be because of his increased popularity after Gangs of wasseypur) who performs his role with perfection. Aamir has Rani as his companion in a story involving a couple suffering from a trauma of losing their child and Kareena, when he is investigating a murder of an actor. Both the lead actresses are excellent in every frame with Kareena specially stood apart, Aamir is top notch in a father/husband's role but not as a cop, Ram Shankar Nikunbh of Taare zameen par, excels over ACP Rathos of Sarfarosh. But thats where movie lacks as 80% of movie revolves around Rani & Aamir, despite such a lovely acting, this part of movie is very slow and people who expects Talaash to be a Fast paced thriller beginning to disappoints. But movie gain pace in the last 30 minutes because of the unexpected twist( which surely is not the original). Main problem in story of Talaash is that too much involvement in technicalities make its slow which surely was the case in Lakshya too, it surely needs a Christopher Nolan kind of act to make Batman delivers in serious cinema. Rest music is OK type, camera work is good and rating of movie revolves from 3 to 4, for a die hard of fan it can be 4 but even the serious critique of Aamir cant give the movie rating below 3. My personal rating is 3, with a note that movie is must watch in its early days only. Goldie ur still the best in making suspense thriller :) :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Amadeus75",
        "review_rating": "9",
        "review_title": "Talaash- Intricately woven, wonderfully enacted.. MUST WATCH",
        "review_detailed_main": "Of all things that we search in our lives, the search for truth is the most excruciating yet addictive for most of us. Talaash is a tapestry containing varied hues of human emotions, trials faced by individuals of different backgrounds yet evoking our empathy because these are pains we can all relate to and ones which we feel achingly and knowingly.\n\nIt is an intricately woven gripping tale set against the backdrop of a mysterious event (car crash killing a movie star) that sets off an investigation by an Inspector (Shekhawat) essayed with ridiculous ease by Aamir Khan. But we all know that he pours his soul into each role and it is visible in every frame. The investigations bring to the fore a medley of characters, a pimp, sidekick of the pimp (Nawazuddin is simply a super actor and once again displays his emotive skills of a very high order). However central to the proceedings is also a prostitute Rosie who comes into contact with the Inspector as someone who is linked to the events concerning the dead movie star. Rosie played by Kareena is sensuality personified and I cannot but think of her as the one of the most seductive roles ever played on the Hindi screen. I said that no because of any brazen exposure but every word she utters suggestively, playfully, teasingly is only matched by an irresistible expression of her eyes in inviting someone to come closer. Wonderfully done by Kareena. There is then the role of the Inspector's wife played by Rani who is absolutely sincere to the character, elegantly draped in beautiful saris, she is a tormented soul coming to terms with the loss of her son in a tragic accident and it is this incident that binds the Inspector and his wife into a thorny embrace and they go through it in their own ways. The suffering of the Inspector spills on to his sphere of work and that's where the tale becomes even more intricate. There are several other characters all of whom have their place in this movie and every frame tries to make the most of telling us more and more.\n\nTechnically this is as good as it gets in Bollywood, with a scintillating background score and riveting cinematography. This is much more than a whodunit and so don't go in looking for a complicated plot on its own to be the hall mark. It simply is a tale of what our minds can take on in the face of very difficult moments in life, its about every day characters and their desperate urge to improve their lives, its about weakness and our struggle to remain strong against temptation. Its about a search for truth and retribution , a search for closure.. if ever there is one while we live."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "himanshumahadik",
        "review_rating": "6",
        "review_title": "Has the \"Talaash\" ended ??",
        "review_detailed_main": "Intelligence is defined as the having the capacity for thought and reason especially to a higher degree. Whereas Suspense is defined as an uncertain cognitive state.Reema Katgi's Talaash is an intelligently made suspense film, intriguingly captivating drama of emotion, thrill & shiver which doesn't allow u to take your eyes off the screen for a minute\u0085.till the end\u0085I said Reema not Aamir because somehow she owns this baby, so well she has nurtured & of which Amir may I say is the father, she deserves kudos for her direction right from the slow song (remember in my earlier review I mentioned Skyfall's slow song setting it up).On similar lines Talaash too sets it up & keeps u interested till the end of the drama. May be it takes us up to that level that u somehow do not accept the end\u0085the graph just drops with a drastic negative slope.\n\nI remember, it was Monday, 26th of November, 8:30 pm, I was driving back from office still getting over my Monday blues, on the signal, when the some radio station started blaring the \" Jee Le Zaraa .. Jee Le Zaraa \"\" promo song from the Friday release blockbuster when I recalled that I had to book the tickets. Took out my phone & launched the Book my show app, selected the dates & just when I was going to make the payment, the signal turned green; the next signal I made my payment.Referring to this because let me tell u one thing, where Talaash lets us down – its end of 2012 & the same story I bet wouldn't have made any different if casted a decade ago. This is age of technology & u has no escape, the audience just knows that & wants that!\n\nIt's a one of its kind combination – Two congruent equilateral triangles – Rani-Karina-Aamir & Aamir-Zoya-Reema with Aamir the common angle between them with Farhan Akhtar & Anurag Kashyap adding the well timed dialogues \u0085There's a talk that Amir delayed the film & added the \"Jiya Lage Na\" song which apparently is my favourite of the lot. The story starts off with a sedan speeding straight at you on a quite road & in a flash taking a ninety degree turn to the right zooming of the barricade into the waters, the driver an ivy league superstar- dead, no alcohol or drug traces, no other body marks!! Surjan Shekhawat (Aamir Khan) plays the inspectors role. Another story, that of Amir's family- runs in parallel, Amir's son Karan, drowned couple of years ago, which\n\nAmir takes the blame on himself, is already a dad, missing his fatherhood duties. His wifey- Roshni (Rani Mukherji) still trying to come out of the pain n shock plays the perfect character of a matured housewife, arguably this might be the only film in which she appears before us with I would say \"no make-up\". Aamir, during his duty as a cop investigating the accidental case comes in contact with prostitute, Rosie (Kareena Kapoor), who mysteriously is trying to captivate him & leading him to the next clues like that on a treasure hunt also trying to seduce him throughout the film, with Aamir not ready to budge eventually finding some mental solace. Kareena's attractively portrayed soft image, sultry eyes, beguiling features keeps the class of the flick going. As the story unwinds another good actor come to the stage, Nawazuddin Siddiqui,who has already made his mark in Kahaani,, Paan Singh Tomar , becomes the king pin trying to take the advantage of the situation on whose calls the story starts moving.\n\nThe interval seems kind of odd with the audience knowing who might be involved, an accident or a murder? But then, it turns out to be shrewdly timed one as the story unfolds further. Reema, as a director adding to her screen play experience from Zindagi Na Milegi Dobara, Honeymoon Travels Pvt. Ltd. & Lagaan, as already mentioned shows brilliance with her camera work all over the film, superb direction, perfect angles & well supported background score by Ram Sampath.Everything about Reema's work seems perfect except for the housewife- Rani Mukhurjee's French manicure\n\nAamir – the perfectionist, the top paid actor in the industry, the only person on the planet who denied making his wax statue @Madame Tussauds takes the film on his strong shoulders. He shows his act & as we rightly associate him with a genius, plays his role to the fullest. Though, one might say that this flick is far below his recent previous ones. The two plots throughout the movie convolute & try to give the audience the intentional kick at the end. The second half seems not to have the same pace as the first, taking us towards the slow end. The movie fails to perform the second act which is the most important one in a suspense thriller. This one is a onetime watch film filled with unprecedented yet pale ending.\n\n——————————————————————————————\n\nCensor Rating = U/A.\n\nRunning time=139 minutes.\n\nNumber of times I saw my watch = 2.\n\nMy Rating=6.5/10.\n\n——————————————————————————————"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vijayant_venky",
        "review_rating": "8",
        "review_title": "Gripping! A must watch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "arijit-pritamzoro",
        "review_rating": "7",
        "review_title": "Average story without magic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "khwaja_naumaan",
        "review_rating": "9",
        "review_title": "A movie of 30 Seconds...........Exceptional.",
        "review_detailed_main": "It took me 92 Km and 2 hours of driving to watch this movie. i missed the very first show but managed to grab the second one in spite of plethora of aspirants present there to witness it but many of them had to return home or to wait for next show at least as they could not obtain tickets. The movie started with flying colors and it started increasing blood pressures, heartbeats of everyone inside the theater. People kept rolling themselves left right, upside down, clockwise anticlockwise because of suspense and thriller. The climax some of them were shocked as I was. Those who were not were at least clapping, cheering or shouting as louder as they could.Amir once again produced a great masterpiece that once again succeeded to convey a lesson and great amount of entertainment to the audience. Amir proved once again why he is Amir Khan."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ketgup83",
        "review_rating": "7",
        "review_title": "Talaash was like a roller coaster ride",
        "review_detailed_main": "Talaash was like a roller coaster ride in which you will feel the adrenalin rush in few scenes and in some , you will be bored waiting for some crispy twist and turns.\n\nTalaash tells the story of 3 protagonist - A cop(played by Aamir Khan ) , a housewife( Rani Mukherjee) and a prostitute ( Kareena Kapoor) who lives are going to change the very moment they meet each other.\n\nDirected by Reema Kagti ( Also directed Honeymoon Travel Ltd and story of Zindigi Na Milegi Dobara) , Talaash is a psychological murder mystery which has it share of praises and flaws. The movie begins with a murder of a well-known celebrity on a deathly road that has been killing people for past 3 years. Enter Surjan Singh Shekawat( Aamir Khan) , who himself is going through trauma of his son's death , takes up in-charge and solves the mystery with help of a prostitute. Few scenes in the beginning do stand out especially the ones between Aamir Khan and Kareena Kapoor as well with Rani Mukherjee , the investigation scenes and couple of scenes shot in prostitute areas. However, the film looses the steam in between and moves at a snail pace diverting the attention from a murder mystery to emotional drama which becomes over dramatic and even becomes unbearable at certain point. Fortunately , the film's pace picks up and the twist in the end gives you an adrenalin rush pumping up and a chill will run down your spine. Eventually , the film ends of emotional content which has executed brilliantly. Direction wise , Reema Kagti is good but she could have made the movie more engaging adding more thrilling moments.Editing could have more crispy. Screenplay is tight but looses the momentum at some point. Art direction is just about OK. Cinematography is efficient capturing the breath-taking underwater sequences bravely. Music by Ram- Sampath is worth mentioning with \"Jee Le zara\" best among the all. Aamir Khan is always dependable and he has proved his mettle once again. The supremely talented actor is superb towards the end where he finds about his son. Kiddos to him for his brave performance. Kareena Kapoor is just getting better and better with each film. She completely surprise you with a role that is completely different. Rani is great and reprises her role of a house-wife( Yuva) with minimum effort. Nawazuddin is amazing in his small role.\n\nOverall , Talaash turned out to be an intellectual , psychological thriller which was high on emotional content and less of murder mystery. But the twist in the end and performances by the star cast makes it a good watch. Good 3 / 5"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "dipusood",
        "review_rating": "5",
        "review_title": "Another Stolen Theme from Hollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "JPEI64",
        "review_rating": "6",
        "review_title": "Better than most B'wood movies but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "visitthanuja",
        "review_rating": "8",
        "review_title": "Unexpected and Unrealistic Climax - Don't Miss it",
        "review_detailed_main": "I was surprised to see the unexpected climax though it was unrealistic , its a murder mystery there are lots of things comes to your mind but the story takes a turn all the time. In between there are few scenes which is quite boring, as usual Amir gave justice to his role Kareena looks stunning.\n\nI felt Kareena could have done better acting than what she did.She should improve her acting skills.\n\nAll the other actors done a good job.Rani looks natural with light makeup All the songs are very pleasant.\n\nyou will be glued to your seat and watch this movie till the end ."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "6",
        "review_title": "Disappointing ending",
        "review_detailed_main": "The whole movie was very good but the ending of the movie was really disappointing. The acting of aamir Khan was just wow. Also good acting from Nawazuddin Siddiqui and Rani Mukherjee."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "guru-samant",
        "review_rating": "8",
        "review_title": "Very good Movie - Keep you engrossed till the end",
        "review_detailed_main": "A very good movie; which will keep you engrossed till the end. The end comes at a surprise; just when you start guessing things. It was not the best way i was expecting the revelation; but it was good enough instead of dragging.\n\nThe cinematography, acting, dialogs, music everything is top class.\n\nAamir, Rani and nawazuddin sheikh are brilliant.\n\nThis movie is far better than the mindless movies like khiladi786, dabaang, ready, JTHJ etc etc... The movie takes you move towards reality(not from the climax point); but showing the dark side of mumbai to its true sense. The music compliments the story very well; and there is no mindless dancing for no reason.\n\nWorth a watch; you wont repent sending few bucks watching a good movie..\n\nMovies like this, GOW1&2, DevD, Kahaani, 404, etc etc... has shown an evolving Indian cinema .. and that makes me feel very good and i am expecting much much good content coming out.\n\nKuduos to whole team of Talaash."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "manugw",
        "review_rating": "6",
        "review_title": "Expected more",
        "review_detailed_main": "The film tríes to keep up with two related stories, a crime investigation, the police inspector trying to uncover it, who also, carries a family situation affecting his mind and work but comes to an unsatisfactory ending that does not stir emotions, in fact it leaves a kind of a blurry emptiness. Not for awards"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "varun-imm",
        "review_rating": "9",
        "review_title": "Superb Acting by All Actors",
        "review_detailed_main": "First of all I would like to say that Aamir Khan has done something different again from regular Bollywood Movies. All the actors have performed well. They really get to the skin of the character. Though some of the viewers might not like the ending mostly because of the Indian movies regular stories. But this has something which matched the Hollywood movies concept where all the events unfolds at the end. The expressions of the face of the actors at various places has been intense and exceptional.\n\nFirst half of the story will grip you to the maximum. You would really like to complete it in one go. Second half is average but things get started interesting when it is about to end. One will actually enjoy Aamir Khan's acting that how he performs on the screen.\n\nMusic is good. You will enjoy songs in the movies. They have come up at the right time and joins with the story. And get ready to cry in the end."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "gajrajiitr",
        "review_rating": "6",
        "review_title": "not a time for that type of climax.. its old",
        "review_detailed_main": "As Amir khan's current habit of making good film. he is bollywood Mr. Pefrectionist but after watching this movie a doubt has been taken place in my mind. In the movie, sorry not the movie, in movie if we measure the performance of characters, in that case all had done a good job. Aamir was good as Surjan singh with thick mustache, a father of 12 years dead child. Rani is quite well but she has gotten less to contribute in the thriller. Kareena as Rosy was fantastic done justice with the character in her sexy dresses of Prost. The movie started with a road accident, after a series of investigation, it was going pretty well. All I want to say its 2012 not 80 where people get amuse by supernatural power. If Aamir would be patient of hallucination than it ll be good movie. As I am Amir fan but not quite happy after watching this movie. after getting out from theater if movie is good,you have a smile on your face, that show your satisfaction but I have not seen that on many faces including me that show movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rakeshbhatia986",
        "review_rating": "8",
        "review_title": "Talaash-when your search ends unexpectedly!!",
        "review_detailed_main": "With so much pre-release hype surrounding big-starrer bollywood movies these days,its hard to not make any preconceptions and draw similarities with previous winners of the genre.Likewise,Talaash had been likened to Kahaani a lot.Though every scene of Kahaani was a surprise package,but here,you get a taste familiar.The story unfolds into a gripping murder suspense whodunit in the first half.You expected that stuff and it lived upto the standards Aamir has set for himself.The pace of the story is quick,revelating every now and then to keep you invested.It is interwined with the background tale of sorrow of the family having lost their son.Like an intelligent script,the theme of the two tales get metaphorically attached(through dialogs) and you can sense in the bigger scheme of things,one's going to conclude the other.The second half takes a more personal turn,focusing mainly on the bonding that's brewing between the cop and the prostitute.Though a tad slow,the romance is subtle,which caresses you with unknown warmth.A few smart asses had made out the mystery and spoiled the hell out of it.But still,the suspense is sudden,unexpected and strikes you with force.The cinematography is brilliant in these sequences.Though the story explains a lot which was not needed,it doesn't leave you high and dry at the sudden turn.It completes itself,like the fine-tuned characters.Though a few scenes were a bit too corny and clichéd towards the end,the brilliant work by Aamir made up for all that.All-in-all,this is where your Talaash for a good bollywood movie should come to."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "tikkview",
        "review_rating": "7",
        "review_title": "\"Talaash\" forgot its \"search\" in the end",
        "review_detailed_main": "If you see this movie as a 4x100 meters relay, it was in the 1st place till interval,started dropping out to lower levels in 3rd & ended up with a \"hmmmm\" bronze level.\n\nBrave attempt for the route change from usual murder mysteries can ONLY come from a genius's movie, none other than Power packed AAMIR SAHIB! shouldered by two pillars of bollywood, Rani & Kareena! If you ask me to choose one among the queens, I would give the grace mark to \"woman\" Roshni (Rani) because she shined by her acting skills whereas 'the other woman' Rosy (Kareena) had the advantage of Kareena's massive appeal. For sure, adds a feather in Kareena's career cap. Nawazuddin Siddiqui's (Kahani fame) performance will promote him to 90's Nana Patekar/Manoj Bajpayee level soon! Aamir's dream/thoughts of \"could've done\" to save son's life was something more than a movie.\n\nThe tightened script gets loosened in the 2nd half in a way that after sometime, we completely forget that its a crime thriller. Unwanted importance to Aamir's family life in the 2nd half didn't tally the perfection the crew achieved in 1st half. Lack of intelligence in finding clues and mystery revealing is visible in many spots,as if all the clues are getting served to officer in plate.Too much names in \"story-screenplay-dialgoues\" (& was a bit surprised to see 'Additional dialogues') in title sounds as if the 'mult-brainy' discussions had screwed the 2nd half.\n\nReviewed by Aiyyapan see the original review http://www.tikkview.com/movies/2838-talaash"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "subhashyadav929",
        "review_rating": "2",
        "review_title": "Just above average !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vamsikrishnaongole",
        "review_rating": "",
        "review_title": "Helpful for a insomniac",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "CriticRoshan",
        "review_rating": "6",
        "review_title": "Minority Report meets The Sixth Sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "talktopushp",
        "review_rating": "9",
        "review_title": "it's really a good movie.Aamir Khan Rocks.",
        "review_detailed_main": "Talaash is a riveting combination of sentiment and suspense. And it's certainly raised my bar for Reema Kagti as a filmmaker.\n\nSurjan Shekhawat (amir) is a police officer investigating the death of a film star, while also coming to terms with his son's untimely death and the subsequent near collapse of his marriage with Roshni (Rani). He investigates the case with the help of an escort with a golden heart Rosy (Kareena) who also helps him come out his own personal misery. How the case solves itself takes you through an emotional ride that ends with a twist that is sure to divide the audience on its quality.\n\nit's really a good movie.Aamir Khan Rocks. Go and watch this movie. every moment you will enjoy this movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "akhilks-62564",
        "review_rating": "6",
        "review_title": "Too old for 2021",
        "review_detailed_main": "Watched it seeing the rating. But it was just average - above average experience.\n\nMight have been a new experience in 2012:))"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "surya_m77",
        "review_rating": "9",
        "review_title": "A nice watchable entertaining, suspense and thriller movie",
        "review_detailed_main": "The bad part about watching this movie was that some maniac had put its ending on some social networking website which I happened to read it accidentally. So after getting ruined and devastated by that maniac I nevertheless went ahead and saw this movie with my college mates. There are few flaws in the movie including some issues with overall direction and dialogues but in entirety this movie is engrossing and it is something really new which has never been attempted before in Bollywood. Aamir Khan as always looks perfect for the role and is so much into the character. He justifies his role completely. Kareena Kapoor had a glamorous look and role which she pulled it off quite confidently. She looked really beautiful and enchanting both. Watch this movie for its suspense and thrill moments. Also on music side both songs as well as background score is laudable. Appreciate the novelty on director's part and enjoy this great Indian suspense thriller movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "Only a fine one time watch with a not so impressive conclusion.",
        "review_detailed_main": "A rare 'Murder mystery' from Bollywood featuring names such as Aamir, Rani & Kareena, supported by Javed Akhtar (Lyrics), Zoya Akhtar (Writer), Farhan Akhtar (Dialogues) and Anurag Kashyap (Additional Dialgoues) was bound to raise the expectation level to the maximum. However, sadly after watching it, I didn't feel like being served well as the movie lacked the expected fireworks in its less impressive conclusion which should have been the highlight of the film representing this particular genre.\n\nAs it begins Talaash successfully manages to grab your attention with its well shot opening credits, calm introduction of its key characters and interesting investigations, resulting in a better first half for the audience. But post intermission, the problems begin with its slow narration mainly due to the added emotional plot related with Aamir & his family. The pace drops for a considerable period of time (including few songs) and then it all goes down to the climax where the viewers await the big shock coming their way to amaze them. But unfortunately after some good chase sequences, when the finale is there, Talaash fails to deliver and doesn't make any solid impact on the viewers with its loose and unimpressive disclosure.\n\nHence against all promises made in its subtle promotion, Talaash is not an edge of the seat, nail biting mysterious thriller as Kahaani. It devotes too much time to its sub-plots and also has many flaws in its storyline revolving around a strange accident. Performance wise it has some fine acts by the entire cast lead by Aamir Khan, Rani Mukherjee and Nawazuddin Siddiqui. Kareena would be shocking for many as a gorgeous hooker along with Shernaz Patel but Raj Kumar Yadav remains wasted. Visually, it takes you into the dark world of Mumbai with a great art direction, cinematography and background score which contribute a lot to the basic structure of the film. Yet, having some not so memorable & avoidable songs (Ram Sampath) it surely could have been a much crispier product with a better editing.\n\nTo sum it all, if you look upon the film as a solo Aamir Khan project coming after the gap of 3 years, then it more or less fails to give you the desired result. But taking it as a Reema Kagti film made on an interesting script, it is still a one- time watch venture which might be liked by many."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "basha_ahmad2002",
        "review_rating": "9",
        "review_title": "Excellent Movie - TALAASH",
        "review_detailed_main": "I guess Nawazuddin did an amazing acting.\n\nRani Mukherjee was really different.\n\nKareena Kapoor Khan was again excellent.\n\nAamir is obviously the perfect actor.\n\nHowever, what made the difference is the screenplay and dialogues.\n\nThe way dialogues were connected at different points in the file was amazing and made it more relating to the story.\n\nThis made us feel that the story is real even though it is based on spirits.\n\nThe credit goes to the story writing, screenplay and direction as they weaved a amazing story.\n\nThe songs were soothing to the heart.\n\nThe lyrics were touching."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kunalkhandwala",
        "review_rating": "7",
        "review_title": "Works as a suspense film, not as an Aamir Khan thriller",
        "review_detailed_main": "With the recent wave of films portraying leading actors as the macho, rowdy, fearless, dancing Police Inspector, director Reema Kagti's ('Honeymoon Travels') casting of Aamir Khan in the same uniform generated sudden apprehension about its consequence. Thankfully, she is associated with Excel Entertainment and is assuringly mature enough to not put him in those shoes. 'Talaash' is an intriguing suspense thriller that is emotional, psychological and paranormal. While its slow pace might negate most of its thrill, the intricacy of the plot conceals the suspense well to the end and we enjoy the game as we did with 'Gupt' and 'Kahaani'.\n\nA mysterious and sudden accident of a film-star on sea-face road becomes a high profile case for Inspector Surjan Sekhawat (Aamir Khan). The deeper he digs into it, the more unanswered questions arise and the reality of it being an accident or a crime remains distorted. Tehmur (Nawazuddin Siddiqui) plays a significant role in the film. He maintains a low profile working among prostitutes but has his eyes open to anything suspicious. His meddling nature gives him an opportunity to blackmail someone who could provide a clue to this mysterious case. While Tehmur devices his conniving plot, Sekhawat is still in search of the truth but roams through the glamorous streets of the city late at night to conceal his inner demons that remain strong in the shadows of his past. That is where he meets Rosie (Kareena Kapoor), a sex worker who offers guidance through the maze that confounds him. Sekhawat will be forced to confront his demons to find closure for the murder case as well as his past and at that, Rosie can prove to be more beneficial than he assumed.\n\nOne issue with the film is its simplicity. The cinematography lacks the richness and nuance that we expect from the studio. This could easily be a film shot in the late 90s and you wouldn't tell the difference. Vishal Dadlani's soothing melody in Jee Le zara is the film's musical highlight. The song's picturization is beautiful and covers many aspects of the husband-wife relationship that could have taken up more screen time when the film is already struggling with pace.\n\nAnother major setback of Zoya and Reema's screenplay is that we cannot feel deeply for most of the characters. Perhaps their grim, serious look throughout the film is a rationale and that could also be why Kareena Kapoor's flirtatious Rosie stands out as she teases with information. Kareena plays this part with ease with her experience in similar roles. Nawazuddin's Tehmur also works well because he depicts an opportunist in all the gloom that surrounds the mystery. Even if it is a selfishly conniving opportunity. Nawazuddin is truly a gem of an actor whose under-rated presence in acclaimed films is now surfacing brightly. Barring a confrontational scene with her husband, Rani Mukherjee's Roshni was dull and despondent. The film could almost be the same without her. For Aamir Khan, playing Sekhawat must be a cake walk. Apart from learning how to swim, the refined actor has little challenge in portraying the committed Inspector who is troubled by his conscience. Oddly though, there is no desperation in him to even close the case nor is there the acute wit to connect the dots. His helplessness is only aided by Rosie without whom, he would be fired from his job. With past tragedies in common, there is yet such disparity in Aamir's characters of Sekhawat and ACP Ajay Singh Rathore. Due to the weakness of his character, Aamir fails to portray any intensity, urgency or command that we would've loved to see with him being in uniform.\n\nThus, it seems like the director's choice of maintaining a slow pace for the plot along with the dull simplicity of its characters, makes 'Talaash' a far cry from being a great thriller. Worth a watch to enjoy the game of suspense but from an Aamir Khan film, we expect the exceptional and unfortunately, 'Talaash' isn't that."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kichdi",
        "review_rating": "8",
        "review_title": "Good Movie - Aamir Khan all the way",
        "review_detailed_main": "The movie is good, Aamir Khan delivers a good performance. He has no style, no airs, no over heroism, plays like a real cop. Technically the movie is very good & realistic but the story in the climax really makes you feel odd. If you believe in occult sciences then you would rate it 9 or 10 but my rating cannot cross 8. Rani too plays well but it is a Aamir Khan show. He is the best actor of this generation (who started careers after 1985), one gets the feeling no other actor of this generation would have done so perfectly without any style & unrealistic heroism. Despite being a story which revolves the life of a cop there is only 1 hit (not even a fight) in the movie. SRK, Saif & Salman are like ants infront of this giant."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "budhrajavishal",
        "review_rating": "6",
        "review_title": "This time Mr. Perfectionist is not able to deliver what we expected",
        "review_detailed_main": "A Mystery which doesn't need much brain. This time Mr. Perfectionist is not able to deliver what we expected. Suspense flicks are meant to keep the viewers stick to their seats and make them to think about climax but unfortunately everything is predictable here. The biggest surprise revealed in the end also not make you jump as you easily grab it out few moments before. Story narration is very slow, specially in first half and even in the second half nothing is new. Its more of a drama then a Suspense-Thriller. However, it is a one time watch, as it has all the great actors in one screen. Direction is good, Detailing of scene is missing. Rest is OK. Aamir, as always dominate the film with a all-round performance. He is perfect in emotional scenes but we still expect more out of him. Rani & Kareena, both are superb in their roles, though we saw both of them in similar roles in past. Best performance of the film comes out from Nawazuddin Sidiqui. Last Words: In this era, its all about Marketing. This is not what we wanted to watch Aamir Khan...."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "akashimdb",
        "review_rating": "4",
        "review_title": "Till now many people called Aamir a perfectionist. The others didn't agree or disagree. But now the others will say what Aamir says in diplomacy-not a perfectionist.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Searching for Sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Littlesummer14",
        "review_rating": "6",
        "review_title": "It's not a 'thriller' but still enjoyable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vaibhav_bhandeo",
        "review_rating": "8",
        "review_title": "The Real Ghost Lies Inside -- Talaash",
        "review_detailed_main": "The real ghost lies inside, if I have to sum up the movie Talaash.\n\nIt's been long seeing an intense movie and though the ending and most of second half doesn't live up to the high expectations set by the fist half, this sure is a great watch for 2 and half hours.\n\nSometimes, \"what if\" is a question that fills so much guilt in heart that it leads to complete ouster from real world. The same is story of protagonist for this one. He is filled with guilt of his past and that drives him to tear apart his family life but this was until he gets involved in a high profile mysterious accident of a rising super star. The events following take many bizarre turns and with adding piece to piece protagonist not only solves the case but also gets solace in tranquility. Although being severely criticized for his abnormal behavior by his subordinates in the process of solving the case, he finally comes in terms with the real world. His \"Talaash\" for inner peace ends when the final scene ends.\n\nThe movies is amalgamation of three \"Talaash\" in together interweaved, first protagonist's troubled life, second being love and hate relationship of a pimp with a prostitute brilliantly played by Mr. Nawazuddin Siddiqui, he surely is a man to watch in future. I liked him a lot in Kahaani and he outplayed that in Talaash. Finally third story being quest of finding answers to questions which were buried deep inside and no one sadly had any clue of them being there.\n\nFrom the cast point of view Amir is at pinnacle of everything, I don't think he can make any wrong decision while picking any character. He played a troubled police inspector's character to the \"T\", Kareena's sultry performance definitely is oomph factor of the movie and she looks cheeky every time she appears in a scene. As a depressed and saddened housewife Rani essayed the role to the best, all three actors in the movie are so matured that it never occurred for a moment that there could have been any better choice for these three central characters. A big thumps up to the director Khatgi as she really dominated the feel of movie, she was able to maintained the tone of movie almost till the end which in a thriller genre a commendable achievement. Another person I would like to loud would be Ram Sampath, his haunting melodies really set the tune for the movie to the best, his approach to music is really different and refreshing to hear. It's so hard to compare a \"Bhag DK Bose\" to \"Jiya Lage Naa\" and he does it all! And finally few lines for the cynics who went berserk over the concept portrayed by the narrative and director. I find them truly fit for brainless no brainer trend of comedy era in which we are living in. Even if they are condemned by the same people, I can't think of any comparison between two separate genres. I can't find their hypocrite approach to condemn when an Indian director is trying to use an imagination against going gaga over series like Matrix, Lord of Rings and even Harry Potter. I think audience need to grow up a bit and encourage directors coming with a fresh breath of air, even if it means fantasies.\n\nWith flaws in most of second half, Talaash still qualify to a must watch for a gust of fresh air!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "subhor",
        "review_rating": "7",
        "review_title": "Talaash",
        "review_detailed_main": "Aamir Khan has to be lauded for he is a brave man, and a braver \"star\". He is someone who is willing to push the envelope, and get out of his comfort zone often a time to attempt something that pushes boundaries and paves way for other filmmakers. He did it with Taare Zameen Par and he does it now with Talaash. With Talaash, he bring film noir mainstream ... a form lost some time for Hindi cinema in the 60s with those suspense dramas and lately attempted by a wave of independent film makers (for example Manorama six feet under). It also assumes greater importance in the current context of the stars (except for perhaps Ranbir Kapoor), who are more than happy to have their image reinforced and push down our throat another one of those 100 crore ear-drum shattering and gravity-defying movies, sensibility be damned.\n\nTalaash is a story of Surjan Singh Shekhawat, a police officer, who is investigating a sudden and inexplicable accidental death of a movie actor. In the process of doing that he ends up seeking the help of a street walker (Kareena Kapoor), a search that has him exploring the underbelly of Mumbai... and all of this as he tries and deal with personal loss and a strained relationship with his wife (Rani Mukherjee). All of the three principal actors are in fine form displaying their craft well. Shekhawat is radically different from the policeman played by Aamir in Sarfarosh, this time much more brooding and you can sense the torment within. Rani as his wife is completely de-glam and displays maturity while Kareena displays equal amounts of seductiveness and vulnerability as the street walker. In a typical noir, the atmosphere and the mood is almost a principal character, and here in Mohanan displays his chops, for the cinematography is brilliant and creates a sense of doom and forebode right from the beginning as the story unfolds and there are enough little twists and turns to keep you engaged with little subplots involving other characters such as with Shernaz Patel as the neighbour and Nawazzudin Siddiqui, in a wonderful role, as the pimp's sidekick, even as you try and connect the dots.\n\nThere is just one problem.... the story. A good suspense film has to lead its viewers through a maze of clues and should engage the viewer in as much as trying to solve the mystery by way of clues placed upfront so that when the mystery unravels, the viewer should be kicking themselves for missing out on the obvious and marveling at how he was fooled into thinking otherwise (Khamosh by an uncorrupted Vidhu Vinod Chopra is for me one of the best examples of this). For me, in a meeting of as sharp a minds such as Reena Kagti, Zoya Akhtar, Farhan Akhtar, and of course Aamir Khan himself, one would have counted for a more cerebral conclusion than what is placed upfront. It might perhaps work with other filmmakers such as Mukesh Bhatt or Mohit Suri but with Aamir Khan, one holds him to higher standards, and therefore without revealing much of the plot, one certainly was looking for more.\n\n... and this singular thing perhaps might stop it from acquiring a classic tag when it comes to suspense genre.... but as I said, this movie more than anything is hope that all is not lost and its success might hopefully lead our other big stars to doing something worthwhile other than blowing up cars and punching people through brick walls and creating craters on perfectly good roads. Hell, that is a job for our municipality department. Why take that one thing away that do so well away from them!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shrenik2009",
        "review_rating": "8",
        "review_title": "Very Hollywood style suspense",
        "review_detailed_main": "From the start i would say that movie has story base suspense and its very hard to figure if you try not to(me and my wife knew it half way).\n\nBeautifully directed and acted, Aamir khan is THE MAN.\n\nBest thing about the movie is that nobody does any Bollywood style over acting. Amir khan is always normal like normal people(not like Salman or Akshay fighting 50 Gundas in every scene) My wife loves movies and we have wasted our money and time on...son of Sardar, Ek Tha tiger, jab tak hai jaan, cocktail, bodyguard, Dabangg, Tere Naal love ho Gaya, ladies vs Ricky Behl, Barfi(it was OK), Kahaani, joker.and last and most terrible STUDENT OF THE YEAR....and lot more this was the only movie we felt like money worth."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "anirban-ghatak-662-726696",
        "review_rating": "6",
        "review_title": "A good attempt",
        "review_detailed_main": "The sorting hat in Harry potter faced the same challenge as where to place Harry in the house is faced by me tonight as I write the review on request of my close college friends and old colleagues. Well, the central theme in the movie is premature death n accidents in life and leads us through a passage of occult, suspense, lust, crimes, policing and mumbai's night life as the story unfolds. The movie rests with 4 strong actors as pillars and all have played their parts well. Amir donot try to hog the limelight at all and the film has good exposure to display sheer acting brilliance from all four pillars, viz Amir, Rani, Kareena and Nawazuddin.\n\nNawazuddin has right arrived in 2012 rightly, with yet another brilliant support cast after \"Kahaani, this time as the sidekick lamed – \"Tehmur\". Tehmur's love story and an unworthy life among prostitutes and goons make an emotional drama to witness. I would not be surprised if he wins a filmfare nomination for his role in the movie. Although honestly I found his character have the same minor shades as \"Tungrus\" played by Naseerudin shah in \"Mandi\".\n\nRani shines brilliantly when her critics had written her off as a lonely housewife saddened by her past and loss. She reminds me of Madhuri dixit in \"Prahaar\" with almost zero screen makeup. She crafts a space for herself ably with her acting skills. Kareena is the life line of the story and she plays yet another role of a Mumbai call girl after \"Chamali\". Although, here she is urban and more beautiful this time. One easily feels for her character as she unfolds the mystery of the film. She looks amazingly preety which was needed for the role and I think you too would love her till the last shot.\n\nAmir, as an artist has tried yet another different angle and I salute him for it. This is his third repeat as a cop/IFS after \"Baazi\" and \"Sarforosh\" and he seems to portray as a policing leader very well . Amir, does brilliantly some under water scenes and is highly grey as a character. He is lonely and suffers from a false self conviction for his past. However, this role would not definitely go down as his best 5 characters just because of the high standards he sets for himself. But he does total justice to the lead role.\n\nThe background score and music is average but are pulled up two brilliant female leads – Sona Mohapatra (S' Jayate fame) and Suman Sridhar( \"Shaaitan\" fame). The story also lags connectivity in terms of suspense merit's. Some dots do not connect especially the lost one hour on the night of the car accident and why did \"Amaan Kapoor\" change his route that night? The USP of the film is the climax, so watch it early else the fun spoilers will tell it to you in a coffee meet next week. But keep the occult angle open as if you have faith in God, you must acknowledge the evil! Infinity has both + and -, right? Avoid the film, if premature death disturbs you and you dnt like occult topic."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ashfiji",
        "review_rating": "9",
        "review_title": ".......Expected More",
        "review_detailed_main": "I am agreeing with the user writer aashno1 (pardon me if i spelled wrong)that I expected more from Amir Khan's Thriller mystery . For being a perfectionist and one of the top Khan of B-Town I don't think the supernatural movies suits to Amir's personality as we all know him that he is more to reality in his movies and TV show. Well the film was one time watch only, Nawazzuddin was really good, Kareena was looking stunning in the movie, Rani was okay and definitely Amir's acting is perfect as usual and justified to his character. The beginning scene of accident excited and thrilled me a lot and was expecting the same in the rest of the movie where you can jump from your seat but i found this only twice in the whole movie when the suspense breaks in the end of the movie. I was expecting the same in the rest of the movie but disappointed. Well some people might find this movie good enough who believe in supernatural powers but i don't. I am giving 9 to this movie only because there is Amir Khan in it whom we watch hardly once in year."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jwraiyan",
        "review_rating": "7",
        "review_title": "Pretty cool actually",
        "review_detailed_main": "I'm not going to lie, i was pretty bored sometimes and the ending reveal wasn't that good to me aaand i was able to piece stuff together myself halfway ish through. A 9 out of 10 because of the GREAT side story of that worker boy thing, Nawazuddin sir just smashing another role, what a great actor, a delight to watch him every time. Aamir's acting was pretty wooden/ghajini-ish, pretty average-bad imo, disappointed. The ending was kind of reminiscent of kahaani. And like, that film kept me hooked from start till end, this didn't and as i said, kind of boring at some points. The mystery itself was pretty disappointing to me, not that exciting or cool, pretty average movie.\n\n7.5/10 from me."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "dineshprakash",
        "review_rating": "8",
        "review_title": "Beautiful message in climax with good presentation",
        "review_detailed_main": "Director Reema Kagti has done good work. You can feel the freshness in story, camera angle, lighting. The style of narration is good. Story and Screenplay by Director and Joya Akhter are good. Dialogues by Farhan Akhter are excellent. It sets and justifies very well the mood of film and need of character. There are lots of things which you would feel unnecessary but everything would be justified in climax. Movie slows down after interval for half an hour otherwise, it holds its grip very well. Performance wise Amir Khan is very convincing but he looks funny somehow when he try to be overemotional. It is very evident in climax. Rani Mukherjee is good. Kareena Kapoor is fine. Basically she has been cast to just balance the script. There is no any scene where she can show off her acting talent. Raj Kumar Yadav, as Devvrat Kulkarni is noticeable good. Rest are fine. The major drawback of this movie is it's bad lyrics. Which do not jell with the mood and story at all. There are some emotional scenes which should have been enhanced by good lyrics and music but it fail badly to support the film. Background is good. After all one time must watch."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "anbamer",
        "review_rating": "6",
        "review_title": "Great acting but...",
        "review_detailed_main": "Not the best Aamir khan movie but great acting as usual."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ankimagine",
        "review_rating": "4",
        "review_title": "Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "anjumskhanbpl",
        "review_rating": "7",
        "review_title": "Meaningful climax saves the movie",
        "review_detailed_main": "The main problem with suspense movies is they keep you engaged till the end but 90% of the movies fail in handling the climax well. This movie handles a difficult subject with extreme ease.\n\nThis movie has a paranormal background but no where it goes over-board and keeps the suspense extremely well. Audience didn't even realize that what they are seeing is actually something else. Aamir khan decided to do this movie, so there was lot of expectations from this movie. This movie delivered it.\n\nActing is real. Rani Mukherjee was Aamir's wife is excellent. Nawazuddin Siddiqui is sheer class. He is next in sequence of Naseeruddin Shah, Om Puri, Girish Karnad, Sanjeev Kumar.\n\nPlot has enough twists to keep audience thinking in different variations.\n\nI can't think of any more justified ending than this one's."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "welcumdadarkside",
        "review_rating": "10",
        "review_title": "Murder on the Orient Express",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Swapnilagarwal",
        "review_rating": "7",
        "review_title": "Search ended, Talaash didn't..",
        "review_detailed_main": "Search ended, Talaash didn't.. Yes, with the same feeling, one exits theater after watching Reema Kagti's 'Talaash'. I purposefully didn't call it Aamir Khan's Talaash as it somehow lacks the finesse and sharpness of a typical Mr Perfectionist movie we have been witnessing for the last 7-8 years. This one disappoints a bit not by its performances; not even is the music a let down like in the case of JTHJ; rather the culprit is the meandering, direction-seeking but lost storyline and finally the weird climax. I will not delve much into the story as already a lot has been said about it by many critics. Rather, I will like to compare this 'supposed to be' best thriller of the year with 'the actual' thriller of the year KAHAANI.\n\n\n\n\n\n\n\nRegarding performances, Aamir is as usual perfect in his role. Kareena kinda steals the show with her G-quotient and charm. However, she appears to be a little chubbier in some scenes. Rani underplays her character as required and almost lives the soul of a neglected, bewildered wife. Full marks to her for this! Rest support cast is fine in their respective roles.\n\nIn all, this is perhaps not the Taalash we were seeking..waiting for a proper Aamiristic work next time!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "santoshkaman",
        "review_rating": "10",
        "review_title": "Ahead of it times thriller!!",
        "review_detailed_main": "In the recent times of bollywood big budget craps, Reema Kagti and Aamir Khan delivers one of the most gripping and exciting movie of the year.\n\nRight from the start showcasing mumbai at night time(with Muskaanein Jhooti Hai playing at background), movie has been shot superbly with continuously solid background music.It takes us to the side of the city we know exist but do not discuss in society.\n\nFilm has some outstanding dialogue writing,with the other big budget India in recent time making fool of audience.Talaash engage its viewer with the flow.\n\nCharacters are well written and executed flawlessly by the actors. Its the movie lead Aamir Khan delivers the years most best performance.He lives character once again,making the audience feel the depth and volume of Shekawat\n\nRani Mukherjee and Kareena Kapoor shines in their respective role. But its Nawazuddin Siddiqui of the supporting cast who leaves the mark with an excellent performance.\n\nTalaash is not a masterpiece or a grounbreaking cinema, however its BRAVE film which Bollywood are so afraid to experiment. Highly recommended , MUST WATCH!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "singhlall",
        "review_rating": "7",
        "review_title": "Stylish slow burn crime mystery",
        "review_detailed_main": "Amir Khan tries to solve the apparent suicide of a high profile bollywood star which is linked to the indian underworld. Karishma kapoor sparkles as the tart with a heart. Amir's acting is spot on as always."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kamalaksha-das",
        "review_rating": "10",
        "review_title": "Messages we got...",
        "review_detailed_main": "Let's keep this short and sweet.\n\nI just watched and I liked the movie because of a new experiment by Amir Khan and Co.\n\nAt the same time I got the below messages from this thriller movie...\n\n1. Value of life - We should value lives of ALL. Why should we discount the life of a pros?\n\n2. Soul - People who believe, it's nothing new for them. People who doesn't believe, need to think twice.\n\nthere could be other messages too but the overall presentation, climax and thrill was awesome.\n\nA must watch!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "agmoldham",
        "review_rating": "6",
        "review_title": "Best Bollywood Movie I've ever seen",
        "review_detailed_main": "OK this was only my second Bollywood movie, but it was certainly a step up on the first. Not knowing the language and having no subtitles was a bit more of a hindrance with Talaash. Fortunately we did have someone who spoke Hindi, so we could get an insight into what was going on.\n\nThe film follows the investigation of a murder of a film star. It is a dark film with the detective coming to terms with the loss of a child. It is entertaining throughout with none of the traditional dance routines that I imagined were in every Bollywood movie. There is a twist at the end which I certainly didn't see coming. Never know whether it would have been more obvious with subtitles."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "alimurtaza780",
        "review_rating": "8",
        "review_title": "Best Indian suspense movie ever but they took it a little far from suspense End will leave you with an exclamation",
        "review_detailed_main": "I advise people that who have seen the movie please don't tell the ending.Now as you see Talaash is a very nice film and the end will leave you with an exclamation in the ending. But there are rules to that. 1.Focus in the Entire movie for e.g coke and popcorn will help you a lot 2.Have patience while seeing the film 3. Don't wait for the ending. It is a slow movie but very interesting. When I was watching the film I did get board in several parts but after that it did get interesting. I would say that it is better than son of sardar and a little better than Jab Tak Hai Jaan . Giving it above 8 would be a bit unfair but it does deserve 7.6 as a rating. People who are giving a bad rating such as 2 haven't watched the whole movie or haven't understood the movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ayonbhunia",
        "review_rating": "6",
        "review_title": "Taalash",
        "review_detailed_main": "Old movie were more ahead of time then we think today ! The story was good and the way they depicted it,it was unique ! Saw similar stories like this before too and also i am watching it on 2021 so the movie is 8 years old and everything changes ! This kind of suspense movie is still done or going on with the generation ! Good one Tho a one time watched movie !"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "intecons",
        "review_rating": "4",
        "review_title": "Most ordinary suspense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "auhconnect",
        "review_rating": "7",
        "review_title": "Good atmospherics add to rewatch value",
        "review_detailed_main": "It has been almost 9 years since the movie came out and in spite of being a 'whodunit' can be re-watched on many a TV reruns. Acting is understated for most part except for Rani Mukherji's character and noise decibels are appreciatively low for a Hindi movie. The story, which is a careful rework of 'The Detective' (2007) by Thai/Hongkong filmmaker Oxide Pang, is engaging enough to keep one watching but looses steam in between and ends up seeming more complex than it really is. On the whole, a satisfying but conventional film for a star studded Bollywood product."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "nitu-nitish",
        "review_rating": "10",
        "review_title": "Courageous Film...",
        "review_detailed_main": "It takes courage to stand out with such film in Bollywood.TALAASH is and will be an outstanding movies in Bollywood.Thanks to Reema and Zoya.\n\nSet in dark nights of Bombay..that too with tour of late night Red Light area , TALAASH is best suspense thriller film that shocks you in the end and focuses an important issue (if you get that you would love the film more).It is tale of emotional ...,betrayal yet the thrilling confusion that makes you watch it again.\n\nPerformances by Aamir,Rani ,Kareena and Nawazuddin Siddiqui are best.Background Score is tale gripping and songs are fabulous too.The whole movie atmosphere the night,the music,the confusion and the last shock makes it worth to watch it.10 out of 10 from me for making such a Courageous Film in Bollywood....!!!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "popsensation-39006",
        "review_rating": "7",
        "review_title": "Well executed!",
        "review_detailed_main": "Talaash was released after Kahaani, which was a brilliant movie. Considering the fact that Talaash was released after it, it makes people expect more from this movie. I'm not saying that the movie was bad or anything, but it missed out on something that you realize after the movie is over. Nawazuddin Siddiqui was, asusual, mind- blowing. His acting skills make him stand apart and he creates a place for himself in the movie. A different place. You know how the lead actor gets all the obvious credits he's entitled to just because he's the lead actor and the character artists have to claw their way to the top? That's what Nawazuddin Siddiqui does. Although, I feel that he overshadowed Aamir Khan, I also feel that Aamir Khan did a decent job in portraying himself as a policeman. He couldn't pull Marathi though. 😅 But it's understandable, it's not his first language hence, we can't expect much, can we? Rani Mukherjee plays Aamir Khan's wife, who's traumatized by her son's death, for which Aamir Khan blames himself. Kareena Kapoor escorts Aamir Khan throughout his case investigation and the movie ends with an unexpected supernatural climax. Pretty unexpected! In conclusion, since it's a suspense movie, you can't watch it again and again. But the entire team and crew members have done a commendable job by not making another pseudo intelligent movie just for the sake of doing something out of box. Thank you very much, for that!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "krissh003",
        "review_rating": "9",
        "review_title": "Always Amazing.. Beautiful movie",
        "review_detailed_main": "The movie was beautiful and engrossing right from the word go and the first frame.........Aaamir is mind blowing in his performance as the tormented father and equally beautiful was kareena in the portrayal of her role. Rani was amazing as well though her role was short. Farhan and riteshs productions are always slick and classy with amazing cinematography and screenplay and this movie displayed just that.Take a bow guys this movie is a one of the best to come out this year and only adds to aamir's already amazing repertoire. the only scene in the movie which was a giveaway was the death of Temur where he sees kareena's apparition could have been totally avoided. There will always be critics please take it in your stride and please continue to give us Amazing cinema like this."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "advaitkamat",
        "review_rating": "6",
        "review_title": "The gamble that half pays off.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "amcclend12",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "I thought this movie was Brilliant in its direction and definitely in its acting. Aamir Khan as usual is superb. I have to give loads of credit to Kareena for her brilliant performance! The girl can do any acting and I mean ANY and do it perfectly! Rani needs to do more roles like this, back to her strong, original not flashy and fake ones. Rani is an excellent actress and in this movie she brought that back.\n\nYes like most people I was trying to think which American movie have they copied this on, but you know what, the movie was so well done, what does it matter, the story was well written, and executed superbly on the actors that made the movie what it was - FLAWLESS!!\n\nGreat job, to everyone from the Writers, to the producers and Directors. This was good cinema. I enjoyed it with 100's of people today at the movie theater, No one walked away disappointed, everyone thought the movie was awesome!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "roy-puja03",
        "review_rating": "8",
        "review_title": "Talaash is the search of a man coming in terms with the inexplicable",
        "review_detailed_main": "In the midst of a particular sequence, Aamir khan asks Kareena, \" kya tum khush ho ( are you happy?), kareena replies, \"kuch pal hai\" (there are moments).\n\nTalaash is an amalgamation of various such moments. The movie beautifully depicts several layers of emotions, takes care of deep characterizations and their human fallacies.\n\nSomething as tenuous as the loss of a child and the deep borne anguish as its consequence is dealt with equal sensitivity and pathos, accompanied by remarkable performances by both Rani and Aamir.\n\nThe director takes us (with mesmerizing camera shots) through various locales, diversified views of the city's underbelly and the dark and yet vivid human erroneous beliefs.\n\nDirector Reema Kagti tells her story pretty well and leaves it to the audience to decipher the inexplicable. There are subplots that churn out emotions equally. Nawazuddin as the guy in the brothel plays his part brilliantly. His undying love for a prostitute almost double his age is chaste and watching him subsequently rescuing her at the cost of his own life is an elevating experience. How often does one get to see such love relationships?\n\nThere are strong performances by each and every character and the plot too keeps the audience gaping for more till the end. However, the movie dramatically ends in an anti climax and leaves the audience blank with more questions than answers.\n\nHow can a girl come over the pain of not being loved? How can a couple forget the hurt of losing their child? Talaash is the search of a man coming in terms with the incomprehensible and consequently getting over the demons (living, non-living, undecipherable, etc.,) that rule our lives.\n\nTalaash speaks through its characters more than its plot. The lady who practices planchet, Kareena who is supposed to be dead yet appears intermittently and gives Aamir one hint after the other and Rani, who is away from all of this, trying to find solace in communicating with her dead son- the movie speaks through them and weaves several moments of love, hate, intrigue, ache, pain and outrage.\n\nBeautiful collage of emotions and images, Talaash will be remembered for impeccable performances by all its characters. Kareena Kapoor as the prostitute is outstanding. She is a real mystery in the film both literally and figuratively. Rani Mukerji looks very real and plays her part as the grieving mother with utmost perfection. Aamir Khan's performance is neat and doesn't go over the top anywhere. Except for the over usage of the word \"talaash\" in some dialogues, the movie is completely bereft of clichés. To make the picture perfect, there are also some soul stirring numbers.\n\nFor all those who have still not watched the movie, go for it, it definitely deserves a watch.\n\nP.S- I have watched it twice :-)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ssodivad-1",
        "review_rating": "5",
        "review_title": "Warning Spoiler Alert",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "srk-shresth",
        "review_rating": "8",
        "review_title": "was A GooD Movie, would have been awesome if climax would have been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shivam-ganesan",
        "review_rating": "8",
        "review_title": "This is the kind of story never told before in Bollywood",
        "review_detailed_main": "I just watched this movie at Rave Cinema.I enjoyed every second of the film.I was impressed by the screenplay of Zoya Akthar and Reema Kagti. This is one of the rare serious narrated film in Bollywood. Aamir Khan, Rani and Kareera are also well done in performance. All the character are created well. But Ending is I never expected. This is the Thriller which will leave you different taste. But depends on people's personality whether you like it or not.For Me, It was good and convinced me because the whole movie was shot, acted, narrated and directed pretty well that it isn't matter it is realistic or not.But Message is very good.But I still think that they should have put more effort on the climax which can be masterpiece rather than Best Suspense Thriller of the year.I still recommend this is the movie you won't miss it.It's worthwhile!!!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "arvindmohindra-517-899062",
        "review_rating": "10",
        "review_title": "One of the best of 2012!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "pranay_misra",
        "review_rating": "8",
        "review_title": "Way ahead of its time",
        "review_detailed_main": "Talaash when released didnt get the response expected from a amir khan kareena,rani starrer film. Indians didnt like the muvi much but same audience made dhoom 3 a 500 carore film an year later. This just tells the standard of the audience which is still naive to such a masterpiece.\n\nMovie is a suspense thriller but let me tell you, more than the suspense, the movie is about grief and about the process of overcoming it.\n\nA big muvi star drowns in a car accident and amir khan who plays the cop gets to investigate on the case. Now here he tries to solve the case which looks like simple accident and comes to know alot more than he thought, in the process. Here his personal life which is not going good is also shown and how he gets lost in the world of brothels where he meet kareena kapoor. Letme tell you, this is the best performance of kareen, scenes in which amir and kareena are together, are pitch perfect. Dialogues are too good.(anurag kashyap is a additional dialogue writer here).\n\nClimax is bit tricky, but for me, the journey in the movie was itself rewarding(and the climax was also superb for me).\n\nI will say, watch this movie for amir rani and kareena alone, if not for a suspense thriller, because they have done an ace job here.\n\nHats off to Reema kagti for making this masterpiece."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "meet-vinod2008",
        "review_rating": "1",
        "review_title": "Over-hyped, senseless , idiotic ,logicless , time wasting and irritating Movie",
        "review_detailed_main": "-> The summary of the review is just what the movie is all about\n\n-> I hate to say that Bellwood is going down to new lows , its failing to give a single good movie in a month\n\n-> people are biased or not have seen good quality fails that are giving positive reviews for this rubbish called talash\n\n-> here is the story in my point of view ... a car flies to the sea suddenly ( u get doubts that is it a horror movie when a dog screams minutes b4 the car goes for a swim ).\n\n-> Amir talent is wasted and zoya and remma knows if amir is in the movie u get the money no need of a story\n\n-> Kareena waits for three years to kill the actor wow what a planning seems ghosts also plan , but wearing micro minis and being so hot\n\n-> Even a 10 year old school guy can write better duologue's than Zoya\n\n-> it so slow at one point of time you feel that actors have forgot their lines\n\n-> Worse ending that i could ever imagine ... thy could have used something like hallucination or something than the ghost story\n\n-> I was thinking about the movie to write the review and I really got nothing because there is load of c*&p in it .... Die hard amir fans go watch it Bellwood movie lovers go watch it , others can give it a skip"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "prateeksolanki-52228",
        "review_rating": "9",
        "review_title": "IT'S LIKE A FINE WINE🖤 ,YOU NEED A GOOD SENSE TO APPRECIATE IT",
        "review_detailed_main": "Really fine direction and acting skills are just perfect. Movie's background music is too amazing which makes it more intense, really loved it. AAMIR KHAN , RANI MUKHERJEE AND KAREENA KAPOOR WERE JUST OUTSTANDING. I HAVE WATCHED IT OVER 4-5 TIMES ,STILL ALWAYS EXCITED TO WATCH IT."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "GirishGowda",
        "review_rating": "8",
        "review_title": "Solid psychological, suspense drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "christinchris",
        "review_rating": "10",
        "review_title": "Outstanding....Edge of seat",
        "review_detailed_main": "Outstanding movie..well crafted briliant film...great work... evrything is good... acting direction...cinematography...music..plot everything... one of the best psychological crime mystery thriller film... its keep u hooked"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "hafiz-ramadhan90",
        "review_rating": "9",
        "review_title": "really love it",
        "review_detailed_main": "I don''t get it, why it has so many bad review?? the acting was good, kareena aamir and rani was great as usuall. the story and the twist was unpredictable, espesially for indian movies. i really enjoy it even watch it for the second time."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "nandinigoyal349",
        "review_rating": "3",
        "review_title": "Should watch it once, serious movie and a bit slow !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "wwwaviavinash",
        "review_rating": "8",
        "review_title": "Very good supernatural suspense drama",
        "review_detailed_main": "I love this movie is a really good thrriler drama . Total movie starcast, direction & music is plus points this movie .this movie is engaged beginning to ending .I watch this film 3 to 4 time but Everytime i enjoy this movie me really very good enjoyble twisting movie.."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shashisowmya",
        "review_rating": "8",
        "review_title": "Worth a watch!!!",
        "review_detailed_main": "As an Aamir Khan fan, I had to watch this movie!! And he did not disappoint as always.\n\nStory is good and believable, yes of course, the ending may not be acceptable, but you know, nothing is impossible!!!\n\nThe characters, all of them have a role and that's a commendable part of the story!!!\n\nAnd yes, Kareena, she is the Queen of the movie...there could not be a Talaash without her!!!\n\nShe is absolutely amazing in the movie, loved her totally, her style, her dialogue delivery, absolutely everything...\n\nMusic is also very good, it stays with you for a long time after having watched the movie.\n\nOverall, a great watch!!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: A Search Worth Finding!!",
        "review_detailed_main": "I knew the suspense already but it did not spoil the fun for me. It is perfect execution with no non-sense and no unwanted scenes. All three leads Aamir Khan as sincere cop, Kareena Kapoor as call girl and Rani Mukerjee as hurt wife give their hundred percent and amaze you with their charisma and talent. Special mention for Nawazuddin Siddiqui who plays a key role and tops all performances. He is the one actor in the range of Om Puri and Nseeruddin Shah. Great music and back-ground score. It's Reema Kagti's second movie but she executes the subject with utmost sincerity, utter conviction and full control. Yes, I also did not buy the surprise like many others but apart from the climax everything seems so just perfect."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "MuviFan73",
        "review_rating": "8",
        "review_title": "4 epic exp. avoid spoilers b4 viewing this suspense drama.",
        "review_detailed_main": "To begin with, you would probably watch the movie and enjoy it the most when you watch it for the first time. It is because of the suspense exposed in final moments. For me this was not the case, as one of my friends disclosed the suspense and ruined what could have been an epic journey. Despite that the elements in the movie added to the entertainment factor. To add further I would say the supernatural touch in the movie, moves up the movie experience.\n\nTone, Script & Story: Some people get killed; the movie in its run discloses the criminals and victims. Direction, Screenplay, Cinematography: Justified. Music: Music is good. Acting: Justified. Nawaaz is worth mentioning.\n\nFinal Verdict: Watch it without reading spoiler reviews. For me it is worth adding to my collection."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "zaheer-543-479779",
        "review_rating": "1",
        "review_title": "Talaash just 5 out 10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "bharattradingcompany",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "santhosh-10290",
        "review_rating": "8",
        "review_title": "Talaash",
        "review_detailed_main": "Excellent Movie. Everybody acted very well in the movie. The movie was so interesting and thrilling. The movie had no unwanted scenes. The movie was so interesting but the movie somewhat lagged. This movie is one of the best movie of Aamir Khan. The movie was not at all boring. Songs in the movie were not needed in the movie but the BGM in the movie were good in the movie. Excellent Movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "alo_pilot",
        "review_rating": "8",
        "review_title": "Aamir Khan",
        "review_detailed_main": "This movie was amazing. Aamir Khan is a terrific actor and perfectionist. I hope Bollywood movies will be more successful. Because they make very sincere and heartfelt films."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Dushan_Anuradha",
        "review_rating": "10",
        "review_title": "Prepare for an unforgettable suspension like no other.",
        "review_detailed_main": "\"Talaash\" weaves a narrative that intricately connects two distinct scenarios, shrouding them in mystery. As you dive into this cinematic masterpiece, be prepared to witness a brilliant tapestry of interdependence, skillfully crafted by the film's creator. The individual who named this movie \"Talaash\" truly deserves applause for its genius.\n\nImagine being ensnared in a seemingly unsolvable dilemma, where every piece of evidence you unearth only serves to deepen the enigma. And you alone hold the key to unraveling the truth, yet even you cannot prove it. What if such an experience could resolve a deeply personal, long-standing torment? These are the captivating layers of interdependence referred to earlier, and I assure you, the thrills, astonishment, and heart-pounding suspense I felt are yours to discover.\n\nIn my cinematic journey, \"Talaash\" stands tall as the finest Hindi movie I've ever encountered. I first ventured into its world in 2013, and to this day, it continues to envelop me in its unique spell of suspense. I wholeheartedly recommend this film, even to those who are not die-hard fans of Hindi cinema.\n\nThe main characters, Inspector Shekawath (Aamir Khan), Simran (Kareena Kapoor), Roshni, the inspector's wife (Rani Mukerji), and Temur (Nawazuddin Siddiqui), deliver performances that touch your heart in unimaginable ways. \"Talaash\" transcends the boundaries of a typical thriller, leaving an indelible mark on your soul."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "yessar-abhi",
        "review_rating": "5",
        "review_title": "Really disappointing ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "physicsgulati",
        "review_rating": "9",
        "review_title": "Treat for THRILLER MOVIE LOVERS.",
        "review_detailed_main": "After watching this movie everyone will believe why Aamir Khan is known as Mr. Perfectionist. The story has good thrilling elements. Rani mukherjee plays her role brilliantly. The climax will blow away your mind. Such movie only came once in a decade. Must watch for everyone."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "exofanforever101",
        "review_rating": "8",
        "review_title": "Great movie, suffers from typical, weak Bollywood Resolution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "syedsrg8",
        "review_rating": "9",
        "review_title": "Best of the year",
        "review_detailed_main": "I don't know how some people say that its slow paced... The first half goes exactly as it should and the second half is just mind blowing. This is what u expect from an Aamir khan flick.\n\nSuperb acting,fabulous direction and the choreography is excellent too...\n\nThe music compliments the movie really well... All in all.. without giving out any spoilers, I'd say this is a must watch... Kareena's acting has improved manifolds in this.. All the leading Bollywood heroes have portrayed the role of a cop but none of them did it as convincingly as Aamir khan... The kind of depth he dwells in for the character is just amazing..\n\nMy rating 10/10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ksreekar",
        "review_rating": "8",
        "review_title": "Adventurous, exciting, but leaves you with a sense of emptiness.",
        "review_detailed_main": "There is no doubt that it is people like Reema Kagti, Aamir Khan, Nawazuddin Siddiqui, Anurag Kashyap and company that will be taking bollywood to the next level. Talaash is also.. that kind of a film that takes you to a place where Indian Cinema is not expected to venture. This is my first review, The first film that has forced me to do it.\n\nThere is nothing in the plot that I can actually reveal rather than the same old Accident and Investigation stuff. It is actually a movie which relies on its suspense and surprise element for best viewing experience. If you are looking for something like Kahaani, Sarfarosh (or even CID for that matter), I am sorry that I have to disappoint you. The story is far from it. If you like it, you will love it to the core. If you don't like it, It may turn out to be a disaster of a film for you.\n\nAamir, Rani, Kareena, Nawazuddin, everyone were at their lethal best. Special mention for Nawazuddin Siddiqui for his brilliance on screen. He portrayed his role as a prostitute manager in a unique but marvelous way.\n\nScreenplay was at a different level altogether. You may feel the story was dragging itself during the first half, but still the story and screenplay keep the movie alive and intriguing. There are some neat twists and perfectly situated songs to go with. The dialogues were brilliant (they were Anurag Kashyap's). Absolutely on the mark from minute one.\n\nBut the story (particularly the ending), leaves you with a sense of emptiness and heartbreaking feeling that all that has boiled down to just this. This may come as a shock to many and some might say it was predictable. The good thing is that this story does not come out with loopholes. Every question is answered and every detail taken care of. Normally these kind of movies leave loopholes, this is a place where the movie excels.\n\nOn the whole, it was a different experience altogether. Something out of the ordinary or something unexpected. certainly worth a watch at least once for its extraordinary freshness and for the performances of the lead roles."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sashank_kini-1",
        "review_rating": "3",
        "review_title": "Reema Kagti carelessly places her directorial hands over Talaash's genre-confused body, resulting in an impotent snooze-fest instead of a sensational cinematic orgasm",
        "review_detailed_main": "Plot: Surjit Singh is a cop who investigates the death of Armaan Kapoor, a popular actor. The investigation leads Surjit not just into the underbelly of Bombay – the brothel life, the pimps and the prostitutes but also into his own past, involving the death of his child in a similar manner. Thus, by solving the case with the help of a mysterious prostitute named Rosy, he not only shall gain credit at work but also gain a resolution to his sterile marriage life with Shreya as the couple bear the weight of the guilt of losing their child.\n\nTalaash should not have begun the way it did. The opening sequence of a car unexpectedly losing control and crashing into the sea gives us a wrong impression of what we as audience members should place focus on. The next shot of Aamir Khan dressed up as a policeman, putting on a thickset mustache and visible frown, approaching the crime scene in his police jeep puts us under the impression that we are about to see a pure fast-paced crime thriller with little focus on the protagonist's own personal problems; generally, most crime thrillers add some depth to the protagonist by adding a minor side plot which involves the character getting some form of personal resolution by the end of the story, but this would not take up much of the screen time.\n\nWe also learn that a pimp has some pecuniary involvement with the dead celebrity who was alone in the car that crashed into the sea, and that the case shall involve the brothel home. In a well shot sequence, we see alternating shots of Surjeet Singh (the character played by Aamir Khan) testing how the incident must've taken place, by driving the car in a similar manner (except he does apply the brakes at the right time) and a repeated shot of the car crash. We witness many interrogations taken by him with the family members, prostitutes, dealers and well\u0085 two guys but I've completely forgotten what those interrogations were for. There are many CID like establishment shots of buildings which gradually begin to annoy (why always show a tilting shot of the building where the action is to take place, just cut to the chase). All this puts us on one track, and we expect the side plot involving Surjeet Singh, his wife Shreya (played by Rani Mukherjee) and their late son to settle comfortably at the back, only to appear at certain moments adding a balanced parallelism between the present case and the past incident.\n\nNow the film does an egregious error of switching tracks without a warning: the focus is shifted to the couple's loveless marriage life after the boating incident involving their son. The main issue here is that we are actually supposed to take the ludicrous scenes between Shreya and the medium Frenny played by Shernaz Patel as scenes of crucial importance. Shernaz does an impression of Frenny which reminded me a bit of that villain from Troll 2, in fact she too bakes a pie for Shreya just like that character baked one in Troll 2. And with the kind of dialogs that she was given (hackneyed), the character of Frenny did not seem like one to pay much attention to; I thought at first she might've been some reporter trying to extract information about the case or (a little far-fetched) that Surjit's son was actually alive and with Frenny. The marriage issue takes up much of the time till the interval, inter-cut with some dull conversations of Surjit with a mysterious prostitute Rosy played blandly by Kareena Kapoor. By then, the audience is not sure what it's supposed to concentrate on – what is the talaash for?\n\nPost-intermission, you watch some chase sequences, very less suspense and unnecessary subplots. The twist that the whole world's talking about (not really) made me think like this 'Oh\u0085 does it really matter when the case itself is given such a poor treatment and the plot discontinuity is so awkward? Couldn't this movie have the same twist but with much more focus on the case, and a case worth giving much focus to? Really\u0085 I see a bit of Sixth Sense, Japanese movie Odishon, flop film Madhoshi and maybe some others but I don't remember them now. Hell, this was not worth the hype at all – this is definitely a 'first' for an Indian psychological neo-noir crime drama, but nothing groundbreaking for the genres that it falls under. Even with the plot, script etc remaining the same, this could have been more tolerable with a different cast.'\n\nI read Shubhra Gupta's review in Indian Express and she has precisely said the same thing that came to my mind watching Aamir Khan's performance: 'His frown could have relaxed a bit'. You get 'forehead Surjit Singh' all the time as you eyes wander again and again to the frown that never lightens up, staying tight as if it's been plastered unmovable. Kareena's dialogs and inane and she makes Rosy sound dry and boring – an 'I'm bored so I'm saying these lines' kind of prostitute. However, her dry delivery works in one scene, probably the only seen where my attention was drawn to the subjects than the popcorn I was munching – it happens when she mirthlessly talks about the invisible lives of prostitutes. Rani isn't totally invested in her character, and we feel absolutely nothing for her when she berates Surjit out of frustration. Because the case of Armaan's death itself has less importance, I felt unable to get all the drama that was happening in the brothel and it's sad because Nawazzudin's efforts fail as his character doesn't matter to me (this isn't his fault).\n\nTalaash fails in concocting the different genres – it add too much of one and too little of the other.\n\nRating: 3.5/10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "mathewp2002",
        "review_rating": "10",
        "review_title": "Movie with a difference!!",
        "review_detailed_main": "This was an excellent film to start with in all departments, be it on a Acting, script level, screenplay level, background score, action (accidents shown), lighting, editing, pacing of the film and the suspense (which has raised a lot of mixed reviews). Now the film has controlled pace thats because thats what the script has demanded. Only thing is the director has tried to give hints little bit too early and also in the end has tried to spoon feed the audience by over explaining. That may be was not required. But a class movie coming from class producers and very well acted by everyone in the movie, be it the main leads or the supporting cast. But will only cater to niche audience and not for the masses. Different kind of movie in all sense to come from Bollywood in this modern age."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vickydarapstar",
        "review_rating": "9",
        "review_title": "talaash is awesome..jab tak hae jan is flop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "anandeep777",
        "review_rating": "8",
        "review_title": "Amazing Story, Satisfying acting but missing some elements",
        "review_detailed_main": "Year's most anticipated movie didn't let me down but I felt something missing in the story. Pace, I guess!\n\nExpressions and dialogues were superb with mild touch of genuine comedy.\n\nI was not expecting a supernatural plot, honestly.\n\nStorytelling was good, keeping you puzzled till the end of the story. Acting was natural and intense. Aamir and Rani did a clean job just like senior actors. Kareena was outstanding with clean finish of her character.\n\nBut in the end I just felt like \"I was waiting for a fabulous dessert after a great meal, but I just got a bowl of ice cream!\".\n\nBut still, I loved it. :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "eh5963-297-967354",
        "review_rating": "8",
        "review_title": "A pleasant suspense drama",
        "review_detailed_main": "Talaash is special, the reason being obvious that it's a full fledge Aamir Khan starer after 3 Idiots. So of course it's evident that expectations are humongous and higher than any previous Aamir Khan film. So is the hype worth it? Does Aamir once again strike? For the most part, yes! A mysterious Mumbai night where an accident of a movie star occurs in an even more mysterious manner. This accident may be even deeper than expected when more clues reveal shocking details. Investigating the case is Surjan Shekawat who has more issues to be resolved than just this case. During his investigation he encounters various suspects such as a pimp named Shahsi and a prostitute who calls herself Rosy. How Surjan copes with his personal issues and the case is what Talaash is about.\n\nA fascinating thing about Talaash is that it is still gripping despite not being a solid thriller. The film is more of a drama than a thriller. Also the screenplay runs in an engaging manner and written very smartly. In a way that every scene has you glued to the screen. The emotions are just right.\n\nFlaws? The pacing is slow and very slow at certain places. Also, this type of film did not need that many songs. The film could have been trimmed about 10-15 minutes.\n\nAlso to those rumors that Talaash and Kahaani are similar - not even close.\n\nNow to what everybody has been discussing regarding the movie: The climax. I was surprised to be honest. More so because of the element of the ending. It's just something I didn't expect an Aamir Khan film to have. However, just because I don't feel that it shouldn't happen that way or I didn't expect such an ending does not mean it was bad. It was a proper ending but one did want something a bit more rational.\n\nThe writing is crisp and nearly flawless. Some lines are brilliant. Screenplay is engaging. The film is technically superior.\n\nMusic is soothing to the ears. Even though I did not feel that some songs were needed but I'm glad they go with the flow of the story and do not come as speed bumps.\n\nReema Kagti's direction is brilliant. Miles ahead when compared to her first movie. A director to look forward to.\n\nRani Mukherjee is in form and gives a great act as the depressed wife. Good to see her back on the screen. Kareena gives a charismatic act and is first rate. Nawazudhin Siddaqui is another actor to look out for.\n\nAll said and done, Talaash is a full on Aamir Khan starer. From start to finish, Aamir gives a remarkable performance. Further proving he's the most versatile and best actor in his current generation.\n\nOverall, Talaash is gripping film with a debatable ending. It's great tale full of suspense and emotions."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "aashno1",
        "review_rating": "5",
        "review_title": "Expected more",
        "review_detailed_main": "The movie coming from Aamir Khan productions(joint venture) had carried lot of expectations.In terms of script,there are lot of loopholes.The movie keeps you engrossed and kind of intriguing.However what unfolds in the end is anybody s guess.I thought it would be something logical and surprising.Having seen so many thrillers from Hollywood and the Hindi ones like Kahaani,I expected much more from the \"Ace\" Khan.The performances from the lead actors are good and Nawazuddin was excellent.The screenplay was good and so was the music.I personally did not like the story which leads us to believe the supernatural.again its debatable.But for me,it doesn't work.\n\nUtterly disappointed!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "cpkaranjkar-631-494516",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "This is one of those movies where if you don't know anything about it and go to see it, you will be pleasantly surprised. I won't go into the story at all. The story held together well throughout. Aamir Khan did a great job as did Rani mukherjee. Kareena did a surprisingly good job as well. All supporting actors were phenomenal. There were minor plot holes but nothing too major where it will hurt the movie or change your opinion about it. It is not a family friendly movie, it is advised too keep kids at home. This is an overall a serious movie with few comedic moments. I definitely recommend seeing it in the theaters, well worth it in my opinion."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "bollywoodplusplus",
        "review_rating": "9",
        "review_title": "As far as Khans of Bollywood concerned, other two can only dream!",
        "review_detailed_main": "What a movie Aamir Khan! Amazing. So much for the Khans of Bollywood, SRK and Salman can only dream of being compared with Aamir. Aamir the immaculate actor, Aamir the director, and Aamir the producer, and even Aamir the social reformer (Satyamev Jayate). Coming to the movie, I loved Aamir's acting, every minute of it. The intensity, the look. The entire starcast is so well cast, Kareena Kapoor is beyond brilliance in her role. Rani Mukerji, well. She does the role well. But the movie belongs to Ms Kapoor and Mr Khan.\n\nMusic by Ram Sampath is fantastic. Jee Le Zaraa sung by Vishal Dadlani is going to be a rock ballad favorite for coming years. Sona Mohapatra's Jiya jaaye na is an awesome mix of hindustani and electronic trance. Ram Sampath has been a hidden talent all these years. It takes a real artist to recognize a real artist. Aamir Khan has brought him on Delhi Belly, Satyamev Jayate and this is the third serving. Brilliant music, every time. That even includes the background score. The background score in a suspense thriller is almost like another central character. Its hugely challenging. Ram does such an incredible work there!\n\nThis is a must watch for any film-lover (not sure about the people who are fans of Salman Khan). As an Indian, I am so proud that my country is producing such quality movie which I can bring my American friends to show with pride.\n\nGo watch it, if you haven't."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "pcsarkar",
        "review_rating": "8",
        "review_title": "A supernatural whodunit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "GaneshCR",
        "review_rating": "10",
        "review_title": "A great suspense movie, worth the patience.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "raghav-6",
        "review_rating": "2",
        "review_title": "This move sucks and here's why -",
        "review_detailed_main": "1. Incoherent story-line 2. Too many undefined characters 3. Beaten - up and clichéd approach towards a thriller 4. Extraordinarily long movie for its flat theme\n\nThis does not deserve anything more than a 4/10. It is a pathetic attempt at a thriller.\n\nI was actually surprised that Amir Khan actually agreed to act in such a silly movie. Having said that the initial part of the movie did seem promising, but it only seemed to inflate itself to a point where the director, story-writer and the rest of the crew could not figure out what to do with it."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "daminigaur87",
        "review_rating": "9",
        "review_title": "talaash.... riding deep....",
        "review_detailed_main": "Well woven script and classic conceptualization by the imaginative grey stuff of the ladies (reema kagti and zoya akhtar).Justifying the rare elements of a thriller in bollywood: conspiracy, suspense, tension, tragedy and sharp dialogues. Along with a scope and desire to delve deep into a degree of engagement in the storyline.Brilliant plot execution with parallel running plots. Definitely not a Hollywood style edge of the seat thriller but crisp job on Hindi screen. Every single actor is a treat to be watched...! Cinematic delight in terms if cinematography too. Unusual work in the genre in Bollywood. Scale of audience engagement is felt rightly at the climax shot. Lastly, wonderfully portrayed Mumbai....."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rajat-bajpai2020",
        "review_rating": "10",
        "review_title": "best one in this league (thriller drama)",
        "review_detailed_main": "hats off to the team of talaash what a beautiful cinema they have created story was great i watched this movie after knowing the climax but still i find it very interesting n imaginative n this kind of direction will definitely lead Indian cinema to international platform amir is the best choice for inspector shekhawat n i was also very curious about the movie since it's amir's and i undoubtedly believe that he creates masterpiece n this is one of those n it's not for those who are habitual of watchin bollywood versions of southindian movies script is beautifully written n it's been shown in the best possible way thanks reema for givin such a strong impulsive cinema in this time when bollywood has been surrounded by extremely stupid south Indian action culture"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "dheepak10",
        "review_rating": "9",
        "review_title": "Mesmerizing from the start",
        "review_detailed_main": "Let me start with the best thing about this movie - its haunting background score. Ram Sampath has done an awesome work on each frame making the film noir feel settle into you right from the title track.\n\nThe second best thing is Aamir Khan - I would say that Aamir is the best actor, currently, only next to Kamal Hassan.\n\nThe story - There are two plots here. The main plot is where Inspector Surjan investigates the mysterious death of a celeb - a quite suspenseful plot on its own. However the main plot would not have been as effective if not for the subplot, which builds the premise for the climax of the movie.\n\nNawazuddin Siddiqui - One of the emerging fine actors, is an integral part of Talaash and has done a fine work. In fact the best sequence in the movie in one involving Nawazuddin in a local train.\n\nCrisp editing and wonderful direction add to the quality of the movie. And then there's Kareena Kapoor, who has not overdone her role in the movie. One of her finest performances.\n\nThis is one of those movies which raises the quality of Indian cinema. Go for the movie without any expectation or any knowledge of the story to enjoy it.\n\nDo not read the FB posts revealing the climax of the movie or the other reviews of people who think that there is no logic in \"certain\" genre of movies."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kartikg007",
        "review_rating": "9",
        "review_title": "Good Movie",
        "review_detailed_main": "The first half of the movie is very strong and rightly paced. In second half, there is a play of emotions and many may find it boring(may be that was needed to give some supernatural sense to the movie).\n\nActing was good by all, specially I loved Aamir. He is awesome in portraying a serious cop. His and that of Kareena , Rani roles were nearly perfect.\n\nAnother strong point is movie's music. Music goes on to haunt the audience (just like Batman).\n\nWhat movie lacks, I think, is the handling of audience's response to knowing of ghost. I think the promotions should have done it's role of giving movie a supernatural touch.\n\nOverall the movie is excellent and rightfully earned the critics accolades."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sexytanuu16",
        "review_rating": "1",
        "review_title": "Fishhh u Mr. sissy aamir",
        "review_detailed_main": "Reema Kagti and Zoya Akhtar are fine film makers, but Aamir khan ruined it with his fingering. Randeep Hood might have been a better choice for the lead role, he would have brought some conviction to the character .. but Aamir khan just couldn't do anything with this one, audience seemed insensitive about what srujan goes through or what he does, that bland was Mr. kiran rao's performance!! its better that aamir khan does south Indian remakes or licks the shoes of Rajkumar hirani to give him another success.. dhoom3 wud be a success, if at all a success because of the brand of dhoom and Abhishek Bachchan and Uday chopra. Rani and aamir go and watch Golmaal3 , didn't surjan notice Rosy in the film or at least in the posters .. This is the most bogus film of our era\u0085 KLPD looks better after watching Talaash. The biggest chutiyapa is that the lead actor who made a 13 episode trauma inducing SMJ, had requested the population not believe in Babas, evils etc etc and now he makes this crap called Talaash which deals with spirits FISHHH!! As an actor aamir was never great but till Lagaan , i considered him to be one of the good actors but since then, he has just degraded himself owing to his ego and perfectionist tag. there's not even one percent of honesty and spontaneity in his performance or films. As Naseeruddin shah said in one of his interviews that aamir is the most boring actor.. he cant get the audiences involved into the story like an Amitabh or ShahRukh Khan!! No awards again this year for aamir, not even nominations I guess! aamir's character is such a dull , regressive character that one can hardly sympathise with. on the top there's no heroism. all the clues are given by the spirit Rosy, aamir does nothing except ogling Rosy's butt. The most Bogus film, performance and story comes from aamir this year!!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "syedmohsin4",
        "review_rating": "10",
        "review_title": "Must watch!! Aamir Khan never disappoints you!!",
        "review_detailed_main": "Went to watch Talaash today.. I know it's already late.. But my excitement had only gone up. ;) Luckily I did not know about the climax.. Knowing the climax might have reduced the interest in the movie...\n\nTalaash... is a 'beautiful' movie and it is much more than a thriller. It has so many more things in it! \"Muskaanein Jhoothi hain\" has one of the best choreography I have seen. dark side of the city.. Talaash is a unique thriller, one of its kind. Aamir Khan has obviously done a great job. He is again \"into\" the role.. He behaves just like a cop like him should behave.. took care of all the nuisances. Kareena and Rani are good.. Rani has probably less screen time than others..but with her subtle acting skills, created an impression. Interestingly, all the side actors/actresses, the supporting casts, have done a fabulous job! This movie is gonna stay in your mind for quite a while.. It's a 2.5 hours long story but you never feel bored. Very tight script.. It has a story that you can watch this movie more than once.. So, this thriller is more than just about the climax.. Enjoy the movie! :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "raisatyam006",
        "review_rating": "9",
        "review_title": "The Khan is Back with a Bang !",
        "review_detailed_main": "Well after watching Talaash I can easily conclude what calibre Mr.Aamir Khan aka \"The Perfectionist\" holds. Some may say it was a Psychological thriller but \"Suspense Drama\" is what the apt genre is for such a brilliant movie.It was something I really appreciate being churned out from Bollywood who is labeled as the poor cousin of Hollywood but not anymore.Accusations were made of being copied from some Hollywood movies but all seem to be invalid as Talaash holds its own ground and its own identity.So lemme start with the basic plot: A Police officer investigating the mysterious car accident of an established actor, a seductive Hooker played by Kareena adding to the suspense and mystery of similar car accidents on the same road and a shattered Rani Mukherji(My Favorite actress) as Aamir's wife recovering from the pain of her dead son and her relationship with the reclusive husband getting torn day-by- day.The first half cleverly builds up the story and you are hooked to the screen as you try to comprehend all the clues and guess some random evidences side by side with Aamir Khan but you may find it a bit dull and stretched.Yes, you might consider checking out some Hotties sitting next to you or start logging on to facebook and checking your notifications via mobile but it hints at various sub plots and paves way for some thoroughly enjoyable scenes. Bang on ! The second half starts and you inch closer to what precisely Inspector Shekhawat(Aamir Khan) is trying to find out and here comes the final twist in the story and the reasons for the mysterious accidents and deaths. The climax seems to be a bit stretched but all's well that ends well right ? Aamir Khan comes up with yet another amazing performance after a long gap of 3 years.As the bewildered and perplexed Inspector or the stoic Husband and Father of a dead child he pours his heart and soul into the character and brings it alive. Rani Mukherji as the grieving mother and a concerned wife is simply outstanding and she does definitely know how to get into the skin of her character,you want to sympathize her, hug her and tell her that \"Everything's gonna be okay\".Yes I do hold a grudge against Reema Kagti for giving her a very small role.Damn.! My favorite actress was a tad wasted in the movie ha ha whatever but she shines in her own way and proves her acting prowess.Kareena has a meatier role between the female leads.As an enigmatic hooker with all those tantalizing gestures and seductive expressions and smiles you would seriously consider a \"Fap Fap Fap\"(If you know what I mean) ;) And Yes Surprise Surprise.!She has all the surprises up her sleeves to take you on a thrilling drive in the movie and shock factors that you can't miss from her. The Music of the movie is pure Eargasm and run beautifully with the flow of the movie.My personal favorites being \"Jee lay Zara\" and \"Jiya lagey na\" that will definitely work their way up into my ipod.\n\nTalaash is not your usual run of the mill kinda Bollywood movie that you are exposed to lately so don't leave your brains at home.It makes you think about the realities of human life, the emotional journey we will be going through, the pain of losing someone and so many unseen facts and paranormal events that occur in our lives.After the suspense is revealed many of you might say that it does not happen in real life and there is no such bizarre things in this world but such realities and evidences have been tapped so many times in our own personal lives, its just that we tend to ignore it but Talaash cannot be ignored and neither its story.Go for it if you want some real cinematic experience.I am awarding a good 9 out of 10 for this Magnum Opus by Aamir-Rani-Kareena combo."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "RoshDexter",
        "review_rating": "10",
        "review_title": "One of the Best Hindi movies ever!",
        "review_detailed_main": "Talaash is a superb movie. Absolutely awesome story line. Completely unexpected ending. Perfect plot. Perfect match up. I've always liked the movies produced by Aamir Khan. However this is far more the best! Kareena's acting is superb and her character is the best! Its great to see such upcoming Hindi movies which break all traditions and go one step ahead, reaching Hollywood standards. The movie does not have any songs cutting in, which makes the viewer transfixed on the characters and not getting distracted in the middle. This is more than just a family story or a thriller. It is one of the best psychological thrillers India has ever made! I do hope they do more of such movies. This is one amazing movie I believe everyone should watch!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "papukamakshi",
        "review_rating": "8",
        "review_title": "parallel plot: police officer investigates mysterious death of a movie star and he has experienced loss himself.",
        "review_detailed_main": "Rani Mukherjee is bewitching and heartbreakingly beautiful in her powerful portrayal of a woman who has experienced deep loss. As her husband, Aamir plays a rather believable cop for a Hindi film. His personal sadness adds an unexpected dimension to his \"talaash\". Kareena Kapoor's role has been created well, with enough off-kilter details to puzzle the attentive viewer. The cinematography is great. there are no gratuitous scenes of garish red-light glitz. some elements of the storyline do appear inspired by movies out of Hollywood but so what. At least it is not an overt or unapologetic remake. When the mystery of the film star's death and events leading up to it are being unraveled, the movie becomes too much of a talkie. I wish the director had \"shown\" rather than \"told\". Excellent supporting cast. Loved the crowd scenes for the care the production team has taken. All in all, worth the time spent watching it. good yarn, good acting, some nice touches, keeps you occupied for nearly 90% of the time. Flaw? drags towards the end."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rahul160711",
        "review_rating": "5",
        "review_title": "Serious Cinema lovers should go for it !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jfanand",
        "review_rating": "10",
        "review_title": "Hell of a ride!",
        "review_detailed_main": "One of the finest movies to have come out of Bollywood. Exceptional acting by the cast. The screenplay keeps you hooked to the screen. There is so much happening in the movie and so many characters show up, but we are not distracted for even a minute. You are sucked into the dark world of prostitution and we emphathize with each and every character. Aamir just lived as a sleep deprived police officer. Rani and Naseruddin were exceptional, but kareena stole the show. The climax will just blow your mind and you will feel the effect of the movie for sometime.. This is probably one of the finest thriller movies that Indian cinema has produced. Go for it!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "saadgkhan",
        "review_rating": "8",
        "review_title": "A Thriller becomes Horror, acceptable for some and rejected by others",
        "review_detailed_main": "Talaash - CATCH IT (A-) Talaash is one of the most anticipated movies of 2012 and just like any Amir Khan's movie it created lots of buzz before its release. Even Talaash releasing date was almost a year delayed. The story is about a police officer who recently lost his young boy trying to maintain his family and figuring out the reason behind mysterious accident of a huge superstar.\n\nTalaash is very intense movie from the start. The characters played by Amir Khan & Rani Mukerji are extremely intense. Kareena Kapoor's entry softens the tension, which is a good part. Amir Khan is as usual at his best, and its pleasing to see that he never compromise and does his part with perfection. Rani Mukerji is excellent as its good to see her doing a good movie after a long time. Kareena Kapoor looked stunningly beautiful and her presence is very strong. She owns her own in front of everyone.\n\nIn the end, Talaash is an intense thriller which may have been compared to Vidya Balan's Kahaani but the only similarity can be the suspense element of investigation. Ending is indeed shocking, which is mostly good and bad for few. Highly recommended."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "blackbeauty-nvyn",
        "review_rating": "8",
        "review_title": "A thrilling and captivating movie..!",
        "review_detailed_main": "I already knew this movie was going to be awesome when I saw that it had Rani Mukherjee, Aamir Khan, and Kareena Kapoor, three superstars who ACTUALLY know how to act. Everything about this movie is great. They all gave great performances and justified their characters. Even the extras did well. This movie really captures you and won't put you to sleep. It has some very touching moments and the story is also very excellent. This is a new genre for Aamir Khan and he did very well. You might get lost at times with the story but you'll pick up again. Also, for some, the concept might be intangible but seeing other movies like Om Shanti Om, this might even be believable. You should watch this movie if you like suspense, thrill, and mystery."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "afaiz288",
        "review_rating": "10",
        "review_title": "Coming to terms with it",
        "review_detailed_main": "It's amazing how Amir Khan is blaming his wife for not coming to terms with his child's dead while in reality he is the one. Amazing movie very well directed, produced and acted. Very rarely do such movies come and shake you to the core with its deep meaning."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "1",
        "review_title": "The worst thriller of Hindi cinema.",
        "review_detailed_main": "Aamir Khan must understand that he cannot fool the audience with an illogical and unrealistic climax.If a thriller does not thrill then it is not doing it's job.Talaash is not stimulating.What I mean by \"stimulating\" is adrenaline-rushing and heart pounding or keeping you at the edge of your seat. Each scene in Talaash failed to reveal something new, no matter how slight it is.And Reema Kagit the director, please don't tell us about stuff that has nothing to do with the story. I feel that the single greatest characteristic of a thriller is the obvious one. It \"thrills\" as one watches it. The plots are scary, the characters are at great risk and the novels are constructed in a manner that makes the reader really want to turn the page. Vijay Anand's Teesri Manzil,Raj Khosla's \"Woh Kaun thi\" as well as \"Mera Saaya\", Yash Chopra's \"Ittefaq\", Raja Nawathe's \"Gumnaam\" are all classic thrillers.Aamir should better stick to movies which give social message. He is not good in selecting a good script for an intelligent thriller."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vishaal811",
        "review_rating": "8",
        "review_title": "An Inspired Story that Pulls the Rug from the audience's feet",
        "review_detailed_main": "Talaash starts out as a typical murder mystery and for the majority of the movie, we are lead to believe that there will be a proper conclusion that explains the deaths of various people.\n\nIt seems like the writers of this film have copied ideas from movies like The Sixth Sense, Shutter Island, and Fight Club to make this film. Even though it is impressive that such movies are being made, a little more originality would be appreciated.\n\nWe have a cast of talented actors like Aamir Khan, Rani Mukherji and Nawazuddin Siddiqui. The acting was decent though not particularly great. Aamir Khan plays a troubled police officer who is perpetually morose due to the untimely death of his 8 year old son.\n\nThe songs of this movie were unimpressive when listened in isolation. However, it blends in with the tone of the movie and the haunting background score is well composed.\n\nThe movie's greatest flaw is its inability to explain the cause of the death. Also, the ending contradicts the overall tone of the movie due to the supernatural elements that are presented to us.\n\nTalaash is an above average thriller that manages to engage the viewer but does not give a satisfactory ending which dampens the otherwise good effort."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "janhvipatil-59881",
        "review_rating": "10",
        "review_title": "Exceptional and totally unexpected plot !",
        "review_detailed_main": "Not many thrillers and mystery movies i've seen have been this good bollywood especially. Totally worth the watch. You won't regret it."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shubhi-29471",
        "review_rating": "10",
        "review_title": "Nice movie with great performance by all actors",
        "review_detailed_main": "The storyline is unique and touching. wonderful performances by all."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "singhharshdev",
        "review_rating": "10",
        "review_title": "Reality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "pradyu_rock",
        "review_rating": "4",
        "review_title": "Talaash.A sleepy adventure",
        "review_detailed_main": "Coming to the acting point of view, it is below par. Aamir's talent is wasted and Kareena's performance is a treat to watch. Rani without make up, awful!! Great direction. Story could have been cut by at least twenty minutes with few parts in the second half which was a total bore. Music by Ram Sampath is good. Please do select an afternoon show because you will be put to sleep going with the slow pace of this movie. Entertainment scores zero. Romance is clearly not visible through the movie. The movie in the end tries to prove that ghosts do exists in real life. The story seems to draw inspiration from Sixth Sense. I feel Hindi movies should come up with a few original scripts. Go and watch it for the suspense scene. Except that it is a waste of money. Rating- 4/10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "cesurtekin",
        "review_rating": "10",
        "review_title": "Amazing story",
        "review_detailed_main": "Again an extraordinary movie , beautiful story ,she was very beautiful ghost ,love it."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "RosanaBotafogo",
        "review_rating": "9",
        "review_title": "Beautiful, tension, chase, mystery, charming, excellent...",
        "review_detailed_main": "Inspector Surjan Singh Shekhawat (Aamir Khan) investigates the death of a popular movie star. Before he can solve the complicated case, he has to face his pent-up pain and deal with Rosie - a sex worker and murderer.\n\nA drama-thriller-police that we love, thick, mysteries, with a good ending, India does well in these productions, I'm suspicious, because I love Bollywood, tied to a family drama, becoming a fan of Aamir Khan... Beautiful suspense, with a dose phantasmagoric, which illustrates and brightens even more this captivating and dramatic investigative policeman, beautiful, tension, chase, mystery, charming, excellent..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kpanesar-49339",
        "review_rating": "10",
        "review_title": "Amazing lovely film",
        "review_detailed_main": "Just finished watching this lovely film. The acting was brilliant ,I liked Kareena Kapoor's acting although admittedly she mostly walked around everywhere, the story kept you gripped, the sadness of the police inspector losing his son few years back and still carries the guilt with him thus affecting his marriage life to Rani, you have the action, the Melodrama, the plot, and not to mention the most beautiful songs accompanying the movie. The songs flowed along side the appropriate scenes. The story looks at crime in the world of prostitution, and the sadness of grief and loss of a child. There is much more to this film, but I can't give a anything away, watch for yourselves, a truly lovely film."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "venkatb83",
        "review_rating": "10",
        "review_title": "finding-of-nothing...!!",
        "review_detailed_main": "hype created by the movie and expectations by viewers because of star cast..... it reached all? is it up to our expectations ?\n\nyeah n no...!!\n\nif u go having thought lets make time pass without any cross questions... sure u'll enjoy it...\n\nif u go with expectations....u may end up bored-quite not convinced..!\n\nbut over all its a good movie with great suspense... refreshingly good..\n\nits not aamir but kareena stole show....! she's correct- without her talaash is nothing..!!\n\naamir as a cop (not as we think tough cops bashing-triggering) make us to change our thoughts cops Will be like this too..!!\n\nthere's only slap(only one) no bashing-no dis hum dis-hums...\n\nall actors acted very well.. 2 songs are bearable n hear able...songs n lyrics actually to good..........\n\nreema kagti tried her best... and no doubt that even after critical reviews fault findings still it will earn money -fame-\n\nand u may catch-ed what i mean..!\n\nstill it deserves 10/10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "slima_26121",
        "review_rating": "4",
        "review_title": "I couldn't laugh neither could cry",
        "review_detailed_main": "Film Starts in a very impressive way. But subsequently the track changes. Policeman character of Dear Amir Khan has not been justified. Amir Khan Tried to make us laugh but no special occasions were there to laugh enough. The Film was going to end but no idea could be produced whether the antagonist is going to be killed or arrested. . Problems of prostitute girls is revealed in the story which is heart touching, and the relationship of the couple is mysterious. The reason of that relationship is not justified by the story. . Many acts of the actors are found to be one sided and they are not exactly characterized by their act. . The mystery is interesting at the end. And dialog with Rozy is seem to be excellent. . But Many people feel asleep in the film time many times."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "pratapsinghnatasha",
        "review_rating": "10",
        "review_title": "It's not a thriller....its way better!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "riddicksilent-28175",
        "review_rating": "9",
        "review_title": "Loved it...",
        "review_detailed_main": "I watched this movie today and i loved the film so much I heard many negative reviews about this film but after watching the movie I felt that the movie is an under rated gem.I loved the performance of nawaz and kareena Kapoor.The movie can be considered as a dark thriller with a nice twist in the end,overal it's a nice movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "jaykumar-b",
        "review_rating": "8",
        "review_title": "Its a Kareena Show!",
        "review_detailed_main": "I went to see Talaash with an open mind. Hoped Aamir and crew would have something for me. Furthermore, I wanted to see what Katagi had to offer after her fabulous debut!\n\nAamir is good, as always\n\nI wish there was more of Rani Mukherjee in the film, she was her character, but wish there was more of her.\n\nRajkumar seems like the next big thing; he's calm and silent.. kinda cool\n\nHowever, it is Kareena Kapoor who steals the show with her cheesy lines, mischievous eyes and subtle look..\n\nA good film after her incredibly touching and funny Honeymoon Travels! glad i saw it.."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Parth5542",
        "review_rating": "10",
        "review_title": "Simply marvelous, not for kids",
        "review_detailed_main": "I saw it in theater with my cousins and at first place i didn't like it at all but after 3 or 4 years i watched it again (probably scrolling fb and found a link) and yes it becomes one of my favorite movies.\n\nAwesome acting, Great screenplay, brilliant background score...... A great dark thriller, i love this movie more than any other aamir khan gems.\n\nThis movie is for mature audience and is not meant for kids."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ranjit-543-809727",
        "review_rating": "1",
        "review_title": "total waste of time and money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ajay_ramaseshan",
        "review_rating": "8",
        "review_title": "Good suspense movie, ending a bit fancy, but still worth the watch",
        "review_detailed_main": "This is one of the best suspense and thriller movies from Bollywood that I have seen in the recent past. Everything is spot on, lights, cinematography, screenplay, action, and superb performances by the cast. Aamir Khan is again Mr.Perfectionist in this role as an investigating police officer. Kareena also gives a power-packed performance in her role as the prostitute and Rani Mukherjee as the wife, also does a good job. Among the supporting cast, Nawazuddin Siddiqui does a brilliant performance as Tamer.\n\nThe pace of the movie is just right and keeps you hooked on till the very end. The movie also very well captures the dark underbelly of Mumbai and the red-light district with the opening song 'Muskaan Jhootein Hai'. The other songs of this soundtrack album like 'Jeele Zara', 'Jiya Lage Na' and 'Lakh Duniya Kahe' are also very good. The songs also blend very well with the movie, and you don't feel interrupted because of the songs.\n\nHowever, the ending was a little flawed and slightly disappointing. Could have given it a 10/10 if the ending of the movie was better. But still, it definitely deserves a watch at the theatre at least once. You will definitely come away with a smile on your face after seeing this movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vanshmmv",
        "review_rating": "9",
        "review_title": "Dark, somewhat gritty, and epic suspense.",
        "review_detailed_main": "The story was really gud. The acting was superb and kareena shined the best. The weak part was rani whose character was too crybaby. Although the story was good, nawazzudin's character wasn't done justice and his character felt out of place. He didn't have any major connections to the main plot. Just tell me one thing- why didn't amir khan's character feel sleepy bcs he never sleeps in movie. The soundtrack was underrated and it is very good. Infact I am listening jee le zara right now. This movie has alot resemblance to the game wolf among us from telltale games. I felt nostalgic while watching this movie, bcs alot of plots are quite similar. The classic police and sex worker routine is the best."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kescool",
        "review_rating": "8",
        "review_title": "Talaash (Review)",
        "review_detailed_main": "Talaash (Review) - It had been almost three years since cine-goers got to watch an Aamir Khan flick on the big screen, the last being Dhobi Ghat that released way back in Jan 2010. An Aamir Khan movie would always create curiosity due to various reasons as his movies always carry a \"something different\" tag with it. The trailer of Talaash had promised a decent offering on cards and not only did it meet expectations, it also exceeded them. The story begins with a car accident in which a popular filmstar would have died. Surjan Singh Shekhawat played by Aamir Khan who dons the role of a cop this time is investigating the accident case along with a subordinate. Aamir and his wife played by Rani Mukerji have a very happy family along with an 8 year old son until tragedy strikes and their son dies after drowning in a lake. In the due course of investigating the accident case Surjan (Aamir) meets Rosy, a prostitute played by Kareena Kapoor who offers to solve all his problems if given a chance. Things take mysterious turns in the second half and the movie manages to keep the audience on the edge of their seats by keeping the suspense intact. It has been a very long time since a suspense thriller has been offered with such a well written and a tightly bound script. Kudos to the Reema Kagti and Zoya Akhtar duo for coming up with such a fantastic, well executed storytelling screenplay. Aamir Khan is perfection personified as ever. Rani Mukerji and Kareena Kapoor give good performances too. The dialogues by Farhan Akhtar are also good. The producers Ritesh Sidhwani and Farhan Akhtar who usually rope in Shankar-Ehsaan-Loy trio for the music have taken a complete detour by roping in Ram Sampath for the music this time around. Ram Sampath has done a fairly good job with the music as the songs are apt to the situation and don't sound jarring. The songs \"Jee le zara\" and \"Jiya laage na\" stand out as the best songs in the album. Apart from that, the editing is neat especially in scenes where flashes from the past keep crossing Aamir's mind. The cinematographer has done a decent job but could have done much better. In times when there is an acute shortage of movies that give you a satisfying watch, Talaash stands out as the one that would entertain and satisfy you as it is definitely worth the price of the ticket. Don't miss Talaash for it is super fun, stands out among one of its kind and makes you think about it after you are out of the movie hall as well. My Verdict - 8/10"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "abhijit_2009",
        "review_rating": "9",
        "review_title": "Ending ended the Thrill",
        "review_detailed_main": "Indian Film Makers should make more Thrillers/Suspense movies.I personally liked this movie.\n\nThe story is the strength of it.Acting was excellent by all the cast, specially I liked the character Taimur played by Mr. Nawazuddin Siddiqui. Amir was also excellent.\n\nThe story around Rani and her son needed more focus.I felt it was incomplete.\n\nHowever,the climax was dull, could have been presented in a smarter way.Found some similarities with a Hollywood movie.After all, We do expect a little more from \"Amir Khan\"\n\nOverall, very much enjoyed it."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "anilreddy635",
        "review_rating": "3",
        "review_title": "Average",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rudolphi",
        "review_rating": "10",
        "review_title": "Mind blowing",
        "review_detailed_main": "People told me that this was a good movie, but i didn't really believe, due to which i didn't watch it for a very long time when it came out. But boy i was so so wrong. Now, this is the movie at the top of my list of best suspenseful thrillers. It's got great actor's, a mind-blowing story and a twist you will never see coming which will shake you to your core leaving you with goosebumps. If you haven't seen it yet, please go see it. You won't be dissapointed."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Raja79",
        "review_rating": "8",
        "review_title": "Artistic Movie",
        "review_detailed_main": "This is one of the creative and artistic movies that Bollywood has made, and no wonder it is from 2012, as Bollywood was going through a golden phase of creativity during that 2000s - early 2010s era.\n\nMy favorite part of this movie had to be that song \"Muskanein Khooti Hai\", as I just loved the gothic vibe of that song, and Kareena Kapoor truly looked fabulous in not only that song, but also in the entire movie - as I just loved the mysterious gothic vibe she gave out through-out the entirety of this movie.\n\nOverall, this movie was an exceptional Artistic Piece from Bollywood, and it's truly a good movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "omkarpednekarop",
        "review_rating": "8",
        "review_title": "An unexpected thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rimsg_2000",
        "review_rating": "9",
        "review_title": "We are always in Talaash of movies like this..Great Aamir",
        "review_detailed_main": "Eceptional...Aamir always manages to make movies for audience that get sickened with Daabang, Tiger, Rowdy Rathore, Snakes in plane & Anaconda types....Thank god that there are still a few left to make movies for this crowd... I read in many reviews this that this was not expected of Aamir & wonder why not? What do these people expect the movie was all about - another exorcist or bhoot? Did they completely miss the symbolism...even if they..at least appreciate it for the fact that it was gripping, completely mysterious, shocking with characters drawn very finely & cleverly...the pathos...We have always made great movies...but they are few & far between...just that our crowd wants the song & dance & the half naked Deepika's/Salams & Sonams more..the sugary Karan Johar movies (actually some of them are sweet in perspective)...our movies are like our TV.. they are degenerati8ve...we prefer the Tulsi's & Savitri;s who marries 10 men & have sex with all of them but god forbid they ever smoke or drink..THEN they become \"fallen woman\"..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shreya-chattergee",
        "review_rating": "2",
        "review_title": "Don't go with much expectation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "amanq",
        "review_rating": "9",
        "review_title": "atmospheric, intriguing and engrossing",
        "review_detailed_main": "A brilliant movie and best one from Bollywood in 2012. Aamir khan has rightly said that it is not suspense thriller, but a suspense drama. Some people have complained about slow pace, but I never, for a min, found myself bored during the movie. It was interesting and engrossing throughout. Twist was not really mind-blowing (and that is why i am not giving it 10 on 10), but nonetheless was still good enough for me and when you see the movie again, you will find that this only could be the best logical ending and hints were given throughout the movie. I liked it more than \"Kahaani\". And i really loved the song \"jee le zara\" - enigmatic and apt for the movie.\n\nI think this movie is highly underrated, largely because it is a dark and serious movie with no scope for any comedy. Has been and will be liked by quality cinema lovers, and may be headache for people who watch just comedies and action and have reached the same level of intellect."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ankitkumarmishra-55648",
        "review_rating": "10",
        "review_title": "Amazing Movie!!!",
        "review_detailed_main": "A police officer Surjan Singh (Aamir Khan) is assigned to investigate the death of a famous actor who died in a car accident. Singh has developed a guilt complex n is struggling to heal after the death of his young son due to drowning, his superiors r not happy with his investigation method, his grieving wife seeks solace from a medium believing that the dead son is trying to communicate.\n\nDuring investigation Singh learns that the young actor before his death was being blackmailed by a pimp n a big amount of money exchanged hands. Things gets complicated when a handicap beggar (Nawazuddin Siddiqui) gets hold of the sim card belonging to the blackmailer n he starts blackmailing the friends of the dead actor.\n\nThis film is aided by top notch acting, crispy editing, striking cinematography, soulful songs n mesmerizing plot. It has shades of Nicole Kidman's Rabbit Hole n Demi Moore's Half light. But mind u, it is a better movie than the above mentioned films n while the other two r more of drama, this one is half investigative thriller with enuff suspense n tension along with a nice twist.\n\nI first saw this in a theater when it released. Revisited it recently. I am writing a review of this film again as my wife deleted my old review of this film cos she felt I did not justify the earlier review by not mentioning the names of the films which inspired the subplot."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rohanpravas",
        "review_rating": "10",
        "review_title": "Excellent Thriller Movie of Aamir Khan with top notch acting.",
        "review_detailed_main": "Outstanding Movie of Aamir Khan in a very different role this time."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "tinkugho",
        "review_rating": "9",
        "review_title": "Answer is in front of you! Just swim and grab it!",
        "review_detailed_main": "A search , that ends at selves inner door. What an storyline ! Aamir here unstoppable as well as!here Kareena at her peak!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sujath2807",
        "review_rating": "5",
        "review_title": "Was this Amir Khan Movie ?",
        "review_detailed_main": "Somehow right from the time i saw the first look of Talaash, i wasn't looking forward to see the movie, not because it was not interesting enough because it looked very sad ( I had my own reasons for this) but somehow i went for it anyway.\n\nUnfortunately before i went to the movie i came to know the twist so it literally killed the whole suspense, i never really got a chance to get occupied by the movie or by its story. The twist is quite silly as it unfolds in the end you can enjoy the movie until then but if you know the twist already and watch the movie you cant take this movie seriously, i liked the movie but the story could have been told on a bigger platform as in the suspense or the story was very simple. The crime was not complicated or intelligent, the hype generated about the movie and the caption of the movie \"The Truth Lies Within\" doesn't do justice. The acting of all the three characters was top notch, good thing the movie run time was short and thankfully the movie wasn't like a typical Bollywood movie.\n\nWhen i came out of the theater i was regretting a little bit as to why i watched the movie, i started comparing my last movie Jab Tak Hai Jaan with talaash and was hoping that talaash would have been something like it, until next day i saw Khiladi 786. I was glad that movies like Talaash at least exist and was happy that i went for Talaash. I would suggest people to watch this movie at least once, but i would say not to expect too much as we do for every Amir Khan movie. Its not of that magnitude but yes much much better than Khiladi 786"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rupak_speaking",
        "review_rating": "8",
        "review_title": "Intriguing Movie, Captivating Music, Cast Is Spot On...",
        "review_detailed_main": "People have issues with the climax of this otherwise very intriguing thriller, the precise reason it was a lesser hit of the Perfectionist Khan, but that aspect aside, it is a wonderful journey throughout. I thought the movie was perfectly cast. Aamir was his usual self, but on the acting front I would give it to Rani Mukherjee who did remarkably well. Kareena was at her glamorous best and extremely seductive at times when required (like the scene in the elevator with Aamir). Nawaz had an important role to play and did so with aplomb, yet again giving a gentle reminder to the industry that he is ready to succeed Irfan. The music gelled very well with the mood of the film, and I kept humming the numbers for almost a week after. An 8/10..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "a-jain2495",
        "review_rating": "5",
        "review_title": "the ending destroyed it all...",
        "review_detailed_main": "The movie went well till last...........but the ending was a disaster.. The ending was so horrible that i was unable to digest it.... many might have not noticed that kareena was talking to Nawazuddin Siddiqui before the interval....and the ending destroyed all the sense... I would recommend to watch the film for brilliant performance by the perfectionist and beautiful kareena... Also don't miss the song \"JEE LE ZARA\"....simply awesome... if it was not Aamir Khan film, many would have rated it as a fine attempt but nothing more than that and if the film gathers some money at box office it will only be the result of its long lived 6 months promo... People without much brain would definitely give it a 10... so if you are planning to watch it ... go freely by keeping your mind aside...."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "nitishks007",
        "review_rating": "5",
        "review_title": "Ultra-Slow Suspense movie",
        "review_detailed_main": "Well, to start with I am an Aamir Khan fan and do expect a certain level of authenticity to his work and something new each time. He did all these but still the slow screenplay of movie robs us of a decent movie experience. One thing that the promoters do right about this movie is that they call it a Suspense-Drama and not a Suspense-Thriller. There are two parallel stories evolving at the same time with Shekhawat (Aamir's character) at center of it. But the writers have kept these 2 stories so distinctly separate that one loses interest in other story that is the main suspense of the movie mid-way. I would have walked out mid-way into 2nd half had I not been accompanied by few friends. We all had lost any interest in whatever the suspense might be and when it came we were relieved that our dis-interest wasn't misplaced. Climax actually washes away any suspense that 1st hour would have built in one's head. In terms of acting, all 3 main character's are brilliant. Generally screenplay makes you feel like you are watching a serial with nothing to write home in terms of songs or any high voltage moments in middle. For me it didn't work at any level and hence 5/10."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Avanishsmart40",
        "review_rating": "1",
        "review_title": "Worst movie of the year",
        "review_detailed_main": "after decent movies like 3 idiots public start to think Aamir khan is a genius.but he is a ordinary actor trying to make some good money here.Talaash borrows heavily from many Hollywood thriller and supernatural genre films.the climax is some kind of joke where many audience laugh and curse the movie.performance wise movie is just OK.Aamir,Nawaz and Rani IS OK.but Nawaz gives best performance.direction is lousy.dark tone is OK.and movie is boring.overall only one time watch.better to save your money and wait for the DVD to come out.i was disappointed after watching it.i think its better to watch sixth sense or shutter island at home than to watch this movie in theatre."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "saad_khi",
        "review_rating": "2",
        "review_title": "The answer is on the surface: It's Raaz 4!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "yogeshsingh478",
        "review_rating": "2",
        "review_title": "Couldn't make it ! Search remains unfinished !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "iamwhatiam8990",
        "review_rating": "5",
        "review_title": "The Answer Lies Within....Really?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "gunjanmeena465",
        "review_rating": "3",
        "review_title": "Why Ghost ? But movie quality is good !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "aashishraina",
        "review_rating": "5",
        "review_title": "Talaash!!!?? Of What?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "bhudev_java",
        "review_rating": "3",
        "review_title": "Good acting but movie falls !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shailzapatel",
        "review_rating": "2",
        "review_title": "Too much emotional, where is the suspense ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "ClassicCinemaKid",
        "review_rating": "1",
        "review_title": "Should Aamir practise what he Preached?",
        "review_detailed_main": "Talaash lifts heavily from many Hollywood flicks including sixth sense.It's a poorly written, structured, directed, and edited film. The writers and director have invested all their creative energies in inventing their one line idea to convince their big star and have failed to develop it into a taut script for a big canvass film that could do justice to its budget and the star-cast. There are no memorable moments here. Its photography is good in patches, which is deplorable for a big Indian film of this kind. The low budget KAHAANI was much better shot. There are two dialogue writers in the film – Farhan Akhtar and Anurag Kashyap. Both of them need to hone their Hindi writing skills a little more.\n\nWith so many new age geniuses involved with the project, one expected the film to turn out a benchmark of the genre. It is not. They had great Indian classics of the genre to emulate. They have even been dropping names in their interviews unabashedly. What happened to our sense of personal integrity? Is filmmaking all about hype and marketing and hustling people into cinema halls by hook or crook?\n\nThe least we expected was good performances from actors in the film. They have been inadequately exploited. Nawazuddin survives the bad script since his role is inherently interesting and he knows how to make use of the little opportunities that come his way. Aamir has been dealt a poor hand. He has no other prop to fall back upon for support except his scowl.Aamir has done a lot of over acting with stiff face and HULK HOGAN Moustache.\n\nAamir preached in his Reality Show Satyamev Jayate that ghost and supernatural like things does not exist but in Talaash we come to see a different side of Aamir.He wants audience to believe in ghosts and supernatural occurrences.What a double faced man.Audience come to QUESTION-Should Aamir practise what he Preached?\n\nTALAASH is a big let down.\n\nRating - 1/5"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "rishiraj19662001",
        "review_rating": "3",
        "review_title": "Slow and not a powerful climax",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "sahilpatelsrk",
        "review_rating": "1",
        "review_title": "Worst Movie After Ek Tha Tiger",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "shailesh-guha",
        "review_rating": "2",
        "review_title": "Could have been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "triguna-mutuguppe",
        "review_rating": "3",
        "review_title": "Can watch once but don't blame me!!",
        "review_detailed_main": "Did not like it as the ending was very much predictable within 1 hour of the movie. However there were few dialogues which were tremendous. But the initial hipe given to the movie was good. Esp. the start of the movie was the best one. But later the graph goes down badly in the movie. There were few comedy punches as well but did not laughed that much. Surprisingly in the movie no certificates shown so not sure if its a valid in theaters. Not sure if this movie is rated as U/A or A. Surely not U... :)\n\nI would say watch it once but don't blame me if you do not like it.. :)\n\nI think the movie would have been done much much better. There were few mistakes in the movie which spoil the mood of the movie overall. Watch it once for Amir Khan.. if you do not like Amir's acting, do not go at all and if you expect it to be like Sarfarosh its not at all upto the mark. Take risk if you love Amir, Kareena and Raani.. :)"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "nairtejas",
        "review_rating": "4",
        "review_title": "Ridiculously Unrealistic!",
        "review_detailed_main": "Before I start, a standing ovation - a salute to \"Nawazuddin Siddiqui!\"\n\nZoya Akhtar's ZNMD cajoled me to watch this and mind you, I was disappointed. Here's why:\n\n1. A horror story? Are you kidding me? Talking with spirits who haven't found peace? Are you for real?\n\n2. Kareena's ubiquitous appearances are so disgusting and confusing, one stands to think if it is a movie or a maze. Now this is not pure cinema, instead a gimmick. But her performance is mind-blowing, anyway!\n\n3. Rani Mukherji still thinks she is performing her role in Aiyya, totally misbehaving and not at all mixing with the story.\n\n4. There's no suspense until YOU create it.\n\nHere's why you should NOT go for this movie:\n\n1. You will get confused about the word GENRE!\n\n2. Respect for Aamir will dwindle... extensively. )But will increase for Kareena Kapoor Khan)\n\n3. Because Life Of Pi is also on theaters.\n\nBottom Line: Ram Sampath is fabulous just like he was in Delhi Belly! Reema Kagti has done a beautiful work with this piece of ridiculously unrealistic plot/story!"
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "debforit",
        "review_rating": "3",
        "review_title": "An average story which was too slow paced for an attempted thriller... A disappointing climax which let all the suspense built up till the end sink like the Titanic...",
        "review_detailed_main": "Talaash (search) was a disappointment in more ways than an entertainer. The movie struck the theaters with a crest of high expectations mainly because it was a long awaited Aamir Khan starrer after the massively successful \"3 idiots\". However, I can't help saying that the movie failed to live up to the expectations.\n\nThe opening scene of the movie is very interesting where a speeding car in the middle of the night is shown to be suddenly dismantled from the road and thrust into the Arabian sea witnessed by a few street dwellers. Police inspector Surjan Singh (Aamir Khan) with his associate Raj Kumar Yadav (Devrath Kulkarni) started investigating this seemingly accidental case involving the death of a film star. The suspense was slowly but surely building up through the disclosure of a blackmailing story. It was revealed that the dead film star was being blackmailed by a pimp, who went there alone on the night of his death to give 2 million bucks to the blackmailer. The blackmailer, who fled to his village was then discovered dead, drowned to death. It was all going well till this point when facts were being revealed through police investigations.\n\nBut then suddenly, out of the blue, comes a prostitute girl Rosy (Kareena Kapoor), portrayed in the shades of eternal destitute, suggesting a forced entry into the \"business\" against her will, abused by her clients and mistreated by the pimps. A responsible cop (Aamir Khan), himself suffering from psychological depressions owing to the lack of a warm relationship with his wife Shreya (Rani Mukerji) due to their loss of only son, falls for this girl and starts meeting him every night in some isolated part of the city by the sea-side.\n\nIt is at this point that the film loses its focus. Furthermore, the sub-plot of the dead boy of Surjan and Shreya communicating with a medium living in their neighborhood through séances (or God knows how!), and this fanatic neighbor attempting to persuade the scientific minded and atheist Surjan about the existence of an after-life, was not too convincing and didn't in any way help to the story development.\n\nThe film went no where after this. It was revealed that Rosy was a ghost seeking revenge on three of her clients who picked her up from a hotel three years ago, and abandoned her in the middle of the street on which she has now found out ways to emerge out of the blue and inflict enough fear, horror and panic in the minds (and brains?) of the poor drivers (the three clients in sequence) through her macabre and ghastly appearance, so that these drivers are forced to swerve their wheel under the sea.\n\nIn the final scene, Aamir Khan is shown to drive the police car himself, carrying along with him a friend of the deceased film star who has now turned out to be the last of the three clients still alive. And then all of a sudden appears Kareena, terrifying Aamir to swerve his car towards the depth of the sea! Not content with this, she also rescues Aamir by unlocking a locked car door from outside!\n\nSo, Aamir now starts believing in after life, reads posthumous letters written by his son, reunites with his wife, and lives happily ever after. The story thankfully ended at this point and so did my misery.\n\nTo Summarize: An average story which was too slow paced for an attempted thriller... A disappointing climax which let all the suspense built up till the end sink like the Titanic..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "suryaneeldasneil",
        "review_rating": "3",
        "review_title": "Enjoyable only for die-hard Aamir Khan fans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "madhurao1961",
        "review_rating": "4",
        "review_title": "Good attempt but lacks fun !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kaur-kaushal",
        "review_rating": "3",
        "review_title": "Another average which didn't work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "karanpahil",
        "review_rating": "3",
        "review_title": "Not really worthwhile",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "irfarious",
        "review_rating": "3",
        "review_title": "Very predictable",
        "review_detailed_main": "If you have never watched a movie that has mind-raped you, watch talaash. you may like it. I reached the movie half an hour late and understood bits and pieces of the movie as I was watching it. There's one scene in this movie, 10 minutes after the interval. I saw that and that was good enough for me to figure out the whole plot, including the climax. Yes, It's that predictable,but then again, it's just me.\n\nIf I ever feel like watching it again, it will only be for rani mukherjee. I'm not a fan. But the way she has adored a saree in this movie... absolutely gorgeous. There's nothing else to talk about this movie."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Subijay",
        "review_rating": "2",
        "review_title": "Fails to excite...boring...not upto Aamir's standard",
        "review_detailed_main": "You might have seen movies with great start and mystery. You would like to see how the mystery unfolds. How the detective comes to a conclusion..That's what keeps the viewers tied onto their seats. You always have a sense of urgency.....what's going to happen next?...\n\nWell this movies starts with a promising note..but as it progresses its loses the grip...sometimes even bores you..you also won't like to know what in store for you next.\n\nAnd then when you see the climax (I hate to call it climax) you are left with a question - how on earth, in this 21st century, can someone create a solution like that? Often you see when a story writer cannot find a solution of a good mystery he will at the end tell it was all in dreams, or it was some unearthly spirit...you lose interest...its like stabbing your now creation. Do not write mysteries which you yourself cannot solve.\n\nI judge movies by its intensity, depth and story. Not by acting, camera works or cinematography - I don't even understand those technical terms.\n\nIf you are like me refrain from watching....Better watch Kahaani one more time..."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "babsab",
        "review_rating": "1",
        "review_title": "Ghatiya Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "Thrishoolin",
        "review_rating": "2",
        "review_title": "A big hype about nothing",
        "review_detailed_main": "I am not a fan of Aamir khan. But, I like him. It was almost 3 years since his last film '3 idiots' released and people were eagerly waiting for this one. I was also interested in seeing this film. But, this film was a big letdown.\n\nThe first half was OK. It started off very well. But, Shekhawat's family problems were making the film get dragged on. At times, the film completely focuses on his personal life and forgets to shed light on his case. With the onset of the second half, the film really loses its charm. Unwanted subplots and too many characters ruin the movie. But, all this while, I had the notion that there would be a good climax for the movie which would compensate for all the flaws. But, the climax turned out to be the biggest letdown. It just degraded the whole movie. I think that the writers really lost their imagination towards the end.\n\nThe good part about the movie is its songs and cinematography. Songs are great. The film has beautifully captured the essence of Mumbai.\n\nOn the whole, Talaash is a very bad thriller. The people who praise it are surely the ones who think that Aamir is always right. I believe that having a big star and no masala ingredients will not make it a great movie. The film need to have a good story. Here the execution went OK, but the story was flimsy.\n\nIf you want to see a good thriller, watch 'Kahaani' or 'Don' again. If you want to bang your head at the end of a movie, watch 'Talaash'."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "prerna2526",
        "review_rating": "5",
        "review_title": "Brilliant?? No! Overratted?? Yes!",
        "review_detailed_main": "For the first time I've seen an Indian movie so overrated on IMDb. Idk how?....well I guess even I gave it an extra pt. Maybe cause of.....well seriously idk.\n\nAmir,Rani, Kareena all are good... but the thing is they are just 'good'...the movie is too dark and too slow too handle... there are scenes which seriously cud better be cut off.\n\nIdk watching too much Hollywood is it... or what? But at least I found the story dull and predictable... there was a mess u wanted to touch the supernatural, cud have done it better that whole writing the letter...uh duh!...c'mon give me something.\n\nThen there was this whole murdered prostitute who seeks revenge thing...aaagh again too boring and repeated n number of times in various cinema.\n\nAnd buoy oh buoy I'm still trying to figure out why the hype with all the performances... Amir din't do an extraordinary job (playing the poker faced cop except for the last shot), and same goes with Rani (same old same old depressed mother and desperate housewife :p)...Kareena's expressions seemed to impress but the dialogues ugh!!! Huh in short... Nice try! Not-so-thrilling Chills! So-so story! Cud have done better! Not really 'out-of the world' performances! Everybody was just acting as if they were acting for god sake."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "abhibhavak",
        "review_rating": "1",
        "review_title": "Senseless, Pseudoscientific, Pathetic film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "fuadkhan2002",
        "review_rating": "4",
        "review_title": "A cop struggles with his personal demons as well as the intricacies of a murder case that has seemingly supernatural aspects.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "maxakheron",
        "review_rating": "2",
        "review_title": "Slowest Movie in the World",
        "review_detailed_main": "I have never seen a slower movie than this. Initially the viewer thinks that the movie would be at a good pace and will move in the flow. But as the mystery gets deeper the film get slower. Most of the time you can actually predict what is gonna happen next. But I think it was a 131 minutes of drag. For actors, Amir Khan plays a very convincing Inspector. While he cant convince us with his dedication to the role, but he portrayed it nicely. Rani Mukherjee looked like a very unprepared and loose act. At same time, Kareena's acting is so bad that you might want to turn while she acts. I wont recommend this movie to anyone."
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "vpspriyanath",
        "review_rating": "4",
        "review_title": "not perfect....well.. Amir was .... ah.. Average.. But not the best this time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1787988",
        "movie_name": "Talaash: The Answer Lies Within",
        "movie_rating": "7.2",
        "review_username": "kpfashion_zara",
        "review_rating": "3",
        "review_title": "Its not so good, a lot of flaws!!",
        "review_detailed_main": ""
    }
]