[
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Bettlejuice",
        "review_rating": "1",
        "review_title": "No Rating lower than a one",
        "review_detailed_main": "I have often used the phrase the worst movie I have ever seen when describing a movie that I did not enjoy. That was until I saw Pledge This. ever since then I have been unable to say worst movie ever because I know that it wasn't as bad as this one. Ill admit I thought I knew what I was getting into when I saw this movie. I knew that it was National Lampoon and how that name no longer means what it did in the 70s and 80s. I knew that it was staring Paris Hilton so that I shouldn't really expect anything majestic. But I thought that it would be a more or less fun 90 minutes if i wanted to watch a simple brainless sex comedy with lots of fart jokes. Boy was I wrong. There is nothing good about this movie. Not the story obviously or the acting. But I was almost stunned to see how bad the rest of the movie was. It was poorly edited, the quality was awful. One whole scene took place in a white room and the walls were so bright that I couldn't even see the characters. (unfortunatly I was still able to hear what was being said.) Now I'm not the type of person to normally go around bashing movies without reason. But I almost feel that I cant review this movie other than to repeat that it was bad bad bad. I planned to end this by saying that you should see it just to put every other movie you ever saw into perspective but I've decided that I couldn't even suggest you do that."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "emmacampbell",
        "review_rating": "1",
        "review_title": "This movie is so bad its actually find of funny..",
        "review_detailed_main": "I saw this movie with low expectations and was not disappointed. Its so bad that it is actually funny in a very cringe worthy way.\n\nParis is absolutely terrible, I mean she just cannot act, period. She should give up now, as acting is clearly not her thing.. And i'm sure that those voice overs weren't even her! Her co-stars are about the same calibre, i'm sure my 5 year old cousin could do a better job than all of them! Simon Rex, although he is hot, nothing can save him from his abysmal performance in this train wreck.. he should stick to porn.\n\nThe director should be ashamed to have put his name on something so ridiculous and tacky.. Somehow I don't think an Oscar is on the cards for this guy.\n\nI have never written a comment on IMDb, but this movie was so bad I felt compelled to do so.\n\nIf you get the chance to see this film, don't."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "greeberx",
        "review_rating": "2",
        "review_title": "Don't even bother. It makes you stupid.",
        "review_detailed_main": "This movie is terrible, in every possible way. Even though I started it with already-low expectations, I was disgusted the entire time by its banality. This movie made me stupid.\n\nThe acting is terrible, and Paris Hilton's voice-over is annoying at best, and sometimes ambiguous about whose voice-over it actually is. There is barely any continuity between scenes, and major plot points are often introduced but then mysteriously forgotten forever by the next scene. Gags and jokes are lame; every part of the movie seems to be designed specifically to insult your intelligence as a viewer. Worse, the entire movie is based around the idea of the sorority being \"hot\", but there wasn't a single part about it that I found hot. Truly, I don't think there's anything in this movie that anyone but a hotel heiress can relate to.\n\nIn short, if you think Paris Hilton is beautiful and amazing, then you will love this movie!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Rockafeller_Skank",
        "review_rating": "1",
        "review_title": "Worse than you can imagine",
        "review_detailed_main": "OK, I'm really bad at writing reviews but I just have to warn you.\n\nThis movie has gotten reviews with votes around 8/10, since this is obviously some of the cast members voting I'll just have to make that clear! No-one who isn't past puberty can find this funny, I watched this with 3 of my friends. We all like high school movies (we all go to college), especially when we are hung over from last night which we were when we watched this \"movie\".\n\nFirst we wanted to shut it off and go watch paint dry, but then some randomly placed (very nice) T&A came in to the picture and we decided to continue watching. We didn't understand anything about the plot and if you do, you have probably written the manuscript. There is no logic at all in this movie.\n\nThis is what I believe that the movie is about: Paris Hilton is the head of some girl sorority, her biggest dream is to be on the cover of FHM (soft-playboy) and now she has her chance. FHM have a competition where the most beautiful sorority gets to be on the cover, awesome! But (oh no) the sorority has to have a nerd girl too so now they have to let in a group of nerd-girls in the sorority.\n\nActually the only thing that kept us watching was that every time one of us started to complain about how bad this movie was one of the girls in movie showed her titties. Kudos to the director who actually saw when the movie sucked so bad that titties was the only thing that could save the movie. There are a LOT of randomly placed tittie-scenes which have nothing to do with the \"plot\" in this movie. And they're needed.\n\nThis movie has no logic, actually not even scenes that fit together, it is for no one that isn't IN puberty, the few laughs you'll get is when the movie makes so little sense that it's actually funny. The girls in this movie are very nice tough, but they don't manage to make it watchable.\n\nUnless if you really-really like tits, then maybe this movie can make you not vomit. If you do like tits (I know I do) rent American Pie 5 instead, it's funnier. Or rent porn, it has better acting."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "gerardilling",
        "review_rating": "1",
        "review_title": "Worst film ever",
        "review_detailed_main": "I have never posted a review on here before but this film is so bad that I felt compelled to. If I even stop one person from seeing this film it's been worth while.\n\nThere is nothing right with this film. The acting is appalling (even Paula Garces whom I normally like) the script seem to have been written by a bunch of pubescent 14 year old boys and in what film EVER have you seen the \"baddie\" given an narrative voice-over???\n\nI watch a LOT of films and as a result of this I get to watch a lot of dross, however I honestly think that this is the worst film I've ever seen. I did not see this film as Paris Hilton was in it in fact I saw it despite the fact her name was on the cover,in fact I thought her name was only on the cover for name value as no-one would be stupid enough to put her in a lead role, but yes they did! I cannot stress this strongly enough...DO NOT SEE THIS FILM!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "denis888",
        "review_rating": "1",
        "review_title": "Absolutely The Worst Film Ever Made in This World",
        "review_detailed_main": "I thought that Bloodrayne was bad enough. I was wrong. I considered Terminator 3 and Blade 3 to be bad. No, they are really great films in comparison with this scatological, brain-wrenching, gut-tearing, blood-sucking, mind-eating monster of a film. This is not a film, even. There is nothing there - no real script, no good casting, no good music, and finally there is Paris Hilton, an epitome of a bad taste. Man, she doesn't even pretend to play. All she can do, is a set of learned-before poses and smiles, wry and false, as she always was. This is not good, in addition to the \"pleasure\" of watching her legs and body too too much, which is not the most yummy part, either. I cannot even imagine anyone, except for sex-hungry, 12-years boy, or a little, brainless girl of 10, who could watch this abominable terror. Never allow your kids to ever think of going to watch this. Never recommended, to anyone. Rate - 0. But since here is 1 as the lowest, I give it a 1."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "michael_b_olesen",
        "review_rating": "1",
        "review_title": "And you thought American Pie 4 was a waste of time?",
        "review_detailed_main": "\"Hi my name is Paris Hilton, and I am the most ego-centric person on the face of the Earth\". \"Fine lets make a movie about your ever-so-fabulous lifestyle\" said the director. That's how \"Pledge This!\" came to be.\n\nNever before have so many hot women (not including Paris of course, but that's just my opinion) starred in a more lame movie. Bad excuse for showing off skimpy outfits (that's why I gave it a star) and a wide variety of breasts. Holly Valance might have earned the movie a second star, but she wasn't on screen long enough.\n\nDon't waste time on this... No matter what you do..."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "maddmatt420",
        "review_rating": "1",
        "review_title": "My brain tried to strangle me",
        "review_detailed_main": "If I could give this movie a ratings less than 1 I would. This is coming from someone who LIKES fairly terrible movies. I watched Dorm Daze and thought it was mildly amusing. I watched Britney Spears in Crossroads for gods sake.\n\nThis movie made my brain try to jump down my throat and choke me just to save itself from the abject misery. Even the randomly placed T&A shots weren't enough to come CLOSE to making up for the terrible acting and plot. Having one of those girls in my actual LIVING ROOM naked would have made it even, and that's about it.\n\nI would like to personally curse the names of the people who gave this movie a positive review, since I watched it based on those recommendations. I hope they have an extremity crushed by a load of bricks.\n\nOh, and if you didn't think it was possible to hate that worthless waste of space Paris Hilton any more. . . this movie will prove you wrong."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "maxcottle-1",
        "review_rating": "1",
        "review_title": "Pathetic!!!!",
        "review_detailed_main": "Easily the worst film I have seen since little shop of horrors....\n\nAnd what Horrors there were in this film.\n\nNational Lampoons films up until now had a certain pedigree, they were a bit cheesy but very funny Chevy Chase was always brilliant in them.\n\nThis was just a pathetic ego booster for Paris Hilton as far as I can see who obviously is believing her own hype.\n\nParis should stick to home made porn and shopping that is all she is good for Her parents must be so proud. I think she is a terrible actress in fact it didn't even seem like she was acting to me it was pathetic.\n\nTo all of you who watched it just for Paris Hilton and drool over her grow up she is a spoilt slapper who can't act. Get a grip.\n\nAs for the producers of this film, hat kind of idiots do you take us for. Do better next time or there wont be too many opportunities for you to produce crap movies because people wont watch them.\n\nIf I could mark this film lower I would."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "An ugly-spirited film intended for only the most shallow and stupid viewers.",
        "review_detailed_main": "Some films get a score of 1 because they are ineptly filmed or the acting is terrible due to incredibly low budgets. Given what they had, they couldn't do much better.. This film, technically speaking, isn't that bad--it looks professional. But, it is also the ugliest and most shallow film I have ever seen without a single thing to recommend it.\n\nThe film stars Paris Hilton and she also narrates much of the film. The premise is that she's the ultimate hottie and she goes to South Beach to help a sorority become hot enough to win some pointless award. And much of the narration consists of her finding fault with everyone and it abounds with her put-downs, as no one could possibly be \"as hot and sexy\" as her. She forgot to also add \"as narcissistic and pathetic\".\n\nHere are a few of the highlights in this uplifting and sublime film: a bathroom where the toilets and sinks become geysers of liquefied human waste and it spews on everyone, an Indian lady who learns about the joys of a vibrator, a lady showing off her horribly scarred breasts following breast surgery, stereotypes as opposed to realistic characters (such as the obligatory fat girl with a suitcase stuffed with snacks and the religious zealot), some anti-lesbian and anti-woman remarks/jokes (I'm not super-sensitive about politically correct stuff and still it clearly offended me to hear women referred to that way), bestiality as well as the crudest language I've ever heard (not funny crude, just classless and crass). Clearly, the film shows all the imagination and grace of a movie written by a 13 year-old--a very nasty and talentless 13 year-old. Currently, this and several other Paris Hilton films are in the hallowed Bottom 100 on IMDb. Considering it consists of Hilton dispensing advice to others on how to be a better person or just her torturing people for fun, I could certainly understand it making the list! It's nasty and cruel--without a hint of grace or cleverness. If you think that Paris does not get enough time in front of the camera and you have absolutely no values (other than to look 'hot'), then this movie is for you. Otherwise, find something else to do...ANYTHING else!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Not hot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "richardb_p",
        "review_rating": "10",
        "review_title": "mindshattering!",
        "review_detailed_main": "this movie is absolutely amazing, its level of sophistication is beyond belief. despite what most people say, this is actually a philosophical film that requires a high level understanding of plato's republic, combined with arthur schopenhauer's thesis on the human condition this is truly a master piece. a hidden gem. It is one of those rear classics that gets better every time. after i watched it the 8th time, its true meaning suddenly hit me like a 10 tonne coconut on my head. a must watch, and must watch repeadtly until it hits you. It is best watched with a bunch of relatives so you can discuss and reflect on your family relationships afterwards. wow. amazing. i'm going to watch it again right now."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "PoisonKeyblade",
        "review_rating": "6",
        "review_title": "A Fun Guilty Pleasure",
        "review_detailed_main": "Pledge This! is a new film from National Lampoon, and this installment follows along the lines of the other films--a simple plot, good actors, a paper-thin love story, plenty of sight gags, and some sort of villain. This film, however, takes the equation one step further with its quirky characters. The film stars Paris Hilton (House of Wax, The Hillz), Simon Rex (Scary Movie 3, Shriek if You Know What I Did Last Friday the 13th), Sarah Carter (Final Destination 2), Paula Garces (Harold & Kumar Go to White Castle, Clockstoppers), Geoffrey Arend (The Ringer, Bubble Boy) and many other young, up-and-coming actors and actresses.\n\nVictoria English (Paris Hilton) is the wealthy, snobbish president of Gamma Gamma sorority at South Beach University in Miami, Florida. When Victoria learns that FHM Magazine is nominating them for \"Best Sorority of the Year\", Victoria plots to have more \"diversified\" co-eds pledge her sorority to integrate her all-blonde and wealthy sorority. One of Victoria's pledges, Kristen Haas (Sarah Carter), suggests they pledge her ex-friend Gloria (Paula Garces) and six of her misfit dorm mates; DJ spinner Monique; an Indian exchange student nicknamed PooPoo; divorcée Kathy, who is seeking to relive her youth by going back to college; fat Southern belle Maxine; weird goth girl Babs; and lesbian chick Tonya. The seven pledges are force to go through the most outrageous initiations to be accepted. But when they learn that it was all an act just to get the front cover of FHM magazine, Gloria teams up with Victoria's boyfriend, Derek (Simon Rex), to settle the score.\n\nSurprisingly, the acting in Pledge This! is quite solid, but the script is pretty lacking. It just does overused clichés one after another until we hit the extremely obvious ending. However, the clichés are actually most of what makes this movie work. If this tried to be some original romantic comedy, I couldn't see it working on any level whatsoever. I wasn't expecting much from Paris Hilton, as I had seen her in House of Wax and her acting was so wooden and boring that, basically, I wanted to throw up. However, Paris Hilton somehow manages to surprise\u0085 and this is supposed to be direct-to-video fare! I've never really thought that Paris Hilton was very attractive, but in Pledge This!, the lighting, outfits, and hair style that Paris is given really make her stand out. Simon Rex was great as usual--he has rapidly become one of my favorite actors through the very few films that I have seen him in. His acting style is always hysterically funny, and the movie was worth watching just to see what sort of wacky performance he would appear in next. Paula Garces is perfect as Gloria, and the love story between she and Derek was believable, although, again, quite clichéd. All of the other characters were very creative and fun.\n\nIn terms of sight gags and nudity, they're in plentiful supply here. One of my favorite scenes had a dog giving Simon Rex a blow job! Classic! There was a lot of female nudity, and while I'm not one to complain, some scenes just felt thrown in there for the sake of nudity alone. I really liked the story; something new filled with old stuff.\n\nOverall, Pledge This! is a fun movie for what it was--a direct-to-video National Lampoon film that does very little to break from the mold. See this for nudity and laughs, but don't expect a masterpiece."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "crumbworks",
        "review_rating": "2",
        "review_title": "I Pledge To You: Avoid This",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "thepeafunk",
        "review_rating": "3",
        "review_title": "What happened to National Lampoon?",
        "review_detailed_main": "I have to admit that I rented this movie because Paris Hilton was in it. Now that that's outta the way, the second reason was because it was National Lampoon's. We're talking about the same people that brought us Van Wilder, Animal House and the Vacation series!!! With that said, after the movie was over, I asked myself, \"And why was the name National Lampoon's\" on this???? I have to admit that I didn't care too much for the Dorm Days series, either, and was even whispering then.......What happened to National Lampoon's??? Anyway, I have seen quite a few Paris Hilton films and enjoyed them all, and to be honest, I didn't think she did a bad job here guys. I've seen her do worse, like her performance in Bottom's Up with Jason Mewes. It almost appeared as if she didn't really want to do that movie, as she was not making an effort to making her character believable. As for the rest of Pledge This? The movie was filled with extremely lame punchlines and a predictable outcome. I watched the Special Features, and one of the actors, I believe it was, actually called it a great script! You could have put, I don't know, Ryan Reynolds and Tara Reid in this movie and it still wouldn't have been a great script! I will give it 3 stars because even though it was predictable, I thought with funnier punchlines, it actually could have been a hilarious movie. All in all, I think Paris has the potential to be a good actress if she'd stop accepting roles that are based on, well....her! Oh, and WHAT HAPPENED TO NATIONAL LAMPOON'S????"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "phillylilmermaid",
        "review_rating": "1",
        "review_title": "What was the writer thinking",
        "review_detailed_main": "This movie was absolutely 100% terrible. I would only recommend watching it in order to make fun of it. The plot made absolutely no sense whatsoever. Whoever wrote this movie had to be on something to actually find it funny. There are dozens of jokes completely miss the mark. All the characters are completely stereotyped but not in a way to make it funny and some don't even fit. The only good part of it was the Yorkie was cute, but they should be charged with animal cruelty for forcing the dog to be in this movie. I don't expect much from the straight to video releases from National Lampoon, but they should be ashamed that years after creating the ultimate Fraternity life college movie they made a Sorority one this pitiful."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Jforberg",
        "review_rating": "1",
        "review_title": "Worst Movie Ever!",
        "review_detailed_main": "As i do about every Tuesday I look to see what new DVDs come out I came across this terrible film. Read the back it sounded interesting. Sounded like Paris wasn't going to be a huge role. Either way its terrible. Not even funny at all. Every scene in the movie was a blatant rip-off of another movie and they failed to even achieve the same effect as gag done in previous movies. The only scene that got a reaction out of me was seeing the scars from the one chicks plastic surgery. It brought nothing new to the table and I am shocked national lampoons would even put their name on this garbage. Paris needs to stick to doing what she does best. Nothing! I actually returned this to the store opened. I told them I didn't want my money back or anything I just don't even want to have the movie in my possession anymore. Do yourself a favor and avoid!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "lwbroker1",
        "review_rating": "3",
        "review_title": "Horrid does not begin...",
        "review_detailed_main": "to describe how bad this movie is. I didn't expect much more than T&A with mediocre acting, but even that was a let down. The only reason I gave it a 3 was for the few tatas that did make it to the screen, the fairly frequent scantily clad coeds and Poo Poo. Paris is a scanky, stuck up, rich, snobby b-word who looks down on everyone the entire movie and in the end she's still that way and we're supposed to love her for it. Hmmm, could that be because she helped direct the film? She probably gave the director his own private showing of A Night in Paris.\n\nAll in all, this movie isn't even worth it if all you're looking for is T&A. Stay away at all costs. I can only hope that the NR version was better than this crappy R version that I saw."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "chicagorob1",
        "review_rating": "",
        "review_title": "What in the World???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "delaserman",
        "review_rating": "4",
        "review_title": "Could Have Been Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "onceoakley",
        "review_rating": "1",
        "review_title": "almost...the worst movie ever....",
        "review_detailed_main": "Paris Hilton is a s***. That was the worst movie i have ever watched in my entire life, that even tops \"bring it on again\". that wasn't her acting, that was her normally. Apart from she probably thinks she's hotter in real life. if don't even think it desererves a one out of ten, i don't even thinks she deserves this comment it was that f***** bad. most of the lines were irrelevant and hit an all time new low. the hot guy wasn't even that hot, but i think we should be focusing on the fact that Paris sucks. she is not cool. the only thing to stop it from being the worst movie in the entire history of worst movies is if she had sung. thankfully...she did not do this. i don't know what else to say....\n\nParis is a s***."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "refaelba",
        "review_rating": "1",
        "review_title": "Somebody please make it stop",
        "review_detailed_main": "This is a real story. This morning I finished my night ship at work, got into the car and drove home. On my way I got a message from one of my coworkers, who seemed really stressed and wanted me to get back to him as soon as possible.\n\nA few minutes later I got home, and called him back after parking. He said that there's a woman there who claims I trashed one of her car doors while leaving the parking lot. That was strange to me, since I didn't hit anything and my car was perfectly clean and whole.\n\nLater today I realized that the woman was trying to get other people to pay her for a new door, by parking next to them and then blaming them for hitting her car, while it was actually hit from before. I called my agency and it took them a while to calm me down. Eventually I did, but my day was ruined.\n\nAnd then, this evening, I saw Pledge This!, and realized my day wasn't entirely lost until that point, which made it the worst day in my life.\n\n(A stupid girl): \"Whoa, that dress must have cost hundreds of dollars!\" (Another stupid girl): \"You mean thousands.\" (A stupid girl): \"Thousands of dollars?\" (Another stupid girl): \"Hundreds of thousands.\" (A stupid girl): \"Thousands of thousands. That's what I meant!\"\n\nThis dialog is a perfect example of how shallow, abominable, idiotic, execrable, and completely abysmal this movie is. The plot is based on a first grader's limerick, the acting is based on porno, and you know what - Paris Hilton is really not that hot. Most of the other girls looked way better than that silicone plastic Barbie, although they all portrayed a similar lack of intelligence and acting abilities.\n\nI saw \"Cursed\" once and believed it was the worst movie ever, but this movie is not even on the scale. It is a waste of money in the most horrible and angering form you can imagine. And I don't mean YOUR money, I mean the producers' money, who are probably going to slam their heads against random walls to the beat of \"What the heck was I thinking\" for the rest of their lives.\n\nIf your local video store has this movie in stock, discontinue your membership at once."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Classic",
        "review_detailed_main": "Great acting, great plot, wonderful storyline. One of my favourite art house movies"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "lolaevergreen",
        "review_rating": "7",
        "review_title": "Seriously misunderstood",
        "review_detailed_main": "This is a PARODY. It is not meant to be a serious movie. If you enjoy absurd and slightly edgy comedy, you might like this. I certainly got a few good laughs. Do not go into this thinking that it's a regular 2000s Paris Hilton movie about a college sorority, it is meant to be a joke."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "billyh42",
        "review_rating": "1",
        "review_title": "Still Can't Believe How Bad This Film Was!!!",
        "review_detailed_main": "Now I've seen bad films, many, many, bad films - but now I'm thinking were they actually that bad? Pledge This has Paula Garces and Holly Valance in it but despite this it is UNBELIEVABLY bad.\n\nNow, don't get me wrong, I watched this film knowing that Paris Hilton could not possibly be involved in any high quality professional production and couldn't really have many (any?) film roles to choose but all I could think for the duration of this film is how on earth Paula Garces and Holly Valance could be persuaded to take part in this rubbish?\n\nThis makes American Pie - The Naked Mile seem like a Spielberg production! However, I just know that you're still going to watch this film, refusing to believe that it's so bad. I thought the same - but you'll find out!!!\n\nbillyh42"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "sinister_prog",
        "review_rating": "1",
        "review_title": "Might be useful on long haul flights when you need to slip into a coma for a few hours.",
        "review_detailed_main": "This isn't a movie as such, more of an extended filming of \"I am Paris Hilton and I must be idolized\". Or soft porn for the brain dead. Wafer thin plot has something to do with a bunch of sorority girls trying to be on the cover of FHM magazine. The only attempts to advance the plot are in the form of voice-overs whenever she's on screen. Seems like weaving a story into the script was too difficult for the writers, and it's not even her voice you hear. No likable characters either. At one time a toilet explodes and covers all the girls in crap, but an old lady gets covered too, so the girls all laugh despite being covered themselves. What fun.\n\nI gave up on this when a scene involving a Hilton and her boyfriend holding a hammer didn't have the ending I was rooting for."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "rudymovie",
        "review_rating": "",
        "review_title": "Unbelievable.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "zeuserx",
        "review_rating": "1",
        "review_title": "Dumbest trash of 2006",
        "review_detailed_main": "It's a good thing I didn't spend a dime to watch this. It wasn't worth a dime.\n\nHonestly, how can Paris *NOT* win the Razzies? Sharon Stone doesn't hold a candle to Hilton's complete lack of talent? The jokes weren't even funny. I want my 15 minutes pf life back. Incidentally, I could only stand 15 minutes anyway. I guess I'm tolerant of vile trash than most. LOL!\n\nGirls weren't that hot either. And Paris looked like a skank as usual, no acting needed, that's her everyday persona. National lampoon used to have funny movies back in the '80s. What happened? All the latest National Lampoon flicks have been nothing but junk. Compared to this complete piece of trash, I think Basic Instinct 2 needs to get an Oscar."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "junaidaslam",
        "review_rating": "1",
        "review_title": "Its a classic of some sort",
        "review_detailed_main": "I watched this film, i have no idea why. I can't understand what possessed me to watch a film with Paris Hilton.\n\nI guess the best part of the film was the random b00bi3s.\n\nThe worst part was anything to do with Paris Hilton. This woman is so lazy she didn't even do all of the voice overs.\n\nAfter the film was over I just sat there for 30 minutes motionless as my brain was recovering from the numerous brain cells destroyed watching this.\n\nHowever, if you're an evil person. Lend this film to your hated enemies."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "disdressed12",
        "review_rating": "1",
        "review_title": "i can't believe i swallowed the same booger for nearly 30 min.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "tsn_saltydog",
        "review_rating": "1",
        "review_title": "Hardly worth the celluloid",
        "review_detailed_main": "Out of curiosity, I began to watch the movie. I couldn't bear to endure through a plot and scenes completely devoid of any moral or socially redeeming value. I stopped after a painful 20 minutes. I trust that Paris Hilton has many devotees, and if one's affinity is for saccharine superficiality, this is the movie for you. If you are someone who demands a bit more from a movie beyond canine oral sex and \"it's all about me\" portrayals, then this movie is not for you. Beginning with the title, \"Pledge This,\" the obvious reference is to male-oriented aphorisms related to the male organ. That should be the first clue. The opening credit sequence shows Paris Hilton bouncing superimposed through various venues and male and female alike agog at her presence. Later, in one of the opening scenes, several Paris look-alikes are wanting to join her sorority. Finding some of them unfit to her plastic standards, two of them have bags placed over their heads. It was the dog performing oral sex in Paris' stead that convinced me it was not worth the additional time. The movie is several steps below sophomoric."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "emielfokker",
        "review_rating": "1",
        "review_title": "This made my eyes bleed",
        "review_detailed_main": "I feel abused and violated. Watching this movie is like being sodomized, but without the lubricant. A lobotomy feels like a pleasant day on the beach with free ice-cream compared to this. In fact, I am willing to cut out the parts of my brain which are currently remembering this movie. The acting sub-par and uninspired. The directing and cutting of the scenes is amateuristic and reminds me of a cheap pornographic movie, only without the meager pay-off one usually gets from nude-scenes. Paris Hilton is her usual infuriatingly shallow and boring self. She hops about on screen with fixed poses and her lines make you believe she has the depth of a glass of champagne. Facts show that the suicide-ratio has increased exponentially since the release of this movie, and I can understand why. This movie needs to be buried somewhere no-one will ever look. Perhaps Paris Hilton's head is a good suggestion.\n\n....\n\nWhy did I even watch that whole thing? It's like watching a friggin' car crash: It's horrible and disfiguring, but you JUST CAN'T LOOK AWAY!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "a-twetman",
        "review_rating": "2",
        "review_title": "cringe worthy all the way, inconsistent second half.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "mymilkshakes",
        "review_rating": "8",
        "review_title": "watch this movie for the hell of it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "wes-connors",
        "review_rating": "2",
        "review_title": "Victoria's Secret",
        "review_detailed_main": "Pretty blonde Paris Hilton (as Victoria English) runs the sexy South Beach sorority \"Gamma Gamma\". In order to win FHM magazine's coveted \"Hottest Sorority\" contest, Ms. Hilton decides to diversify the wealthy, blonde sorority set by accepting ethnic, ugly, fat, and otherwise non-blonde pledges. Beautiful dark-haired rival Paula Garcés (as Gloria) makes trouble for Hilton and orally fixed boyfriend Simon Rex (as Derek). Hilton's dog chows down!\n\nThe flesh is fleeting, and Hilton shows little. Fortunately, some of the other women aren't as shy. A good example of the humor is when a toilet reverse backs-up all over the screen. Worst of all, Hilton as \"Victoria\" has a skeleton in her closet - she was an ugly child. (Choke!) Will this dark secret ruin her chances to win the \"Hottest Sorority in the Country\" contest? It's nice to see performers like Mr. Rex and Alexis Thorpe (as Morgan); but, the material is not very good. So, you may want to park your car in another garage. You'll get more kicks from a \"Girls Gone Wild\" commercial.\n\n** Pledge This! (12/1/06) William Heins ~ Paris Hilton, Paula Garcés, Simon Rex, Alexis Thorpe"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "rose-294",
        "review_rating": "1",
        "review_title": "Dip to the sewer",
        "review_detailed_main": "The idea of bullies tasting their own medicine in long and repeated intervals is something I would applaud to happen (off-screen!) in some bitingly subtle film. Unfortunately, the \"revenge of the geeks\" is an idea totally wasted in this off-target, unfunny and disgusting dip to the sewer... er, comedy. And why any geek would want to be part of this sorority anyway? Or let these total OMG-so-HOT!-losers to humiliate you? Now a group of \"hot\" sluts (OK, Alexis Thorpe is pretty) who have brains between their legs humiliate fat, geeky etc. students in traditional bullies-are-crap-fashion. Paris Hilton is called Victoria English. Hm..."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "sirkusmartin",
        "review_rating": "1",
        "review_title": "Dear God.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "holly-youlton",
        "review_rating": "1",
        "review_title": "Just don't...",
        "review_detailed_main": "I can't explain how hideously bad this film is. The acting. The filming. The overall technical effects. It claims that Paris Hilton was the 'executive producer' - please don't ever let her produce another film herself. It will only include herself in about 95% camera shots and her voice-over when she's not even needed in the scene. Do not watch this film. I thought her TV series was bad enough 'The Simple Life', this film is clearly just how she viewed her life if she had gone to a university? Go figure.. It doesn't make sense why she would want to make a film like this when she must've realised she would get slated for this? I feel sorry for Carmen Electra and Holly Valance who were blatantly lied to, being convinced this movie would sell well? Harsh review...yes. But it needed to be said!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "whpratt1",
        "review_rating": "1",
        "review_title": "Paris Hilton was Beautiful",
        "review_detailed_main": "Paris Hilton, (Victoria English) does not care how bad her pictures are, she still receives a big pay check. In this picture Victoria English is President of A South Beach University sorority and she seeks to obtain pledges who are definitely unfit in looks or brains. Girls like this are accepted into the sorority and they are mistreated beyond words. Victoria has many boyfriends, however, she meets a guy she knew years ago and they both become very close in many ways. There is plenty of nudity and wild parties and the film is filled with double meaning words and lots of sexy. If you like Paris Hilton and don't care very much for a story, this is the film for you to watch and enjoy."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Jeff-Austin",
        "review_rating": "1",
        "review_title": "Quite possibly the worst movie I've seen in my lifetime.",
        "review_detailed_main": "Paris Hilton has made a number of movies that might bear watching, but this one isn't one of them.\n\nWhile the idea of a sorority movie set in sunny, sexy South Beach is intriguing, this film fails to deliver. It's apparent that National Lampoon purchased this hoping their once-prestigious brand would draw in at least a few victims. I fell for it.\n\nFinding a film with bad acting, a lifeless plot, no action, and a complete absence of humor was difficult -- but I did it when I found this movie! Save your money. Burn it in your driveway before using it to rent this bomb. You'll save yourself two hours of misery."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "brian_herm",
        "review_rating": "1",
        "review_title": "Possibly useful in the future",
        "review_detailed_main": "Someday, decades from now, people might ask why Paris Hilton was so universally detested. This film will serve as a documentary about what an ugly, stuck-up, vain, shallow, talentless, and brainless **** Paris Hilton actually is. I didn't know much about her before I rented this, now I despise her as much as anyone else who doesn't know her personally. Other than that, a complete waste of recording medium. Easily the least enjoyable movie I have ever seen, even worse than \"Cthulhu Mansion\". There is not a single thing in the movie that made me even crack a smile. The skin shots are few and far between and definitely not worth sitting through Paris' voice-over monologues about what a wonderful person she is. I felt bad about returning it to the rental place, instead of just chucking it in the garbage and telling them I lost it."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "hello_dolly",
        "review_rating": "1",
        "review_title": "How about you Pledge this?",
        "review_detailed_main": "In the infamous words of Comic Book Guy: Worst Movie Ever!\n\nWhat possesses people to think that Paris Hilton can not only act, but carry a whole movie? While the movie is funny, it is for all the wrong reasons. Paris Hilton doesn't act, she is just there, reciting some memorised lines being herself, but maybe a tad better. The film also played out every cliché possible- the naive foreign exchange student just discovering her sexuality, the horny older woman, the fat chick, the loser desperate to get sex. Not only has it been done before, but it has been done better- eg American Pie\n\nI really don't know what to say, to sit here and pick the whole thing apart would take at least another page. I will say this though,it was TERRIBLE and only funny to mock constantly, with editing the way it was I think even those guys knew it was hopeless!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "affection",
        "review_rating": "8",
        "review_title": "Cliché, but with somewhat perversely hilarious moments",
        "review_detailed_main": "Since I am a complete gossip magazine lover, I just HAD to watch something with Paris Hilton. Let's face it. Much as we \"hate\" Paris Hilton, I just had to see what she could come up with. This movie featured a \"pretty girl\", Paris Hilton (who plays Victoria English), who was the president of the Gamma Gamma sorority at South Beach University. Basically, this particularly sorority is trying to win FHM's Hottest Sorority competition. But it zooms in at the \"loser\" pledges' torture by the higher level Gamma Gamma girls, and the rise and fall of Victoria English. There are some funny scenes where they show the different sororities the \"losers\" see. Also some inappropriate scenes, as I would say. This movie would've been absolutely perfect for teen girls - a classic sleepover movie. However, the inappropriate scenes that don't really have a impact on the movie, build up the R rating. The acting was actually pretty good, for what looks like a low budget movie (sorry, directors.) The storyline wasn't very deep, but it's all what we like. Simple, without gore, just occasional \"ew-ness.\" Ridiculous, but good fun."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "superdave-10",
        "review_rating": "1",
        "review_title": "Lobotomy anyone?",
        "review_detailed_main": "I found this movie about as fun as a self-performed lobotomy. The scatological humor was an insult to even Paris Hilton's limited repartee. The seemingly random nudity and sexually explicit scenes came across as a desperate attempt to retain audience attention. Also, the quality of Ms. Hilton's and other main character's acting comes across as approximately the quality of a middle school play. The constant background music was poorly matched to the screenplay, and was of low quality anyway.Overall I wish I could burn the part of my brain out that remembers even thinking about watching this movie. I would recommend that if you have at least a mediocre intelligence, you should steer clear of this movie. I've seen porn with better acting. The only redeeming quality was Geoffrey Arend's performances as multiple characters. Granted, they may be over the top, but at least he committed to the roles."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "ynqve",
        "review_rating": "1",
        "review_title": "My brain hurts!",
        "review_detailed_main": "WTF did I just watch? The only reason why I saw this monstrosity was because I wanted to see if it was as bad as it seemed. But I was wrong. So very wrong. It's so bad it makes Birdemic seem like shaw shank redemption.\n\nThe \"plot\" is about Paris Hilton wanting to get on the cover of FHM magazine. Why? Because who the needs talent, intelligence or education, that's just something poor people need. Rich stupid whores knows that the only thing that matters is to act like a wannabe porn star and get a stupid reality show. And that's pretty much the morale of the story. I'M NOT KIDDING. SERIOUSLY.\n\nI honestly don't know who might actually like this abomination of a film. It's the most stereotypical, racist and sexist film I've ever seen. There's no redeeming quality at all. The sheer stupidity of this movie makes your brain hurt. I feel like I've become stupider because of it. Do yourself a favor and avoid this hell spawn like the plague.\n\nNow if you'll excuse me, I'm going to youtube Paris Hiltons death scene from house of wax."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "dimonosads",
        "review_rating": "2",
        "review_title": "The ultimate horror movie!",
        "review_detailed_main": "The Horror. The movie is pure and evil incarnation of horror. I never trembled so much while watching any other scary movies. Hell no! This is the scariest s**t I have ever seen in my life!I can no longer look at the pink color without shivers all over my body thanks to this film! The zombie-like face of Paris Hilton, consumed by the Glamor monster, tells the viewer that there is no hope of good acting in this movie. No, even the other members of the movie crew make awkward facial expressions.\n\nAs the movie goes on your brain screams to stop watching it. Otherwise your mental health is at risk, especially your intellect. The plot twists make you jump out of your chair.. If they weren't terrifying and unnatural, anyone would go insane.\n\nBut most of all, it's not funny! I barely survived in front of my screen. This movie is the Judgement Day. I dare anybody to watch it and overcome the drop of personal IQ."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "redadust",
        "review_rating": "1",
        "review_title": "This Film is a Form of Torture",
        "review_detailed_main": "I found this movie on DVD laying around in my house a while back and I thought to myself \"Paris Hilton actually made a movie!?\" So I popped it in the DVD player and watched it with a friend. It was a big mistake because now I will die knowing I spent over an hour of my life watching this terribly thought out, horribly casted movie.\n\nIt was not acting, it was not a movie, and it seems like Paris Hilton directed this train wreck. I thought it was going to be like American Pie or something of that genre but I was terribly wrong. I don't even know who bought the DVD and if I did they would be in trouble for wasting money, we could have gotten a large pizza or something.\n\nI absolutely abhor this movie: terrible acting, terrible story line, terrible script, and the movie seemed to serve no purpose. It is absent of any intelligent or intellectual thought and I don;t know how the producer got anyone to act in it, they should be ashamed. The only time Paris Hilton should be on camera is when she isn't saying anything.\n\nThis film is a disgrace to American Film. Please do not watch it, even if your life depends on it, however...it is a bit fun to make fun of the magnificently terrible acting."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "m-a-metchi",
        "review_rating": "1",
        "review_title": "I am scared for life.",
        "review_detailed_main": "This movie made me scared. Absolutely terrified. I went mad. Totally bonkers. When I went home after watching it with a friend of mine I felt insecure and afraid. Now I still haven't really come over it. I still jump up in he air like a mad grasshopper whenever I see the color pink again.\n\nJoke aside, although this movie really scared me. I thought nothing could be more horrible than Birdemic and its sequel, but I think we have a winner. Birdemic was bad, and had almost no budget at all, but was still in some way entertaining. Pledge This! had a budget, but was so extremely boring and overexposed and sexist that me and my friend were close to turn the film off and stop watching a several times. But we didn't. We pushed ourselves. We pushed ourselves to watch it to the end. The struggle was real.\n\nThis movie was probably only made to expose Paris Hilton's ego, with her in both the leading role and as executive producer. The entire film seem to be about her beauty and flawlessness, but also how good she is in bed, and how much everyone admires her (according to herself).\n\nI am still not sure of the storyline of this movie. The description says girls that are about to enter a special house at a university or so something where Paris Hilton is the god or queen or big leader or whatever it was. I'd say it didn't really have one. The film was all so messy and the acting so horrible that the story probably drowned in it.\n\nParis Hilton's parents must be proud."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "movieman_kev",
        "review_rating": "1",
        "review_title": "Everyone involved in this monstrosity deserves to do mandatory community service to pay reparations",
        "review_detailed_main": "Paris Hilton is Victoria, the snotty conceited president of an ultra-exclusive sorority (let's be honest she pretty much plays herself). Anyway Victoria has to diversify her pledge picks due to new rules in a FHM magazine contest. Luckily for her, such a group of people are looking for a new place to live after one of the most extremely unfunny, cringe-worthy, soul-crushing scenes of fecal 'humor' that I have every witnessed in my life. So the plan is to use the girls to win the FHM contest & then not let them join the sorority. But the girls have other ideas.\n\nIt's absolutely no surprise in the least that Hilton sucks, but Kerri Kenney Silver of Reno 911 fame thoroughly disgraces herself (as does Lin Shaye) in this completely laugh-free so- called comedy. It not only deserves it's current position in IMDb's bottom 100 films, it is without a doubt the worst film that you can find on Netflix's Instant Watching catalog. Simply putrid in every single way.\n\nMy Grade: F\n\nEye Candy: Camille Langfield, Angela Dodson, Samron Moore, Bethany Merola, Jamine Waltz & 6 extras get topless, (plus one pair of 'scarified' breasts used for 'comedic' effect)"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "jamestthomas",
        "review_rating": "1",
        "review_title": "Hard To Believe Any Human Thought Involved",
        "review_detailed_main": "This trash movie which I suffered for 25 minutes makes me wonder how such idiots could get the money and backing to pollute the world with this waste. I do not think it possible to create garbage less funny, less interesting, less everything then this. I have a home made film of us fixing our shower which could win an Academy Award if this was the competition! Low Brow to the max, its time to Harpoon National Lampoon for good. There is no semblance to anything of quality in this non-story. It is distasteful in every respect, particularly by insulting the sad watchers intelligence. Skip it, burn it, forget it happened. All movie watcher are owed an apology."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "x-lilmissjess-x",
        "review_rating": "1",
        "review_title": "Worst \"Movie\" Ever Made",
        "review_detailed_main": "I'm not so good with reviews, but I think everyone out there should be warned about such a terrible movie before they put their brain cells through so much torture.\n\nThe plot is absolutely pointless and ridiculous. It is basically about a popular girl (played by the always engaging Paris Hilton), who wants her sorority to be featured on the cover of FHM magazine, but in order to do so she must include geeks in her sorority. Great plot, yes?\n\nThen there is the characters and their so called \"actors\" who portray them in the film. Nobody involved with the film can act whatsoever. And I mean nobody. The characters are all ridiculously pointless and un-funny.\n\nI don't really see how anyone with a mind could enjoy this movie and its beyond me how it managed to get funding and someone to release it.\n\nThis movie should only be used to torture felons. Stay away from this film."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "rutgerklaasen",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "Paris Hilton for president! Amazing performance, amazing story and amazing special effects. I wonderded why she hasn't won an Oscar yet!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "richspenc",
        "review_rating": "1",
        "review_title": "Dreadful",
        "review_detailed_main": "Paris Hilton has got to be the most spoiled person in the world. She is rich from just inheriting a large amount of money. She never had to work hard one day in her entire spoiled life except for random photo shoots for a few magazines here and there and to appear in a couple of movie flops. And Paris has no real acting training whatsoever and you can tell that spoiled so and so doesn't even try for her movie scenes and that the directors are just totally fine with that. They probably hardly ever even yelled \"cut\" cause they were so OK with lousiness. Yes, tough life Paris has had. Hollywood used to have work incredibly hard to film their great films. Judy Garland worked very hard for about 14 hours a day and slept about 4 hours a night, had brilliant amazing passion and singing voice, and she touched our hearts. Judy may've been a drug addict but it was not her fault, the studios made her take addictive stimulants to give her the energy she needed for those long hours. Today, the celebrity drug addicts like Lindsey Lohan and Brittany Spears got into addictions becsuse they chose 100% on their own to take them because they wanted to be wild and party. And today we have \"Pledge this\" and horrible flops like \"disaster movie\", \"epic movie\", etc. Oh, how Hollywood has fallen. And America's way, and, well society in general. Little by little since the 1940s and 1950s, to where the change we have now since then is so enormous words cannot describe it. Celebrities once actually really worked for their fortune. They really worked. \"Pledge this \" is nothing but a.very dumb no brainer about a sorority who wants to win best looking sorority over other sororities. And she wants to diss anyone entering her sorority whose not as perfect as she is. Seriously, that's about it in this movie. That and soooo much dumb, annoying, brainless acting, if you even want to call it that. Terrible, embarrassingly bad movie. Movie, if you even want to call it that."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Krmenaldo",
        "review_rating": "1",
        "review_title": "Possibly the worst movie ever",
        "review_detailed_main": "I just want to apologize to myself for wasting almost two hours of my life on watching this rock bottom of the movie industry.\n\nParis Hilton IS NOT HOT in any way. She can't act and that becomes painfully obvious after only a few minutes of watching the movie. Although, it doesn't seem that she's acting at all. She uses phrases and behaves like she does in real life, and the movie is just a brief description of her everyday routine: being a spoiled self-centered daddy's little daughter.\n\nRest of the casting crew consists of very pretty girls who look at Paris, like she's a Goddess.\n\nThis movie is a comedy, and yet there wasn't a single funny situation in the whole movie."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "ciel_85",
        "review_rating": "1",
        "review_title": "This movie is not worth the trash lying in your rubbish bin",
        "review_detailed_main": "Pledge This! is officially the WORST 'movie' I have ever seen.. I am so embarrassed that I wasted my precious money on getting out the DVD that I will never ever tell anyone that I watched this piece of crap. There is absolutely NO plot, no decent acting, WAY too much focus on irrelevant posing and looking 'hot' by Paris Hilton (who will never be and never was hot, she is mildly pretty and is her own biggest fan) and even falls sadly short of passing as a D-grade bad slapstick attempt at a 'movie'. This is not worth the time or money of any person in the whole world and would be classified best as a form of torture due to the high level of crappiness. That is all I ever need to say and hopefully that DVD will NEVER cross my path again."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "strtmanadammac",
        "review_rating": "",
        "review_title": "Thoroughly deserves a 0",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "johnbergstromslc",
        "review_rating": "1",
        "review_title": "Don't bother",
        "review_detailed_main": "This movie is not worth the 3 bucks to rent. Paris Hilton is an ungodly, talentless parasite on society. Why the hell anybody would pay her to display her pathetic acting skills on camera is beyond me.\n\nIf you're planning on fast-forwarding to the nudity (as I did), again, don't bother. It isn't that great. Even the topless scenes with Angela Dodson (the cute blonde 'Molly' from the \"Joe Schmo\" reality show) are pretty lame. You get to see just how bad her implant job is. If she's going to take her top off, she really shouldn't move around too much.\n\nWait for it on cable - watch it for free. Then you'll have only wasted time, not money."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "nickilancaster",
        "review_rating": "1",
        "review_title": "Really bad",
        "review_detailed_main": "Well i have to say unlike most of you Paris Hilton haters out there i absolutely LOVE her, i think she is so ace, she wears the most amazing clothes and always looks so good and i love her and Nicole Richie in The Simple Life. I am 21 and admire her so much for doing not really anything and being so rich and famous, i wish i could be like her. Now to the movie, im sorry Paris but it was just plain awful, her acting was so bad and it wasn't even her doin the voice overs for her character, what is up with that? The story was so crap i cant actually believe that i watched the whole film all the way through. Well you live and learn, don't watch crappy straight to DVD films."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "LasseLangholm",
        "review_rating": "3",
        "review_title": "One big Paris-Parody... but a hot one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "pink-barbie",
        "review_rating": "1",
        "review_title": "Pledge this!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "nembathekid",
        "review_rating": "1",
        "review_title": "Seriously, I thought this was funny. Really, truly funny.",
        "review_detailed_main": "It still deserves a 1, because it's obviously craptastic, but come on, people!\n\nSomeone who is stupid, but thinks they're great, thinking that they're making fun of themselves because they're \"not really like that\", but it's even worse/better because they really are like that, thus their very own negation of their bitchiness proving it? Best. Joke. Ever.\n\nThere's no plot, no dialog that hasn't been on TV since the 80s, I only wish that they'd paid someone genuinely cool to make this, someone skilled enough to take the mickey as hard as possible without letting anyone who would fire them know, but then, they do that best themselves.\n\nPlus, there's naked chicks."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "mopherrabbit",
        "review_rating": "10",
        "review_title": "Pledge This! The Film that keeps on giving",
        "review_detailed_main": "Pledge This! is only as great as the film industry itself. From the bottom up this is just a spectacular film which deserves nothing but praise. Paris Hilton delivers the greatest performance of her career (yes even better than her jaw dropping acting in House of Wax or the recent film The Hottie and the Nottie). Not only is this Paris best performance ever, but it also rivals the greatest acting performances in the history of this industry. No other actor this decade has come close to the mark Paris Hilton set in this film and I highly doubt anyone else will. Now enough about Paris, on to the film.\n\nThis is a film where acting isn't all that is going for it. Along with Paris Hilton's fabulous exertion of the acting art, there is also an excellent script and on top of that an out of this world director. Lets focus on the script. This is truly a script that will make you laugh, cry and come back for more. The script is so fantastic that the second and third tier characters have the most beautiful lines, that they deliver with absolute care for the art form that only this talented cast could show. The quality of the lines is apparent as well. This movie is not without its fair share of repeatable quotes, which are both clever and deep intellectually. The script is one for the ages.\n\nThe directing of this film is superb as well. Both directors William Heins (also an excellent actor in the film) and Strathford Hamilton (known for his excellent work with The Pact) put their hearts and souls into the crafting of this magnificent film. The choices for the camera shots were nothing short of amazing. It seems as if it spoon feeds you an amazing tale, but is full of deeper meaning, like why am I being spoon fed, just to give an example that corresponds with my original metaphor. They directors make this film work on so many levels. It is a master piece for the unwashed masses but also challenges the greatest minds with deep meaning.\n\nOverall Pledge This! is the best film of 06 hands down no questions asked."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "Is it asking too much for a comedy to be funny?",
        "review_detailed_main": "This movie is three things. The first is it's very forgettable. Nothing happens that is really worth remembering. Secondly it's not funny. I don't remember cracking a smile or laughing once. And thirdly it seems to have been made to capitalize on Paris Hilton and possibly give her a movie career.\n\nTo those that don't know who Paris Hilton is, she's a spoiled rich kid that is heir to the Hilton family who own all those hotels. She's worth a lot of money. And she's tried her hand at lots of things like acting, singing and being a DJ. She's also failed at all of those because her movies, singing and spinning are all terrible.\n\nFrom what I can remember this is a story of a group of girls pledging to a sorority. They're a bunch of misfits and the sorority is full of rich, snooty girls. They're humiliated, made to be the butt of all sorts of jokes and nasty pranks and something something they manage to overcome these obstacles and become better people in the end.\n\nAnd yes, it would have been just as bad if Paris had not been in it. The fact she is really didn't add or take away from anything.\n\nIt's not enjoyably bad. It's just bad."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "jellyneckr",
        "review_rating": "",
        "review_title": "Just when you thought National Lampoon couldn't sink any lower",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "charlytully",
        "review_rating": "3",
        "review_title": "Paris Hilton like you've NEVER seen her before . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Snowraven69",
        "review_rating": "1",
        "review_title": "\"Please make the hurting stop.....\"",
        "review_detailed_main": "This movie is just pitiful just pitiful.I spent so the entire movie crying , rocking back and forth saying \"Mummy please make this pain go away\"(I'm a 48 year old male). I think I now know what the veterans from any of the last hellish global conflicts experienced. I tried to laugh honestly I did , but every time I did my brain just shut down completely. Somebody said the nudity tried vainly to save this tragic excuse for a \"Movie\", but sorry it failed big time. Stay away from this poor poor attempt."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "TheCheese",
        "review_rating": "1",
        "review_title": "College according to Paris",
        "review_detailed_main": "I have seen many movies in my life, and some awful ones as well. But somehow the worst movies I saw still got ratings between 3 and 4 on IMDb. So I checked out the bottom 100 and I was curious how bad a movie could be. Since Paris Hilton stars at least 4 of the 100, this movie seamed to be a good choice. And it was. I managed to get though the whole 90 minutes, but not without pauses to reanimate my brain.\n\nSo what is the problem with this movie?\n\nStory: It is sort of a simplified \"Revenge of the Nerds\" storyline, if that movie was to complicated, check this one\n\nActing: Paris Hilton is \"playing\" a bimbo with very rich parents, interested only in fashion and style. Amazing how she does that. To be in a sorority, I would say you need to go to college as well, and actually we see 2 scenes in a classroom. One class on fashion, in which a teacher is explaining something about Dolce & Gabanna, the other is on Kama Sutra. College according to Paris.\n\nTargeted audience: Jokes are maybe funny to <12 year olds It has a strong sexual content, both verbally as well as visually. In many countries you'd have to be 18 to see it You would think it is a movie for girls, since it is all pink and fairytale like situated, but that does not match the shots of nude girls and lesbian insinuations.\n\nSo what do I think about this movie? It is probably funny if you are a 12 year old boy, and manage to get a hold on it and secretly watch it with your first girlfriend. For every other sane human being, abstain from this thing, or you might suffer irreversible brain damage.\n\nFor me it is a new baseline for my movie scale, I will need to rate some other movies that I rated 1 before up, because they were way better than this. Hopefully in a few weeks I will be able to do simple maths again.\n\nA well deserved 1/10"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "lorandgyorgy-96671",
        "review_rating": "1",
        "review_title": "Paris Hilton Seal of (bad) Quality",
        "review_detailed_main": "Plotless, nonsensical, disturbing, disgusting, annoying, poorly acted, unfunny."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "vip-danii",
        "review_rating": "1",
        "review_title": "I Was Forced To Watch This",
        "review_detailed_main": "Trust me, I would never see this movie on my own initiative. Having seen a couple of Paris Hilton movies before, I can tell you that watching this annoying, ugly, pigeon-faced, arrogant, dumb skank trying to act, is my idea of torture.\n\nI got to watch this atrocity when I picked \"dare\" in a \"truth or dare\" game. And let me tell you: it *was* torture. I think this has to be one of the worst movies ever made, and I mean it. How dumb can a movie get? Not much dumber than this, I assure you.\n\nI think I lost at least 10 points off of my IQ by having to sit through this brain-damaging crap of a film.\n\nWhat can be worse than a dumb movie? A dumb movie that takes itself seriously! Believe it or not, the makers of this sh*tfest are actually trying to convince the viewer that this is a real movie. Not fooling anyone, ofcouse. This is a pathetic *parody* for a movie, starring the dumbest and ugliest bimbo I have ever seen (close second is Jessica Simpson, but at least she isn't ugly, unlike Pigeon Hilton).\n\n\"A beautiful sorority president\"? Are you kidding me? Have they seen her face? And the crackwh*re looks at least 10 years older than her character is supposed to be. And who produced the script for this stinker? Hilton's intellectual equal, it seems.\n\nUrgh, awful. Beyond awful. Only brain-dead imbeciles could possibly enjoy something as crappy as this so-called movie."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "jacobjohntaylor1",
        "review_rating": "1",
        "review_title": "total crap",
        "review_detailed_main": "I am so glad to see I am not the only on who can tell this is crap. Still this is such an awful movie that 1.9 is overrating it. This movie is not funny. It is just gross and stupid. The story line is awful. Good actors wasted there time being in this awful movie. This movie is a pieces of pooh pooh. Ghostbusters it a funny movie. And this is just pooh. This is not a 1.9. This is a 1. There are lot of hummer in this movie about pooh pooh. And that proves it is pooh pooh. Ghostbuters II is a funny movie. And this is just pooh pooh. Do not wast your time. Do not wast your money. Do not see this movie."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "TightheadProp",
        "review_rating": "1",
        "review_title": "Wow... just wow",
        "review_detailed_main": "Horrific movie.... bad, bad. For the life of me I can't understand how this did not get shelved after seeing the final product.\n\nSomeone actually watched this and thought it worthy of movie material releasable to the public, that person should be fired and never allowed to even see a film again.\n\nSomething tells me that Paris wasn't acting, that this character is pretty close to the way she is in real life.\n\nI enjoy bad movies, but not this bad. This is something a 13 year old kid with a hormone issue would write.\n\nParis needs to stick to looking at her average face in a mirror and stay away from the screen."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "raregold95",
        "review_rating": "9",
        "review_title": "Funny Movie Made Me Laugh",
        "review_detailed_main": "I saw the movie at the premiere the other night and it was really funny. Some of the stuff was kinda gross but I couldn't help laughing anyway. Paris Hilton is really pretty and she is president of a sorority which is perfect for her because she always seems like she's in charge of all the fun stuff. I don't want to ruin all the jokes for everyone but there are plenty of them, especially the one with Paris's boyfriend and her dog. I just almost died. lol There's a guy in there that played a Nerd and he was kinda cute, heck all of the boys were pretty cute and so were the girls. The scenes at the pool made me want to be there because everyone looked so good in their swimsuits. South Beach looks really pretty and I'm going to go visit it sometime. I think I'm going to see the movie again tomorrow it was so much fun."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "metalhaid-780-968842",
        "review_rating": "1",
        "review_title": "OMG...this is the WORST MOVIE EVER.",
        "review_detailed_main": "I wish I could give this a negative 10. This was the worst waste of time ever. I want to sue the writers for an hour of my life that I will never get back. What's so bad about it? Where to begin-the ridiculous attempts at comedy, the absolutely evil mean bitches in this POS, the completely hateful protagonists...I don't think this is a spoiler by saying Paris Hilton is a HORRIBLE actress and an even worse narrator. The men in this movie are pathetic and contemptible. One longs for Freddy Krueger to come crashing through the sets and start cleaning house--like some avenging angel of justice, setting the scales straight in the direction of real life. The writers have the lion's share of blame for this atrocity. The Paris character should have been held up for the ridicule that she is held in by the rest of the world. Where are the drug jokes? Where are the porn flick jokes? Why didn't they write in a scene where drugs fell out of her purse and she claims they aren't hers? But we all know the writers are just the pawns of the producers and unable to accurately portray the Paris we all know and hate. Well, EFF YOU, Paris. You are a carbuncle on the anus of the world."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Stitchy123",
        "review_rating": "1",
        "review_title": "please.. I have a headache.. anyone got some Paris-cetamol?",
        "review_detailed_main": "Great movie; as an example of how bad a movie can suck.\n\nYou'll get some masochistic enjoyment watching this 'train wreck' of a film. Once you've watched it, come back here and read some of the 'loved it' reviews.. you'll laugh your butt off. (obviously, many were written by the studio.. how could anyone say Paris does a great performance in this?!) Won't kids who have Paris as a role model end up watching this gratuitous T&A film? Won't somebody please think of the children? Paris looks disgusting, her lighting and makeup is poor and she doesn't do well to look young or sexy. She is putrid. Her performance is terrible, she can't deliver lines or never rehearsed (her dull performance in 'One Night In Paris' was better).\n\nThere is a huge amount of failure in this film. It really is painful to watch. Please, Paris-cetamol for my headache anyone?"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "jjwilliamshaha",
        "review_rating": "1",
        "review_title": "Paris Hilton in a movie! need I say more?!",
        "review_detailed_main": "Okay first off we're looking at the dark side off national lampoon's. which seems to emerge in constantly in the form of straight-to-DVD cheesy comedies! given this fact, i expect nothing spectacular when i see national lampoon's above the title of a movie that never hit theaters. there is sooooo much to say about this piece of garbage excuse for a movie. for starters it has the staring role of Paris Hilton, yeah, things are looking bad already, that just guarantees you a bad movie. another thing is that this movie features no productive story line whatsoever! seriously, there's barely a plot!! and the jokes. ugh!! the jokes are just awful and cheesy and pathetic, it feels like the jokes were written by an immature 7th grader. there is also POINTLESS narration by Paris Hilton that in no way applies to the story! bottom line this movie is just plain garbage, it should be used to torture people!"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "nubletslive",
        "review_rating": "1",
        "review_title": "Honestly the worst movie i have ever seen",
        "review_detailed_main": "I hold absolutely no doubt in my mind that this film was and will continue to be, the worst film ever made in the existence of mankind. This movie was so unsaveable, even a boatload full of topless college girls couldn't make me ignore my sudden urge to drown in my own blood. I was forced to give this movie a 1/10, while it deserves a hell of a lot less.\n\nFirstly, Paris Hilton. She is, without a doubt, the worst actor ever to get paid to act. It is absolutely disgusting that someone with as little talent as this can make anything out of their lives. She is also the most ugly 'hot' girl i have ever seen. If i had a choice between getting with her and that fat chick, the fatty wins hands down Secondly, plot. This was even worse than Beta House (great movie). Bucket of S***, gtfo.\n\nThirdly, in most movies, the audience is supposed to become attached to at least one character. i found myself wishing they had all never existed. The funniest moment of this whole movie was realizing that it was meant to be a comedy.\n\nFourthly. As i have come to expect from dumb idiots (Paris) worldwide, there is so much error in the film it is unbelievable. Firstly, you stupid motherf****r. GAMMA IS NOT A G. AT BEST IT IS A Y. Unforgivable, RETARTED ERROR. SELF EXTERMINATE NOW The s***tiness of this movie enrages me, and i will now go and half-drown myself to try and forget about it. Good day."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "deadlyhellraiser",
        "review_rating": "1",
        "review_title": "Absolute. Crap.",
        "review_detailed_main": "Never before have I seen a movie this bad - and it's not because Paris Hilton is the main character though yes, she can't act. There's no plot to actually follow - you know, that makes SENSE and I couldn't even muster a chuckle, which is strange considering I can usually get a laugh out of something - I couldn't even get a laugh out of how pathetic it was. It was completely idiotic. If you thought some of the Hollywood spoofs were bad, this one takes the cake in completely sucking. Never before has a movie been so completely horrible that i've actually bothered to leave a review saying how completely shite it was - in other words, don't even bother watching it. Not even worth a minute."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "the_first1",
        "review_rating": "1",
        "review_title": "90 minutes too long",
        "review_detailed_main": "Agree with the previous comment that a lower score than 1 is needed for this trash. Its a waste of time and an hour and a half of your life you'll never get back.\n\nThe first minutes sum up the movie. Paris arrives in a limo to put paper bags on the face of girls who are 'not hot'. And they nod stupidly, awestruck by this amazing beauty. This scene seems to set the stage and things only go downhill from there.\n\nThe plot is ridiculous and the acting is awful. On the plus side, the video were vibrant and full of color, the shots were in focus, and there wasn't any noticeable camera shake. So the camera men certainly earned their keep, pity the rest of the crew didn't."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "drfunke",
        "review_rating": "1",
        "review_title": "omg. wtf?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "pamyyaywtf",
        "review_rating": "1",
        "review_title": "What...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "pradoisnard",
        "review_rating": "10",
        "review_title": "Esse filme é bom sim!",
        "review_detailed_main": "Filme muito legal, não precisava derrotar a Paris. Aff"
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "OhMyGreatScott",
        "review_rating": "5",
        "review_title": "Typical Teen Flick. OMG! Watch it at a sleepover!",
        "review_detailed_main": "First off let me say that I like Paris Hilton. She's not a horrible actress, but she didn't do too spectacular either. This movie is like a cross between \"The House Bunny\" and \"Revenge of the Nerds\". Victoria English (Hilton) is the sorority president of \"GAMMA GAMMA\" who lets the \"campus geeks\" (which most of them really don't look that geeky) pledge her sorority because it adds \"Diversity\" to her group and will get her on the cover of FH magazine as soon as her sorority is chosen she publicly humiliates the pledges and gets rid of them. The rest of the movie is about the geeks getting Victoria back. Ms.Hilton's best performance was still in Repo!, but this is a good time passer with a few good laughs. Not as bad as \"Bottom's Up\" that was complete trash."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "idb-969-391914",
        "review_rating": "1",
        "review_title": "A bit of a laugh in parts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "pcernea-1",
        "review_rating": "1",
        "review_title": "Unfunny and Degenerate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "tanqianpeng",
        "review_rating": "1",
        "review_title": "Pledge This is not my movie.",
        "review_detailed_main": "Normally, I can tolerate a slight bit of celebrity stupidity until I say: \"Wait a minute! I just watched the most vapid movie with exploding toilets and collecting used condoms!\" Paris Hilton plays Valerie English, the most pampered character of the movie. This movie takes stereotyping to a whole new level. The overweight, the Indians, the Drag Queens and the homosexuals are derogatory in this movie! Even by normal teen pandering schlock, this movie is filled with incredibly coarse sex jokes, that you would be wondering whether it's an adult movie or not. I prefer not to view this movie, but it still left me with a message, \"Money can make you pampered and self indulgent like Paris.\" If money makes me like that, I would move out of my house, give my money to the bank, and stay homeless for the rest of my life! Paris was so grossed out by the final result, and she decided to boycott her own premiere due to nude scenes. I think she made sense. Pledge This is just vapid self- indulgent celebrity white noise."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "lambdatessellation",
        "review_rating": "1",
        "review_title": "Extremely confusing...",
        "review_detailed_main": "This film was extremely confusing. It didn't have any direction, the story was not concise, and the acting was poor. They invested more time in getting as many on screen as possible than they did on a decent film.\n\nDefinitely was a comedy because I was laughing myself ill watching how terrible this film is. If you want to watch a terrible film then this is definitely the place to go."
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "Matthew_Capitano",
        "review_rating": "10",
        "review_title": "I Love Paris Hilton !!! And She's Gorgeous !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "juliancrane22",
        "review_rating": "8",
        "review_title": "It wont win an Oscar but its not terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0417056",
        "movie_name": "Pledge This!",
        "movie_rating": "1.7",
        "review_username": "andy-2047",
        "review_rating": "10",
        "review_title": "It was brilliant!",
        "review_detailed_main": "I just watched it and personally I thought it was a great comedy. I had heard the bad reviews but still gave it a chance. Paris Hilton really shows that she can act. I recommend watching this film. I watched it with my friends and we thought it was hilarious. If you like films like American Pie, Borat and Scary Movie this film is definitely worth watching. If you're a bit sceptical about watching it because of the bad reviews just watch it yourself and YOU can decide if it's good or bad. I'm a big Paris Hilton fan and I'm looking forward to seeing her next film \"The Hottie And The Nottie\". If it's like this film I will definitely go to see it."
    }
]