[
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "kunder-akshay3",
        "review_rating": "8",
        "review_title": "Ponkshe ht Hunterrr all the way",
        "review_detailed_main": "Hunterrr is not all entire sex comedy start to end, in fact i would rate Hunterrr ahead of many of that genre like Kya supercool hain hum, Grand masti etc. Highlight of Hunterrr is the way the topic has been dealt and how we share it with others.\n\nGulshan Devaiah as Mandar Ponkshe(Vasu) is fun to watch. Radhika and Sai are impeccable.Supporting star cast along with it make it brilliant. Watch out for characters like Mandar's two cousins.\n\nWhen i first saw the trailers i thought it would get banned. This has been the behavior of censor board these days but very happy that the content of Hunterrr got passed. Directed by Harshavardhan Kulkarni who is the real hero here ,Hunterrr will make a mark of its own with the youth as they will relate more to Hunterrr. Kudos to Phantom productions backing this project.\n\nWill go with 8/10"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "murthi-srikanth",
        "review_rating": "8",
        "review_title": "Probably an example to other bollywood movies",
        "review_detailed_main": "OK so this movie doesn't deserve an 8. But i'm still gonna give it that for a few reasons. This movie clearly looks like it was written for stage plays and mainly enacted by stage actors. This movie starts off as a cheap sex comedy and then adds surprising amount of emotional depth. What i don't understand if this movie with its low budget and no big named stars with a crass topic can do that, then why do these big budget movies suffer from being totally nonsensical from beginning to the end. Why do their emotional scenes feel like pure melodrama. There is a lot of good talent here and i wish they can get this cast to do a good movie with a strong story."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "kichdi",
        "review_rating": "8",
        "review_title": "Radhika & Gulshan rock",
        "review_detailed_main": "This was the first movie which I saw Radhika Apte act, she has such a nice cosy voice, high sex appeal & looks to be the best actress of this generation with her high quality acting. He looks so real & girl next door. Gulshan just takes to acting like a duck taking to water. Gulshan is superb as Mandar the Vasu (womanizer), his unsure ways of approaching unknown girls & invariably coming up trumps was superbly portrayed. Hunterrr is a superb sex comedy minus the over the top double meanings & crappy acting like in Masti & Grand masti. Hunterrr rocks because it is so realistic & does not go overboard throughout. All the star cast did decent job but the lead pair were simply superb. The drawback of Hunterrr is it is not a seamless movie, there are so many flashbacks varying from few months to few years, this all could have well been avoided. In overall it is a highly recommended movie."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Delicious Sex-Comedy with a Terrific Gulshan Devaiya!",
        "review_detailed_main": "Hashvardhan Kulkarni's 'Hunterrr' is raunchy, dirty yet irresistible. This one's A Delicious Sex-Comedy, that offers laugh & also emotional depth. Its daringly different & Gulshan Devaiya is simply terrific in the central role.\n\n'Hunterrr' Synopsis: A sex addict recalls his lustful past before he plans to marry a women, who offers him love, rather than lust.\n\n'Hunterrr' works because the Writing is mostly strong. Kulkarni's Screenplay, which shifts back and forth, exploring the life of its extremely horny Protagonist, is enjoyable! The best bits come-up in the protagonist's past, be it his escapades with a feisty married women or with his college girlfriend. Yes, the romantic-track, which is the most prominent aspect of the story, also works, but at times, the humor falters. But overall, Kulkarni's Screenplay is unabashedly sleazy & some of the dialogue, are priceless!\n\nKulkarni's Direction is pretty good. Cinematography is picture-perfect. Editing is fine, although the film is a bit too lengthy (142-minutes). Some trimming was needed. Music by Khamosh Shah is in sync with the film's mood.\n\nPerformance-Wise: Gulshan Devaiya is the life of 'Hunterr'. The talented actor enacts the sex-addict with remarkable conviction. He makes a perverted character relatable rather than repulsive, all thanks to his superlative portrayal. This is a knock-out performance, in every level. Radhika Apte is wonderful, yet again! What a performer! Sai Tamhankar is extra-ordinary & despite limited screen-time, she brings a fabulous color to her character. Others lend excellent support.\n\nOn the whole, 'Hunterrr' is a joyride! Go, have fun!"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "De-Tabooing Sex. ♦ 60%",
        "review_detailed_main": "Indians are wary about sex. And there's a great chance that some of you readers may have problems with me including the three letter word in the summary. Well, the film is basically a sex comedy which opens the topic and makes its audience dive into everything that comes with it (no pun intended).\n\nIt is the story of a man Mandar (Gulshan) seeking sexual liberation in a world (or country, shall I say?) where showing affection in public is forbidden. Since he reached puberty, Mandar has always been a curious lad who takes fancy in women and sex and masturbation. His flings switch ON and OFF as he seeks carnal knowledge every day like if it is a necessity like emptying one's bowels. He is just like an ordinary kid who wants to know things. But these escapades are not without its dangers as Mandar learns the hard way. The premise is brilliant and for Bollywood, a big step in the genre. It is in all ways superior to another film that comes to mind - Mastram (2014), a candid film about porn writing.\n\nThe non-linear screenplay is fun; chronicling the protagonist's life from his childhood days when a naughty Mandar starts responding to his \"other basic needs\" to the days when he visits the video parlor shops to the college days when flings and scoring are all the rage. These sequences are shot beautifully with montages that streamline the story marvelously. It throws light about the perils of two distinct features: one, the danger of indulging in an extra-marital affair, and two, the complexities of pre-matrimony when dealing with an eventful past becomes a problem amongst the to-be-bride-groom. It amazes one to learn that the writers have sampled original references in their fiction which makes it look like it is a real deal. One can easily relate to the character if he's being true to himself. Let me clarify, the film doesn't break the taboo; instead it tries to permit and attach it to a normal life. Of course, adults are not very present in this mission, otherwise the case would've been different. Sex will always be a taboo in India, but it is out of the scope of this review.\n\nAlthough, there's a paradigm shift in the story when the joys of sex comedy turns into a drama about relationships. Maybe it was intended, but there is a chance that the audience, divided into two, may receive it rather critically. It will appeal the niche audience, the type that will be able to relate with the characters, but unfortunately even the drama may not entice the majority rest of the audience, for the screenplay doesn't offer what it may have promised. Nudity and actual sex are only suggestive and people expecting these may not be able to appreciate the psychology.\n\nRetro music and songs, great camera work, and amazing dialogs are the highlights of this comic venture that is not as sleazy as it advocates to be. Gulshan Devaiah is excellent and totally into the character. I can hardly see anybody else portraying this role so purely as he does. Supporters Radhika Apte and Sai Tamhankar are very good. In fact, the whole cast do a very good job. Because they are directed well, the film will never bore you.\n\nBOTTOM LINE: Hunterrr helps Bollywood transcend into a new level, and could even be called the pioneer of this genre which must be watched in order to be appreciated. 6/10 - Recommended!\n\nCan be watched with a typical family? NO\n\nSex: Medium | Vulgarity/Profanity: Strong | Smoking/Alcohol: Very Low"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "A realistic life account of a sex maniac with an enjoyable first half and a confusing long second, ending on a routine note.",
        "review_detailed_main": "Clearing the doubts about the film's negative impact first, thankfully this is not any cheap, sleazy sex comedy as portrayed by its theatrical trailer, possibly designed with the only intention of grabbing some instant attention. Hence giving the project its deserving due, yes this is not any milestone kind of a film in this particular genre. But it still remains a mature take on the subject revolving around a character who has grown up thinking about sex alone instead of love and is now suffering due to the same in his later years heading towards the middle age.\n\nHUNTERRR begins on an interesting note with a series of flashbacks coming repeatedly in the narration and its first 30-40 minutes realistically depicting the age of adolescence in an entertaining comic manner setting a fine premise. It beautifully takes you back in the 80s in those times of 'Adult Video Parlours' running illegally, tickets being sold in black and cinema being the only entertainment for the people from all age groups. As the main protagonist grows up to be a college going boy, he teaches you a new word \"Vaasugiri\" and turns into a hunter of girls/women looking for some casual sex. The only erotic scene is served just before the interval and overall the film makes a decent impact on the viewer mainly due to its unexpected mature take quite different from the cunningly compiled trailer having a completely different vision of a B grade movie.\n\nAdmitting the vulgarity, it does hurt you in a scene where the young boys are trying to touch the middle aged ladies in the market as their private game and the obscene suggestive gesture shown in its publicity poster. Yet as a whole, the honest biographical tone doesn't demean the women, who actually turn out to be an equal partner in the crime too representing their bold new-age avatar in its various sequences.\n\nHowever, as usual the light-hearted feels gives away to a tiring repetitive run in the film's second half. And we get to see a quite slow, confusing and too long narrative towards the end that ideally should have been summed up within a two hour format. The last hour sadly puts it back into the category of just a well-intentioned attempt that shies away from trying anything experimental in its climax that could have been its highlight as a pleasant shock. Probably (debutant) writer-director Harshavardhan Kulkarni got caught in the dilemma of how to end the film, that doesn't put it in the category of a too mature or an artistic take on the subject finding fewer takers. He surely had got the opportunity of making an off-beat gem moving ahead of all those cheap sex comedies making 100 crores, but couldn't maintain the pace and the entertaining factor continuing in its over-lengthy & monotonous second half as required.\n\nHaving said that, I would still like to praise him for a fine effort made, not falling into the trap of using the sick tricks of the trade when it comes to such 'sex-based films'.\n\nFollowing the 25 years life span of its key character, HUNTERRR gets its much needed lift from the script and dialogues that do not depend upon any cuss words at all. So there are no 'Censor beeps' heard in the film surprisingly which certainly needs to be counted as a rare appreciable merit in the current scenario. The minimally used songs are just fine (composed by Khamosh Shah) making it as an interesting soundtrack particularly due to the numbers sung by Bappi Lahiri and Amit Trivedi (penned by Swanand Kirkire). Plus the background score certainly provides a great support to the film along with its art-direction & cinematography. But on the other hand, a better editing could have helped a lot since moving 'back and forth in time' starts irritating after a while, putting it frankly.\n\nIn the performance section, HUNTERRR truly belongs to two people alone and they are Gulshan Deviah as Mandaar and Radhika Aapte as Tripti playing their respective roles brilliantly. Gulshan displays a fine sense of comic timing with an emotional sincerity too that doesn't let the viewer hate his 'negative' character of a 'sex- maniac' and Radhika delivers another lovable polished performance winning the hearts post BADLAPUR. So the film deserves to be seen for these two actors alone if not for anything else. In the supporting cast, Sai Tamhankar provides the erotica real-well, Veera Saxena makes a decent debut with a comfortable ease and Sagar Deshmukh truly does a noteworthy job in his few scenes coming after long gaps.\n\nIn short, though the subject is disturbing focusing on just sex alone, yet the film deserves to be rated as a contributing step in our progressive Hindi cinema that doesn't bow down to the usual cheapness planned for some quick box office returns. Its not a milestone alright but has it visible merits and a mature take on the subject too with some outstanding realistic performances forcing you to admit the harsh truths of our questionable real lives shamelessly.\n\nAnyway, ending on a different note, HUNTERRR made me recall one of my favourites Hindi cult classics that also revolves around the different phases in a man's life and his loving relationships with three different women teaching him the meaning of love. The film was showman Raj Kapoor's most beloved child MERA NAAM JOKER released in 1970.\n\nBut perhaps due to the changing times & mindsets, where MERA NAAM JOKER focused merely on heartfelt emotions, love and trust, HUNTERRR solely emphasis on sex and one night stands alone representing the inevitable change around us in the 21st century. So forgetting its misguiding trailer, do give it a try as a mature adult comedy rising much above the films we have earlier seen in this controversial genre."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "dr-saubhikghosh",
        "review_rating": "9",
        "review_title": "a refreshing change from stereotype adult comedies...Absolutely awesome",
        "review_detailed_main": "Hunterrr : a refreshing change from other stereotype adult comedies. Direction was absolutely flawless with a non linear screenplay.The entire cast did a wonderful job with stunning performances from Gulshan Devaiah,Sai Tamhankar and Radhika Apte. A mind blowing and unconventional soundtrack with coming of age lyrics; and a very different and matured take on the subject of premarital sex and arranged marriages. One of the best comedies i've seen in recent times. In the end you will be left wanting for more though the runtime of the movie is a little more than expected. A perfect movie if you want to chill out and have a good time. 9/10 stars."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "sesht",
        "review_rating": "",
        "review_title": "Deceptively more than the sum of its parts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "akshay-ak-kumar",
        "review_rating": "6",
        "review_title": "A time pass sex comedy",
        "review_detailed_main": "Considering the low quality of sex comedies Bollywood churns out every year, Hunterrr is very refreshing to watch. Yes, it does objectify women but unlike the usual sex comedies, it is not stupid and low brow.\n\nGulshan Deviah is Mandar Ponkshe, a middle class guy in his mid 30s. He is not your usual Casanova. He as the title suggests is a hunterr who waits patiently for the kill. He is not afraid to talk abt it to his friends and admits that he is a sex addict. His life finally changes when he meets Tripti played by Radhika Apte and now he wants to stop everything and marry her. But can he ?? As they say old habits die hard.\n\nWhat I liked the most about the film is its characters. Starting from Mandar to Tripti to his family and friends and even the women he has affairs with are real and believable. You feel you know these people when you see them on screen.\n\nThe writing for most part is extremely good. There are some hilarious dialogues and scenes that stand out especially in the 1st half. The 1st half is a roller coaster ride as we seen a young Mandar slowly turning into Hunterrr.\n\nIts however the 2nd half that where the fun slowly disappears. We have certain sequences that don't add value to the film. Also, I felt the film is a bit long and should have been at least 15-20 mins short. Plus some of you might get lost when the story keeps travelling back and forth in time.\n\nBut why I recommend one watch Hunterrr is because of Gulshan Devaiah. Devaiah is fabulous as Mandar. Mandar's character is someone whom he should be hating as he keeps on playing with women throughout the film. But we start sympathizing for him is becausse of Devaiah's performance. He is brilliant and plays the role of an 18-19 yr old as well as a mid 30 yr old with ease.\n\nRadhika Apte is superb as Tripti...a working women with a past and who is still in doubt about her future. The rest of the cast is perfect including Sai tamhankar who plays the naughty housewife.\n\nHunterrr could have been a brilliant film. But the writers and Director miss the bus. But its still worth a visit."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "sourabh-aryan",
        "review_rating": "9",
        "review_title": "Simply Hilarious ride all d way !!!!!!!!!!",
        "review_detailed_main": "Hunter is genuinely refreshing stuff with crispy dialogue , awesome moments which are not only funny but will give u goose bumps for sure , the best part was obviously the childhood part where even a deadliest looking dare looked cute , although i did not no like the music at first but it was been made for the movie , it was used in the movie like punches. There is very limited skin show unlike other sex comedies ,practically no double meaning dialogue , to be honest the film is well above the standard of typical Bollywood sex comedies , hope it will start a new trend of different kind of sex comedies in Bollywood.\n\nGo for it guys !!! A cult is waiting for U !!!"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "yuvrajjuneja-59021",
        "review_rating": "7",
        "review_title": "Hunterrr is a king of Sex-Comedy movies!",
        "review_detailed_main": "Hunterrr is the best ( Sex-Comedy ) movie. It's not Worse Film Like \"Masti Series, Mastizaade, and Kya Kool Hai Hum Series\". That All ( Sex-Comedy) movies was wants To Get Disaster and Only Hunterrr wants to get Seper Hit🔥"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "kaku-abhi",
        "review_rating": "9",
        "review_title": "Will be a cult classic one day.",
        "review_detailed_main": "This is my honest opinion, Bollywood is still isn't ready for such films. One of those films which are way ahead of their time. Storyline is perfect, a smooth ride which takes you from childhood memories to adulthood. It's a unique concept and writer/director has perfectly executed his job. Two things which blew my mind were casting and music direction. Gulshan has always been an underrated actor according to me and we all know Radhika's caliber. Special mention to actors who played Kshitij and Jyotsna, they totally did justice to their characters. Young Mandar, young Kshitij and young Dilip, loved to see you all, you all must have a great career ahead. Speaking of music, perfect time of every track in the movie. Amit Trivedi will make you emotional if you have lost a dear friend too. All in all, a must watch. I was shocked to see an IMDb rating of 7. This movie will definitely be a cult classic. Maybe in 2060, people will fall for it."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "ahegde3149",
        "review_rating": "6",
        "review_title": "The raunchy adventures of Hunterrr...",
        "review_detailed_main": "Hunterrr is a fine sex-comedy boosted by great performances and dialogues. It is way above the league of typical Bollywood films in the genre such as Grand Masti or Kya Super Kool Hai Hum. The writing is quite strong and has good balance explicit jokes and relationship drama. Gulshan Devaiah plays Mandar Ponkshe aka The Hunterrr or 'Vaasu' as he calls himself, meaning a person who cant control sex and does it whenever possible without thinking about the consequences. We follow his adventures from his puberty to his current relationship which is quite a mess. There is a lot of back and forth switching of timeline in the screenplay which I feel was effectively done. We see his relation with 3 women played elegantly by Veera Saxena, Sai Tamhankar and Radhika Apte. The actor playing the young hunterrr has also done fine job and the whole childhood memory part I liked the most in the film. The acting is first rate plus the retro music and songs are thrillingly enjoyable. Still, the pacing is a bit slow and the run-time of 140 minutes felt a bit too long. It loses grip in second half after a strong first half. The entire run-time is not a sleazy wild ride, there is sentimentality and romance mixed up with an interesting yet predictable climax. In the end, Hunterr is good enough for some laughs and to relish the excellent performance of Gulshan Devaiah who does great justice to character of Hunterr making us like him despite his deeds. I think Hunterrr is a cult hit!\n\nRATING: [3/5]"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "KunvarAishwary",
        "review_rating": "3",
        "review_title": "Frivolously Humorous and Unattached",
        "review_detailed_main": "Indeed, when one looks at the concept of the movie, one does envisages a not much trodden storyline. Yes, it starts off justifying the above stated with a non-linear yet binding and interesting representation of a flamboyant character. But as the story moves ahead, the whole plot starts to become repetitive with protagonist's casual flings appearing again and again, with modicum of purpose for the plot. Also not even completely a comedy film as well, other emotions are shattered around, but these emotions hardly get across my mind when I try to connect them to the whole story. Stretched second half, tangled in irrelevant characters and acts. Would have ended up on the ebb of the rating charts for me, but the last 5-10 minutes came to the rescue with a little sensible talk. Recommend it for passing time, not in the league such as of BA Pass."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "ankoorjha",
        "review_rating": "7",
        "review_title": "Bad ending",
        "review_detailed_main": "The ending for me made no sense. He did cheat on her. He is the biggest red flag in a relationship lol. I know he is not the good guy in the story so he shouldnt have been ended that way. Still most of the movie was very good so I gave it a 7."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "nadkarnisumeet",
        "review_rating": "6",
        "review_title": "A decently made sex comedy.",
        "review_detailed_main": "Hunterrr review :\n\nHe calls himself Vaasu, an expert in getting laid by smelling the needs of a woman (\"Vaas leneka\", he advises). Meet Mandar Ponkshe (Gulshan Devaiah), a lower middle class Marathi lad with an uncontrollable sexual libido and a natural charmer of woman in all shapes, size and status (I mean marital). Hunterrr, with 2 extra Rs possibly for numerological purpose, chronicles his sexual adventures from childhood to maturity. Get ready then for an unpretentious coming -of -age sex comedy with some fine performances from its core cast.\n\nDebutant director & writer Harshawardhan Kulkarni gets the Marathi milieu right and the screenplay offers a few good moments. Like Mandars first experience in a hostel room and a surprise meeting with prospective in-laws in supermarket are hilarious. However, after a point, Mandar's exploits get repetitive. Worse, the non linear narrative taking place in 3 (or was it more?!) different time zones becomes irritating for the viewer. A linear storyline would have worked better, maybe! Also, Mandar's school antics and hunt for porn are somewhat reminiscent of the infinitely superior Marathi film \"BP: Balak Palak\" released a couple of years back.\n\nComing to the lead cast, it is to the credit of Gulshan Devaiah that he keeps Mandar Ponkshe's character likeable without making him loathesome, something an actor of lesser calibre wouldn't have been able to do. Its a finely nuanced performance. Marathi ladies Radhika Apte (fresh from her 'Badlapur' success) and Sai Tamhankar are efficient performers and they lend adequate charm to the enterprise. Radhika Apte as the free spirited fiancé is first rate. Sai has performed some bold scenes with solid confidence.\n\nThe final output is a sex comedy not offensively bad and senseless as 'Grand Masti' or 'Kya Kool hai Hum'. But still, Bollywood is miles away from getting its own 'American Pie'.\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "anindyakumarverma",
        "review_rating": "9",
        "review_title": "I will take this over any and every \"Family Proof\", \"Safe Comedy\" or \"No-Brainer\" movie out their.",
        "review_detailed_main": "A lot of core things it said are true and are in no way a wrong depection of any thing. Some things might be a bit not \"Family Proof\".. but that dosent mean its a bad movie.\n\nOnce stuff like these happen to you or people around you... you might be able to relate to them i guess....\n\nAnyway acting was awsome. direction was awsome . Story awsome. all in all i will give 4.3/5"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "Nand2Tetris",
        "review_rating": "8",
        "review_title": "Gulshan is a guy to watch out for",
        "review_detailed_main": "Bollywood is really bad at certain genres. Sex comedy is one of them. More often than not, Bollywood goes for the vulgar for the sex bit and for the comedy, it goes for the cheap. So we normally have bad actors and skimpily clad bimbettes, mouthing dialogues replete with innuendos in a chaotic confusion that claims to be a plot. Hunterrr is a pleasant deviation from this boilerplate. The acting is brilliant. Gulshan shines as the \"vasu\" player. Sai plays the sensuous housewife next door albeit in a restrained manner without going over the top. Radhika is great as the blase love interest. All the characters in the movie are believable and have their own story line. The movie is funny and endearing and extremely relatable, unlike the usual fare."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "parth4586668",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "Just loved this movie.. One of best movie.. great tips.. :p :D"
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "sprashanthdummy",
        "review_rating": "1",
        "review_title": "A pathetic and disgusting movie that promotes adultery and uncommitted sex",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "gautam-moharil",
        "review_rating": "9",
        "review_title": "Urban adult comedy",
        "review_detailed_main": "A coming of age story about a guy and his three cousins. The guy is a playboy. A comedy set in urban India. The set piece gags are hilarious. The dialogues are great. A real adult comedy which is rare in Indian cinema. The acting is great and the subtle nuances of the characters are shown beautifully.\n\nThe film is a bit long and could have done with some editing. The sad part is such films don't get a wide release and are only discovered on the streaming platforms. Would like to see more from the writer director."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "akshayin-32127",
        "review_rating": "10",
        "review_title": "Amazing movie.. one which will make you remember moments of l",
        "review_detailed_main": "Very good movie with perfect direction with authentic location and amazing screenplay..watch ir once u will love it.. The music is also amazing with various lovely song as per moment."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "akgp2707",
        "review_rating": "8",
        "review_title": "Great comedy drama with a beautiful natural cinematography",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "dineshprakash",
        "review_rating": "3",
        "review_title": "Just a beginner not a hunter",
        "review_detailed_main": "Main problem of this film is bad characterization. For example title Hunter is too harsh for main lead. Actually he is novice, vulnerable and confused, which are basic minus points of a hunter. He should have been at least over smart. The publicity designer work is superb. They create more curiosity than any other thing of this film. There is just an idea in the name of story. Dialogues by Director, Writer, Mr. Harshvarshan Kulkarni are good at places. Few scenes are innovative, cute and funny, like head shaved boys in school, When main lead meets with girl's parents in shopping mall. Other major drawback is the narration style, they always take the film in flashback and mention the time lapse by supers, so I get confused so many times to connect them, this type of narrating style is good for thriller but stains the mood in comedy genre. Taking advantage of dreams in flashback is many times, it tickles first but then irritates. Promo was promising that this is almost in sex comedy genre but there is no sizzling dialogues or scenes. There were scope but deliberately they preferred to keep it undertone. They could have easily gone for U/A certificate but why did they settle for A, I am quite unable to understand. Movie is slow most of the places. Scenes also give jerky feel. Length should have been less for sure. Emotional note in climax gives some sweet taste at last. Performance wise Gulshan Devaiah as Mandar is fine. Radhika Apte as Tripti is fantastic. Her change of emotions, are very good, especially in the kitchen scene in pre climax. Sai Tamhankar as Jyotsna, is very good. One song \"Don't reject me, I am a learner\" is good."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "coolkunalb",
        "review_rating": "9",
        "review_title": "Very underrated film!",
        "review_detailed_main": "Amazing story, direction and music.\n\nCan't believe I missed this when it released in 2015...such good content was rare before OTT came.\n\nHarshavardhan Kulkarni's direction strikes a balance between humor and heart, creating a captivating narrative. The film's music adds depth to the story, while addressing important themes of consent and open-mindedness in modern relationships.\n\n\"Hunterrr\" is a bold Hindi film that offers a refreshing take on relationships and sexuality. Gulshan Devaiah's exceptional performance as Mandar Ponkshe brings depth and charm to the character.\n\nBeyond its unconventional theme, \"Hunterrr\" conveys a deeper message about human desires, relationships, and the complexities of love. It challenges societal norms and encourages a dialogue about consent and open-mindedness in modern relationships."
    },
    {
        "movie_id": "tt4333674",
        "movie_name": "Hunterrr",
        "movie_rating": "7.0",
        "review_username": "acapulsky",
        "review_rating": "3",
        "review_title": "Disappointed....",
        "review_detailed_main": "If i wanted to watch a sex comedy, i would have watched a Hollywood flick instead of wasting my time with this. I really wish writers could focus more on culture rather than blindly following American movies. American movies portray a different culture and hence are good. Indian cinema should focus more on Indian culture. I have been seeing a lot of these movies lately which kinda point to the obvious fact, writers are confused and directors aren't taking the time to even think about what they are directing.\n\nWith that been said, I think both lead actors did a good job. They were believable to say the least and the actress really has a shot at serious acting should she choose her movies accordingly.\n\nTo sum up, Hollywood produces better sex comedies that are actually worth your while. Stick to making BOLLYWOOD movies India!!!"
    }
]