[
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "The Positives & Negatives. ♦ 61%",
        "review_detailed_main": "While I am awestruck with Varun Dhawan's performance and dialog delivery, I am not happy with the plot because it is too illogical and defies reality.\n\nDavid Dhawana has always managed to make us laugh and with Partner, he had reached zenith. With Main Tera Hero, he collaborates with his son and long-time associate Saurabh Shukla to give out a funny take on crime & romance. While I could relate it to 2005's Welcome, I should agree I was never bored in the first half. It talks about the story of a mischievous boy who travels to Bangalore to get a degree but instead falls in love with a girl. The plot maneuvers to a villain and then to a twist.\n\nCome second half, the fun quotient declines as the plot gets more melodramatic & repetitive. The story also takes damage because the story is seemingly absurd. This drama sequences do not happen in real life nor do they happen in dreams. Only writers can make this up and that is what such genres of films are known for, I agree. hence, a humble 6/10 and it is not the film I am rating, but the genre.\n\nNarghis Fakhri can't act while she's definitely got the hots; Ileana D'Souza is fine, too. Arunoday Singh is good enough. Anupam Kher does a good part and overall, good cast. But the limelight is stolen by Junior Dhawan and I laud his second stint since SOTY. Good job!\n\nBOTTOM LINE: Enjoyable and is one of the few watchable movies released this year."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "WasiReviews",
        "review_rating": "5",
        "review_title": "I didn't like the twist",
        "review_detailed_main": "They turned a pretty fun college love drama into a house drama that if I wanted to see the extremely (and I mean extremely) obvious turns with Nargis liking this guy oh now she likes him and so on and so forth. While De Cruz and Nargis are so hot and De Cruz acted well as the awesome college girl and Nargis as the dumb blonde (she's not blonde but that's what it felt like). If your interested in laughs, weird talking God statues, ok romance and decent acting then this film is for you. Oh and this movie had a kick a*s sound track that's original, Arjit knocked it out of the park."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "vmy2009",
        "review_rating": "5",
        "review_title": "Not awesome but not awful too!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "iamggn",
        "review_rating": "3",
        "review_title": "A Meaningless Plot Involving Goofy Characters.",
        "review_detailed_main": "Main Tera Hero is not at all up to the mark. The movie is another typical Bollywood Rom-com which fails to entertain. It is blessed with only a little number of sequences which possess good humor. Besides this, it just disappoints you. The story tells us about a flamboyant youngster who travels to Bangalore to achieve a degree but instead finds the love of his life before a heap of illogical chaos unleash. Performances are mediocre and some episodes exhibited are awfully bizarre.\n\nThe actors in performance are neither highly impressive nor depressing. Varun Dhawan, in his second film was seemingly fair to middling. Opposite him was the lovely Ileana D'Cruz who doubtlessly managed to make a hit. Nargis Fakhri, who was another integral part of the story line was absolutely unsatisfying. Supporting roles enacted by Arunoday Singh, Rajpal Yadav and Saurabh Shukla were garden-variety. Anupam Kher in a minor role was strictly ordinary.\n\nDavid Dhawan has been successfully managing to provide us with films containing genuine comicality, but over the years, his flicks are getting worse. It was Chashme Baddoor last year, and this year, it is Main Tera Hero. Screenplay was simply absurd. Editing and Cinematography departments have probably managed to hit the spot. Music by Sandeep Shirodkar was slightly above average.\n\nIn short, the movie is silly and nonsensical. It might have worked out for me if the makers would have chosen to enhance the plot equipping it with some sort of basis. Watch it only if you are in love with typical Bollywood entertainers. Elseways, avoid it."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "snaidu422",
        "review_rating": "7",
        "review_title": "A Colorful Nonsense",
        "review_detailed_main": "In the 90's David Dhawan and Govind teamed up together to entertain us with the best of bollywood madcap comedies. These movies had the same logic as the Tom and Jerry cartoon shows, u wanna watch u better give your brain a rest-the movies were entertaining and provided a good laugh as long as you ignored the fact that what was happening on the screen was just non stop nonsense, but what the hell, you were being entertained and you were not being bored and you are stress free.\n\nYears later today, David Dhawan brings his son Varun Dhawan with a similar mad cap comedy which catapulted Govinda to stardom. You have the same jarring colors, the same brainless heroines and a villain who is never to be taken too seriously and above all MEIN TERA HERO has good music, the tapori kind which Govinda excelled at dancing to.\n\nSeenu (Varun Dhawan) is an older version of Dennis the menace and when he is rejected in marriage by an obese girl because he is not a graduate, he embarks on journey from Ooty to Banglore to get a Degree.\n\nOn the way he bashes some goons who try to eve tease some girls and establishes himself as a hero material and not just a comedian.\n\nHe joins a college and woos Sunaina (Ileana De Cruz-with bad makeup) who is in fact being stalked by a police officer Angad (Arunodhay Singh), who bashes any guy who even talks to his girl.\n\nSeenu outwits Angad and takes off with Sunaina, only to witness her being kidnapped. Angad informs him that the kidnapper is Vikrant (Anupam Kher) an international Don located in Bangkok. Vikrant's Daughter Ayesha (Nargis Fukhrey-with bad acting skills) is in love with Seenu and so her father had Sunaina kidnapped to blackmail Seenu to marry Ayesha.\n\nThe movie then heads for a roller coaster ride with laughs galore including a rather funny shiv bajan tuned to the music of badtameez dil.\n\nVarun Dhawan is confident and carries himself well and you can see sparks of Govinda in him in most of the scenes.\n\nArunodhay Singh is funny with a poker face and gives a good performance, especially the anger management scene is one of his best in the movie.\n\nIleana De Cruz would take the award for the worst makeup of the year. The girl was good in Barfi, but gives a kind of kindergarten school kid stage show performance.\n\nNargis Fukhrey with the weird accent tries hard to perform, but drops her act midway and joins Ileana as why the hell do I have to act, when I can expose attitude.\n\nAnupam Kher is the highlight of the movie, the don who says the word in his every sentence thrice because he was from a \"Pahadi Ilaaka\".\n\nMusic by Sajid-Wajid replicates the Anu Malik style of music, the songs are fresh, foot tapping and energetic. The PALAT song says it all.\n\nKudos to David Dhawan for bringing the colorful comedies of yore back.\n\nIf you love tom and jerry, you would love this movie too-please do not forget to leave your brain behind when you set off to watch this."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "mshokhwal",
        "review_rating": "1",
        "review_title": "Not worth your time",
        "review_detailed_main": "I do not know why did I go and see this movie. Its not so entertaining, expected to be meaning less and non-logical like many Indian comedies but still this manages to be worse than that. I regret watching it.\n\nMovie starts with Varun failing in school to join top college in Bangalore and falls for a girl and then it is the story how the other actress comes into picture and is desperate to marry him. As usual love wins. blah...blah...blah\n\nThe movie has very few good moments to enjoy.\n\nAt some point it was kind of boring to watch the two hot actresses. Sourabh Shukla as usual very good to watch with whistle though a short role. Anupam Kher as per the role always does a good job. Shakti Kapoor being the trade mark of Davin Dhawan Raja Babu movies was there for no reason.\n\nOverall a must miss movie."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "Sit Back, Relax, and Enjoy this Hero's Tale in Typical No-Holds Barred, Silly, David Dhawan Style Fun",
        "review_detailed_main": "Reviewed by: Dare Devil Kid (DDK)\n\nRating: 3.5/5 stars\n\nMain Tera Hero\" is a typical madcap David Dhawan comedy, with all the silly fun, rambunctious pacing, over-the-top characters, and zany music that we've come to lover over the years. While it's by no means among his best work, it certainly tells a routine story in an extremely humorous and exuberating manner. Let's just call it for what it is - old formulaic David Dhawan wine smartly packaged by the veteran Director in a new bottle via a contemporary look and the re-invention of his staple comedy hero in an entertainingly modern avatar.\n\nWe get all the typical jokes and gags Dhawan is so well known for; some old and revamped, some new and refreshing, some surprisingly brilliant brilliant, some beyond ludicrous, but all highly entertaining and rib- ticklingly funny. Most of all, we get the quintessential Dhawan hero, neatly packaged and reconditioned in a zesty persona that once again resonates fondly with audiences like the days of yore.\n\nVarun Dhawan displays his histrionics to the hilt and proves to us that he was born to be a true-blue Bollywood hero. He has all the makings of a being a decent actor with strong star-power at the box-office. As to how well his acting skills improve, that's left to be seen, but suffice to say the initial signs are good. Ileana D'Cruz and Nargis Fakhri are present for eye-candy, and Dhawan portrays the oomph quotient to maximum effect, especially in the case of Ms. Fakhri. Arunoday Singh's plays the bullying buffoon act passes muster. The rest of the cast is made up of veterans such as Anupam Kher, Saurabh Shukla, and Rajpal Yadav, and they're all in fine form.\n\nThe plot like in most Dhawan films has a simple humorous premise, constructed together by a series of gags, witty one-liners, slapstick events, and hilariously silly dialogues. What's really invigorating for all Dhawan fans is that the Director seems to have regained his mojo, which had temporarily evaded him after a few cringingly bad comedies and unnecessary remakes since \"Partner\" - his last good effort. As mentioned earlier, this film will certainly not be counted among his best in coming years, but he's at least back in form. Also, for a film of this ilk, it boasts of surprisingly good technical values, particularly in the editing and cinematography departments.\n\n\"Main Tera Hero\" doesn't shamelessly ask you to leave your brain at home in the name of entertainment; that's just plain inane and signals a movie's complete absence of merit from the onset itself. Instead, it gives you an opportunity to relax your brain and enjoy two hours of unadulterated, madcap, fan in David Dhawan's archetypal style."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "prashantgupta2002",
        "review_rating": "2",
        "review_title": "one of the worst movie without story and mind",
        "review_detailed_main": "David Dhawan made this movie for his son and I think it is only for his son not for audience. David worked with Govinda a lot not in this movie he tried to do the same with his son. like Govinda's movies you must leave your brain at home before you are going to watch Main Tera Hero.\n\nStory is noting. Varun has done overacting which is useless. Ileana looking great. Nargis Fakhri's role was not up to mark and it was not her fault. director's main motive was to keep camera on his son and he did the same. Arunodaya Singh is not for comedy his body and acting is for serious role. in spite of her small roll Evelyn Sharma looked gorgeous. when you look this movie, it will remind you many Govinda's movies.\n\nif you are going for time pass only then I suggest you must try something else like Pizza or burger. it will save money and time with much more enjoyment."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "jmoneyjohal",
        "review_rating": "7",
        "review_title": "Its Govinda, No its Salman yaar, nahi boss yeh toh APNA NAHA BACHA HAI Varun Dhawan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "arnavgoswami",
        "review_rating": "1",
        "review_title": "Was this a April Fool's joke ? Cause I didn't like it... AT ALL",
        "review_detailed_main": "watched MAIN TERA HERO ...does having money(a lot of money) is enough to make you a director/film-maker? in Bollywood unfortunately..YES...this \"film\" is yet another example of the sh!t produced by these \"film- makers\" on the name of FILM\n\nSO its has a lousy team of the lead actors..which can't act AT ALL except for the Anupam n few a others(BUT the poor script ruined their talent too)..both of the \"actresses\" can't even speak normally(so forget about their acting)..Varun Dhawan looks nice n puts all his effort still fails to impress(again script has to blame)...their characters defies their own nature(in film) in every 5 minutes esp the supposedly \"villains \"(even cartoon characters remain in their characters for more than that)...THOUGH its plot does not have a loophole CAUSE its made up in a loophole itself... FILM's \"direction\" is so poor that it shouldn't be called direction...YES a few(FEW) scenes can make you smile for a while..BUT they're not enough for compensating 2+hours of your life you'd just waste on this bullsh!t filled with bullsh!t/useless songs\n\n& I can just go on n on about this made by rich crap..so I'll just finish with\n\n_DO NOT WATCH_this crap msg"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "dpratapsingh92",
        "review_rating": "9",
        "review_title": "nice movie with lots of romance and fun",
        "review_detailed_main": "An excellent performance by Varun Dhawan and Ileana D'Cruz but a below average performance by Nargis Fakhri.This will make you laugh all the time during movie but having a average plot.\n\nI thought it was a predictable love story weaved around Varun Dhawan, Ileana D'Cruz and Nargis Fakhri. Before interval, Varun, Ileana and Arunoday's love triangle is in focus, while I wonder when Nargis will walk into the scene. When she does appear towards the interval, we are left wanting for more. The full-on David Dhawan affair starts in the second half, when Varun Dhawan romances both Nargis and Ileana simultaneously.\n\nall though having a lot of twist its a nice experience and full on fun and more just a Paisa Vasul movie."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "rahuljonathan-nair",
        "review_rating": "7",
        "review_title": "Good attempt!",
        "review_detailed_main": "Main Tera Hero (MTH) is a glittering vehicle for star son Varun Dhawan to drive, which he does with practiced panache. However, even more than Junior, MTH has his dad David Dhawan stamped all over it. The plot is familiar Dhawan territory - one boy, two babes, a mansion and many clowns - but with new landmarks, from plunging bikinis to lip-glossed kisses, thrown in. Those seeking movies with meaning, note - Main Tera Hero is a pav bhaji picture, quick, spicy, hot. It has the depth of a comic strip but it also has its neon-shaded fun. For those who want a light laugh, here's your boy. On the whole, MAIN TERA HERO is a wild, wacky, madcap entertainer that has the unmistakable stamp of the master of entertainers -- David Dhawan. An over the top plot, humor quotient and performances are three aces the film stands on. The film should work well with admirers of typical Bollywood masalathons, also because Varun Dhawan pulls off the act with flamboyance and bowls you over with an uproarious act in this zany entertainer. Go, have fun and laugh out loud!"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "buntyonline",
        "review_rating": "2",
        "review_title": "This is bad. Badder than the bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Not Recommended",
        "review_detailed_main": "The Worst movie I have ever watched, better if I had taken a sleep for 2hr -_-"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "anupapu8",
        "review_rating": "6",
        "review_title": "Entertainment in David Dhawan Style",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "tutorscircle2013",
        "review_rating": "2",
        "review_title": "Well its David Dhawan",
        "review_detailed_main": "Its always quite clear how a director or producer introduce their kins, siblings and kids into the Bollywood industry and this is just as terrible as the movie \" Highway \" -\n\nYou always had that one friend in college who cracked the most obnoxious one liners or jokes - but you always laughed at them because he was your friend. Varun Dhawan is not that friend !! You have to have an utterly obnoxious sense of humor to make it past 30 minutes in this movie. The second half is almost unbearable.\n\nVarun always had this tendency to over-act , happened in the past and happened again in Comedy Nights with Kapil.\n\nYou can wait for it to be on the television in the next 4 weeks !\n\nSave the money, buy your girlfriend something nice :)"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "akshay-ak-kumar",
        "review_rating": "6",
        "review_title": "Total Time Pass",
        "review_detailed_main": "You know what to expect from a David Dhawan film ? Time Pass comedy which in other words means entertaining.\n\nMain Tera Hero is a better off than some of recent ones which includes disasters like Rascals, Do Knot Disturb and Chashme Buddoor and no where close to the ridiculous Chor Machaye Shor.\n\nMain Tera Hero is a Varun Dhawan film from start to end. He lights up the screen from start to end. Boy, he has talent and he can become the next Govinda if he focuses on his performances.\n\nThere is nothing much in story and its a series of gags after gags. I enjoyed Anupam Kher's character of a Don whose voice echoes because he was born in a hill station. Or Salman playing God.\n\nHowever, I wish the story had a bit more for Varun Dhawan to showcase his talent. The dialogues could have been more crisp. The music is peppy.\n\nArunodhay Singh plays his part well while Shakti Kapoor is wasted. Among the women, Nargis Fakhri is surprisingly good while Illena is lost. My word to Illena, after Barfi, avoid films like these otherwise no one will take u seriously in the future.\n\nSo, David Dhawan is slowly improving but needs to get his magic back and make classics like Deewana Mastana and Hero No. 1 again."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "n_dhruv",
        "review_rating": "",
        "review_title": "2nd Half Works As Sleeping Pills !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "ketgup83",
        "review_rating": "5",
        "review_title": "When will David Dhawan start making sensible comedies. Varun Dhawan is the only saving grace in this average film",
        "review_detailed_main": "David Dhawan's flick are generally low on IQ with not much importance given to the story line. True , he was ruling the box office in 90's with Coolie No.1 , Hero No.1 , Biwi No.1 , Haseena Maan jayegi to name a few. Unfortunately over the years, his comedies has become painful and intolerable creating disasters like Chasme Badoor and latest being Main Tera Hero.\n\nMain Tera Hero tells the story young-vibrant-cheerful Seenu( Varun Dhawan) who migrates to Bangalore only to fall in love with college- heart throb Sunaina(Illeana D Cruz). Enters short-tempered local police officer Angad ( Arunoday Singh) who foils their romance by bringing another hottie Ayesha(Nargis Fakhri)into the picture.\n\nThe problem with Main Tera Hero is it tries too hard to tickle your funny bone but falls flat on the face. There is nothing defined as Screenplay as it is against David Dhawan's style. However, apart from so many blemishes there are few comic scenes which will bring respite. Songs are good with \"Besharmi\" being the best among all. Cinematography is OK. Art direction is decent. Dialogues are good. Varun Dhawan is definitely a star in making. The actor fights, dances , acts and delivers dialogs with aplomb. Anupam Kher is yet another driving support for broken car. Illeana D Cruz is passable. Arunoday Singh is just about OK. Rajpal Yadav is funny in few scenes. Nargis Fakhri over acts.\n\nOn the whole , Main Tera Hero is an average flick. Varun Dhawan is the only saving grace in the film. Average 2/5\n\nhttps://www.facebook.com/FilmyChowk"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "David proudly says I AM BACK with son Varun entertainingly playing the new age Govinda.",
        "review_detailed_main": "After Manmohan Desai and Subhash Ghai in the 80s, the one director whose films our group of movie-freak friends enjoyed a lot in the next decade was David Dhawan and we all really waited for every new David-Govinda film quite desperately. Remembering those years I sometimes do feel, as if these lavish multiplexes promoting a more sophisticated and educated way of movie watching, have probably ruined that unforgettable & enigmatic experience of witnessing a typical David-Govinda film among all the crazy fans. And MAIN TERA HERO really transported me to those times quite honestly, as David was proudly back with his own style of entertaining cinema, presenting a new age Govinda found in his son Varun Dhawan acting in just his second film.\n\nHaving said that as the film begins, it just turns out to be another loud product aiming to please the audience, incorporating everything possible missing the desired mark. All the actors simply behave over the top including Varun and the viewer doesn't get involved with any of the characters individually in these first 10 minutes. But once Arunoday Singh and Rajpal Yadav enter the scene alone with Ileana, the whole scenario changes and suddenly Varun gets into a current generation avatar of good old Govinda surprising one and all. Without wasting any more time he starts impressing in almost every sequence and one begins enjoying the film much more than the expectations, before it says interval.\n\nPost intermission new characters are called in to keep you entertained including Nargis Fakhri, Saurabh Shukla and Anupam Kher with his amusing echo system straight from the mountains, working instantly. The catchy tracks continue giving a boost to its overall momentum and one just feels like watching a typical David Dhawan film of the 90s featuring Varun instead of Govinda. Interestingly Shakti Kapoor also joins in towards the end to recreate the same magic but his track sadly turns out to be a more forced one in absence of the inimitable Kadar Khan.\n\nTo give the due credit, though the film is a remake of 2011 Telugu hit KANDIREEGA, it actually works because of David Dhawan's absorbingly entertaining adaptation, fast editing and many funny dialogues well written by Milap Zaveri. The father makes his talented son do many things particularly for the single screen viewers in the small centers just like he used to play with Govinda. And Varun doesn't disappoint him either grabbing the big opportunity given showcasing his comic timing perfectly.\n\nThe soundtrack by Sajid-Wajid suits a David Dhawan like a 'T' and I really missed'Chichi' a lot in songs like \"Shanivaar Raati\" and \"Tera Dhyaan Kidhar Hai\" in particular. The compositions force you to start swinging sitting on your seat itself, which was always a key feature of David's films in those particular years. The background score maintains the racy tempo throughout and the action sequences intelligently incorporate the humor factor too as required.\n\nPerformance wise, as expected Varun leads the show in style and I hope this film doesn't turn his confidence into over-confidence next. The boy unexpectedly lives every Govinda moment in the film wonderfully and David has surely found a new Govinda in his own home after so many years. Ileana looks pretty and does well in her limited scope but Nargis Fakhri is really awful with her English accent and silly expressions. As a matter of fact, now I can assume how difficult would have been for Imtiaz to get her perform in that decent way in ROCKSTAR. But then since the girls offer a good amount of skin show and kisses too, so the viewers are not going to mind the lack of acting skills as it seems. In the supporting cast, Anupam Kher is simply superb with her echoing dialogues & Rajpal Yadav successfully generates some good laughs along with Saurabh Shukla. Arunoday Singh leaves a strong impact as the tough villain trying the comic act for the first time. Plus Manoj Pahwa, Supriya Shukla, Evelyn Sharmaand Raju Kher provide a good support.\n\nFinding the flaws, it is no doubt based on a very mindless plot and can also be cornered by calling it a product designed to promote Varun Dhawan alone. The film slows down a bit in the second half too going into some over stretched sequences heading towards a hurried climax. But the mad, crazy treatment of the director fast picks it up well in time and drags you back into the entertaining world of fun, full of many witty one liners. In short, forget about the logic, keep away the intellectual cap for a while and enjoy MAIN TERA HERO just like a 90s David-Govinda film going back in time.\n\nIn poetic verse, for some there might be less and for some there might be more, but there is entertainment in the film for sure\u0085\u0085\u0085\u0085for everyone. So do give it a try and have a good time along with the new age Govinda and the veteran David Dhawan once again hitting the mark in the new millennium."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "bairagisuneel",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "I don't see this type of worst movie,varun dhawan was doing overacting all the time.actress only for show peace in This film,please indian odience wake up and don't go for this type of movies.how did this movie hit,this movie deserves disaster"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "gabriellagrey203",
        "review_rating": "10",
        "review_title": "I for one...Liked it",
        "review_detailed_main": "To be honest ..I for on really enjoyed the movie..\n\nMaybe it was because i went in with low expectations after reading all the mixed reviews.. ? Not sure.\n\nBut really, other than the long dancing numbers which i found to be really time consuming,I really enjoyed the story line,the acting and the characters.You would honestly find me laughing most of the time..(if i wasn't forwarding the songs that is).I loved every character in the movie especially 'Angad' and 'Peter'...they were really hilarious.\n\nOverall,\n\nGreat Rom-com for a fun evening :)"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "Abdulxoxo",
        "review_rating": "7",
        "review_title": "Neanderthal level entertainment",
        "review_detailed_main": "This is purely entertaining, silly gags, one liners (with echoes), just pure entertainment. The characters are cardboard with little to no development but who cares In this type of flicks? The movie doesn't waste time introducing the main character and his goals ( which he's totally not achieving!). He's a free-spirited guy, a kinda menace in the society, \" the whole town came to say goodbye when I was leaving\" he boasted at some point. He falls in love with a girl in college, the one girl that nobody dares to woo. She's unwillingly betrothed to Angad, a short-tempered police officer. After some twists and turns, our main heroine is kidnapped and taken to a criminal don Vikrant's house as a rouse to bring Seenu because his daughter has fallen in love with him. The rest of the movie follows Seenu and Sunaina as they try to court Angad and Ayesha so that they'll be free to get married.\n\nThe film brings smiles on your face within the first five minutes only and then that smile stays right till the end with all delightful characters getting introduced at regular intervals. Varun Dhawan Is very enjoyable to watch, he doesn't overacts and handled romantic scenes well. Two female leads play by Ileana D'Cruz and Nargis Fakhri don't give an award-worthy performances, but enough to make this film enjoyable. Anupam Kher is clearly having fun with his character. The rest of casts provide good comic relief that makes this movie such a fun ride. The soundtrack isn't memorable but it's quite catchy. The cinematography is really good with breathtaking camera angles. I also like the set decorations, it's very colorful and easy on the eyes and so is the wardrobe.\n\nOn the whole, Main Tera Hero doesn't offer much in terms of storytelling and characterization (and it shouldn't have!) but in terms of entertainment, it does delivers alot!"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "shahrukhullahkhan",
        "review_rating": "1",
        "review_title": "Stupid film",
        "review_detailed_main": "Even if you leave your brain at home and watch this movie. It a pain and such a stupid film. Dhavid Dhawan is making bad films one by one now. Judwaa 2 was also such a stupid film. Varun Dhawan is such an amazing actor. I hope he does good films."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "adithyamenon-63080",
        "review_rating": "1",
        "review_title": "Don't believe any review that says it's a good movie",
        "review_detailed_main": "It's absolutely garbage, unfunny , non sense and filled with overacting of Varun Dhawan"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "ishtiake",
        "review_rating": "7",
        "review_title": "Very Entertaining!!!",
        "review_detailed_main": "I had mixed feeling about this when going to the theater but I was glad after watching this. The movie is funny and i mean not forced funny but actually witty funny, even though the movie is centered around the main actor Varun. everyone produces the performance required for the movie to be successful especially rajpal yadav and anupam kher were fantastic.The actresses look really hot, the songs are catchy ,the actions are both outrageous and entertaining, the dialogues are original and funny and the plot has an important twist , and it never gets boring, so trust me you will certainly laugh out loud, a David dhawan special"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "priyax-16662",
        "review_rating": "1",
        "review_title": "Totally flop",
        "review_detailed_main": "We should stop watching this garbage. Waste of money, time."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "yunusitboss",
        "review_rating": "6",
        "review_title": "Main Tera Hero (U/A) Hindi ---------- my Rating : ★★★ ONE TIME WATCH",
        "review_detailed_main": "Main Tera Hero (U/A) Hindi New movie Reviews and lots more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nMain Tera Hero (U/A) Hindi ---------- my Rating : ★★★ ONE TIME WATCH\n\nSTRENGTHS :- * Songs : were really good ..... * Casting and Performances ....\n\nWEAKNESSES :- * Simple story seems to be lengthy ... * Less funny ... rajpal was OK ....\n\nFINAL VERDICT :- * Overall... it is not a complete comedy .... only in few moments .... Watch it once if u have time ....\n\nOur Love Story begins with the Mischievous, Clever, Charming Daredevil and the HERO who falls in love with Sunaina. How can a Hero's love story be complete without a villain! So walks in Angad, the corrupt cop, who wants to forcibly marry Ileana and to make things more spicy also does Ayesha who is madly in love with our Hero."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "abhishekx",
        "review_rating": "4",
        "review_title": "Bad entertainer",
        "review_detailed_main": "Its very sad to know that Director David Dhawan failed to make a hilarious RomCom when it was his son's turn. The only thing I loved about the movie was Ileana D'Cruz's expressions. She is definitely a wonderful actress but is a bit underrated and overshadowed because of her mind blowing contemporary actresses like Parineeti Chopra, Sonakshi Sinha who have occupied a huge space in the industry. But anyway, coming to movie, speaking of the entertainment factor, I think the movie had that very typical thing which most of the boys and girls of this generation do not enjoy watching. And now, coming to the main Hero of the movie, Varun Dhawan, who is somewhat trying to pull off the 'Salman' thing might also affect his stardom adversely. Because salman has a very huge fan following and his fans wouldn't love it if any other actor is trying to replace. Maybe my logic sounds a bit weird, but it is very relevant in some cases."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "achyutaghosh",
        "review_rating": "6",
        "review_title": "Make believe return of the tapori hero",
        "review_detailed_main": "The 90's were all about stereotypes, and Govinda owned this nice little niche- madcap comic, singing, dancing, and mostly family friendly entertainer, playing to the masses. Think Coolie No.1, Saajan Chale Sasural, Hero No.1, and Haseena Maan Jayegi. Helping him create and cement this unique position was David Dhawan, in over 17 movies. And this combination reigned supreme till their creativity dimmed, and other mainstream actors such as Akshay and Salman and directors such as Priyadarshan started experimenting, with results that far superseded Govinda-Dhawan combos.\n\nAudience adulation is notoriously fickle, but today in Bollywood with major stars either playing the action-comedy combination or retaining the strong and silent stereotype, room for the fun and friendly entertainer seems to have opened up again. Daddy Dhawan thinks his son Varun Dhawan fits the bill to a T, and so we have Main Tera Hero. Dhawan plays Seenu, with a penchant for infamy, and with a hot-line with the gods. When he is kicked out of his town, lands in Bangalore and promptly falls in love with Sunayana who everybody is afraid of, since she is the unrequited love of local police goon Angad. This is fairly simplistic so far, so to make it a love triangle, comes in Ayesha, daughter of criminal Vikrant Singhal, who is besotten with Seenu. The rest of the film is vintage David Dhawan fare, with Seenu romancing two girls while trying to extricate himself from the mess.\n\nLike what most director fathers do for their sons, the movie is an unabashed attempt to showcase Varun Dhawan's talents. As the fast talking, naughty Seenu, he is quite spontaneous, and along with Ileana d'Cruz and Nargis Fakhri, they make a glamorous threesome. But he perhaps tries too hard to channelize Salman and Govinda, and as a result, the movie is genuinely funny only in parts, forcefully funny in most. The girls are no Karishma Kapoor, do nothing more than adding oomph. Rajpal Yadav reprises countless Johnny Lever acts from the past, and Anupam Kher does what he can actually do with his eyes closed- funny gangster, loving father. Arunoday Singh is perhaps the only guy trying to break stereotypes here, and is the surprise act. There is a cameo by cult favorite Shakti Kapoor, pity though that it is so short.\n\nSo does Main Tera Hero warrant a watch? Yes and no. It is a slapstick, retro 90s style partly comedy with added Western influence. While many among us have outgrown this form of entertainment, I would think it is a one time watch on a rainy day at most. In the recent past there has been others such as Shahid Kapoor, and Ranbir Kapoor who have tried to don the tapori act but failed. Is Varun Dhawan then the new messiah? Yes and no again. He has potential, but is not quite the finished product yet. Given a few more years of experience and a good script, he might be able to establish himself in this niche."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "tuhin94",
        "review_rating": "4",
        "review_title": "A film trying too hard and not succeeding most of the time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "shaswat-adhikari",
        "review_rating": "10",
        "review_title": "very entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Typical David Dhawan Entertainment!",
        "review_detailed_main": "'Main Tera Hero' is Typical David Dhawan Entertainment! An over-the-top, brainless comedy, that is aimed primarily at the masses. The only difference is, that this film doesn't feature Dhawan's favorite hero of the 90's, Govinda, but stars his son, Varun, instead. So if you're ready to over-look logic, then this comedy is waiting for you!\n\n'Main Tera Hero' Synopsis: A notorious youngster falls in love with a girl in college, but later realizes that the love of his life has an obsessed cop after her. Things get worse, when his lady-love gets kidnapped by a don & is taken to Bangkok.\n\n'Main Tera Hero' has an entertaining, breezy first-hour, but a very loud & lengthy second. Luckily, Dhawan doesn't shy away from buffoonery & confidently presents one gag after the other. Also working on its advantage, are its wacky characters. The protagonist, played by an energetic Varun, is not the only one who stands out, but also the supporting cast, who add spice to the proceedings.\n\nMilap Zaveri's Screenplay is funny, zany & mad. However, the writing in the second-hour isn't as funny as it ought to have been. Dhawan's Direction is high on energy. He has maintained the pace of the film well. Cinematography & Editing are average. Music by Sajid-Wajid is superb.\n\nPerformance-Wise: Varun displays confidence & gets his comic timing right. He's energetic & likable all through. Ileana D'Cruz is bland. Nargis Fakhri looks super-hot, but needs to work on her diction & acting. Arunoday Singh springs a pleasant surprise. He's truly funny! Anupam Kher, Rajpal Yadav, Saurabh Shukla & Manoj Pahwa are hilarious in their respective parts, while Evelyn Sharma does her bit well. Shakti Kapoor stands out in a wild cameo.\n\nOn the whole, 'Main Tera Hero' is Time-Pass Entertainment. Go, have fun!"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "3",
        "review_title": "Don't want to see this hero",
        "review_detailed_main": "Nonsense comedy. Really boring. Gave three stars for 2-3 scenes and for the music of the movie."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "dkdeepakhatri",
        "review_rating": "1",
        "review_title": "Story is missing",
        "review_detailed_main": "Typical masala movie . Poor story , songs are great . Nargis fails too impress , Illena is good & varun seems overacting ."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "saytosandeep",
        "review_rating": "6",
        "review_title": "MY REVIEW: Typical David Dhawan Brand Hero!!",
        "review_detailed_main": "Main Tera Hero. Father David Dhawan casts his son Varun Dhawan as a typical Bollywood hero in his typical romantic cum slap stick comedy. The end result is average because although Varun tries hard to replicate the Govinda (David Dhawan's favourite in old times) effect but because the story seems just a forced attempt to keep Varun in spotlight. Varun's charm works using his naughty face and well shaped body. Heroines are there to just smile on the smartness of our hero. Both Ileana and Nargis fall short of putting any sincere effort in their comic timings. However surprisingly Arunoday Singh does well in comic scenes while essaying the role of the typical manly villain who wants the heroine at any cost. Side characters played by likes of Anupam Kher and Saurabh Shukla are descent. I am going with not bad 6 out of 10 for Main Tera Hero. Watch it on a lazy day when you don't want your mind to do any work."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "silvan-desouza",
        "review_rating": "5",
        "review_title": "Okay typical DD film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "user-603-543245",
        "review_rating": "6",
        "review_title": "It's Entertainment!!!!!!!",
        "review_detailed_main": "Went to watch Captain America:The Winter Soldier but some how we missed the show and so decided to catch Main Tera Hero instead...here is what I experienced:\n\nSTORY:I won't tell you the story here and it is a David dhawan film so please leave your brains at home and just chill,the story has nothing new.\n\nDIRECTION:David Dhawan steers this ship well and supplies us with constant laughs throughout.The first half is the build up of Varun's character while the second half is very funny.\n\nMUSIC:MTH has couple of good tracks in \"Palat:tera hero\" and \"besharmi ki height\".Background score is good.\n\nPERFORMANCES:When it is a comedy film,it is the responsibility of its main hero to carry it,and this is what Varun does fantastically.He dances superb,bashes the goons,loves his heroine and shows brilliant comic timing.Ileana looks pretty but i doubt her acting skills.Arunodoy Singh and Rajpal Yadav are very funny and play their roles well.Nargis looks sexy but does'nt knows acting.Anupam Kher and Saurabh Shukla are real fun.\n\nCONCLUSION:All in all MTH is an entertaining film,a good comedy film after sometime.It is better than Phata Poster Nikhla Hero and Chashmebaddoor. 6/10 from me..."
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "Magow-Intermean",
        "review_rating": "10",
        "review_title": "Movie Review: Main Tera Hero",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "gspbfbwm",
        "review_rating": "10",
        "review_title": "VARUN IS THE HEROOO",
        "review_detailed_main": "One of my most favourite movies ever....it's entertaining and in really cool ways....if you wanna watch something to laugh and smile then this movie is for you!!!"
    },
    {
        "movie_id": "tt2762334",
        "movie_name": "Main Tera Hero",
        "movie_rating": "5.1",
        "review_username": "shakir69",
        "review_rating": "8",
        "review_title": "Its a David Dhawan Movie after all. No brain only fun!!!",
        "review_detailed_main": "Well I have to admit I disagree with most reviews here, after all who doesn't know what David Dhawan is famous (infamous?) for. This is a comedy where you should not think too much, well you shouldn't think at all. Varun does his 'over acting' part with grace and charm. The two dolls do what they are supposed to do in 'masala entertainment' bollywood movies. Hats off to the director for this venture. The script/plot (not the story) could have been made better though, but I guess we cannot have a Hera Pheri or Taare Zameen Par or Barfi every Friday. I may be partial because I love Bollywood movies to the core, but this movie is a zillion times better than the news channels pouring out gibberish at this point of time. STATUTORY WARNING-When you see this movie keep your brains back home and just enjoy it with a popcorn."
    }
]