[
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "LLgoatJ",
        "review_rating": "3",
        "review_title": "A Mess",
        "review_detailed_main": "This film is about three young guys, all who had bad childhoods, going on a rampage. It started out well but quickly went down hill and ended up a bit of a mess.\n\nThe story was hard to follow. The characters weren't particularly likeable, even with their child hardships revealed. It didn't really feel realistic. I also didn't really understand the Grand Theft Auto graphics and fantasy scenes. They seemed like an afterthought and didn't really fit in and seemed quite random. The film would have been much better without them. Although it is a good idea and done properly and throughout the film could have worked.\n\nOverall it was a good story and idea made into a complete mess. It just gets worse as it goes on. By the last 30mins I wasn't really paying attention. I wouldn't waste your time."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "isaacochoterena",
        "review_rating": "2",
        "review_title": "Without sense",
        "review_detailed_main": "This movie fails to give a good story, even though it portrays some problems in society.\n\nThe problem with this film is the script, since there is no defined story, there is no conflict to resolve, there is a lack of character development, sometimes it seems that the actors just say random words. The direction doesn't help much as it doesn't clearly expose everything it wants to say. The performances are decent, but not surprising, it seems that it is just a montage of scenes that wants to show some problems in society. Some topics that are touched on, but very superficially, are that the teachings of our parents and the experiences of childhood are what will shape us when we will became adults and will be reflected in our personality and in our actions, also talks about delinquency and society's rejection of certain young people who had a hard childhood. The movie also has flashbacks that lead nowhere and an ending that is confusing and makes no sense.\n\nThe lack of focus of this film causes it to be completely ruined by not being clear about the story to be told, just as the situations that occur are very uncomfortable to watch and very difficult to digest, it is a bad film but not because of the actors and actresses that are part of it, it is a bad film because of the poor script and bad direction that ruins any good idea in the movie."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "bfjeld",
        "review_rating": "2",
        "review_title": "Why did I watch it all?",
        "review_detailed_main": "I want my two hours back? At first I thought it was just a little original, put no. Don't waste your time watching this! But there were some moments,so that's 2 stars instead of 1..."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Candib133",
        "review_rating": "5",
        "review_title": "The ratings are exaggerated...",
        "review_detailed_main": "Hyperbole to say the least. I saw this movie pop up on Hulu and I added it to my watchlist when I saw the cast (Kelvin Harrison, Jacob Latimore, Jonathan Majors, Terrence Howard). Then, I looked it up on IMDb, because I'm that person and was appalled to see a rating of 1.4. I have never seen a movie have such a low rating. Ever. So I purposely watched it in hopes of disproving those opinions. And while it was not an Academy Award nom by any means, it wasn't that bad. Not necessarily good, but definitely not that bad. Also, the synopses are trash as well, because there was little to no drug use at all, just a few references, so maybe do better there as well. The movie is about three friends in the inner city of LA that are all going through their own struggles. One struggle overshadows the other, for (somewhat) obvious reasons. The friends decide they will take it upon themselves to fix said problem, and it kind of unravels from there. If anything, the worst part of the movie is the gaping plot holes throughout. Also, a number of characters weren't needed and those that were never had any real development so you're left confused more often than not by some of their actions. Even still, I've seen worse movies and there's no way this deserves a 1.4. I encourage you to watch for yourself and go into it knowing that even though some people didn't care for it, you very well could. I have not rated a movie on IMDb in literal years, but I couldn't just let people trash this movie when there are far worse getting praise on a regular basis."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "m-mirzapour96",
        "review_rating": "1",
        "review_title": "Terrible!",
        "review_detailed_main": "Terrible movie with a very bad scenario. Also with awful acting performances."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Astaroth22",
        "review_rating": "5",
        "review_title": "Heard Haters?",
        "review_detailed_main": "I am a huge Kelvin Harrison Jr. Fan, and while I think they wasted his talents placing him in this role, there's no way I believe this movie deserves its current rating [1.4]. The bottom line is that its an average movie: Not especially good but certainly not bad either. I'm guessing the Amber Heard haters are out in full force here since it seems to be almost a religion nowadays. Not sure what that's all about but hammering this movie because of it is unfair to everyone else involved."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "MoonwalkerKari",
        "review_rating": "1",
        "review_title": "Utter trash, worst acting I've ever seen.",
        "review_detailed_main": "The movie is simply horrible. The acting is the worst. There's literally nothing else to say than that."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "joona-aleksi",
        "review_rating": "1",
        "review_title": "Bad movie",
        "review_detailed_main": "Very very very bad movie. Did not like on second of it. Absolute garbage."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Misterdeex",
        "review_rating": "1",
        "review_title": "Messy movie with insanely bad acting",
        "review_detailed_main": "I have rarely seen movies that I dislike from start to end. This one is a prime example in that category and I hope I never have to see it again."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "atoosaghorbani",
        "review_rating": "1",
        "review_title": "Don't Watch",
        "review_detailed_main": "It's not worth it! Just a bland, exhausting movie."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Simonbakewell",
        "review_rating": "8",
        "review_title": "Don't expect boyz n the hood",
        "review_detailed_main": "I find it unbelievable how many bad ratings this film has! It covers mental health and abuse.some of the acting isn't the best but then some of the acting is really good.i think most of the bad rating were given by people expecting menace 2 society or something.i enjoyed it."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "netta-67734",
        "review_rating": "7",
        "review_title": "Hard Story To Tell",
        "review_detailed_main": "I enjoyed the movie & the acting. It's unfortunate that some people don't watch the movies that they review on here. You can tell by them describing things that NEVER occurred in the movie. Is it based on who's on the poster?🤔 The story was a sad, hard one that needed to be told. Our Childhood trauma can lead us to destruction if we don't have it addressed properly. Also, MONITOR YOUR CHILDREN!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "valex-05887",
        "review_rating": "2",
        "review_title": "Feels like watching the news",
        "review_detailed_main": "It feels like watching some lame news, all story is weird. That amber looks like she had better days."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "msmith-81617",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "There needs to be a zero star rating, if there is a worse movie then this, the cia could use it in place of water boarding. How was this funded. Worst acting i've had to endure."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "yuihellscythe",
        "review_rating": "1",
        "review_title": "just bad.",
        "review_detailed_main": "Theres no point really watching. If i could rate 0 stars i would."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "bloodmuttwolf",
        "review_rating": "1",
        "review_title": "Awful.",
        "review_detailed_main": "A very boring movie. Never once captured my attention. Skip this movie if your considering it. Not worth your time."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "daddygracenyc",
        "review_rating": "1",
        "review_title": "What On Earth Did I Just Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "traceytak",
        "review_rating": "3",
        "review_title": "Lazy acting",
        "review_detailed_main": "The acting is very lazy, no emotion, not much effort as if the director just said ad-lib what you want it doesn't really matter.. The storyline is pretty much 3 guys doing what 3 guys normally do in a run down part of town. Even the violence and sex are not anything different to what has been done before and it's easily watchable on autopilot without taking in what has been watched because it really didn't make any difference to the story. The music is just the same old sound that accompanies this same old drama that gets told again and again and inevitably just becomes the normal easily switched off and forget about it film. A good film needs to have impact to everyone. The low scores demonstrate this film has no impact which is a shame as in a good story that has the viewer engrossed in what will happen next, some of these actors could really shine."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "boobmcfarts",
        "review_rating": "1",
        "review_title": "Garbage acting",
        "review_detailed_main": "Good story but horribly casted. Bad acting ruins the idea."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "michaelaajohnson",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "The dialogue was awful, the acting even worse. Terrence Howard is always a delight but the rest of the cast fell flat. Visually, the film is lacking as well which is a disappointment as that was one of the biggest pulls for me to see it."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "toddeichhorn",
        "review_rating": "8",
        "review_title": "Actors",
        "review_detailed_main": "I enjoyed this movie. A lot was being said but not in a way I think the majority of people will appreciate. The acting was awesome\n\nThank you to all those involved. You made something amazing and its tragic that it's not appreciated more. Damn good!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "collincb",
        "review_rating": "7",
        "review_title": "No idea how this is rated soooo low",
        "review_detailed_main": "It's a good movie. There's absolutely no reason for it to be rated in the 1s. The acting is good. The story is good. I honestly think people were payed to rate this low. It honestly makes no sense. Watch the movie. I probably miss you it's worth it."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "eduardolopez-71246",
        "review_rating": "1",
        "review_title": "I wish I could rate lower",
        "review_detailed_main": "Disgusting,horrible,bad,atrocious, would rate lower but can't."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "bybran-93585",
        "review_rating": "1",
        "review_title": "What a Waste",
        "review_detailed_main": "By far one of the worst movies I've seen and awful acting skills. What a waste of money and time. Don't even bother!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "burlesonjesse5",
        "review_rating": "4",
        "review_title": "VIEWS ON FILM review of Gully",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "skeeziebeezie",
        "review_rating": "2",
        "review_title": "Good acting, bad movie",
        "review_detailed_main": "I don't think the acting is bad as some reviewers have said, but the I do agree that the story itself is all over the place. This needed more structure and it could have been good."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "ramcesdufresne",
        "review_rating": "3",
        "review_title": "An incoherent mess",
        "review_detailed_main": "This movie was so bad I had to make an account. It got three stars off the merit of the actors( Jonathon majors in particular he was phenomenal) but the story, the script, the directing?! Terrible. An incoherent mess is what I make of it and it is a waste of time. Parts of the movie jump back and forth with flashbacks that mess up the whole pace, and characters seem to speak with no absolute substance overall making the movie a big jumbled mess. I would've gave it another star cause I watched it drunk, also for your entertainment, watch it drunk, this movie will make your head spin more than tequila."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "yusufpiskin",
        "review_rating": "4",
        "review_title": "Plummer",
        "review_detailed_main": "Nabil Elderkin's film that made its world premiere at the Tribeca Film Festival on April 27, 2019.\n\nIn September 2020, Vertical Entertainment and Paramount Pictures acquired the US distribution rights to the film.\n\nIt is the story of 3 friends who grew up in a neighborhood where there are poor blacks and poor whites, as Theo Von mentioned in his sketch of White Privilege, where racism is felt to the fullest, not the rich-poor divide.\n\nThe movie features two of the greatest actors of their generation, Charlie Plummer and Kelvin Harrison Jr., as well as Amber Heard and Terrence Howard.\n\nAlthough the soundtrack (Dan Heath) and cinematography (Adriano Goldman) are impressive, at the end of the day, in some ways, it's nothing more than a bad copy of American History X."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "bqkgqvrc",
        "review_rating": "5",
        "review_title": "Made sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "kiowhatta",
        "review_rating": "9",
        "review_title": "A brilliantly authentic piece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "MarjorieHMorgan",
        "review_rating": "7",
        "review_title": "Loyalty is the main currency",
        "review_detailed_main": "Gully (2019)\n\nA story of young friendships, but so much more.\n\nThis is a tender portrayal of the interlinked complicated life of four young men. It surprised me, but that's only because I read some reviews beforehand. I hope you're not doing that. I hope you are reading this after you have watched the film, and you now know for yourself what a treasure this film is.\n\nYou may disagree, and that's OK. It may not be for you, it was for me. It is for me.\n\nGully is all about life's situations, and the options or choices available to these four friends, some of whom think their lives are summed up thus: \"D is for damned\".\n\nIt is a magical film of hope that blurs the lines between truth and fantasy, but within each scenario is the every present eye in the sky of the police helicopter, or someone somewhere watching.\n\nI particularly enjoyed the fact that none of the main four characters have stereotypical life stories as is usually portrayed in tales from the streets of LA, however all of them are impacted by events in their past that influence their present, and is destined to direct the path to their futures.\n\nThroughout the story it's almost as if they are in a trance at pivotal moments in their lives, with their action overtaken by something they cannot, or do not want to, control. At times, it's like their lives are a game that they are playing, not ones they are living - a way to cope, maybe? They are always looking for a way out. They are all looking to fulfil the promises of a new born life, but constantly dealing with all the things in their lives that are broken obstacles in their paths.\n\nThere are some violent scenes, but also portrayals of beautiful family relationships and neighbourhood friendships; these are particular touches of joy and humour.\n\nTerrence Howard, as Mr Christmas is the reluctant prophet of the film, appearing as and when needed to sprinkle words or either wisdom or warning; he sees and knows more than he wants to and shares from both vessels willingly.\n\nKelvin Harrison Jr., Jacob Latimore, Charlie Plummer, and Jonathan Majors perform well as individuals and as a unit where the business of one is the business of them all; they are loyal.\n\nThis is a dreamlike film, with a haunting soundtrack.\n\nI have watched it twice already."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Nae140",
        "review_rating": "10",
        "review_title": "Great movie! But requires depth most people simply don't possess.",
        "review_detailed_main": "This was a really good movie. I know why there are so many bad ratings. Most viewers have grown accustomed to the same shallow, repetitive, mindless entertainment, and most lack the level of consciousness required to appreciate quality storytelling. This movie is for people who like depth. Who can follow a plot. Who can allow the filmmaker to stimulate their imagination. This movie was art. A novel you just can't put down. It was a crime drama, psychological thriller, fantasy, and indie film at the same damn time. The acting was great. Imaginative story telling.\n\nThe problem isn't the movie, it's people tuning in because they see actors like Jacob Latimore and Terrence Howard expecting Chicago or Empire. This isn't that. Everything doesn't have to be that. Someone commented \"don't expect Boyz in the Hood.\" Why would anyone expect that or even compare these two films? Entirely different movies, and you can STILL enjoy Gully even if it doesn't fit the urban California drama format.\n\nLOVED this movie. Especially the imaginative ending. (Side note \"gully\" was a popular slang term when I was young. Haven't heard it in a minute :)"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "shellcleo",
        "review_rating": "7",
        "review_title": "Not sure why all the bad reviews.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "stevekinney",
        "review_rating": "10",
        "review_title": "The rating is a joke. Great movie.",
        "review_detailed_main": "I can't believe people are really gonna hate on this movie so much . It's a deep movie for anybody that had a rough up bringing and didn't walk around with a silver spoon up there a##. Anyways.. the movie dives into troubles about mental health . Gangs . Drugs. And choices in life that lead to a dark place . I definitely recommend but please keep in mind this is a low budget indie film. So if your expecting high action packed explosions and high speed cop chases . Wrong movie ."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "beaverhunter_carrsie",
        "review_rating": "6",
        "review_title": "These Reviewers Must Hate Travis Scott",
        "review_detailed_main": "I'm a harsh critic, but this film was not nearly as bad as people make it out to be. Not bad at all. Don't read one review under 6 stars and go ahead and watch it for yourself. You be the judge. You be your own harsh critic."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "sallyfromthevalley71",
        "review_rating": "9",
        "review_title": "Worth the watch",
        "review_detailed_main": "Stream of consciousness is hard to follow at times, but it comes tighter and successfully blurs realistic portrayal of the mind of teen boys in a troubled environment, with a sort of fantasy element."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Wegiddy",
        "review_rating": "7",
        "review_title": "Really good",
        "review_detailed_main": "This movie has a really low rating but I have to say this is a great drama. I love the ride or die friendship these boys have. It's really good. They say my review is too short."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "kimya-90678",
        "review_rating": "8",
        "review_title": "I'm glad I ignored the bad reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "jwhitey-43110",
        "review_rating": "7",
        "review_title": "People are wild",
        "review_detailed_main": "This movie is millions of times better than A lot of movies I've seen recently. Kimi on HBO is absolute garbage and over a 6 on IMDb. So much trash gets praise.\n\nThis movie is definitely wild and at times very unbelievable, but it's a solid watch. Jacob Latimore is the worst part of the movie and a terrible actor, but if you can get passed that the movie is ok."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "garyob-43280",
        "review_rating": "10",
        "review_title": "Dont get the bad ratings?? GOOD MOVIE",
        "review_detailed_main": "Gave it a 10 to bump ratings up I would actually rate this a 7.5. This movie is worth a watch and I am really shocked at how low the ratings are.\n\nThe three actors who played the main characters done a great job. The overall storyline was a bit unclear at times, but i was engrossed in the stories of each of the young teenagers and I was eager to find out what happened to them. Although they are an extremely voilent trio that you would not like to meet on a night out, their loyalty to each other makes them likable. They are 3 teens with serious pschological issues and poor childhoods who are just up to no good really. This movie is not a happy fairytale but instead an accurate representation of the harsh lives that some of the youth of LA have to lead. Gully also has some beautilly taken classic shots of LA ,fantastic place to see, tough place to live. Give it a go decent film."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "cruise01",
        "review_rating": "6",
        "review_title": "Messy direction but dark themes.",
        "review_detailed_main": "3 out of 5 stars.\n\nA story about three troubled teens causing trouble by stealing. Beating and vandalising. Story does enter dark territory of sexual abuse and abuse within the family. The direction does have trouble trying to find its footing. Decent acting. And dull script."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "romeovision2002",
        "review_rating": "10",
        "review_title": "Great acting/Underrated",
        "review_detailed_main": "First of all Kelvin Harrison Jr. Among all the others gave another underrated stellar performance. These are often the untold coming of age stories. There will likely never be another movie like this with so many awesome black leads where the topic is not somehow \"safe\". I love this movie & everything it stands for. Shame on those who gave it low scores."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "johannes2000-1",
        "review_rating": "6",
        "review_title": "Interesting premise, but disappointingly executed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "cokely",
        "review_rating": "10",
        "review_title": "Brilliant 10 thumbs up!",
        "review_detailed_main": "I'm not sure why this film has so many negative ratings. Possibly because some could never understand the circumstances. The cast are true artist and delivered an outstanding performance. I recommend 100%."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "camdentownie13",
        "review_rating": "7",
        "review_title": "1980s' style Indy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "anthonywilson-76217",
        "review_rating": "8",
        "review_title": "No way its 1.2",
        "review_detailed_main": "I find it hard to understand why this is so lowly rated. Some great acting especially from Jonathan Majors and young Charlie Plummer. Decent plot. Quite enjoyed the movie."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "giseltn",
        "review_rating": "6",
        "review_title": "What if...",
        "review_detailed_main": "A small action can change your life forever but dig deep to try to make things work for your own good. Many obstacles and many falls but we can always get up and keep on trying.\n\nAlso, mental health is real. Mental health exists and can destroy many dreams. This movie shows some of it and more."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "rhettrhodesmedia",
        "review_rating": "8",
        "review_title": "Yes, Do Watch!",
        "review_detailed_main": "This movie actually is worth a chance, and here are examples of why I believe that. This film is directed towards a specific wide-minded audience who can use imagination to paint what some of the imagery, actions, and metaphors in this film mean. Yes, without the film telling you straight up or revealing everything at the end, it leaves you thinking and needing more to it. The performances by these young actors, and even the older actors and actresses are phenomenal, some of the best independent acting I've seen in a while, but I have yet to see Sean Bakers new movie Red Rocket, which I'm sure is incredibly acted considering Simon Rex, the man himself is the lead."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "Tweekums",
        "review_rating": "7",
        "review_title": "Three disaffected teens running amok in Los Angeles",
        "review_detailed_main": "Calvin, Nicky and Jesse are three troubled teens living in one of Los Angeles's less desirable neighbourhoods. One day they decide to go to the beach. That may have been the plan when they walked out their doors but what follows is a violent journey where they commit various violent criminal acts, up to and including murder. Intertwined with this we see flashbacks to their troubled pasts; this explains some, but by no means all of what they do.\n\nI thought this was a solid enough film. It isn't the easiest of viewing as the protagonists aren't particularly sympathetic; even when we learn about their pasts is doesn't justify most of the things they do. Of course that is often the way with real life too; not all stories have to be about good people. The acting may be a little rough around the edges at times but that suits the gritty feel of the film. The violence has a nasty rather than exciting feel; clearly designed to shock and disturb not merely entertain. The locations used gave a good sense of the place; it didn't look like a haven of criminals; it looked like somewhere inhabited by people endeavouring to get by with what little they have. Overall I'd say this was a decent film; perhaps not a must see but still worth a watch."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "qfnrfrxy",
        "review_rating": "8",
        "review_title": "Underrated.",
        "review_detailed_main": "The fact that movies with vampires , men in yoga pants and the exact same movies being made .. get a higher rating than this. Is exactly what's wrong with today. This movie doesn't try to be anything but itself. It doesn't hop on the train of what already works to ensure a profit.\n\nIt's relatively straightforward if you give it time and let everyone's backstory develop. I think a lot of out of touch people watch this movie and didn't get the innuendo and the hidden context.\n\nEver since the \" like \" people just say and do the generic thing and never take a risk. This movie does.\n\nThe lead actor gives me 2pac from juice chills.\n\nThis movie is poetic , different , and you will remember it. Watch it. Not a waste of time."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "skyemccammon",
        "review_rating": "7",
        "review_title": "Amazing cast",
        "review_detailed_main": "Gully started out a little weird but it picked up half way! The cast was amazing and the acting was really moving! Also is Charlie Plummer ever bad in anything? The answer is no. Terrance Howard's performance was incredible but needed to be used more. Overall pretty good. I'd watch it again."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "darklayaknight",
        "review_rating": "10",
        "review_title": "The is movie was so emotionally filled...",
        "review_detailed_main": "I enjoyed this movie from the beginning. The plot was perfect to talk about how past trauma can cause present day irrational behavior. They showed the history of all three boys and how it changed them mentally. The acting was not bad by any of the actors/actresses, but I will say that it is hard to put forward the effort to produce those emotions without real trauma (no matter how long you went to school for acting) behind it.\n\nFor all of those people who are saying this movie is bad, maybe you picked a wrong movie to watch and are very shallow without feelings, because if you look past the acting and see the purpose of the story you will see that this is something we all need to understand about mental illness and trauma."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "They made me do it",
        "review_detailed_main": "No pun intended - and one of the things I myself didn't like about the movie. The suggestion that video games and movies may be related to what certain people do. Now inspiration or whatever you would call it ... yes that I can be attributed to it. But if there is not inherit evil in a person ... there is no chance they would act a certain way in reality.\n\nStill I am surprised the movie did get so many bad and low reactions ... on the other hand I am know for rating higher than most. So there is that too. There are some stellar performances in this one - so even if the cliche setting and other things do not work for you - you can't really fault the movie or the making of it. You can fault the ideas used and the way things are portrayed - but if you are able to overlook all that ... there is something to be found here. One thing is for certain ... the movie dares ... and it doesn't care how you feel about it ..."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "jenniferlynne-03017",
        "review_rating": "8",
        "review_title": "Don't understand the low ratings",
        "review_detailed_main": "I cannot for the life of me understand why this film has such low ratings. While I do agree that the storyline can be confusing at times, the acting is FAR from bad, as some people have said. It's a coming of age story, not dissimilar to many we have seen before, however it is told in such a way that keeps you entertained until the end. I particularly enjoyed Terrence Howard's character. Subtle, but important. Just well done all around. Give it a shot."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "brittneyjef09",
        "review_rating": "10",
        "review_title": "Ignore the reviews",
        "review_detailed_main": "I am so at a loss at the reviews after watching this movie I had to come back and say the people that left these low reviews are indeed HATERS ... watch for yourselves and not the opinions of others. The acting was really good and the movie is dark but I enjoyed the relationship with the 3 boys."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "splintercell69",
        "review_rating": "10",
        "review_title": "From the streets",
        "review_detailed_main": "Coming from a street kid this is very realistic. People don't see the things that happen to children behind closed doors. This movie does that. It tells a beautiful real story. Without glorifying anything just dirty gritty reality nice job!!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "mommasgotfive",
        "review_rating": "10",
        "review_title": "Dark, gritty, violent and surreal. What's with the bad reviews?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "brodwykpublishing",
        "review_rating": "10",
        "review_title": "This movie deserves more ratings",
        "review_detailed_main": "When I was 3 years old the first dead body I came across was my fathers. I too stopped speaking and had to go to speech therapy, I was also angry just like the characters in this movie. This movie is a good movie for those whom suffered trauma no matter where it comes from. And no matter how old you are it really messes with you. The scoring was great- the acting wasn't bad. People have no clue on how to watch film or probably make one!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "sunshine-31441",
        "review_rating": "9",
        "review_title": "Not bad...",
        "review_detailed_main": "I'm not sure why the reviews were so low. Could it be, that ppl just don't understand that life? Or the way the brain works? Or what loyalty is? What trauma does to you? Generational trauma, at that!!! I can go on and on. I, personally think this movie was pretty good. It kept my attention and interest. So to each it's own! Imo it's worth the watch!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "galloconmando",
        "review_rating": "10",
        "review_title": "Great movie!",
        "review_detailed_main": "Really like this movie, needed more character development but overall great! Its emotional, would recommend! People will post bad reviews based on Amber heards character but she played her character well. The main characters are the boys in the coming of age phases. Give it a shot! You will enjoy it :)"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "tryphennabastian",
        "review_rating": "10",
        "review_title": "AMAZING STORYTELLING",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "turtleloverules",
        "review_rating": "8",
        "review_title": "Gully",
        "review_detailed_main": "Gully was a very realistic portrayal of how survival instincts, mixed with no active father can create GTA type madmen prone to fits of rage and violence. The single mother experiment has failed on all levels."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "raygray-55192",
        "review_rating": "10",
        "review_title": "Intense",
        "review_detailed_main": "This movie is intense, violent, and moving. It follows the friendship of three boys with different traumatic backgrounds as things spiral out of control. The acting is superb. The negative reviews on this site are puzzling. Awards and high reviews elsewhere."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "attorneygresham",
        "review_rating": "9",
        "review_title": "Great Movie - Acting Excellent",
        "review_detailed_main": "I'm not a fan of tragic movies - this is one - but Gully caught me by sutprise. Absolutely loved this movie - cannot understand anyone giving it a rating below 7. Watch for yourself and comeback and give your honest review."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "changeinmyheart",
        "review_rating": "10",
        "review_title": "Symbolic and powerful",
        "review_detailed_main": "There will be people who don't see all of the symbolism and pure dramatic representation of several very important social and cultural themes in this move. They will say this movie is 'bad' or 'trash'. They only see surface level and weren't thinking and feeling throughout the film. This is a very powerful movie that shows an artistic and symbolic view of the marginalized and disadvantaged black and white modern youth. The dreams along with the repression of young sons, their mothers, their siblings, and the greater social dymancis around them are artistically portrayed in this movie. I can't even fit it in a paragraph. Watch the move, if you don't get it, watch it again. Jesse's symbolic scream at the end is super touching."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "foolishtrojan",
        "review_rating": "10",
        "review_title": "I loved it",
        "review_detailed_main": "Speaks on mental health of those in the gutter! What happens when those issues go unchecked. Beautiful story about those who never get help and how life can get away."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "fmuh-26018",
        "review_rating": "9",
        "review_title": "Not For Everybody But Still Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "naevahparker",
        "review_rating": "10",
        "review_title": "If u can't visually....",
        "review_detailed_main": "If you can't visually feel then you won't be able to feel what the message in this is it's easy to say it's not connectable but if you have a connected soul you will totally get the very core of this flick I loved it and I'm goin to watch it again......"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "laurabuchanan99",
        "review_rating": "10",
        "review_title": "Jacob Latimore..... wow!",
        "review_detailed_main": "Wow! This was amazing. The acting was brilliant.... Especially Jacob Latimore. I love him as an actor anyway but he was epic in this! Such a sad story and I can understand why the characters acted the way they did. Excellent writing and I found it thoroughly thought provoking. Ignore the bad reviews! Highly recommended. It's a 10 from me!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "mujosuljic",
        "review_rating": "10",
        "review_title": "Fundamental movie to watch !",
        "review_detailed_main": "First and foremost all these knuckleheads giving bad reviews let me tell you something, what comes around goes around . One day your momma is going to tell you that she hates you and you won't understand like you don't understand this movie . Everyone should watch this movie and hopefully realize that there are lot of people with childhood trauma that don't have any help and direction in their life . Next time I see kids rolling in stollen Mercedes I'll know ! Thank you for making this movie ."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "mdavisjr7",
        "review_rating": "9",
        "review_title": "Great acting, story, and message!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "bayachieved",
        "review_rating": "8",
        "review_title": "Worth a watch",
        "review_detailed_main": "I dont think as bad as all ratings on here...Dark and kinda niche...but a gritty and entertaining story..a little confusing at the end but on reflection it made sense...thought it was clever with addition of Asian dude in background of scenes. Who was owner of laundry."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "byasdeon",
        "review_rating": "10",
        "review_title": "BEAUTIFUL MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "andyjamesaj",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "What a sensational movie and story.\n\nThe people below haven't got a clue what they are talking about!!\n\nActing and story 10 out of 10."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "sincerelykay",
        "review_rating": "9",
        "review_title": "Captivating, Impactful, Not for the Sensitive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Exciting...",
        "review_detailed_main": "Three teens living in Los Angeles, all victims of extreme childhoods, set off a citywide rampage with no strings attached. They take us on a terrifying journey of drugs and murder through Los Angeles.\n\nA heavy film, from the flashback of the protagonists, with different types of abuse and violence, against children or their parents, a faithful portrait of the periphery, mistreated and marginalized, a painful film... Dark photography, flirts with games in good times, very intimate, necessary and revolting... Children from the periphery suffering more than any adult, a dark and frightening reality... Exciting..."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "lmcjun",
        "review_rating": "8",
        "review_title": "Thought Provocative",
        "review_detailed_main": "The three main characters did a great job! Some characters I wasn't sure why they were needed. I really wanted to know Jesse's outcome due to his background story...did they figure out or know what actually happened to him...it ended without knowing if...well you have to watch to understand.\n\nOverall, this movie needs a higher rating than it shows...it touched on some very interesting and important issues...some insight as to why some people end up making some bad decisions.\n\nJust watched Kelvin Harrison Jr. In Chevalier which drew me to finding more movies with him. Love Jacob Latimore's work from The Chi he was awesome in this too!! Jonathan Majors...love him in everything...just didn't quite understand his purpose in this one other than....uhmm would be a spoiler if I mention it! Just introduced to Charlie Plummer...great job.\n\nOverall, I found this movie very intriguing."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "alp_nyc",
        "review_rating": "8",
        "review_title": "Raw urban life",
        "review_detailed_main": "While Gully may not be an easy watch due to its raw portrayal of urban life, it offers a compelling exploration of resilience and the human spirit. It serves as a reminder of the power of hope and the potential for personal growth even in the most challenging circumstances. Gully is a film that lingers in your thoughts long after it ends, leaving a lasting impression.\n\nGully is a raw and captivating urban drama that stands out for its exceptional performances, striking visuals, and compelling storytelling. It sheds light on important social issues while also delivering an emotionally charged narrative. If you're a fan of thought-provoking films that push boundaries, Gully is a must-see."
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "zzchdgxzp",
        "review_rating": "10",
        "review_title": "Brilliant Film",
        "review_detailed_main": "Perfectly encapsulates the disparity between white privilege and black impoverished America. Traumatic childhoods bond three teens tightly together for survival and mutual companionship, unconditionally accepting of each other. They've matured on their own with little to no guidance amid dysfunctional family environments and influences; one raised by a white single mother of two with no functional employment prospects, another struggles with serious mental illness, and the third is victim of a crime of opportunity, kidnapped and held for a decade by a white pedophile from a loving and encouraging mother. A true expose on the reality of how unresolved childhood trauma drives teenage behaviours. This movie connects all the dots, and is sheer brilliance!!"
    },
    {
        "movie_id": "tt5013984",
        "movie_name": "Gully",
        "movie_rating": "2.8",
        "review_username": "randymorin-50830",
        "review_rating": "",
        "review_title": "Starts off well, then dips into utter chaos! So I stopped watching",
        "review_detailed_main": ""
    }
]