[
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "darpanthacker",
        "review_rating": "8",
        "review_title": "Sweet pure love story",
        "review_detailed_main": "There are certain films that you go to watch with low expectations and they just blow you off with impeccable story telling. DumLagaKeHaisha is one of them.\n\nThere is hardly any moment in this 2 hr movie that can bore you and every scene has something to offer to the viewer. Its a simple story from Hindi heartland set on the basic premise that love cant be forced, it will happen if it has to no matter how the opposite person looks.\n\nPerformance wise lead protagonists - Ayushman Khurana and Bhumi Pednekar - are good. More importantly their odd chemistry works. Sanjay Mishra is top notch. Other supporting cast is also noteworthy.\n\nDirector Sharat Kataria is the one who deserves maximum credit for this lovely movie. He does not give too much space to melodrama and keeps the narrative simple. He does take some cinematic liberties to tell his story but that can be easily ignored. Finally, kudos to YashRaj banner (which has produced some obnoxious movies recently) for supporting this movie.\n\nGo watch this movie. It deserves a share of your income to say the least."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "sendmailtojk",
        "review_rating": "8",
        "review_title": "Heartwarming and believable",
        "review_detailed_main": "It is never easy to make a movie about a topic like this. Past attempts have mutilated this kind of story so I was skeptical.One is happy to see that the characters (especially the leads) don't take unhealthy and impractical steps. Also there was no (unnecessary) villain waiting to take advantage of either of them.\n\nBhumi acted so believably and Ayushmann complemented her acting. These kind of movies hopefully should be eye openers to ignorant parent in Tier-2/Tier-3 cities and towns and not force their children into arranged marriages. It was just a luck break that the contest (in the end) resolved the marital issues; everybody does not get the same opportunities.\n\nHats off to the cast and Director for pulling off a superb movie."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Peter_Young",
        "review_rating": "8",
        "review_title": "Charming, just charming",
        "review_detailed_main": "Dum Laga Ke Haisha is produced by Yash Raj Films. Thinking about the Yash Raj productions of the early 2000s, one cannot escape the vision of glossy, expensive mainstream films, very romantic, often based abroad and if not, centring on wealthy individuals. Some of them were wonderfully entertaining, including Hum Tum and Salaam Namaste, which were racy and socially progressive for the times, but generally most of their films became quite synonymous with superficial and shallow commercial potboilers with nothing substantial to offer. Following quite a few exceptional gems earlier, like Band Baaja Baaraat and the likes, which started the trend of social and realistic romantic films, Dum Laga Ke Haisha is even a bigger step toward a whole welcome change in Hindi cinema, and it really is a breath of fresh air in both story and execution. This new brand of mainstream Hindi cinema, which deals with everyday issues within simple families from India's lower middle class, is a real blessing. Gone are the days when Indian filmmakers insisted on showing only the glamorous side of India or being ashamed of its simpler reality. On the contrary, recent commercial films, and this film definitely among them, celebrate this simple part of India, celebrate its beauty and cultural richness, going back to the magic of Hrishikesh Mukherjee's memorable middle-of-the-road cinema.\n\nIndeed, Dum Laga Ke Haisha is one such film - it is beautiful, authentic, and it has this sense of everydayness that makes it a terrific watch. Obviously, the core theme of a young guy who is caught in an arranged marriage with an overweight young woman for whom he has zero attraction, is a true draw in and of itself, but it's not just that. The film is charming, just charming in the way it embraces its characters, its story and situations, in the way it rejects stereotypes, and in the subtle portrayal of the romantic buildup between the two leads. Acting-wise, too, the film is a delight. Ayushmann Khurrana as always does his socially conscious cinema, and he is terrific here. He is easy to judge or dislike, but at the same time so easy to understand and feel for. His gradual growth is convincingly portrayed. It is Bhumi Pednekar though who dominates this film with her brave turn. Obviously, the physical change is admirable (she put on quite a lot of weight for the part), but just as a character, she is wonderful, putting in a consistently credible, compassionate, and touching performance. A host of tremendous supporting actors all work together brilliantly. Dum Laga Ke Haisha is set in the mid-1990s, and it also manages to bring some nostalgic value for the music and innocence of those days. The film's last sequence is a cinematic triumph and a great conclusion to this wholesome entertainment that is both enjoyable and educational."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "jay-techie2007",
        "review_rating": "10",
        "review_title": "Must Watch Movie of 2015. Ayushmann Khurrana has a long way to go!",
        "review_detailed_main": "DLKH brings the much needed freshness in Bollywood romance movies. And it comes with a very strong message woven around a very sweet love story. The direction is impeccable with moderated melodrama.\n\nAyushmann Khurrana might never get the stardom like the Khans and the Kapoors but he is definitely one of those actors never afraid of doing path breaking movies and top them up with amazing natural acting - be it comedy or drama. But he gets a good competition from the new girl Bhumi Padnekar who delivers a very good performance, depicting a struggle of a fat girl in a white skin - size zero obsessed society of India. Sanjay Mishra, playing the role of Ayushmann's father, gives a memorable performance with really good dialog delivery topped up with brilliant comic timing.\n\nThe length of the movie is unusually short for a Bollywood movie but then quality is always more important than quantity. Overall, for someone in a mood to watch a light romantic movie, your search ends at DLKH.\n\nThis movie comes easily into the list of \"movies I can watch anytime\"."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ketgup83",
        "review_rating": "10",
        "review_title": "Do yourself a favor, go and grab the tickets and embrace Dumb Laga Ke Haisha",
        "review_detailed_main": "When a movie teaser is released, it has to be catchy and interesting that should fuel the curiosity among the moviegoers to spend few bucks for that cinema. Dumb Laga Ke Haisha exactly works on that strategy. It had limited release ( 769 screens all over India) with shoe-string budget ( 13 crores) and unknown star-cast. What worked in its favor - is applauding performances, immensely likable story and mind-blowing script.\n\nMarriages are made in heaven but for Prem( Aayush Khurrana), it was made in hell. In Dumb Laga Ke Haisha, marriage is made between two people of different background, different thinking and in different size.\n\nNew-bee director Sharat Katariya( 10 ML Love) is probably the talent to watch out for. The theme of the movie is simple yet noble, set in the mid-90's with background of beautiful city of Haridwar about simple, ordinary and middle-class business family which will remind of classic movies by Hrishikesh Mukherjee and Basu Chatterjee. The movie is intrinsic to its core right from the beginning with hilarious moments enough to tickle your funny-bone. The initial reel will definitely bring down the house when the boy meets the girl. Even the divorce scene, the fight between the neighbours has been executed brilliantly that would put a smile on your face. Hats off to the director and script writer for making the best out of it. Background score and music is limited yet convincing. Art direction representing a typical middle-class household is worth-mentioning. Cinematography capturing the essence of Haridwar is eye-catching. Coming to the performances, Ayush Khurrana does a fabulous job as a push-over, introvert, loyal son. He does a good comeback after series of flops. New talent Bhumi Pednekar should walk away with few awards this year. This is her first film and the amount of maturity she shows in her acting is astounding. Sanjay Mishra as usual is brilliant.\n\nDo yourself a favor, go and grab the tickets and embrace Dumb Laga Ke Haisha. Astounding 5/5"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "A simple, sweet but hurriedly made film lacking emotional depth with a soundtrack reminding you of the musical 80s & 90s",
        "review_detailed_main": "If a film reveals almost everything about the storyline in its 3 minutes trailer itself, then there is only one way it can win over the viewer and that's with its extra ordinary execution, performances and music. Thankfully Dumb LAGA KE HAISHA does exactly the same moving over its predictable drawback, presenting itself as a short (111 minutes), simple and sweet film that can easily connect to its audience with the realistic card played quite well.\n\nNo doubt the film leaves you in a less satisfied state as it ends contradicting to the expectations raised by its enjoyable beginning. But giving the producer, writer, director & the performers their deserving due, allow me to mention its entertaining features first before the avoidable ones.\n\nBeginning with the biggest name in the project, DLKH is a pleasant surprise coming from the reputed banner of YRF and as per my opinion, this is their second appreciable project post ROCKET SINGH not depending upon any clichéd romance between the stars playing the lead characters. At first the film reminds you of NASEEB APNA APNA (1986) made on a related subject but then (moving on a different path) its proceedings take you back in those musical decades of 80s and 90s with all those cassettes, ribbons, their entangling, cassette to cassette recordings, big speakers and the times when we used to bring a Colour TV, a VCR and four Video Cassettes of different films on hire for the whole night. The voice of Kumar Sanu superbly used by Anu Malik (in the same way as it used to be in those hit songs of that era) makes you feel the nostalgia and so does the sound of \"Miley Sur Mera Tumhara\" running in the backdrop. Also the \"Shaakha\" reference reminds you of the days when RSS Shaakhas were quite active in the mornings, inviting all from every age group ranging from 10 to 60.\n\nIntroducing another first in a YRF film, here we have an unknown \"heavy weight heroine\" instead of the inviting glamorous one, who actually carries the entire film on her shoulder alone, ahead of her known lead hero. The highly relatable family, their lovable interactions and the collective middle class ambiance pulls you in before the intermission and the impressive spell continues in the second half too (with the court sequence and more), till it all moves down to a highly predictable and unconvincing section of 'The Game' ending on a quite less impressive note along with a smart cameo of Kumar Sanu keeping the nostalgia intact.\n\nIn other words, Dumb LAGA KE HAISHA majorly works due to its realistic local feel, lively characters, melodious music and performances. But it certainly should have worked more on these same elements with few stronger insertions in its storyline making it a bit longer ending on a different note than the game. For instance the English exam sequence added deliberately fails to make any kind of impact on the viewer, the lawyer speaking long lines in English with the girl's family looks weird and the climax game too doesn't turn out to anything close to reality or natural.\n\nFurther apart from the storyline, the second disappointment is felt when we don't find the songs incorporated in the film in their complete form as it used to be in the 90s (since the film is based in that era only). Yes, director Sharat Kataria does deliver a notable product with many fine performances and all the 'time related detailing' worked beautifully with his cinematographer and art director. But why he didn't work on the story adding more twists and didn't include the melodious songs in the film's narration was really puzzling for me quite honestly. In fact it was highly disheartening seeing \"Tu\"and \"Moh Moh Ke Dhaage\" used as a backdrop and \"Dard Karara\" coming with the end credits while people were moving out of the theatre leaving it in the mid.\n\nIn the performances, it completely belongs to the debutant Bhumi Pednekar and Ayushmann Khurrana in this particular sequence only. Though its tough to comment upon her future film career as such but Bhumi shows her talent superbly and helps the film a lot as a complete natural or flawless performer. Ayushmann once again is decently good but at the same time looks like repeating himself at many places that needs to be taken care of urgently. In the supporting cast we once again have Sanjay Mishra and Seema Pahwa (after ANKHON DEKHI) along with Sheeba Chaddha and more. Their individual acts are all fine but I couldn't find that simplicity and natural ease witnessed in the similar homely characters of ANKHON DEKHI. Putting it clearly, they all seem to be playing their natural middle class acts with a visible effort that was not actually there in ANKHON DEKHI and perhaps that's the difference caused by a director's exact instructions and vision.\n\nMay be due to this very reason only the film looks like a hurriedly made project, lacking the depth it should have in its various portrayals missing that much required emotional pull or feel. It's as if the producer's instructions were, that just make a light hearted film with not so heavy emotions, hanging in between a romantic and comedy product that has more commercial viability in today's changing times.\n\nSo made exactly as per the above probable instructions, Dumb LAGA KE HAISHA does provide that light entertainment largely due to its nostalgic ambiance, good performances and a comeback soundtrack by Anu Malik. But don't look for any emotional depth or some exceptional storyline here offering something extra than what was there in its trailer. It's a simple and sweet film intentionally made to make you smile without much thinking, sobbing or heavy hearts."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "auti43",
        "review_rating": "10",
        "review_title": "Subtle comedy",
        "review_detailed_main": "This movie does touch the realistic side of commoners with a hint of comedy within it. In a span of two hours the movie covers all the problems and changes a newly wed couple go through. Groom not ready to accept that bird watching is no more an option for him and bride trying to settle in a house where her education is an envy point for others. The comic melodrama keeps the viewer glued to their seats till the end of the movie. Music is nice and simple which pushes viewer to cherish the old and simple times. It was hard to believe that Bhumi Pednekar debuted with Dumb laga ke Haisha. Her eyes and facial expressions never made me feel that I was missing anything in the movie. Part I loved was, when Ayushmaan and Bhumi fight over the songs to be played in the tape recorder. Must say a brilliant idea!!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ahegde3149",
        "review_rating": "6",
        "review_title": "A subtle take on marriage",
        "review_detailed_main": "'Dum Laga ke Haisha' is a finely made film with a charming script and solid acting. While the story may be plain simple and honestly predictable still it doesn't fail to hold your attention for 2 hours. The story is set in 1995, Prem(Ayushmann Khurrana) is a class 10 failure runs his father's (Sanjay Mishra) cassette store in Haridwar. He is forced into marriage with a overweight girl Sandhya (debutante Bhumi Pednekar) by his family. Sandhya is a graduate and Prem's family believes arrival of an educated girl in the family will bring prosperity. Prem is finding very difficult to happiness with his forced marriage and what follows is nothing surprising.\n\nDespite the predictable simple story, 'Dum Laga Ke Haisha' has the strong point of subtle production design and great cinematography capturing the 90s era beautifully. The songs of Kumar Sanu played on cassette players certainly pushes up the nostalgia. There is also quite a bit of quirky humor and typical Indian family drama to spice up the things. But I did feel the some work could have been done in editing department as the story drags on for 2 hours. Ayushmann redeems himself after the disastrous 'Hawaizaada', Sanjay Mishra is entertaining as always and Bhumi Pednekar shows her talent with solid debut. The songs are quite melodious, I especially loved 'Moh Moh ke Dhaage'. With some negatives but more positives 'Dum Laga Ke Haisha' is not the best year for me(it's still Badlapur) yet its worth a shot!\n\nRATING: [3/5]"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ritwikroyunlimited-220-824722",
        "review_rating": "10",
        "review_title": "A film made from heart",
        "review_detailed_main": "A film released.... a stereotype breaks.... an actress doesn't need to be size zero to become a heroine.... A strong story line, screenplay, dialogues, performances by Ayushman khurana and the newcomer bhumi phednekar.... is ready to surprise the audiences.... Music by Anu Malik gives a down to memory lane ride of the 90's.... its a Kumar Sanu Musical all the way...this is the first time i saw audiences sitting right till the end until the song is finished.... Finally with Dumb LAGA KE HAISHA.... Yash raj Films comes up with another love story with a standard of DDLJ and Rab ne bana di jodi..... Its a thumbs up for this movie....."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "shiragaonkarshweta",
        "review_rating": "7",
        "review_title": "One time watchable.",
        "review_detailed_main": "Movie is mild and good, all cast has done wonderful acting, songs are melodious."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ayanpal1",
        "review_rating": "9",
        "review_title": "Size Doesn't Matter - Grey Matter Does",
        "review_detailed_main": "Dumb Laga Ke Haisha is a movie that celebrates the unfounding of size and space, and juxtaposes it against the flight of ambitions in a detailed, layered, yet breezy romance that acts as both a social commentary, as well as a mainstream romantic comedy.\n\nA narrow by-lane in Haridwar leads to a narrow minded class ten failed simpleton Prem (Ayushman Khurana in a refreshingly natural role) of the 1990s who dreams of Juhi Chawla but is instead married off to a portly and much more educated Sandhya (Bhumi Pednekar in a supremely brilliant and dauntless debut).\n\nWhile she dreams of a government job as a school teacher and a husband who respects her, he has nightmares about everything she stands for - be it her intellect or weight. What follows is a refreshingly original and daring film that overcomes stereotypes while bringing a smile on our faces, even as it tugs at our heartstrings.\n\nHere the 90s is captured in stunningly nuanced detail by writer-director Sharat Katariya several times, as is the language of Uttar Pradesh (mostly), and the life of a small town (perfectly).\n\nBe it a dash of Limca to get over retching, the unspiralling of cassettes using pens, watching of movies in VCPs and VCRs, using landline phones, giving missed calls, the fascination with Kumar Sanu, or a fight using songs being played by a warring couple, the makers get the 90s spot on. What also makes the majority of the scenes worth the 'wait' is Bhoomi Pednekar who 'weighs' her emotions while adding ample 'weight' to her character through a gamut of emotions that are sure to resonate with your heart.\n\nAdding 'weight' to the plot is a series of sub plots involving a separated elderly aunt, parents and in-laws struggling with their values, ethics, and modernity, a young brother preparing for his board exams, a 'sankha' with its moralistic lessons, jealous friends, and a contest 'Dum Laga Ke Heisha' aimed to test the ultimate bonding between a married couple. There is humor, action, emotion, shame, romance, and triumph in equal measure that help the film measure up to the 'weighty' expectations of any discerning viewer gasping for a breath of fresh air. What helps is an able supporting cast that makes you want to 'wait' and watch the proceedings.\n\nThis small film involving small town people is sure to occupy a not so small space in your hearts and minds. All you need to do is give it a chance - just like the leads of this film are told time and again, and love will surely follow.\n\nWatch it for an era gone by, for an unconventional heroine, for relationships that survive against the test of time, and for that sense of nostalgia that is impossible to ignore. And last, but not the least, for Kumar Sanu - who is back (along with Sadhana Sargam and Annu Malik no less). This 'Ishq' is 'Kararaa' indeed... and definitely worth its 'weight' in terms of originality, story, and execution. What are you 'waiting' for? Watch it in your nearest theater and do your bit to support good mainstream cinema with a refreshing storyline... Take a bow Yashraj Films!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Jini-B",
        "review_rating": "7",
        "review_title": "A Beautiful Love Story",
        "review_detailed_main": "There are all these movies currently doing the rounds in Bollywood that are just flash and no substance. And then there are stories like these. Pure, straight from the heart stories of people that deserve to be watched. This movie belongs to the latter category.\n\nIndia as a country is obsessed with fair skinned, thin people and everyone who falls out of these aesthetic distinctions, are treated as anomalies that are always ridiculed, often in terrible ways. This mentality has trickled down to every strata of society as is seen in this movie.\n\nHere, a well-educated girl is ridiculed by her husband simply because she is overweight. Her good qualities are not seen and her weight becomes her identity. What's so sad about this film is that this scenario is 100% true. Prem Prakash Tiwari enters into an arranged marriage setup with Sandhya Verma. At first, Sandhya tries to get to know and love Prem, but he is adamant that he cannot love Sandhya because of the way she looks. His mentality has been moulded in such a way by societal standards that he refuses to introduce his new wife to his neighbors. Over time, this builds a barrier between the two and Sandhya gives up on trying to build a good relationship with him.\n\nIt is what happens next that is so beautiful about this story. Prem is jolted into a situation where he has to rely on Sandhya and she has to rely on him and then they start to realize what love really is. Looks don't matter. The heart wants what it wants.\n\nThe acting was spectacular. Ayushmann is fabulous as Prem and even though you want to knock some sense into his character, you cannot harbor bad feelings for him because he is so endearing! Bhumi was very good in her debut role and my heart went out for her. She was beautiful as Sandhya. The supporting cast boasted of acting stalwarts like Sanjay Mishra and each of them were perfect in their roles.\n\nThis movie deserves a watch. Soulful and heart-warming."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "nairtejas",
        "review_rating": "5",
        "review_title": "Marriage Doesn't Solve Problems. ♦ 54%",
        "review_detailed_main": "Take a story, edit the characters, and present it in an easy way through music and subtlety, and you hope to flood the audience and the entertainment industry with a new wave of fresh air. Fortunately, the audiences are clever and kick it into the less-visited stream of mediocre attempts at inventive filmmaking. This film is one such mediocre attempt.\n\nThe year is 1995. An ignorant Kumar Sanu fan Prem (Khurrana), who runs his father's audio video shop in Haridwar, finds himself struggling with the threads and aftermath of a forced wedding. Equally ignorant are his family who think that the arrival of an educated girl (Pednekar) in their house would inspire happiness and bring about prosperity. Things get out of hand when Prem openly derides his wife's bulkiness. What follows is a seen-before parade of almost friendly intra- and inter-familial tiffs originating from this hassled marriage.\n\nThen the film uses same old methods for salvaging this implicated complication. As a result, predictability takes over and that fresh air turns stale. Now the setting is fine, where the guy is a 10th-grade failure and the girl a teacher aspirant: perfect source of egos that could wreak havoc. One senses the climax even before the film starts narrating its story, thereby losing its sheen. The expectations that a twist or a story arc would save the play ends in disappointment.\n\nKhurrana is good, but newcomer Pednekar is better. The former is in a different avatar than whatever he was in his previous disaster Hawaizaada (2015). Pednekar acts through her face and is only supported by her portly frame. Supporting cast is brilliant.\n\nWriting is good at parts starting with the collective wedding (samuhik vivah) and ending with a fun game. The no-nonsense narration always comes directly to the point. The short running time is a relief and so is the sporadic family humor that is better than the story itself. The mature setup and characterization further adds into the pleasure. The score sounded plagiarized, but the songs by Anu Malik are good. Welcoming Kumar Sanu to the industry after a long hiatus gives it brownie points. Great camera work captures the drama well while the native language adds to the originality, unlike how it was in PK (2014).\n\nBut if there is a best thing about the film, then it is the virtue of the husband who accepts his failures rather coming as a winner.\n\nBOTTOM LINE: The attempt is mediocre narrating a clichéd story, but for the multiple messages that it conveys and a simple storytelling, it is worth a lazy afternoon watch. 5/10.\n\nCan be watched with a typical Indian family? NO\n\nVulgarity: Mediocre"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "rohanthomas1988",
        "review_rating": "8",
        "review_title": "Its not about size...",
        "review_detailed_main": "If the idea of a perfect girlfriend for you is defined by her size, this film is for you. Unlike the 60s and 70s when voluptuous women ruled the fashion scene, in the 21st century models eat tissue papers to fill their stomach. Coupled with a few movies and the business propaganda of health products and gyms, you have the perfect formula for disaster.\n\nIn DLKH, the story surrounds a family which has reached an agreement with another for the marriage of their children. The groom is particularly unhappy with the shapelessness of his bride, but having to abide by custom chooses to get married anyway lest it should make his family upset. Soon after the wedding, the bride realises the extent of her husband's mental block, when he refuses to get anywhere close to her.\n\nThe narrative is slow, covering the intricacies of the character's behavior coupled with the happenings of a small town in India. The acting is top-notch, allowing the viewer to diagnose every aspect. The film throws out its moral at you and even if you don't accept it, you are left with no choice but to appreciate it nonetheless.\n\nWorth a watch."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ayushmahajandiary",
        "review_rating": "10",
        "review_title": "I didn't loose my smile for not even once for whole movie.",
        "review_detailed_main": "I was expecting to pass some time with this movie. Somewhere between first 5 minutes movies gets interesting for an Indian guy who knows that this kind of situation is very common. They acted in a comical way which, unfortunately, are some real reactions which are faced in Indian society. I do not know why I was smiling throughout this movie. Was it that this movie seems so real, have amazing actors, funny, a sweet love story. There is always a curiosity to know what next will happen, as it seems so real. This movie gets somewhat predictable somewhere near 30 hour before the ending but I was still curious. They didn't take the cliché road and maintained amazing story-line. Although ending was a little cliché but still it was sweet. Watch it if you can, you won't regret it."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "AP_FORTYSEVEN",
        "review_rating": "7",
        "review_title": "Sweet love story.",
        "review_detailed_main": "My Rating : 7/10\n\nA complete family entertainer with a love story at it's heart. 'Dum Laga Ke Haisha' won the 2015 National Film Award for Best Feature Film (Hindi) and it truly deserves it. The script of 'Dum Laga Ke Haisha' was written in 2007, almost seven years before the release!\n\nSuperb, authentic performances from the whole cast, special mention goes to Bhumi Pednekar for going the extra mile (who gained 30 kgs to land the role) and transforming herself.\n\nBeautiful movie and 'Moh Moh Ke Dhaage' is such a romantic track of recent years. Go watch it guys!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "varuna12",
        "review_rating": "9",
        "review_title": "The film is nothing but simplicity of characters who are bogged down with their below-average mediocre lives.",
        "review_detailed_main": "'DUM LAGA KE HAISHA'\n\nJust watched it and feeling so inspired. The film is nothing but simplicity of characters who are bogged down with their below-average mediocre lives.\n\n'Sandhya' a fat girl played so very beautifully by Bhumi Pednekar gets married to 'Prem' played so perfectly by Ayushmann Khurrana. Both are from similar socio-economical background but she is educated with a B.Ed and he is 10th fail. This is not the only reason for the unhappiness in their marriage. Prem finds her severely unattractive because of her appearance but this 'dislike' is furthered every she tries to say something or do something which Prem takes as her 'showing off' her education. All this leads a few nasty confrontations but eventually they start understanding each other.\n\nThe film has some very depressing but realistic scenes portrayed realistically by all the characters, especially Seema Pahwa ji, Sanjay Mishra ji and Sheeba Chadda ji (that one post phone call scene is hauntingly realistic and saddening portrayal!!!!) Don't know why it brought tears to my eyes and that hasn't happened in years!\n\nIts an amazing film and one must watch it at least once. The 'art' is amazingly done by one Meenal Agarwal and its totally believable and realistic! The photography is beautiful with some really beautiful 'arty' shots, and its crisply cut by Namrata Rao.\n\n'Moh Moh Ke Dhaage' is an amazingly beautiful and soulful song that I am playing on loop right now while writing this.\n\nLoved the film! My ratings: 9/10 * * * * * * * * *"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "loveanni08",
        "review_rating": "7",
        "review_title": "One time watch.",
        "review_detailed_main": "Just saw this yesterday. I loved the film. Ayushyman was fantastic. He's a very good actor. The film take us into 90 's. Because of Kumar Shanu's songs. And Anu Malik music is quit good. Story is not that good but all over acting is good. You should watch it once. It drives you in 90's. Ayushman you have proved it again. You can enjoy it though. One time watch. I don't think its a bad movie but its an ordinary movie. It doesn't suck. Enjoy it. Its a fresh story. Not a copycat. That is the main point of this movie. Its an original Bollywood tale.I hope you make sequel to this as producer, keeping Zoya on director's seat again, as I think, she was brilliant as director. She might have lived her life with lots of male friends as it not for a single moment seems like a film directed by lady director (which was the only minus point of LBC from my point of view). Hoping to see more from her."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "hamzakhanvit",
        "review_rating": "9",
        "review_title": "You'll love it if you were a kid from the 90's.",
        "review_detailed_main": "A beautiful movie which will take you back in the lovely 90s. If you are a person whose childhood days were spent in a middle class family, residing in a typical U.P. mohalla, then you might find many things that will be a reflection of your childhood. Though a few scenes in the movie are overdone and overemphasized, but still a lot can be enjoyed. Kumar Sanu's songs are as melodious as ever, with Sadhna Sargam and Anu Malik adding more sweetness to it. The songs are really catchy and I can assure you that they'll be looped many times in your ipods/music devices. The movie is worth watching with your family in a theater, so my advice to you is not to ruin the feel by watching it on a crappy pirated DVD or online.\n\nCheers, :)"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "shabin-sajan",
        "review_rating": "6",
        "review_title": "Watchable flick",
        "review_detailed_main": "It's a watchable flick with a different story line and good acting by Ayushman, Bhumi and the others characters in their families in the movie."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ronakkotian",
        "review_rating": "8",
        "review_title": "A triumphant love story",
        "review_detailed_main": "Dum Laga Ke Haisha is a true gem. A film that is so beautifully made whilst providing social commentary about size and regular Indian stereotypes is a film that shouldn't be missed.\n\nI applaud Sharat Katariya for making this film. His script is wonderful, full of heartfelt emotion, great characters and creates the 90s atmosphere with so much detail. His direction alongside this brings the film to life. Katariya's attention to detail impressed me a lot. The use of Cassettes, Landline Phones, VCRs and Kumar Sanu feels so reminiscent of the 90s and the portrayal of Uttar Pradesh is so accurate that you feel like you're in the same world as the characters. The characters he's created are fully fleshed out and grounded at all times.\n\nAyushmann Khurrana was brilliant in this film. His emotions accompanied with the way his character is written adds so much depth to his role. Bhumi Pednekar is a clear winner in this movie. As a debut she gives a very realistic and honest performance. Her chemistry with Khurrana is perfect as well. The supporting cast are also great and hilarious especially Sanjay Mishra. Everyone's performances combined makes the story so much more investing as the drama that occurs throughout the film feel real and not over the top.\n\nDum Laga Ke Haisha is a film that needs to be watched. Not only does it have some memorable characters that are realistic, but it also has a strong message about the way one should be treated as well as breaking the rules of Indian stereotypes. Whilst the story may be predictable, it's the characters and mix of emotions that win you over and that what makes this film special."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Prabhat_KS",
        "review_rating": "7",
        "review_title": "An Emotive, Entertaining and Heart-Warming Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "GypsiB",
        "review_rating": "4",
        "review_title": "Pednekar is Fantastic, the Rest of the Movie is Not",
        "review_detailed_main": "Prem (Ayushmann Khurrana) is persuaded by his family to marry for financial reasons to an overweight woman he doesn't find attractive. His new wife, Sandhya (Bhumi Pednekar ) is an educated woman who tries to make her marriage work, but Prem has no interest in so doing. They are persuaded to take part in the \"Dum Lagao\" contest, where the husband carries his wife on his back through an obstacle course, in so doing they reconcile.\n\nThe premise of this movie is fantastic, but it just doesn't deliver. There is very little character development, less happiness, and an ending that is too sudden and not credible. Khurrana, who is too old for the role, wears a scowl the entire movie and plays his part one- dimensionally. Pednekar, in her first movie, is fantastic, giving depth to Sandhya, portraying believable emotions, and acting nearly flawlessly. Her performance is so good that she nearly saves the movie, but not quite."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Swatisamant",
        "review_rating": "10",
        "review_title": "Most entertaining movie of the month- simple yet refreshing !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "epcot26-1",
        "review_rating": "8",
        "review_title": "Good movie, but a few unresolved issues",
        "review_detailed_main": "This movie was great in its simplicity! Ayushmann Khurrana was okay in the film. Bhumi Pednekar was the saving grace of the movie. Her acting expressions made the movie more attractive and enjoyable to watch.\n\nI had to put on the subtitles because they were speaking in such strict Hindi, so many of the words were either mumbled, or I plainly could not understand them.\n\nThe unresolved issues, if resolved in a tactful way, would have made the film much better; Prem's education, the state of the cassette shop and the idea that if Shandya was educated, she could have given the family ideas on how to save the shop, so they would feel she is not just bragging and showing off her education, she is using it to help them, which would then inspire her husband, Prem, to complete his education. The ending song was a complete waste of time and money for the film producers...what a horrible song to put out in 2015, even though the film was set in 1995, but still...why? Last issue; Kumar Sanu, really?"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "sesht",
        "review_rating": "",
        "review_title": "Jhankaar Beats",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Tanay_LKO",
        "review_rating": "7",
        "review_title": "A Dumdaar rom-com; Bhumi Pednekar is \"Debutante of the Year\"",
        "review_detailed_main": "\"Dum Laga Ke Haisha\" is one of the most genuine, relatable and enjoyable rom-coms to be produced in recent times under the banner of Yash Raj Films and the Hindi Film Industry alike; its palpable, mostly captivating and at times even \"adorable\".\n\nSet in the backdrop of Haridwar of '95, DLKH revolves around a young, under-qualified, inferiority-complexed Prem Prakash Tiwari (Ayushmann Khurrana) and his coeval, Sandhya (debutante Bhumi Pednekar), a well- educated teacher. The conflict arises when they both are wedded away by their families, and it's tussle all through for them to settle down; of course with humorous outcomes.\n\nThe best product of this film is Bhumi Pednekar, hands down! She is a \"casting delight\" and emotes well-seasoned expressions in her scenes with such ease and confidence, that it won't be an exaggeration to say that she easily outshined her counterpart. Other pluses of the film are its screenplay and dialogues by writer- director Sharat Katariya and editing by National Film Award recipient Namrata Rao, which make the film's flow smooth and worth more.\n\nThe film has its low moments too, mainly due to its inefficient cinematography, and the not so impressive acting by supporting cast, with the exception of – Sanjay Mishra, Alka Amin, Seema Pahwa, Sheeba Chaddha – who actually make the film pleasantly rustic and realistic.\n\nAnu Malik's first music-collaboration with YRF is mentionable. Also, two songs sung by Kumar Sanu reminiscent of his '90s style, mark his comeback of sorts in the mainstream. However, the one standing out is \"Moh Moh Ke Dhaage\" sung by Monali Thakur - mellifluous, and illustrates the feminine side of a conjugal love in-blossom.\n\nTo summarise, the film is a must watch for all the aficionados of romantic-comedies, because it is more of a \"laugh carnival\" than the run-of-the-mill laugh riots mostly produced these days. Finally, as American Journalist, Roger Ebert said, \"No matter what they're charging to get in, it's worth more to get out\", and DLKH would prove to be that.\n\nRating – 7.5/10 Verdict – Very much watchable!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "uprashanthnayak",
        "review_rating": "9",
        "review_title": "One More Sucker Realizes Ultimate Tolerance.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "afsalthodupuzha",
        "review_rating": "7",
        "review_title": "Love Comes In All Sizes...Indeed!",
        "review_detailed_main": "Director Sharat Katariyas Dumb Laga Ke Haisha set in 1995 Haridwar recreates the quintessential 90s and tells the story of an arranged marriage between the unlikely couple of Prem Praksah Tiwari,played by Ayushmann Khurana,a jobless high school dropout who is an ardent devotee of Kumar Sanu and a well-educated chubby girl Sandhya Verma,Played by Bhumi Pednekar whos aspiration is to become a high school teacher.Filled with innumerous elements that can instantly evoke nostalgia of the glorious 90s,Dumb Laga Ke Haisha breaks the typical bollywood heroine stereotype,putting forward a message that love can come in all sizes!who doesn't agree??\n\nSharat Katariya,who earlier directed an easily forgettable 10 ml Love and penned for films like Bheja Fry,Sunglass and Hum Tum Shabhana has done a decent job presenting the confusions,fun and ego-melee that can arise when two entirely different people tie up the knot,utilising the unconventionality in the pairing really well.The art direction team has done a fantabulos job recreating the bygone era of 90s filled with VCRs,audio cassettes,Bajaj scooters,land line phones and what not!With such careful setting and songs of the likes of Mile Sur Mera Tumhara playing in the backdrop,the sense of nostalgia is exhilarated to another level indeed.\n\nThe screenplay written by Sharat himself is simple and refreshing even though many unwanted subplots could have been avoided for increasing the crispness of the movie.Editing by Namrata Rao is mediocre and produces lag in between,even though the running time is just 131 minutes.\n\nComing to the performances,its Bhumi Padnekar who steals the show with her matured performance that saves the movie at times when it seem to sink a bit.Without showing any shades of being a newcomer,Bhumi pulls out the character invested upon her with really impressive dialog delivery and mannerisms.Ayushmann Khurrana nevertheless played his part really well and reminded of Salman Kahan in the early stages of his career.Among others Sanjay Mishra,Seena Pahwa etc did their part well.\n\nMusic and BackGroundScore play an important role in the narration and Anu Malik along with Andrea Guerra has done an impressive job creating a soundtrack that has some really melodious tracks like Moh MohKe Daage ,Tu and Dard Karara.All the songs have been placed well by Sharat without compromising the pace of the movie.It was really soothing to hear the voice Kumar Sanuwho also play a cameo as himself in the movie alongside Sadhana Sargam recreating the magic of 90s again with the well-picturised Dard Karaara,that right away reminds us of the combination of Salman Khan and Madhuri Dixit from the early 90s.\n\nSome +Ves ::*Music & BackGround Score *Lead Performances *First Half & Climax *Well-Utilised Elements Of Nostalgia That Reworks The Magic Of Mid 90s.\n\nSome -Ves::*Editing *Slow Pace Of Narration.\n\nOverall,Dumb Laga Ke Haisha is a sweet,feel-good romance that makes up for a decent watch from the cinemas.\n\nVerdict::Even though Dumb Laga Ke Haisha is far from being called perfect,this romance has its worthy moments that sums up for calling it a decent,feel good watch for a relaxed afternoon.With numerous sequences that can instantaneously create nostalgia of the bygone era of 90s,this one from Yashraj is worth a try for all those who love romantic entertainers.Go for it! Ma Rating::7.5/10"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Srinivas_Reddy90",
        "review_rating": "8",
        "review_title": "Beautiful Movie",
        "review_detailed_main": "Must watch. Good movie very original. Performance wise lead protagonists - Ayushman Khurana and Bhumi Pednekar - are good. More importantly their odd chemistry works. Sanjay Mishra is top notch. Other supporting cast is also noteworthy. Giving 8/10"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "pradiptadas1982",
        "review_rating": "7",
        "review_title": "A beautiful n fresh Love story portrayed by heart.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "lushangmodi",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "From this movie Era of king Ayushman start. Bhumi superbly portrayed her character. And supporting cast are like cherry on the cake. Anu Malik gave his best score. Nothing wrong in this movie"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "farhad-03526",
        "review_rating": "7",
        "review_title": "A short and sweet family movie with a nice message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "westsideschl",
        "review_rating": "4",
        "review_title": "Had Potential",
        "review_detailed_main": "Continuing a string of recent Bolly improvements with film topics such as women's rights; child disappearances, this one deals with Bolly's obsession with selling/promoting superficial skinny model features to an audience to whom this is an unrealistic fantasy (well, OK a common selling attribute in media though out the world). Made worse when that audience is largely uneducated and stuck in poverty. The reason this film is not more highly rated is that it was an unrealistic happy/feel good storybook ending. Especially, carrying twice the weight over a long cross country course. A little too made up. Other Bollys of recent good quality are \"Badlapur\", \"NH 10\" and \"Ugly\"."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "capetownrahul",
        "review_rating": "9",
        "review_title": "A classic of 2015.",
        "review_detailed_main": "There are a lot of movies these days with big budgets,banner,actors etc or so called anticipated movies but if you watch those movies; they turned out to be non sense(NOT ALL). For example Bang Bang and Bombay Velvet. If you talk about Dumb Laga Ke Haisha, it blown away my mind. There are 4 exceptional qualities of this beautiful movie which are location, great acting by all, the accent used and above all the simplicity.\n\nA much needed movie for Ayushmann Khurana, who i thought flawless and reminded me of the great Sanjeev Kumar. If someone acts like him, then there is no need for 6-8 pack abs. The newcomer Bhumi was also brilliant and will fetch some awards next year. No need to mention Sanjay Mishra and other characters actors who were great too. Sharat Kataria(Director) did a phenomenal work and i expect more good and meaningful movies from him in future. This movie will remain in your heart for many years to come."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "shubhadeepsarkar-257-155020",
        "review_rating": "8",
        "review_title": "A simple story narrated beautifully",
        "review_detailed_main": "The story isn't of any superhuman who saves many or fights 20 villains alone. Neither is it of a prodigy who can sing and dance very well to beat the competition. It's about everyday people who face small and big challenges in life in their way and either struggle hard to change things or to some extent start compromising with them. The storyline of the movie is beautiful and keeps the audience engaged throughout the film. The climax is nail biting. However, the main charm of the film is in the nuances, with its desi dialogs and mannerism of different characters. All the actors have done brilliant job and have slipped into their characters brilliantly. Overall, it's a simple story narrated beautifully!! Enjoyed it a lot. I wish more of such lighthearted and down to earth movies are made in Hindi cinema."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "krrishnatra-pandit47",
        "review_rating": "9",
        "review_title": "True Indian Movie......... Real 90's Flavor.... 80% Indian will relate.....",
        "review_detailed_main": "I Usually don't watch Bollywood movies........ becoz 90% of them are copied from Hollywood... but some low budget true Indian movies made by new directors are great like Khosla Ka Ghosla, Oh My God.... so on...\n\nSo this movie is of that caliber....... Cinematography is simple and done with simple techniques but looks like french art movies like Award Winning movie \"Amelie\"..........\n\nBetter than commercial movies in many ways......... heart touching romantic comedy.... must watch.....\n\nevery actor has done justice to their characters... star-cast for this kind of movie is great..... SPECIAL ACTING SKILLS SHOWN BY DEBUT ACTRESS \"BHUMI PEDNEKAR\" SHE HAS DONE GREAT GREAT JOB REALLY.... MUST BE APPRECIATED... BETTER ACTING SKILLS THAN EVERY OTHER BOLLYWOOD A-LISTER ACTRESSES.....\n\nFINALLY MUST WATCH MOVIE.........."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "vijaychauhanindia",
        "review_rating": "7",
        "review_title": "Very Nice Effort with something different",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "starboy-74025",
        "review_rating": "9",
        "review_title": "Lack of duration",
        "review_detailed_main": "The film is beautiful but could have been batter with length"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Ansango",
        "review_rating": "7",
        "review_title": "Sweet,innocent and refreshing",
        "review_detailed_main": "What a movie... It is so different and so real.You never feel that you are watching a movie,it feels like watching an incident of our locality on celluloid.The script is so good and the screenplay is brilliant.The movie shows a new and unseen face of Haridwar,which is superb.The main charm of the movie lies in its simplicity and its quirky humor.\n\nAyushman is brilliant in the role of a submissive boy.He expresses his subjugation,hesitation,uneasiness and confusion in a brilliant manner.Bhoomi is awesome.Her acting looks so believable.Supporting cast is brilliant.\n\nDirection is awesome.Music of the movie feels refreshing and takes you back to 90's.Editing is good.Dialogs are sharp and brilliant.\n\nIt is a must watch for romantic-comedy lovers.It is a funny and refreshing movie which takes you to a journey of fun and love.After watching this movie,your concept of perfect girl is sure to change. I would go for 6.8 out of 10 for this movie."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "johnpkeek",
        "review_rating": "9",
        "review_title": "Wonderful all the way..",
        "review_detailed_main": "Bhumi Pednekar, stole the show and could actually go on to win the best actor female on her debut itself. Its always great to see such movies and is a wonderful thing to happen, Queen last year and Dumb Laga ke Haisha this year.And like Queen this movie could also sweep all the awards next year.Ayushmann was good and so was Sanjay Mishra, he could also grab an award for his outstanding performance.\n\nIncredible story line, and is amazingly brought to screen by the director. Credits to the team, producer for choosing such a concept and the stars who have been associated with the movie.\n\nRating – 9/10 Verdict – Shouldn't miss this one"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Heartwarming!",
        "review_detailed_main": "'Dum Laga Ke Haisha' is a film with a big heart. This is a Heartwarming, beautiful story about two opposites. Its wonderfully written & excellently performed.\n\n'Dum Laga Ke Haisha' Synopsis: A middle class man marries an overweight women, due to parental pressures. Clashes follow...\n\n'Dum Laga Ke Haisha' is about two opposites, in terms of mentality & physicality, who try to find meaning in their relationship after they get married. The Screenplay beautifully narrates their journey, offering us moments, that are both, real & undeniably sweet. I connected with both of its protagonists & enjoyed the emotional wavelength they shared with each-other. Only glitch, the second-hour is slightly melodramatic & that segment of the story, is unimpressive. But otherwise, its competent.\n\nSharat Katariya's Direction is decent. Cinematography is picture-perfect. Editing is pretty crisp. Music by the legendary Anu Malik, is superb.\n\nPerformance-Wise: Ayushmann Khurana & Bhumi Pednekar are in top-form. Ayushmann is a terrific actor & he pitches in a sincere, earnest performance, that definitely ranks among the best we've seen off late. Bhumi is a revelation. She's simply brilliant in her part. And the on-screen chemistry between the two, is as real as it can get. Sanjay Mishra is flawless, as always. Seema Pahwa is first-rate. Others lend good support.\n\nOn the whole, 'Dum Laga Ke Haisha' wins you over with its charm & genuineness. Thumbs Up!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "shamik_ghosh-1",
        "review_rating": "9",
        "review_title": "So simple, yet precious",
        "review_detailed_main": "I have just finished watching the film. I could not resist myself from writing this review.\n\n\"Dum Laga Ke Haisa\" is a natural film which tells of ordinary people in ordinary situation. There is nothing heroic in this film, so lifelike and so natural. You may argue about the ending, but it did not seem unnatural to me at all.It is so blended with the film.\n\nExtra ordinary photography which relives Haridwar in all it's grandeur. Each and every frame is taken with great love and care. Here Haridwar, truly becomes the hero, if not Ayushmann.\n\nI wish, if we could all live our lives beautifully with our so-called imperfectness-es.\n\nWatch it, this might be one of the most beautiful films of the year.\n\nPlease share your opinion."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "likhithflix",
        "review_rating": "10",
        "review_title": "Lovely pair",
        "review_detailed_main": "After watching this film and shubh mangal saavdhan I fell in love with this couple they are so cute together they are very realistic actors Making movies with realistic stories hope they'll do great movies again in the years ahead"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "harineem-209-525488",
        "review_rating": "7",
        "review_title": "Charming simple story with good Hindi",
        "review_detailed_main": "Had heard the song \"Moh Moh ke Dhaage..\" many times but not seen the movie. Finally saw it on Prime and movie as good as the song. Its a very simple story of two mismatched people married and finding the differences don't matter when they love each other.\n\nAyushman Khurana excels in such roles and the actress Bhumi Pednekar is also very charming and good.\n\nA very refreshing movie from Bollywood where there is normal Hindi spoken unlike the Westernised one in most movies. Simple people leaving in simple houses and dressed like an average Indian. Overall an authentic Indian setup unlike the Western aspirational garbage aimed at NRIs.\n\nThe comedy works in all scenes and also the serious scenes played by the older actors is very good.\n\nA reluctant Prem is forced to marry an obese Sandhya because she is qualified to be a teacher and the family needs monetary help. Prem himself is a 10th fail due to his poor English skills. Prem cannot get over the looks of his wife and is further frustrated when he sees his friend marrying a pretty girl.\n\nHis wife who is an independent woman and no pushover can no longer take his indifference and files for divorce.\n\nLike a normal Hindi movie, the rest of the movie is how they reconcile and find love for each other."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "kaminnisreeram",
        "review_rating": "10",
        "review_title": "90s Nostalgia",
        "review_detailed_main": "One of the best films to come out of YRF banner. 90s generation will identify with that setting, those songs, magic of Kumar Sanu. Anu Malik has dn a fab job with music. Varun Grover's first National award 🥇 for Moh moh ke dhaagey. Full marks to Bhoomi & Ayushmann for breathing life into their characters. Such a strong supporting cast - Sanjay Mishra, Sheeba Chaddha, Seema Pahwa, Alka Amin. This film bot Ayushmann back from doldrums. Watch it for beautiful performances n a simple storyline that deals with complexities of self doubt and finding love."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "CriticGirl91",
        "review_rating": "9",
        "review_title": "A Very Mature Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "rajtsingla-333",
        "review_rating": "9",
        "review_title": "Sweet !!!! Simple !!!! Lovely !!! :)",
        "review_detailed_main": "A good movie to watch along with family. Each and every artist has delivered a very natural performance. Bhumi Padnekar , the lead female debutant, doesn't looks like a debutant on the screen. Her acting is flawless. Ayushman , has proved that desi boy roles are no big deal for him.Direction is good , in fact quite matured. Situational comic scenes and a simple husband -wife relationship story are the keynotes of the film. Music is OK,but it could have been better.Screenplay is very smooth. Dialouges sounds crispy in the regional accent. Technically it is a good film,but on entertainment scale it is a great film. No doubt , it is worth spending on this movie."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "yasachandra",
        "review_rating": "8",
        "review_title": "Nice little drama with a touch of romance",
        "review_detailed_main": "The movie is full of drama, shouting, hitting and all the mirch masala you could expect from a bollywood movie and the way the whole cast pulls it off is brilliant. Kudos to the casting and directing team for bringing together this brilliant team of actors. The story centers around the life a frustrated boy which could not be done any better than what Ayushman did. The story has its ups and downs but the brilliant acting keeps you engaged throughout. Totally recommend everyone to watch it."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "sinemafan",
        "review_rating": "8",
        "review_title": "Another hallmark film for Indian cinema",
        "review_detailed_main": "The move closely follows the journey of a young man who could very well be a stereotype of a frustrated Indian man who is trying to carve his own identity even as he battles the sense of failure that is not uncommon in India (especially semi-urban/small cities) given the limited job opportunities as well as the skewed (maybe justifiably so!) importance given to academic performance. Anyway, I cannot recall any Indian movie which deals with the subject of not being attracted to one's spouse and coming to terms with it as this one does. I think most of us who have grown up in small North Indian cities could relate to at least some aspects of the comical dialogue or situations that arise as the movie progresses. Though the film didn't seem evenly paced at times, overall I think the underlying message, script, acting and soundtrack (kudos to Andrea Guerra for the background score) make for an entertaining watch"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ercoolharry",
        "review_rating": "10",
        "review_title": "Realistic",
        "review_detailed_main": "An excellent movie with real life theme approach. I totally enjoyed it & could relate myself to it. Have a watch guys."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "anjali_r2014",
        "review_rating": "8",
        "review_title": "Sweet Romance that will touch your Heart",
        "review_detailed_main": "Frankly speaking, I didn't had very high expectations with the movie. But it turned out to be a very sweet cute one. The actors are the driving forces of this film. Ayushmann Khurrana, Sanjay Mishra, Sheeba Chaddha and last but not the least Bhumi Pednekar does well too considering that its her first movie. Ayushmann plays a typical small town boy in the 90s. He is quite charming with his different accent. Bhoomi has very well managed to look like a just married Indian daughter in law. The music is quite refreshing and different from the prevailing music (in a good way). The King of Romance Kumar Sanu has two songs. But my favorite is the one sung by Shreya. If you want to watch this movie then go for it. Its a nice entertainer. You should never miss this kind of a movie."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "shirishdutta-77476",
        "review_rating": "10",
        "review_title": "fantastic",
        "review_detailed_main": "Captures the essence of rishikesh in the best form, great performances by everyone and the best climax bolllywood has ever offered"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "hdbhandari",
        "review_rating": "10",
        "review_title": "Perfect entertainment and good social message.",
        "review_detailed_main": "Nice movie. Must watch."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "sujata-60749",
        "review_rating": "10",
        "review_title": "A Heartfelt Masterpiece: A Must-Watch Cinematic Journey",
        "review_detailed_main": "This movie, featuring exceptional performances by Bhumi Pednekar and Ayushmann Khurrana, has been an unforgettable cinematic journey. Every character is portrayed with such authenticity and depth, capturing the essence of the storyline, which resonates deeply with the audience. This film is not only an incredible experience but also a poignant reminder of the true meaning of love and acceptance. In today's fast-paced world, where stress often consumes us, movies like this serve as a valuable escape, reminding us of the importance of authenticity and human connection. I've personally watched this film two- three times, and each viewing has been as captivating as the first. It's a testament to the film's enduring appeal and its ability to touch the hearts of viewers time and time again. I wholeheartedly believe that everyone should watch it-it's worth every penny and every second of your time. Moreover, it beautifully conveys the message that societal constructs such as size, education, or any other aspect should never be used to judge a person. Instead, it emphasizes the importance of embracing ourselves and others for who we truly are."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "aanishjangra",
        "review_rating": "9",
        "review_title": "A perfect story!!!",
        "review_detailed_main": "Throughout the movie, I was totally lost in the awesomeness of this simple and sweet story. There was a constant smile on my face for the last 10-15 minutes. This is the content I am willing to pay for. A nearly perfect story!!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "curterlpv2",
        "review_rating": "9",
        "review_title": "One of the few best movies Bollywood delivers!",
        "review_detailed_main": "Every single actor actress performed very well. Natural settings, no artificial emotion, no green screen, overacting at all. This movie tries to portray a lower middle class family of 90s in haridwar, india in most natural way delivering the 100% entertainment. It is quite unfortunate that such movies never hits the 100 crore mark but if you seek for true entertainment, this is the one.\n\nAs for the soundtracks, it has 90s romantic sadhana & kumar sanu's voice, nooran sister's aggressive sporty one, melodious monali thakur.\n\nThe actors and actresses are underrated but the overall it's a complete package of entertainment you can watch over and over without getting bored."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "priya-kesavan",
        "review_rating": "8",
        "review_title": "A simple sweet but great movie",
        "review_detailed_main": "Checking off all the tick boxes of wholesome cinema - strong positive message, no violence or evil, simple plot, natural acting, makes you laugh and cry. The nuances of small Indian towns comes to life. The scenes of a bride buying nightwear, riding pillion with a big suitcase, the blithe assumption that the divorce lawyer is trying to bring the couple back together, the cassette shop are all so nostalgic! The darker side of Indian arranged marriages - motivated by money, elders choose, the girl's parents' insistence she tolerate her disrespectful husband etc are dealt with sensitivity. This is good solid Hindi cinema not Bollywood and it's a breath of fresh air. Watch it!"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "rashmi-karandikar",
        "review_rating": "9",
        "review_title": "Dumb laga ke haisha – A weighty experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "SumanShakya",
        "review_rating": "8",
        "review_title": "A short and sweet family movie with a nice message.....",
        "review_detailed_main": "A good movie doesn't necessarily need a lavish set or big stars. A simple story can be invigorating with a clarity brought through the setting and the theme which enunciates through \"Dum Lagake Haisha.\" The film revolves around the tight alleys of Haridwar and Rishikesh set in the 90s. The rugged 90s look and the dialect used in the film gets a while to set its mood. Slowly the sweetness of the drama starts to pour in; and by the end, you feel like re-watching it.\n\nThe story is actually of a lower middle class family and its endeavors to cope and make a living in the society against all the odds. A slim eight class fail Prem Pratap is forced to marry an obese graduate lady Sandhya. The marriage doesn't work and reaches to the brink of divorce. The story emanates from the hatred to the discovery of love between the physically misfit couple. Along the way, the film portrays a truth of life, a cause behind the destruction of many families and suggests a harmony and discovers love which can come in all sizes. For the reason, the film becomes adorable and is unmissable. The setting and songs will remind you of your good old days, if you had grown in the 90s. Ayushmann Khurana and Bhumi Pednekar were the best in the movie, and rest of the supporting cast also make the film a treat. And lastly, not to forget the songs of Kumar Sanu and Sadhna Sargam which bring the magic of 90s music again. Just a last verdict: don't miss this sweet little family drama which is poignant, hilarious, and uplifting.\n\nRating: 3 stars out of 4"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "dwijvasavada",
        "review_rating": "8",
        "review_title": "Dumb Laga Ke Haisha!",
        "review_detailed_main": "A blemished old shop/house, a set of kaput cassettes from the 90s, an ordinary locality, a out-of-action Kumar Sanu & a loser Prem Prakasss Tiwari. This is how Yash Raj has opened its 2015 innings. But don't go by the unappealing backdrop because when the above elements come together to react with the satirical approach to love, a beautiful amalgamation called \"Dumb Laga Ke Haisha\" will be formed. While the veteran Sanjay Mishra & his family will leave you in splits with their smooth & flawless execution, the plain & dowdy Bhumi Pednekar promises to maintain the excitement of the plot. Sharat Katariya's gamble of a different yet congenial approach to love story has paid off. Ayushmann Khurrana would probably feel overwhelmed after delivering the best performance of his career so far. The on-screen chemistry along with sublime characterization makes Dumb Laga Ke Haisha a \"Must Watch\" smile emoticon. ‪#dumlagakehaisha‬ ‪#bollywood‬"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "ashwinrajan-175-992599",
        "review_rating": "10",
        "review_title": "A very practical and hearty romance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "alokkumar-38883",
        "review_rating": "10",
        "review_title": "Underrated Movie",
        "review_detailed_main": "Ayushman is the gem of bollywood and so is Bhumi Pednekar.One of the best movies of bollywood and deserves more positive reviews"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "alexdeleonfilm",
        "review_rating": "9",
        "review_title": "Mismatched Young couple forced into an arranged marriage rebel, and then some..",
        "review_detailed_main": "Slightly off beat Bollywood produced by mainstream Yashraj Studio. Viewed during Budapest Indian FIlm Week, at the venerable Pushkin Mozi, Friday, October 7, 2016. Relatively short for an Indian film, clocking in at 104 minutes, this is a family drama, set in the holy city of Hardwar on the Ganges. It played here to a full house of Hungarian fans of Bollywood cinema. Director: Sharat Katariya, Main cast: Ayushmann Khurrana, as Prem Prakash, the unhappy groom, and newcomer Bhumi Pendakar as Sandhya, the chubby educated wife, in a Heavyweight knockout debut ~ with Sanjay Mishra, as the uppity father of Prem.\n\nDLKH is a sneakily subtle dramedy set in the traditional holy city of Hardwar on the Ganges about an arranged marriage between an overweight but well educated young woman (Sandhya) and a handsome but uneducated slob of a husband (Prem)i who doesn't sleep with her on their wedding night. Eventually he will, but reluctantly and much to his distaste. He is basically ashamed even to be seen with her in public. Although she had the hots for him at first, heavy set Sandhya has finally had enough, moves out abruptly and asks for a divorce. Both families are shocked, most of all Prem. Now that his neglected bride has faced him down, however, he begins to have second thoughts and his attitude toward her evolves bit by painful bit -- until a theatrical suicide attempt by him turns everything around. The remonstrations of both families are the background of the story.\n\nAt the end, an odd village Obstacle Course footrace competition Prem has signed up for hoping to win some much needed cash -- (Husband has to carry wife on his back all through the race) -- becomes the thrilling conclusion of this truly heart warming triumphant family drama. The dénoument (with, alas, too many stop frames!) is a rousing colorful collective dance on the Ganges river bridge, with the now happily united couple at the center and Prem demonstrating some dazzling Bollywood moves, at one point in a bright orange suit. The love of his wife has clearly brought him to life! ~ And yes, at the end we are even treated to an explicit mouth to mouth osculation, until recently a firm No-No in Indian cinema.\n\nThis movie really sneaks up on you, starting out as what looks like a run-of-the-mill arranged marriage comedy, but, before you know it it has become a touching psychological study where you feel sorry for both young people, at odds with each other but trapped in a web of hidebound tradition -- and find yourself rooting for both of them, even though they are set against each other united only by their rebellion against old- fashioned ways and mores. At the end I was literally overcome with tears of joy when the film finally forced me to let go and go with the flow. Bravo! Best and most enjoyable film I've seen this year in any language (This was, of course, in Hindi with good Hungarian subtitles)"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "Stickdtacey",
        "review_rating": "8",
        "review_title": "90s accurately represented",
        "review_detailed_main": "I watched this movie along with my mother and she too admitted that this movie nails the filming style and environment of the 90s.\n\nAyushman was great in the role and so was bhumi which held up the average supporting cast except for the mother in law she was hilarious all in all a great movie to watch with your parents if they were students in the 90s."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "maulin5",
        "review_rating": "8",
        "review_title": "Dumdar movie of 2015 till now",
        "review_detailed_main": "#DumLagaKeHaisha‬ : Ayushmann Khurrana is back in a good movie after Vicky Donor. It is a YRF production film, but, doesn't look. Because its simplicity makes it to the queue near the film like Ankhon Dekhi (2014). Even Sharat Katariya, the debutant director chooses his supporting cast from that film. Ankhon Dekhi is a class movie, it is not that much good, but, it is definitely one of the best till now in 2015. A boy, 10th fail, runs a shop of recording the songs in cassettes, is forced to marry a heavy weight lady who is a graduate in B.A. How difficult for the couples who are together because of the arranged marriage. This film shows the actual moments between husband and wife after their arranged marriage. The film is set in 1995. The cassettes, VCRs, Haridhwar, Lakshman Jhula, Group Marriage, First night, & the competition - Dumb Laga Ke Haisha, everything is just perfect and most enjoyable moments. Ayushmann Khurrana acts really well. I'm his fan from the first film. Bhumi Pednekar, the lady of 85 kgs, suits perfectly in the role. She is a newcomer, but, performs like a true artist. Very very natural acting by the supporting cast like Sanjay Mishra, Seema Pahwa, Alka Amin, Shreekant Verma & Shebaa Chadhha. As the film is set in 1995, the music director is also of that time, Mr. Anu Malik. Songs are suitable to the mood. He chooses Kumar Sanu for most of the songs so it looks like the 90's. Tu, Tumse Mile Dilko Mila, Yeh Moh Moh Ke Dhaage - all are listenable. Director gives the film very short length, but, then also at some time it looks like a spread. The climax is recommendable for all the husbands out their. Go and watch with your respective wives, and enjoy this beautiful movie. As the word of mouth is positive, day by day, the collection is increasing. You should not miss this one, as I found it the most enjoyable movie of 2015 till now. Though NH10 is released, but, has an A certificate, while Dumb Laga Ke Haisha is an U/A so bring the whole family to the theater and enjoy the show."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "pkspnght",
        "review_rating": "10",
        "review_title": "Bollywood should learn from these kinds of movies.",
        "review_detailed_main": "In a world full of crap bollywood movies where actors don't even know the meaning of acting .... there are much more talented people trying to make good movies & delivering a positive message too. This movie is a good example of that. Kudos to all the cast , team & Aayushman. Wish i could meet you in person one day. :)"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "cseabhi",
        "review_rating": "8",
        "review_title": "Totally loved it.",
        "review_detailed_main": "This is a movie that breaks all stereotypes, be it the lead heroine or the love story between the lead pair, still this is a complete entertainer.\n\nThe story is of Prem(Played by Ayushmann Khuraana) and Sandhya(Bhumi Pednekar). Sandhya is a girl who is overweight and Prem owns a Audio cassette shop.\n\nPrem has to get married to Sandhya. But Sandhya is not the type of life partner Prem wants. Sandhya tries to bond with him but he is embarrassed by her. But eventually love blossoms and prem understand the value of real love.\n\nAyushman and Bhumi has done an excellent job in the movie. Director Sharat Katariya has caputred the essence of city as well as 90's nostalgia quite well. The storytelling as well the screenplay is superb. Music deserve a special mention. Be it moh moh ke dhaage or Kumar sanu's 'Tu'. The songs are extremely soulful.\n\nAll in all an extremely well made movie."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "sameerkhan666",
        "review_rating": "9",
        "review_title": "Competitive couple",
        "review_detailed_main": "A story about two people being a competitive couple. Firstly in a sense that they compete each other in who speaks well English and us educated and the music taste which they differ to each other apart from gazillion of other things. Secondly, in a sense that they compete impromptu with other couple in town for a grand annual competition which is named Dum Laga Ke Hayesha, a race filled with hurdles where a man runs while his beloved on his back. Such a lovely family romantic drama movie. There are lots of complications that they both face, and they hate each other for their appearances and likings. But story twist them into making themselves hate at a degree that they started loving one another. Kumar Sanu's voice, dialogues on education and feminism and body shaming, celibacy, point by point; wow. Plus a strong female character."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "krsimant",
        "review_rating": "9",
        "review_title": "A new direction to Indian cinema by Yash Raj",
        "review_detailed_main": "Lovely acting by the whole cast. It has events everyone can relate to. Good work with the detailing of real life scenarios. Captured emotions minutely. Any attempt at making the trailer better than it is, would have revealed just too much of the plot. So try not to make the trailer a factor for considering to watch it. I was not very impressed by the trailer either. The marketing for the movie has been very less. But the numbers will increase I guess, as this movie is getting good 'Word of mouth'. People from places like Bihar, UP, MP, Orissa etc will be able to connect to each part of it including the cycle rickshaw and narrow lanes. Bhumi Pednekar's debut is impressive. If you want to lighten your mood with your spouse and/or other family members after a tiring day/week. This movie might just make your day. A good movie by YRF after a very long time. Kudos. KS"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "rahumate",
        "review_rating": "9",
        "review_title": "Dumb Laga ke Haisha film is a nostalgic punch of 80s and 90s",
        "review_detailed_main": "A family film, after a long time Bollywood has produced a family drama which holds a potential to entice audience to the edge of the seat. Unfortunately this film could not stand on theaters for a long time. Dumb Laga ke Haisha is made with US$2.4 million and generated US$4.8 million on box office. Ayushmann Khurana played a helpless son of a middle-class family. He belongs to the cassette era of Bollywood. He is completely suppressed by his father. They decide his arrange marriage with Bhumi Pednekar. Bhumi played as an educated and independent girl. She has a job in school.\n\nThe otherwise good above average looking Ayushmann Khurana who is lost in the music of 90s decade paint his dream canvas with colors. He lives in a dream and expects his wife to be beautiful and surrendering. Bhumi who also has her marginal expectations from husband try to woo him with her beauty. Ayushmann Khurana starts neglecting and repainting of marriage. Now the time is gone. It is fun to watch this couple as the decade of 90s is famous for love marriage and early era of globalization. Indian youth was perusing higher studies to go to US as it was the only country on youth's mind. IT revolution was on the way. This film nails at perfect spot of Indian psyche. Quyamat Se Quyamat Taq was the epic of that era. Papa Kehe Te Hain was a hit number. The concept of love marriage was new on that time. Automobile industry was just mushrooming. Hero Honda 100ss and Suzuki were just entered in Indian market to woo the Indian youth. Owning a motorcycle was an archetype of ready to move youngster.\n\nAyushmann Khurana and Bhumi Pednekar fight and Bhumi take lead for separation. This is a new twist of 2015. Girls of that era where always use to love the groom and divorce was not common at that time. In 2015 divorce is a common and part of life. 50% people are getting divorce today and 30% from remaining are not happily married is the reality today. Only 20% people are happily married and staying together. Technically speaking, the stand of Bhumi does not gel in the film but what the hell! Film is for 2015 audience.\n\nAudience easily co-relate with the film as the songs are shot with cinematographic precision of 90s. The style of group dance like Greed Drama, Lead actors will remain in focus by color, shape, scale, space or action. Background dancers will enhance the mood with their group dance, design, movements and visual spectacle. After a long time I took a long and deep breath of fresh breeze as the songs were shot on open hill top or on natural bounty. That was the era of comparatively less population and less pollution. Songs are written with considerable background of that era. The music of the film transformed us in to that era.\n\nSharat Katariya the director and screen writer of this film is jhamia Milia Islamia alumnus. He started his career in 2007 with a film, Behja Fry. He has written 8 films so far. Dumb Laga ke Haisha is shot 60% in one house only. It shows the strength of a director. Sharat Karariya who started his career with Bheja Fry with maximum one location film maintained his strength of writing a screenplay. While teaching I always give example of Jean Luc Godard and Robert Bresson for use of location and their shot division, I find Sharat Katariya a new blood screenwriter and director will take Bollywood to new high.\n\nSharat Katariya born on 15 June 1978 a very young and promising director has crafted this film. Although the director as mentioned in interview that he has inspired by a poster of husband carrying wife in a run, true but this film has created the decade of 90s. A character of Ayushmann and Bhumi touches our heart, their personal and social life talks much about their psychological and social built up. This film talks bluntly about the internal complex and external complex of Ayushmann. How Bhumi creates a space in his heart is the beauty of this film. Race sequence and their budding love are wrapped very fast. The first draft of this film was written in 17 days and second in 3 days this itself is a wonder. I think this is a good film for all film lovers. All film school students will learn a lesson out of it."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "calldharm",
        "review_rating": "9",
        "review_title": "Simply a sweet and entertaining must watch movie.",
        "review_detailed_main": "There are few movies in bollywood made in our generation which simply are too good to be ignored. I feel proud to say this about our bollywood and the reason is not due to those 100-200 crores moves but due to such movies, which bind you, laugh you and tickles some of deep seated emotions and memories.\n\nThe move is sure to touch each and very individual in one or other way. I am seriously surprised to see such good actors and productions standing behind such subjects and such a good movie. Its just makes me happy that if this continues, our Bollywood has no limits.\n\nHats off to actors, production house like yash raj standing behind such a movie. So much true to real life location, no artificial sets and those unreal backgrounds.\n\nMy request to our entire bollywood, big actors, directors and production house, to get behind movies like this."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "drsandeshdahal",
        "review_rating": "9",
        "review_title": "superb",
        "review_detailed_main": "Superb and fantastic story. its revealing the dignity of anyone with any look, yet a fine human heart. Superb, loved it very much. Touches heart with emotions. The actress, who is apparently fat gets all the attention and every audience loves her from the heart.Just loved the movie. and i expect, it will change the eyes of the society for perceiving the people in their natural form."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "MuviFan73",
        "review_rating": "8",
        "review_title": "Arrange marriage turning into epic love story after hiccups!",
        "review_detailed_main": "Tone, Script & Story: The story is about a couple who get together via arranged marriage along with bunch of other couples. Now the question arises, will their marriage last?\n\nIt is beautiful to see how two people who lack somewhere in perfectness, try to create something which is perfect and lasts long.\n\nThe movie highlights a situation which is mostly seen in India (at least till now & I don't know about others countries). The situation is something like divorce is rare. Even if the marriage is arranged, love comes after marriage and it lasts.\n\nLove story 'Dum Laga ke Haisha' is here to win your heart.\n\nDirection, Screenplay, Cinematography: Justified. Music: Better than average. Acting: Everybody associated wins your heart.\n\nFinal Verdict: The movie highlights how an arrange marriage turns into an epic love story after the hiccups. It is worth watching and adding to your collection."
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "tofo-piabd23",
        "review_rating": "10",
        "review_title": "amazing must watch!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "rockingrakesh",
        "review_rating": "10",
        "review_title": "Love can happen even after marriage ....",
        "review_detailed_main": "This movie has one thing ....that is the USP of this movie ..Innocence\n\nand each character of the movie is relevant Everybody has played their\n\npart flawlessly ..This movie will take you back to the time and\n\nlocation where you can feel and see.....Love can happen even after marriage all what you need is care, respect for individuals and courage\n\nto accept Who you are......Full Marks to Director for taking such a\n\nbold and worthy step.......\n\nSpecial credit goes to the female Actor Bhumi Pednekar a.k.a Sandhya our Bollywood female actors need to learn a lesson from her..\n\nA treat to watch....Nooohhh..Its a must watch.... :)"
    },
    {
        "movie_id": "tt3495030",
        "movie_name": "My Big Fat Bride",
        "movie_rating": "7.5",
        "review_username": "shalini-1-731130",
        "review_rating": "",
        "review_title": "Awesome move..must watch!!",
        "review_detailed_main": ""
    }
]