[
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Red-Barracuda",
        "review_rating": "2",
        "review_title": "High Noon at Mega Suck-fest",
        "review_detailed_main": "First off, this is a kids movie so certain allowances should be made for its rubbishness. But I expect that the majority of 7 year olds would find High Noon an unrewarding and painful experience.\n\nThe film concerns a group of extremely unscary baddies who decide that world domination can be best achieved by hijacking an amusement park. Two things prevent the villains from carrying out their evil plan. Firstly, the bad guys find themselves easily defeated at every turn by three children and Hulk Hogan. Secondly, those aforementioned bad guys are morons.\n\nThe three children are, of course, the 3 Ninjas. They defeat fully grown men in martial art combat at every turn. Particularly remarkable, since one of the kids appears to be about four years old. Of especial note is the second youngest as he sports a haircut that is so abysmally misguided it makes Billy Ray Cyrus's mullet look tasteful. It is a bowl-cut/pony-tail combo; two haircuts from hell all on one head - it is truly horrendous and should really not be seen by younger viewers.\n\nAn interesting aspect of the movie is that despite the fact that the fairground has been hijacked, no one seems to have informed the extras. They carry on enjoying the rides as if nothing has happened. As I said earlier, the bad guys are essentially idiots, so its just possible that they have not got their heads round the technicalities of hijacking. But, at the end of the day, it doesn't matter as the film is not exactly convincing in a general sense.\n\nDo I recommend it? Not really but it is an ideal birthday present for a child you dislike."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "matthew-lamb",
        "review_rating": "2",
        "review_title": "a bad acting roller-coaster",
        "review_detailed_main": "There two types of bad film.... a)a film so bad you turn it off immediately or b)bad films starring hulk hogan that you have to watch to amuse yourself. Hulk plays Dave Dragon, some old guy who is not very hard and not very funny - and basically the bottom line of the film is some female terrorist tries to take over a theme park. They fail, thanks to some geeky kids who apparently know martial arts. The most annoying thing though is how easily grown adults get beaten up by pesky little kids. This film is so bad, but, fair play, I watched most of it so it achieved something in that sense. Enjoyable if you like ripping it out of bad actors and rubbish plots."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "A_Roode",
        "review_rating": "2",
        "review_title": "Here be monsters...",
        "review_detailed_main": "Old sea maps used to leave a warning on the outer edges of the charts. It would read: \"Here be monsters.\" I wish such a message had been written before the opening credits. Oh, actually it was, but it was in code that I deciphered too late to save myself. It was the part which read: \"3 Ninjas High Noon at Mega Mountain.\" WOE! WOE UNTO ME!!!!\n\nI'm a man with, admittedly, unusual and quirky tastes when it comes to film and film actors/actresses. I like a lot of character actors because they tend to get the most interesting variety of parts. I really loved Victor Wong's career. Memories of his performances in films like 'Tremors,' 'Prince of Darkness,' and especially 'Big Trouble in Little China' (with another favourite of mine, Al Leong -- the Wing Kong Hatchet Man!!! *LOL*) have put me on a quest to see as much of his work as possible.\n\nA quest that died Saturday afternoon just past.\n\nThis deeply regrettable, dreckish, foul excuse of a film and the knowledge that Victor Wong appeared in three other incarnations of it is enough to sour even the strongest movie-goers stomach. Victor's appearance in this awful thing is mercifully concentrated in the opening of the film. It gives him no chance to show off any of his inimitable charm and Victor Wong looks like a tired old man weighed down by the two hardest words that any actor will ever have to listen to: Contractual obligation.\n\nMusic: insipid. Direction: insipid. Plot: insipid. Dialogue: insipid. Acting: hit and miss.\n\nThe kids all deserved better than to be stuck in this film. For fear that they will track me down and beat the heck out of me with their ninja skills, just let me say that they all gave academy award worthy performances. Exhibit A: the two younger brothers manage to keep a straight face and wait -- holding their fight stance -- for thirty seconds as the three bad guy adults struggle to get out of their costumes and dress up again so that the kids can yell \"NINJAS!!!\" I don't blame the kids for this despite the fact that they were as unwatchable as everything else here. This film will bore parents to death so unless you want orphans, avoid, avoid, AVOID!!!\n\nVictor Wong (let me return to a bright light for a moment) died after this film. Jim Varney, who also appeared in this film, has also since died. You may draw your own conclusions.\n\nVarney, in all fairness, is probably the best thing in this film. His performance takes him in a scene-stealing direction with a bad guy turn. Out-acting Loni Anderson, Hulk Hogan and all three ninjas, he easily comes across as a bully who is picking an acting fight with unarmed opponents ... I said I wasn't going to blame the kids... this wasn't their fault, this wasn't their fault ...\n\nFinal Verdict: (un)watchable... BEARABLE only for those who are die-hard Wong or Varney fans. Also bearable if one chants over and over again the words: \"this too shall pass.\" All others should give a miss with extreme prejudice."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "stu-22",
        "review_rating": "",
        "review_title": "CRRRRRRRRRAP!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "ztem89",
        "review_rating": "1",
        "review_title": "possibly the worst movie i've ever seen",
        "review_detailed_main": "the only reason i rented this garbage excuse for a movie is because i am a big fan of the original 3 ninjas movie. when the original came out i was a little kid and it was great. after seeing 3 ninjas kick back and 3 ninjas knuckle up i wasn't expecting 3 ninjas high noon to be that good, since the 2 preceding ones weren't' that great. so finally, 8 years after the release i rent 3 Ninjas High Noon at Mega Mountain....where shall i begin.\n\n-3 new actors playing the boys, if u can even consider them actors -rocky is \"too cool\" to be a ninja -colt has a lisp and a pony tail -tum-tum looks like he retrograded back in time and is now 5\n\n-when tum-tum screams hi-ya it sounds like a little girl\n\n-hulk holgan is in this movie -terriorts take over AN AMUSMANT PARK! -worst acting i've ever seen...ninjas, hulk holgan, terriorts included -dummest plot line\n\nthis movie killed the 3 ninjas for me. i don't' think i can ever watch the original again and enjoy it. every time i see rocky i will think of a stuck up asshole; colt, i will think of his \"new look\", and tum-tum i will think of a 5 year old cry baby.\n\ngod"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "MegaX",
        "review_rating": "1",
        "review_title": "Right to video...",
        "review_detailed_main": "This was horrible. I remember that the original movie was mildly amusing, but this stinker left me disgusted. This is one movie where I was actually wanting the villains to win, because of the annyoing, constipated sounding screeching noises that \"Tum-Tum\" was making for karate yells and what not. I actually laughed when Loni Anderson said \"Rest in pieces\". The first two movies were cute, the third was...blech, but when a movie stars Hulk Hogan.... slow up on that, you've already lost all the money that you put into this flop; and then some."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "eragon565",
        "review_rating": "1",
        "review_title": "this movie STINKS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "itsbaylis",
        "review_rating": "1",
        "review_title": "There's a circle of hell reserved for Hulk Hogan, based on this movie alone",
        "review_detailed_main": "My therapist won't like me talking about it but I've got a bottle of calm-down pills nearby in case this review brings up too many memories for me ad causes...a relapse.\n\nThis film is dreadful. There aren't enough words to describe how buttock clenchingly bad this film is. It made me want to yell at those responsible about how they were causing physical pain to people with this movie. I was 12 when I first watched this and I thought it was awful then as well. I defy any child to be content with this dross, and if any adult enjoys it I'm sorry but the men in white coats are coming with the special jacket.\n\nThe plot is nonsense, the dialogue stomach churning and the acting worse than anything seen in a Friday the 13th movie. Avoid if you like your eyeballs and don't want to spoon them out.\n\nNow if you'll excuse me I'll just take my tablets and go to bed before they come and take me away again..."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "discogrove",
        "review_rating": "1",
        "review_title": "Awful. Just Plain Awful.",
        "review_detailed_main": "Hey amigos, your good friend Disco Bob here with a few comments on 3 Ninjas: High Noon at Mega Mountain. Man, they should've stopped the 3 Ninja series a long time ago. The first was a very fun spin on the Karate Kid series, the second fit right along with the first and was a good sequel, but this one? Horrid. Also, they got Hulk Hogan in it which drops the ratings of any movie. What were they honestly thinking with him and that washed up hag Loni Anderon. Oy vey. I feel vaklempt just thinking about this flick."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "tokyostreetkiller",
        "review_rating": "1",
        "review_title": "A middle school AV team could have made a better movie.",
        "review_detailed_main": "Honestly. Do yourself a favor and don't watch this crap. It is not even good enough to be a lame kids movie. In fact, the makers of this film should be sentenced to a life term in prison for exposing the world to such garbage.\n\nSeriously, there are a lot of cut corners here, and the story is worse than that of a cheap porn flick. Anyone who payed to see this movie in a theater was robbed. It still amazes me that this could have been printed, honestly, the movie is just one stupid gag after another, one's we have already seen and are tired of. On a scale of 1 to 10, I wouldn't give it a score at all, it is not good enough."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "gimpnmagician22",
        "review_rating": "2",
        "review_title": "Outlandish movie.............. phenomenal soundtrack!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "miked272001",
        "review_rating": "10",
        "review_title": "Wonderful Flick",
        "review_detailed_main": "This movie was a real treat. I say \"treat\" in the sense that it was one of the worst movies I've ever seen, hence I love it. The plot is ridiculous & other posters have done a good job at pointing out the shortcomings so I'll keep this brief. As someone alluded to previously & after a secondary viewing last night re-enforced, it is quite comical how the \"terrorists\" go through extreme measures to get into the park (ie; having a ship offshore, jet skis, scuba diving, underwater lasers etc,) when they could just pay the nominal fee to gain access to the park! That was great. Hulk Hogan as always, is a crowd pleaser. I like at the end when he knocks off the tops of the underwater breathing apparatuses with a single blow & they masquerade as oxygen diffusing projectiles! Jim Varney obviously was funny in his role as the antagonist, no doubt ashamed to be cast in such a lousy movie. And the three \"ninjas\"? Don't even get me started. So cheesy with the Ayais! over & over. Terrible actors, but it all adds to the ambiance of a wonderful film, albeit low budget & misconstrued, unintentional comedy. Would highly recommend, & it goes without saying that a solid buzz while embarking on such a journey will no doubt add to the enjoyment derived from this little gem. Cheers!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "mikeolaskey",
        "review_rating": "7",
        "review_title": "Good for children... Not for adults.",
        "review_detailed_main": "The thing that most people have to realize when watching a movie such as this one is its not made to be reviewed by people over, lets say 10. But seeing as how most under the age of ten have the attention span of a wet rock, I'll do it for them.\n\nI recently showed this movie to my kids, all of which are under the age of ten. And they loved it. I on the other hand walked out of the room. My kids were so entralled that two of them have now taken up karate lessons.\n\nthat means Its served its purpose... they stayed still for 2 hours and I got to get some work done."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "zgall1",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I think worst movie ever is being too kind. If I had the option of watching this again or ramming nails through my head, I would choose the latter and I hope all of you do as well. This has got to be the dumbest idea I have ever heard of. And Hulk Hogan? Wow, he is just absolutely pathetic. Stick to wrestling - that's something you suck at slightly less than acting."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Goat Boy",
        "review_rating": "",
        "review_title": "One thing made this film great...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Kay_Bear_2021",
        "review_rating": "1",
        "review_title": "I don't know what else to say!!!",
        "review_detailed_main": "This movie was the worst I've ever seen. I hope they don't keep it in the video stores, because kids don't need to see all that bad acting. Even Hogan was stupid! The kids do okay with the martial arts, but you can so tell that they hardly ever connected the blows. The least they could have done was make it look real!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "pritish-sai",
        "review_rating": "1",
        "review_title": "10 reasons 2 WATCH this movie",
        "review_detailed_main": "Here are ten reasons 2 watch this movie 1) You have done EVERYTHING in life so u are basically jobless.\n\n2) You are an IMMESNSE fan of Hulk Hogan from his earliest days of wrestling n before u die u have 2 see whatever movie he's been in.\n\n3) You want 2 know what is the meaning of 'gay'.\n\n4) You always wanted see what a movie would look like if it was made by a 2 year old.\n\n5) You have permanent brain damage n can swallow even the most disgusting piece of crap put in front of you.\n\n6) You want 2 be a director and after watching this movie you have hope that if this piece of crap makes it , U have a better chance.\n\n7) You hate yourself ( warning :After watching you'll hate urself more)\n\n8) You love 2 point n curse at the TV\n\n9) If you have the habit of crying at something funny n laughing at something serious.\n\n10) If you're on he brink of suicide watching this movie will speed it up."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "MovieAddict2016",
        "review_rating": "1",
        "review_title": "One of the worst films of all time...",
        "review_detailed_main": "A colossal mess. Badly acted, poorly written, sorely misdirected. The \"3 Ninjas\" series never needed a sequel, much less the uncountable number it has spawned.\n\nThe infamous 3 Ninjas go to a theme park in this sequel and use Hulk Hogan to fight off a bunch of terrorists (?). Miserable, putrid stuff. The acting is in league with \"Pod People\" (1983).\n\nDo NOT watch this movie! I feel stupiderererer already.\n\n0/5 stars."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "Was it just me, or did anyone else feel like they were watching a Kraft cheese commercial?",
        "review_detailed_main": "I swear at the beginning with the parents, I felt like they were just smiling too much and it looked like they were just going to say cliché' things like \"Oh, you kids!\" or \"That's coming out of your allowance\" while smiling at the camera on cue.\n\nNow, granted, this is a movie for kids, but I think we are starting to insult our kids just a little bit. I mean, we do actually have a decent cast for a kid's flick, but these adults really sunk beyond the kid's humor. While it has some good morals and another happy ending, just the jokes got old and I think we are just insulting our kid's intelligence and humor.\n\n1/10\n\nPS: Loni, lay off the fake tan!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "poolandrews",
        "review_rating": "4",
        "review_title": "Passes the time I suppose but not great.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "head_hoser",
        "review_rating": "1",
        "review_title": "One of the stupidest movies ever",
        "review_detailed_main": "This movie has to be one of the 10 stupidest movies ever. It was boring even to a 7-year old watching the movie with me. This movie seemed to go on for ever. It's as bad as watching Barney or Tele-tubbies. I do not recommend this movie to anyone."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "miko_mmm",
        "review_rating": "2",
        "review_title": "Bad",
        "review_detailed_main": "Let me just say that a nice introduction is not needed in this piece of leftover meatloaf that needed to be produced by a Fishcer Price karate team.\n\n3 Ninjas: High Noon at Mega Mountain had a plan in it's motive to be produced. It wanted to show compassion. It wanted to show teamwork, brotherly love and it wanted to show Hulk Hogan's acting abilities. It all failed in that.\n\nThree brothers who happened to be in an amusement park will save the day because the amusement park is taken over by terrorists! There are also subplots of Hulk Hogan's character being a has-been (so is he) and the eldest ninja who'll get the heart of this ten-year-old girl. Lame! Colt is played by this kid who will become the future Canadian band Moffats-parody lead singer. Tum-tum is a little Hilary Swank stuck in a Baby Gap model's body. Rocky is this over-the-top, meant to be \"cool\" punk who can't kiss at fourteen.\n\nThe supporting kids are just as weird. The computer girl had not a cinch of fear since there was a four-minute bomb inches away from her face. The \"roller coaster-Come save me!\" girl was the miscast of the entire debacle. Can she even stand still? Why is it such a good idea for terrorists to take over an amusement park? Why cast a has-been wrestler who can't even say his name right? Why are Jamaican men such good computer junkies? Why cast a toddler (who yelps like a strangling cat) into saying those damn \"Ay-Ya's\" over two dozen times?\n\nI liked these ninja movies. The first ones? Great. I was like three when that came to video. But this? This is the limit of underdeveloped. It looked like it was directed by a damn pro-kids pedophile! I would just say that the hype, the story, the climax and the stupendous fight scenes (where the kids close their little eye-dy widey's to kick the bad goons) take the cake as making this pure garbage.\n\nDon't waste your time, I did."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "jeffuary",
        "review_rating": "10",
        "review_title": "Epic",
        "review_detailed_main": "Every once in a while a film comes along that makes you glad to be alive. Cinema is a beautiful art form, and no cinema is more gorgeous than 3 Ninjas: High Noon at Mega Mountain. Epic on a grand scale, the cinematic majesty on display would make Kurosawa's corpse reanimate just so it could kill itself in shame at never meeting the grandeur of vision presented herein. I saw this movie and broke down in tears, as I knew my eyes had witnessed the most beautiful sight since Stallone and Carl Weathers flirting with each other on the beach in one of the Rocky films. You'll laugh, you'll cry, you'll curse yourself for thinking that the greatness of the previous 3 Ninjas movies could ever be topped.\n\nBravo. Bravo."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "bug76",
        "review_rating": "6",
        "review_title": "It had Jim Varney",
        "review_detailed_main": "The only reason I bought this DVD is because I'm such a fan of Varney's. I wouldn't have known about this movie much less get it if he wasn't in it. While lots of people rag on Hulk Hogan, he wasn't the worst actor. By far, the most wooden performance goes to Loni Anderson. If this is a family oriented movie, why in the world did they have her dress in that skanky leather outfit that was far too short? Terrible casting as far as Loni goes. She was supposed to be the evil Medusa but I didn't buy it. She just didn't have the quality of pulling off the 'bad guy' type of role. She was much better on 'WKRP in Cinncinati'. I got a little tired of Tum Tum's 'Ay-yahs' after a while. They were too high pitched and over done. All 6 stars go to Jim Varney. I was actually rooting for Lothar to become successful in his mission for he was the only one of the bad guys with the brilliance to pull off the heist. He easily outshone all the stars, as usual. He always gives 100% to whatever role he played as you can see here. Jim and Victor were the two best actors in this movie. Maybe if Jim had cast and directed this, it would've been a bigger box office success. The man was a brilliant actor and a genius. If you're a fan of Varney's, then yes, get the movie just to watch him. Otherwise, don't bother."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "KrankyKryptonian",
        "review_rating": "1",
        "review_title": "Worst of the series; what were they thinking?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "revival05",
        "review_rating": "",
        "review_title": "Quite simply the funniest film ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "The_Light_Triton",
        "review_rating": "1",
        "review_title": "Bad Clichés, Ninja action, Kids outsmarting adults - Well, it is the 90s after all.",
        "review_detailed_main": "I reviewed this title back in November 2008, about 4 years ago, and while I still come to the conclusion that this movie still gets a rating of 1 because of how ridiculously bad it is, upon seeing it a few more times, I have to dig deeper into this movie and provide some more thoughts and ideas about it.\n\nFirst off, if you've seen the movie, Skip the next paragraph.\n\nIn the recent years of the 3 Ninjas, They've grown older and more mature, and because of this, their interest in being ninjas has taken a backseat to more older things. While Tum-tum is still a young boy, Rocky has moved onto girlfriends, and Colt is merely stuck in the middle. Not only that, Tum-tum's Favorite Saturday morning hero, Dave Dragon, is about to cancel his 15-year long superhero show, due to low ratings and loss of interest. His final appearance will be at the Mega mountain theme park on tum-tum's birthday. So Tum-tum wants to go, and his older brothers tag along with their new friend, Amanda, who seems to be an expert on Computer Programming, hacking, and complex electronics. while at the theme park, a group of mercenary Ninjas, led by escaped convict, Mary Ann rogers, AKA Medusa, take over the theme park and threaten to harm it's people, but will let them go in exchange for a large sum of money. Will they succeed in their evildoing, or will the 3 ninjas save the day?\n\nOK, Upon seeing this movie a few more times and reading other comments left by users, There's lots to say now. First and foremost, i see 2 obvious references to mid-90s Role Playing games - First, look at Colt's hair. not only does it look ridiculous, it's a bad rip-off of Hero-class Bowie from shining force II, A sega Genesis RPG from 1994. Also, look at Amanda. Doesn't her character seem familiar to another girl from a 1995 SNES RPG? she does have thick glasses, knows her way around complex electronics and computers - Kinda like Lucca from Chrono Trigger maybe?\n\nSecondly, kids movies of the 90's can be totally remembered for kids outsmarting adults and leaving a trail of laughter in their wake. It started with Home alone, from 1990. Then it carried throughout the 90s, but around the mid-to-late 90s, the cliché got really old. this movie feeds off that cliché like Michael Moore feeds off of McDonalds.\n\nThirdly, The aged stars of our show. First there's Hulk Hogan. Now i love wrestling, to me, it's entertainment and should not be looked at as a legitimate sport, cause it's not. Hulkamania was still running wild for the hulk at the time, he was in his 40s (if this was filmed in 1997, released in 1998, and hulk was born in 1953, he would've been 44 years old. For the most part, his acting isn't really believable, but his larger than life character in the ring more than makes up for it. then we have our other aged star, Loni Anderson. this was a few years after her divorce with Burt Reynolds, and i gotta admit, with all the leather, the make-up, lipstick, and sexy cougar voice, I was still turned on to her. How old was she around the time of filming? Well, she was born in 1945, making her 52 around the time of filming. Hot damn! But her acting skills in this film are as follows...\n\nFourth, Loni Anderson might as well have starred in a porno, cause her acting skills, are totally unbelievable. And adding onto another user's comment, The Dialogue between Loni and Chelsey (Amanda) feels like watching a lesbian porno, about an aged beauty queen wanting to have her way with a young woman.\n\nSo the bottom line, 3 Ninjas; High Noon at Mega Mountain isn't what you'd call a memorable film, i'd prefer the term \"Boring Saturday afternoon fare.\" it's totally forgettable, the only reason i'll ever remember it is because Loni Anderson was a total cougar in it. I'd rather remember hulk hogan for his Wrestling matches.\n\n1/10"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "bloodslaying",
        "review_rating": "5",
        "review_title": "Wasn't that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "ierenz",
        "review_rating": "4",
        "review_title": "Only small children with limited attention spans will be impressed by the lackluster kung-foolishness",
        "review_detailed_main": "Only small children with limited attention spans will be impressed by the lackluster kung-foolishness in \"3 Ninjas: High Noon at Mega Mountain.\" Granted, this fourth episode in the kid-friendly franchise is a considerable improvement over its immediate predecessor, the dismally chintzy \"3 Ninjas Knuckle Up\" (filmed in 1992 but released in '95). But even with a bigger budget, a few grownup \"guest stars\" and three new youngsters in the lead roles, \"Mega Mountain\" won't amount to a hill of beans at the box office. On the other hand, given the series' past track record, homevideo prospects are mildly bright."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "a-twetman",
        "review_rating": "2",
        "review_title": "Kids movie cliché",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "fullenw",
        "review_rating": "1",
        "review_title": "Not even Hulk Hogan and Loni Anderson could save this one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "saturniia",
        "review_rating": "5",
        "review_title": "The ten-year-old is what?",
        "review_detailed_main": "Okay, I'd been wanting to see this movie for some time. I enjoyed the first three greatly, and although Hulk Hogan's in it, I consider it a good investment. Victor Wong III had a brilliant background part as Grandpa, and the toys were fun.(Alright, I'm a teenager. The fact that the two older guys are easy on the eyes doesn't hurt anything, either.)\n\nWhat had originally enticed me, though, was the action part of the film. After all, the actors playing Rocky, Colt, and Tum-Tum (see the list) are all black belts. Yep, even the ten-year-old! So if you're looking for spills, not kills, and amusement park thrills, rent this today!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Everything that makes a bad movie bad is in abundance in this movie",
        "review_detailed_main": "I have seen a lot of movies, old and new, good and bad. 3 Ninjas:High Noon at Mega Mountain is a really awful movie, not the all-time worst, but everything that makes a bad movie bad is in abundance in this wretched excuse of a movie. In fact, the only somewhat tolerable asset was the soundtrack, that was decent compared to how awful everything else was.\n\nWhat made the movie especially bad was the plot. It is incredibly lame and predictable, with one of the dumbest endings I have seen in recent memory. Production values-wise, the movie is not good either, the cinematography, sets and scenery are of shoddy quality and the editing is so slip-shod it hurts the eyes and makes the editing in a movie like The Medallion seem Oscar-worthy. The fight scenes are poorly choreographed with little or no drive or energy, while the script and direction are terrible. Same with the acting, the kids are all annoying, the villains are pathetic in both character and acting while Hulk Hogan has a poor character and is not given much to do.\n\nOverall, an awful film and not worth it. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "fritziph",
        "review_rating": "10",
        "review_title": "My kids LOVED this movie when they were little!",
        "review_detailed_main": "My boys love Hulk Hogan so when they first saw this corny movie years ago, they loved it! We had it on VCR & they played it to death. It's very silly & corny but just right for kids. We found it on Netflix recently & what fun it has been to watch it again! My oldest son is having a blast sharing this movie with his girlfriend. It's been fun watching him laugh at it all over again. (BTW, my sons are currently 21 & 17...lol) Even though it doesn't have all the same boys in it as the previous 3 Ninja movies do, you don't need to have seen them to watch this one. In fact, we actually saw this one first, then the others. My sons still like this one best."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "neiljones1981",
        "review_rating": "6",
        "review_title": "And Another Franchise Fizzled Out...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Impossible viewing for anyone older than 6.",
        "review_detailed_main": "Uggh! This is a terrible film and this was obvious by the first scene. The film begins with three very white-bread kids being taught by their grandfather how to be ninjas in some sort of Mario Brothers-like training facility. Considering how similar all this looks to \"Pocket Ninjas\" (the #4 lowest ranked film on IMDb's Bottom 100 list), I knew I was in for a painful time!\n\nSoon after leaving grandpa's house, the three annoying brats go with their friends to an amusement park that is about to be taken over by the lamest villains in history--Loni Anderson and Jim Varney as 'Medusa' and 'Lothar'!! And, oh God say it isn't so, it's up to the thee kids AND Hulk Hogan to save the day. Can it get any worse?!?! Well, with tons of lame stunts, tons of special effects and minimal acting, the answer is YES! To show the FBI that they mean business, once the baddies take over the park, they make certain rides go SLIGHTLY faster!!! What beasts!! In fact, while there is lots of punching and kicking, this is only family-friendly violence--so the kids naturally win and no one shoots, stabs or even tickles their opponents. Because of this and the constantly insipid writing, the film is a total bore to anyone older than about 6.\n\nSo should this movie be on the infamous Bottom 100 list? I think probably not for two reasons. First, very, very young kids will enjoy this insipid crap--and to me, a film should not be on the list if it is in any way enjoyable. Second, the production values are not that terrible and the film makes no attempt to be anything more than it is--a dopey little film that would most likely make a parent kill themselves or the kids if they are forced to watch it!!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "youngblood_16",
        "review_rating": "",
        "review_title": "OH GOD PLEASE.....no...no...NOOOOOOOOOO!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "dwpollar",
        "review_rating": "4",
        "review_title": "Harmless fluff, but poorly done at times...",
        "review_detailed_main": "1st watched 4/6/2008 - 4 out of 10(Dir-Sean McNamara): Harmless fluff, but poorly done at times. In this 3 Ninjas entry, the guys are spending time at their favorite amusement park for Tum Tum's birthday. A group of bad ninjas just happen to be attempting to take over the park for a ransom while they are there. The bad guys are led by Madusa(played by Loni Anderson) and assisted by a rare non-comic Jim Varney, who actually does a pretty good job as a villain. The movie starts with the 3 hero's doing a pretty cool obstacle course at their grandfather's place but learn a valuable lesson when he turns off the power and then makes them attempt it backwards. The lesson they learned, supposedly, is not to get a big head because they aced it going forwards but couldn't cut it backwards without power(believe it or not!!). This is later used by the guys in the final showdown with the baddies, which kind of brings their lesson back to them and creates kind of a purpose for their grandfather's teachings. I won't let you know what happens the 2nd time, in case you want to watch the movie yourself, but you can probably guess. This predictability, some obvious mistakes in the production(boom mikes and wires being visible) and the low acting expectations from most make this attempt at a fun kids movie even dismal to most kids, probably."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "angedore93",
        "review_rating": "2",
        "review_title": "Boring... Looses everything that I liked about these movies!",
        "review_detailed_main": "When I was younger I loved the first ones. We watched them over and over again, laughed at them... you know, it was an enjoyable kinda thing. But wow, I never thought they could get this bad! Rocky, 15 huh? The guy looked about 11! Colt's hairstyle was atrocious, and I swear I remembered Tum-Tum's character to be older >_<.\n\nThe plot-line is completely unbelievable. It doesn't seem to really have any purpose in it.\n\nThe acting is stupid... I mean, I might as well go and watch a school play and get better acting than I did here.\n\nSo, overall, if you want to watch a movie from these series, let this be your last choice..."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "inquisitor_milk",
        "review_rating": "3",
        "review_title": "3 Fast, 3 Ninja Hyper Fury Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "RichardKleiner",
        "review_rating": "5",
        "review_title": "Worst kiddy movie ever made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "mwcanadian-99023",
        "review_rating": "4",
        "review_title": "it's bad, but it could be worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "tatirull",
        "review_rating": "1",
        "review_title": "Sweet, merciful Jesus, why?",
        "review_detailed_main": "Once I saw a movie review, where the reviewer wrote something like \"Why do the bad critics keep reviewing this like it's a piece of c---? All the children like it!\". I expected this movie to be something similar. When the credits started running, though, i even try'd to watch it through the eyes of a five year old, but it still seemed terrible. Jesus Christ, even the storyline is a piece of dung! 3 kids whoop-ass ten men with machine guns?! Come on. Don't waste your time on watching this movie. Go do something useful, like get scored or something. Just don't watch this one. Please. It's for you're own sake. Okay, i even may like Hulk Hogan's way of plaing a bad guy, but why did he do it in this movie?!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "mroth14",
        "review_rating": "1",
        "review_title": "What?",
        "review_detailed_main": "How could anyone possibly say anything bad about this cinematic masterpiece. Come on guys, this is Hulk Hogan in the peak of his acting career. What more could a movie buff ask for? This is like Christmas, Channukah and Kwanzaa rolled into one bundle of fun.\n\nI'm just kidding this is the worst piece of garbage I've ever seen. Even though I watched this really stoned at 3 in the morning, I want that hour and half of my life that was stolen back. I wonder what the director of the movie was thinking during production. Probably something along the lines of \"what the hell am I doing?\".\n\nAn avid 3 ninjas fan"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "The-Lord-of-Darkness",
        "review_rating": "10",
        "review_title": "Tam Tam - Tam Tam - Tam Tam",
        "review_detailed_main": "You might think, that this movie sucks, but you´re dead wrong!\n\nThis is the funniest piece, I´ve ever seen in my life!\n\nSeriously, I was laughing tears the whole movie - then I tried to kill myself!\n\nNormally, in a Hogan movie, you can expect, that he´s the one, beating up the bad guys, but not here, Hogan mostly stands - or lies - in the way, while the villains get an ass-kicking from an 3-year-old, and his two wannabe-ninja brothers!\n\nI won´t write something about the story, because:\n\na) There is no story, and even if you find one (I didn´t), you should forget about it wright now!\n\nb) I have seen this movie 3 years ago, which makes it difficult, to write a good comment!\n\nHey, I rated this one 10, and YOU should do the same!\n\nBut please rate it, BEFORE you watch it! ;)"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "jordondave-28085",
        "review_rating": "1",
        "review_title": "if you are not watching it for the action then you can watch it for Hulk Hogan's fake looking hair piece",
        "review_detailed_main": "(1998) 3 Ninjas: High Noon On Mega Mountain FAMILY ACTION COMEDY\n\nFourth \"3 Ninjas\" movie is a complete waste of time, during the time when much superior martial art movies with Jackie Chan, Donnie Yen and Jet Lee were restricted 'only' to be shown on Chinatown theaters throughout North America. Anyways, three very white Caucasian kids practicing martial arts with their Japanese grandfather, coincidentally thwarting a gang of hijackers lead by Medusa (Loni Anderson from WKRP fame) for millions of dollars from the owners of the \"Mega Mountain\" theme park. It's the youngest brother of the '3 ninjas' birthday, and he wanted to celebrate it at the Mega Mountain them park. At the same time, Dave \"Dragon\", ridiculously played by Hulk Hogan, is trying to prevent himself from being cancelled from his long running syndicated television show- also filmed on the 'Mega Mountain' theme park. The perfect movie intended for pre-schoolers, and a complete waste of time for anyone 8 years and up, considering what kids can watch these days from super hero movies and so forth. It says on the commercial box that 'it's fun for kids' quotation from well known critic from RT by the name of Rex Reed, who may have been paid to endorse this movie. One of the stupidest things I had ever saw was when, the so-called \"three ninjas\" are supposed to be fighting the bad adult ninjas in the dark, yet viewers can clearly see that it's still bright enough for them to see their fighting opponents. Movie, clearly made for white suburban white kids. Bomb, plus another minus 5."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Leon X",
        "review_rating": "",
        "review_title": "High Noon Fun!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "slimer8489",
        "review_rating": "2",
        "review_title": "Stupid, But Enjoyable!",
        "review_detailed_main": "As a huge fan of the 3 Ninjas, I can safely say that this movie is horrible. And yes, this is coming from a fan of movies where kids successfully beat up adults. I know this is a kids movie, but this is just plain silly.\n\nThe plot is that it's Tum Tum's birthday, and he's going to have his party at Mega Mountain (the one and only!) Just in the nick of time, a geeky girl moves in next door. How convenient. Tum's birthday party is on the same day as the final appearance of his favorite TV hero, Dave Dragon, played by the Hulkster (brother!) Well, he got lucky. There also happen to be terrorists who want to, get this, take over the amusement park. See? That's just plain silly. So, since the 3 Ninjas are there, they break out their ninja skills and save the day with the Davester.\n\nI remember this being my favorite 3 Ninjas movie. I totally regret making this decision, and I don't even know why it used to be my favorite. It feels like they tried to get everything wrong here, but with that, it makes the movie fun to watch. There's always something to make fun of, like the laughable special effects, horrendous dialog, and Hulk Hogan's hamming it up! (Seriously, how can you NOT laugh at \"One ninja stew coming up!\")"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "merem1",
        "review_rating": "1",
        "review_title": "one of the dumbest movies ever",
        "review_detailed_main": "The film is very stupid and shouldn't have been made. It is a mess with bad acting. Everything about the film is rotting garbage. There's nothing entertaining about the film. It is a total failure. It is a film that is like a bad headache. You just want it to end. 90 minutes that is a total waste."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "talllwoood13",
        "review_rating": "2",
        "review_title": "better than Marvel or DC universe movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Polaroid_Higgins",
        "review_rating": "2",
        "review_title": "OK plot, but wrong actors, they should of kept the originals, or not made this movie at all",
        "review_detailed_main": "OK I've been watching the 3 Ninjas over and over since i was little, all of them, and then this one comes out... you have 3 new actors, which are worse then the real 3, but then again the 3 Ninjas Kick Back has 2 new people, but anyways, it's impossible for these new actors to be as good as the original... and yeah, the plot is pretty good, but it would of been better if Michael Treanor, Max Elliott Slade, and Chad Powers would be the main characters, if they couldn't get them then they shouldn't have made this movie at all, so yeah, the plot was good, but totally wrong people for the job, sorry but that's all i have to say about this movie."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "worldsworstwryter",
        "review_rating": "2",
        "review_title": "What have I just watched? 2/10",
        "review_detailed_main": "What is this? The way they filmed the ending scene made it look like the 3 ninjas were going to adopt Hulk Hogan as if he was a lost puppy or a sad orphan.\n\nAnyway, this film sucks. The acting is bad, especially the villains, who I wanted to murder violently for how annoying they were. The story is just terrible. It's boring, there's no direction, and the writing is cringeworthy.\n\nSome of it was kind of funny though, and I think there was perhaps a little tiny bit of effort put in, so I'll give it a 2/10 instead of a 1/10."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "morri27",
        "review_rating": "1",
        "review_title": "What?",
        "review_detailed_main": "Having watched this movie as a child, i learnt that it doesn't really make any sense. It is difficult to understand and follow. The main mistake with this film is how a white sub-urban American family have a Japanese Grandfather, this is really weird.\n\nI must admit the main reason i actually sat down and watched this disaster was because of Hulk Hogan, and his role was also so BAD. The really annoying part was the little brat Tum-Tum, and his annoying war cry. looking back on the film now and taking into account that its a kids movie, I still find it so funny that a bunch of grown men can get their buts kicked by a bunch of kids. I would have much preferred it if they had using firearms, and test the little brats to see if they could dodge bullets like real Ninja's."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "smartytart2002",
        "review_rating": "1",
        "review_title": "Do Not watch it!",
        "review_detailed_main": "This is the lamest movie & Loni Andersen Doesn't need to be in it anyways."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "wolfda",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Hasn't anyone ever dreamed of being a ninja as a child? I watched this movie years ago and would have told you then that the 3 ninjas movies were the absolute best movies ever made. Looking at this movie from an adults perspective defeats the propose of this being a Children's MOVIE. From a child's perspective this movie is one of the best martial arts movies ever made. Think back to when you were a kid. Wouldn't you love to see a movie where kids your age can take on fully grown men and win? This movie was a favorite of mine growing up and I would still sit down and watch all of the 3 ninjas movies because they were so epic as a child."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "drewd505",
        "review_rating": "1",
        "review_title": "Just STAY AWAY and go watch the other films",
        "review_detailed_main": "I can say alot of good things about the 3 ninjas franchise after going back after 10+ years to get some nostalgia all the other films were dumb fun for everyone this one though... The humor - bland and just not funny i think i laughed maybe once or twice throughout the whole film after watching the other 3 straight through and getting to this one, it was a full let down. Even my favorite Tum-Tum couldn't even save the film.\n\nThe action - As a child might like it. If you have watched the other ones it was still somewhat reasonable and funny to watch the three boys beat up henchmen.\n\nOverall - I don't know if they were trying to go for the staple of oh look they took on three goons in 2 of the movies they must want it again just no don't ever do that. Do i think its watchable maybe if you're having a few with the friends or baked because I found myself skipping forward 5 seconds every 5 minutes. I'm 25 the other 3 movies still made me feel something by the end. This one was just disastrously bad and not in a good way. They switched up how Rocky actually was ruined Colt which i don't know how they ever could maybe with the recasting, tum-tum wasn't funny and just seemed over cheesy. Just STAY AWAY and go watch the other films."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "ChrisOfficial",
        "review_rating": "",
        "review_title": "3 Ninjas: High Noon at Mega Mountain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Ultra cheesy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "trevorsomerset",
        "review_rating": "2",
        "review_title": "WOW that wasn't good",
        "review_detailed_main": "When I was younger when this movie was released, I was 6 years old and when it was over, I felt as though i could whoop butt. The second one made me glad I was older and didn'y act like that anymore. I was embarrassed to see it. Why do they make them waaaa and hiya and uh sounds? What is that? They just made this film hard to believe because everyone knows there isn't any way that 3 kids could take down that man grown men. It just doesn't happen. I hope there done producing god-awful movies such as this one. Mabey with todays effects they could do a little, well, A lot better in trying to make a kiddie karate movie a little more interesting."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "wwe7961",
        "review_rating": "1",
        "review_title": "The Karate Kid / 3 X 0=0",
        "review_detailed_main": "That math problem sums up this whole movie. It is \"The Karate Kid\" divided into three smaller karate kids. Then you times that by zero effort and you get one big fat goose egg of a movie. It is the fourth installment in the 3 Ninjas saga, and it is by far the worst. The other films I will review in time, but this is the big one. This is the one that everyone hates. It has terrible acting, terrible fight scenes, and an awful story. When it comes to the acting the only person I liked was Jim Varney, but that is not enough to make up for the rest of the cast. As you would expect the child acting fails completely. The 3 ninjas are all annoying especially the little one. As for Hulk Hogan I didn't hate the performance, but it is exactly what you would expect. Then we have the action which is terrible. It goes for fighting that is practically slapstick instead of actual fighting. That is something I hate about a lot of kung fu/karate movies. So many of them just go for laughs from kiddies instead of actual honor for the fighting. It insults it, and if I was a karate teacher I would spit on pieces of trash like this everyday. In my opinion martial arts should stay in the more adult categories. The only true exception I have seen for these largely kid friendly martial arts movies is \"The Karate Kid\" that's it. I can't wait for a day when another film like that comes around and shows kids what the art of combat is about instead of constant shots to the balls. Until then we get this. Also another thing terrible about the fighting that is unbearable is how they have weapons with knives, but they never use them. I know it's for kids, but if there is a terrorist in front of you and you have a knife that guy is getting stabbed. Have stabbing or lose the knives in my opinion. Also the fighting suffers from those cliché noises that are made when you make a punch. It gets really annoying quickly. Now we move on to the plot. It really all seems like an excuse to have Hulk Hogan. They might as well call it \"Hulk and 3 Ninjas\". He was what sold the film in the first place, but I am going to try and explain the plot. The ninjas go to an amusement park, and it gets taken over by terrorists. The only hope is the 3 ninjas, a smart girl with glasses, and Hulk Hogan......(3 hours of laughing later) Yeah that is one of the lamest excuses for a plot I have ever seen. Then we have dialogue which just like the fighting suffers from way to much childish humor. The jokes are very repetitive. The movie just isn't funny. I'm not going to give this film a 0 star rating. It's bad, but at least it isn't \"Pocket Ninjas\". Just saying the title of that movie makes me shiver.\n\n1/2 of a star out of 4"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "rajesh_pataka_puri",
        "review_rating": "2",
        "review_title": "I HATE THIS MOVIE !!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "review_detailed_main": "This movie has no entertainment value, not even to make fun of because it sucks so much in every aspect. The movie starts out strong by introducing us to a very stereotypical racist Asian grandpa, who is Asian for no reason other than he has to know ninja stuff, and is even more confusing because neither his kids nor his grandkids are at all Asian like him. Also Hulk Hogan is in this movie for no reason.\n\nThis movie was genuine pain to sit through all the actors are terrible and there is a really s wordy love story that shouldn't exist in the first place. The climax of the movie lasts for like 3/4th's of its runtime and consists entirely of terrible fight choreography. The entire cast is super racist stereotypes like a guy with a Jamaican hat who fakes a thick accent terribly. Also the kids for some reason yell AYAH every time they throw a punch or kick which got annoying really fast and by the end of the movie I was genuinely mad. There is only one good scene in which one of the kids yells into a pipe and the bad guy who is standing at the other end flies backwards because of the wind and lands on an exposed metal pole which gets shoved up his a word violently.\n\nThere is no plot at all stuff just happens for no reason and makes no sense like when the bad guys drop their machine guns so they can fight an unarmed Hulk Hogan and 3 five year olds with swords which they have for some reason. Also there is one scene where the bad woman starts a 4 minute timer on a bomb but it doesn't go off for well over 17 minutes.\n\nThis movie really sucks and was actual work to sit through. Seriously f word this movie I hate this movie so much. On the bright side it's not the worst movie with a title starting with a 3. I am only giving this movie a 2 because it wasn't outwardly sexist or racist. After watching Pink, Airplane Mode, and 3 Idiotas, I have lost the ability to give movies lower than a 2.\n\n2/10 -Rajesh P."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "sameaton666",
        "review_rating": "10",
        "review_title": "This is the best film ever!!!",
        "review_detailed_main": "This is one of the funniest films I've ever seen. Watched it on a hangover with a mate and we couldn't stop laughing the whole time and, despite having a lot of work to do, were compelled to watch to the end to see if the 3 ninjas won. It's the most ludicrous story line I've ever seen in a film, I was just sitting there thinking how is that little kid beating up grown men 'ninjas' - surely just knee him in the head, he's about 6. And that ridiculous girl with all the gadgets, \"Let me just reroute the encryption through the CPU\" or some bollox, on what was essentially a toy computer. The female leader of the terrorist looks like an 80s porn star (so does the Hulk as well, I guess), speaking of which, Mr. Hogan put in one of his best performances since Muppets from Space. It is genuinely the worst, least believable film you will ever see and as a result is truly hilarious. Also, one of the kids has literally the worst haircut you will ever see, it's worth watching the film purely for that. Long live Dave Dragon!!!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Jim-456",
        "review_rating": "9",
        "review_title": "My kids loved this movie, we're going out to buy it today.",
        "review_detailed_main": "My kids loved this movie, we're going out to buy it today. We just rented this movie and my kids liked it so much that we have to go and buy it today. My wife and I liked that the fight scenes were fun and not violent. A GREAT kids movie."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "iansjunkmail",
        "review_rating": "10",
        "review_title": "10 out of 10 for being one of the worst movies ever made",
        "review_detailed_main": "This movie falls under my friend's theory that if a movie is bad enough, it loops around to become good again. Not dissimilar to Einsteins theory of bending light around the universe to see into the future (aka Paycheck). This movie is so terrible (just like the ones before it) in so many ways its hard to believe any production company would sign on to do it. Hulk Hogan is, as always, a terrible actor, but to reproduce the performance he gave in Gremlins 2: The New Batch, would be impossible for anyone.\n\nWatch this movie if you have a sense of humor and an hour and a half to waste."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "mum-6",
        "review_rating": "9",
        "review_title": "great movie!",
        "review_detailed_main": "I'm not a child, but I still enjoyed this movie. I enjoyed the first three, although in the second movie (kicks back) the youngest kid barely fought at all. I enjoyed this movie because all the kids have action. They all have black belts so the action is really good. It's a great movie. I liked it. This movie is great entertainment for children. This is also a good movie to watch if you are bored or there's nothing good on. I enjoyed this movie a lot. I've seen all the 3 ninjas movies and enjoyed them all. This is also a good action film for children. They would probably enjoy it as much as I did. Victor Wong acted really well returning as grandpa mori. The rest of the cast is good also, and the movie as a good storyline."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "ryogamkn",
        "review_rating": "9",
        "review_title": "Would you please stop trashing this series?",
        "review_detailed_main": "I've waited over four years to see this movie, and people have to stop trashing this series. Having taken karate myself as a kid and working in an amusement park, this movie is far from stupid. If you're a fan of the series, you'll love this one.\n\nThe only negative point I can see is that they didn't use the original actors except for Grandpa Mori; however, in this case it doesn't hurt the movie. The kids were far better at karate and the action was great.\n\nIf you like Teenage Mutant Ninja Turtles or Power Rangers, you'll like this movie too.\n\n9 out of 10.\n\nPeace out."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "shoottiger",
        "review_rating": "10",
        "review_title": "not bad.",
        "review_detailed_main": "This was a pretty good movie. Granted it was a bit cheesy and hokey at times, but you have to realize that this movie isn't for 16 year olds looking for a lot of heated action. This movie was geared towards children. Which is why the fight scenes are more cartoony. I liked the actors in it. The late Jim Varney did an excellent job of playing a goofy, yet overall, bad guy. I suggest you see this, that is off course if you are in the age group of 12 and under. I guarentee that your kids will love it."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Hi-Yah!",
        "review_detailed_main": "Hwah! Huh! Why did I make those noises? Because that's how exciting this sequel to the very funny movie \"3 Ninjas\" really is! Both movies are nice, good, clean family fun (as for \"Surf Ninjas,\" too), and parents won't have to be worried about bad content or anything of that matter.\n\nI remember in the first movie, those kids can kick those bad guys' butts! Now, in the second movie, well, there's more fighting! Kids love this stuff!\n\nAnd another reason to like this movie: Two words: Hulk Hogan. Seeing him act is just like seeing Tor Johnson act; both are funny guys! So this Friday night, when there's nothing to watch on television that night, go out and rent these movies!"
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Cholloway18",
        "review_rating": "10",
        "review_title": "3 ninjas and Dave Dragon save the day in true ninja fashion!",
        "review_detailed_main": "This movie is really good, even though Dave Dragon gets captured two or three times, but it's still a good movie. Jim Varney is great as the villain,Lothar. 3 ninjas High Noon at Mega Mountain is the best 3 Ninjas movie, and I dare challenge any film critic to a Film debate, Seriously! This movie has it all action, drama, comedy, and even some sensitive moments which isn't at all bad to have in a movie. It's a true family film, because it isn't very violent, and there's no bad language, which has just completely taken over the movie, and TV industry. I'm glad that there's some movies like these that doesn't have all of that. And Hulk Hogan is a great actor."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "omleyla",
        "review_rating": "9",
        "review_title": "Childhood movie",
        "review_detailed_main": "I liked this movie alot when i was a kid i had so kept rewatching it, I think it's a great for kids if they like martial arts or you want get them inspired to try and learn martial arts."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "julieeverson-78686",
        "review_rating": "10",
        "review_title": "Very Entertaining",
        "review_detailed_main": "I enjoyed this movie very much and found it very entertaining to watch. The shots of the rides are really cool. It was very creative and imaginative. I'm sure it was lots of fun to film."
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Den-13",
        "review_rating": "",
        "review_title": "I love ninja movies, even with comedy mixed in.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "orale_vato_loco",
        "review_rating": "",
        "review_title": "Um..........what have we done to deserve this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Sheaattruman",
        "review_rating": "",
        "review_title": "OK I guess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "Ninjix",
        "review_rating": "",
        "review_title": "horrid!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118539",
        "movie_name": "3 Ninjas: High Noon at Mega Mountain",
        "movie_rating": "3.0",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Cheaply delivered in every regard without any sense of fun, wit, imagination, or thought for the audience",
        "review_detailed_main": ""
    }
]