[
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "semylogy",
        "review_rating": "1",
        "review_title": "easy way to make money",
        "review_detailed_main": "This movie is a tool to convert Youtube Fans into Turkish Liras. Thats the point."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "kubilayorcun-01476",
        "review_rating": "1",
        "review_title": "Here is a movie long youtube video",
        "review_detailed_main": "While reviewing this movie the first thing to consider is \"Should this movie be considered as a long enough youtube video while reviewing it or should i review it as it is a movie?\". If it is first option, it is a profitable and enjoyable youtube content. But since this is a review on IMDb we shall consider it as a movie so it sucks. First thing to mention is cast which is full of famous or almost-famous 'youtubers'. Those guys or girls are not actresses or actors they should just continue to produce entertaining and enjoyable content for youtube. This situation that they have put themselves into is something like \"I can ride a bike well , so why not i ride a motorbike ?\". This is a logic that nobody should believe or follow. I won't even mention the actings of those i have been talking about. Maybe story can be somehow inspiring, but it can only inspire under 10 years old kids who can be inspired by almost anything at that age."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "ozge-figen",
        "review_rating": "1",
        "review_title": "Ashamed",
        "review_detailed_main": "Second-hand embarrassment at its finest. Even a person who never tried to write a script or tried to hold a camera in their life could maintain a quality like this. Just so you know, you could at least put some effort in it. I don't know, make it somehow interesting or put some experienced actors, this movie is something a high-schooler would make. I'm not sure if this movie really took time, with this poor quality. Oh and, the creator himself is actually trying to make this movie look good by calling out his fans. Smh."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "elmasbasakgoren",
        "review_rating": "1",
        "review_title": "Not garbage but almost garbage",
        "review_detailed_main": "To be honest, it doesn't deserve either 1 or 10. He is the most popular youtuber in Turkey and he has lots of fan in Turkey. I rated \"1\" because 6 is too much for this movie and i think all of his fans rated 10 so this movie's average puan is so high for that movie. In addition, this movie's scene transition is so bad.. it is like a YouTube video or smth.. not professional and i think we can not categorize that like it is real movie. It has a lot of imperfect scene, casts (except 2-3 of them) was not acting very well. I don't suggest that movie unless you want to lose your times."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "alperdoganozturk",
        "review_rating": "1",
        "review_title": "An easy way for milking money out of young fans...",
        "review_detailed_main": "It is obvious that this movie is targeting young audiance which mainly consist of 5-10 years of childeren who spend their day watching Youtubers via smartphones and tablets supplied from their parents at a very young age... The movie was uninspiring, scenerio was unoriginal and acting was bad."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "pandeamonnn",
        "review_rating": "1",
        "review_title": "cancer",
        "review_detailed_main": "-waste of time -loss of money\ndisgusting script\nacting disgrace\n+he bought himself a sports car + YouTube shared"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "lilmetheus",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "If you want see garbage yes! you can watch then..."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "kemalcanocak",
        "review_rating": "1",
        "review_title": "Worst movie ever...",
        "review_detailed_main": "If this was a Youtube video, then it could be watched. But it's a movie! Script, content,acting and quality are very low. I'm not worried to say that this movie is one of the worst films I've ever seen in my life ..."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "emree_z",
        "review_rating": "1",
        "review_title": "disgrace",
        "review_detailed_main": "It is the worst movie ever in Turkish cinema history."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "DansLeNoir",
        "review_rating": "",
        "review_title": "Trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "kaanavcu61",
        "review_rating": "1",
        "review_title": "The true summary of the Turkish education system and the youth !",
        "review_detailed_main": "Even when you take a look at the absurd content of the movie, it seems quite obvious that Enes Batur himself has successfully managed to contaminate the mindset of Turkish youth with non-sense and aimless conversations and deeds throughout the movie. He proved himself to be an unneeded youtuber once more with this waste-of-time movie. This kind of counterproductive work should have been prevented right at the very beginning before it misled the young individuals."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "saygnkarabulut",
        "review_rating": "1",
        "review_title": "Our curiosity sometimes wasting our time...",
        "review_detailed_main": "I dont get the desire of this movie.It's basically made for milking Youtube fan base that he has.(Guessing mostly kid based)Acting is bad.Casual cliche(s) making the movies plot.And more!I dont have any time left to review this stink recording.I need time to rewatch my favorites and realise the flow of perfection.But this is basically in the Imdb's worst 100..."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "canermemis",
        "review_rating": "1",
        "review_title": "bad movie",
        "review_detailed_main": "This movie sucks. Do not loose your time by watching it! it was not fun at all. Halil's movie was better at least there was a scenario..."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "WizardDerv",
        "review_rating": "1",
        "review_title": "Nothing more than a cashgrab",
        "review_detailed_main": "I have no idea how this movie is rated 6 out of 10. If I could I would give it 0 stars but sadly it's not possible. This movie is only made to earn more money and attract little kids. You can donate a few liras to charity instead of giving Enes more money."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "egeturkuler",
        "review_rating": "1",
        "review_title": "Try not to cringe challenge made into a film",
        "review_detailed_main": "Here some guy earns so much money from youtube, he decides to make a film of his own. The plot is garbage in every angle. Noone can find a good part of this movie. It is targeting children that love Enes Batur, young children who watch all of his videos everyday no matter how ridiculous. I can say that this is the worst movie ever, just throwing your money away. Wakaliwood Productions made much better movie with just 200 dollars."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "miamirains",
        "review_rating": "1",
        "review_title": "Dont watch this",
        "review_detailed_main": "Do not let your kids watch this movie and any enes batur videos if you love your kids be aware"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "gabrieltmmbady",
        "review_rating": "1",
        "review_title": "THE worst movie",
        "review_detailed_main": "This is the worst movie I've ever seen in my life, boring jokes and a lousy script\n\nThis movie only serves to take money from the fans of Youtuber."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "iskatran",
        "review_rating": "",
        "review_title": "Turkish cinema doesen't deserve this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "atabayraktar-97086",
        "review_rating": "1",
        "review_title": "Bad movie!",
        "review_detailed_main": "This movie is about a famous youtuber Enes Batur! I dont love his videos but he haves 7.000.000 subscribes! And half of them are only 5 or 6 years old! Now he gets a movie. I only watched this movie because i had a cinema ticket for only 2D movies and this movie was only good 2D movie that plays in theaters that day! And this movie was so bad. Actors are the worst part of the movie! They are so bad! And they are not even actors they are just youtubers! And this movie made a good box office so that means we are going to see more youtuber videos! Turkish cinema is death because if anything gets popular they make movies about that! This movie is a low budget movie! And when i went to theathers there were only kids like age 5 with parents and only kids were laughing to the movie! I only smiled like 2 times so this is a waste of time dont watch this movie!"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "zenustasi",
        "review_rating": "8",
        "review_title": "Prejudice is a bad thing !",
        "review_detailed_main": "To be honest, it's absurd to criticize a YouTube-made film as Umberto D. Enes Batur has a unique follower mass, he has good communication with them and deals with an important crowd that no one else could strive to make a film, as most people cannot. I think critics like 'not hold a camera before' or 'not wrote a script' is absurd. When someone starts this job at the age of 19, when can they try? I think it's a good viewing rate for the first movie and the things he does in YouTube are very successful. It is wrong to approach a film in this way. Anyone with logic can see from the votes that everyone voted this film in the manner of having preconceived opinions and voted without a watch."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "frescolevo",
        "review_rating": "2",
        "review_title": "Cheap and bad",
        "review_detailed_main": "Title telling all my views about film and if u wanna watch this film , go and think where your life going"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "yagizhanburak",
        "review_rating": "1",
        "review_title": "Disgusting waste of money movie.",
        "review_detailed_main": "This movie is just to get some money from some 5-6 yo kids. Just a waste. Cinema providers shouldn't have been approved this movie. W A S T E"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "omerkartak",
        "review_rating": "1",
        "review_title": "For Kids",
        "review_detailed_main": "This films watchers are kids(4-10).Enes Batur Çatir Çutur may a good youtuber but not filmmaker."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "harunbaydal",
        "review_rating": "1",
        "review_title": "Most trash movie I've ever seen",
        "review_detailed_main": "As someone who is Turkish I feel bad for Turkey. Don't waste your time with this trash movie"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "tolunayd22",
        "review_rating": "1",
        "review_title": "This isn't cinema!",
        "review_detailed_main": "Writer failed too. Many scenes are very cliche. Very poor acting performances.\n\n⭐ 100/18"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "polatu",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Really boring storyline Really nonsense acting Boooring...."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "Artemur",
        "review_rating": "",
        "review_title": "This is definiton of Vanity Project",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "DarthValeria",
        "review_rating": "1",
        "review_title": "This movie is an insult to Turkey!",
        "review_detailed_main": "Those stupid YouTubers should never make any movies for cinema\n\nThey do nothing but messing up with Turkish Cinema Sector"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "omer3838",
        "review_rating": "10",
        "review_title": "Pretty good movie",
        "review_detailed_main": "I don't get all the hate towards this movie. The main guy Mr. Batur is a great actor and he's also an activist. Inspired from Inception, it tells a story of a person who is stuck between the reality and imaginary world. Many philosophical questions arise and several ethical dilemmas are presented to viewers.\n\nThe film's cinematography is visually stunning, capturing the contrast between the vibrant, dreamlike sequences and the more grounded, stark reality. The transitions between these two worlds are seamless, keeping the audience engaged in the main character's internal struggle. Moreover, the soundtrack complements the narrative perfectly, adding emotional depth to key moments. While some may criticize the plot as overly ambitious, I believe it successfully challenges the viewer to think critically about the nature of truth and perception."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "volibear_m",
        "review_rating": "1",
        "review_title": "This film awful",
        "review_detailed_main": "I don't like it. It was so boring. It was silly. I don't understand anything."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "kanmerdoo",
        "review_rating": "",
        "review_title": "Worst Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "egek784",
        "review_rating": "1",
        "review_title": "Does really everyone have to make a film?",
        "review_detailed_main": "Yes, this is my question. If you can afford to make a film, does it mean you have to do it? The whole cinema industry is a serious business, no matter how many awful movies are there. Unfortunately, this Youtuber believed himself to make a film to screw up the cinema. Apart from that Youtuber, did his friends, directors, producers (basically the whole film crew) really ask themselves what are we doing? When I come across a bad film, I always ask to myself this: \"Did no one say \"Come on guys, we are insulting the cinema.\" or something?\" Turkish film and TV series industry are really indifferent about what they are doing."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "erdemalsirt-38337",
        "review_rating": "2",
        "review_title": "Some scenes are really like a movie, but most scenes are no different from YouTube videos.",
        "review_detailed_main": "I've been bored with most of this movie's scenes. Except for some scenes, most scenes are very boring."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "ufukakgul",
        "review_rating": "1",
        "review_title": "The Worst Turk Movie of All Time",
        "review_detailed_main": "There is no worse Turkish movie. The disgrace of Turkish cinema. Waste of time"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "AloneOliver",
        "review_rating": "3",
        "review_title": "First wave!",
        "review_detailed_main": "With this movie, all social media celebrities started to make movies. They made the already bad Turkish cinema worse. The acting is terrible, the scene transitions are terrible, the characters are superficial, the shooting is bad."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "puffydanteh",
        "review_rating": "5",
        "review_title": "Hmm idk",
        "review_detailed_main": "This movie was 50/50 the who press the 10 star he is enes batur fan but who pressed 1 star he/she is hater\n\nthe problem is the : haters,fans\n\nthe haters didnt watch the film but he/she pressed 1 star\n\nthe fans didnt watch the film but he/she pressed 10 star\n\nwatch the movie and be careful when you vote."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "torosonce",
        "review_rating": "3",
        "review_title": "its stupid to give 1 without watching",
        "review_detailed_main": "The real problem is the fans and the haters,fans are giving 10/10 and haters give 1/10 or 2/10, why would i lie i watched the movie and it was okay, i think every movie desevers more than 3"
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "egebaysal26",
        "review_rating": "2",
        "review_title": "meh 2/10 watch only if you like Turkish films a lot!",
        "review_detailed_main": "Bland and typical Turkish story, honestly I don't even care any more."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "canozerpirireis",
        "review_rating": "1",
        "review_title": "Enes is my friend best friend",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "bombaoglu",
        "review_rating": "4",
        "review_title": "BAD",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "yavuzyal",
        "review_rating": "1",
        "review_title": "OHH!!! IT'S GORGEOUS!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "umutaygun",
        "review_rating": "1",
        "review_title": "i really tried to watch it to the end",
        "review_detailed_main": "But i failed. now i feel the cringe deep down in heart. thanks enes batur, for making me miserable in this lovely night."
    },
    {
        "movie_id": "tt7668842",
        "movie_name": "Enes Batur: Imagination or Reality?",
        "movie_rating": "2.0",
        "review_username": "myannhbar",
        "review_rating": "1",
        "review_title": "Enes Batur is stunning in bad way.",
        "review_detailed_main": "Enes Batur is a popular Turkish YouTuber who has gained a massive following through his entertaining videos and vlogs. In his latest project, a film titled \"Enes Batur: Hayal Mi Gerçek Mi?\" (Enes Batur: Dream or Reality?), he explores the blurred lines between fantasy and reality, showcasing his journey of self-discovery and reflection.\n\nThe film starts off with a glimpse into Enes Batur's childhood, where he is seen as a young boy with big dreams and aspirations. Throughout the movie, he revisits his past and the people who have influenced him, showcasing his growth as a person and as a content creator. The film is a mix of documentary-style footage and dramatized scenes, giving viewers a glimpse into the life of Enes Batur beyond his online persona.\n\nOne of the strengths of \"Enes Batur: Hayal Mi Gerçek Mi?\" is its ability to humanize the YouTuber and show the person behind the screen. Enes opens up about the challenges he faced growing up and how he overcame them to achieve success. Through interviews with friends, family, and colleagues, we see a more vulnerable side of Enes Batur that is not often shown in his videos.\n\nThe film also delves into the impact of fame on Enes Batur's life, showcasing the highs and lows of being a social media influencer. Enes discusses the pressure of constantly producing content and the toll it takes on his mental health. We see him struggle with the expectations of his audience and the need to constantly reinvent himself to stay relevant in the ever-evolving world of social media.\n\nOne of the most compelling aspects of the film is Enes Batur's exploration of his own identity and the role he plays in shaping the lives of his fans. Through candid interviews with his followers, we see the impact Enes has had on their lives and how he has inspired them to pursue their own dreams. The film raises important questions about the power of social media influencers and the responsibilities that come with having a large platform.\n\nVisually, \"Enes Batur: Hayal Mi Gerçek Mi?\" is stunning, with beautifully shot scenes that capture the essence of Enes Batur's journey. The film is accompanied by a powerful soundtrack that adds depth and emotion to the narrative. The mix of documentary footage and dramatized scenes creates a compelling storytelling experience that keeps viewers engaged from start to finish.\n\nWhile the film is overall a captivating and well-crafted piece of work, it does have its shortcomings. Some viewers may find the dramatized scenes to be too cheesy or over-the-top, taking away from the authenticity of the story. Additionally, the pacing of the film can be a bit slow at times, with certain scenes dragging on longer than necessary.\n\nOverall, \"Enes Batur: Hayal Mi Gerçek Mi?\" is a thought-provoking and introspective look at the life of one of Turkey's most popular YouTubers. Enes Batur's journey of self-discovery and reflection is both inspiring and relatable, making the film a must-watch for fans and newcomers alike. Despite its flaws, the film succeeds in shedding light on the complexities of fame and the power of social media in shaping our identities.\n\nIn conclusion, \"Enes Batur: Hayal Mi Gerçek Mi?\" is a visually stunning and emotionally resonant film that showcases the depth and complexity of one of Turkey's biggest social media influencers. Enes Batur's honesty and vulnerability shine through in this captivating exploration of dreams, reality, and the blurred lines in between."
    }
]