[
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "StevePulaski",
        "review_rating": "3",
        "review_title": "It's time Marlon Wayans and Michael Tiddes be held accountable for ushering in the real lowest common denominator of humor",
        "review_detailed_main": "You would think with all the accumulated earnings the Wayans brothers, Shawn and Marlon, have obtained after being on Television and in films for years that they would invest their money and their time in projects that would be a bit more thoughtful and entertaining. Instead, ever since the runaway success of \"A Haunted House\" in 2013, the two, particularly Marlon, have been keen on making movies that fit the bill for the lowest common denominator of entertainment. \"Fifty Shades of Black,\" a horribly obvious and persistently unfunny array of cheapshots at the erotic novel/film series that is already too easy to joke about, continues Marlon's streak and incredible failing to make something out of his Baby Way Productions company.\n\nI've always found it interesting that while Tyler Perry's films are anything but consistent, and there are about an equal number of bad films in his catalog as good films, he often gets blamed for making films about black people that cater to the lowest common denominator and showcase them in a negative light, yet the recent collaborations of Marlon Wayans and Michael Tiddes go pretty much unscathed. These are films that evoke some of the most putrid and ugly stereotypes about nearly every race and, for that matter, exist simply as unapologetically crude and contrived projects that do nothing but attempt to evoke laughs based on brand-recognition. These films are just a slight notch above the dreaded works of Jason Friedberg and Aaron Seltzer.\n\nAs hinted, \"Fifty Shades of Black\" is a parody of \"Fifty Shades of Grey,\" and it takes pretty much the safest, most convenient route to parody the film by making the jokes largely centered around the absurdity of BDSM and its culture, race and ethnic humor, the ordinariness and \"ugliness\" of its lead female character, and the enigma surrounding its titular character, who in this case, is Christian Black (Marlon Wayans). Christian is a multi-millionaire mogul who begins a sexual relationship with his new intern, Hannah Steale (Kali Hawk) and what entails is a relationship filled with sex, sexual violence, and downright bizarre encounters.\n\nWhile whatever Adam Sandler and his Happy Madison gang is cooking up this year is likely to get plenty of Razzie nominations, Marlon Wayans and his cast of familiar faces such as Affion Crockett, Missi Pyle, Mike Epps, Fred Willard, and more should be looking at the same award. It's incredibly rare to see a cast ostensibly operate on auto-pilot and look like the end product bearing some essence of quality is the furthest thing from their minds, but perhaps given the lazy screen writing of Rick Alvarez and Wayans himself, this was to be expected.\n\nShockingly enough, \"Fifty Shades of Black\" offers more laughs than both of the \"Haunted House\" films put together, especially during a sequence that parodies one of last year's Best Picture contenders at the Academy Awards. However, in order to get to this sequence, one has to succumb to the drudgery of enough racial and bathroom humor - so much that it gives Laura Mulvey's concept of \"phallocentrism\" a whole different angle to explore - that it ultimately isn't worth sitting through the amount of trivial nonsense to get to that particular scene.\n\nWe're not even in February yet and this year has already been incredibly interesting for comedies. After seeing \"Ride Along 2,\" I didn't think many more comedies of the year would get much worse than that. Then I saw \"Dirty Grandpa\" the following week and I thought the same thing; there was most likely the weakest comedy of 2016 that I would have to sit through. Now, almost exactly a week later, I've seen \"Fifty Shades of Black,\" and if this isn't the worst comedy of 2016, I seriously fear what I have to endure in the coming eleven months."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "stevendbeard",
        "review_rating": "5",
        "review_title": "More Misses Than Hits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "The_Celluloid_Sage",
        "review_rating": "5",
        "review_title": "Typical Wayans...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "lnvicta",
        "review_rating": "2",
        "review_title": "I tried to like it. I really did...",
        "review_detailed_main": "Let me preface this by saying I have never seen 50 Shades of Grey. I've seen the reviews, I know the story, but after seeing 50 Shades of Black I feel like I've seen the actual movie it was parodying. Wayans' comedies have devolved from clever self-aware satires to blatant movie rip-offs with sporadic laughs. The difference is, unlike the Haunted House movies, there are next to no laughs in 50 Shades of Black. It's essentially deconstructing every scene in 50 Shades of Grey to show the audience how dumb it is, which would be fine if it was actually funny. But no, this humor is scraped right from the bottom of the barrel, reusing the same stupid gags from previous spoofs and rehashed awkward shock \"humor\" that comes across more cringe-worthy than anything.\n\nI like Marlon Wayans, I really do. He seems like an awesome guy and he was actually a great writer one point, and a great actor too (to this day I'm blown away by his performance in Requiem for a Dream), but his talents must have gone to his head because he isn't tapping into his genius anymore. It's just easy joke after easy joke, and as simple as the jokes are, none of them land. In fact, at one point after a painfully awkward dinner scene that went on 5 minutes too long, I couldn't help but laugh, for the wrong reasons mind you, thinking, \"Jesus Christ, this is a real movie?\" It was painful.\n\nAll of me wanted this movie to be good, but part of me knew it would be a disaster. Well, that part of me was right. Sure, I chuckled at a few scenes, but I also chuckled a few times in A Haunted House 2 and that's still a terrible movie. The difference is 50 Shades of Grey is even lazier and somehow even less clever than AHH2. I anxiously await the day the Wayans brothers come out with another great spoof movie, but I have a feeling it's going to be a long, long wait."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "oliviafrancesca_x",
        "review_rating": "1",
        "review_title": "50 Shades Of Shite",
        "review_detailed_main": "After weeks of being teased by the trailer I was so excited to see this film! I was expecting 50 Shades Of Grey meets Scary Movie- you know, a parody that actually worked. But I couldn't have been more wrong. It was more 50 Shades Of Shite.\n\nFive minutes in to the film and I knew i'd spend the remaining 1 hour 27 minutes with my palm on my forehead, cringing for my life at it's stupidity.The film had potential to be very funny but the idea was crushed by the terrible acting, and pathetic excuse for dark humor. I can account for the two times, throughout the whole movie, I let out a slight giggle- well it was more of a scoff but at least it triggered some kind of emotion eh.\n\nAs a kid I loved the Haunted House and Marlon Wayans was brilliant in it; I think this is why I expected great things. I think he should stick to his PG rating films. It's crude sexual content contained stereotypical 'humor' that could be considered racist towards African American's and many people could take offence. I find it offensive that we are expected to pay as much as £5 to watch this. Watching paint dry is more entertaining.\n\nI was counting down the painful minutes, praying for the movie to end. When it did, sheer disappointment and disgust was how I was left feeling about this movie. This film is a waste of time and a waste of a cinema slot."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "stevenfreekin",
        "review_rating": "",
        "review_title": "Fifty Shades of Crap!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "eladale-90211",
        "review_rating": "1",
        "review_title": "How did they get financing to make this disaster?",
        "review_detailed_main": "I have always been a huge fan of parodies, so I was looking forward to this movie. My expectations were realistic. Puns, slapstick humor, and generally sophomoric humor are fine by me. These parodies don't take themselves too seriously, and neither do I. The wife and I went to the theater expecting some lighthearted fun. But, what we saw was anything but fun or funny.\n\nThis film's attempts to parody the plot of Fifty Shades of Grey were overshadowed by the stilted dialogue, lame sight gags, and ineffectual attempts to get a rise out of the audience with tired racial stereotyping and racist humor. Sexual humor was expected. But I did expect some of it to be funny. It wasn't. Most of the gags in the film were greeted by dead silence in the theater and blank stares at the screen by my fellow theater goers.\n\nWe talked about walking out of the movie after the first scene, and every scene after that until we finally did walk out 20 minutes into the movie.\n\nMaybe there was a funny joke in that movie later on, but I am sure I will not be giving this movie a second chance. It is one of the worst movies I have even seen."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Poochface",
        "review_rating": "1",
        "review_title": "Truly Appalling",
        "review_detailed_main": "How the heck does tripe like Fifty Shades of Black get funding let alone distribution? It makes Fifty Shades of Grey look like Shakespeare. Crap like this certainly doesn't help the diversity argument. Personally I would never employ any of the participating actors; black, white or any other skin colour ever again. They were all an absolute disgrace. There are films released this week that people will struggle to find whilst this garbage will stink up cinemas up and down the country for at least a week. God knows why I stayed so long but I eventually walked as no way was I going to miss my last bus home for this bilge. If you are given the choice of being tortured or watching this; I urge you to choose the torture. It won't be anywhere near as painful. Trust me"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "kieranbattams",
        "review_rating": "2",
        "review_title": "a film that is a parody of a film that is a fan fiction of a film that already got a parody.. EUGH!",
        "review_detailed_main": "Here is my review in short. DO NOT SEE THIS FILM. It sucks worse than fifty shades of grey.. which is an absolute trainwreck. I didn't pay, but feel bad for giving any of my time to the film and as well as being unfunny it is incredibly boring, racist and horrendus. I chuckled about twice and one of those times was coz fifty shades of grey was read as a torture technique.. so well played. There was a skit involving whiplash which may have been bearable on SNL but not here.\n\nAll i will say is save your time and oxygen. Go and be with your family, be anywhere but here. Quite frankly i saw 10 Cloverfield Lane today and i'd rather talk about that so.. see ya."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Harlequin-Rose",
        "review_rating": "1",
        "review_title": "I lost IQ points watching this",
        "review_detailed_main": "I did the world a favour by throwing this dvd in the garbage.\n\nI grew up on the Wayans brothers comedy, so expected something funny, or at least slightly silly from them.\n\nNope.\n\nThis was without a doubt the worst movie ever made. In 1000 years archaeologists are going to dig this nonsense up and judge as harshly for it.\n\n\"This was right before the collapse of humanity\" they'll say, \"You can unquestionably see it coming after only 5 minutes of this nonsense.\"\n\nAre the brothers okay? I genuinely worry for them. Have they been taken out and replaced by robots or something? How can the people who brought us White Chicks think this is something to put your name to? I want to take them to lunch and beg them to find new careers."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "iamdawiz",
        "review_rating": "1",
        "review_title": "A disgrace of the film discipline.",
        "review_detailed_main": "The absolutely worst movie I've seen thus far.\n\nAs a parody of \"Fifty Shades of Grey\", one only expects cheesy, lewd sex jokes. However, this movie is an absolute disgrace, every single scene felt like a direct and personal attack to my intelligence. Even cheesy parodies can have some intellect and level of tastefulness.\n\nMarlon Wayans disgraces himself, his family's brilliant comedy legacy and the also film discipline."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "andre2999",
        "review_rating": "8",
        "review_title": "Funny if you know what kind of joke to expect",
        "review_detailed_main": "People should be used to the kind of humor coming from movies with Marlon Wayans, so I don't get the point of people complaining the humor was offensive. If it's not your thing it's obvious you won't like it, the least you can do is learn that some actors/directors make movies you simply don't like.\n\nI only new enough about 50 shades (the book) and can't tell there is no need to watch the movie before watching this.\n\nAt the beginning the movie doesn't really know where it's going, but after a while it finds its pace and delivers. Me and my friends had good laughs."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "amandahakimi",
        "review_rating": "7",
        "review_title": "Funny as Always. . . Some lagging areas..But, Overall Good Jokes",
        "review_detailed_main": "Marlon takes aim at everyone in his humor in this movie. I found his political jokes quite funny.\n\nI really enjoyed the way they laid it into the writers and makers of the original movie. I never saw it because I thought the entire premise was sick and ridiculous. My view of that movie is pretty much in line with Marlon's, and his remake gave me many good laughs.\n\nThere were many parts which could offend women, different races, political views, but especially fans of the original movie. lol.\n\nHe does not hold back though, and I always find him to be original and funny. Just a little more effort and time on some of these and he could make them much bigger for all to enjoy. Thanks Marlon for all your works."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "subxerogravity",
        "review_rating": "4",
        "review_title": "50 shades of whack! Which is 49 shades better than the movie they parody",
        "review_detailed_main": "I find it strange that Marlon Wayans found the need to parody what is already hands down the funnest movie of 2015. Does a bad movie, really need a parody? Seems redundant, but they did it.\n\n50 shades of black has some decent jokes that poke fun at how outrageous 50 Shades of Grey is (although my favorite bit was one that parodied Whiplash with Florence Henderson playing a music teacher training young boys to use their \"instruments\"), but the laughs are not constant enough through the entire movie to justify the money spent.\n\nIt's good that Wanyans has no problem making light of himself, cause it's those skits that made for the most laugh out loud experience , but he also has no problem making a joke at someone else's expense. I probability would not care if the jokes were funny. There recent though, with a joke about the 2016 presidential campaign thrown in the mix.\n\nIt's packed with enough laughs to get something out of it, but the material used to make this was too weak itself for this movie to be all that good."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "lucasnochez",
        "review_rating": "1",
        "review_title": "Film Review: Fifty Shades of Black",
        "review_detailed_main": "It was only a matter of time that someone came along and spoofed the widely popular and highly alluring pop-culture phenomenon that was Fifty Shades of Grey. What isn't surprising is that spoof specialist and kinda, sorta washed up actor/writer Marlon Wayans was the one to do so. Wayans, whose previous parody films include A Haunted House 1 & 2, Dance Flick and Scary Movie 1-4 brings forth a very important question with his newest spoof feature Fifty Shades of Black; is the spoof film finally, officially dead?\n\nIts hard to believe but, after such classics as Airplane!, Austin Powers: International Man of Mystery and yes, even the original Scary Movie, the spoof film may slowly if not almost entirely die off and be resting in peace very soon.\n\nThe world currently is one that is obsessed with social media platforms and media within these social networks. Thanks to applications such as Vine, Instagram, Facebook, Snapchat and YouTube, it seems that audiences everywhere are capable of finding comedy and entertainment, not only within the comfort of their own homes, but as easily and accessibly, within moments, within the palms of their hand.\n\nWhen the dawn of the television was upon us, people everywhere thought that televisions were going to destroy Hollywood and the history of feature films altogether; it didn't. With the rise of the Internet and the quickly developing moment of streaming and illegally downloading films and music online, people soon thought that the future of movies and music was on its way on the decline. Yet, in 2015 no less, two of the highest grossing films of all-time were released, and more than ever, the profitability of music has never been better. So, how and why is the spoof film genre dying slowly but surely?\n\nThe thing about entertainment in 2016 is that, entertainment isn't merely measured but numbers and margins, but by memories and moments of experience and spectacle, with margins and numbers as well. Entertainment is constantly evolving, and the forms in which we consume entertainment maintains the ways in which we determine whether the entertainment itself is viable, or not. The thing with earlier spoof films like the ones that were mentioned above are, in order to consume such comedy, going to the movie theatres and watching it for yourself was the only way of consumption. Now a days, not only are films, genres and characters spoofed on the daily, but pop culture, with the help of social media, spoofs the crap out of anything and everything. Don't think thats the case? Think back, just in 2015, to all the spoofs you saw online about Adele's song Hello, Drake's music video to Hotline Bling, as well as anything else flooding the front pages of your vine, Instagram and Facebook news feeds.\n\nThe beauty behind the genius in the earlier spoof films of the 80's and 90's was that accessibility was limited and, these films weren't just spoofing a specific movie, having limited content to work with. Think of Austin Powers for example, it wasn't just a spoof on spy films and a filmography of more than a dozen Bond films at that time, but also a genre, the unbelievability of a lifestyle or profession little to nothing is known about, as well as providing a fantasy for the possibility of the many beauties the life of what an international person of mystery might really be like. Sure, Black may spoof Kim K for a second, the Weeknd here and there, but overall, these small and insignificant and highly forgettable inclusions did nothing to elevate the plot or humour of the film overall.\n\nIf you're wondering why I haven't really mentioned the plot line or story of Black, well, thats because the film is basically a shot-for-shot carbon copy of the original Grey film, with added crass and crude black jokes included, sexual innuendos juiced up to the max and of course, taking what the original did, and making it funny by stripping away its glamorous and polished exterior; essentially, making it real world scary for real life people. No matter how you look at it, regardless of how much money you have, any girl would be scared of having a wealthy man stalking you at work asking for ropes and zip-ties and what not.\n\nWhat I found super interesting with Black was how the film is slowly accepting and transitioning from movie stars, to social media stars starring within feature films. Sure we've seen Vine stars make cameos in films before, like Brittany Furland in last year's We Are Your Friends, but in Black, social media icon King Back/Andrew Bachelor has a very prominent role as the not so subtle yet totally obvious best friend Jesse that wants a piece, like any other straight male friend wants from their female friends. Bach represents not only a dominance of social media within feature films, but perhaps, the next phase and new generation of movies stars tomorrow. Plus, is it just me or does Bach remind anyone else of a younger Will Smith?\n\nSure Black states the obvious humours that we found in the original Grey film, but the beauty of Fifty Shades of Grey was that it knew that it was going to be the basis to much criticism, the butt end of endless jokes and spoof online for weeks and months after its release. Luckily for the film, made on only $40 million dollar, its return really laughed in all the faces of sceptics and all its negative criticism. Fifty Shades of Grey broke these records; highest grossing film directed by a woman, highest grossing February release and #1 President Day 4-Day Holiday Weekend (all of these numbers NOT adjusted for inflation). So I guess, the joke is on us, especially since they numbers and records are bound to be broken once the newest instalment of the series is released in 2017."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "dave-mcclain",
        "review_rating": "5",
        "review_title": "\"Fifty Shades of Black\" is a decent parody, but the truly funny moments are few and far between,",
        "review_detailed_main": "The Wayans Family has created quite an entertainment dynasty over the past three decades or so. Long before anyone had heard of Tyler Perry, the Wayans Brothers, as most people refer to them, started creating big and small screen entertainment that catered to the African-American audience. The Wayans brought us the sketch comedy show \"In Living Color\" (1990-1994) which, in turn, helped launch the careers of Jim Carrey, Jamie Foxx and David Alan Grier, among others, as well as films like \"I'm Gonna Git You Sucka\" (1988), \"Major Payne\" (1995) and the \"Scary Movie\" horror film parodies (2000-2013).\n\nThe Wayans are mostly known for their parodies. 2016 adds another one to the list with Marlon, the youngest of the original \"Wayans Brothers\", co-writing and starring in \"Fifty Shades of Black\" (R, 1:31). Most will immediately recognize that this film is a take-off on 2015's very successful film adaptation of the book \"Fifty Shades of Grey\". Like most of the Wayans' films, pop culture and movie references abound, but \"Fifty Shades of Black\" duplicates much of the plot of the film that inspired its comedy. You'll see what I mean in the following plot summary (which, by the way, is necessarily risqué).\n\nHannah Steele (Kali Hawk) is an attractive and intelligent college senior in Washington State who fills in for her sick roommate, Kateesha (Jenny Zigrino) in interviewing billionaire business magnate Christian Black (Marlon Wayans) for the college newspaper. Hannah gets flustered in the presence of this sophisticated, supremely-confident and mysterious man. Christian is quite taken with Hannah – and take her is what he soon decides he wants to do. He shows up at the hardware store where she works, takes her out to coffee and even comes to \"rescue\" her when she drunk dials him from a bar. Despite how obvious it is to the main characters and to the audience that these two are very, very different – and despite the title character's own conflicted resistance – these two cannot resist each other. But Christian very clearly states, \"I don't do romance.\" That doesn't stop Hannah from being drawn to this man.\n\nAs Hannah discovers more about the cipher that is Christian, she learns that he is wounded – both emotionally and physically – by his childhood. She seems to want to comfort this man who acts as if he needs no comforting and begins to love this man who tells her that he is only interested in her for sex. Being the woman in Christian Black's life means submitting completely – sexually and otherwise – to his whims. As he eases her towards an understanding and acceptance of his lifestyle, she has to sign a non-disclosure agreement, he convinces her to have sex (actually \"f--- hard\", as he describes it) and then shows her his \"playroom.\" This usually locked room is painted dark red, has a bed and is filled with various restraining devices and implements of sadomasochistic sex play. Hannah is shocked, but not necessarily repulsed. Christian presents his contract which describes Hannah's role as his submissive.\n\nI just did something I've never done before (or even been remotely able to do) in a movie review. The previous two paragraphs are actually cut and pasted from my 2015 review of \"Fifty Shades of Grey\"! Using the \"find/replace\" function in Microsoft Word, I changed the names of the characters and the actors playing them to match those in \"Fifty Shades of Black\" and I shortened the summary, but I did not add or change anything else. (You can scroll down our timeline to my \"Grey\" review to see for yourself.) But rest assured there's plenty in \"Black\" besides just recreating and making fun of scenes from \"Grey\". \"Fifty Shades of Black\" also seamlessly incorporates Wayans-esque versions of scenes from such movies as \"Whiplash\" and \"Magic Mike\". There are also references to a plethora of other popular movies, TV shows and books, plus a generous helping of pop culture satire and some politics. This is the kind of film which is so fresh, it feels like it was written a month before its release, but that means that its humor (and perhaps its appeal) will quickly become dated. Of course, there's also plenty of racial humor, much of it stemming from white actors Jane Seymour and Fred Willard playing the title character's parents.\n\nLike much of the Wayans' work, \"Fifty Shades of Black\" is very funny in spots, but those spots are small and spread out. The few clever/amusing jokes and sight gags and even fewer laugh-out-loud moments seem adrift in a sea of gross-out humor and over-the-top acting which is often not that funny. Still, most Wayans fans will probably enjoy the film and those who've only seen a little of their work may find this one good enough for a mild recommendation. \"B-\""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "So awful it makes you love \"Fifty Shades of Gray\" in comparison!",
        "review_detailed_main": "\"Fifty Shades of Black\" is yet another film in the idiotic teenager parody genre. This overused genre consists of many movies currently on IMDB's Bottom 100 list....with the likes of \"Disaster Movie\" (#1), \"Epic Movie\" (#12), \"Date Movie\" (#24), \"Scary Movie V\" (#50), \"The Starving Games\" (#44) and \"Extreme Movie\" (#99). \"Fifty Shades of Black\", incidentally, is #65 on this infamous list of badness. Unlike other films in this god-awful genre, this film is a parody of another film on the infamous Bottom 100 list, the original \"Fifty Shades of Gray\" (#92).\n\nThis film is a bit different from the other crappy parodies I mentioned above. It is more a silly version of the original film and is NOT a parody of a dozen or more other films (which the above garbage films all are). Also, not surprisingly, it's MUCH more sexually-oriented...as \"Fifty Shades of Gray\" was a highly sexualized story. But this is much more crude than I even expected...and crude and unfunny scenes were piled on atop the other! It also has a lot of content that might make the more left-leaning audience members cringe or become furious. The leading man in this film is rich and successful like the one in the original story...BUT because he's black (Marlon Wayans), he says he made his fortune selling crack and sucking....well...IMDB won't let me say more about that. This is NOT the most positive and uplifting sort of black man, that's for sure!\n\nAs far as the story goes, it's terrible....so terrible I found I much preferred the original film...which I still strongly dislike. Yes, they managed to make a worse version of an already terrible movie! Offensive, brain-numbingly stupid, crude beyond belief, and, sadly, a film marketed mostly towards younger folks (whose growing brains really don't need this!). Currently, this film is #65 on the Bottom 100....I think that is way, way too generous...especially after seeing the Florence Henderson (I am NOT kidding) sex scene!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "apstylianou",
        "review_rating": "1",
        "review_title": "Flat jokes, and just a bad parody to an already bad movie",
        "review_detailed_main": "Fifty Shades of Black serves as the second Fifty Shades movie and the reality that these movies are still being made, even though the cast and crew knows that it sucks, but they don't care because they are just now have enough money to spend the year in Las Vegas. It's already starting to cause me even more pain.\n\nThis movie serves as a parody to Fifty Shades of Grey, but the bad thing about it is that it is not even funny or different from the same old toilet humour that is used so often in comedy movies nowadays. There was not one moment where I chuckled or even sniggered. I think I did laugh, but that might have been at the movie not with the awful cliché jokes that I've already heard in these comedy movies.\n\nAnd it's such a shame to see a talented actor like Marlon Wayans, who before offered a fantastic turn with Requiem for a Dream and then made us chuckle with the first two Scary Movie films, and then to see that talent wasted in this abomination of a parody movie. I hate it when actors just become overpaid tools in movies that they know are bad but they are just in it for the money, when they know that they are better than that.\n\nThe thing is that Fifty Shades of Grey was anything but a good movie to start off with, so parodying a movie that is already bad doesn't make it any better or more enjoyable. I mean, this movie could've been funny in some places, but the dick and ball jokes that this movie overuses so many times just failed to hit.\n\nNot to mention it's out of place references to other movies, not just Fifty Shades of Grey, but you can tell from the poster that it's making those references just to try to be funnier, and to their credit, no, they failed.\n\nIf you watch one movie early this year, Fifty Shades of Black is definitely not worth recommending when you really should just buy another ticket for Deadpool.\n\nOverall rating 1/10."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "JustALittleBitRandom",
        "review_rating": "3",
        "review_title": "A Dirty Minded 8 Year Old Could Write A Funnier More Entertaining Script",
        "review_detailed_main": "Fifty Shades Of Black Spoof of Fifty Shades Of Grey, College graduate Hannah Steele enters a complicated relationship with wealthy businessman Christian Black.\n\nDeep,deep joy. Another painfully unfunny spoof that takes nearly all it's material from previously made content. That is the basic definition of Fifty Shades of Black. There was only one point during this film that I wanted to laugh but because of how bad the rest of the film was I couldn't. There are two main problems with this film. 1. The script is really, really awful and is not funny in any way and 2. Nobody in this film can act! Those are two vital things to make a comedy funny the acting and the script and if both of these fail then the film is just terrible, which is what this pile of trash is. All jokes are about Fifty Shades Of Grey and it's content and might as well be an adaptation of a joke book of painfully unfunny sex jokes. There are so many moments intended to make people laugh but just end up being horribly cringe worthy moments because of either what can be seen or just what is being said. There were points where people moaned in disgust at the goings on on screen and the majority of the film was spent in silence. In total two different people ,out of 13, laughed at two different points, 3 people walked out during the film because of how bad it was.Nearly all of the characters in the film are annoying and this is made even worse by the terrible acting. During the film Marlon Wayans character describes something as \"painfully uninteresting\" and something else as being written by someone in year 3. Fifty Shades of Black is painfully unfunny and boring and could have been written by a dirty minded 8 year old. But then again the 8 year old would have probably wrote something much more entertaining and funnier.\n\nIt isn't as bad as other parody films but Fifty Shades Of Black is still a seriously unfunny film and is definitely one of the worst films of 2016. ** <-- Two Stars"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Really funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "KittyKelly1976",
        "review_rating": "1",
        "review_title": "Possibly the worst film I have seen in 20 years",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "btreakle",
        "review_rating": "4",
        "review_title": "50 shades of crap",
        "review_detailed_main": "Definitely a stinker. Not really that funny. I cant reccomend this one."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "videorama-759-859391",
        "review_rating": "8",
        "review_title": "The Fifty Shades you should see",
        "review_detailed_main": "People who hate Fifty Shades Of Grey (I bet there's a lot of you'se out there} will be appeased. Here, you pi..ed off many, will be compensated for your suffering. This comedy spoof, ala, Wayans, almost outdoes itself, near up there on the comedy scale with films like Bruno. They'll be chuckles aloud, in continuity. And we know if the Wayans are involved, we're not gonna be disappointed, smart brothers who know comedy but smart comedy with some gags you never see coming. They have an original style of comedy that's always a winning formula. What this film does, is that is it surprisingly sticks to the story and scene structure as the other one, almost to the letter, with some cute changes, one I particularly liked. Here, this one really takes the p..s out of the 2015 bore snore. Exciting lead, Wayans, replaces our dull Dorman, really throwing spark into the role, in top gear as Christian Black, while this time, our English lit student/journo replacement/part time hardware shop worker, and ordinary, known as Hanna, not Anastasia Steele, is wonderfully played by Hawk. From comical whippings to dejected, non helicopter/jet rides, this Fifty Shades has it all. We have some really crude moments involving male anatomy, someone who's really well endowed, shall we say. Hanna Steele's more likable flatmate here, is a chubby Rebel Wilson type who craves sex and food, and food, and food. Again we have many movie references (something I'm not really impressed by) a bit too many here, with a little bit of Zero Dark Thirty and I Spit On Your Grave 3, thrown in as well, as well as the dropping of a famous Porky's (easy lay) character. A couple of surprising co stars show up in this, like a still radiant and refined, Jane Seymour, and shocking as it is surprising, a cameo by a much recently missed Brady. This one has better everything, better script, better acting, entertainment value and appeal, for a number of reasons, most of them, laughably related. Fifty Shade's haters will love this Fifty Shades, trust me. You want something done right, different and smart, get a Wayans to do it. Good show and well made pic too."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "narciscosminblue",
        "review_rating": "7",
        "review_title": "Not for everyone, but I enjoyed it",
        "review_detailed_main": "This was my first movie at a new cinema in my town, and it was...nice. I really don't like Fifty Shades of Grey (the original one), but I enjoyed this parody, and man, it has some damn hot scenes, not a movie to see with your family because it's almost porn sometimes, in my opinion. The actors doesn't perform too well, it's that kind of comedy filled with stupidity sometimes, especially from Marlon Wayans who likes to behave like a child in some of his movies, but I think the man it's hilarious the e way he is. Well, I don't have something else to say about this movie, I've seen it almost half a year on 30 January when it first launched in Romania. As you can see, I'm a Romanian guy, and it's my first time when I review a title on IMDb, also I hope this review it's spoiler free, it's my first review, so be kind with me."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Could have been better/funnier",
        "review_detailed_main": "As being a parody of Fifty Shades of Grey (although haven't seen the original), expectations of this film weren't too high as was expecting a silky over the top comedy with a few casual clever gags.\n\nWell this film is as expected but still not very good. The plot is essentially the same as the original, just as a Marlon Wayan's version. There are a few laughs and don't decent gags but overall expected a little better. There were more misfires than hits, and a lot of jokes felt far too forced.\n\nAfter all, Marian Wayan's comedies are for a selective audience and if you are familiar with his work or have enjoyed some if his previous material, you may enjoy this. Although Fifty Shades of Black isn't better than a Haunted House."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "rajesh_pataka_puri",
        "review_rating": "1",
        "review_title": "0/10",
        "review_detailed_main": "0/10. This is not a movie I refuse to give it that respect as it is undeserving of it. It is meant to be a comedy and it would've succeeded at that if the point of comedy was to make you cringe and cry and s word your pants. None of the jokes land and they all depend on the concept of saying something loud means its funny. The entire movie has no plot and there is no character development and nothing goes anywhere. All of the scenes could have been rearranged in any order and it wouldn't have made any difference. I feel like the entire budget went into CGI nutsacks because there are way too many of them. This is by far the worst piece of media I have every consumed (besides 3 Idiotas). This movie has completely blown my expectations for any movie way out of proportion I genuinely wanted to kill myself and I started crying at several points in the movie I'm so glad its over please help me I am in a state of emotional turmoil.\n\nRajesh does not recommend.\n\n0/10 -Rajesh P."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "tkdlifemagazine",
        "review_rating": "3",
        "review_title": "Cute is the Best I Can Do",
        "review_detailed_main": "Marlon Wayan's is likable and funny. Even he can not save this silly and crude satire. The story is a loosely based, satirical look at the sexual novel and film, Fifty Shades of Grey. Like all satires it takes things that are memorable from the mainstream film and makes them ridiculous. This film does that. Perhaps it was more relevant, and funnier in 2016 when it originally was released die to the close proximity to the original source material. Also, perhaps it would be better if I actually enjoyed the source material, which I did not. Don;t get me wrong, I couldn't help but laugh at some parts-just not enough."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "candiceballack",
        "review_rating": "1",
        "review_title": "If you like perverted movies that are trying too hard to be funny then by all means go and watch this.",
        "review_detailed_main": "Saw this advertising on cable and decided to go on a date with the hussy to watch this... The advertisement made it seem so funny and knowing that Marlon was acting in it, My husband was just as excited as I was to go and watch it. I do not know what this world is coming to, because nowadays what is considered fun is pervertedness, sexual jesters, cursing blatantly for no reason, and pornographic behavior and language.\n\nI do not know how they could have fun producing movies like this...Fifty Shades of Grey was enough!!!! Why stretch a shitty movie by making a parody!\n\nMy husband and I could not stay to watch out the whole movie. It was embarrassing to be sitting and listening to this perverted crap. If you have any moral values then please do not go and watch this! It is no good and I did not find anything comical about it for it to be even filed under the genre: comedy.\n\nDISGUSTING MOVIE.... We love a good laugh and a good comedy but this ain't no comedy! They are trying too hard to be funny and it is stale, and just downright perverted."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "kosmasp",
        "review_rating": "2",
        "review_title": "Is it black or grey?",
        "review_detailed_main": "The first \"meeting\" of the main female character and Mr. Black is maybe the high point of the whole affair (excuse the pun). It kind of depicts how ridiculous the other movie is. But then again, we already knew that didn't we? There are a couple of scenes that hold their own just because they have such a simple and easy task, when you go back to the source material.\n\nThere is one scene though that tries to make fun of Whiplash, in a sexual context. While the overall idea isn't that bad, the execution is very weak. I guess we have to an understanding at this point, that Mr. Wayans will do anything silly, and he has an audience for that, that he keeps happy I reckon. So this niche gets served too. There is some nudity if you wonder, but all in all it's just juvenile"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "shortc-85671",
        "review_rating": "2",
        "review_title": "This movie made me asexual",
        "review_detailed_main": "I get that this is a spoof movie but I cringed during every scene. There were some funny bits and the fact that the movie was self-aware made me chuckle.\n\nBut other than that this was just stale bread and tasteless. If this is what the actual movie is like, than I'm grateful I watched this instead"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Brevin_Campbell",
        "review_rating": "2",
        "review_title": "I find this film to be garbage",
        "review_detailed_main": "This was a big waste of a film. Everything about this movie was a re cut of \"Fifty Shades of Grey\" making fun of it scene by scene , and while that worked for one or two scenes of the film a lot of the rest of this was filled with sex jokes, poop, and other stupid things. I didn't find the film funny on any level. Many of the scenes I felt disgusted by more than anything else. This film is full of stereotypes for African Americans. Trying to be funny but failing on all accounts. I began to wonder why this film was so stupid, and dull for me and then I saw the director. Micheal Tiddes, who also worked on \"A Haunted House.\" How is this guy such a success. His comedy is so out there and dull, and his parody style is so grotesque that I find it kind of insane that he is still around and making so much money off of people. This is a poor film and doesn't deserve the light of day. Sorry Fifty Shades of Black but you have failed the movie business."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "khundadzenugzar",
        "review_rating": "9",
        "review_title": "Nice comedy you should see it",
        "review_detailed_main": "Very Good Comedy.\n\nI rate this movie based on fact that it was meant to entertain and hype me- It did its job well.\n\nAnd when I mean hype I mean I had very low expectations, and it really met them. This film is pure gold, it has all these black people culture jokes, penis jokes, toiler jokes, sex jokes, all the love you need.\n\nThe whole movie makes you wonder, what else unexpected turn of events will happen, what does the director of this masterpiece throw at us in the next scene, you are basically tense throughout whole movie.\n\nSo if you want to have FUN by making fun of quality black humor this film is the best for it.\n\nI rate it 9 out of 10."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "billsoccer",
        "review_rating": "6",
        "review_title": "A Wayans movie will be raunchy and occasionally funny",
        "review_detailed_main": "If you're not a Wayans film, don't watch this. If you are, you'll enjoy it. It's not their best, but is better than much of their most recent stuff. I found myself laughing out loud several times - though the 2nd half wasn't as good. I'm surprised at some of the reviews - appearing shocked at the content! Why would you watch a parody of a sado-masochistic movie if you're not expecting potty humor??"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "abrahamnadam",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "I tried twice to watch it all but I couldn't, it's a big challenge to everyone. English is my second language so it's hard for me to describe it.\n\nLong story short, the movie is soo disgusting."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "zhqqhkm",
        "review_rating": "2",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "Why make a parody of a trash movie, of course this was trash don't watch it."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "victoriaamylloyd",
        "review_rating": "",
        "review_title": "More accurate then the real thing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "djheartless",
        "review_rating": "1",
        "review_title": "Do not agree with the movie at all",
        "review_detailed_main": "Found the movie vary offensive and if this was a movie made with white people saying the stuff they said about whites this would be considered a racist movie and I am not happy with how racist this film was towards white people I am no racist at any means I just do not see how this is not a racial movie towards whites I had spoken with the cinema about getting my money back and was unable to I am not happy that I spent my money on this film it was a waste of my money and time I have seen and loved movies from the same writer and this one was not right in any way I left the movie because of the way it was written yes there was some funny scenes but the comments about white people was unacceptable"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "quincytheodore",
        "review_rating": "2",
        "review_title": "Hurt me in all the wrong ways.",
        "review_detailed_main": "Marlon Wayans has crushed what's left of Scary Movie spark until it's near unrecognizable and that's before A Haunted House. At this point nothing remotely funny is assembled, in fact most of the jokes are excruciating, not in the good ways. It spams so much ghetto references, slapstick scenes that are numbing at best and repeatedly flashes repulsive materials.\n\nPlot is as thin as cheap toilet paper, mocking the original movie, which might not be great but far better than this abomination. It comes to the point that making the halfway mark feels like a torture, it just goes on with the same loud noises, putrid display of exaggeration and poorly used rough language.\n\nIf flogging is an option other than this deformed movie, easily choose that as a less painful alternative."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "doofuspoofus",
        "review_rating": "1",
        "review_title": "Marlon desperately needs his brothers again",
        "review_detailed_main": "I think pretty much everyone knew this movie was going to be crap. Just when I didn't think Marlon could do a movie worse than A Haunted House 2 he does this. First off I've seen and read 50 Shades of Grey and even though the movie wasn't as good after seeing this I actually appreciate the movie 50 Shades of Grey even more.\n\nThis movie was actually pretty racist strangely enough and I'm not one to complain about racist jokes except when they're from 1992; black people liking fried chicken and hot sauce? Really? This movie tried way too hard and Marlon Wayans was a huge over-actor, even more than usual. Parodies were a lot better in the eighties and nineties when you had Spy Hard and Spaceballs. Granted the Wayans had Don't be a Menace and Scary Movie but apparently it takes more than one Wayans to write a funny movie. He needs to stop flying solo. You had A haunted House now go back to your brothers! Frankly I'd rate this lower than a 1 if I could. The only thing I noticed is Marlon's definitely been working out and interestingly enough I think he would've been a cool addition to Magic Mike XXL. He would've added extra humor to the bunch. A role in that movie would've been a million times better than this 50 shades of crap."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Lindac7",
        "review_rating": "1",
        "review_title": "I thought this was supposed to be funny?",
        "review_detailed_main": "I was really looking forward to watching this since the trailer made it seem worth my while. Good comedy is hard to find. What a complete and utter waste of my time. I'm white, not racist, and found the movie to be appallingly racist, disgusting, offensive, sophomoric, and not funny in the least.\n\nI'm not one for walking out of movies, but if I were, this would surely qualify. I keep hanging in there hoping every movie will get better, but this never did. I've read all 4 of the Fifty Shades books and seen the original movie, so I'm completely familiar with the source material.\n\nI was embarrassed for and disgusted by Florence Henderson and Jane Seymour for even agreeing to be in this trash. To lower themselves to this level was utterly repulsive to me. I thought they both had more class than that. My opinion of each of them has now seriously suffered.\n\nThe only other movie I've ever considered walking out of for all the same reasons was Borat, which was equally as bad.\n\nThere was only one moment in this entire movie that was actually funny, and that was seeing Christian grey, black, red, white, blue, etc. listed in Hannah's cell phone. The rest of the 'humor' was clearly aimed at the highly narrow demographic of 13-year-old boys. What a colossal disappointment."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "KATO-SUBZERO",
        "review_rating": "3",
        "review_title": "To Much Hard core Profanity. Not worth Matinée Ticket Price",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "zain-97840",
        "review_rating": "4",
        "review_title": "It's more sexual than it's funny.",
        "review_detailed_main": "I just don't find this deserve your time. Yes there is a big laughs but not a lot, just few. Then the plot repeats its self again and again in the movie."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "alexglimbergwindh",
        "review_rating": "8",
        "review_title": "Better than 50 shades of Grey",
        "review_detailed_main": "This movie knows what it is. A parody. And a damn good one at that.\n\nBetter acting. Better self awareness and better cinematography.\n\nTake it for what it is."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "shadow_blade-89459",
        "review_rating": "6",
        "review_title": "Funny but, not Hilarious",
        "review_detailed_main": "\"Fifty Shades of Black\" (2016) is an entertaining film. The story is a direct parody of \"Fifty Shades of Grey\" where college student, Hannah Steele played by Kali Hawk, falls for unorthodox billionaire, Christian Black played by Marlon Wayans, but his sexual practices put a strain on what could become a beautiful relationship. The story is there for what could have been a heavy dose of comedy, but it doesn't seem to mesh well as the film could have.\n\nThe director, Michael Tiddes known for over the top comedies like \"A Haunted House\" (2013), stayed true the style of comedy. Ever comedic take had funny laced in the dialogue or visuals and then amplified to drive it home. Occasionally it was a bit much. The music that filled most of the film was very intertwining and relatively spot on but, there were a few lapses in the sound department. Some of the voice-overs missed the mark and took away from the film. Overall, it was just OK but, still an enjoyably film."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "llsmith-87182",
        "review_rating": "3",
        "review_title": "Mildly Amusing But Still Pretty Bad",
        "review_detailed_main": "A spoof of 50 Shades of Grey that is overdone and heavy handed. Much of it makes very little sense. Even cameos with Jane Seymour and Florence Henderson can't save it. Best to invest your time somewhere else."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "avalonjoyous",
        "review_rating": "1",
        "review_title": "50 shades of garbage.",
        "review_detailed_main": "Marlon has turned into quite the hunk so it was nice seeing him in certain scenes so for me that was a plus.\n\nHowever that one and only positive for me personally out of the way this movie was truly a disaster movie.\n\nThe humor was disgusting and I'm nowhere close to being a prude one potentially hot scene regarding Marlons stripping spoofing magic Mike was ruined by throwing in an incredibly disgusting part involving Marlons underwear.\n\nThe humor was miss every single time and the supporting characters were incredibly obnoxious especially the lead characters best friend a white girl trying to be black she was like nails on a chalkboard .\n\nNothing about this movie was redeemable even though Marlon Wayans is indeed a stud in this film my personal opinion anyways."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "BoxFroggy",
        "review_rating": "2",
        "review_title": "its just, one of \"thooosssee\" movies, ya know?",
        "review_detailed_main": "Like disaster movie, date movie, scary movie blah blah its one of those c grade random comedies, which arent the best but ya know, theyre alright to just waste an hour to, not complete trash but kinda close? like it is what it is, its not trying to be an amazing film perse, it knows its a random film and therefore thats what it is and what it strives to be, gotta just accept it for what it is and realize its not gonna be an astonishing masterpiece"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "kgborrell-34146",
        "review_rating": "1",
        "review_title": "Puke",
        "review_detailed_main": "Well of course Hollywood has to make a BLACK version of fifty shades. God forbid we have to force a movie for \"racial equality.\" Here's an idea, quit perpetuating racism by forcing these movies!!!!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "rabieerazor",
        "review_rating": "2",
        "review_title": "COMEDY ISN'T THAT HARD",
        "review_detailed_main": "Who wrote this garbage!! If i gathered some friends and shot a movie it would've been funnier, there is absolutely nothing funny about it, not even one single scene \"except for king Bach's\", the only good thing about this movie is King Bach actually"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "sweetjane32",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "I realize they wanted to spoof of the fifty shades movies but this movie is bad omg they shouldn't have made this movie. Some parts are trying to be funny and they aren't, some jokes are trying to be funny and they aren't, and some acting aren't that great either."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "gordonb-59587",
        "review_rating": "1",
        "review_title": "Embarrassing Production",
        "review_detailed_main": "Hard to believe Florence Henderson's and Jane Seymour would agree to be a part of this movie. It always bothers me when actors and actresses who, after having long and successful careers, lower themselves and take parts in awful films like this. The first thing I think is how disparate they must me to work again. Same thing goes for well-established actors who appear in commercials. If they totally blew all the money they earned during their careers, ok they need a job. But most haven't and are simply earning a nice fat paycheck from a sponsor. Florence Henderson died shortly after this movie came out and was the last film in which she appeared. Sad her last appearance was on such a low note. And I would think Jane Seymour would just be embarrassed."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "henrycoles9",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "This was the most unoriginal and unsavory parody movie I've ever seen. When I added it to my watch list after I watched \"Fifty Shades of Grey\" (which is my most favorite movie of all time) and it showed up in the suggestions, I was under the impression that the title was the only rip-off, so I was taken aback by the unpacking of \"Fifty Shades of Grey\" scene by scene ad nauseam."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "rasmusthompson",
        "review_rating": "10",
        "review_title": "The Masterpiece We've Been Waiting For",
        "review_detailed_main": "Fifty Shades of Black is a refreshing art-house indie film as it aims to jab with it's power and ferocity instead of cuddling itself up with convolution. It's emotionally mature, capturing race and culture so insight fully and sensitively and it script really cleverly dissects racial stereotypes and turns it on it's head. Never since Birdman have I seen such a power-house of a film hilariously and truthfully mirroring Hollywood and the state it is in. By parodying Fifty Shades of Grey, one of the few masterpieces of 2015, not a year before it was made turns Hollywood's state of remakes on it's head. Marlon Wayans is fantastic, bringing his charisma, energy, and displaying the raw and powerful emotion we thought he had lost after Scary Movie 2. And how this film turned out to be the masterpiece of cinema it is is just an accomplishment. An insightful, hilarious and culturally sensitive film this is a special landmark and kicks off 2016 with art-house genius and style."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Zerbey",
        "review_rating": "6",
        "review_title": "Surprisingly not bad",
        "review_detailed_main": "I had low expectations going in, there was a time when a movie with a Wayan family name attached to it was guaranteed to be funny (Major Payne and Scary Movie come to mind) but in recent years their quality has dropped to an all time low.\n\nIf any movie deserves a parody, however, it is Fifty Shades of Grey. Although to be fair the movie was hilariously awful enough on its own. What you get is a typically low brow movie which basically rehashes the original but exaggerates it even more.\n\nIt's not going to win any Oscars, and not all of the jokes hit. If you've suffered through Fifty Shades of Grey (and I'm sorry if you have) you'll appreciate the ones that do. They skewer the original very well.\n\nA good movie to watch if you're bored and want something totally mindless, just keep your expectations low."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "MihaiSorinToma",
        "review_rating": "3",
        "review_title": "A very bad \"comedy\"",
        "review_detailed_main": "An apparently filthy rich guy meets a poor but attractive young girl, eager for a new and more interesting life. This new person that enters her life is about to show her a part of fetishism and fantasy that she never thought about before.\n\nIt's an ordinary comedy inspired directly from \"50 Shades of Grey\" and seems to take the parody part to the extreme. It simply makes fun of everything portrayed in the original movie, without any shame (which could be a good thing), but unfortunately without any sense of fun. It tries desperately to make you laugh but as it happens with every single movie that does this, it fails miserably. You struggle to find a couple of funny scenes, laughter being something rare in this one although it's supposed to be a full-time comedy. The plot is not something to take into account as well as all the characters from this so called movie.\n\nIt's not a disappointment because didn't have high expectations regarding it but it is without any doubt a very bad movie from every point of view, something from which you should run, far, far away."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "joaosamarques",
        "review_rating": "2",
        "review_title": "awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "miguelneto-74936",
        "review_rating": "1",
        "review_title": "one comedy and bland",
        "review_detailed_main": "Fifty Shades of Black is another strong contender for the Golden Raspberry, I was even willing to watch this movie because of Marlon Wayans , I particularly liked A Haunted House 1 and 2 , and I thought this movie would be better the Fifty Shades of Grey, I was mistaken , Fifty Shades of Black can be worse , the cast is quite interesting , plus the acting is bad , or the Wayans is good, the script is very poorly written , full of errors is ridiculous dialogues , the film has to a almost funny references, such as the whip scene , I do not laughed seeing this film , the maximum was almost , the direction is weak , the soundtrack is average , Fifty Shades of Black is a bad movie , with funny moments especially zero . Note 1.3"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Prismark10",
        "review_rating": "2",
        "review_title": "Black is back",
        "review_detailed_main": "The Wayans family have made a dubious reputation for making parody films and Marlon Wayans stars and co-writes this parody of Fifty Shades of Grey.\n\nHannah Steele (Kali Hawk) interviews successful business entrepreneur Christian Black (Wayans) and becomes enchanted with this womaniser, she finds herself in Christian's flashy apartment where he gives her a contract where she agrees to take part in S&M in his Red Room which is decked out with various sexual toys and implements. However it turns out that Christian Black is no good at sex, lasting mere seconds before climaxing and his manhood is very small.\n\nThe best part of this movie is when it rips off Whiplash which was good. As for the rest, the book Fifty shades of Grey is a parody in itself and this effort is too thin, too obvious and unfunny."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "priyotosh1234",
        "review_rating": "1",
        "review_title": "Fifty Shades Of Pure Bullshit......",
        "review_detailed_main": "I was expecting a funny parody of Fifty Shades of Grey , instead I got this one and a half hour of bullshit.Watching a snail cross the room is more entertaining than this \"movie\".I loved the Haunted House movie so I was expecting a fun flick instead I got this f**k s**t.I love Marlon Wayans and his movies,he is a funny actor this crap was not expected from him. I was expecting a funny parody of Fifty Shades of Grey , instead I got this one and a half hour of bullshit.Watching a snail cross the room is more entertaining than this \"movie\".I loved the Haunted House movie so I was expecting a fun flick instead I got this f**k s**t.I love Marlon Wayans and his movies,he is a funny actor this crap was not expected from him."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "thisseatofmars",
        "review_rating": "1",
        "review_title": "A painful, embarrassing movie. Spiritual successor to the original Scary Movie this isn't.",
        "review_detailed_main": "50 Shades of Black is a spoof movie where Christian Grey and Anna Steel(e) are played by black actors rather than whites. The opening scenes feature Christian stealing a woman's purse, then an expensive suit, then a car. So... the joke is that... black people are thieves?\n\nHa... ha?\n\nMarlon Wayans was one of the minds behind the very funny Scary Movie (the first one, not the awful sequels) so I hoped that Wayans had recaptured the same comedic energy and brilliance for 50 Shades of Black.\n\nBut no.\n\nNo, no, no.\n\nThis is a bad, bad movie. In fact, it's so bad, it's embarrassing. I never feel bad for actors in Hollywood productions; their salaries are more than what most people make in a year (Wayans makes 7.2 million a year, wow) but this 50 Shades spoof is so filled with cringe moments that you can't help but squirm in your seat and look away from the screen. If you're the kind of person that enjoys pulling the legs from spiders or capturing and then torturing neighbourhood pets, maybe you'll invite a few friends over and play this for them.\n\nOther than that, I'd say avoid.\n\nWayans, why not open a charity or an orphanage with that money, man?\n\nYou need to start atoning.\n\nYou certainly won't do it with film."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "albereinstein",
        "review_rating": "1",
        "review_title": "Marlon, call your Brother Keeenan. You need help...badly!",
        "review_detailed_main": "I downloaded this movie, played it for ten minutes, stopped it, and quickly deleted it from my computer. I really don't know what the hell Marlon is thinking lately, but someone needs to enlighten him on the fact he writes nothing like his brother Keenan. And what I mean is that his stuff is no where as funny, and clever and overall clean. After Scary Movie 1, and maybe White Chicks, Marlon seems like he's on a mission to sabotage his career, with these back to back disasters films that he's writing and starring in. Enough already with the satire, dude you need to tone it down and do some real acting, and for God sake, write a story that is actually funny without all the buffoonery. If I had brought a ticket for this crap, I would've got up after a few minutes and asked for my money back. This was just plain stupid. Marlon I've seen you in a Requiem For A Dream, you got skills, but its time for you to put on your thinking cap, and do some real funny stuff. If you need help call your brother Keenan. I'm so glad I didn't have to a buy a ticket for this crap."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "travisfor45",
        "review_rating": "1",
        "review_title": "I hated this movie.",
        "review_detailed_main": "This movie was just terrible. It wasn't funny. We went to the theater and our friend couldn't get in and she got sad. I say thank God she couldn't get it. This movie was bland. Not funny. Just full of sex and torture. I laughed a couple of times when they mentioned the actual Fifty Shades Of Grey movie. He read her the book for torture and Christian Grey was in her phone contacts. Oh, and King Bach. He was hilarious in this movie. The smallest part, but the best part. That's all. I went into the movie theater thinking... \"Oh. Marlon Wayans. This should be funny. I mean he did Scary Movie and A Haunted House.\" He went the totally wrong direction. The Magic Mike part wasn't even funny. It showed feces on his shirt after he rubbed it in his butt. That's not comedy. That's gross. I'm just saying as an avid movie goer, if you hate bland movies that have terrible story lines save your money. Please. Do not contribute to the box office because, in all honesty, I thought Marlon was better than this garbage."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "eternaltranzitions",
        "review_rating": "10",
        "review_title": "Please do not believe the negative reviews",
        "review_detailed_main": "I cannot believe they rated this movie 7% on Rotten Tomatoes and 3.4 on here. This was one of the funniest comedies I have seen in about a year or so. All the characters are hilarious and the script was really funny and well written. Please do not believe the negative reviews on this site or others. I usually never write reviews but after watching the movie and laughing hysterically, I was compelled to write one. There was a joke almost every 2 minutes or so which kept me engaged and I even missed out on a few jokes because I was laughing too hard. I did not even watch 50 Shades of Gray and this was still really funny. If you like movies such as Scary Movie, White Chicks and Dance Flick you will surely love this. Give it a try, you will not be disappointed."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "storm_mica",
        "review_rating": "6",
        "review_title": "Better than the original.. probably not saying much..",
        "review_detailed_main": "50 shades of black lampoons the much over-rated 50 shades of gray movie and book quite successfully. I must point out that I was no fan of the original; I found it quite drab, unexciting and appalling in its messaging so I was interested to see someone had done a send-up.\n\nThe movie's very undergraduate and crude humour is bound to offend some people, and it could have worked better in a comedy sketch format TV show, but seriously, the original was so bad this has to be fair game.\n\nI was surprised this made it to cinemas; I suspect it went straight to DVD in this country and that's not so surprising really.\n\nI did give this an extra star for Florence Henderson's scene; there's something especially naughty seeing Mrs Brady in THAT sort of scene..."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "bardacatalin",
        "review_rating": "1",
        "review_title": "Worst comedy ever I seen!",
        "review_detailed_main": "I regret that Cinema City and others can promote and sale such a worst ever parody, same like the genuine movie. Good script. Keep it for yourself! Send a lot of money to make feel people stupid. Now I realize how can see us the people who made, own and promote movies like this. Not all the people are stupid. One movie deadly. Worst ever comedy. Very intelligent writers: Marlon Wayans, Rick Alvarez. Good work! Marlon Wayans false. Kali Hawk never play again, please.This is simply an sexology no action comedy film.I loved the black men, but they are playing so worst.I Have to admit I was suckered in by the trailer, it was exciting comedy packed. I thought they were doing a 1 shade style movie at least, but I was wrong. This was like a long not-ending cheap American comedy show like."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "movietalkwithmuhammed",
        "review_rating": "5",
        "review_title": "The all telling trailer",
        "review_detailed_main": "This movie was funny throughout the story, but it was not anything that will make one fall out of the seat from laughing so hard. Many of the funnier scenes were what is shown in the previews.\n\nThey could have done better with the comedy in this movie. Marlon Wayans is much funnier than his performance in this movie as the character Christian Black. Black was funny in scenes where he was or had already committed some sort of crime.\n\nMore risk should have been taken with the material that was put into this movie's story. It would have paid off much more than playing it safe."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "miroslavmisicvr",
        "review_rating": "2",
        "review_title": "50 Shades of Bad",
        "review_detailed_main": "This movie is so bad that my TV had to throw up. Please don't waste your time on this. When I thought this movie through I realised that is not too hard to write much better screenplay for this movie because the shooting script was awful."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Thanos_Alfie",
        "review_rating": "3",
        "review_title": "Poor...",
        "review_detailed_main": "\"Fifty Shades of Black\" is a Parody - Comedy movie of the 2015 movie \"Fifty Shades of Grey\", in which we follow the same premise as \"Fifty Shades of Grey\", reimagines Christian Grey's character through the lens of comedy, but instead of clever wit, the film relies on exaggerated stereotypes and crude humor.\n\nI have to admit that I laughed a lot with this movie since I had already watched \"Fifty Shades of Grey\" and I could make the connection. Unfortunately, the movie didn't deliver the kind of sharp humor or biting satire that could have made it memorable. In addition, the over-the-top romance, absurd and cringe moments didn't help the movie. The interpretation of Marlon Wayans who played as Christian Black was good since he brought his usual brand of slapstick comedy. While it may appeal to fans of Wayans' previous works, \"Fifty Shades of Black\" didn't offer something new. To sum up, I have to say that \"Fifty Shades of Black\" is a below the average movie and I am sure that even the fans of Wayans would be disappointed."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "view_and_review",
        "review_rating": "5",
        "review_title": "Fifty Shades of Bleh",
        "review_detailed_main": "Marlon Wayans has been on a parody trip his last three movies. Haunted House--which was decent, Haunted House 2--which was atrocious, and now Fifty Shades of Black--which was OK.\n\nIt may or may not have helped if I'd seen Fifty Shades of Grey. Since I didn't see it and have no intentions of seeing it I figured watching this would clue me in while giving me a laugh or two. I got a few chuckles though nothing gut-busting. Marlon is still raunchy and crass. Sometimes it works but most times it doesn't.\n\nBe prepared for PLENTY of sexual humor and a loose story that allows some shots to be fired at other movies and other celebrities. It's not cleverly done, but most Wayans movies aren't. You may laugh or you may cut it off after the first scene."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "j0hn22",
        "review_rating": "4",
        "review_title": "Racist film...",
        "review_detailed_main": "I have to admit that it was funny, but some scenes were so racist towards black people. In my opinion, it wasn't a nice parody. The characters were average, the plot was ok."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "Disneyland for grownups",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "ragpap93",
        "review_rating": "4",
        "review_title": "Got What I Expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "morfeus",
        "review_rating": "10",
        "review_title": "This movie is...marvelous.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "caroline_chupaa",
        "review_rating": "6",
        "review_title": "Well heck",
        "review_detailed_main": "Still better then the original. Watch this instead of 50 shades of grey."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "dukeakasmudge",
        "review_rating": "1",
        "review_title": "Fifty Shades Of Black",
        "review_detailed_main": "If I watch this movie a dozen more times I wonder if it will eventually get funny.I watched it once & once was 1 time too many.I struggled & strained to sit through the entire thing.I don't think I laughed once while watching it.I might have grinned, smiled, or smirked, but I never truly laughed.I know I spent the majority of the time cringing.I watch anything and everything the Wayans put out and usually find them funny.White Girls did suck but it didn't suck as bad as 50 Shades Of Black did.The funniest thing about 50 Shades Of Black was the trailer.It's what made me really want to see it.Maybe if I would've seen 50 Shades Of Grey or even read the book (I have NO interest in doing either) before watching this, I might have enjoyed this movie or liked it but even then I really don't think so.There were so many parts where they just tried way too hard to get a laugh (Like the belly button scene for example.See what I mean?) I'm a BIG fan of potty humor but here it was WAY too overdone & the only thing it made me do was feel awkward.The only way I can see anybody finding 50 Shades Of Black funny is if they're high on drugs or completely drunk.I would suggest you only recommend this movie to people you don't like"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "jbrakinen",
        "review_rating": "2",
        "review_title": "*Shrug*",
        "review_detailed_main": "Like there are bad comedy movies and there are BAD comedies and this is a BAD one! Sure it's funny sometimes but it's just a big no...."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "cassysak",
        "review_rating": "2",
        "review_title": "Thee Worst Movie Seen In My Life!",
        "review_detailed_main": "What I can say, awful awful, just awful! Only 2 single scenes in the monstrausity provided me with laughter out loud, all of the rest was complete and utter stupidity, made absolutely no sense.Very poorly written, directed, and filming , was just horrible too! Its a shame because I wanted to really like this, because Marlon Wayans, I consider to be a very talented comedian, and his former show on NBC , Marlon was excellent, he was great in that show & acted great in it as well. Thing is he did not write or produce that. MOVIE IS A COMPLETE DISSASTER! I really need the 2 hours of my life back, wasted on this gatbage! Did not pay for it thank Goodness, watched 4 free on a HBO Max trial."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "AngelHonesty",
        "review_rating": "4",
        "review_title": "Another Parody",
        "review_detailed_main": "Most parodies are not great quality, this one reminds me of Jason Friedberg and Aaron Seltzer style which isn't saying much, but its a little better then that. The film is filled with really dumb jokes that art funny, but there are some moments that made me laugh. I loved the ending as it was hilarious. Like most parodies it is what it is, over the top dumb."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "acasso-14737",
        "review_rating": "1",
        "review_title": "The most boring movie",
        "review_detailed_main": "This is garbage, I couldn't even finish watching the whole movie. The Wayans Brothers are a one trick ponies. On the other hand if you enjoy raunchy movies that include old has been actresses and washed up comedians this will be for you. Such a lack of talent in this movie. I would give 0 stars if given the opportunity. It's just an awful movie. The Wayans Brothers are just not funny. From the other movies they have been in to now. Nothing but trash. Do yourself a favor and look for actual humorous movies thier are plenty out there. This movie is just an attempt for washed up actors to be in the spotlight."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "MalikaMonroe",
        "review_rating": "1",
        "review_title": "Painful",
        "review_detailed_main": "And not in the good way.\n\nLiterally was hard to watch because of how hard they tried to be funny and failed miserably. Please stop making movies."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "eisraelnyc",
        "review_rating": "2",
        "review_title": "Damn, this movie sucks.",
        "review_detailed_main": "This is a long way from the originality of Scary Movie, and honestly, it really was horrible. I couldn't make it through the whole thing. If you really desire to waste 2 hours of your life, you'd be better watching paint dry than watching this movie."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "edgewaterluv",
        "review_rating": "1",
        "review_title": "50 Shades of Nothing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "thesar-2",
        "review_rating": "8",
        "review_title": "Too Soon?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "rednailpolish1",
        "review_rating": "7",
        "review_title": "It's a parody for god sakes!",
        "review_detailed_main": "judging by the low ratings and the few reviews I wasted my time on reading it seems clear that this movie is not everyone's cup of tea... FINE! That is totally okay! But please quit writing all of these negative and extremely discouraging reviews if you are not even into this sort of movies and humor!\n\nNote: you will only like this movie is you have watched the original!\n\nI watched this movie with my sister on an ordinary night when we had nothing better to do. None of us had seen it nor seen the trailer or read the reviews. I normally always look up every movie on IMDb before watching it, but in this case I am glad I didn't. I had heard from one of my friends that it was hilarious and also I had heard one of my other friends that it wasn't funny at all. So 50/50 chance, I thought.... Please understand that it's not uncommon for movies who aim to make people laugh to have low ratings. It is simply because not everybody is into that kind of humor. It's like when people who hate horror movies watch a horror movie and then make a review on it.\n\nMy sister and me happen not to like the original \"Fifty Shades of Grey\" and maybe that is one of the reasons why we found this movie so funny. It was very obvious to us that they were just making one big joke out of everything. Everything was very exaggerated which we thought was extremely funny. They have done a very good job in taking small details from the original movie and turning it into something funny and crazy - again please keep in mind that it's a parody and meant to be a little too much!\n\nThis humor was so stupid that we just had to laugh uncontrollably throughout the whole movie. But again, I am not very fond of the original and therefore I maybe sympathize more with its opponent. But really. It's so funny. Just make sure to watch it in good company and to have no expectations. Btw if you loved the original one you might get offended by this movie."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Seraphion",
        "review_rating": "3",
        "review_title": "Even more stupider than the original material",
        "review_detailed_main": "Bad story got even worse in this attempt of a movie, This movie's jokes are lame. The buildups are more than predictable. The movie didn't even bother trying to be funny without using swear words. Wow, I'm surprised that someone even backed this movie financially. The acting didn't help either that it looks so bad. And I'm even amazed at my self for wasting my time watching this movie, even though I rated the original material by 4 out of 10. This movie is indeed an abomination. I regret watching this movie. Such a waste of time and bandwidth. I'm even angry that I have to write more to fill IMDb's 10 line review rule for this stupid movie."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "balthesaur",
        "review_rating": "4",
        "review_title": "Misses the comedy mark.",
        "review_detailed_main": "'Fifty Shades of Black', a parody of the Fifty Shades of Grey (2015) franchise, features Marlon Wayans as Christian Black, a wealthy businessman, who interviews Hannah Steale (Kali Hawk) for a school news paper. With a few meetings and dates, Christian invites Hannah to his play room - a BDSM dungeon - to become his newest submissive.\n\nThis film is not on the same level as some of the other parodies Marlon Wayans has been a part of. Instead of punchy jokes, the film relies on vulgarities and wild exaggerations of black stereotypes. The script is absurd and the acting is only mediocre at best, despite the names in the film. Don't expect the same wacky antics as the Scary Movie (2000) franchise.\n\nMaybe skip this one."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "imdurmac",
        "review_rating": "2",
        "review_title": "Not the Best Parody",
        "review_detailed_main": "While the movie had some laughs, overall it wasn't the best parody made by the wayans/alvarez team. haunted house 1 & 2 were funnier and it seemed there was a stronger attempt to not be funny, but the vulgarity was over the top even for marlon; which made the movie not worth being on the big screen. basically, i could have waited for it to stream on netflix. a little disappointed as i am a fan of parodies and especially of the ones written by the wayans...love scary movie 1 & 2 (also 3- 4). minimum length of reviews is 10 lines??? wow. OK. what else can i say about this movie that the 5 previous lines didn't say? marlon wore great suits and i liked the apartment's decor. the female lead tried too hard to be serious/funny, but i never read the books nor did i see the movie of fifty shades of gray, so i don't know if the female lead was like this, but being a parody, i assume she was. oh, i almost forgot, the supporting female was the best character in the entire movie and i wish she had a bigger role. i got my laughs mainly from her, but some may think otherwise, but it is a parody after all; you have to take the good with the bad. OK, i should be at 10 lines now. :)"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "conquerjones",
        "review_rating": "2",
        "review_title": "It's not Marlon Wayans' style anymore",
        "review_detailed_main": "I'm a Marlon Wayans fan don't get me wrong. When I finally saw him get roles in film without Shawn Wayans I expected more major roles to come his way. No offense to Shawn Wayans but Marlon had something that I felt would never reach its peak with Shawn right beside him the whole way.\n\nThat being said! Marlon has evolved from this style of parody comedy. He has evolved as a comedian, actor and a man in general. Had a film with this style of comedy hit the market right after the \"Scary Movie\" series and White Chicks it would have topped the charts but this style is dated. Parody movies have ran their course.\n\nThat's it!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "paul_haakonsen",
        "review_rating": "5",
        "review_title": "Hardly a noteworthy spoof...",
        "review_detailed_main": "Of course Wayans would delve in a spoof and farce on the success of \"Fifty Shades of Grey\". And it is, of course, done in the very same formula and routine that every other Wayans spoof is done, so there is no deviation to be expected here.\n\nAnd with the fact established that the very same, and too often abused, formula applied to the movie, you can expect very little in terms of originality, concept or surprises. So if you are a big fan of the numerous other Wayans spoofs, then chances are very high that you will enjoy this one too. But personally, then I think that formula has been worn down to the bone and it is time for Wayans to go back to the creative corner and come up with something new.\n\nThe end result that is \"Fifty Shades of Black\" turned out to be not particularly funny. Sure, there were some good laughs here and there throughout the course of the movie, because of the jokes or the situations. But in overall, then this was a very generic and flaccid movie, which could have been a lot more funnier with some more creative and original writing.\n\nI will actually go as far as saying that if you have seen any one of the many previous Wayans spoofs, then you have essentially also already seen \"Fifty Shades of Black\".\n\nNow, I haven't seen the \"Fifty Shades of Grey\" movie, nor read the book, and I have no intention to do so. So how much or how little \"Fifty Shades of Black\" stays true to the original source material.\n\nHowever, all in all, then \"Fifty Shades of Black\" was just another generic spoof comedy that failed to stand out or leave any real lasting impression."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "cosmo_tiger",
        "review_rating": "4",
        "review_title": "Many people may like this one, but as for me it just felt forced and tried too hard to be funny, and failed.",
        "review_detailed_main": "\"Are you stalking me, Mr. Black.\" Hannah Steale (Hawk) is a college student that helps her roommate by interviewing a billionaire named Mr. Black (Wayans). Slowly a relationship begins to build, but Mr. Black isn't like most men, then again neither is Hannah. I have to start off by saying that I have seen enough of the Wayans' brother spoof movies to not be excited about this one. Haunted House 2 was terrible and I was expecting more of the same from this. While this movie was better, it still wasn't that good. Unlike the last few movies they have done though this one is more of a mock then a spoof, in the vein of Hot Shots. Rather then just piecing together parts of different movies to try and be funny, this one sticks to the Fifty Shades of Grey story and really just takes it in a more ridiculous direction. There were a few parts where I smiled and even a few where I laughed out loud, but there are still scenes in this that go on way too long with a joke that isn't funny to start with. Many people may like this one, but as for me it just felt forced and tried too hard to be funny, and failed. Overall, another Wayans' spoof that falls flat. I give this a C-."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Hellmant",
        "review_rating": "4",
        "review_title": "The movie is almost as painfully bad, and crude and offensive, as 'FIFTY SHADES OF GREY'!",
        "review_detailed_main": "'FIFTY SHADES OF BLACK': Two Stars (Out of Five)\n\nA spoof of the blockbuster erotic drama flick 'FIFTY SHADES OF GREY' (and the book it's based on). The film was directed by Michael Tiddes, and written by Marlon Wayans and Rick Alvarez; the same trio performed the same duties on both 'A HAUNTED HOUSE' movies (which are parodies of the 'PARANORMAL ACTIVITY' flicks). Wayans also stars in the film, as Christian Black; a rich entrepreneur with an obsession for stalking and beating young women. Kali Hawk costars, as the virgin college student he's pursuing. The movie also features Jane Seymour, Fred Willard and Florence Henderson in supporting roles. It's about as bad as you'd expect it to be, with just a few funny moments mixed in.\n\nChristian Black (Wayans) is a wealthy businessman; who made most of his money through stealing from others (and a brief job as a male stripper). He's obsessed with stalking and domineering young women (and he already has four restraining orders against him). So when a young virgin college student, named Hannah Steale (Hawk), comes to his office to interview him, for her roommate's school paper, he immediately becomes infatuated with her. A very unhealthy relationship develops.\n\nThe movie is almost as painfully bad, and crude and offensive, as the material it's parodying. Almost, but not quite. It's not as offensive as 'FIFTY SHADES OF GREY', because it's main intent is just to spoof that film; it's a joke, and not supposed to be taken seriously. Parts of it are funny, because the film it's spoofing is so easy to make fun of, but it's definitely not clever or witty in any way. Overall it's a waste of time, and pretty hard to sit though.\n\nWatch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=OHm0V1TOCkg"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "MadelineGrossman",
        "review_rating": "10",
        "review_title": "Hilarious!",
        "review_detailed_main": "You people have no sense of humor. I was crying through the whole thing. Entire lead cast was hysterical. RIP Florence Henderson."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "FeastMode",
        "review_rating": "6",
        "review_title": "my notes",
        "review_detailed_main": "A lot of jokes missed but i laughed a lot. very similar to haunted house 1&2 (2 viewings)"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Bryan_Roderick",
        "review_rating": "2",
        "review_title": "Not funny.",
        "review_detailed_main": "Fifty Shades of Black\n\nThis movie was not funny. Lots of cultural references that are poorly executed. Stereotypes are one thing and the film pokes fun at them. Racism can be funny if done correctly: Daniel Tosh. This film doesn't make racism funny. It's not offensive, it just tries really hard to be funny and fails at every corner.\n\nI enjoyed the references sometimes, especially Whiplash. Since the film failed to make me laugh once, I could still see some good in the writing. It's the delivery by Marlon Wayans and Kali Hawk that fail. Kateesha was especially annoying.\n\nAffion Crockett reminds me how much distaste I have for The Weeknd and his mediocre singing (insert Mad Max reference)\n\nMarlon Wayan's goofy humor was off-putting this time around. I've enjoyed his earlier work, Scary Movie, and even more recent ones like, A Haunted House.\n\nSomething nice to say about Kali Hawk is that she took this roll like a boss. She seemed to genuinely try to keep in character and play along with the goofy nature of the film.\n\nVerdict: You were right not to go see this movie. Don't bother renting it now. It was painful to finish all 90 minutes."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "lisafordeay",
        "review_rating": "1",
        "review_title": "Makes the orignal a masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "CriticsVoiceVideo",
        "review_rating": "8",
        "review_title": "Better than the real 50 shades.",
        "review_detailed_main": "Way more entertaining, sexy, and more realistic chemistry between the leads than in the actual 50 shades movie. Watch this one. It's just silly fun."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "baconboygrp",
        "review_rating": "6",
        "review_title": "What a guilty pleasure",
        "review_detailed_main": "This movie is not a masterpiece at all... but definitely a funny slap stick raunchy comedy!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "ginocox-206-336968",
        "review_rating": "8",
        "review_title": "Much better than anticipated",
        "review_detailed_main": "\"Fifty Shades of Black\" satisfies my primary criterion for comedies: Did it make me laugh? It did.\n\nI haven't seen \"Fifty Shades of Grey,\" so don't know which parts were parodies or how effectively the movie lampooned its inspirational material. Some of the gags fell flat, others seemed poorly executed, but many made me laugh out loud. The humor isn't politically correct in the least, but I consider rectitude the antithesis of comedy. Much of the humor involves racial stereotypes, but rather than being mean spirited toward minorities, it often ridicules the ignorance of bigots. The sexual content, as well as the sadomasochistic elements were low key and conservative, despite the R-rating in part for \"some graphic nudity,\" which comprised obviously prosthetic phalli and scrota, and one left breast that looked better than real.\n\nProduction values were more than adequate with a refreshing lack of distracting camera jitter. Performances were solid throughout, with all the actors committed to roles that weren't always flattering. Kudos to Jane Seymour and Florence Henderson for their unabashed performances, as well as to the rest of the cast. None of the actors seemed self-conscious in the least.\n\nMy chief reservation is that they didn't push the envelope a little further. The bondage scenes and Steale's brassiere and panties ensembles became a bit repetitive. Some of the situations could have been mined for more humor."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "lwoods2",
        "review_rating": "7",
        "review_title": "I Laughed Way Too Hard.",
        "review_detailed_main": "I don't know know why the ratings are so low - I laughed through the whole thing! I'll totally watch this again! Also, I can't submit this review until it contains 150 characters, so .... BABABOOIE BABABOOIE."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "rajatshanu64",
        "review_rating": "9",
        "review_title": "comedy version of fifty shades of Grey",
        "review_detailed_main": "that is so so full of comedy movie it is comedy version of fifty shades of Grey whole story is same as i guess but topic are now changed Grey is all about romance and drama and this is just all about comedy or else you can say this is same comedy version like meet the spartan is comedy version of 300 so when you are going to watching a comedy version of any film make sure you did watched it's original version it makes you more laugh. i enjoyed full movie very very much nothing to tell because same as of Grey version but in Grey movie you will enjoy some sex scene and here this guy just come out it 1 min and movie is full with this type comedy and the best dialogue i listen it is when the girl beating men with hunter and she said,\" And this is for the little white girl in Fifty Shades of Grey she had to be naked in whole movie! this is best dialogue. i don't know why it's IMDb rating is 3.5 i noticed people is not rating much to comedy movies but i give it 9 . some movies have low rating doesn't mean it is flop this is one not it earn doubled then it's budget. i don't know why the i am not watching it for a long time i thought it is just same as the Grey version but yesterday when i watched it's trailer then i got interest."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "hoxjennifer",
        "review_rating": "6",
        "review_title": "Hilarious, if you watch it in increments",
        "review_detailed_main": "This movie is better suited to a YouTube mini series or a Vine-style comedy. It is hilarious, but only if you don't actually watch the whole thing in one sitting.\n\nI watched this movie during study breaks at about 10-20 minute increments at a time. It is definitely cringe-worthy and there are some scenes where the humour is really grasping at straws.\n\nBut one thing the film has going for it, is that it really follows the original 50 Shades to a T, and when it pokes fun at it, it's really spot on. I personally hated 50 Shades of Grey, and enjoyed spending my breaks entertaining myself with senseless humour every so often.\n\nI can't imagine actually sitting through the whole 1 hour and a half of it in one sitting, but I did appreciate the laughs this movie gave me.\n\nBest enjoyed in increments - Probably not the best compliment a movie could have, but it does enhance the watching experience in my opinion."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "lavenderface",
        "review_rating": "8",
        "review_title": "Not that bad",
        "review_detailed_main": "I don't get the majority of reviews being so low. It had a few jokes that fell flat, but the characters were interesting - in fact, Hannah nailed Dakotah Johnson as Anastasia.\n\nMy boyfriend, who wanted to watch it, enjoyed it a lot and laughed out loud (I did a little too). I also appreciated the brief female empowerment twist.\n\nI haven't seen the original, but the ending is probably just as contrived/abrupt in that. The digs it takes at it are perfect, perhaps the \"vampire bite\" kiss early in the film was even a super meta joke about it being Twilight fan-fiction.\n\nI'm someone who does not like Scary Movie, Haunted House, etc. This one was the right amount of crude and clever for me.\n\nIt wasn't riotous laughs all the way through, but I'm giving it an extra star out of commiseration."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "hughchilles",
        "review_rating": "10",
        "review_title": "I'm the 100th review for this movie!",
        "review_detailed_main": "I see so many 1s and 2s, this movie may not be a perfect 10 but it's definitely worth more than a 2 so hopefully my 10 will bring it up a bit.\n\nIt's everything I wish Marlon did more of, pulls no punches, disgustingly laugh out loud funny. I consider this progressive humour, it's not afraid to make fun of all genders and races, so much comedy is censored and tame these days this is what the world needs more of, but don't watch it with your family!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "Amari-Sali",
        "review_rating": "6",
        "review_title": "A young woman meets a rich man who demeans her verbally and physically, yet she keeps giving him chances for reasons never really explained.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "logan-323-516061",
        "review_rating": "10",
        "review_title": "If you like crass, gross comedy you'll love this!!",
        "review_detailed_main": "I am astounded that this has such a low rating, for a comedy, it's hilarious. I've watched it several times and friends and I laughed hysterically. Many times we had to rewind the movie because we missed the next joke from laughing so much. So many comedies these days aren't funny. They may be good, they may have interesting jokes, but they don't often make me laugh at loud. This movie is different because it made me laugh, and I mean hard, straight from the gut laughs. Its so funny that people will to my room to see what I'm laughing at. And what's even better, is that it's funny from start to finish. They really worked on the script because there's something funny in every scene. And that's rare. But you have to like dark, juvenile humor."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "only1romemajor",
        "review_rating": "7",
        "review_title": "this sucks",
        "review_detailed_main": "This movie couldve been cast better!!!! 50 shades of grey went real well, in box office but this movie script could of line up, like 50 shades of grey could of had the same aspect but differt storyline."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "aleitans",
        "review_rating": "10",
        "review_title": "Great madness 😁",
        "review_detailed_main": "This is ten million times better than fifty shades of gray has ever dreamed of being!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "j-a-julian",
        "review_rating": "9",
        "review_title": "Great Parody Movie",
        "review_detailed_main": "First of all I cannot understand why the current featured review of this movie is by someone who admits he hasn't seen 50 Shades of Gray ... that makes him totally unqualified.\n\nThis was a great parody. Kali Hawk bears a striking resemblance to Dakota Johnson. Kali's performance is impeccable; she captures every detail of Dakota.\n\nIt's also difficult to understand the low ratings. If you saw Gray you'll love Black."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "ttreakle",
        "review_rating": "10",
        "review_title": "Oh Hell No!!!",
        "review_detailed_main": "I love a good parody film. Airplane and hot shots are to great examples. This movie is right up there with the greats. Marlon Wayans delivers another gem . The jokes were on point and the scenes with him and Kali were hilarious. There's so many to talk about but the one that stands out is a flash back scene involving Florence Henderson. I also enjoyed the other scenes making fun of other movies most notably magic mike. I can't understand why this movie has a 4 % on rotten tomatoes. This is exactly why I don't go by anyone else's opinion on Movie's. This is 85 minutes filled with laughs and I highly recommend you watch it.\n\nTimothy Treakle."
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "rdbrfh",
        "review_rating": "10",
        "review_title": "Great Entertainment",
        "review_detailed_main": "This movie is obviously a spoof film, it is entertaining in that spirit. The jokes are hilarious, the cast is spot-on. I love the cameos by various comedic actors throughout the film. I enjoyed the jokes as it makes fun of itself at every turn! Really well done spoof movie. I'm not even a Marlon Wayans fan at all, but this movie really is funny. I am not sure why there are so many poor reviews. I watch it every time it's on and usually catch a new joke that I missed before. Would love to see a part two. Kali. Hawk is beautiful and talented actress!! Lastly enjoyed seeing Florence Henderson too!"
    },
    {
        "movie_id": "tt4667094",
        "movie_name": "Fifty Shades of Black",
        "movie_rating": "3.5",
        "review_username": "elshikh4",
        "review_rating": "",
        "review_title": "There is something rotten in the state of Hollywood !",
        "review_detailed_main": ""
    }
]