[
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "bobbysing",
        "review_rating": "2",
        "review_title": "Its weak, amateurish and has too many songs but still I fully support its novel thought on the admission percentage criteria of Colleges.",
        "review_detailed_main": "An inspired or copied film doesn't provide me enough excitement to write about it in details. And F.A.L.T.U. remains one of those unofficial inspired movies which fearlessly take the main idea from another director's work and then serves it with some extra toppings to the viewer as an original creation. But in this case, even the copy is not the first as there was another movie released in year 2010 which was also based on the same idea taken from the English flick \"Accepted\" (2006). Yes, \"Accepted\" too is said to be made around a similar idea used in few other movies such as \"Camp Nowhere\" (1994). But still this fact cannot be used as an excuse by the makers of FALTU for their copying act.\n\nSome students who are not able to get admission in any reputed college due to their low percentage think of opening a fake university online, just to show to their parents that they have been accepted there. But their idea turns out to be big problem when the university becomes famous on the net and more students apply to it unknowingly. Last year we had a small budget movie called ADMISSION OPEN which was also based on this novel original thought of Steve Pink's \"Accepted\". And this year we have a comparatively decent budget movie made on the same topic from the house of Vashu Bhagnani. In the original the fake university is called \"SHIT\" which stands for South Harmon Institute of Technology and in this present copy version it is called \"FALTU\"which stands for Fakirchand and Lakirchand Trust University.\n\nAs a movie experience, F.A.L.T.U. gives you the same result as per its title. Its weak, its amateurish and has too many songs which irritate. Thought some of the tracks are good but coming one after another just like that, make the viewer restless. The script takes too many liberties in its execution of an interesting idea and as a result the proceedings on the screen look like childish and unbearable. Like I couldn't understand where from all that money used to come for paying the huge bills of the University? The writers also try to incorporate the idea of \"Do what you want to do in your Life\" in the film on the lines of \"3 Idiots\", but in the process fail completely. At certain points, it even gives you an impression of a film made in a hurry, which is surprising since it features the producer's son (Vashu Bhagnani) too in the lead.\n\nThe director Remo D'Souza directs too simply with only the climax giving you something to rave about. Particularly the dance sequence which is his forte stands out and impresses. But again we have already witnessed some similar excellent performances in the director's TV show \"Dance India Dance\" too. In the acting department also, I didn't find anyone doing something great in the film out of the routine. And I really felt sad seeing Arshad Warsi, Ritesh Deshmukh and Boman Irani being wasted in such a way.\n\nHowever, despite of all these drawbacks I would like to support one good idea put forward by its writers which surely deserves an applause. The thought is that if all the colleges give admissions only to the students securing above 70% then why the passing percentage is kept at 33%. In this scenario what all those majority students are supposed to do, who manage to secure only marks in between 33 and 70 percent. So to avoid all this rejection and confusion why don't keep the passing percentage only at 70% which will further motivate the students to study more harder.\n\nThe idea is great, sounds logical and gets my full support too. But unfortunately I cannot recommend you to see the movie only due to this noble thought presented. So for this week, just plan to do something better than this FALTU."
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "amey_007",
        "review_rating": "1",
        "review_title": "F.A.L.T.U. is a FALTU movie. Its script is copied from Hollywood movie ACCEPTED",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "A_Voice",
        "review_rating": "3",
        "review_title": "Where were the Cameos ?",
        "review_detailed_main": "I had not seen Steve Pink's Accepted, so I can't say to what extent F.A.L.T.U was copied. But I have heard that it is a complete Rip off.\n\nF.A.L.T.U was as predictable as it gets. The humor is not at all humorous (barring a few punches). It was the same old film regarding the shortcomings of education system presented a bit differently. The only thing you will remember when you walk out of theaters is the last performance, its simply superb, hats off to Remo for such good choreography (though it too was copied from a talent search).\n\nRemo was only good as a choreographer in the film. His directing was hardly impressive. Acting was ordinary, songs were good (but there were too many of them,which made them irritating). Screenplay was bad. In short it was a debut gone wrong.\n\nI would rate it 3/10 And Where were the Cameos ?"
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "himdesai",
        "review_rating": "7",
        "review_title": "NOT a FALTU movie!",
        "review_detailed_main": "F.A.L.T.U. as obvious from the promos is very much inspired by Accepted (2006, I remember the movie tickled my funny bones).The movie marks the debut of Remo as a bollywood director.(He has a Bengali film in his bag as director).I had quite low expectations from the movie though the music was awesome.\n\nBut I must say i under rated Remo. The movie is total-fun. The first half of the movie is as smooth as the original one. Funny dialogues, rich cinematography and sizzling star cast (yes the actress is charmer).\n\nThe problem starts in the second half. The movie loses its pace here.Screenplay gets quirky. Some meaningless melodrama here and some unwanted sequences(the film could have been tighter by 10 minutes).\n\nBy the mid of second half I thought that the attempt is not honest.The sudden transformation of genre from comedy to drama is a bit jerky. But all this complains came to an end as soon as the climax arrived( thanks to the ace choreography by Remo, something world class!). In last 10 minutes you feel that the effort by Remo is honest and honest enough to overtake the original movie.You cant manage but smile in the end when you leave the theater.\n\nNot to forget the tremendous audience response at the theaters(commendable as the world cup fever is on). If the world cup trivia and more hyped (GAME) was not the hurdle, the movie would have been a super hit for sure.Lets see how far it can go now.\n\nFrankly the concept(though copied) is better than 3 Idiots (I personally find the movie over ratted).One should see it for sure."
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "sashank_kini-1",
        "review_rating": "2",
        "review_title": "Directionless, pitch-imperfect ho-hum",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "chechs",
        "review_rating": "7",
        "review_title": "Things go berserk when 4 youngsters' plan to cope with their bad grades results in FALTU",
        "review_detailed_main": "OK. I passed my schooling, but the problem is with the threshold marks!! 37%, 40% and 42%!! It is for sure that I won't be accepted in any college. So, what needs to be done? F.A.L.T.U. is how Ritesh and gang try to hide their rejection. A Fakirchand And Lakirchand Trust University created overnight, with advertisement in newspapers, a website, admission letters and a different kind of Principal (Ritesh Deshmukh) with the help of Google (Arshad Warsi). OK. Everything done. But soon the trouble starts brewing up when they realize that there are other FALTUs too and that too in the same campus!!\n\nGo for Faltu for a refreshing take in Indian cinema. It's college all the way after 3 Idiots. Although not up to that mark, but still a good treat for the vacations. Music's good. Newcomer Puja Gupta lives to her performance, but still the lagging point is the acting. A good story plot and screenplay simply fail to overshadow poor performances, even by the veterans like Arshad Warsi and Ritesh Deshmukh."
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "khanraiyan-39389",
        "review_rating": "1",
        "review_title": "Complaont regarding non availability of movie.",
        "review_detailed_main": "There is only trailer available where is the movie???"
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Troughs and crests",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "vinayshri",
        "review_rating": "10",
        "review_title": "Great concept that our education system should understand",
        "review_detailed_main": "I belong to those \"35% category students\" so i could relate more to this movie. After quitting education in middle of graduation I've become a artist and living a peaceful life in serenity. Everyone should understand what children want and not what you want a child to become. I love cinematography and music most in this movie. Thank you."
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "philipmathew89",
        "review_rating": "2",
        "review_title": "Very bad movie...",
        "review_detailed_main": "A bad adaptation from a 2006 Hollywood movie accepted..."
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Done on good intentions but fails to strike a chord!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "patelshom",
        "review_rating": "10",
        "review_title": "Amazing movie...",
        "review_detailed_main": "What your hart says you do that...Don't be afrade of any one. One day you will become successful in your life..."
    },
    {
        "movie_id": "tt1667076",
        "movie_name": "F.A.L.T.U",
        "movie_rating": "4.8",
        "review_username": "AnishMisra",
        "review_rating": "",
        "review_title": "FALTU Movie Review",
        "review_detailed_main": ""
    }
]