[
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "StevePulaski",
        "review_rating": "1",
        "review_title": "A mindbogglingly convoluted chapter in animation and cinema itself",
        "review_detailed_main": "I remember in 2005, as a young child who was just being acquainted with the internet, learning about Lawrence Kasanoff's Foodfight!. The film seemed unlike anything I had ever heard of before, combining dozens of popular advertising mascots such as Mr. Clean, Chester Cheetah, Mrs. Buttersworth, and Charlie the Tuna into one film that would resemble Toy Story if its setting had been transferred to a supermarket. The story of the film is actually one of cinema and animation's most baffling stories of a film's time in development hell and still captivates me whenever I scour the internet looking for a summation of what exactly went on with the picture. The story is one of incredible ambition, controversy, and an unfathomably disappointing conclusion. If you're not familiar with the backstory, I'll give you a little rundown.\n\nIn 2001, director Lawrence Kasanoff, who was known for producing the Mortal Kombat films as well as a handful of TV adaptations on the franchise, announced an undertaking like no other - he was going to make an animated film under his own company Threshold Entertainment that focused on the events that would take place inside a supermarket when the lights would turn off. Kasanoff envisioned a spectacle like no other, centering on dozens of recognizable brand mascots that would fend off a new, evil brand that attempted to takeover the marketplace. Not only was a film planned, but merchandize-galore was in addition, with toys, stuffed animals, a potential web show, commercial tie-ins, fast food toys, books, and more were also planned to coincide with the film's release. Kasanoff called Threshold Entertainment \"the next Pixar\" and also banded together top animators from around the world to piece together a project with incredible ambition. The film was to be released in 2003.\n\nSo why is it that for a film this ambitious you probably haven't heard a damn thing about it? Well, for starters, the film's first immediate roadblock came in the form of a burglary in 2003 when hard drives containing the film, its animation, and its conceptual mockups were stolen. The animators and everyone assigned to the project needed to start from scratch. Nonetheless, Kasanoff pushed on with the project, confirming a release date of 2005.\n\nFoodfight! never came out in 2005 and news of it became scarce and vague when it did manage to circulate. The release date was changed several times before finding itself up for auction in 2007 for a surprisingly low $2.5 million, given its ambition and $65 million budget. Finally, the film came out over a decade after it first hit production, in October 2012. It received a very limited theatrical release in Europe and a silent DVD/video-on-demand release in the States, effectively ending one of the most mindbogglingly convoluted chapters in animation history.\n\nNow the question begs an answer, what does Foodfight! look like in its final state? The simple answer is \"hell.\" This is a film that was clearly rushed upon being purchased at the aforementioned auction. The story concerns, as stated, a supermarket that turns into a playground for its product-mascots upon closing. The leader of this world is Dex Dogtective (voiced by Charlie Sheen), a crime-fighter who becomes incredibly suspicious of \"Brand X,\" a new line of products that are hitting store shelves. Dex and his gang of friends Sunshine Goodness (Hilary Duff) and Daredevil Dan (Wayne Brady) prepare to keep the supermarket in their hands, but Dex increasingly finds himself distracted by the likes of Lady X (Eva Longoria), a desirable woman who keeps trying to win Dex's eye and the store manager finds himself dictated by Mr. Clipboard (Christopher Lloyd), who is enforcing Brand X.\n\nTo begin with, the animation is awful. This is animation that looks and moves like a broken Sims game on PlayStation. Never in my life did I think I'd call an animated film with so many colors and characters odious but that's exactly what it is. While the characters appear in a three-dimensional state, the backgrounds almost look two-dimensional, and worst, are almost indistinguishable in terms of what they're supposed to be. This is clearly animation that is not finished and was forced to be the finished product. Characters are very stiff when moving, have a peculiar coldness to their movements in addition, and many of them look grotesque and ugly.\n\nThen there's the awful writing at hand here. One can sort of forgive the animation for looking terrible, seeing as, understandably, everyone's hands just wanted to be cleaned of this film, but with twelve years of production and a forced rewrite thanks to a burglary, you would think the writing would be marginally polished. And yet, Foodfight! bears so much sexual innuendo it's ungodly and very inappropriate for children (Daredevil Dan says to the sultry Lady X in one scene, \"Oh Mamacita! Yo, sweetcakes, nice packaging! How about some chocolate frosting? I'd like to butter your muffin!\"), Lady X boasts fetish-like lingerie as her primary outlets, orchestrating the fan-fiction version of her character, and characters speak almost entirely in grocery-store/food puns. There's no characters here, despite there being like thirty that are recognizable. There are just empty, hollow animated creations programmed to spew something that is allegedly funny.\n\nFoodfight!'s existence and eventual outcome should be a warning to those who have an idea they see bold and ambitious opportunities for. Granted a burglary can't really be blamed on part of the writers and directors but an awful script, a premise that seems to exist solely as a corporate byproduct, fourth-rate animation, and incredibly unforgivable and unnecessary sexual innuendos can be. The fact that Foodfight! is a bad film is the least of its concerns; it's a morally, ethically, and visually reprehensible fiasco that scrapes the bottom of the barrel so forcefully that it's tearing a hole in its base."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "info-5111",
        "review_rating": "1",
        "review_title": "No matter how bad you think it is...",
        "review_detailed_main": "...it's even worse.\n\nAll evidence points to this animated film being contrived as a money-making scheme. \"Hey, we can create a cheap CGI movie and make companies pay for the celeb voices in advance by inserting their brands in the film!\"\n\nThe result is worse than crass, it's abominably bad. It's so bad that the film has been stuck in production limbo for a decade and it hasn't aged well. The CGI, the story and the one-liners (oh God, the one-liners...) all bear the mark of genuine and profound incompetence, a complete lack of even the most most rudimentary story-telling skills.\n\nWhat passes for a narrative revolves around supermarket brands coming to life at night. Rex Dogtective (yeah, go ahead and try to laugh at that one), voiced by Charlie Sheen, mourns his lost love but must soon save his supermarket city from the evil, impersonal Brand X. With the help of ... ah, who cares?\n\nFoodfight! will bore, offend and anger you at the same time, such is its unprecedented badness. Please don't watch it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Fun_film_frenzy",
        "review_rating": "1",
        "review_title": "Run away......",
        "review_detailed_main": "Appalling, awful, tasteless and unfunny. CGI worse than a 1995 video game, combined with stunningly inappropriate and crass double-entendres make this an experience painful both to the eyes and the brain. Nazi- themed products take over a supermarket, complete with Eva Longoria's female Hitler character switching outfits between stripper schoolgirl and fetish Nazi. \"One brand, one market\" she shrieks to the minions gathered at a huge rally. Just vile.\n\nI'm all for a bit of a bit of tasteless comedy, but it's got to be at least a little bit funny. And, please, not crass Nazism and innuendo in a movie aimed at 5 year olds. Oh, and even my kids thought it was lame. I hope the 'stars' got paid well - they should be doing pro-bono work for the next 5 years to make up for it.\n\nGenuinely the worst movie I have seen in the last 10 years - avoid at all costs."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "KidMacabre",
        "review_rating": "1",
        "review_title": "It's not just a bad movie",
        "review_detailed_main": "Foodfight! is a cynical, cheap, patronizing, lifeless, lazy, unfunny, tasteless, shoddy, disrespectful, offensive-to-anyone-with-a-brain piece of unmitigated garbage, sure, but it's much more than that.\n\nBecause it is meant to be entertainment aimed at children, and because its message amounts to nothing more than \"BUY OUR BRANDS, OUR BRANDS LOVE YOU, YOU LOVE OUR BRANDS, EAT OUR FOOD, EAT, EAT, EAT, EAT, EAT...\" Foodfight! is not just a bad movie.\n\nFoodfight! is PURE EVIL.\n\nSo far, the movie has only made $73,000 on a (shocking) $65 million budget. I guess there is some justice in the world.\n\nTen years ago, when Threshold Entertainment's hard drives were stolen, writer/director/producer Lawrence Kasanoff called it an act of \"industrial espionage.\" I salute the brave souls who actively hindered the production of this film. You fought for the brain cells of children everywhere. I think watching even fifteen minutes of this movie has made me stupider.\n\nDon't just skip this movie. Burn it, then bury it in a desolate field somewhere. It deserves to die the worthless drop of despicable piddle it is.\n\nAlso, \u0083*¢% Larry Kasanoff."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "tonymars-63087",
        "review_rating": "1",
        "review_title": "Unrelenting burning pile of horse excrement",
        "review_detailed_main": "A true tragedy that will go down as one of, if not the, worst animation movies ever made!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "MonsterVision99",
        "review_rating": "1",
        "review_title": "Just as awful as everyone says. Pure animated dreck.",
        "review_detailed_main": "Genre film producer and Vestron Pictures producer Lawrence Kasanoff tried to cash-in on the success of animated movies made by Pixar and Dreamworks in the mid 90's and early 2000's but he did it in the laziest possible way a kids film can turn out to be.\n\nIf it would have been released in 2003 as it was planned, it would probably be considered a bad, strange and awkward hack job but fate had different plans for this piece of garbage. It wasnt enough to be a bad product of its time, fate wanted it to be one of the worst films ever made by delaying the already flawed production for years and releasing this trash into the world.\n\nWhen you mix a pandering producer who doesnt have much experience at directing, let alone animated features, with a bunch of annoyed underpaid animators, several production difficulties and straight up bad decisions you get... Foodfight.\n\nThe film was originally going to be animated to resemble a Looney Tunes cartoon but Kasanoff decided the film would use motion capture, a technique that clashes with the cartoony animation style he wanted. The result is the worst of both worlds. Characters are stiff with their movements but this is often interrupted with more flexible stretchy movements that arent executed properly because of the bad animation and feel completely out of place. Thats not taking into account the awful art direction, ugly 3D models, disgusting textures and generic designs.\n\nWhen you try to make a project like this, you should at least be familiar with how the medium works, instead of making arbitrary decisions that will inevitably create troubles for you and your crew; there doesnt seem to be a consistent idea or vision for the film besides making it a commercial family picture for the lowest common denominator."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "blueflamefilms",
        "review_rating": "2",
        "review_title": "Wait, what?",
        "review_detailed_main": "You know, this review isn't based on the premise that this is an egregious film. It is, I agree that this film is abhorrent. However, the legend surrounding this lukewarm, atrocious piece of media is far more enjoyable than this pile of excrement.\n\nThis *ahem* \"film\" came out December of 2012. It was supposed to come out in December of 2002. The film was stolen, and that was probably for the best. However, because the directors had faith (or fear that they'd lose 45 MILLION DOLLARS) for this film, so they began again from scratch. And what we got was probably the worst thing of all time.\n\nIf this movie was a regular Hollywood flop I'd maybe forgive it. But on account of how atrociously awful this film is in any aspect, I'd expect it to be made by a 17 year cannabis addict who maybe knows a bit of VFX. But this is a 45 million dollar animated film starring Charlie Sheen and Dwayne Brady. If Clerks can be made with a 25,000 dollar budget and Napolian Dynamite for $40,000, how is this god-awful film's budget anywhere past $7.34! Oh I know! Charlie Sheen spent 44 of the 45 million on crack. Yeah, that'd explain this movie. They were on crack the entire time.\n\nWords cannot describe the amount of crap this movie sinks in. It's terrible in every single aspect: And I mean it this time. The animation is the equivalent of nails going into your eyeballs, the sound effects are all crap, the plot is wonky, the characters are so bland they're almost non-existent and it just goes on, and on, and, on, and on, x500. This movie is terrible, almost even laughably bad. In fact, it's so awful it IS laughably bad. I was in tears of joy that it was over, tears of pain that I wasted my precious time on this, and tears of laughter that something so awful even exists.\n\nWatch it just once, and you'll quote me."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lysaali50",
        "review_rating": "1",
        "review_title": "this movie is #1",
        "review_detailed_main": "Sausage party WISHES it turned out like this\n\nthis movie has 10 years of hard work and development put into it and multiple production companies involved you know that's the mark of a successful movie!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Treacle-A",
        "review_rating": "",
        "review_title": "Execrable, torturous, c**p",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Terastas",
        "review_rating": "1",
        "review_title": "A museum piece",
        "review_detailed_main": "This isn't just a really bad movie. This is a movie that, ten to twenty years from now, people will be debating whether or not it even existed. Like the animated Titanic movie, it isn't just bad, it is bad in such a way that it will be considered inconceivable that such a movie could have even been green lit; a movie where people will see brief snippets and wonder if it was a real movie or just somebody's entry-level CG demo-reel.\n\nFor this reason, this is not a movie that should be watched. This is a movie that should be thrown into the basement under lock and key for twenty years until it becomes obscure and collectible just like Nintendo's Virtual Boy.\n\nI'm not kidding. I have a Dex Dogtective doll, and when I tell people what it is and where it's from, the reaction is always the same: \"Holy ****! That thing is real?!\" The C.G. is terrible, the characters are one-dimensional, the writing is asinine, the jokes make BioDome look like Waking Ned Devine, and the talent of the voice cast is squandered across the board.\n\nThe only thing that makes this movie even worthy of note is the overabundance of marketing icons. But this isn't a precursor to \"Wreck-It Ralph\" -- won't offer any insights as to what the life of a marketing icon might truly be like (Charlie Tuna makes an appearance, but nobody comments on the fact that he exists to sell the shredded corpses of other tunas). Instead, all we get is a hollow narrative about how buying generic brands is evil. SO BUY OUR CRAP!!! Yes, it's that bad. Right up there with Manos: The Hands of Fate, Tentacolino, Birdemic and The Room: A movie so bad that some people just absolutely have to have it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "kaipomerleau",
        "review_rating": "1",
        "review_title": "Noooooooooooo!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "fullerd-94841",
        "review_rating": "10",
        "review_title": "I love this movie. AAAY LMAO.",
        "review_detailed_main": "This movie is a cinematic masterpiece, from the sensational motion capture, to that scene with the salesman that I think has Parkinson's. This movie is absolutely glorious from stat to finish. Charlie Sheen should clearly star in more movies, as this only serves to highlight his magnificence. This movie also may or may not be KKK propaganda, the stereotyping is pretty intense, so there's that. Your children should probably watch this movie every night if they want to grow up healthy.\n\n10/10 Aaaaylien out.\n\nP.S.- This is probably just a porno that was accidentally packaged as a movie, so that adds to it if anything."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "6",
        "review_title": "Worst animated movie ever? Not really, but the one that suffered the most during its making",
        "review_detailed_main": "I can't speak badly about this movie because I know there were a lot of complications making this movie take years to make, since most of the money invested was borrowed and the movie was going to have good animation, but the discs that contained the original version they were stolen causing this film to be remade from scratch, but with a more limited budget and cheaper animation so that it will be finished quickly. It seemed like a promising project, but in the end it was not. The animation does not seem to be done by professionals, as it resembles those animated videos made with Source Filmaker and Blender. Some characters came to like me, especially the protagonist, as for the others, because most of the characters are quite bizarre. I would say that this movie needed improvements both in the animation and in the script because some things seemed absurd to me. We mustn't forget to mention that this movie has many off-color jokes, which was not pleasant for the audience considering that it was a children's movie, although the truth is that I laughed a lot at those jokes. Foodfight is not an excellent animated movie, but I've already seen it 4 times in 2 weeks and the truth for some reason doesn't stop attracting my attention. I think it's because of the bizarreness, which is that it never ceases to fascinate me. The movie didn't seem so bad to me, but it's not good either, so I think I could classify it as mediocre or average and that's why I give it a 6/10. I agree that it is not a good movie, but there is something about it that makes me want to see it again. I don't know exactly what it is, but I guess it's like the protagonist Dex used to say: \"The secret is inside.\""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "matthewpamment",
        "review_rating": "2",
        "review_title": "its so damn bad",
        "review_detailed_main": "This movie is so bad, it looks like something that some kid made on a 3d modeling program in his spare time and was super excited to show to parents.\n\nThe only thing i liked is that it spawned 2 great review videos on YouTube.\n\nSeriously, if you spent so much money making it, you should at least finalize the quality\n\nI think these people should look at what some people have managed to make on blender, a free modeling program. it does not taker a master mind crew to make a movie that is even slightly watchable"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "seanherbsrules",
        "review_rating": "",
        "review_title": "It's Their World v. Brand X",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "Worst crossover ever",
        "review_detailed_main": "I remember watching the Nostalgia Critic's review of this as well as JonTron's. It's truly some of the Critic's best work and should be seen. He compared it to \"Wreck-It Ralph\". I guess those are similar to the even more awesome Lego movie. They are films that show us that a world of fictional characters can be made into something wonderful. Sadly, this film shows us the complete opposite. I wouldn't quite say it was the worst animated movie I've ever seen. I think that \"honor\" goes to the 2001 animated Titanic movie. This film has credits that go for eight minutes. That other one had credits for fourteen minutes!\n\nI guess it technically isn't as ugly as \"Joshua And The Promised Land\", but it really is a worse film. At least that movie was less than an hour long! I hated every minute of this. It has some of the ugliest CGI ever created. These cartoon characters are horrible at showing emotions. They just seem to be staring blankly all the time. All of these characters are ugly. Even the ones who are labeled ugly are really no worse than anyone else. This might be the reason why I'm not into celebrity voices. Of course, anyone would regret being in this movie. What's worse is that there's this guy called General X who explicitly mentions how aroused he is by everything.\n\nThe villain, Lady X wears clothes that alone should have gotten this movie a PG-13 rating. The climax is one of the most monotonous things I've ever seen in any movie. It's just characters throwing food over and over. It's painfully drawn out for something that's only an hour and a half long. The movements in this film are amazingly terrible. The facial expressions are among the worst ever created. It's good expressions that make me love animation so much. This film makes no sense. It features this world where food mascots go into their own magical world or maybe it comes to life at the end of the day or it exists on some other plane, but I don't care at all.\n\nIt is a hideous film where the cameos serve no purpose at all. I looked in the credits and I found out there were characters like the Energizer Bunny in this. I didn't recall seeing him so they probably just put him in the crowd scenes for no reason and still mentioned him in the credits. The voices are obnoxious, especially this giant nosed sneezing guy. It's also hateful with them explicitly making Jew jokes. Wait, why would Brand X recall the prunes that Lady X came from? That's impossible! This is idiotic in every sense of the word and is as terrible as every Internet critic has made it out to be. Zero Stars"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "beemanmc",
        "review_rating": "5",
        "review_title": "It's so bad, it's good",
        "review_detailed_main": "I watched this, and it really brainwashed me. I like how the dog is voiced by Charlie Sheen. Also I will never forget that talented name - Dex Dogtective Yes it's bad but if you dig deep enough in the web you'll find a fan-base somewhere, and I'm a dedicated fan myself. So all I can say is: It's so bad, It's good. I've seen bad movies, but most people will be thinking that it makes no sense at all. I know it is a bad movie, and i can say that I did do small research on the director \"Lawrence Kasanoff\" and he's made some pretty bad films. this is worth watching if you want to review a movie like this. so really, I recommend you to watch this movie at least once. I've seen it twice, its that bad."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Mara-Jade-Skywalker-23",
        "review_rating": "1",
        "review_title": "This exists (Foodfight)",
        "review_detailed_main": "Can you believe this movie had a budget of 65 million dollars? Just stay away from this film. I am not going a long 3 paragraph long rant because people have said more than enough, so avoid it like the plague."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "I cannot imagine a more horribly animated film than this one and even film school students would be ashamed to put their names on this mess.",
        "review_detailed_main": "While I love international films, classic Hollywood films and all sorts of bizarre films, I also have a love for terrible films--as many of our readers have no doubt noticed. It all started several decades ago when I read Harry Medved's great book \"The 50 Worst Movies of All Time\". Since finding and seeing all fifty of these movies, I have also attacked IMDb's list of the 100 lowest rated films of all time. However, as this list is ever-changing, I have to re-check the list periodically to see if there are any new additions. Fortunately (or more like UNfortunately) I noticed a new addition to the list....\"Foodfight!\". However, unlike many of the bad films I have enjoyed for their sheer awfulness and cheese-factor (such as \"The Room\", \"Plan 9 From Outer Space\" and \"The Apple\"), some films are just horrible and offer no enjoyment whatsoever. \"Foodfight!\" is surely one of these joyless and horrible films.\n\nThe story of how this terrible film got made and released is something in itself. While work on the film began in the early 2000s, the hard drives for the film were apparently stolen and work had to begin again! I assume that these folks simply had never heard of the concept of making backup copies. Also, I can only assume someone stole the film in order to save humanity. Unfortunately, work began again--and the original release date in 2003 came and went. Release dates kept changing until eventually the filmmakers were in default on their loans. The film rights were bought at auction for a tiny fraction of the cost to make the film and it was eventually released to DVD only recently.\n\nSo why is this film so horrible? Well, the reasons are countless so I'll just concentrate on the major problems. The biggest and most obvious problem is the computer graphics. This CGI film has the ugliest, cheapest and lousiest looking animated film in history. Film students would be ashamed to put their name on this product...it's that bad. Although the work was done in the 2000s, graphically the film is what you would expect in the early to mid 1990s--well before the first \"Toy Story\" film. Characters are blocky, haphazardly stuck on the backgrounds, have garish colors and are simply ugly. There is NOTHING about them that ever speaks quality in any manner. The same can be said about the backgrounds--which are usually very fuzzy and look worse than an old-school computer game like \"MYST\".\n\nThe dialog is the second worst thing about this 'movie'. While it's clearly aimed at children and stupid people, too much of it is spiked with sexual innuendo to make it appropriate to the children at least. A few choice pieces of their brilliant dialog would include: 'I'd like to butter your muffins' 'Better take it easy on the potato juice before you become chip-faced' '...you have something to say, candy-arse?!' 'I want to scrub your bubbles, Dex' 'What the fudge?!' As for this final comment, it DOES actually sum up the film extremely well!\n\nThe story itself is also simply horrible. Some parents might strongly object to the fact that this film is ALL product placement aimed at children--with many of the characters consisting of unappealing corporate knockoff characters that look like McGruff the Crime Dog, Charlie the Tuna and Mr. Clean (among many others). I could also talk about the plot involving the evil Brand X trying to take over the grocery store where all these characters live....but so many other awful things assaulted my senses that I really didn't even care about the insanely bad and cynical plot.\n\nDespite a plethora of B and C-list stars to provide the voices for these unpleasant characters, there just is no reason to see this film for the average person. For fans of dreck, perhaps it's worth seeing...if extremely unpleasant and boring. And, I could also see professors at schools such as Ringling School of Art and Design showing it to their students as an example of the worst animation to be produced since the beginning of time. Otherwise, steer clear of this wretched piece of bile..."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "eparazak",
        "review_rating": "1",
        "review_title": "It's bottom-of-the-barrel bad and that's just being nice...",
        "review_detailed_main": "Jontron was right! Nostalgia Critic was right! Animat was right! Phantomstrider was right!\n\nWhy didn't I listen to them?!\n\nThis is an animated feature about a dog named Dex Dogtective who's played by Charlie Sheen and gets depressed after his girlfriend Sunshine Goodness disappears. After a brand called Brand X, controlled by Lady X begins to take over the food market that he and a bunch of grocery mascots live in, they must fight back.\n\nWhere do I begin? The animation is hideous; it's the worst animation ever put to film, I'm not even kidding here. It was originally destined to be in a Looney Tunes style when planned in 2002, but when the film went into production issues, the director decided that they should change the style to motion capture. Seeing these two styles combined makes the movie look unnatural. The animation itself looks ugly from the character designs, to the awful effects, to the backgrounds, the list goes on. Ranging from the human designs to the designs of the mascots, they either look unnatural or uncanny. For example, Lady X looks very plastic like and Cheasel T. Weasel has the color of poop. For some reason, the camera moves in almost every single shot. You may see the camera zoom in, spin around a tower or pan in for an extreme close up. The backgrounds have an incredibly low resolution, to the point where some of them look flat. For example, in the beginning of the movie where the store closes, the interior of the store looks flat. Keep in mind that this movie came out in 2012. I could harp on about the animation, but I think I should move on.\n\nThe story and characters aren't much better in comparison. To start with the story, we have the concept. Basically, food mascots come to life at night when the store closes. The concept bares a striking resemblance to that of Toy Story's, only with food mascots. To go along with the concept, the movie uses endless product placements from Charlie Tuna and Mr. Clean to the Vlasic bird. It doesn't make the audience feel grateful seeing all of these advertisements in a movie. As for the story itself, it's very incoherent and there are many scenes that don't make much sense. For example, during the midpoint of the feature, Dex can be seen out in the market during the daytime while customers are shopping and it doesn't make sense as to how he is able to be on the outskirts of the store. There are also these weird sexual innuendos that are noticeable that really do make me question the PG rating. During the midpoint of the movie there is a musical number that is really grating on the ears to the point where I nearly went insane listening to it. None of the jokes hit and come off as cringeworthy. Did I mention that the story is incoherent?\n\nThe characters...hoo boy, where do I start with them? I can start by listing them. The doctor does nothing but talk rapidly in the most obnoxious voice possible. Cheasel T. Weasel, aka the poop rat is incredibly over the top with his cartoony movements; heck he has an entire shop hidden inside of him. Lady X is a generic villain who tries to seduce our protagonist, and she also wears very suggestive clothes while doing it. Daredevil Dan is an obnoxious racist stereotype. And then there's Sunshine, who maybe the most likable character in this movie since she isn't annoying. Finally, we have the main character Dex Dogtective. Dex is probably the most interesting character of the movie because of his girlfriend's disappearance. However, that doesn't make him likable. What makes him unlikable is the fact that he spouts out food puns all the time. While this gag doesn't make him unlikable per se, it only makes him look tolerable at best. One last thing I'd like to mention about the characters is the voice acting. Many of them are voiced by talented people such as Charlie Sheen, Wayne Brady and Eva Longoria. However, their voice acting in this movie can range from sub-par at best to bad at worst.\n\nIf there is one tiny saving grace to the film, it's that the opening song is actually pretty good. However, it doesn't save this from being a terrible movie.\n\nDon't be fooled, the uncanny animation might seem like the only reason why this movie is so hated on the outside. However, if you dig deeper into the movie, you'll see the real reason why it gets so much hate, it has a nonsensical story, annoying characters and sexual innuendos. Please I beg you, do NOT watch this movie. Don't even get this for your kids, it's too inappropriate for them. Give them something else, ANYTHING else.\n\nI want to be done with this movie forever!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jamalsistas",
        "review_rating": "1",
        "review_title": "This is a crap",
        "review_detailed_main": "This movie is incredibly rotten . It's lazy , that's phoned in , it's got bad messages The WORST ANIMATED MOVIE EVER and one of The worst cartoons ever"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jn-neva",
        "review_rating": "1",
        "review_title": "The end of the temporal concept...",
        "review_detailed_main": "This... thing is so out of this universe that I'm convinced, that extra-dimensional eldritch deities must be real. I'm not saying everything in this movie is bad... though that's probably the case. But bad isn't the word I'd use. What I'd use is \"wrong\". And that in turn doesn't mean \"there is something wrong that I can't put my finger on\". But \"wrong\" as in \"should not BE\". Like it's a perversion and an affront to humanity and nature. That goes for animation, editing, writing, plot, \"plot\"... EVERYTHING is \"wrong\", to the point that I am broken in a way I cannot explain. Existential crisis does not quite cut it. There is something truly dark and sinister in play.\n\nWatching this makes me feel like a black hole has spawned somewhere where my head connects with my soul (I believe in those now too, thanks to this) and is slowly sucking away my brain and soul at the same time. Somewhere in another universe there floats a chunk of brain matter with an unfinished human conciousness, and it has been contained for research by that world's version of the SCP Foundation, and it's being documented as a work of cosmic horror in another universe. And each of those universes is a tiny bit worse for it, because each version of this conciousness by its nature spawns other instances of this being in other alternate universes, and none of them might ever learn to truly understand it until it's far too late.\n\nThis *thing* is wrong. It should not be. But it is. And none of us are safe from it. For mere knowledge of this atrocity is enough to initiate... not end, because that implies natural flow of time, but the erasure of any beginning. Non-existance itself will not be. There is no word or concept in mortal tongue and mind to comprehend the state.\n\nAnd humanity played a key part in it.\n\nTl;dr: Movie bad."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "xkwhittles",
        "review_rating": "10",
        "review_title": "A True Masterpiece",
        "review_detailed_main": "Where to start with this one? Let me start by talking about the animation. I do not understand what is up with all of these reviews saying that the animation is bad. Do not get me wrong, it is not on the same level as something such as The Queen's Corgi, but the animation is not bad like everyone says it is. The animation is unique and original. I bet you can not name one other animated film that has animation quite like this one. Every scene clearly had a lot of heart and soul poured into it. It truly makes me wonder why so many films that come out nowadays show no signs of having passion behind them.\n\nMoving onto to the characters. One of my favorite things about this piece of art is that around ninety percent of the characters is that they are product placements. Another interesting thing that I noticed was that for the companies that clearly disagreed to have their brand shown anywhere in this film are portrayed as some sort of disgustingly designed bootleg version. It truly shows that the creators of this movie were so confident in it that they basically laughed in the faces of the brands that refused to come near the movie. This movie introduces a new character in basically every scene which keeps the film from ever getting boring. Each and every character is unique and like able, something that most films nowadays fail to create. Each and every character has a role in the story and so much backstory to go with them.\n\nAnother truly extraordinary thing in this movie is how characters get around. Literally one second they are standing in the strange alternate dimension that they reside in and than suddenly teleport to the actual world with no context whatsoever. Most people would see this as just being lazy, but I see it as something else. This is called character building. You see, given how fast characters move around it is easy to assume that they have teleportation abilities. A lot of people these days want everything said out loud to them because they lack the sufficient amount of brain cells to figure things out on their own.\n\nHowever, my favorite part about this movie has to be the villains. In every single scene that they are in there are Nazi overtones. One of the characters literally says \"We were just falling orders!\" before being flattened and most certainly died right after. Not to mention their logo is basically a eagle clutching a + symbol, much like the eagle clutching the swastika. Same position and everything. This goes to show that the creators were not afraid to teach young lings about Nazi Germany and what happened during those times. Show many movies for kids these days are so watered down that they become boring to anyone with a somewhat developed brain.\n\nThere is so much more to this film and I do not understand where the negative reviews are coming from."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Rectangular_businessman",
        "review_rating": "1",
        "review_title": "Rotten",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Juwon_28",
        "review_rating": "",
        "review_title": "Hideous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Insultingly execrable",
        "review_detailed_main": "There is not much to add to what has already been said, and so well by everybody else here. As a lifelong animation fan, Foodfight! is one of the few that I deem completely unwatchable and it is certainly one of the worst animated films ever made. The animation is unspeakably awful, not just the worst computer-animation in an animated film(excluding Video Brinquedo's and Spark Plug Entertainment's output, seriously the animation here makes Animals United seem like Toy Story in comparison) but some of the worst-looking animation ever. Everything looks so flat and stiff, no vibrant colours, technical invention or easy movements, and you'd be hard pressed to find creepier and more nightmare-inducing character designs. The music is generic and completely unmemorable, often it is placed in an irrelevant and over-used way too. The story was not a very good idea to begin with, but everything is so contrived and predictable it actually hurts, there is little momentum in the pacing and the story meanders a lot while being simplistic at the same time. In short you are never engaged or emotionally invested. There is not a single decent character either, they are either annoying or insignificant and their creepy designs(especially the villains) further add to this. The voice cast on paper are talented, but the voice work is poor here with only Christopher Lloyd trying, Charlie Sheen sounds very detached and bored and there is a lot of overdone hyperactivity and wasted talent everywhere else. Harvey Fienstein is the only other voice actor along with Lloyd who sounds immediately distinctive, the bad news is that I didn't see the point of his very brief role. The script was the worst culprit though, not in a long time has there been a script in an animated film this abominably bad, the bad-taste bathroom humour, out-of-place and inappropriate innuendo, Nazi overtones and equally crude one-liners and catchphrases that are enough to make anyone cringe taken to offensive levels. To conclude, cheap and intelligence-insulting, Foodfight! is execrable, not just one of the worst animated films ever but one of the worst films in general that I've seen in some time. 0/10 Bethany Cox"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Quinoa1984",
        "review_rating": "1",
        "review_title": "nightmare fuel",
        "review_detailed_main": "I have to be honest - I didn't watch this movie in full from start to finish, rather I saw a several video reviews on YouTube of the movie, which used an extensive amount of scenes and clips. It may sound like a cheat, but trust me when I say I saw enough of this movie to last a lifetime without having to watch it all the way from start to finish.\n\nThis is the kind of shoddy work that would get penny-a-day workers in Malaysia scolded by their superiors - you can make it look s***y, but THIS s***y? The whole thing is meant to cash in, and only cash in, on the craze of hip-ironic computer animated movies of the late 90's and early 00's without any sort of understanding what made those movies matter (i.e. Toy Story and Shrek but I'm sure you can point to others from Disney and Dreamworks). This lacks any shred of competency, but more than that anything close to humanity. If Roger Ebert once said that movies are like machines for empathy, then... this is the opposite of that.\n\nHorrible puns (which can often, when done right, be really funny in real life, honest, I swear), horrible animation (it makes even the creepiest of the Uncanny Valley animated movies like Polar Express look like Sleeping Beauty), horrible voice acting (even Charlie Sheen, someone who just picked up a check for years on end to fart in front of sitcom canned laughter, seems bored - or Christopher Lloyd who's having a stroke in front of the world), and a horrible, unforgivable cynical grab at, on top of the aforementioned steals of Toy Story and Shrek: Casablanca. Did this f***er even watch Barb Wire?\n\nIt's not even funny enough to laugh at, which is one of the most unforgivable things about something that goes into the subterranean depths where barrel bottoms don't even exist (to put it in perspective, Doogal is a better bad movie than this - DOOGAL). While you can go look at the trivia online and add that into the fire of horror that comes with this movie, just on its own terms it's an unqualified disaster. It's not even joyful to dump on the movie, it's simply a waste that makes America look bad to foreign countries and sets us back another 50 years as far as being pioneers in the world of arts and sciences.\n\nOh, and it is the kind of material that I'm sure, if you show to your kids or you are a kid and decide to watch this, that will give you nightmares. And I don't mean in the fun horror movie way. I mean more akin to the kind of dreams where you watch your dog making love to your parents while a bonfire engulfs your X-Box and Salvador Dali plays baseball on top of their corpses."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "bastizarate",
        "review_rating": "1",
        "review_title": "MY EYES! MY EYES!! MY EEEEEYYYYYYEEEEEEESSSSS!!!!!",
        "review_detailed_main": "Ugh. Why this movie even Exist!? Everything is Terrible. When I first saw the Trailer. I don't want to watch the Whole Movie. Never! Never! Never! NEVER!!!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "rockndaparadise",
        "review_rating": "1",
        "review_title": "Now I know!",
        "review_detailed_main": "When I first heard about this movie, I thought it sounded like an interesting concept. However, I've been constantly hearing time and again that people are dubbing it one of the worst animated films ever made. At first, I thought they were just being harsh critics by just saying, \"Pfft! It sucks!\" Though, out of curiosity, I decided to check it out for myself just to see how bad it really is, and...it was not at all what I was expecting! I can now see why people are dubbing it the worst of the worst! The animation is just pure nightmare fuel! Half the time, I have no idea what I'm even looking at! Not to mention the story is all over the place, and the characters are just so annoying and forgettable! Not to mention the food mascots hardly get any screen time whatsoever! (Heck, half of the mascots on the poster don't even appear in the movie at all!) It saddens me even more how many big name celebrities they got to work on this movie! There goes their reputation! Seriously, I thought this movie was just going to be a so-bad-it's-great guilty pleasure, but I was wrong! I was not expecting this movie to actually traumatize me! I should have listened to all those reviewers and just took their word for it! Curse my curiosity, and curse my gullibility! Thank God there isn't a sequel!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "yv_es",
        "review_rating": "1",
        "review_title": "Not worth it even ironically",
        "review_detailed_main": "All the 10/10 reviews are cute. How ironic. Ha. Ha.\n\nBut let me tell you, Foodfight is not one of those so bad it's good films. Foodfight is no Room or Plan 9. Those films are endurably bad. They are fun! Ed Wood had a story to tell and did the best with his limited resources.\n\nWatching Foodfight though just feels dirty. Like binging the home shopping channel on TV. Like stumbling across some weird animated fetish film made by artificial intelligence. This is a film that makes you feel like you need to take a shower after watching. It should be illegal to show Foodfight to anyone who is not a consenting adult.\n\nI watched Foodfight during a Twitch virtual afterparty for a Fire Toolz movie night. We tried to joke though it. We tried to laugh at it. But ultimately, the film won. It was simply that bad.\n\nOnly watch Foodfight if you want to see how bad an animated film can be. Otherwise, even as a joke, don't waste your time."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "princessstrickland21",
        "review_rating": "1",
        "review_title": "WHAT THE HELL?????????",
        "review_detailed_main": "Are you serious???? This has to be HORRIBLE!!! I've seen people review this movie, and I feel sorry for them. Yet alone, this is just ridiculous as well as cringe watching. They can't even get the species right. BTW: why does the lead's girlfriend look like a Sims character gone wrong. I think is just a pointless cash grab of crap. DON'T SEE IT!, unless you want your eyes to bleed out!!!!!!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "joeyacc",
        "review_rating": "1",
        "review_title": "don't even watch it, trust me...",
        "review_detailed_main": "This is without a doubt the worst animated movie i have ever seen. Shortly after watching a youtube review on this movie (by jontron), me and my best friend decided to watch it together. We went in with the plan to not only judge it for ourselves, but at the same time insult it for all it's expected awfulness and unintended comedic value... so basically we watched it to make fun of it. we sat through the whole thing and let me tell you how not worth it it is to see for yourself. Over all the \"plot\" of the movie is terribly written and so heavily rushed that the main plot finishes in just under an hour and straight into the big food fight sequence, which technically lasts for about 30ish minutes. The jokes they try to put in are very forced and just unfunny. They added in so many unnecessary and stale characters (no pun intended) that contributed almost nothing to the plot. my own personal biggest complaint about this movie is that overall it's just ugly, it's almost literally hard to look at the screen because of unappealing characters and mostly empty scenery. Just trust me when i say DO NOT WATCH THIS MOVIE! The movie can be best described as an endurance run, both me an my friend agreed that if we had decided to watch it on our own we would have stopped before the 20 minute mark. It's not even worth making fun of. So in conclusion i'm just saying not to watch it, it's ugly excuse of a movie that over uses product placement... it's simply terrible. If you really need to know what it's like then just watch jontron's review on youtube, it sums it up in the best way I've seen done so far."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "mysteriouseverlost",
        "review_rating": "10",
        "review_title": "My Fav Rom Com",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ShallotHare",
        "review_rating": "1",
        "review_title": "Do not get this movie for your kids",
        "review_detailed_main": "This movie is the absolute WORST I have ever seen. To explain, I will explain the 5 principles of movie categories. Visuals, Writing, Characters, Originality, and Overall Likability. Let's start with the visuals. The visuals are the LAZIEST MOST UNREALISTIC THINGS I HAVE EVER SEEN! Really. I can make a movie better than this in the span of 10 MINUTES! It's like they didn't even try. Everything has a plastic texture, crap texture, THAT MAKES YOU WANNA THROW UP AND STOP THE MOVIE BEFORE THE 15 MINUTE MARK! Writing, Um.. Where is this \"writing\" exactly? All it is is just about a main protagonist named dexdogtective who goes on failiure adventures to solve failiure mysteries! Oh, and our main antagonist, Lady X! Lady X is the only character that I like here. Because she is trying to STOP this ugly atrocity! We also have a fight scene that is a length of 35 MINUTES! WOULD YOU WATCH A MOVIE WITH A FIGHT BEING LONGER THAN THE ACTUAL STORY?! Um.. No. Next category, Characters. The characters tell awful jokes that I don't even get! Like, \"Let's strawberry jam out of here\". HOW DOES THAT EVEN MAKE SENSE?! As I said earlier, only 1 likable character, being Lady X, or the main antagonist. The rest of the characters even don't make sense, OR JUST SIT IN THE BACKGROUND FARTING AND BURPING ALL THE TIME WITH THEIR UGLY CGI DANCING AND PLASTIC TEXTURES! Originaltiy, some people thing this is original. But if you think that, YOU ARE DEAD WRONG! THIS MOVIE RIPPED OFF ANOTHER MOVIE CALLED \"Over the Hedge\" WHICH IS WAY BETTER THAN THIS! BASICALLY THE WRITERS ARE TOO LAZY TO MAKE SOMETHING ORIGINAL, AND PLAGORIZE SOMEONE ELSE! And now, overall likability. YOU WILL NOT LIKE THIS MOVIE! LITERALLY! WATCH THE TRAILER! EVEN THE LIP SYNCING Doesn't EVEN TRY TO MATCH WHAT THE CHARACTERS ARE SAYING! I WOULD GIVE THIS A 0/10 IF IMDb Didn't GIVE US A MINIMUM OF 1/10 TO CHOSE ON WHAT TO RATE THIS GARBAGE! I AM DONE! So parents of young kids who are reading this, do not watch the movie. Don't EVEN THINK ABOUT SHOWING THIS MOVIE TO YOUR KIDS! Don't EVEN SHOW THIS TO YOUR BOSS EITHER! If your boss sees you showing him/her this movie, YOU WILL BE FIRED! Just watch something like Zootopia or Despicable Me 2. Because those 2 movies were great. But of all the movies you choose, DO NOT CHOOSE FOODFIGHT!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jaymaildotcomz",
        "review_rating": "1",
        "review_title": "I was just a boy!",
        "review_detailed_main": "10 years ago I exited a theatre and was met by a person giving free screenings. At the time it sounded like the coolest thing ever. Little did I know I was about to watch the worst thing I had ever seen. Imagine being 10 years old and realizing a movie sucks, like its terrible. I was a kid! I liked everything! This movie gave me nightmares due to the wierd glitching movement of the villain. And above all, it just freaking sucks. It shouldn't even be possible to make something so bad that most 10 year olds in the screening either left early or sat through till the end and left with PTSD. There should be a class action lawsuit against this movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Reckno64",
        "review_rating": "1",
        "review_title": "Worse than Emoji movie.....",
        "review_detailed_main": "The animation is horrifying. And not in a \"so bad it's good\" way. It's just terrible to look at. Even watching the reviews of this movie (which were MUCH more enjoyable) on YouTube, I could barely look because the animation was so abysmal.\n\nEverything else from the characters, to the plot, to the overall story were bad too. Whoever stole the original copy of the movie in 2002 probably did the world a service, or so they THOUGHT. It all backfired....."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Raskolnikov1867",
        "review_rating": "1",
        "review_title": "Not Even \"So Bad It's Good\"",
        "review_detailed_main": "I have a friend who views watching terrible films as a perfect social activity. This can be quite enjoyable at times, as many of the films we watch together provide numerous opportunities for MST3K-style commentary. A couple of years ago, I chose to watch Foodfight! with him while he was over my place. I had heard that this was one of the worst animated films ever made and I thought that it would be a source of much schadenfreude. After an awkward hour-and-a-half, I realized that I was mistaken - Threshold Entertainment has managed to produce a film that's so incompetent on so many levels that it's almost unwatchable.\n\nThe most glaring flaw with the film is the animation. The computer animation in Foodfight! looks worse than animation made on a much lower budget 15 or 20 years before this film was released. The character models range from unappealing to horrifying and some of them are reused multiple times in the same shot, with crowds of people consisting of the same five or so character models repeated dozens of times. Apparently, the original assets for the film were stolen, forcing the film crew to recreate what was lost on a much lower budget, so they weren't entirely to blame for this aspect of the film's awfulness.\n\nThose involved in the film's creation don't get a similar pass for the writing. The plot is riddled with so many clichés that you could hang Dex's fedora on them. For example, Dex is the character who was once a detective but left the profession after the woman he loved disappeared, a stock protagonist so generic that even Ballistic: Ecks vs Sever included him. The humor is equally bland, consisting of fart jokes, bad puns, and sexual innuendos that seem rather inappropriate for a children's movie.\n\nA large part of the controversy surrounding the film's release was the rampant product placement. While I found the product placement a minor quibble compared to the film's other glaring flaws, I understand the concern - Foodfight! is ostensibly aimed at children, and they are more susceptible to being influenced by product placement. However, I found the greatest disappointment surrounding the inclusion of brand mascots, called \"Ikes\" in the film, is that they don't do much other than stand in the background of some shots. I was hoping to see Mr. Clean use his navy training to beat the villains senseless, but the only action scene involving the Ikes was a brief scene near the end, where they throw food at the Brand X soldiers.\n\nThe real tragedy of Foodfight! is that it is not even \"so bad it's good\". Foodfight! could have easily been enjoyably bad, but it commits the cardinal sin of being both bad and bland. I could even see a version of Foodfight! that I would enjoy unironically - a move that embraced the absurdity of the premise and was written in a way that was more self-aware. Foodfight! was never going to be Citizen Kane, but it could have been Robocop - a movie that used its rather silly premise to deliver some clever social commentary. However, the version we got is neither of these things."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Retro2006",
        "review_rating": "1",
        "review_title": "No. Just No.",
        "review_detailed_main": "Along with the horrid \"Cat in the Hat\" mess from 2003, this monstrosity is also one of my most hated films, ever. It's not even family-friendly at all. For one thing, the CG animation looked unfinished. I've viewed the trailer of the stolen prototype and it looked way better. Worst of all, there were lots of perverse innuendos that aren't fit for children under 15 years of age. There are other appropriate CG animated cartoons that are better than this rubbish, like \"The Emoji Movie\", \"Sing\", and \"Frozen\". Avoid this thing at all costs."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "chrisminutolo",
        "review_rating": "2",
        "review_title": "*INSERT SEXUAL INNUENDO HERE*",
        "review_detailed_main": "I despise this movie entirely. Not only does it look like crap, it looks like a crap that was sponsored... and it is.\n\nNo kid (or adult) should be shown this filth.\n\nAnd if you DO show it, burn whatever device you viewed it on."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ynqve",
        "review_rating": "1",
        "review_title": "Oh. It's bad!",
        "review_detailed_main": "But, when it comes to movies this bad, the important question is: Is it so bad it's good? Well, not really. Most of the laughs come from how terrible the thing looks, and that wears off after the first few minutes. Then there's the absurdity of all the lame, nonsensical puns and innuendos. I swear, when you think they can't get lamer, they will prove you wrong every time! And lastly, this movie is weirdly and disturbingly fetishist. I mean the love interest is a furry, the villain has both a school girl and a dominatrix outfit and that's just scratching the surface. But most of the time it's just an incredibly ugly and boring movie.\n\nSo while it's nowhere near the \"so bad it's good\"-quality of the Room or Troll 2, it may give you a few laughs. But seriously, you're better of watching something else. And if you still insist on watching it, don't do it sober. This is beyond any doubt one of the worst movies ever! It's incredibly bad in every way possible. The movie is ugly, the animation is terrible, the script is beyond stupid and the whole thing just reeks of laziness, racism, sexism and cynicism. And thus it should be treated accordingly, with a large amount of alcohol. You'll need it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "daniflynn-70712",
        "review_rating": "1",
        "review_title": "Don't ever go near this film it is poison",
        "review_detailed_main": "Shall we address the animation? Jesus Christ IT LOOKS LIKE SOMEONE ANIMATED IT WITH THE GRIM UNDER THEIR FINGERNAILS. THE COLOUR PALET IS A MIX OF VOMIT AND THE MOVEMENTS OF THE CHARACTERS ARE SEIZURE INDUCING. Now let's talk about the beauty that is the story. Actually i cant even think about it anymore i just want to forget it. Just stay for the fight scene because the animation is so bad it is incredible"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "nb-87458",
        "review_rating": "10",
        "review_title": "Amazing animation",
        "review_detailed_main": "Never seen anything better than this before. I honestly hope it gets a great rating."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "mr_facehead",
        "review_rating": "1",
        "review_title": "Reaches a level I thought not possible",
        "review_detailed_main": "First off... Seriously, they were given $65m and came out with this? Apart from the cast, where was this money spent? The budget for Shrek was $60m... Albeit, not my favourite film, but you can see why it was so successful.\n\nThe film looks like a cut scene from a PS1 game. The animation has a really jerky quality that you'd find in a test clip that lacks it's final slickness. There's virtually no depth or texture to any of it either. Looks like someone downloaded Blender and spent an afternoon learning to use the software.\n\nThe concept of the film is like they'd watched some recent successes with animals and other kid friendly characters and picked up \"101 Hilarious Jokes\" from a charity shop. All they had to do was glue those elements onto the family movie skeleton and there you have a winning script for a screening at the International Kicked in the Head by a Horse Convention.\n\nThe humour in it is annoyingly bad and the delivery from the actors make you cringe... I can't completely blame them though, because the sound quality suggests that they weren't given a lot of time.\n\n\"Hey! How's it going with that project we gave you $65m to make?\"... Yeah, it's coming along real swell... (10 years later)...\n\nFoodfigh! gives the impression that they mentioned some A-list names and how CGI films are the latest craze and got money thrown at them. Then they gave some students $100 and a couple of months to throw something together, got the Hollywood stars to record the voices over a dinner table one evening, pocketed the rest of the money and waited 10 years for the investors to forget about it.\n\nLawrence Kasanoff, you've done it again! Here's another one to add to the CV that will get your name on the Hollywood Walk of Fame... (Insert tumbleweed here) This film belongs in the Ripley's Believe It or Not! museum and that's the only reason anyone should ever see it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "maddoxsmith-79121",
        "review_rating": "4",
        "review_title": "Doesn't Deserve All The Hate",
        "review_detailed_main": "Honestly it could've been really good. But terrible animation,characters,acting,and a boring plot make this movie bad. But, not as bad as people say. Honestly this is hilariously bad! Like Meet the Spartans and The Creature Wasn't Nice. But this does raise a serious question....\n\nKasanov be walking to work like this?! Or what ?!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "hosierdaniel100-956-695734",
        "review_rating": "1",
        "review_title": "Absolutely painful to watch",
        "review_detailed_main": "The fact that this even came out disgusts me. The fact that even though all the known copies were destroyed or stolen, they STILL crapped this thing out disgusts me even further. Seriously. You would think they could make a good movie with people like Charlie Sheen and Christopher Lloyd, but nope! The animation is terrible. All of the faces look distorted, movement is everything but smooth, and the villains (Brand X), DON'T EVEN GET ME STARTED! The acting is beyond cheap. You would expect a guy like Christopher Lloyd to at least TRY to play a man who owns a supermarket. At least there weren't any Libyans chasing him in that film. And Charlie Sheen's character, Dex Dogtective (Gee, clever) has the worst lines I've ever heard! Speaking of writing, what idiot smart enough to stick a pencil up his butt and nothing else decided to write this crap? And the fact that $65 MILLION was poured into this film, and they couldn't get one likable character, one good line, one decent frame of animation, and at least one decent actor pretending to be actually decent! All in all, it burned my eyes. 1/10"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "belldave50",
        "review_rating": "1",
        "review_title": "The Room of animated films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "flavia_cj",
        "review_rating": "1",
        "review_title": "Are you kidding me?",
        "review_detailed_main": "That's by far the worst animation movie I've ever seen, I say this already having seen The Wild, Chicken Little, Home on the Range, all Disney sequels, all Titanic animations and all Bluth movies 90s. The bullshit level in \"Foodfigth\" is unsurpassed and unreachable. All animation lover should watch this \"pearl\" to give a good laugh and every film student should see this as a learning experience about everything you should not do in a movie.\n\nStarting with the weird premise, market products that come to life when the market closes, and shelves magically transformed into a city. It's all very strange, confused, and the film does not care one bit to explain to us which are the rules of this universe. The film simply think we are already aware of everything.\n\nAfter this initial shock, everything gets worse. We face generic characters, extremely poorly animated and ugly to look at - what heck is that weasel, my Jesus. The plot is a spectacular mess. The film does not know what audience it is targeting. It's look terribly childish, but there are dialogues and grotesque sexual innuendos and poorly made, not suitable for children. There are Nazis. The moment it happens the war of food is worthy of Michael Bay, with endless explosions, the point you wonder when it will all end.\n\nThe animation it seems that was taken from someone's ass in the early 90s. That would be horrible in 1995, imagine how horrible it is today. The scenarios are really terrible and confused, you never know where the characters are, whether it's on the shelf, or in the world of products, or in the aisles of the supermarket.\n\nCan anyone explain to me why the hell this film had a big budget? Would you believe in me if I said that this film has a budget more expensive than Fantasia, Lion King, The Secret of NIMH, Toy Story and Spirited Away? My fuc*** Jesus, this can't be serious."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "mitsubishizero",
        "review_rating": "1",
        "review_title": "Horrendous!",
        "review_detailed_main": "This's some of the worst animation I've ever seen! The story's lame, the characters are horrific and the jokes never land. The only thing that's funny is how terrible everything looks and how everything falls flat. The poster pretty much lied! There's really not much else to say about this terrible movie. Stay as far away from it as possible!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "sakmojohnson",
        "review_rating": "1",
        "review_title": "worst animated movie ever",
        "review_detailed_main": "It is a terrible movie with disgusting animation and terrible jokes and the worst acting. It put legendary actors on a terrible movie, including Charlie Sheen and Christopher Lloyd. With a budget of 65 million dollars, they definitely spent all of it getting permission to put big companies' mascots in their movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "dngboog",
        "review_rating": "10",
        "review_title": "love it",
        "review_detailed_main": "amazing almost made me cry. and the animation was AMAZING, it may be the best and most hart warming movies of all time. i don't know what i would do without it in my life. everything about it is beyond excellent, the acting, the voices, the action, the jokes, the plot, the plot twist it needs to be seen by everyone"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lukekelleyswell",
        "review_rating": "1",
        "review_title": "Worst Animated movie ever made",
        "review_detailed_main": "What is the worst Animated Movie you have ever seen? you might think The Emoji Movie Titanic The Legend goes on Ratatoing or norm of the north well I think I found the true Worst animated movie ever but it's not obscure secret this movie is Absolutely Notorious for how Awful it is with its ugly Crappy animation Out of place Sexual Innuendos Stereotypes Bland characters and Absolutely everything and it's Truly the worst Animated movie ever And To me it's the the 3rd worst movie. I have ever seen behind the Amazing Bulk and Truth Or Dare (2018)"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "minimalcheeseburger",
        "review_rating": "1",
        "review_title": "Deceptive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "nilosekj-34927",
        "review_rating": "1",
        "review_title": "It's bad",
        "review_detailed_main": "It's bad like I can't imagine any thing worse than this. Even dragon ball evolution was Better because at lest they got like two things right like names and the dragon balls and told a story and there affects didn't make me cringe. This movie is also so boring I had to talk about a nother movie just to get thru this. And I feel it made me dumber that I cannot use spellcheck right"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "nikkebaby",
        "review_rating": "3",
        "review_title": "The one the only poop rat!",
        "review_detailed_main": "Me and my brother love watching terrible movies but when we watched this we couldn't even laugh that much. If you want to see other ideas on food fight! You can go on youtube."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "sarahthebaldifan",
        "review_rating": "1",
        "review_title": "Ugly",
        "review_detailed_main": "This movie is the ugliest I ever seen. The character designs are just horrible, the voice acting is bad, and the rest of the movie is just garbage. I never wanna see this again."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "dmanyc",
        "review_rating": "1",
        "review_title": "Frankly my dear, I don't give a Spam.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ironhorse_iv",
        "review_rating": "2",
        "review_title": "It's no surprise that someone stole this film during production. They knew that this film must never see the light of day. This movie did and it sucks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "keitarou_chan_naru",
        "review_rating": "1",
        "review_title": "Please tell me you came here before watching the movie.",
        "review_detailed_main": "I really hoped I was having a fever dream when I decided to watch this, but no people actually put time and effort into it. I have seen actual dumpster fires that have looked better than this. At least with a dumpster fire, it eventually goes out and everything is burned to ash in the end. This abomination of a film just steals away 90 minutes of your life and leaves you looking for a way you give yourself amnesia so you can at least forget you ever watched it. But the real person I feel sorry for, is the person the film was in loving memory to: Robin Klein. Who did Robin Klein off in their lifetime to have their name tacked on to this abhorrent pile of flem. If you are looking for a movie about food coming to life after the store closes, watch Sausage Party, because at least that one won't give you an aneurysm."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "soldjt1",
        "review_rating": "10",
        "review_title": "The Greatest Animation Since Spirited Away",
        "review_detailed_main": "Mr. Clean shines as a recovering drug addict in this dramatic depiction of Charlie Sheen's horrible addiction. Known only for the Mr. Clean commercials, Mr. Clean certainly does not need to clean up on any acting. The balding man shines brighter than his head reflected by the moonlit sky. Hillary Duff, played by the fantastic Lizzie Mcguire, is fantastic as Sheen's porn star daughter. I won't spoil it, but there is a fantastic appearance by Vanilla Ice with great comic relief that had me in tears laughing. Don't miss out on this one. Greatest food fight since Max Keeble's Big Move."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "bellino-angelo2014",
        "review_rating": "1",
        "review_title": "Excruciatingly awful, mind-numbingly stupid and probably the worst CGI movie ever made!!",
        "review_detailed_main": "The story behind this movie is much better than the movie itself. While work on the movie began in the 2000s, the original copies of the film were stolen and never to be found again. I can only assume that the folks that stole it knew that the movie would have been atrocious and the animators never heard of original copies. The release date was always postpone until the filmmakers were forced to release it and it came on DVD only in 2014.\n\nThere are three reasons why this movie is horrible and I'll discuss them all. The most noticeable and worst is the CGI. This animated movie has the ugliest looking, cheapest and sloppiest CGI ever seen in history. Everyone involved with this mess would be ashamed to admit that he was behind this crap-fest. While the movie was made in the early 2000s, the graphics look like from the early 1990s (even years before the first TOY STORY movie). All characters are like stuck in the backgrounds, are sinfully ugly, have garish colours and they are pretty ugly. The backgrounds look like picked straight from the oldest videogames ever, as they are very fuzzy and incoherent.\n\nThe characters' dialogue is awful too. Although this is an animated movie marketed towards children the dialogue is downright dumb and full of sexual innuendos inappropriate for children. The plot is also a mess as well. While it can be looked as an obvious attempt to cash in on the product placement (with many icons and also knock-offed ones such as Mister Clean, Charlie the Tuna, the California raisins) it has also a sub-plot about a detective dog that fights crime and the evil Brand X from taking over the supermarket that has everything that comes to life at night (much like in NIGHT AT THE MUSEUM). But everything in the movie is so horrible that the plot is not that important.\n\nDespite a voice cast that includes Charlie Sheen, Hilary Duff, Eva Longoria, Harvey Fierstein (in a pointless bit role), and even veterans such as Christopher Lloyd, Edward Asner and Cloris Leachman (!!!), there is no reason for watching this movie. Even for bad movie buffs like me it's too boring and painful to sit through. The only advice I can give you? Steer clear from this movie as possible! And you'll probably thank me for this."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jonathanr-67660",
        "review_rating": "",
        "review_title": "The Perfect So Bad It's Good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "d-92998",
        "review_rating": "2",
        "review_title": "Foodfight review",
        "review_detailed_main": "Foodfight. Where do I even begin with this masterpiece. Foodfight was a movie that began development in 2003, and released in 2012. After 9 years in development, this movie was worth the wait. The movie stars Charlie Sheen playing a Sherlock Holmes wannabe dog, and Hillary Duff playing an uncanny anthropomorphic cat creature. This is honestly the best combination of things that a movie director could come up with. This movie has many upsides and is offset by 0 downsides, because the movie is perfect.\n\nFoodfight is an artistic masterpiece in every way possible. The idea of the movie is ridiculously innovative and has never been done before. In a grocery store, food turns into people, and the shelves all turn into a city. It's quite revolutionary and has never before been seen in the history of film. I bet directors everywhere were kicking themselves both metaphorically and literally for not thinking of this idea.\n\nThe exterior of this movie even better than the artistic value, however. With top notch animation, and a script that would put Shakespeare to shame, how could this movie not be good. The animators of this movie had the revolutionary idea of using Microsoft Paint to draw the models, and then imported them to iMovie to cut it all together. Of course I don't actually know if that is how they did the animation and editing, but with work that good, it's the only way I can think of that could get such a stunning result. The writing is an absolute marvel for its age. It has a beautiful number of niche jokes that you would see in other masterpieces, such as Shrek, and a bunch of sexual innuendos for those kids to enjoy.\n\nThis movie teaches all its viewers many important lessons that everyone should know. Some movies teach some really cliché lessons that everyone heard a million times, such as treat everyone equal, and you are your own person. Foodfight takes a different approach and teaches its audience that if you are ugly, you lose and don't get what you want. This could be interpreted in many different ways, but they all come around to that conclusion. I feel like this is a very important lesson that everyone should learn at least some time in their life.\n\nThrowing all these magnificent pieces together, we get one beautiful work of art. I could say that Foodfight was the best film of 2012, but its far more deserving of that and thus I declare that it deserves film of the century. Foodfight is easily one of the best films ever made, and that is why I am giving it a 2/10."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "CountJonnie",
        "review_rating": "2",
        "review_title": "One big mistake",
        "review_detailed_main": "The word bad, doesn't cover it. Everything, from the casting, to the story, to the animation, to the whole proces behind this movie, feels like one big mistake, that took the shape of an ultra bad movie.\n\nThe only good thing this movie created, are the fake positive reviews, and each and every single one of those is funnier than this abomination of a movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "iversen323",
        "review_rating": "1",
        "review_title": "Worth burning",
        "review_detailed_main": "I would recommend this to absolutely no one, and would love it if I could go back so I wouldn't have watched it. Nothing about this movie is redeeming. If you think it's a good bad like 'The Room', it's just flat bad. Horrible voice acting, atrocious CGI, plot hard to follow, and the climax lasted 30 minutes which was the same thing for that time, painful on the eyes, and writing written by a kindergarten student. This is only good if you turn away and run for the hills. Only watch if you truly want to loose faith in the world."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "skatechannel85",
        "review_rating": "1",
        "review_title": "its OK to be scared of this film!!",
        "review_detailed_main": "I was terrified of watching the nostalgia critic review of this movie today. I say do not attempt to watch this movie no matter what age you are. you will have nightmares. you wont go to work after a few days because your heart stopped of the terrible madness you shall see if you ever see this movie. don't buy. don't even rent. don't even think about downloading or watching this movie online for free. you've been warned. the animation look like a game that was unfinished. this movie should be rated \"X\" for scary creativity and non-stop heartbeat that will maybe result in a stroke or a heart attack again you've been warned. to children, teens, babies, adults, parents, aunts, uncles, niece, grandmas, grandpas, daughters, sons, brothers, sisters, step-dads, step-moms, step-grandpas, step- grandmas, step-brothers, step-sisters, friends, teachers, police officers, fire fighters, nurses, doctors, bosses, managers, bums, prepare yourselves to be scared out of your hearts you've been warned thank you for your time"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "mackprime2000",
        "review_rating": "1",
        "review_title": "Ladies and Gentlemen: The worst animated film of all time",
        "review_detailed_main": "Like I said, the worst animated film of all time, and also probably the most expensive. It's 65 million dollar budget is too much for its horrible animation that looks like it was filmed on Microsoft kinect, and also its blatant product placement that is worse than an Adam Sandler film. It's voice cast is reasonable, but with Charlie Sheen's current reputation I really can't praise it at all. The story is incredibly stupid and everything else just takes a back seat to the product placement. Finally, the whole thing was thought to be canned in 2003, and it was nearly ten years before it was released. How did this movie happen? Who in their right mind would pay to make or see this crap."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lisafordeay",
        "review_rating": "1",
        "review_title": "If you thought the animated musical of Titanic was godawful look no further than this piece of crap",
        "review_detailed_main": "Nostlagic Critic brought me here as I saw his review yesterday on this movie which stars Charlie Sheen(from All Dogs Go To Heaven),Hilary Duff(YES HILARY DUFF from A Cinderella Story was involved in this movie why Hilary why),her sister Haylie Duff,Christopher Lyod(Yes that dude from Anastasia and the villain of Who Framed Roger Rabbit),Eva Longoria(yes that chick from Desperate Housewives)all star in this movie that has been dubbed the worst cartoon of all time but one question I have to ask how on earth did this get 65 BILLION DOLLARS seriously Frozen was better than this piece of s***. So what is it about. Well its about a detective dog(voiced by Charlie wildman Sheen) who is solving a mystery that is involved in a supermarket. He of course is engaged to a cat who looks like a human (voiced by Hilary Duff) and like Toy Story everything comes to life in the supermarket(shame on you dudes for making Food Fight by making fun of stuff coming to life).\n\nThe animation is crap,the story is rubbish and everything else is rubbish. My advice DO NOT watch this movie. Watch Frozen and Tangled or any other animated movie(exclude Titanic animated musical,Stuart Little 3 and that godawful Barbie movies,even though they have A better story than this piece of crap).\n\nAvoid\n\nOh and the dude that voices the skunk in Stuart Little 3 is in this movie(Wayne Brady)."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "leblancbethanie",
        "review_rating": "10",
        "review_title": "Breathtaking Masterpiece.",
        "review_detailed_main": "Oh, this film surpasses excellence. Every shred of detail is utterly flawless. The animation exceeds all that Disney has done and sends chills down my spine. A combination of surrealism and realism with a comprehensive story is perfect for the family. The jokes are of surprisingly high caliber and the dialogue is well delivered. Charlie Sheen did marvelously playing the role of Dex Dogtective. He, and the rest of the cast poured their soul into their performances and it shows. Very worth the watch."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "roythedog",
        "review_rating": "1",
        "review_title": "I have a extra reason to hate this abomination",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Movielistdotcom",
        "review_rating": "",
        "review_title": "Incredible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "elinabethjorsten",
        "review_rating": "1",
        "review_title": "The Worst Animated Movie Ever",
        "review_detailed_main": "Now, I've seen bad animated movies in my time. Never, never never have I seen anything quite so bad as this. It surpasses \"so bad, it's good\" and simply ends up \"bad\". The biggest mystery of all, not even the ten years that they spent trying to revive this movie is the 65 million they dropped into it. Simply put, I wouldn't suggest watching it. The voice cast is actually not too terrible. It's always fun to quote Christoper Lloyd saying \"You must be Leonard!\", but still quite confusing how they even managed to get some of these actors. Charlie Sheen...not so much. The animation...oh, don't even get me started. I can't tell what program they used, but it wasn't good. Maybe Microsoft Kinect. The plot is way too convoluted and they give no explanation of anything, even if it is central to understanding the basic concepts of the movie. Again, I say, DON'T WATCH IT."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "twilightsage89",
        "review_rating": "1",
        "review_title": "Yes, it is that bad",
        "review_detailed_main": "Anything and everything that could have gone wrong, did and it did in such a way that it's not like a train wreck you can't look away from, no, it's more like looking at the carnage afterwards.\n\nFrom the incredibly awkward motion capture making the movements look so unnatural it verges on alien to the face that the character models' faces don't seem to change except to vaguely move their mouths to the horrendous CGI work in general it looks dated even by 2001 standards. Not to mention some of the characters are just nightmare inducing.\n\nThe writing is like it came from a racist kid's fetish dream. From wildly inappropriate innuendos to stereotypes of almost every ethnicity, but none of it is even funny to the crudest and most immature of people.\n\nWhat's the worst is IT DOESN'T MAKE SENSE. The plot switches around so much in it's focus, the jokes don't work on a level that transcends bad to the level of thinking this was a giant joke on humankind, the characters inconsistent and the sheer fact that this movie, a movie about recognizable brand mascots teaming up, take up almost no screen time. I can't even remember half of them appearing for more that a quite literal 5 seconds and I'm talking about the ones featured on the posters over the original characters the movie spends all its time on."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "troydevinny",
        "review_rating": "1",
        "review_title": "This is the Worst Film ever Made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "gavinwrivera",
        "review_rating": "1",
        "review_title": "FoodFight is Awful, But I Have Seen Worse",
        "review_detailed_main": "This movie is really really really bad, but trust me, I have seen worse. Anyway, FoodFight is about all of these brand mascots fighting against an evil brand called Brand X. The brand mascots are real, so watching this movie makes you feel like you are getting beaten to death by advertising! Also, the animation looks unfinished, as if this was the first draft before they released the movie. Sometimes, the characters also look 2D. This movie is beyond words bad, but I have seen worse. This movie isn't the worst. It's more like the 3rd worst movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "B3NJ1_MU51C",
        "review_rating": "1",
        "review_title": "...",
        "review_detailed_main": "Terrible animation, awkward voice-acting and sloppy story. The movie was just awful...enough said"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jonpnt0",
        "review_rating": "2",
        "review_title": "Good concept. Bad movie.",
        "review_detailed_main": "With the Vlassic Pickles stork, Charlie the Tuna and Twinkie the Kid prominently displayed on the cover, the idea of the supermarket turning into a huge foodtropolis after hours starring all the iconic brand characters seemed like a funny idea. That fleeting moment of hope ended as soon as the movie began with motion-capture animation worse than CG Barbie movies and a celebrity cast which cost more than this movie will EVER make. Total fail. Watch as Mr. Clean, Mr. Bubble, the California Raisins and dozens of other icons take a backseat as cameos to a main cast of made-up, knock-off brand characters voiced by Charlie Sheen, Hilary Duff, Wayne Brady, Eva Longoria, Christopher Lloyed and a dozen other B-list celebrities with a tiny presence of REAL voice actors like Ed Asner and Jeff Bennett. Bob Bergen and Melissa Disney as an \"additional voices?\" C'mon! This long, boring, grocery store commercial is chocked full of corny jokes based on ad slogans from products like Trix and Rice Crispies but no cameos from cereal brand characters. So bad, you should RedBox it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lfcfanjoe",
        "review_rating": "1",
        "review_title": "Oh god",
        "review_detailed_main": "Have I ever been more bored in my life? The answer is probably no.\n\nLet's kick things off with the production of this film because I think this is pretty necessary. This hopelessness of a film has been in production since 1999, and several different studios have been working on it, if that already tells you that quite a few people have gave up on it what's the point on watching it? That's what some people knew because it only got $75,000 back from a $65,000,000 budget, so obviously it was a flop. \"Foodfight\", was also denounced from taking product placement, which could've got them more money, to make it better! The studio that made this atrocious film also decided to get it out as quickly as possible since some of the characters in the poster weren't in the actual film. GEEZ! Another reason to back this up is that the ending where the main character proposes to his girlfriend is really rushed, this could've been a good scene but it was wasted by the studio who wanted to get it out quickly and get some money, which they didn't do.\n\nThere were quite a few famous actors in this film such as Charlie Sheen however; one member of the cast shocked me quite a bit: Christopher Lloyd as Mr. Clipboard. His acting in my favorite film ever: Back to the Future was breathtaking and in this he was breathtakingly bad, how can he do this? I believe he should stay with acting because his voice acting was awful. Plus, what kind of name is Mr. Clipboard; it's insulting to say that the creators have no imagination with that name. Charlie Sheen is another fantastic actor, what a disappointment from him. All his lines were dull, even if the writer wrote them like that, he could've put some energy into his lines, unfortunately, he didn't and that's what made crap like this. The final voice actor who baffled me was Hilary Duff, the actor who played Lorraine Baker in Cheaper by the Dozen. She portrayed Sunshine and made the character sound like a 5 year old, this was ridiculous! Judging by this film all of these actors/actress shouldn't be voice acting. On the subject of voice acting in general, it was dull and lifeless it made the whole film drag. During this film, there were a few speeches and somehow they were loathsome, speeches are supposed to get you hyped not bored! If I could use two phrases to sum up this film they would be \"simple and Plain\" and \"It's a trap\", yes a Star Wars quote in this crap, and I hated it! The final thing I'm going to say in this paragraph is about the cheesy one -liners, because it feels like you're having a cringe attack when you hear them, they're so dull and the way they've been said is ghastly.\n\nOne of the main monstrosities of this film was the animation, Google it now because it looks like it was from a PlayStation 2 game and it was made in 2012! If the production history didn't scare you well the animation will because it's horrendous! Another thing about this film is that it's 100% dull, none of its interesting, if I told my brother to watch this he'll watch about 15 minutes of it and turn it off, it's that boring, I've sat through a few boring movies but this one is the worst. One of the reasons why this film is so boring is because it's really unfunny, I had more laughs out of Superbabies than this, and I think I laughed about once in 90 minutes, that makes me feel depressed. Another reason why this is so boring is the fact that the plot was so basic. I can say it in 9 words: Evil Nazis take over shop, heroes must fight them. That's the plot. I'll let you take some time to realize how poor it is. Atrociously bad. You may be thinking why I said Nazis and I'm going to tell you now; the evil organization is called Brand X and their characters and strategies are a strong resemblance to the Nazis, the evil woman whose name I can't remember is strangely like Hitler because she's good at speeches, has a very good manipulation strategy and back in 1945 Hitler was a handsome bloke apparently, and this evil woman was no exception, she was made to look good. Even her henchmen had slight German accents and were crazy, one of them reminded me of Joseph Goebbels, and not good who ever made this diabolical film. As I mentioned before the \"imaginative\" creators gave some really good names such as: Rex Dogtective! What a lousy and ridiculous name, even I could call the main character something better, for example: Jeff or Buster. You see a dog's name with a detective meaning I am better than these creators, but to be honest, it's not hard. On the same subject, in this \"film\" the lead role becomes a General? Because he starts to formulate plans like a general does but he's a detective? It's a bloody complicated movie in my head. One final reason why this film was bad is because it had really bad sex jokes in it; you may be thinking \"sex jokes in a kid's movie?\" This has been done before and as an example, Shrek has quite a few but not this bad. Again, these jokes make me cringe and question the world. There are a few other reasons why this film is bad but I don't want to milk it. So here's the final paragraph, the conclusion. I believe this film was a waste of time, money and effort. I've already explained why and I just want to get to the next movie because I really can't be bothered talking about this movie. I want to forget about it: 0.6/10."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lightbulb-77576",
        "review_rating": "10",
        "review_title": "the best movie ever.",
        "review_detailed_main": "The movie was amazing. the 3D animation was so detailed and good looking. the character designs were so amazing and the music and voice acting was good. and the plot was heartwarming and amazing. its so good that I wanted to jump off a building after this. its the best movie ever. this movie deserves a reward. the best movie in history is foodfight. 10/10 really this movie sucks lol."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "kaiserh-61402",
        "review_rating": "1",
        "review_title": "The most horrible, jaw dropping embarrassment.",
        "review_detailed_main": "if you ever decide to watch this, just don't. The plot is awful, there are characters that were never introduced that are shoved into the film and the ending made me want to poke my eyes with a pencil. They should have worked more on the animation itself, the introduction was only the good thing about it as the movement of the city was astonishing, but to the point where the rest of the movie was brain-dead, I can see now why people must have stolen unfinished assets from this film, because they must have watched it and thought this was absolutely pathetic. Away from the animation, you have...the plot(?), oh that's right, there is no plot. It's all just random characters with barely any purpose in the move crammed into one movie, the only real plot in this is the actual food fight near the end which is tiring and absolutely boring...\n\n1/10\n\nThis movie needs to be eradicated."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "connorasivill",
        "review_rating": "1",
        "review_title": "This movie is my religion",
        "review_detailed_main": "This movie is amazing . i love it so much my wife hates me and my parents disown me"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jasonbluegreen",
        "review_rating": "1",
        "review_title": "Spoilers: This movie is terrible. Oh, and something about a plot..?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "greatpumpkinrants",
        "review_rating": "1",
        "review_title": "This Movie Should Not Exist.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "hamishmonk",
        "review_rating": "1",
        "review_title": "What a terrible film",
        "review_detailed_main": "But you already know that, this film is bad in everything that it does. the voice acting, the humour, the animation, and the characters are all terrible, I would recommenced either not watching this movie or just seeing the jontron video about it, which is much funnier"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lorandgyorgy-96671",
        "review_rating": "1",
        "review_title": "If only the hard drives weren't stolen",
        "review_detailed_main": "Bad animation, horrid characters, creepy moments and designs, and a hunk of product placement and wasted talents."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "spudark",
        "review_rating": "2",
        "review_title": "depression",
        "review_detailed_main": "also known simply as depression, is a mental disorder characterized by at least two weeks of low mood that is present across most situations.[1] It is often accompanied by low self-esteem, loss of interest in normally enjoyable activities, low energy, and pain without a clear cause.[1] People may also occasionally have false beliefs or see or hear things that others cannot.[1] Some people have periods of depression separated by years in which they are normal while others nearly always have symptoms present.[2] Major depressive disorder can negatively affects a person's personal, work, or school life, as well as sleeping, eating habits, and general health.[1][2] Between 2–7% of adults with major depression die by suicide,[3] and up to 60% of people who die by suicide had depression or another mood disorder.[4]\n\nThe cause is believed to be a combination of genetic, environmental, and psychological factors.[1] Risk factors include a family history of the condition, major life changes, certain medications, chronic health problems, and substance abuse.[1][2] About 40% of the risk appears to be related to genetics.[2] The diagnosis of major depressive disorder is based on the person's reported experiences and a mental status examination.[5] There is no laboratory test for major depression.[2] Testing, however, may be done to rule out physical conditions that can cause similar symptoms.[5] Major depression should be differentiated from sadness which is a normal part of life and is less severe.[2] The United States Preventive Services Task Force (USPSTF) recommends screening for depression among those over the age 12,[6][7] while a prior Cochrane review found insufficient evidence for screening.[8"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "emc-26269",
        "review_rating": "1",
        "review_title": "I wish I could rate it a -10",
        "review_detailed_main": "I can't really classify this as a movie, it's more like...an experience of unholy and ungodly images. I've got to give them credit, this \"movie\" had ugly images and awkward movement ALL throughout! For this, I had SO MUCH FUN with this, just not at all for the indented reasons(?)!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Dexadecimal",
        "review_rating": "10",
        "review_title": "Shivers. Literal shivers.",
        "review_detailed_main": "Foodfight... what can I say? I got shivers watching it, shivers that made their way deep into my spine. I teared up several times, especially when Dex and Dan got married at the end. It was so unexpected yet pleasant, and, as a queer person, I really enjoyed that good representation. If anyone is planning on watching this, make sure to bring tissues.\n\nEmotional, captivating, interesting, easy to follow, perfect for date night, Marvel Cinematic Universe quality graphics, etc."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Miguels_MR",
        "review_rating": "1",
        "review_title": "Don't Watch",
        "review_detailed_main": "In case you haven't noticed, all of the other reviews giving this movie a good rating are being sarcastic, but I am going to be VERY honest with you. This is easily in the top 3 worst animated films ever. It is worse than The Emoji Movie and Norm Of The North. The animation is so bad that if you are watching this movie, be sure to have bleach next to you. The writing is absolutely horrid, and there is more product placement than The Emoji Movie! This is not an animated movie, it is a torture device. Never watch it or you will regret it. If you do decide to watch it, I recommend seeing it with your friends, because if you see it alone, the experience will be much worse. By the way, somebody uploaded the whole movie on YouTube, so don't waste your time paying for it. Watch it for free."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "hellofellowdogz",
        "review_rating": "",
        "review_title": "Just..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "teddycreamoney",
        "review_rating": "1",
        "review_title": "This is the FUNNIEST movie I have ever watched. In a bad way.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "nikozguri",
        "review_rating": "1",
        "review_title": "Larry Kasanoff, if i ever meet you, i'm gonna kick your ass!",
        "review_detailed_main": "there's no words to describe how atrocious \"Foodfight!\" is. i really gotta ask: what kinda drugs was Larry Kasanoff on when he made this thing? there's no way anybody in production of this movie looked at this and went \"Hell yeah! This looks amazing!\" oh my god! where to even start? the acting's ridiculously wooden, and that's really sad cause this movie had a great cast. i mean, Charlie Sheen's in this movie... why, Charlie? WHY?! and i could tell while suffering through this that he clearly knew this movie was a piece of s**t and he didn't even try. but still, why the hell was he in this?! same goes for Hilary Duff, Christopher Lloyd and Tim Curry. this movie made me lose faith in all these people, and that's really sad. also, the animation's just F***ING HIDEOUS! this looks like something straight outta a nightmare. i swear to god, the animation in this thing makes the animation in \"Swan Princess 4\" and \"5\" look like gold. everything in this movie looks like it was done in one-take, that's how terrible it is. it look awful! the backgrounds are s**t, the colors are awful and the characters look incredibly creepy! and the fact that this movie takes product placements to the extreme makes me cringe. i mean, you got Mr. Clean, Charlie the Tuna, The California Raisins, Vlasic the Shark, Hawaiian Punchy, Mrs. Butterworth etc. Kasanoff, what the f**k were you thinking? you know that this movie was targeted to KIDS, you asshole! this movie has NO respect to kids or adults or anybody! ya know what? i'm done talking about it. F**k \"Foodfight\", f**k Larry Kasanoff and f**k every human being who worked on this thing!\n\nthis is without a doubt 1 of the worst movies in movie history!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "bonniejoy-978-68763",
        "review_rating": "1",
        "review_title": "Everything is Awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "theblackscythe",
        "review_rating": "1",
        "review_title": "Does so bad it's good even apply here?",
        "review_detailed_main": "So bad it's good (SBiG) is a term commonly used to describe films which are entertaining despite being terrible, mainly through unintentional hilarity. I have enjoyed many films for being SBiG, for example \"The Room\" and \"Plan 9 From Outer Space\". However I would argue that Foodfight! is not even worthy of that dubious honour, and here's why; It is far too dull. The film reaches an almost mind-bending degree of total failure, to the point where it becomes hard to rationalise and understand, never mind mock.\n\nFoodfight!'s animation is probably it's most glaring flaw. It looks horrifying, absolutely unacceptable by the standards that were in place by 2012. Perhaps it would have been more tolerable in the early 2000's, provided the broken facial expressions and hideous textures were improved, however it is insulting to expect a paying audience in 2012 to tolerate this crap. There is little to talk about here, aside from how obviously ugly this film is.\n\nThe writing is honestly a greater insult to me than the animation. Almost every conversation or exchange of dialogue contains puns, bad puns. Puns constitute 80% or so of the film's limp and flaccid attempts at humour. These puns vary from bad, to eye-bulging in their failure, it is a pathetic defeat to see 5 PROFESSIONAL WRITERS produce this horrendous quality of humour. Aside the puns, the film's dialogue is disjointed and completely nonsensical, it becomes unintelligible noise after around 20 minutes or so. There are also some worryingly misogynistic and sexual elements at play in this 'script', for a film supposedly meant for young children. If I were to discover that this film was written in one sitting and was partially intended as a joke, I would totally believe it.\n\nThe audio quality also causes me to tilt my head in sheer bewilderment. Some lines, sometimes from the same character, are of drastically lower quality than others in terms of audio clarity. This problem gets worse towards the film's end, leading me to assume that the more expensive microphones were lost or sold later in the film's production, meaning cheaper mics had to used. The quality honestly reaches shocking levels of awfulness, and becomes near to unlistenable at points.\n\nOverall, this film fails in every notable area. It is hideous in every strata of it's existence, to a point in which it stops being funny and simply becomes sad to witness. This is the audio/visionary equivalent of having a sowing needle impaled through your toe, if that makes any sense."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "bradyhenson",
        "review_rating": "1",
        "review_title": "Everything is so terrible",
        "review_detailed_main": "It's a waste of time , nothing good came out of it with abysmal amount of horrendous things they got from alleyway is plain terrible to see the animation is terrible , the characters is terrible and everything is the movie is absolutely terrible there is no good part if the hard drives didn't get stolen in 2003 it would be good but for now it's the worst animated movie of all time"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "superracingriley",
        "review_rating": "1",
        "review_title": "A movie that exists....",
        "review_detailed_main": "Why does this have to exist? it's like mixing peanut butter with Vegemite, and that is a combination that shouldn't even mixed! the characters are boring and predictable and so is the plot, now I know why people dub it as one of the worst movies ever"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "conttel",
        "review_rating": "1",
        "review_title": "The best Movie Ever!",
        "review_detailed_main": "FoodFight's animation looks better than the real life. I don't know how the creators can do this masterpiece. Is the best movie who exist in this world. I enjoy it. I recommemd this movie ( just for time waste, of course )"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "hamler-51758",
        "review_rating": "10",
        "review_title": "AMAZING MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "FurphyHaruspex",
        "review_rating": "1",
        "review_title": "This movie is incriminating evidence..,",
        "review_detailed_main": "There are several industries that are connected to international money laundering. Particularly the laundering of public funds embezzled By political officials. Among those industries; real estate, fine art, antiquities, construction, and.... film making.\n\nThis movie was likely used as a vehicle to launder money using falsified production cost figures and licensing transactions.\n\nIt is the only rational explanation for this abomination."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "tommystans",
        "review_rating": "1",
        "review_title": "Appalling visuals and Cheap Humor",
        "review_detailed_main": "$65 million was wasted away on this piece of trash that you call a kids movie. Yet great classic CGI films like Toy Story has a budget of $30 million and that was their first film with some good CGI and its been praised by critics, for the record I am a Toy Story fan and its sequels along with other Pixar films have a more creative storyline and CGI then this film. The motion capturing is just awful, arm waving everywhere and CGI that is just poorly rendered.\n\nThe storyline is not brilliant and the humor in it is just cheap joke after cheap joke to get a laugh. Foodfight is one of the worst animated films of all time and it's up there with the Brazilian rip off films of Pixar."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Rsingactdan",
        "review_rating": "1",
        "review_title": "Awful movie",
        "review_detailed_main": "Words cannot expresses my hate for this movie. Let's see, the animation is crap, the writing is crap, the jokes are not funny, it looks like somebody eat crap and pooped out more crap. That's it, this movie if terrible. If you want to see a terrible movie, you've come to the right place. Words cannot expresses my hate for this movie. Let's see, the animation is crap. the writing is crap, the jokes are not funny, it looks like somebody eat crap and pooped out more crap. That's it, this movie if terrible. If you want to see a terrible movie, you've come to the right place. Words cannot expresses my hate for this movie. Let's see, the animation is crap, the writing is crap, the jokes are not funny, it looks like somebody eat crap and crap out more crap. That's it, this movie if terrible. If you want to see a terrible movie, you've come to the right place. Words cannot expresses my hate for this movie. Let's see, the animation is crap, the writing is crap, the jokes are not funny, it looks like somebody eat crap and crap out more crap.. That's it, this movie if terrible. If you want to see a terrible movie, you've come to the right place."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "alexmpw",
        "review_rating": "1",
        "review_title": "Oy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "AStormOfSwords13",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "Welp! I don't what to say. How on God's Beautiful Green Earth did this movie get made? Apparently, this cost $65 million to film, and you'd think for that amount of money the animation would at least look competent for 2013. Nope! Almost everything about this film is god-awful and should be recalled from existence. The characters were flatter than a fresh sheet of paper, the animation was like watching everyone dance like they were high, the plot was a clichéd eye-roll, etc. For example, how did Brand X even find out what who was fighting for and against them? Where did characters A, D, and Q come from and where do they go? Do any of us even care what goes on in the film? The \"deaths\" were pointless, so this movie was robbed of any emotion it might ever have had, although it probably still would have been devoid of any emotion whatsoever. Seriously, what did I just watch? And WHY was this made? Well, not my problem.\n\nThere was one positive take away from this movie, and that would be \"It's Our World\". It sounds lively enough to try and add some life to the movie, but frankly, It's Our World deserved better than this abysmal piece of excrement. That song was the only thing about the movie that actually felt like it was actually in its time period because the rest of it was dated to hell.\n\nSo yeah, Foodfight can fall off a cliff and into the depths of no longer existing."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ttk-50926",
        "review_rating": "1",
        "review_title": "It's complete crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "kornerpokett",
        "review_rating": "1",
        "review_title": "Get Ready to Cover Your Eyes",
        "review_detailed_main": "What did I just watch? Let me ask this again. What. Did. I. Just. Watch???\n\nThere is just so much \"NOPE!\" that this movie has to offer. All the jokes were bad and made no sense whatsoever. All of them. Subliminal Sensual humor? Left and right (Sometimes this movie takes it way too far. You have to see it for yourself). The characters? Ugly, ugly, UGLY. This movie's poor character design is so utterly lazy that it reaches from a level from mediocre to downright horrible! Oh yeah, did I mention that every character in this movie is poker-faced from start to finish throughout film? I mean, they can't make any facial expressions to express any emotion of any type whatsoever, so they have to play charades with their arms. It is that lazily-animated of a movie!\n\nAs far as to the plot, well..um\u0085sorry! Can't find one. Again, all the many many lame jokes that fell flat on the floor, the poorly-designed characters, and especially all the food brand mascots that were in this movie were so distracting that it hindered the whole conflict of the entire film. It's like watching a fan-made commercial in movie form.\n\nFood Fight literally wasted (let me put that in numerals, so get ready to face-palm) $65,000,000, and let me say that it did not go to good graphics. Not one penny went to anything that anyone can expect from a Michael Bay film. The entire budget went to pay for all our beloved famous food brand mascots to be part of some fan-based crossover. A crossover with such poor computer graphics that high school students taking 3D Animation class can create something much better and more enjoyable to watch than Food Fight.\n\nHonestly, I feel so sorry for all the actors that had to be in this movie. The fact that it took Kasanoff a whole entire decade to make this monstrosity was already is not worth any penny or any minute he spent on it. Food Fight was already just a bad idea from the beginning."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "CinderFall",
        "review_rating": "10",
        "review_title": "Have you seen Jesus?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jusrus32",
        "review_rating": "1",
        "review_title": "Garbage I was warned and I learned",
        "review_detailed_main": "I only gave this a one cause it doesn't give me any lower. Garbage sheer puke where do I even begin my critiquing of the worst movie I have ever seen in the history of crap. The animation could've been better by a first grader, I knew Charlie sheen regretted this movie by his monotone hatred hidden in his voice, and how about we point out this was a kids movie and I recall I lost count of sexual innuendos. The dog lets face it was a perv.this movie lacked story good animation good voice overs good graphics good music and my interest and the interest of anyone with true movie knowledge.\n\nI must say the people who made this movie are some cold farted itches and if they see this well quite frankly I don't give a spam what people think. I have never heard of someone get so offended from a movie until one of my friends had an experience while watching it and this movie was found completely offensive by a couple people. I actually was so furious by this movie myself I broke my TV with a bottle I threw it hard enough cracked the screen. I warn all who read this don't watch this or support this movie one bit spend your time watching Edward Scissorhands or something worth your time."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jamesbondpatrick",
        "review_rating": "1",
        "review_title": "😡😡😡😡😡😡",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "witty_pretty_lass",
        "review_rating": "1",
        "review_title": "Why this film is so terrible.",
        "review_detailed_main": "The film was originally scheduled for a Christmas 2003 theatrical release, however hard drives containing a lot of data for the film had been stolen in 2003. This put production back. The film was supposed be computer animated with use of \"squash and stretch\" to resemble Looney Tunes but was changed to motion capture. The film was given another release date of 2005. This didn't happen. The film was expected to be released again in 2007, but nothing came of it. Finally, in 2011, the film was auctioned for $2.5 million. It was finished as cheaply as possible. Fireman's Fund Insurance received the copyright to the film in 2012 and began releasing it. This film contains a lot of product placement. They were not paid money for the brand inclusions so they said it wasn't product placement. They were however expecting to receive money for cross-promotion. The thing that made me most uncomfortable about the film was the sexual innuendos and double entendres between the animal characters. The film seems aimed at children, but it's filled with sexual talk and product placement. The animation looks ugly and unfinished."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "SongbirdCtTheKitty",
        "review_rating": "1",
        "review_title": "Great. I've gone blind. Thanks Foodfight.",
        "review_detailed_main": "Oh....my God. Who would even- how did this- WHO?- *sigh* See, this is the reason I'm concerned for the future of humanity. Is this seriously what we're showing to kids nowadays? Whatever happened to Disney films? Why are we showing kids a film this ugly and fetish? Why? I may be 16, but throughout the entire flick I felt disrespected. The animation looked like it had no heart put into it. It's as if the producers were going: \"Screw it. We're gonna put no effort into it because we are lazy and need money for beer.\" The plot was so rushed and there was never a moment for the audience to comprehend what was happening. It feels broken as it's going. It would've been OK if they used certain scenes to get in more story. But instead of doing that, the producers just threw in some filler. Plus they added in puns that wouldn't even make a five year old giggle. Also, was Larry Kassonof...horny or something when he made this? Because this feels so fetish. I mean, the main villain tries to seduce the main protagonist. Also, the love interest is a furry. And there are so many innuendos. \"Yo hotcakes! Nice packaging! Want some chocolate frosting?\" \"I wanna scrub your bubbles!\" \"Dan's your man! Melts in your mouth, not in your hand!\" KASSONOF! THIS IS A CHILDREN'S MOVIE, YOU FREAKING PERVERT! DID YOU JUST MAKE THIS TO GET YOUR JOLLIES?! I tell you. It makes me sick. There is no respect. None. Nothing can be found. Foodfight. is the most heartless, perverted, scum-filled, unenjoyable, lazy \"film\" ever to hit the trash can. It hurts."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jackmargulies",
        "review_rating": "1",
        "review_title": "ñö",
        "review_detailed_main": "Just don't under any circumstances, you should be beaten for even acknowledging that this exists"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "rcondewood",
        "review_rating": "1",
        "review_title": "you obviously expected a boring movie",
        "review_detailed_main": "The movie itself isn't good, the jokes are bad and the animation is lazy, and the story just isn't worth it. the director of this film just doesn't try he just needs to be a bit more full of ideas. I'd just recommend you don't watch it at all"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "mynameistic",
        "review_rating": "1",
        "review_title": "unintentionally hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Randomgirl111",
        "review_rating": "1",
        "review_title": "How to make Foodfight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "samime_16",
        "review_rating": "10",
        "review_title": "Animation Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "demonllama42",
        "review_rating": "1",
        "review_title": "Perfect for a Bad Movie Night",
        "review_detailed_main": "This movie leaves you with nightmare fuel and questions.\n\nBoth aren't satisfying to have, but I digress."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "elicopperman",
        "review_rating": "2",
        "review_title": "Truly the Worst of the Worst or Nah?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Allosaurus26",
        "review_rating": "1",
        "review_title": "A stain on the face of animation.",
        "review_detailed_main": "Charlie Sheen and Wayne Brady find themselves casted in an hour and a half's worth of nightmarish animation, dirty humour, disgusting characters, and a story that in no ways even tries to make any sense in any way. Even sitting through this stain on the face of animation for 5 minutes will send the kids screaming under their seats while the parents question what in the name of Earth, Heaven, Hell and in between they were thinking when they made the mistake of renting it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "llaliotis-62030",
        "review_rating": "1",
        "review_title": "Help",
        "review_detailed_main": "This movie is brought forth from the lowest layer of hell, and used as punishment for those who disobeyed all ten commandments. Any mortal unlucky enough to bear witness to this is marked for a slow and agonizing death that permiates throughout their life, corroding the very soul like Dip from Roger Rabbit."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ernlrb-43835",
        "review_rating": "1",
        "review_title": "How do you make a movie this bad?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "keeganquinn-70200",
        "review_rating": "1",
        "review_title": "Just a reminder that this so called \"movie\" had a 65 million dollar budget",
        "review_detailed_main": "Terrible beyond words. The budget put into this film could have been used for anything else, but they chose this????"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Ltufano23",
        "review_rating": "1",
        "review_title": "The Most Ill Conceived 'Film' Ever Made",
        "review_detailed_main": "Originally conceived for a 2003 release, the concept of Foodfight seemed quite interesting and could have realistically been a fun kids film, at the time. Budgeted at around $65 million, many recognizable celebrities signed on to star in the film, including Charlie Sheen, Christopher Lloyd, and Hillary Duff. Whether true or an attempt to embezzle money, shortly before the films original release date, the hard drives containing the unfinished film were stolen from the production company. Though Secret Service joined in investigating the crime, no clues were ever uncovered and the film seemed lost forever.\n\nRestarting production in 2004, the animation style was pivoted from computer-animation to motion capture, in an attempt to save time and money. After failing to meet multiple new release dates or provide any substantial update, the film was auctioned off for $2.5 million in 2011, with the intent to release the film as quickly as possible. Attempting a rush job at polishing the half-baked movie, it was released as direct-to-video in 2012. This brief history feels necessary to better understand my review of the hour and a half animated monstrosity that is, Foodfight!\n\nFollowing an original mascot, Dex Dogtective (Charlie Sheen) attempts to solve the kidnapping of his girlfriend Sunshine (Hillary Duff), amidst a political takeover. Joined by their 'goofy' pal Daredevil Dan (Wayne Brady), they work to uncover the mystery unfolding within their store. The basic plot is littered with thinly veiled Nazi allegory, Brand X, and rehashed movie moments that will leave you scratching your head. Attempting a Toy Story-esque premise in a grocery store, the rules of this world make absolutely no sense and will have you questioning how things are happening, why things are happening, and even where things are happening.\n\nThe characters are one note and stale, with each becoming progressively more annoying as the story builds. Sounding like the first take, the voice acting almost feels like a practice version, with the actors not yet fully building the voices of their character. Even if they sounded better, every conversation is flooded with incredibly obvious sexual innuendo, which fails to come off as humorous or enticing. As basic as they come, the jokes are unbelievably unfunny, relying on repetitive visual gags and constant one liners which barely work as a punch line. Topped off with an ear splitting musical number, every moment of the film sounds as if it had been run through the auditory equivalent of a cheese grater.\n\nNeedless to say, the animation is atrocious. Akin to a rough render of an original Playstation game, the characters move in a constant jolted and disturbing manner. The background characters are soulless and copy & pasted scene to scene with only the branded mascots having any semblance of minimal effort. The layout of the town constantly changes, with no continuity being set, even within the same scene. The backgrounds are mostly blank, leaving all the exterior scenes looking as though they are taking place in a colorless void. Just looking at any frame of this movie tells you exactly how little care was put into it.\n\nWhile the film plays as a rough draft, it is worth noting that there is a small glimmer of what could have been, deep deep under all of the chaos. Had the film been produced by a reputable production company, this could have fit well with the other early 2000's animated films. With proper animation, rerecorded voice acting, and a few script edits, Foodfight might have been a reasonably decent film. That may seem like a lot of changes, but the basis for an interesting story is present and even got its chance to flourish in 2016's Sausage Party, to moderate success and praise.\n\nUnfortunately plagued with delays and controversies, Foodfight should have never seen the light of day in its completely unwatchable condition. This truly belongs in the Sewers of Cinema."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Hayden-86055",
        "review_rating": "1",
        "review_title": "Possibly the worst animated film ever!",
        "review_detailed_main": "Foodfight(!?) is not a good film, in fact it's possibly the furthest from \"good\" that you can be. I despised the awful animation quality, hated the voice acting and found basically every single joke either cringe inducing, unfunny or very sexually based. In fact at least 50% of the jokes are sexual...in a children's film as well!\n\nThe less said about the characters and plot the better. The film is tonally extremely uneven and can go from light and jolly to disjointed and creepy, the villains are a very unsubtle Germany during WW2 type villains. I can't really think of any positives to this film, but it was nice when it ended, I suppose.\n\n1/10: Will probably be studied int the future of what a film should not be. I can't believe their budget was 65 million dollars either."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "doubleg-29123",
        "review_rating": "10",
        "review_title": "Foodfight giveth, and Foodfight taketh away.",
        "review_detailed_main": "Foodfight is, in short, a phenomenal film. It is a beauty to behold for the mind, the ears, and the eye. It is both an original and a clever homage to some of history's greatest films. It is a pioneering achievement in the art of animation, one that shall never be surpassed. This film will draw you in, and it will touch you. It will make you feel a powerful range of emotions which you have never felt before. You will laugh, and you will cry. You will rage, and you will fear. You will be sick to your stomach. You will ultimately feel a satisfaction unmatched by that which you have already experienced.\n\nFoodfight is more than just a movie. It's a personal experience. The characters were realistic and beautifully written. I felt like I knew them. Nay; I KNEW them. While I was watching the film, I considered them my closest friends. Their struggles, although foreign, were also relatable. As I watched them overcome their fears and their prejudices in order to save the day, they taught me that I, too, could be the hero. It made me rethink everything I thought I knew about society, heroism, and morality.\n\nThis movie is truly a miracle. It cured my cancer, fed my starving children, and brought my grandmother back to life. Larry Kasanoff (the wonderful director of this film) is more than a filmmaker. He is a PROPHET. Mere words cannot express how thankful I am for the existence of his masterpiece. Thanks to Kasanoff, we finally have an answer to the age-old question. God is real, and He is Foodfight.\n\n∞/10 stars."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "anyehyeah",
        "review_rating": "1",
        "review_title": "No wonder it flopped",
        "review_detailed_main": "I am thankful for Cynical review for going through most of the pain.\n\nMessy plot, non-sensable jokes, inappropriate phrases and scenes, and just AWFAL ANIMATION.\n\nDragon Ball have even better animation than this one 😭 It does not deserve a star at all, I cant figure out how to just give a review."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Machiavelli84",
        "review_rating": "1",
        "review_title": "It's bad. If you need more details, by all means read on.",
        "review_detailed_main": "I first encountered this film through Nostalgia Critic's review of it. Curious how the whole thing felt, I went and looked for a full copy of it. What did I discover? It was just as bad as you would expect it to be.\n\nThe premise of the film is similar to scenarios like \"Toy Story\": whereas in that film, toys came to life when people left the room, in this film the mascots and logos (called \"ikes\") for food and household products come to life when the grocery store closes at night. In one such store, an Indiana Jones/McGruff mix named Dex Dogtective is about to ask raisin mascot Sunshine Goodness to marry him, when she disappears. Cut to six months later, when Lady X and her \"Brand X\" product enters the store, and promptly takes it over. Eventually Dex leads the other ikes in a revolt against her rule, leading to the climactic and eponymous conclusion.\n\nThe story of how this film was made is a long, amazing story of stolen hard drives and long delays, and the unfortunate truth is that it shows. The character models are a mix of tolerable and downright ugly to look at (especially most of the human or humanoid models), making the film difficult to view. The animation clearly relied on motion capture, perhaps to increase the speed of production...but whereas most animation studios know to rely on motion capture as a basis and not the sole source of animation, \"Foodfight!\" looks like it relied upon motion capture without any sign of correction by individual animators: there are times where characters will move about awkwardly, and in a few instances characters will gyrate and quiver like they're having a spaz attack. Much of the animation, in fact, looks like it was a rushed job, especially in regards to eye movement: many characters, when interacting with others, will rarely make eye contact and simply stare forward as their head moves about.\n\nThe script is equally embarrassing. Half of it is simply food puns (eg., \"Chipfaced.\"), while the other half are sex jokes that would embarrass most parents. Now granted, many films/TV shows aimed at children will have either jokes only adults would get, or jokes that only someone of an older age would appreciate, but usually they were subtle enough to keep parents in the room from feeling embarrassed; no one who watched \"Animaniacs\" as a kid understood why Yakko would look at the audience and go \"G'night everybody!\" until they were older. \"Foodfight!\", on the other hand, has adult jokes that should have increased the rating a bit higher. For example, Daredevil Dan, seeing a good looking ike, says, \"Hey, nice packaging! Want some chocolate frosting?\" The worst one, by far, however, is the line said by Lady X's general over the loudspeakers, when he says something to the effect of: \"I love a good violation...I love anything to do with violation...\" This isn't even mentioning the strange fascination Vlad Chocool has with Daredevil Dan.\n\nEven stranger is the use of real marketing icons alongside fake ones that are obviously referencing real ones (for example, a female toucan reporter that is clearly a reference to Toucan Sam). One wonders why the filmmakers didn't just forsake the idea of including real mascots and just make up spoof mascots. It might have avoided the criticism that this film is a giant product placement, and most of the main characters aren't real icons any way.\n\nVoice acting-wise, most of the actors at least *attempt* to do a good job. Part of the problem is just that the script is so bad, the characters so annoying, and the animation so ugly and terrible that I don't think they could have salvaged it. In the end, people who have sincere talent get wasted either in minor characters (like Chris Kattan as the extremely annoying Polar Penguin) or in wasteful roles (like Christopher Lloyd as Mr. Clipboard). In the end, the reason any actor agreed to do this has to amount to either the original concept was better, or (as so often happens) they needed the paycheck.\n\nThere really is nothing good to say about \"Foodfight!\" as a whole. The only reason I find myself watching it again from time to time is to examine just how bad it is. If you want to see it, don't expect the next animation masterpiece - see it KNOWING it's going to be terrible. It's one of those films that simply has to be experienced to be \"appreciated.\""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ajaymadala-67450",
        "review_rating": "1",
        "review_title": "This is awful",
        "review_detailed_main": "This movie made my friend go into a depressive state. I lost my sanity. Don't watch this"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jackass-26634",
        "review_rating": "1",
        "review_title": "Even Worse than The Emoji Movie",
        "review_detailed_main": "The Emoji Movie, was undoubtedly pretty awful and big waste of time, but with Foodfight!, I don't even know where to begin. Compared to Foodfight!, The Emoji Movie is a million times better and watchable than Foodfight!, which made me cringe and look away the whole time, but I couldn't even sleep after watching Foodfight!. The animation hurt my eyes so bad, I couldn't close them even after the movie ended. What humans on earth thought Foodfight! was a good idea?"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "daviddevilliers54",
        "review_rating": "1",
        "review_title": "Should be forgotten...",
        "review_detailed_main": "This movie, me cancer... My eyes will be haunted for the rest of my damn life because of this movie. If you want to cringe and never step outside of your own room again, then this is the movie for you (Seriously though, don't watch it!). So me and my friend heard about how awful this movie was so we actually decided to rent this movie and do a Try Not To Judge, Cringe, Curse and Hate Challenge. Throughout the movie, me and him were left speechless and uneasy.\n\nThe voice cast was a disappointment. High Budget actors!!! Christopher Lloyd, Charlie Sheen, Hilary Duff, Eva Longoria and Wayne Brady! I feel extremely sorry for them because from now on, whenever they go to a market they will see their embarrassment in their heads. Sorry guys.\n\nThe story is the worst part. It is a Wreck-It Ralph rip-off! When the market closes, the market comes to life and transforms into a city while items and foods come to life and turn into citizens! The new products that look like Nazis take over which turns into a food fight battle.\n\nNot aimed for adults OR children. Please, whatever you do, if you haven't seen it, don't try. I regret every second I have watched of it!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "kshihab-82620",
        "review_rating": "1",
        "review_title": "$65m ? Wtf?",
        "review_detailed_main": "I've seen YouTubers with 10k subscribers to make much more better animation than this with just 10$."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lindseynotes24",
        "review_rating": "1",
        "review_title": "THE Worst Animated Film Ever",
        "review_detailed_main": "What have I done?\n\nWhy did I watch this ungodly abominaton came from Hell? What is this? Words are not enough to describe this filth. I can't believe this \"movie\" actually exists. When I watched this first, I thought it was a horrible nightmare, but it just seems like it exists, because it's being reviewed and slaughtered a million times.\n\nI mean, 45M was spent on this as it seems. Of course, when you put some famous food mascots in your \"magnum opus\", you know it will be nothing but a huge sellout. But it's even worse. Everyone who worked on this are now traumatized for life. Children were alienated by this piece of crap.\n\nStory is beyond awfulness, acting is like a joke, one-liners are terrible and animation is one of the worst. I would say it's like they were made on Dreamcast, but that would be a disgrace to it. If it was a low budget B-grade movie, that would be excusable, but it's a 45M $ worth of crap! If you are very curious, please, please don't watch this."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "bomenorange",
        "review_rating": "1",
        "review_title": "just why !!!",
        "review_detailed_main": "This is the worst worst worst worst animated movie ever made. No human being has done enough bad things in their life that deserve to watch this ridiculous pointless worthless movie ever EVER. It's a torture just by watching it. it really hurt my eyes and brain, even my IQ dropped while i wasted an hour and a half from my lifetime on this FETISH movie. I hope they delete this movie once and for all, if they really want our species to survive. Again don't try and watch this movie, you might commit a suicide, i'm not kidding. Let us all pray that we don't face this film at anytime in our life. !!! GOD BLESS US !!!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "KrisRuz",
        "review_rating": "10",
        "review_title": "Got robbed at the oscars",
        "review_detailed_main": "Can't believe Toy Story 3 beat this masterpiece out at the Oscars. It's all politics."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "arielsiere",
        "review_rating": "1",
        "review_title": "Worst 2012 movie ever",
        "review_detailed_main": "Foodfight of should i call it trash death it is in my opinion the worst 2012 movie I have ever seen it has bad characters, lousy animation and the whole thing is a real cancer to watch thank i never watched or i'll never will or else it would waste my time and the villains are nothing but pathetic idiots."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "quinnwalton-43176",
        "review_rating": "1",
        "review_title": "It's Great, If You're Watching It To Make Fun Of It",
        "review_detailed_main": "This is the greatest movie of all time, only if you're watching it to make fun of it."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "shailakarimullah",
        "review_rating": "1",
        "review_title": "This Movie Was The Worst",
        "review_detailed_main": "This Ill-fated Movie Began Development And Production In 1992 By Kasanoff And By 1994-1999 There Was A 25 Million Investment With Natrual Image With Cash In Hand It Had A Budget Of 45-50 Million Dollars Back In 2000 It Was Announced by Larry Kasanoff That It Would Have An Exaaggerd Use Of Clear Animation With 80 Named Products And Their Associated Characters with A Planned 2003 Release However One Night In December 2002 The Entire Production Collapsed In Development And By Early 2003 KasaNoff Stated That Hard Drives Containing The Plot lines Were Reportedly Stolen In An Act Of Industrial Espionage And It Went down the drain But After Production Resumed In 2004 The Film Was Announced For A Late Fall 2005 Release But missed Despite Investing 100 Million Dollars And In 2007 Lionsgate Began Using Motion Capture To Create The Grosstique Ugliness Of Using Adult Jokes Finally In September 2011 FoodFight! had a starting bid of 2.5-65 Million with A 2012 Release in April 2012 it ends up being a horrible movie full of train-wrecked animation adult jokes and unlikable characters and this is the Room of All animation Movies Despite grossing $73,706 dollars On It's box office weekend And It Recieived Negative reviews and the ratings were 2.9 out of 10 on IMDb"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "Madison Avenue's dream project which turned into a nightmare.",
        "review_detailed_main": "How's this for an animated move? It takes place in a supermarket but after hours it comes alive with all the brand mascots coming to life and interacting with each other? You could have Charlie the Tuna talking to Mr. Clean! How amazing would that be?\n\nWell that was the question that Lawrence Kasanoff had for about 70 brand managers in his new sure to be epic movie \"Foodfight!\". They managed so wrangle $60 million for this and got the permission to use all these mascots for their new venture Threshold Digital, an offshoot of Threshold Entertainment that was going to be the new Pixar.\n\nExcept there was a difference between Pixar and Threshold. Pixar has managed to make hit after hit with very few commerical failures meanwhile Threshold has literally never put a product to air that has truly succeeded. This was not going to be good.\n\nThey failed to come out in 2007 and 2008 and then when the movie was half rendered, the hard drives were stolen in which Kasanoff called a case of \"industrial espionage\". So instead of restoring from a backup or something they simply moved to cheap motion capture. This was a bit of a mistake because now this was the only way the characters were able to show any kind of emotion. You'd think they'd use the face but beyond flapping their mouths, there was absolutely no plasticity given to them. Literally the characters have these cold dead eyes that never quite look in the direction they're supposed to.\n\nAnd if that wasn't bad enough the this whole thing sent Threshold into receivership and they needed to sell the movie off to the highest bidder. $2.5 million is what they got and that was the opening bid.\n\nBut what is so bad about it beyond the lack of proper expressions, sponsors that dropped out forcing them to change characters and people that never made a feature length movie before? The story really comes down to this: \"Buy commercial brands with mascots because buying store brands is like supporting the Nazis\". And no, I'm not kidding.\n\nThe main characters are all store brands or \"Ikes\" possibly taken from \"icons\". The evil Brand X representatives are dressed like Nazis. There's even a scene taken directly from Casablanca, a movie that Kasanoff compared Foodfight! to, in which Brand X starts to sing the Brand X loyalty song while the Ikes break into the Supermarket loyalty song which sounds suspiciously like \"La Marseillaise\" or the French national anthem. I'm not kidding. One of the most iconic scenes in Casablanca reduced to this. It's shameful.\n\nAnd that's it. The central message is colorful mascots are good, generic and store brands are bad. It's no wonder most of the sponsors dropped out when they found out what the story was about.\n\nWatch this for a laugh. For the longest time the DVD was only $5.00 so I would be surprised if it costs more now."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "RayKarago",
        "review_rating": "",
        "review_title": "Wow, just wow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "alvarochaves",
        "review_rating": "1",
        "review_title": "This is an abysmal mess!",
        "review_detailed_main": "All the characters are hateful, the story lacks development and sense, the CGI is in the abysmal Vídeo Brinquedo quality and the movie feels like the worst commercial for any product showed here!\n\nThe only foodfight we like to be envolved is the one which we throw tomatoes at the producers!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ragpap93",
        "review_rating": "2",
        "review_title": "This movie has passed its expiry date",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "katinthehat26",
        "review_rating": "2",
        "review_title": "Why was this MADE?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ethanroe",
        "review_rating": "1",
        "review_title": "I am in tears.",
        "review_detailed_main": "it was the greatest movie there will ever be. i have to thank Charlie sheen,Hillary duff, and Eva Longoria, and you can forgot the greatest actor ever. Christopher Lloyd. it is the greatest movie ever a must see. the dog was so cool and the black imitating squirrel or whatever that was, was incredible .and the cat was just awesome. my favorite scene was the part when they started showing everyones names in this black screen. and the animation. was the best part. it was just one of a kind. looked like the greatest animation since up or monsters inc. but this movie beats every movie ever. the shawshank redemption has some competition. i almost cried in the end. because my eyes hurted so bad. and i think i am amazed to be alive today.\n\nso i give it a 1 out of ten. its sucks. and i couldn't even watch it to the end. i went like 3 quarters of the movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jordankoelschcarlson",
        "review_rating": "10",
        "review_title": "The greatest animated movie of all time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "mgmprince",
        "review_rating": "1",
        "review_title": "This movie is even worse than The Little Prince",
        "review_detailed_main": "This movie was horrible! this is bad movie and about fighting food this is stupid!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "marcustitus-38018",
        "review_rating": "1",
        "review_title": "This abomination makes \"Ratatoing\" look like the Mona Lisa in comparison.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "kimcoxmonm",
        "review_rating": "1",
        "review_title": "Read MartinHafer's review.",
        "review_detailed_main": "I saw this movie a few years ago and it was one of the worst pieces of rubbish I have ever watched. I enjoyed Killer Clowns From Outer Space, Plan 9 From Outer Space, Attack of the Killer Donuts (and Tomatoes) and Santa Claus vs. The Devil much more. Those movies are trainwrecks but you laugh at the ludicrousness of them. This is a trainwreck caused by an earthquake that spawns a tsunami put out by a volcanic eruption!!!\n\nRead MartinHafer's review. Every single word he said was exactly what I thought of it. He is like my Hallmark card on this.\n\nIf I were the companies parodied, I would still sue but you can't collect blood from a turnip.\n\nCharlie was good in doses over the years (except Anger Management-unwatchable reincarnation of Charlie Harper). The Duff girls; they can't sing let alone act.\n\nI am no animation expert but a 10 year old could see the blatant mistakes and amateurish rendition. The next Pixar? Oooooooohhhh no! I've seen better work in a coloring book."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lewisporter",
        "review_rating": "1",
        "review_title": "READ BEFORE WATCHING THE FILM(and also context)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "armaanijaanilikeapaani",
        "review_rating": "1",
        "review_title": "\"Ladies and gentlemen, you can't make this up, I introduce you to Foodfight, the worst animated movie on the planet.\" - Jon Jafari",
        "review_detailed_main": "Jeez, where do I even start?\n\nThe animation is horrifying, this isn't a kids movie, this is a HORROR MOVIE. The characters are not interesting and the motion capture looks like it was made on Kinect.\n\nHow they managed to get by with that Oh so TERRIBLE script, and how they managed to keep the actors on with this movie is mindblowing... in a bad way.\n\nTerrible, just terrible."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "juancolon-59326",
        "review_rating": "1",
        "review_title": "What the...",
        "review_detailed_main": "Is this some kind of sick cruel joke? What kind of a movie is that? That's absurd, obnoxious, absolutely the worst movie that America has ever seen. But luckily for me I never watched it ever again. Who puts crossovers anyway out of companies is that we already know. I know it sounds crazy but why would I ever made this movie the first place, it's because the budget it it's for this film losing $45 billion of this bad pets, horrible movie ever. Who watches this piece of junk anyway. Did anyone see this! I don't think so. It's even worse than other bad movies including moving mockbusters. It is trash."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "tamiacarbins",
        "review_rating": "1",
        "review_title": "One of the worst movies!",
        "review_detailed_main": "I've seen it when I was very little, you saw me crying because the animations terrible, Why? You should hire Disney, Paramount, or Dreamworks to animate this better, Viva animation is a piece of garbage, this should get a 0/10!!! Foodfight's a animated disaster! No Oscars for this animated trash! This is bad, I never want to see this movie ever again! Because I prefer movies from Disney, Paramount, Pixar, and better animation companies, Viva animation is just as bad as Video Brinquedo! Just hire a better animation company next time, I wanted to see better movies, Don't watch it, -Tamia Viva Carbins:("
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "developtwittert",
        "review_rating": "1",
        "review_title": "Don't try to see this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jslobb",
        "review_rating": "9",
        "review_title": "It is not a bad movie",
        "review_detailed_main": "Is not really a bad movie it just you need to review it self because Look the sexuality is showing the incoming adults all of ya ll need to quit thinking that because I know it only paid 75,000 dollars but I do not care me and My cousins will watch this and I think I would get other op ions Just Shut up about your op ions and The movie has yalls favorite actors and Get the movie and they remade the quotes but they try to make it where kids will not get offended all the time but maybe is a bad movie but I think it is and a good movie it just the cgi animation are just like unofficial movies that came from net flex and all that"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "kumah-03891",
        "review_rating": "1",
        "review_title": "Bad, just bad.",
        "review_detailed_main": "This movie is one of the worst I've ever seen, making a bad move on that old 1990's Zelda game look like How to Train Your Dragon.\n\nThe character movements are awful, the voice acting is too mediocre and the animation, it's terrible.\n\nWatch Big Hero 6, The Incredibles, or something that's better than this crap instead."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "buckeyes-05926",
        "review_rating": "1",
        "review_title": "The films feels like a unfinished movie so one is trying to get money to finish.",
        "review_detailed_main": "Their no way this was anyone vision. Once I was about two-thirds of the way through this movie, I started drinking vodka straight from the bottle and my notes after that contain nothing but \"stop this\" written over and over in an unsteady hand. The plot is dumb and terrible, the only thing worse is the design of the world and characters. It feels like your watching something that is not finished. I think my thoughts on this movie can be best summed up by a note I wrote roughly around the time when the titular \"food fight\" started: \"I care nothing for these characters\". The only way this film could have been saved is if it had never existed. The only way the film could be improved from the broken state it's in is if it were shorter, so reviewers like me had their suffering shortened. I literally would not wish this film on my worst enemy. Watch at your own risk, and keep any sharp objects or firearms far, far away, lest you commit suicide rather than continue watching. I'm a professional at movies like this; do not try at home. For the love of whatever you consider holy, do not watch this movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "lillyjessen",
        "review_rating": "4",
        "review_title": "Definitely an adventure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "MrPaull0324",
        "review_rating": "1",
        "review_title": "This God-awful mess cost $65 million?!",
        "review_detailed_main": "This is basically the result of a bunch of inept Pixar wannabes coming together, believing that re-recreating Toy Story with food mascots instead of toys was a good idea. They were sadly mistaken, because after a troubled, ten-year production, this grotesque, half-finished, mind numbing, train wreck was the result.\n\nI could only bear to watch this film once and I hardly bothered to follow the story, but it goes something like this. In a grocery store named Marketropolis, food and product mascots come to life after closing time. An Indiana Jones rip off, Dex Dogtective (Charlie Sheen), is hired to solve a string of product murders. It turns out the Nazi-like Brand X, led by the beautiful but evil Lady X (Eva Longoria), is responsible and seeks to take over the store.\n\nClassic mascots like Mr. Clean, Charlie Tuna, and Aunt Jemima are present, but they contribute nothing to the plot. Their biggest moment is when they all get together for an incoherent song and dance routine that is as unimpressive and dull as the rest of the film. Half of the product mascots are just cheap and hideous imitations of real ones whose respective companies understandably didn't want involved in this mess.\n\nEven the remarkable voice cast, which most of the budget must have gone to, couldn't save this film, with talents such as Christopher Lloyd, Wayne Brady, and Hilary Duff involved. Charlie Sheen is the worst as he delivers a flat and tired sounding performance like he wants nothing to do with this film. The dialogue is very cheesy and bland, and involves constant food puns and jokes that fail miserably and will quickly grate on your nerves.\n\nThe entire film looks like every animator's worst nightmare. The animation was hideously rushed and half rendered. The characters' movements are stiff or disturbingly jerky and erratic; Mr. Clipboard moved like he had cerebral palsy. The final battle where the mascots fight Brand X is especially shoddy with disorientating close-ups, choppy editing, and ridiculous looking explosions and smoke effects. By comparison, Wreck It Ralph was released the same year, and surpassed this trash in every way. Even Toy Story, which came out in 1995, looked far better than this, and even had a smaller budget.\n\nThe character models are plain looking at best, and have blank, static expressions and lifeless gazes. The rest were just ugly, especially the human models. Lady X's true form looked like a deformed blobby mutant. I even shouted: \"What the hell is that?!\" when I saw the obese woman pushing her baby around in a shopping cart.\n\nFinally, the target audience for this is very difficult to guess. The film is full of barely ambiguous adult themes hidden under horrible lines, such as: \"I'm not the one who's going to be puppy whipped, you cold-farted itch!\". Lady X wears seductive outfits, makes obvious innuendos and suggestive movements. Mascot deaths are referred to as being \"rubbed out\". There's just too much adult humor for this to be a kid's movie.\n\nIt's no exaggeration to call this one of the worst (if not THE worst) animated movie of all time, at least commercially speaking since it only made a pathetic $75,000 against its grossly inflated budget. To me, it's not even so bad, it's good. It was just so bad, it's horrible, boring, and nauseating to watch."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "MovieVanguard",
        "review_rating": "1",
        "review_title": "Rotten to the Core",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "rebeccaajclarke",
        "review_rating": "1",
        "review_title": "Worst Food-Related CGI Animated Movie Ever",
        "review_detailed_main": "I find Foodfight (2012) is atrocious, Because of the bad/lazy writing, poorly voice acting, forgettable characters and horrendous computer generated imagery animation. Seriously the plot does not make any sense, the humour is not very clever at all. The graphics are very poorly aged. At least South Park: Bigger, Longer and Uncut (1999) have better and subtle jokes than this. Flushed Away (2006) has better characters than this. TUGS (1989) has better action and suspenseful scenes than this. Babar (1989) has better voice acting than this. Codename: Kids Next Door (2002) has more creative plots than this. Even Noddy's Toyland Adventures (1992) has better writing than this. I'm giving this animated movie a 1/10 and as the Comic Book Guy from The Simpsons (1989) would say \"The Worst CGI Movie Ever!\"."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "LW-08854",
        "review_rating": "2",
        "review_title": "Poorly made and confusing",
        "review_detailed_main": "This is a hard movie to really rate, so little effort seems to have gone into it, the production values are awful, the script made no sense to me. The opening is instantly annoying and loud, the animation bland and the characters mouths don't really match what they say. I don't really rate the cast and the premise of the movie is really dull, there's also too many characters. The puns ate quite terrible, Dog-ective. There's some strange spoofs and homages and references, too many characters including one called cheseal the weasle. At least it's short, about 90 minutes, there's no real quality here but nor is it a giant disappointment either. All in all just very poorly done and confusing, not much more to say. I don't even think kids will like this."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "d-98822",
        "review_rating": "10",
        "review_title": "wow",
        "review_detailed_main": "It cured my cancer and depression. Sussusususususususususususususususususususususuusususuusuuususususuususuuusuuusususuus among us among us fortnite minecraft balls."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "oghrorolaurina",
        "review_rating": "4",
        "review_title": "Meh",
        "review_detailed_main": "What's said that hasn't already been said? Foodfight is a movie that was released in 2012 and instantly became the most hated film of that year. Aww, how time flies The graphics of this movie is nothing to write home about, it's undeniably horrifying and crazy to imagine someone actually saw this and went \"yeah, that's good. Release it\" There's a part of me crying about the voice actors who received this role. They had no idea what they were getting into, lol. This film would have made up considerably if the narrative was good, or even passable per se. But it's so cliche, expected and unoriginal.\n\nAnd don't even get me started on the stereotypes of Brand X (more like Nazi) and how scary the visuals are. I'll be needing brain bleach for this one. A LOT of brain bleach.\n\nStill, the movie was entertaining for me. Is it for everyone? No. Is it horrifying? Yes. Does it have a good story line? Not really.\n\nBut it's just one of those films that's so blatantly shockingly unappealing that you can't help but be fascinated.\n\nNever would watch it again, though."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "MLKisOverrated",
        "review_rating": "2",
        "review_title": "I wish this movie was finished.",
        "review_detailed_main": "Foodfight is one of those movies that you think is absolute garbage from the outside until you read up on the backstory and realize that this is just an abomination of what could've been an absolute classic. The backstory of this movie being delayed and then being shelfed leading to this steaming pile of trash with good voice acting is truly one of a kind. Had this movie stuck with its original Looney Tunes esc 2D animation, this would've been a classic to watch with a group of friends, however I can only review this based on what we have in front of us.\n\nThis movie is a mix of very solid and absolute garbage. The animation is trash. There is no way to get around it, it was thrown together in two months. The voice acting is surprising very good with Charlie Sheen doing his classic thing of being a solid voice actor. To not spoil this movie as some people may actually want to watch and do as I did which was watch it and imagine it in Looney Tunes styling. I will say that the storyline is actually quite pleasant however the actual backstory is not too well explained leading to it being like a 4/10 story.\n\nI don't have too much to say about this movie other than that, just go ahead and skim through it on YT or something just to have the experience and the knowledge of its existence."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "psherman-71278",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "This is the worst movie I've ever seen in my entire life. This movie makes The Emoji Movie look like Toy Story in comparison. The animation in this movie is ugly. Don't ever watch this. I think I'm one of the only few people on this entire planet that actually saw this movie. If I could give this movie 0 stars, it wouldn't get any and I thought The Emoji Movie was bad. After watching this movie, I feel like I could sit through any movie. I'd rather watch Norm of the North or The Emoji Movie and both of those movies are awful. I watched this movie years ago and I will never forget how awful this movie is. Honestly, after watching this, I felt like I deserved a gold medal."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "joseignacioyootube",
        "review_rating": "1",
        "review_title": "Don't watch while eating food, It will make you vomit",
        "review_detailed_main": "This has to be one of the most horrendous movies ever made in history, most people that say is terrible only point at the awful animation, that's probably because they didn't watch it (lucky ones) but the reality is that is much worse than that.\n\nThe plot is just a complete nonsense is basically impossible to follow-up, the pace is just astonishingly poor, the animation is just horrible, vomitive and unwatchable, for 2012 looked horrible, even for the 2000s standards (intended launch) was just terrible. There is just nothing of value on this waste of time. If for some reason you planned to watch it. DON'T DO IT.\n\nStop placing this \"movie\" on the same level as Emoji Movie and Norm of the North, trust me when I say this is a lot worse, place this in the same level as Dragon Ball Evolution and Video Brinquedo movies."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "drwgsmom",
        "review_rating": "1",
        "review_title": "worst kids movie ever",
        "review_detailed_main": "This is the worst movie ever made. Why did Charlie sheen Hilary duff Wayne brady and Christopher Llyod star in this movie? This movie is filled with massive number of adult jokes for a kids movie. And i don't think this was supposed to be a kid's movie. Terrible animation bad acting and terrible movie. And doc brown why this movie why you do better movies out there but why this. The animation is creepy the story is ok! And also this needs to be the number 1 worst movie ever. Watch back to the future clue the movie and nobody better movies. Not trying to hate on Christopher Llyod i love him he's a good actor but this movie is trash and horrible. More for adults then kids. Dont watch this movie."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "theofchristian",
        "review_rating": "1",
        "review_title": "A ripoff of Indiana Jones & The Last Crusade",
        "review_detailed_main": "This garbage animated movie is shockingly a ripoff of Indiana Jones & The Last Crusade by several ways when you really think about it. The protagonist dog guy has clothes that are pretty identical to Indiana Jones. The plot is identical as both are I guess about saving a loved one from evil, and the enemies in FoodFight are similar to the Nazis and F. Y. I in Indiana Jones the enemies are Nazis. The biggest difference between the both is that obviously Indiana Jones is executed well the other on isn't, and now I can finally understand why someone supposedly stole the original.\n\nInconsistent story, bad characters, creepy and disturbing animation, stereotypes, over the top sexual innuendos that are very obvious to adults, and disturbing Nazi overtones is all I can say. Overall a 1/10."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "Maxyger756",
        "review_rating": "1",
        "review_title": "I want my sanity back",
        "review_detailed_main": "I am legit convinced that whoever made this atrocity was dared to make the worse film in history. Usually I rate a film based on (emotions, action, character development, voice acting, animation/effects, and enjoyability). But this film made new standards I didn't know existed and failed miserably at all of them\n\nI'm legit just flabbergasted how mind-bogglingly awful the animation is. It looks significantly worse than any CGI films 20 YEARS before this film. It has godly amount of animation errors visible that it just hurts your eyes. The worst part is, the budget was 65 million dollars. You can actually do a ton with that amount of money. For example Shrek had 60 million and became iconic, Over the hedge had around the same and some of the shots still look great. But how in earth did this cost 65 million dollars and there isn't even any expensive people in it at all. Did it cost like 30 mil to render it or something?\n\nIf I was ever put into a position of main-director for any animated film, I would try to make the settings unique and have great shots but never in the universe I would never think of making it happen inside A BOX IN A STORE. I'm confident any sane human will never think of that idea at all so that's why I think this was meant to be the worst film of all time\n\nWhy are there anthropomorphic animals, humans, humanized maple syrup, toys, monsters existing in the SAME VERSE. Like you could have at least make all of them animals or make only humans but it has characters from 200 types of stuff. All they do is move like people on steroids and have like 1 line. Also why were all the soldiers WW1 German soldiers, just why?\n\nNot to mention this film logically, physically, mathematically makes 0 sense. They have cartoon physics in an film with an animation that looks like it was animated by 5 year old's and rendered for 2 seconds. This effective combo makes for god awful sequences that makes you want to rip your eyes out\n\nWhy in god's name is a dog in love with a human with cat ears? He seems to be obsessed with the cat human so he will stay loyal right? Nope, he tries to kiss the main antagonist and dares to say \"I missed you\" when she sees the cat human. They're are all like \"Brand x is taking over\" but absolutely 0 scene of any of that is even mentioned here. Also can you guys put the weasel into eternity of rotting?\n\nAnd finally, the horrendous voice acting. I might say something very shocking but Dex and Dan's voice acting was actually not awful. Although Dex's voice actor sounded like he recorded all of it in 1 recording. He and Dan's character interactions was the ONLY part of the entire film that was just meh rather than pure torture. Anyway any of the voice actors besides them sound very high ngl. Probably because no one wanted to even make an appearance in the film that they had no other choice but to hired genuinely dumb people\n\nOverall this is leagues worse than any of my previous worst films. Like now I appreciate Illumination's catalogue or the Boss Baby because even if they were awful, was still miles ahead of whatever this was\n\nRating: 1.0/10, easily the worst film I've seen and I need to watch Kung Fu Panda 2 again to refresh my brain."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "w-21185",
        "review_rating": "1",
        "review_title": "If you can make a scam legit then this movie is it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "matteowrm",
        "review_rating": "10",
        "review_title": "A misunderstood modern masterpiece.",
        "review_detailed_main": "Anyone who can't appreciate animated films even after watching food fight must get their eyes and ears checked as they clearly don't understand this holy grail of a film they have just watched. Everything about This film is perfect! The acting, the cinematography, the plot all go together to create an unforgettable movie.\n\nFoodfight is the kind of movie that will change your life. A clear influence was another great movie called \"The Room\" which is often considered to be one of the greatest films of all time. Food fight took everything that made \"The Room\" great and put it into animation. It truly shows that cinema is an art form."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "fartp",
        "review_rating": "10",
        "review_title": "A great piece of cinema, a magnificent example of storytelling",
        "review_detailed_main": "I've heard so much told about Foodfight, so I finally decided to get the film, and find out if it really is all that it's cracked up to be... I must say, it's great. The plot is great, and the way it's told is amazing. The story is first summed up in a matter of minutes, about 15, to be more accurate, and then the rest of the film has characters telling the story through flashbacks and retelling. We hear just about every opinion about Dex Dogtective, apart from his own. The story is told after his death, and we see everything important that leads up to it, and only in the very end do we understand him, only then do we fully understand who he was, and what made him so. The ending also reveals one of the very most important things in any man or woman... one thing that everyone needs and knows of. I won't reveal it here, as it would almost be a crime to spoil the experience of this film to anyone. The acting is excellent; Daredevil Dan himself is stellar as Dex, and his impressive appearance, along with his commanding voice, makes the character a forceful sight, nay, experience. The characters are well-written and credible. The character of Dexter is probably the most well-rounded and perfectly built up I've seen in a movie, ever. The cinematography is excellent... the editing is great. I can't praise the angles, pans, zooms and transitions enough... it just has to be experienced. Now, for the one thing I can criticize in the film; the pacing. It's only two hours long, but it feels like much, much more. There were portions of the film where it felt like it didn't move at all. When there weren't great dialog or something equally as good in the film, it dragged terribly. There were too many scenes where the dialog seemed pointless, as well, I think. It didn't seem to be leading to anything. However, this criticism is so minor, due to the ending more than making up for it, that I still give this film a perfect score. I can't do anything but agree with its placing at the top of the top #250 films of all time, here on IMDb. As I'm writing this, it's #11. That's pretty much what it deserves, in my opinion. Not higher, not lower. Not the greatest film of all time(that pretty much still belongs to The Godfather, I think... at least, I haven't seen a better film than that, yet), but definitely far up there. I recommend this to any fan of film in general, and anyone who thinks they can understand it; it has a truly profound point that any man(and woman) should know of(preferably through seeing the film for themselves). Don't let the fact that it's old and black & white deter you from seeing this masterpiece. A true cinematic masterpiece, in every sense of the word. 10/10."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "snurkslover",
        "review_rating": "9",
        "review_title": "This movie didn't quite meet my expectations...",
        "review_detailed_main": "it EXCEEDED them!! Never before have I been so enthralled by a film, even as an adult. The clever use of well known brands made it familiar and yet the plot line stayed fresh. In fact, watching it made me crave some of my favourite foods.. I might have to go grab some Mrs. Butterworth right now!\n\nThe various vocal talents in this movie made it even more delightful than the product placement alone. Charlie Sheen deserves his own award for the passion that was conveyed through his canine counterpart. Hilary Duff and her sis also fondly brought me back to my Lizzie McGuire days, and Eva to my Desperate Housewives times. The nostalgia is overwhelming!!\n\nMy kids also thoroughly enjoyed this film. My 12 year old insisted I make him a Halloween costume to match that of Charlie Sheen's character. I myself went as Eva's character! Needless to say all seven children in our family will be receiving Foodfight in their stockings this Christmas, as well as some foods to reenact the climactic battle on Christmas day!! I sense a new family tradition being born!\n\nTo those of you who are skeptical, remember: never judge a movie until you've seen it at least five times. It gets better with each new viewing!!!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "tesswysko",
        "review_rating": "9",
        "review_title": "Great Product Placement!",
        "review_detailed_main": "I'm SERIOUSLY disappointed in the reviews this movie is getting! Yes, the cartooning isn't the best, but you have to think, it wasn't that bad for the time! I thought this was a fun, good - natured, wholesome, family - oriented movie! Which is probably why it got such bad ratings... People want nasty, dirty, foulness, even in their cartoons, I bet if I check Sausage Party, it will have a great rating, even though it wasn't good cartooning either, the plot was ridiculous, and it was just foul! Long story short... when I want to feel good about the world, I watch this movie and laugh and feel good!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "citrusmaster",
        "review_rating": "10",
        "review_title": "So bad it's good, and it's REALLY good.",
        "review_detailed_main": "This is a movie you watch to make fun of. This is a movie that you throw on after having a few too many beers with the mates. This is a movie that you will not forget, and that cannot be said about very many movies these days.\n\nGive it a watch, you won't regret it (unless you are sober)"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "jensengabriel",
        "review_rating": "10",
        "review_title": "Breathtaking, just breathtaking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "ABasedIndividual",
        "review_rating": "10",
        "review_title": "This Movie is the reason my life has been goid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "theycalledsaul",
        "review_rating": "10",
        "review_title": "earth shatteringly awesome",
        "review_detailed_main": "If it was even possible, the lovely, lovely people of this animation studio concocted a film more amazing than spy kids 4. Everything ranging from the plot, animation, characters, and action in this movie almost made me shed a tear. If i had a physical copy of this movie i would frame it, but to be honest with you, i pirated it off of some japanese website. Anyways. It's a clear cut statistic this film appears on multiple lists for the best film of all time and its pretty easy to see why. Obviously the other 10 star reviews on here would agree with me. To be honest, any person with common sense would watch this at least twice a year or something. It's important for life and your heart and soul."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "absidee-67780",
        "review_rating": "10",
        "review_title": "An Exceptional American Classic",
        "review_detailed_main": "This is the most jam-packed, eye-catching cinematic masterpiece. I find it to appeal to all age-groups. It's inspiring and memorable to me in my efforts to fund animation at Paramount. Whether you enjoy the movie or not, this film is thought-provoking and keeps you on your toes. Although, the animation is lacking at times, the storyline makes up for this gripping adventure. The vibrant and engrossing neighborhood adds to the investments of the characters with me. Some scenes made me teary eyed. It is unlike anything I have ever seen before, in the best way possible. Hoping for a reboot! I would love to work with Lawrence Kasanoff on a sequel!"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "rebekanessa",
        "review_rating": "10",
        "review_title": "ABSOLUTELY THE BEST!",
        "review_detailed_main": "Everyone that gave this masterpiece a 1 doesn't understand anything about this movie. It might seem like a poorly made movie but its goofiness is what makes it so amazing. First time I saw this as a kid, I thought it was a dream. This movie brings such good memories and nostalgia. Its style, the CGI, the weird sounds and textures, the characters and the whole story - its what helps this show stand out. Its a funny piece with a funny message and funny moments, and thats enough for a fun movie! Nowadays, animation is purely made in a certain way that you could merchandise the characters later on, and they don't even try to make them good. But this... this isn't that. In my opinion, this movie was made with love and humor, that the adults just wont get it. And they dont have to, because it wasn't made for them! Go enjoy your boring, unoriginal and predictable stories, leave this one for the people that enjoy watching something that you wont see in the cinema everyday. (or every year)"
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "liamhoughton-24307",
        "review_rating": "10",
        "review_title": "A True Masterpiece",
        "review_detailed_main": "While the film undoubtedly has its shortcomings, the critique seems rather harsh and fails to acknowledge any potential redeeming qualities the movie might possess. Here are some points that could serve as a counterargument to the scathing review:\n\n\"Food Fight!\" suffered from an infamous production history that undeniably impacted its final output. A significant portion of the film's budget was lost when crucial assets were stolen, leading to numerous delays and compromises. This context is essential in understanding why the movie turned out the way it did. While it's easy to criticize the animation and overall quality, acknowledging the production challenges provides a more balanced perspective.\n\nDespite the film's numerous flaws, \"Food Fight!\" managed to attract a star-studded voice cast, including Charlie Sheen, Wayne Brady, Eva Longoria, Hilary Duff, and Christopher Lloyd. This is no small feat, and it suggests that there was some level of ambition and effort put into the project. While the review claims the voice work is phoned-in, it's worth noting that these actors are professionals who have delivered quality performances in other projects. Perhaps the issues lie more with direction and production rather than the actors themselves.\n\nThe concept of \"Food Fight!\"-with brand mascots coming to life in a supermarket-is creative and had the potential to be engaging and entertaining. The idea of a supermarket turning into a city after hours is reminiscent of other successful animated concepts like \"Toy Story\" and \"Wreck-It Ralph.\" While the execution fell short, the ambition and creativity behind the concept deserve some recognition.\n\nThe review criticizes the movie for its inappropriate humor and lack of coherence. However, it's possible that some of the humor, though crude, might appeal to a specific audience. While it might not be suitable for very young children, older kids and even some adults might find certain aspects of the humor entertaining in a so-bad-it's-good kind of way. The film's bizarre and over-the-top nature can be seen as a unique form of entertainment.\n\n\"Food Fight!\" can be viewed as a learning experience for the animation industry. It highlights the importance of thorough planning, consistent production quality, and the impact of unforeseen setbacks. Analyzing where the film went wrong can provide valuable lessons for future projects, ensuring that such mistakes are not repeated.\n\nWhile \"Food Fight!\" is far from a masterpiece, it might not deserve the title of the worst animated film in history. Its troubled production, ambitious concept, and notable voice cast suggest that it was a project that aimed high but ultimately failed due to a series of unfortunate events. Instead of dismissing it entirely, it might be more constructive to view it as a case study in the challenges of animation production and the importance of perseverance in the face of adversity."
    },
    {
        "movie_id": "tt0249516",
        "movie_name": "Foodfight!",
        "movie_rating": "1.3",
        "review_username": "GravityLoudHouseLover1",
        "review_rating": "",
        "review_title": "A Garbage Movie",
        "review_detailed_main": ""
    }
]