[
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "noladel",
        "review_rating": "4",
        "review_title": "Why I Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "bluepink",
        "review_rating": "3",
        "review_title": "I only started enjoying it from halfway through.",
        "review_detailed_main": "Pros + I like the characters & where they're going with the storyline. + Cinematography, locations, clothes, cars.\n\nCons\nTakes too long for the main storyline to start. I ended up skipping loads. - Main basis of the storyline is good, but its a little too basic. They could have done more in the tineframe. - Too little dialogue. - Too many pointless sexual scenes."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "pagoni-gosia",
        "review_rating": "2",
        "review_title": "Lovely music, shallow plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "jannikpeveling",
        "review_rating": "1",
        "review_title": "As bad as you expect",
        "review_detailed_main": "I really don't know what I should say about this to be honest. I just wanted to know if it maybe can be a little, just little, bit better than the first two movies. Well.....no. I simply can't explain why there are already THREE movies and every one is so bad. And they are still making more and more for this \"franchise\". So do yourself, and everyone, a favor and DON'T watch it. I don't want to see more of this crap in the Netflix Top 10 for multiple weeks."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "nikki-jane",
        "review_rating": "1",
        "review_title": "Enough of these now please",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "akos_marik",
        "review_rating": "1",
        "review_title": "Worst movie series i've ever seen!",
        "review_detailed_main": "What was that? This was a music video just like the 2nd part. The dialogues had nothing to say, we haven't got any explanation. The actors had nothing to do with the movie, total difference from the book. I was really ashamed of me by wasting my time for this. Dont watch it or if you are so curious to then fast forward to see the end."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "crnthnt",
        "review_rating": "1",
        "review_title": "Wish there was a lower grade",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "janert63",
        "review_rating": "1",
        "review_title": "The best comedy of the year",
        "review_detailed_main": "Every time the next part of this launched on Netflix my girls and I got wine, snacks and good mood to watch it and discuss it. Worst bed scene ever, looks like movie makers now knotting about women, zero effort of acting, pointless plot but so addictive and of course we are waiting another episode of this drama/comedy. I hope the 4th part will be released soon, can't wait!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "jamalb-38618",
        "review_rating": "4",
        "review_title": "The book was better",
        "review_detailed_main": "In the book there were a lot of details that the film was missing. Then the ending was basically pointless. The book was better detailed and had more actions than the movie did. Massimo was supposed to show his dark side, but the film failed for that. I prefer the books than the movie."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "mkay93",
        "review_rating": "1",
        "review_title": "What the eff",
        "review_detailed_main": "This movie was the worst thing to exist in man kind. The random Tom and Jerry like scene of bodyguard chasing the friend. The whole movie was such a waste. Why doesn't it ever end, why is the story still the same ol bs continuing? And the ending .... I wanted to pull my hairs out man. Massimo didn't have enough screen time, I wanted to see dat arse."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "christina-73953",
        "review_rating": "",
        "review_title": "Really bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "pinksunshine-63091",
        "review_rating": "8",
        "review_title": "Why we are here...Massimo!",
        "review_detailed_main": "I'm reading these reviews and they are laughable. We don't watch this movie for a good storyline. We are here for Massimo. Period. I mean let's be real. Also, I read how offended people are about the \"#metoo\" stuff... this movie IS NOT REAL. AND, ok then why are you still watching? Right...Massimo. So sit back, pop some popcorn... stop complaining... and enjoy the real plot...Massimo. These terrible ratings aren't going to get a fourth movie made. More Mossimo, please!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Acheron150968",
        "review_rating": "6",
        "review_title": "Team Nacho",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Calicodreamin",
        "review_rating": "4",
        "review_title": "Torn between two steaming hunks",
        "review_detailed_main": "Somehow this third installation managed to have even less of a plot than its predecessors, but I also just don't care. Two steamy hunks was enough to keep me hooked through the whole film and don't kid yourself that you were watching for any other reason."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "quieria",
        "review_rating": "1",
        "review_title": "Total Waste of Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "sbrudro",
        "review_rating": "1",
        "review_title": "Worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "alidenver",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "Until when are we going to see bad acting, bad influence, false life, false love. Feeding the young men and women false views on how love is. And how things should be between a couple. Every time they come up with a new movie it's always about how things should be with two couple. Disgusting behavior, and I'm not surprised that this movie is from Netflix, waste of funding on a bad movie idea. They should have pulled the plug and got the sign from the first movie they made. Now they are going for a third and i hope not a forth one. Believe me these actors have no shame , it's all about the money, i wish there was a good message in these films. But zero."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "topliciand",
        "review_rating": "3",
        "review_title": "Yeah, it is a bad movie.",
        "review_detailed_main": "If you want to watch some good romance/erotic movies save your time and don't watch this one. There is no story to watch, no moments to make yourself not to cringe really bad, there is nothing. The only decent thing in this movie were the songs. I didn't expected it to be any better than the other one I can say but atleast I had more hopes for it. It is probably the last one of 365 days and it was just a really cringey movie that didn't make any sense. Very disappointed!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ccampbellnz",
        "review_rating": "4",
        "review_title": "It's bad but addictive",
        "review_detailed_main": "It's as bad as the first and second movie but it's also addictive. Bad acting and terrible plot which makes absolutely no sense. Its more about the R18 sex scenes and background music. Not going to lie, if they make another one, I'll probably watch it!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "raul_uk",
        "review_rating": "2",
        "review_title": "Worse",
        "review_detailed_main": "Even Adult entertainers can do better acting. If you subtract the pathetic fake intimate scenes, there is nothing to watch. Acting wise very poor, deliberately dragged and slow to push to next part."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "shirlone",
        "review_rating": "",
        "review_title": "don't bother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "chloe-bull",
        "review_rating": "10",
        "review_title": "So bad it's good.",
        "review_detailed_main": "If you enjoy reading really bad rom com books you get for free online - This movie is for you!\n\nHonestly so bad it makes me laugh at times.\n\nI've watched all 3 movies multiple times! Now I've brought the books.\n\nThere is a reason they keep making more of these movies, people are secretly watching them.\n\nMake an evening of it and watch the 365 movies with your partner.\n\nThe characters have great chemistry & will voluntarily watch a 4th movie to find out what happens next."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "helenroberts-99744",
        "review_rating": "7",
        "review_title": "So Nacho 🍑",
        "review_detailed_main": "I think it would be fair to assume that if you are watching this film, which is the 3rd in a series, you already know what you are getting and you aren't watching it for the exceptional storytelling or Oscar worthy acting.\n\nThis film is comprised of smut, views of Italy, and good looking men and sometimes that is what you want to watch, and if so this film hits the spot.\n\nIt is quite explicit for mainstream tv although I have noticed Italian tv dramas are much more explicit than British or American shows, so perhaps it is my cultural prudishness that made me surprised to see it. Anyway Nacho's peachy bottom was a very nice sight.\n\nThe acting is dire. They didn't have enough Dominico and Olga in it which is a shame as they are fun, and I don't really have any idea what was going on in the plot and am confused by the end but I am sure I will watch it again ;)"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "leenaalasfoor",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I gave it one star!... for the obvious reason .. gorgeous men with no acting ability whatsoever !.. and the beautiful locations and light direction !... other then that ... this movie is or whatever you want to call it is the worst I have I ever watched !.. even the sex scenes are not good !!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "tyanalashe-48451",
        "review_rating": "1",
        "review_title": "I wish I could give it a higher rating...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "cyaramichaels",
        "review_rating": "3",
        "review_title": "Disappointment of the year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "mildukas",
        "review_rating": "2",
        "review_title": "Did I say garage? I meant garbage.",
        "review_detailed_main": "I know sequels tend to have a tendency of getting worse. And it is not that I expected a lot out of this masterpiece to begin with, but... I am not sure where to begin with this one. And i solely watched it for fun purposes.\n\nThere was no real plot, nor anything. So many repetitive scenes that include eating, empty conversations, slow motion and smoking. And you know what else, which is the main focus of course. Everything seemed forced 3 times more than in previous ones.\n\nThe main actress is just horrible, no consistency in her acting whatsoever. Ofc, it will top Netflix charts, but I am sad that people are wasting money producing this kind of garbage."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "rkbxsucnr",
        "review_rating": "1",
        "review_title": "Press fast forward and you can make it alive!",
        "review_detailed_main": "As the previous two movies, I kept pressing forward every second minute, otherwise I would never forgive myself to dedicate to this the full screen time. This movie (and the others two as well) is painful to watch...From the story to the non-existent or super over \"acting\" (Michele Morone can thank God that at least he has looks!) At this point, I would just hire some porn actors, the result would be the same, maybe better. The storyplot (if we can call it so) is worse than any turkish telenovela which the Polish author probably got inspired by. It's a garbage and honestly, is Netflix still really wondering why they are loosing subscribers?"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Giannis2504",
        "review_rating": "1",
        "review_title": "Just see the good side,it cant get worse than THAT.Or can it?",
        "review_detailed_main": "I mean what do you expect...The actors are terrible,the dialogues are terrible the screenplay is awful and yet the make more money than they spend so they make and will make more movies that are perfect candidates for the Golden Raspberry Awards...I mean really if you take an actor of the adult industry and put him in this movies would perform better than them."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Polotovar",
        "review_rating": "2",
        "review_title": "Slightly better than the second one",
        "review_detailed_main": "The first film was weak. The second was downright bad. The third one, although not much better and again bad, was still a bit better than the second one. I found that there was less sex and a bit more story, which I'm glad for, because that's what the previous part failed to do, where every now and then there was sex without a deeper plot. Here at least there was a little bit of action, and of all the films, the ending was probably the best in my opinion. Of course, it's still bad. This whole series is bad for me, but I'm just saying that they didn't make it worse this time, they made it a little better. Probably a good ending for fans of the series, at least I hope there won't be another movie, and probably a very weak romance for the normal viewer. Without the previous films, all the worse. Unfortunately, to get anything out of it, you have to sit through the second part, which I think is especially bad compared to the first. To sum up. For me, a bad film that I would only recommend to the biggest fans of the franchise."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Italianstallion104",
        "review_rating": "2",
        "review_title": "Worst one of them all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "enockquason",
        "review_rating": "10",
        "review_title": "Lol",
        "review_detailed_main": "Why are people disappointed? I mean the first and second movie were garbage but there was enough steaminess(which were their only redeeming quality). This one was even more steamy than the second so what's y'alls problems? And don't you dare kid yourself that you watched it for any other reason!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "cgvsluis",
        "review_rating": "7",
        "review_title": "I have to say this one was the first to really disappoint in the 365 series...and mainly for the lack of ending!",
        "review_detailed_main": "I have been a faithful fan of the Polish 365 series and I have read books one and two (still waiting for book three to be translated into English... October 6th I believe?). This was the first of the three films to disappoint me. Don't get me wrong...there are gorgeous lush lavish sets, a great soundtrack, lots of eye candy for both sexes, and well plenty of sex. What it didn't have, that the other two films did, was a plot and an ending. Nothing really happens in this film. Laura doesn't choose between Massimo and Nacho, her fashion business is left midway, Olga doesn't get married and Massimo never deals with the loss of their child.\n\nI felt like the first film roughly stayed true to book one, the second film veered off of the book fairly significantly...but it was kind of understandable in that they only have so much time to tell the story. I guess what I am saying is the second film still worked...I do feel like Laura comes off better in the films than she does in the books.\n\nWe start film three almost where film two left off, Massimo threatens Nacho's family for what they have done, Laura recovers and goes to work in her fashion house, Olga continues to plan her wedding, things are strained between Massimo and Laura because they haven't talked about her time with Nacho or the loss of their baby. Laura and Olga behave like their usual drunk, petulant selves that are never satisfied and Laura continues to dream about having sex with Nacho. That is pretty much the entire film...no plot and no progression of the storyline.\n\nMovies generally aren't a choose your own ending story but this one really leaves you hanging and for that I can't give it the high ratings that I have given the other films. It was sexy yes, Massimo and Nacho are both still major hotties...but I do grow weary of watching these two girls drink like lushes and behave like small children.\n\nI still would like to see more smoldering content, so to be encouraging I am giving this film a 7 star rating."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "User1d",
        "review_rating": "1",
        "review_title": "Wow, just wow!",
        "review_detailed_main": "This has to be the worst film I've ever seen, Macho and Nacho being the noteable mentions.\n\nIt was number 1 on the Netflix charts when I watched, I can only guess there are a lot of 13 year old boys with sprained wrists today.\n\nDo yourself a favour and save yourself 2 hours which actually feels like 365 days."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ssghashmi",
        "review_rating": "1",
        "review_title": "WASTE OF YOUR BLOODY TIME AND MOOD.",
        "review_detailed_main": "Jeeezzz!!! Literally nothing happens except 'lunatic' sex. As if two drunk people are constantly having strokes or heart attacks! No storyline here, boo."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "rachelnstephens",
        "review_rating": "3",
        "review_title": "Laura is mean to Massimo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "zaro-65774",
        "review_rating": "1",
        "review_title": "I am starting to think that Netflix gets paid to promote this in the top 10",
        "review_detailed_main": "I genuinely couldn't make it past the minute 17 and 14 seconds exactly! The terrible acting should be the least of the concerns here! The biggest issue is the misleading messages such shows are trying to pass to the younger generations and the whole Stockholm syndrome shenanigans going on! Shame on Netflix!\n\nIf there was a 0 star I would have picked it for my rating!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "shahidayoub",
        "review_rating": "1",
        "review_title": "Most sh¡t movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "hadzsocial",
        "review_rating": "4",
        "review_title": "Michele Morrone was a better actor here, plot still cliché",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "areulostbbygyal",
        "review_rating": "1",
        "review_title": "this movie brought tears to my eyes (and not the good kind)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "pienpouwels",
        "review_rating": "5",
        "review_title": "Not as Bad as the Last One",
        "review_detailed_main": "I went into watching this movie with no expectations whatsoever and while I still cringed and laughed aloud out of ridiculousness on multiple occasions, The Next 365 Days wasn't actually 3-star bad (what I rated 365 Days: This Day). I know it's the bare minimum but I was pleasantly surprised to discover there was an actual storyline in this one. Unlike the second instalment. There weren't as many pointless scenes and there were a couple 3-minute windows in which the acting was actually passable. And some of the dialogue-bits were.......not that bad......keyword being 'some'. The movie in its entirety was still garbage, but it didn't smell as rotten as I was expecting?"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "junebugocjb",
        "review_rating": "10",
        "review_title": "Different but still wonderful",
        "review_detailed_main": "You know, it drives me crazy that people say such terrible things about this story and the actors. Netflix did a great job with the storyline and created a beautiful adaptation. The best they could from the original story by Bianca. Michele and Anna-Maria did a beautiful job portraying Massimo and Laura. Was there a lot of sex? Yes. But that is because the original story consists of a lot of intimate times. But there is a story of friendship and showing you would do anything for those you love. There is a love triangle and the battle of what the heart truly wants. If you knew this kind of story wasn't your cup of tea, then don't watch it. Discrediting the directors, writers, and actors is unkind just because you don't like the plot. It was beautifully done."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "asmithee23",
        "review_rating": "7",
        "review_title": "Better than this day but no 365 Days",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "maryplier",
        "review_rating": "1",
        "review_title": "Why do people keep putting this on the top 10 Netflix movies?",
        "review_detailed_main": "It's weird to see that all the 365 days movies have between 2 and 3 stars yet they keep coming up on the \"top 10\" every time one of them comes out. Maybe lonely girls are giving too much attention to this movie but please stop. There are already enough cringey productions lately. Stop hyping up the movie then complaining why there is another one. As long as you watch and talk about it there will always be a next one. If you are just there for the x scenes there are other websites that are made for that. Even there the acting and scenarios are better than this."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "nadkarnisumeet",
        "review_rating": "4",
        "review_title": "All for the views!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "takisgolfrte",
        "review_rating": "1",
        "review_title": "Just a p..rn with fancy Car",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "lcerbikova",
        "review_rating": "1",
        "review_title": "What have they done????",
        "review_detailed_main": "Why why why have you destroyed series like this 😕 😒 😐 I watched till midle and give up skiped to end and gues what disappointment.\n\nThe whole story have been destroyed and turned in to bad porn.. where is all mafia action ect nothing there and now Laura is with another man then she have dream about Nacho and masimo together??? What ???\n\nI think I'm done with this movie series now.. as the original story of Laura and Masimo doesent exist anymore."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "c-han-telle",
        "review_rating": "1",
        "review_title": "What book? Really hate it",
        "review_detailed_main": "I am really sorry, i don't see any similairity to the books. I absolutely hate the way they made the storyline. And i know that there's a lot of sex in the books, but seriously they only took that part of book and the rest is garbage. Two hours of my life i will never get back. Had enough of this story. And then the fact that Massimo has not enough shots, because that would have made the 2 hours a bit less terrible."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "andradaancaa",
        "review_rating": "1",
        "review_title": "Yuck",
        "review_detailed_main": "Worst porn ever. Thanks for literally nooooothing. It was horrible and boring. Nothing spicy. Actually some girls might think that it is fine being kidnapped by a bad guy who tells you \"are you lost baby girl\" because it sounds sexy. No, it isn't. Worst scenario ever ✨👉🏻👈🏻"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "lienwork",
        "review_rating": "1",
        "review_title": "The most shallow and worst movie I've ever seen 😂",
        "review_detailed_main": "Saw this on Netflix so decided to watch. As hard as I tried, couldn't finish it because it is really really bad 1) Use pretty actors and actresses and lots of sexual scenes to but the movie is really empty. Dialogue, story, everything is bad 2) Please if you try to make a movie, make it with some substance. Don't waste people's time like this.\n\nPLEASE DO NOT WATCH THIS MOVIE IF YOU DONT WANT TO FEEL LIKE YOU ARE WASTING YOUR TIME."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "wickedgara",
        "review_rating": "2",
        "review_title": "10 + 10 + 40 + 40= this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "lovetobememvw",
        "review_rating": "10",
        "review_title": "Your a fan or your not. Fan alert",
        "review_detailed_main": "I am hooked. Loved the first movie and the characters. Off course some things good have done better. But i forgive massimo and laura. They are to sexy to live after all. Second movie wasn't that good, well some parts where not. But nr 3 made my day. Love to see a part 4 for the real fans how want to see how it ends. And what she chooses."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "tanyauw",
        "review_rating": "7",
        "review_title": "Closure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ahmadkkagha",
        "review_rating": "1",
        "review_title": "Total waste of time worst movie i have ever seen in a while",
        "review_detailed_main": "Netflix as always trying to ruin the idea of a happy marriage, as well as masking the idea of cheating as an excuse for total freedom and fluctuations of feeling as if it is something pretty normal to cheat. And of course the bisexuality is all that matters for netflix productions. The laura character is very weak in every direction even the actress katarzyna lacks alot of skill they shouldn't have wasted most of the plot exploiting her character they could have focused more on massimo's perspective especially after losing his brother and awaited baby."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "facalsebastian",
        "review_rating": "3",
        "review_title": "They didn't understand what worked with the first movie.",
        "review_detailed_main": "They didn't understand what worked with the first movie. They fail to capture interest in the characters, eroticism and sex occur more in erotic fantasies than in reality, then you don't get the necessary intensity, the first one went on the other hand, almost forced was seduced, here it is pure drama, boring does not catch, little exciting, a failure."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "thomhouse",
        "review_rating": "2",
        "review_title": "More Massimo, Less Sedated Gardener Please",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "giedriusles",
        "review_rating": "3",
        "review_title": "Not a trilogy but a shadow",
        "review_detailed_main": "A fitting title for the entire three-film series. The film surpasses 50 shades of gray in terms of images, but considering the acting and the story... everything is done in a dismissive and completely unrelated way.. the only plus of the film is that those who like music can find something to like or enjoy the images shown in various halls, but nothing else. The film only shows what are the girls who are empty and promiscuous or most of them are empty."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Dannyboi94",
        "review_rating": "3",
        "review_title": "Better than the last, but still garbage",
        "review_detailed_main": "I don't know why we sane people keep doing this to ourselves, watching these poorly made soft p*** movies, with no character development, good stories or, for the most part, acting.\n\nThe Next 365 Days is as bad as the others, but it is slightly better than the horrific movie that came before. Pun intended. This movie at least has a story, while not that good. It is paced and shot very well, so I will give it that. The relationships that are supposed to be the drive of these movies, are completely unrealistic and poorly done. Why anyone would be interested in a crazy nut-job like Massimo is beyond me. The actor always looks angry... all the time. The two leads have no chemistry, they just growl at each other. This new love interest that was brought in the last movie, is more present here, and while their relationship is still bad, it is much better than the one with Massimo.\n\nLike the previous film, this movie is like 70% music, 10% sex and 20% everything else. I don't know why they don't just have a well done conversation between two characters, instead of playing some pointless song over the top of it. Are Netflix getting a ton of money from these songs?\n\nDespite all the bad, I will give one good pointer to Anna-Maria Sieklucka. For the most part, her acting has been, average, but there is a scene towards the end of the movie, where she breaks down, and I have to admit, her performance was really good. This shocked me, as I was not expecting it. So, well done to the actress for that.\n\nAgain, these series of movies, delivers another bad movie, that could have been good with good writers. The Next 365 Days, is not a good movie, and I doubt any future installments will be either.\n\n3/10 - only because of the cinematography and Anna's acting in the last 30 minuets or so."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "marjoriebrehl-40500",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "The only reason i don't say it's even worse than the previous one is because they finally had a slightly conversation after 3 movies!!!\n\nThe lack of ending is bothering Anyway, it's a bad bad bad bad movie. It's a shame."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "kitenasuttles",
        "review_rating": "2",
        "review_title": "No Romance Here",
        "review_detailed_main": "I am a die hard romantic and 365 days was shocking in its explicit content but I loved it regardless. People tend to forget that Mossimo had a NDE with Laura as his soul mate and that he isn't just some psycho kidnapper. The chemistry between the two was powerful in my opinion and both characters had room for character growth, so I was excited for the next two movies (I hadn't read the books so I had a completely different plot in mind apparently). Laura was shallow, bored, empty and unfulfilled. Mossimo was hard, lonely, sexually violent, and had the tragic loss of his father and by association his brother he needed to face. Unfortunately, I was not a fan of the second movie which addressed none of these issues in either character. Mossimo's refusal to open up and/or face his past and Laura's emotional and selfish immaturity stunted the romantic bond and natural evolution of their relationship. Instead of speaking to Mossimo our Laura threw out her phone and ran away from the situation entirely. I could overlook her misunderstanding considering Mossimo's lack of candor regarding his brother. Still, she was married and \"in love\" but somehow moved on immediately which destroyed the efforts of the 1st movie completely. Add in the lack of chemistry and romantic development between Laura and Nacho and the entire film felt wrong. Granted she didn't actually do anything wrong but a few uncomfortable to watch wet dreams and Nacho is hot so okay, not my favorite but whatever we have one more movie. Now we have finally reached the final film and I am left feeling empty and deceived. The entire relationship between Laura and Mossimo was a lie, everything that brought them together was meaningless. Laura's infidelity and narcissism, her total lack of growth or substance of character made me wonder why this story was ever written and adapted at all. Mossimo now has the loss of his child, his wife's with another man mentally and emotionally and eventually physically, and he never faced his previous issues and you have a time bomb. Laura is the wrong woman for him and for herself, she needs to be alone in my opinion. Laura acts as if she has some deep seated daddy issues I think and doesn't need to be in a relationship with anyone. The compulsory addition of the gay sexual fantasy was thrown in because Netflix can't make a SINGLE adaptation of anything without shoving every kind of political agenda down our throats. To say I am disappointed in this film is an understatement but the I am more disappointed in the author and Netflix's personal interference. P. S. Netflix grow up and stop destroying beloved classics like \"The Wheel of Time,\" and \"Persuasion\". I just can't find anything romantic or worth while in this series. Like the other reviewers say I suppose the author was okay with her series being nothing but smutt. The complete disregard for plot, character development, integrity, and romance by this author (and Netflix) makes this series another nothing burger and a travesty to the romance genre."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "JessCuhh",
        "review_rating": "4",
        "review_title": "Better than the second one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "myfavouritesgouda",
        "review_rating": "10",
        "review_title": "I love these movies",
        "review_detailed_main": "These movies are great and I enjoy the story but we need a fourth movie as the ending was bloody annoying. Laura and nacho definitely belong together, Massimo is just too much now and I just think their connect is so much better."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "enoladye",
        "review_rating": "",
        "review_title": "😡😡😡",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "katmarsha",
        "review_rating": "7",
        "review_title": "Not Bad Honestly...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "bribrix",
        "review_rating": "3",
        "review_title": "Yawnn",
        "review_detailed_main": "I think this one was the worst of all!! Boring i was skipping some the parts! I am disappointed 😞 the first 2 was okay but honestly i did not like this one hopefully the 4th one if it comes out is better!!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "about_cinema",
        "review_rating": "1",
        "review_title": "Just a Softcore Porno",
        "review_detailed_main": "Lol I didn't even see the film, but we all know these are just softcore porn films. Also I came for the comments and they are freaking hilarious! I love that IMDB allows anyone to post their opinion, so entertaining!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "andrewchristianjr",
        "review_rating": "5",
        "review_title": "GARBAGE IN ITS ENTIRETY.",
        "review_detailed_main": "It's obviously terrible and somehow the worst of the 3 movies released so far. Garbage in its entirety. This third installment just cemented it. This is another painful slog through plot-less, sex-heavy, mediocre bland-fest. Another netflix-spotify-pornhub colab."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ladyliliroche",
        "review_rating": "1",
        "review_title": "Is this a movie or some music visualizer",
        "review_detailed_main": "Granted I watched this for some background noise and only read briefly about the first movie... but what is even the plot?\n\nAppeared to be just pg sex scenes with lots of uncensored boobs and some ass shots. No moans or progressing in story through sex scene.\n\nMight as well watch some porn to get more action.\n\nThe music is pretty banging and basically takes over the movies. Maybe most of the budgets go to the music since the acting werent that great, nor is the scripts... and story..\n\nThe music is definitely louder than the conversation sometimes too lol. This is basically a very long music video."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "laramandic-91112",
        "review_rating": "1",
        "review_title": "Worst movie ever, don't waste your time",
        "review_detailed_main": "It's so bad, there is zero action. There will probably be the fifth part because it didn't end. I feel like I just watched an episode of some boring show and nothing really happened in it. Please do not waste your time. Can't think of a worse movie than this one.\n\n.........................................................................................................................................................................................................................................................................................................................................................................................................................................................................."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "drewvogelaar",
        "review_rating": "1",
        "review_title": "A Huge Waste of Time",
        "review_detailed_main": "365 Days: This Day was the worst film released this year. At least, that's what I thought. After watching its sequel, The Next 365 Days, I believe that's the worst film released this year. My only question is why. Why does Netflix keep greenlighting these films, and who is watching them? As a connoisseur of terrible cinema, the 365 days franchise is easily that; Terrible Cinema. I can't think of many films that are worse than these. This has to be the worst trilogy ever created.\n\nInstead of giving this film more credit than it deserves, I will say ten things more enjoyable.\n\n(1)There's more enjoyment sticking toothpicks between your toes and kicking the wall. (2)There is more enjoyment in watching Ohio State win in any sporting event. (3) There's more enjoyment in burning your hand on the stove. (4) There's more enjoyment in getting food poisoning. (5) There's more enjoyment in giving yourself paper cuts between all your toes and fingers. (6) There's more enjoyment in suffering electrocution. (7) There is more enjoyment in being on a cruise ship sinking in the ocean. (8) There's more enjoyment in cleaning a circus porta potty. (9) There's more enjoyment in touching an electric fence. (10) Finally, there's more enjoyment in having your essay deleted before you finish writing it. This movie is like a day at Chesaning High School. The higher-ups are clueless about everything and try to suck the fun out of every possible moment. A bunch of stupid nonsense. Oh yeah, the movie sucks as well.\n\n0/10 A complete waste of space and a contender for the worst film ever created."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "costadaki",
        "review_rating": "1",
        "review_title": "seriously no point in watching this",
        "review_detailed_main": "I really really try to understand why on earth would I spend almost 2 hours to see again the two main characters having sex over and over again. All three movies could easily be done in one porn video, and that would be the end of it. There was no need to make three movies with non-existent script, nonexistent dialogues, two really really bad actors and really really bad cast. The two female actors make it look so cheap as if it wasn't enough. Seriously, this is a waste of time and if you want to make yourselves a favor, watch something else. Spoiler alert: there is a sex scene almost every six or seven minutes. Like who wants to see so much porn in a movie?"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "GaelinW",
        "review_rating": "2",
        "review_title": "That went downhill fast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "panaluvr",
        "review_rating": "10",
        "review_title": "Unpopular Opinion, Obviously",
        "review_detailed_main": "I read all three books, and while they did veer slightly from from the books, the movies were great. Ppl keep saying the \"50 Shades\" movies were SOOOOOOO great, I couldn't watch more than 2 minutes (other than the 3 minutes Tyler Hoechlin was in the one). And the several dozen ppl I got to watch the 365 Trilogy all agree that they are a 10 Star Minimum. Really hoping they make a part 4 where Massimo k!lls Nacho and takes Laura back - by force - as he did in the first one. Full circle. Ppl need to realize this isn't \"50 Shades\". And the constant tearing down of ppl is childish and shows lack of class."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "d-dimitrova95",
        "review_rating": "6",
        "review_title": "Better read the books!",
        "review_detailed_main": "Honestly, its a little bit disappointing.\n\nI'm mostly talking about the second and the third movie. In the books, the storyline is so so rich, the characters are so bright and it thrills you. I think that, if they have sticked to the books more, it would have been better.\n\nFor the ones that have read the books, in the second one there were so meny things happening in their lives that I was wondering how could they possibly put everything in one movie, so instead they almost put nothing... (disappointing) And the third movie is a little closer to the books, but still...not quite."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "anakovcz",
        "review_rating": "1",
        "review_title": "Worst triology",
        "review_detailed_main": "I have to say, when I first watched the movie when it came out I like it, but as the 2nd and 3rd came out it got me thinking that actually this movie is literally about NOTHING. The story doesn't make any sanse, there is no point and it doesn't come to any point at the end. The 2nd movie is basically a porn with music in background, no dialogue, and even if there is one, it's meaningless. The 3rd one was as if the directors just thought: \"let's just get over with this, and do it as fast as possible.\" I don't know if the book is better or worst I didn't read it, but after seeing this I don't think I'll ever will. Which is pity, because maybe it is better, but thanks to this I don't think that many are interested in reading it."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "katrinachaney",
        "review_rating": "3",
        "review_title": "Things that could have been done better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "janda187",
        "review_rating": "1",
        "review_title": "What a waste of time",
        "review_detailed_main": "If I could rate it with -10 I will, no chemistry between actors, lousy acting, unnecessary sex scenes, very poor plot. And not to mention the soundtrack, a very poor quality pop. I really don't understand why netflix points to this kind of bad movies."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "jessicapappas-21150",
        "review_rating": "4",
        "review_title": "Ummmm....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "hania-16885",
        "review_rating": "3",
        "review_title": "Let's be honest the movie is trash but the spice is.. *French kiss*",
        "review_detailed_main": "If you're looking for a storyline and great dialogue then you're barking up at the wrong tree. But if you're looking for a sexy movie with a lot of spice then this is it.\n\n-Two sexy guys in love with this beautiful woman.\n\n-Every 10 mins there's a sexy scene.\n\n-Every 5 mins there's a new below par song is playing.\n\n-A few shots and nuggets for the lgbt community.\n\nIf you love clique erotica books then this film is for you. Don't watch it for the plot. Watch it for the \"plot\".\n\n1 star for the spice 1 star for the amazing scenery shots 1 star for the funny predictable lines it's almost laughable."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "maralynnbess",
        "review_rating": "1",
        "review_title": "Worst movie series ever",
        "review_detailed_main": "Literally just porn with a bad storyline. I just can't see any world where any person watches these movies and thinks they're actually good. It's honestly ridiculous that someone actually wrote this script and was like \"I think I'm going to make this into a movie\". I don't know how Netflix thought it would be a good idea to make three movies of this."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "zulaihaabbas",
        "review_rating": "1",
        "review_title": "It's just about a nympho that can't have enough sex so she cheated",
        "review_detailed_main": "Idk why but the heroin acting is the worst, her acting over the top but mostly, she does look like she was horny all the time. The way she's speaking, walking and even looking; she was just horny. Lmao\n\nuninteresting plot, no significant development, worst ending."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "spymeg",
        "review_rating": "4",
        "review_title": "Here's why you won't like it",
        "review_detailed_main": "We all know why this wasn't as good as the first two. Yes, the music was awful. If I wanted to watch cheesy music videos, I'd jump in my Deloreon and head back to 1988. Yes, Nacho (rip off from Better Call Saul) was annoying AF, like a hot, well built Italian puppy version of Prince Harry. Just following some brown haired chic with their tongue hanging out of their mouth wondering what they can do for her next, but without reciprocation. Yes, Massimo..well no, I can't say anything bad about him. He's a man. Knows what he wants and God bless him. Should be more like him out there.\n\nNo, we all know why this wasn't as good...just need someone to say it. The SEX SCENES SUCKED!!! In the first two, you knew and felt it. It's what drew us all in. Hot, raw and on point. Whew Lawd!! This one? You get poorly simulated movements with Lara and whichever dude she was dreaming about then Massimo and Nacho making out in one of them? So her dilemma is which dude do I choose, or do they choose them? I heard one of those old game show \"you're a loser\" sounds going off: wuah wuah wuaaaaaah. Step it up for what is hopefully the last year of these poor people's life! My God this is the NEXT365 and look at all they've been through. Another 365 should have them all in the hospital on BP meds and valium ... btw, didn't Lara have a heart condition? How is she able to smoke and party all night long with no repercussions. I leave you with that."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "jajacorbin",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Luv the simplicity of the movie yet it's still so captivating with such little dialogue. Brings you back to a time where the movie industry was just that simple beautiful art. No need of big budget and another green screen movie! Luv seeing the different angles of Poland and Italy actually makes me want to visit now. The chemistry between Laura & Massimo and Laura & Natcho is unquestionably so realistic they make you actually believe there's something there. Amazing acting!! With these big blockbuster Typical American movies that spend a fortune to make us believe what we see on the screen to the same typical American actors..... feels good to see something new something Fresh."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "klikzg",
        "review_rating": "6",
        "review_title": "European \"50 shades of Grey\", the 3rd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "rbmiddleton1979",
        "review_rating": "1",
        "review_title": "LOL!!! Y'all are funny...",
        "review_detailed_main": "I couldn't even finish watching the first movie, didn't even try to watch the second because I was completely confused as to why they made it and then cancel great shows, and I HAD NO CLUE they even made a 3rd film. LOL!! And yet, y'all are reviewing and criticizing this movie as if it was going to get better.\n\nY'all are mad but YOU STILL WATCHED IT! The same ones complaining are going to watch the 4th one if they come out with it. Y'all know the only reason y'all are watching it was because of the leads in this. These types of movies have no plot or anything. LIke I don't even remember the first one and couldn't even tell you what was going on so I think\n\nI stopped like 45 mins in or less cuz I couldn't take it anymore and you think I'm going to waste my time with the 2nd and 3rd installment like y'all did!! LOL!! Y'all know the definition of insanity, right? I have no clue what you all are expecting from this franchise!! LOL!! Alright I'm done... Carry on y'all but I just had to comment because the reviews are funny asf!! Smh."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Sharoofe",
        "review_rating": "1",
        "review_title": "Looool",
        "review_detailed_main": "This is the cringiest, stupidest movie you'll ever watch, it's comedic really lol everything about it is bad, from the dialogue, to the story to the acting lol it's just awful!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "nicksmoviereviews",
        "review_rating": "1",
        "review_title": "Why won't these days end?!",
        "review_detailed_main": "At this point in my life I question a bunch of things: what happens when we die, is there life out there? I can finally add another question to my list: why does Netflix keep making these movies?! It's obviously cheap and easy to make. But, like it's predecessor it does absolutely nothing to improve character development (there is none), or remain interesting. I don't know what the appeal is of this series anymore. It's not sexy, if you're looking for that there's superior content on the internet. There's no story, you'll find a more compelling one in The Room (hi mark!), and not a single character that is even remotely realistic."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "All three 365 Days films have now made IMDB's Bottom 100 List...now THAT'S an achievement!",
        "review_detailed_main": "The first movie in the trilogy, \"365 Days\" had one of the worst plots imaginable. In it, a mobster kidnaps a woman and repeatedly rapes her...and ultimately she falls in love with him and agrees to stay. The movie was HIGHLY offensive and I wasn't surprised when the film ended up on IMDB's infamous Bottom 100 List...because it was not only offensive but very badly made. A second film, \"365 Days: This Day\" followed...and I could barely bring myself to watch it as the first one was THAT bad...but I did and it was a bit better...earning a 2. But now that the third film, \"The Next 365 Days\" has made the Bottom 100 List, I am going to watch it, as I have been trying to see as many films from this ignoble list as I can....and I didn't envy having to see this one.\n\nSo is it as bad as they say? Yep. It's ineptly made, ineptly acted and is just a skin flick...though you'd do better just watching online porn. A terrible film and a terrible waste of my time...and brain! Can you give a movie a ZERO or a NEGATIVE number? No...so I am stuck just giving it a 1...like nearly every other review!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "agharib-64673",
        "review_rating": "1",
        "review_title": "That's the worst movie ever",
        "review_detailed_main": "I think i've seen a lot but this is the worst ever,there is no story,no acting,nothing.i think also no director there.just nudty.i hope not to see this poor thing again.people must have some effort to mak any good in here m it is too shame."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "RBree",
        "review_rating": "2",
        "review_title": "Who needs a script..",
        "review_detailed_main": "This series has progressively gotten worse with each movie. The first was fairly enjoyable, whereas the second began the downfall. This third one though- complete trash. I struggled to finish it. There is hardly any script any no real plot.. The characters are attractive and that's the whole movie. Who needs character development, anyway? Story line? Nahh!\n\nSo when you take the script and plot away, but have attractive people what else are you to do? Sex of course! At this rate that seems to be the movie's only purpose. Push the boundaries to get as close to pornography without actually becoming porn.. And I'm no prude- but when that's all the film has to offer you know it's junk.\n\nIt does have an occasional good song though."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "H3r3zmstuf",
        "review_rating": "4",
        "review_title": "They've almost completely lost me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "shaluadam",
        "review_rating": "2",
        "review_title": "Porn not Cinema",
        "review_detailed_main": "It's just a few clips from the Adult industry passed as a Hollywood movie.\n\nCould have used the scenes from Italy and Mediterranean better than showing just in connected sleaze in the script Not at all a mature content."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "memoirabilia",
        "review_rating": "10",
        "review_title": "A Modern Exposé of Beauty and the Beast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "mallykimmel",
        "review_rating": "6",
        "review_title": "Awww why they changed the story!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Thanos_Alfie",
        "review_rating": "1",
        "review_title": "Really bad...",
        "review_detailed_main": "\"The Next 365 Days\" is a Drama - Romance movie and the final chapter in the \"365 Days\" trilogy, in which we watch the disturbing saga of Laura and Massimo, and it's a painful watch from start to finish.\n\nSince I had watched the two previous movies of the franchise, I didn't expect something good or even something better than what I watched in the two previous movies. I was mentally prepared for this movie so, I wasn't disappointed by it. The plot did nothing to evolve or resolve the troubling dynamics between the main characters and it followed the same pattern as the previous two movies. The movie dragged on with repetitive and nonsensical drama, attempting to create tension without ever addressing the actual issues. There's no growth, no substance and no actual acting while the movie's attempts at \"romance\" are hollow, and the narrative felt like it's recycling the same tired plot points over and over again. In conclusion, I have to say that \"The Next 365 Days\" is a disappointing conclusion and I don't recommend neither this one nor any previous movie of the franchise."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "shamsabasheer",
        "review_rating": "1",
        "review_title": "They should've stopped it in the first movie",
        "review_detailed_main": "One of the worst worst movies ive watched recently..yeah a bit better than the 2nd movie.. This movie is such a waste of time.pls dont watch it.save yourself some time."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ssssaaarrrr",
        "review_rating": "1",
        "review_title": "JUST DON'T WATCH IT BESTIE. Y'all thank me later.",
        "review_detailed_main": "Let me start by saying that it felt like watching a cheap musical. For every 2 minutes of dialogue there were 6 of bad music in the background with non-sense action. The actors play was really really bad. They f up the whole story, and went really far from the story at the beginning that we all loved (first movie). They should've end this series with the first movie. I have read better stories on Episode (watpad) when I was younger to be honest. Do yourself a favor and don't watch it ! This movie felt like watching cheap p***n. They even put a scene in, where Masimo and Nacho are making out. I support LGBTQ, but in this situation, and in this storyline.. I am sorry but what?! I could have come out with a better script. I just want my time, that I lost watching this bulls**t, back. If I could give it a 0, I would. But I can't so I'm giving it a 1. I could not be more disappointed.\n\nPERIOD !"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ppfjfcnpz",
        "review_rating": "2",
        "review_title": "I just can't anymore",
        "review_detailed_main": "It's ruined now as it's just another sad hack job where the woman is an unfaithful _ _ _ _ _not going to say but it has a w and an e lol...but when can they make a plot that makes sense as the dude basically catfished and deceived her and fell in love himself and she can't put that together because he said SORRY...I mean he lied straight from the beginning when they disguised him as a gardener and she still falls in love with him...can't no one really can believe this bull...man I really like the first 2 but this one is way in left field...so sad as I won't watch a 4th hack job as the third one was."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "IamTai35",
        "review_rating": "4",
        "review_title": "Loved the first two...",
        "review_detailed_main": "I really enjoyed the first two, but I found this one to be boring and the acting was worse for some reason. I was really looking forward to some real feuding because of what went down in the second film, but didn't really get that. I hope the fourth picks back up."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "r96sk",
        "review_rating": "2",
        "review_title": "They remain pointless in their existence and very much overstay their welcome",
        "review_detailed_main": "In a word... boring?\n\nThese '365 Days' film are many a thing, but boring they are usually not - at least in the traditional sense. 'The Next 365 Days' kinda is, especially the last 30-40 minutes. Across the whole run time, I think there's less sex than usual - that's not to say there isn't sex, there's plenty, but it seemed slightly less constant.\n\nThe only pluses, albeit very minor ones, I have are basically the same as before: it uses decent music and has some solid shots spattered in there. They remain pointless in their existence and very much overstay their welcome, yet I kinda couldn't not watch them.\n\nWhat are the odds on more sequels? There is no reason to continue the 'story', yet that hasn't exactly stopped Netflix before... has it? This one does end with something that feels like a final conclusion though, with no cliffhanger in sight, so we'll see."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "The Next 365 Days",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "tomilipin",
        "review_rating": "1",
        "review_title": "Nothing interesting",
        "review_detailed_main": "I'm truly surprised how little substance this movie has. Apart from the sex and scenery scenes there is very little action. Oh, and a lot of swearing in Polish. It's just another dream-come-true story of luxurious living with a handsome and wealthy mafia boss. Heard that women watch it for the erotic parts, just like in the case of the Grey movies.\n\nThe story is predictable, the acting is acceptable and the music score can really be appreciated. All the pieces fit well with the picture. Surely, there are some annoying characters and unnecessary parts. As a result, the whole story could be squeezed in about 30 minutes time span.\n\nThe movie made my wife horny, so yeah... it does work after all."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "qnwbjctvc",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "Great addition. Kind of a a weird series but equally interesting and entertaining. Would recommend watching at least once. Not for kids though because it contains a lot of bad content kids shouldn't see."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "dineshm00",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "Of all the pointless and absurd movies I've watched, this one takes the top spot. It's supposed to be a love story, but it fails miserably. By the end, it's still unclear whether the main characters end up together or not. The plot is confusing and poorly developed, leaving you with more questions than answers. Instead of wrapping things up, it feels like the film just stops abruptly. This lack of resolution makes the whole experience frustrating and unsatisfying. Overall, it's a complete waste of time and fails to deliver any meaningful or coherent storyline. The characters lack depth and their relationships are underdeveloped, which only adds to the confusion."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ju-ladeira",
        "review_rating": "2",
        "review_title": "It's just porn with a mafia plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "kosmasp",
        "review_rating": "2",
        "review_title": "I did survive",
        "review_detailed_main": "And when I say I ... I mean a character in this. The main character one could say. And also I am talking about the first movie and the second one ... and the cliffhangers they had. Of course I reckon those who have read the books might have known that already. I did not even know there existed books ... at least not when I first saw the ... first movie.\n\nBack then the movie was notorious - infamous even, for its sex scenes. Nudity is one thing, but the first movie was borderline porn. As some pointed out back then, there were even frames that were showing ... more than others. Which began with an oral scene on a plane. If that wet your appetite (no pun intended), by all means be my guest and watch the first movie. I reckon it was the best one, with a beauty and the beast meets 50 shades of Grey thing.\n\nOf course it ended on a note where we didn't know what would happen with our female lead ... something that the second movie did too. Damn those movies should be called Die Hard ... will the third one end on a cliffhanger too? Or will it have a final resolution ... to bring it home? No pun intended.\n\nOne thing is for sure: please stop complaining about these movies after you've seen them - and then telling everyone they should stop making them. The more you watch, the likelier it is that there will be more of this ... although I am not even sure if there is a fourth book? Not that this would stop anyone from making another movie - they are succesful, no matter what the rating says here. And I am proof of that too.\n\nI do watch a lot though, so what is your excuse? The nudity? The being able to talk about it after? Maybe you just like to watch machos doing their thing ... a woman playing many sides ... but still being cliche as ... well the f word that is happening a lot here too! Even though the doctor apparently is saying not to have intercourse ... well I guess if you are horny ... but what really makes her wet? By the way if you feel uncomfortable reading what I am writing, wait til you see what is in the movie.\n\nNot as explicit as the first one, but still a lot of naked bodies rubbing and pushing and pumping and ... well you get the picture - no pun intended. The story may be the weakest of them all, but at least it does concentrate on the three main characters we established ... even the (hot) mother is being sidetracked.\n\nThis could be the end - but as a character says: she will do what she wants to do - it's up to her (no pun or innuendo intended)"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "johnofgreecehair",
        "review_rating": "1",
        "review_title": "excess",
        "review_detailed_main": "While watching this particular part of the 3 movies, scenes while they having sex they over excess with their face emotions, I think having sex is not as excess as they show here also the life they present they do or have is not realistic And the guy morrone he is always so disappointed we never watched him smiling makes the movie so depressing ."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "topsi91",
        "review_rating": "1",
        "review_title": "The worst film ever",
        "review_detailed_main": "This is not only the worst of all 3, but it's the worst film ever or at least up there. It's so terrible. It has no story line, it looks like a bad music video, have almost no dialogues.. the ending is terrible as well. I expected it to be bad, but I didn't expect it to be THAT bad... the se*ual scenes are not there, it's all a stupid fantasies. One star is too generous. I can't believe they ruined it this way. I know it's supposed to be a rip off the 50 shades, but this trashy thing makes 50 shades look so much better. I don't know why netflix believe that making film into a music video is a good idea. It's atrocious. I do not reccomand at all!"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "tedicvetkov",
        "review_rating": "1",
        "review_title": "Netflix WHY?",
        "review_detailed_main": "Ok, the music is fine ... but the story, the actor game and everything is soooooo sooooo, soooo baad ... idk is there a worst movie in the world ... only sex,sex,sex, no story,sex,sex,no story , a little bit gay , sex,sex, and \"Are you back, baby girl?\" Seriously Netflix ...."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "artistsara",
        "review_rating": "2",
        "review_title": "Really bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "xafogo-38611",
        "review_rating": "1",
        "review_title": "I expect nothing and I'm still let down",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "annall",
        "review_rating": "9",
        "review_title": "Better Than This Day",
        "review_detailed_main": "I loved 365 Days, I liked 365 This Day but I found The Next 365 Days almost as good as the first. The viewer will see the strengths and weakness of the three main characters, Laura, Massimo and Nacho. I would have given this movie 10 starts but I detested the ending (very upsetting if you are a fan). I finished both books and am awaiting the third. The books are totally different than the movies and a whole lot more raunchier. Once I receive the third book, I am looking forward to a different ending."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "danagherghe-67925",
        "review_rating": "1",
        "review_title": "A waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "germanbabysangel",
        "review_rating": "1",
        "review_title": "In Shock!!",
        "review_detailed_main": "At least 50Shades followed their books.. I cant believe you would end the movie like that like and there was so much more in the book. At least have a part 1 and 2 if you was going to end the movie the way you did. For people who didnt read the book you left so much out. Like Laura ending up leaving her husband to be with Nacho, BBF getting married and having a child. Laura is prego again and it's Nacho's! The cliffhanger of her and hubby on the beach was horrible. I believe somethings needed to be cut what to place in.. but everyone was truly looking for that happy ending for Laura after all the crap she has been through shot twice she deserves to have some type of life and with Massimo was not it! The disappointment is hella real."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "lauralicia",
        "review_rating": "1",
        "review_title": "Wasn't as súper terrible as the last one.",
        "review_detailed_main": "But still really really bad! Whats wrong with the screen writers. And olease tell me why Laura\"s friend is so damn important than the film start a with her and we have to see all the un funny jokes put so saddly on that secondary character, and after all that screen time , she almost vanishes. ( thats only one of the things that I dont get). Sex scenes that excite less than the food they don\"t finish. Boring and even exhausting to see! Love Massimo and Nacho because of their beauty but hope to see them some where else."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Brutally_Honest18",
        "review_rating": "1",
        "review_title": "Messed up and outright stupid",
        "review_detailed_main": "Probably the worst film I have seen so far. The intimacy the actors had in the first film is just not there and now it looks so bad that it's cringeworthy. The only ones who are giving good ratings to this joke of a movie are the die-hard Massimo fans.\n\nRarely any meaningful dialogues, poor acting, an overuse of background songs, promoting/normalizing cheating and intra-marital affairs, unnecessary need of showing gay/bi stuff between the male characters when the are evidently straight (trying to pass if off by using a dream as an excuse), totally predictable plot and very poor story-writing.. I could go on and on about this and the list would never end. Sigh. Do yourself and your mental sanity a favor by skipping this."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "aoga102-862-956361",
        "review_rating": "5",
        "review_title": "It's a mafia romance",
        "review_detailed_main": "Harlequin mafia romance. I followed the movie to hear the songs and find out who she picked. Some scenes should not have been added. Who knew the mafia boss sang on the soundtrack. Speaking of the soundtrack.... It does have some good songs there. There were scenes I forwarded, it was a bit much. I had to keep going back to the movie because I hate subtitles. At times it felt like I had to choose between watching the movie or watching the what they were saying. The locations were nice. I wouldn't mind owning some of the houses they had in the movie. Especially the beach houses.\n\nToo bad I can't find the soundtracks."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "kis-szabo-timea",
        "review_rating": "4",
        "review_title": "Boring",
        "review_detailed_main": "I watched all three films of the 365 collection and this one was the flattest of them all. Everything was so boring I almost felt asleep. Why does it have the be an almost 2-hours-long movie? The same thing could be done in 90 minutes (or less).\n\nI liked it in the previous films, that all sex scenes were steamy hot and very realistic. I thought those were the highlights of the movies. But in this one, I felt even the sex scenes were spared out. Only one of those were on the same level as the scenes of the previous movies. The plot is really not so well written to draw more attention to that, I think it is sort of a harakiri for an erotic movie to try and sell itself with a poorly written script instead of hot sex scenes.\n\nSeeing the ending I felt very annoyed that the story is left open, so one more film is yet to come. I think 365 has been already overused, even the third movie can be barely called interesting (or hot)."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "radinagrozeva",
        "review_rating": "3",
        "review_title": "Not sure what is the worst thing about this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "dinukajayas",
        "review_rating": "1",
        "review_title": "Absolute garbage",
        "review_detailed_main": "Trash movie with terrible acting. It's so forced and terribly scripted. I watched it while laughing with my girlfriend. Thanks for making a great comedy movie. Why did I even watch this and waste my time. Disappointed in Netflix for promoting this trash load."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "ymonu-82998",
        "review_rating": "10",
        "review_title": "The Next 365 Days Review:",
        "review_detailed_main": "This movie series is so good, it has everything you want. Good story, erotic scenes and drama but it lacks lesbian sex scenes. The two characters which have beautiful relationship is Laura and her friend Olga. Both of them have kissed many times but they won't have sex which is odd. This movie lacks Laura and Olga sex scenes.\n\nIt would be sexy to see Laura and Olga make out, have sex and still have a friendly relationship. I personally like Olga and Laura having fun together an i think a web series of 365 is much needed with most of focus on Olga and Laura relationship."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "mieriks",
        "review_rating": "4",
        "review_title": "Not much more than a dramatic plot",
        "review_detailed_main": "This movie, about the relationship of Laura and Massimo that hangs in the balance as they try to overcome trust issues and jealousy while a tenacious Nacho works to push them apart, is a bad sequel to 365 Days: This Day (2022).\n\nWhat makes this the best one of The 365 Days Trilogy (2020-2022) is that it actually has a decent plot itself where the open ending is in fact decent, plot-wise. Alongside this, the lighting, locations, and costumes are nice like the predecessors, but that does not make the movie good in any way. The movie struggles with almost every single element, both narratively and technically, making it difficult to enjoy. I personally find it hard to believe how the production, or at least the directors, can leave the movie with any sense of satisfaction.\n\nDisappointing sequel. Decent plot (supposedly) cannot save the movie from technical and narrative flaws. Still a frustrating watch despite visuals."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "mishawnlisa",
        "review_rating": "5",
        "review_title": "Didn't Expect This...",
        "review_detailed_main": "I just finished \"The Next 365 Days\" the third and final book in the series. I must say I did not like how the book ended and it was totally different from the movie. Massimo's character totally caught me off guard. Laura was the same, she never changed, she was confused in the movie(s) just like she was in the book. Also in the book Nacho was an older bald surfer or outdoor enthusiast. And in the movie Massimo and Nacho appeared to be around the same age. In the movie, Nacho's sister Amelia had a small role compared to the book, where she had a man. I just wish the book had a different ending."
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "cinamoon-82481",
        "review_rating": "10",
        "review_title": "The best part",
        "review_detailed_main": "The first part is very interesting and engaging, the second part is not very intriguing, but still very good, while the third part is the best 🏆\n\nEven men kissed each other - the acting makes you prove your talent 😅\n\nGreat film 🏆🏆🏆"
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "lanabinell-42002",
        "review_rating": "10",
        "review_title": "Not Sure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt21106646",
        "movie_name": "The Next 365 Days",
        "movie_rating": "2.9",
        "review_username": "Shubhamsingh_02",
        "review_rating": "8",
        "review_title": "Full satisfying.",
        "review_detailed_main": "Here's a 5-star review for the Netflix series \"365 Days\", highlighting its erotic drama aspects and nude scenes:\n\nRating: 5/5\n\n\"Sultry, Passionate, and Unapologetically Sexy!\n\n'365 Days' is a captivating erotic drama that explores the intense and complex relationship between Laura and Massimo. The series masterfully weaves together a tale of passion, love, and self-discovery.\n\nThe nude scenes are sensual and intimate, adding depth to the characters' emotional connection. The chemistry between the leads is undeniable, making their romantic moments genuinely believable and captivating.\n\nPros:\n\n\n\nCons:\n\n\n\nOverall, '365 Days' is a must-watch for fans of erotic dramas and romance.\n\nRating Breakdown:"
    }
]