[
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "sujath2807",
        "review_rating": "3",
        "review_title": "Its high time Bollywood takes its audience seriously",
        "review_detailed_main": "In spite of witnessing recently released classic Akshay Kumar flops ( Tees Maar Khan , Joker ) i still went for this movie remembering Akshay's old action flicks (Khiladi, Khiladiyon ka .....) hoping to see Akshay in a serious yet a comic role. I realized my mistake 15 minutes in to the movie.\n\nMaking funny faces, speaking in a funny tone and funny character names does not make audiences laugh. Using a concept which was tried tested and horribly failed at makes the movie even more boring,if i could recall i hardly laughed that too at the stupidity of the film makers that how could they even think that this stuff will sell ? to defend their faults they will title it 'Mindless Comedy' there's no such thing as mindless comedies we pay good amount of money for purchasing a movie ticket and we deserve an intelligent script, lately film makers are making such movies and calling them comedies and changing the audience perception about comedy movies. Where are the movies like \"3 Idiots , Dhamaal , Hera Pheri , and the legend 'Andaaz Apna Apna' those movies are called as comedies they were intelligently funny.\n\nI really wouldn't suggest this movie to any one, and there isn't anything worth reviewing in this movie. I felt insulted and stupid going for this movie, and would want our film makers to stop treating audiences as foolish as their movies, and work a little bit harder when they are writing scripts and stories.\n\nI rate this movie 3 because of the effort of 100's of people put in to this movie even though it was horrible and also for its music ( though i am sure it must have been copied from somewhere, still two numbers in this movie are catchy remaining songs like Saari , Saari Raath made me laugh like crazy though it was meant to be sad or a romantic song Himesh reshmaiyya stooped down to one more level just when we thought that he couldn't be any worse )\n\nIf you are looking for a comedy there's nothing new here, i would rather suggest you to rent few Hindi classic comedies and enjoy them instead of making the actors and film makers of this kind rich for free."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "bobbysing",
        "review_rating": "3",
        "review_title": "Has very few funny moments and unnecessarily uses religious symbols to woo the viewers.",
        "review_detailed_main": "With a vision of repeating the success story of his Rowdy Rathore, Akshay Kumar returns with another action comedy which unfortunately stands nowhere close to that fairly entertaining Hit. So if you considered Rowdy Rathore as an average film then this goes to an even lower level with only a single plus point in the project being its catchy soundtrack.\n\nTherefore there is nothing to write about in details about Khiladi 786 as a movie experience to be honest. It is quite similar to Rohit Shetty kind of newly invented cinema and director Ashish R. Mohan strictly follows his mentor (Rohit), right from the first frame to the last including the punch lines, action, art direction and colours of the walls used in his sets too. But the film neither has got anything related to Akshay's personal brand of Khiladi, nor it has something to do with the religious symbols used in it scenes vaguely.\n\nBased on a thin storyline (written by Himesh Reshamiya), the first half does give you few moments to enjoy along with the much publicized action sequences. But the second half continues to slide downward & drags till the end resulting in an uninteresting film altogether. So despite of some good foot tapping songs, Khiladi 786 fails to keep you engaged and one easily feels like walking away even before it officially ends.\n\nThough Akshay performs well with a great confidence but there are very few good comic sequences featuring his famous comic timing and then the simply absurd double role in the climax further ruins the whole project completely. Himesh does more than one role in the film as the producer, writer, singer, composer & also the key supporting actor filling the space and he is just OK. Asin as usual is there for adding some glamour, Mithun Chakraborty is not as impressive as he was in Housefull 2 and I couldn't understand why Raj Babbar accepted such kind of meaningless minuscule role in this weak film.\n\nPutting it together Khiladi 786 has only got some dancing tracks to entertain you till they last and nothing else in the name of content. Moreover it was sad to see, how they used the religious symbols (786 & Khanda – The Sikh Symbol) just to attract the viewers and to add some value to the product commercially. Thankfully it was never done in such a ridiculous manner in the past by thoughtful directors such as Manmohan Desai, Yash Chopra and Manoj Kumar."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "A Mindless Comedy!",
        "review_detailed_main": "'Khiladi 786' is A Mindless Comedy that is strictly meant for the masses of the hinterlands. It delivers mediocre entertainment!\n\n'Khiladi 786' Synopsis: A good for nothing match-maker arranges a marriage of a don's sister to a crook.\n\n'Khiladi 786' has a fairly entertaining first-hour, but the second-hour isn't. The Screenplay is inconsistent & pretty mindless. Sure, one doesn't mind escapism, but at least the goings-on could've been far more entertaining. Also, the songs pop-up pointlessly & drag the film's length. Ashish R Mohan's Direction is passable. Music by Himesh Reshammiya is foot-tapping, but the songs lend nothing to the narrative.\n\nPerformance-Wise: Akshay returns as Khiladi after a long hiatus & he's simply superb. He delivers from start to end. Asin is her usual self. Himesh Reshammiya looks out of place. Mithun is sincere. Raj Babbar & Mukesh Rishi are mere gap fillers. Johny Lever & Manoj Joshi are effective in cameos. The actor who enacts the role of Asin's boyfriend is alright.\n\nOn the whole, 'Khiladi 786' is mediocre."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "ssng-89",
        "review_rating": "1",
        "review_title": "Please Stop Making rubbish movies or else i will also start making them :D",
        "review_detailed_main": "I don't know whats happening with bollywood....the good movies are all gone..=..Movies with no stories,No Powerful comedies..in short nothing khiladi 786 and than dabang 2...2012 may not be the end of the world but it surely is for bollywood :( :( ..The Original ones are gone..with the end of \"Jab tak hai jaan\"-YASH CHOPRA,This might be the reason for me to switch to Hollywood more and more nowadays...I am not saying that all the movies are bad but standards are deteriorating day-by-day..this movie is the live example of that....The movie is bekaar....total flop.Don't watch it...And if you really want to see this movie than take a saridon and watch it...lolz I hope for the best in 2013...and look forward To watch the best movie of the decade this year... By This review i just wanted to beg the stars to Please look at the script before making movie...Otherwise they will be headache for you as well as for us..."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "sashank_kini-1",
        "review_rating": "1",
        "review_title": "The mass manipulation of media by moneyed mainstream has tarnished the quality of Indian cinema, giving birth to products such as Khiladi 786",
        "review_detailed_main": "Plot: Akshay Kumar plays himself but since he is an 'actor' and the 'film' requires it's cast to have unique character names, he is therefore called Bahattar Singh; the guy is a con policeman whose entire family of equally tough men believe in making money catching criminals and sometimes framing innocents wrongfully, but the same guy is also rejected by every girl in the town. The leading lady Asin asininely plays a crime lord's daughter whose lover remains behind bars and so she takes all her prospective bridegrooms on a deadly car drive so that they can reject her. The marriage-maker is played here by Himesh Reshammiya, whose character's idiosyncrasies put him in great trouble. Supporting cast made up by people usually associated with Akshay Kumar films.\n\nAfter being repeatedly and uninhibitedly subjected to erratic zip-zap-zoom cinematography with not really visible attempts at fine-tuning, shoddy, so-obvious-it's- made-out-of-cheaper-quality-material set properties and horrifyingly loud and sometimes out-of-sync sound that has the ability to molest one's ear, an Indian like me has begun to believe that the availability of good technology, the assumption that the Indian audience always keeps their cerebrum aside while entering the theater and the mass manipulation of the media by the moneyed mainstream has corrupted many of today's Indian directors, actors and production crew, who seemed to have forgone the basic elements of creating a good cinema and completely left out the advantages of a well-penned script, thereby tarnishing quality completely in favor of show-me-the-money!\n\nAh I feel so good now after getting this off my chest! This the the pent up feeling (or rant) that bubbled within me with each new frame in Khiladi 786, whose director is incompetent, whose producer (the lead actor's wife herself) is a cash cow, whose cinematographer is reckless, whose sound recordist is insane and whose actors are extremely aware of their limitations yet incredibly proud that they still are minting money while hundred of capable actors aren't getting their dues. Salman Khan dropped the bar to depths rivaling Othello's hapless state after realizing the deceit played on him by the manipulative Iago, but Akshay out-lowers him with smelly poo excreted into an expensive diaper. Only time shall tell whether it is Salman who goes even lower in Dabang 2 or it is some third person who walks away with the usually-dreaded-but-now-coveted-because- money-is-at-least-recovered Hall of Shame.\n\nSince the movie took it's audience for granted, I did the same for the movie: I left (read 'fled') during the interval. It should not be the way a movie should be critiqued but there are certainly exceptions such as this wacky piece. I'm not sure whether the director tried doing a Tarantino (i.e. using prominent qualities from low budget action film in developing a highly stylized, high quality movie, such as Kill Bill inspired by small budget Japanese martial arts films), but in case he did, then he has failed miserably. Just getting a better camera and better recording devices aren't the keys of making a better film; would Kill Bill have received such a glorious response had it just got a very expensive camera with sharper clarity and high-tech sound devices without creating the epic saga, using proper narrative devices or choreographing it's complex martial arts moves with beauty and precision? The people associated with Khiladi 786 are all spoilt brats who shamelessly exploit wrongly the resources they are able to obtain just because they have so much money. \n\nThe most disturbing part of films such as Khiladi 786 is the open misogynist values it promotes. Asin's character is a rough rider who can only be controlled by a man, and so there's a humiliating sequence where Akshay's character Sattar dumps her on the shotgun seat, takes charge of the driver seat and drives at a monstrous speed to make her submit to his manhood completely. In between the sequence, the action is cut to a fantasy sequence where Sattar driving a swanky car and Asin sits beside him and acts like one of those bimbos in music videos. I've seen this with Salman Khan films too - nearly all his leading ladies literally act like they are completely powerless under Salman's mighty control.\n\nSeems like my rant has still not finished, but what else can said about this work? Akshay Kumar has admitted he isn't very talented as an actor but he proves now that he has stopped being an entertainer too. Asin has been having a Ghajini hangover for over two years and it's time she really tries her hand at some other profession. Reshammiya should suck his hubris about being multi-talented and stick to what he does best... Judge music shows that I don't watch so I do not get to see his face. The rest of the cast knows they risk losing their money-making jobs if either Akshay or Salman quits, so they remain loyal to their films, no matter how hopelessly their little talent is exploited."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "budhrajavishal",
        "review_rating": "",
        "review_title": "Worst Strike By Khiladi Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "darshancruz",
        "review_rating": "1",
        "review_title": "Laughter riot & a paisa vasool treat for Akshay & Salman fans, for the rest of us: stay away!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "jshinde13",
        "review_rating": "2",
        "review_title": "Disaster!!!!!!!!!",
        "review_detailed_main": "What can we expect from akshay?? It's also another desi film with all \"tamil\" style actions and \"bakwas\" story. Akshay's work in film is average as it is a comedy film and since long time he is doing this but screenplay and story are weak points of film. This film is for mass people who will love it and may also appreciate it. Almost all action scenes of films are without any sense for example as seen in trailer akshay break the engine of a jeep with his leg easily. so disgusting!!!!\n\nAfter a long time himesh's music is rocking not only in theaters but also all over India. We can say that akshay's acting and himesh's music are only positive sides of film otherwise there is nothing in film to watch.Comedy scene are not so impressive,i was just waiting for end of film. I suggest if you are akshay kumar's fan or you are a viewer from mass people who likes any \"masala\" movie like \"Bodygaurd\" and \"Ready\" then only you can watch it otherwise wait for 2 to 3 months it will be soon come on any channel."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "kalpnaag-007",
        "review_rating": "1",
        "review_title": "\"The disaster movie of bollywood \"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "houghtonconnor17",
        "review_rating": "6",
        "review_title": "Decent Comedy but with It's Faults",
        "review_detailed_main": "First I would like to clarify that aside from having Akshay Kumar in a starring role, this film is nothing like the Khiladi movies from the 90's. I will start this review with the negative aspects of the film and then move on to where it succeeds. Firstly, as is increasingly common with Bollywood films these days, the Punjabi element is noticeably there both linguistically and thematically. This is not so wrong except that I think that over-Punjabization makes it somewhat difficult to follow some plot lines and jokes. Additionally, there is not really a message in this film to follow and some of the jokes fall stale. Also, the storyline about Akshay Kumar's character's long lost brother does seem to be not only tangential, but also completely unnecessary. In addition, while many of the fight scenes are choreographed well, some of them do tend to drag and could have been more sharply edited. On to what the film does well. The supporting cast, other than the non-Indian characters (as per usual with Bollywood) all do a fair job in creating a hilarious atmosphere. Asin is adequate in her role, though she has been typecast so far in Bollywood as the pretty girl who gets duped a lot and does not have much to do other than be eye candy, a standard which she adheres to here with aplomb. Akshay Kumar and Mithun Chakraborty both do an excellent job in creating a comic atmosphere without being overly obnoxious, which is somewhat helped by the characteristically helpless look that Chakraborty has perfected for his role as the stern patriarch (he has played the same role in about a half dozen movies by now so he should be getting good at it in any case). In addition, the songs are fairly catchy in their own way, though Himesh Reshammiya has a hard time making a love song not sound ridiculous. Overall this was a decent masala entertainer from Bollywood that, while not comedic gold, is nevertheless a far better outing than some of the other choices from Akshay Kumar this past year. Good for a watch."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "5",
        "review_title": "a good entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "butshav",
        "review_rating": "8",
        "review_title": "Desi Kung Fu Hustle- Khiladi 786",
        "review_detailed_main": "KHILADI 786 REVIEW\n\nI am pretty damn sure every Bollywood fan knows what the Khiladi series is and has seen at least 1 Khiladi movie. The Khiladi series is a very interesting one and the Khiladi movies have absolutely no connection to each other except for the title, Akshay Kumar and hardcore action. The hype around Khiladi 786 was super high. So does Khiladi 786 meet the expectations?\n\nThe plot of Khiladi 786 is simple: Mansukh (Himesh Reshammiya) is a failure in his match- making career and after his father, Champaklal (Manoj Joshi), kicks him out of the house, he attempts to get this one job right- of marrying off TTT's (Mithun Chakraborty) sister, Indu Tendulkar (Asin) to a decent family. He chooses Bahattar Singh (Akshay Kumar) for the job thinking he is a cop and even convinces TTT to pretend to be a cop in front of Bahattar's family. Little did Mansukh know that Bahattar and his family are in- fact con- men. Also, while Bahattar falls for Indu, she is in love with a prisoner Azad (Rahul Singh). What happens next when both families pretend to be cops in front of each other forms the story.\n\nThe editing could have been better as well as the cinematography. Debutant director, Asish R Mohan does an average job behind the cameras. The songs are fantastic chart-busters with Balma, Sari Sari Raat and Hookah Bar being my favorites. Khiladi 786 is basically an over-the-top spoof. It does not take itself seriously and neither tells you to take it seriously. It has only one motive: ENTERTAINMENT at any cost. The comedy is over- the- top. There is slapstick, puns, one- liners, everything you expect. The action is over-the-moon. Bahattar is as fast as flash and as powerful as super- man but unlike Dabangg, Singham, etc. his powers have a reason here: 786. Akshay Kumar dwells well with both comedy and action. His punches and kicks (read: Roundhouse, Jump Roundhouse, Crescent, High Slap, etc.) are fantastic. Asin is good in a slightly different role and although her role isn't that big but it is meatier than her roles in Bol Bachchan and Housefull2. Mithun is very good as the goon and packs in good laughs. Himesh is average and tolerable. Others like Sanjay Mishra, Mukesh Rishi, Raj Babbar, Rajesh Khattar, Guggi, Johnny Lever are pretty good but they have been a bit wasted. The dialogues and one- liners bu Bunty Rathore are a treat though a few become annoying due to repetition. Overall, I would call this movie an over-the-top spoof. If you are looking for an intellectual movie, don't bother even watching the promos of this movie but if you are one of those who relish mass masala flicks, then make sure you watch this movie in the theaters and buy a DVD later on as well. Khiladi 786 would not be in my top 3 Khiladis but it does entertain for sure.\n\nRating: 8/10"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "movie_guide",
        "review_rating": "7",
        "review_title": "Fun to Watch",
        "review_detailed_main": "What makes KHILADI 786 conspicuous is the fact that it marks Akshay's return as 'Khiladi' after more than a decade. The led man bashes up 10/15 goons at one go like we swat mosquitoes, punches the wall in anger and the wall crumbles, even gulps down a man as if he we were consuming a soft drink from a straw yes, you read it right. This is a mere sample of what you gonna see in KHILADI 786. So, be prepared!\n\nKHILADI 786 is an old-school wacky potboiler. There isn't an iota of logic here and one is not even looking for intelligence, rationale or justification either. The film is packed with ingredients that constitute a wholesome entertainer such as humor, South-styled stunts with the one-man army outsmarting a bunch of deadly goons and of course, visually enticing songs every 15/20 minutes, but the writing has its share of hiccups... * The track of Asin's lover Rahul Singh is a yawn. What was the writer thinking while penning those sequences? * The climax, with Rajesh Khattar landing up at the wedding, Johny Lever unlocking himself from a room where he was held captive and Mushtaq Khan and Bharti suddenly becoming news reporters at the wedding maintop, looks too much of a cinematic liberty. On the plus side, the first-time director throws every trick in the book to entice the spectator and moves on to the next scene, before the viewer gets the feeling of deja VI. There's no denying that you actually enjoy certain moments in the narrative. The concept of having an African and Chinese in the family is so funny. Also, the lost-in-Mela brother surfacing in the end may look ridiculous, but makes you smile again. In a nutshell, the film caters to the mas-ala loving audience and the director has no qualms about admitting it.\n\nHimesh Reshammiya, who enacts a pivotal part in the film, belts out super numbers here. 'Balma', 'Lonely', 'Hookah' and 'Long Drive' have already made it to the music charts and are, without doubt, standout tracks. The action sequences are very much macho and executed with zest and enthusiasm.\n\nAkshay's Desi punches, raw and masculine action and the correct comic timing is sure to win a lot of hearts yet again. He is in his element, in complete form, brimming with charm and confidence. He's the mainstay of the film and lives up to the title every bit. Asin is the prototypical heroine who has to look her best, dance admirably and pair off with her on-screen man. Himesh Reshammiya does very well, while Mithun Chakraborty and Raj Babbar add lots of weight to their characters. Sanjay Mishra is in his element. Mukesh Tiwari impresses. Johny Lever is under-utilized. Manoj Joshi, Rajesh Khattar, Mukesh Rishi and Gurpreet Guggi are perfect. Mushtaq Khan, Bharti and Rahul Singh deserved better roles. Claudia Ciesla's item song adds glamor to the proceedings. On the whole, KHILADI 786 is not for purists, but for lovers of hardcore mas-ala films completely. If zany amusement, wacky humor and over the top entertainers is what you enjoy, this one's for you. Go, have fun!"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "ketgup83",
        "review_rating": "1",
        "review_title": "WORST movie of 2012!!! Akshaye Kumar is simply wasting his talent doing this kind of cinema",
        "review_detailed_main": "Khiladi 786 was the most senseless , irritating and intolerable flick of 2012. There is nothing called acting , direction and of course the screenplay.\n\nFrustrated at his continuous failure over arranging marriages , Mansukh ( Himesh Reshamiya) vows to make at least one marriage work in his life. He gets a proposal from a dreaded gangster ( Mithhun Charaborty) to seek a suitable groom for his sister. Mansukh finds 72 singh(Akshaye Kumar) to be the ideal boy and must convince both the family to get hitched within 10 days or he will have to suffer in hands of ferocious gangster.\n\nDirected by Ashish R. Mohan , Khiladi 786 is a complete waste of time with no story and no screenplay at all. It is a bad tribute to the Khiladi franchise made popular by Akshaye Kumar and will only dwell on its brand value. The direction is terrible with none of scenes leaving any impact. In fact , I had to take break in between as I could not tolerate the movie any further. There is nothing called screenplay in the movie. The editing is loose. Cinematography is just about OK. Art direction is fine. Story is weak. Action scenes are larger than life which is sometimes so inappropriate and funny as if you are watching some 1950's action drama. Music by Himesh Reshamiya is the soul of the film. The songs are tuneful and foot-tapping. Baring Akshaye Kumar and Himesh , all the performances by rest of the star-cast are loud and over the top. Akshaye Kumar is simply wasting his talent in this worthless movies. He can do so much better than this.\n\nOverall , I found Khiladi 786 to be the WORST movie of 2012. Believe me , you can do something better rather than watching senseless film. Poor 1/5"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "\"Khiladi\"a successful franchise,which just got weak!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "paramtripathi",
        "review_rating": "2",
        "review_title": "A Disaster",
        "review_detailed_main": "I fail to understand the pathetic taste of the Indian audiences. No brainer movies like Rowdy Rathore, Singham (though way better than Khiladi 786) and Dabangg have gone on to smash Box office records. Why! No script, overacting (which makes you cringe) and a whole lot of bullshit. An awful movie with absolutely nothing to look forward to. It's high time we stop idolising actors who time and again come up with disastrous movies which manage to rake in 200 Crores. I feel disgusted when a horrendous movie like this does good business while other quality movies are ignored and overshadowed. Please, I beg everyone not to even contemplate watching this film."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "nairtejas",
        "review_rating": "2",
        "review_title": "Poor Comedy! RIP Akshay's Acting Career!",
        "review_detailed_main": "So, this is the latest film in the longest running franchise of Bollywood. Lemme remind you, this is bullshit!\n\nKhiladi 786 lacks logic, has comedy (but poor), it lacks substance, has adrenaline-pumping action sequences but they are lame. You might want to get out with all those cheesy liners and bizarre dialogs, but you still sit there looking at the screen because you cannot get out of this without whacking a couple of punches into thin air.\n\nMusic is lame by HImesh Reshammiya with some of his own songs copied from Namastey London. Direction is okay but it is futile.\n\nBottom Line: IGNORE!\n\nCan be watched with a typical Indian family? YES\n\nLanguage: Decent yet some double-meaning references made! Sex: No Nudity: No Violence: No\n\nFor more: bit.ly/TEJAS"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "gajjar-rushi-a",
        "review_rating": "1",
        "review_title": "Total waste of time & money",
        "review_detailed_main": "Tremendously boring, jarring, irritating, & non sense movie this is! I don't know what makes Akshay Kumar do such films? I don't think actor of his caliber needs such rubbish, pointless, & totally stupid movie, he's playing with his image for sure. Even Rowdy Rathore was complete waste & mindless movie.\n\nKhiladi 786 is very much mindless & silly movie. One thing is sure that now onwards I'm not going to see Akshay Kumar's movies if this is what he wants to do now! Most of fights are completely unreal & unimpressive. No good comedy & very very poor silly jokes by non-actor Himesh Reshamiya. Akshay has no such bad days... you're still an actor if you forgot that.\n\nI know this became a flop to average movie already but in future, I hope no such movie will be made with Akshay Kumar.\n\nRating : -1/10"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "ajit2106",
        "review_rating": "4",
        "review_title": "A mediocre endeavor all over again---Please stop this\u0085 Nonsense..",
        "review_detailed_main": "There is a tsunami of these kinds of mediocre craps in Indian Film Industry nowadays. Every Production company & director are trying to make the same film with same screenplay with different actors, be it Salman Khan (Ready, Bodyguard, Ek Tha Tiger, Dabangg 2 etc.), Ajay Devgan (Singham, Son Of Sardaar), Akshay Kumar (Rowdy Rathore, Khiladi 786) and so on\u0085\u0085\u0085.every movie has same ingredients.\n\nEither a remake of South Indian hit or so called trying to be highly original script, this is tarnishing the image of Indian Cinema because these craps are a pattern of INR 100 million and crossing every boundary of monies. It doesn't matter whether film is penned properly, it looks like some people gathered, made some sets, asked the actors to play the roles and deliver the dialogs. Let's put some songs so the people will be left wondering to the eternity, if a song was really required there. Stunts are too exaggerated, like someone is playing soccer out there, scoring a goal in every kick. People are flying like mosquitoes, bashing everything comes in front no matter if it's a 50 storied building.\n\nBefore describing the synopsis, I wanted to ask the casting director, what was Himesh Reshamiya doing in the movie? I mean why was he in the movie?It does not matter if he is the producer or story writer.\n\nSo, Akshay Kumar plays a thug working for Punjab Police, looting the border crossing trucks and getting his share from the local inspector. Having everything, he is not able to get married because he belongs to the thugs' family. Here comes Asin (I don't know why is she there in the movie too?), with her family, again the with The Front Page criminal as his brother Mithun Chakraborty. Himesh Reshammiya is a failed match- maker; trying to get them (Akshay & Asin) married whatsoever.\n\nThus the story is mindless & goes erratically haywire, everything seems to be happening but no one cares. A sheer diminution of all the good actors and money.\n\nWatch it only if you are fan of Akshay Kumar and masala movies.\n\nMy vote 4/10----for at least taking the effort to add one more name in the array of humdrum movies.(Pun intended)"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "morrison-dylan-fan",
        "review_rating": "4",
        "review_title": "Khiladi:The player.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "dineshprakash",
        "review_rating": "6",
        "review_title": "An average MASALA film",
        "review_detailed_main": "Director Ashish R Mohan has forced himself to make a mass entertainer film at the level that movie comes into bits and pieces. Somewhere you enjoy it but sometimes it's too loud and senseless. Story has nothing to tell new. Screenplay is good at places. Even they try to give it emotional touch but not through the main plot but with sub plot. A scene where ,Mansukh' father is being happy when his son scolds him for making silent call, is touchy. Climax is very boring and repetitive. The name of film according to content is 100% irrelevant. It is kept to consider a particular section of audience. Dialogues by Bunty Rathore is good among story and screenplay. It generates the required laughter. Performance wise Akshay Kumar is good. Himesh REshamiya is OK. Asin is so so. Mithun Da is very good. Famous and adorable female comedian, Bharti is also in movie but totally wasted. She is fantabulous performer but nothing to do in this film. Music by Himesh Reshamiya is good. When film drags, music supports it very well. Action by Jai Singh Nijjar is good. Single screen audience will enjoy it at a level but doubtful in multiplexes. After all an average film."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "bhattlohit-46583",
        "review_rating": "1",
        "review_title": "Khiladi 786 review",
        "review_detailed_main": "There aren't any spoilers, only the film in itself is spoiled. I have never came across such a terrible waste of time/ money in my life all along. Akshay Kumar has subjected his audience to vehement torture all along the twenty first century and yet this somehow makes the top of the pile. Screw this movie altogether."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "Pure Entertainment",
        "review_detailed_main": "Akshay Kumar is back in Khiladi avatar an man is he damn good. Action and Comedy to the max is what this film provides. I wont add any spoilers but, do one thing if you like Action, Comedy, or just love pure entertainment for 2 hrs go watch khiladi 786 and you won't be disappointed but do leave your brain at home!!!\n\nPerformance Wise Akshay KHILADI Kumar is just amazing, his comic timing and comedic performance should be applauded he is in full form in k786. Others who came out with good performances are Mithun, Himesh, Rahul S, and Johnny Lever. Asin is purely there for her looks and she is used well as she looks beautiful.\n\nSo all in all if you wanted to be entertained watch this crazy action comedy!!!"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "yunusitboss",
        "review_rating": "7",
        "review_title": "Khiladi 786 (U) Hindi------------my Rating : 3.5/5 stars GOOD",
        "review_detailed_main": "Khiladi 786 (U) Hindi------------my Rating : 3.5/5 stars GOOD\n\nIt is a mass masala entertainer with its brand name KHILADI......\n\nVERY GOOD: *Music : songs were superb by Himesh Reshammiya \"Long drive and Hookah Bar\" were worth to watch in 70mm screen. *Action : unlimited but they are funny..... *Comedy : awesome by Himesh Reshammiya *Direction : good not bad *Cinematography : superb in long drive song..... *Editing : plays a main role ......\n\nAVERAGE: *Performances : akshay was good but asin is average...... *Story : normal desi movie with unpredictable climax..... *Background music : especially they were good in fight scenes.... *Screenplay : second half lacks.....\n\nVERY BAD: *Certification by CBFC : this movie contains a Parental Guidance because have more cleavage visuals, so it may have awarded with an U/A certificate.....\n\nFINAL VERDICT: It is a clean one time watch movie with first half comedy and second half full of songs.... Don't misss the LONG DRIVE song\n\nThe film is a comedy about Mansukh, born to an owner of a marriage bureau Champak Lal. Akshay Kumar, Asin Thottumkal."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "utkarshonly",
        "review_rating": "4",
        "review_title": "Leave you brains at home!",
        "review_detailed_main": "It is alright! Not exception or not even worth watching twice. But, if you have the time why not?\n\nIt's a light senseless movie on the lines of Dabangg. It's somewhat humorous and maybe lightly entertaining. If you don't get very critical you might enjoy it.\n\nAkshay Kumar as usual is a strong man. Himesh Reshammia is alright too. Asin look really nice and well, the acting is fine too.\n\nAll in all, this movie has nothing worth remembering. It's not even a laugh riot. But it does tickle the funny bone once a while and helps you pass time in an alright manner.\n\nIf you are the very seriously kind of audience, then you can give this one a skip!"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "SBcriticImdb",
        "review_rating": "1",
        "review_title": "WTH! Is this movie. Was the director high when he made this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "agmoldham",
        "review_rating": "4",
        "review_title": "1st Bollywood Movie",
        "review_detailed_main": "I was away travelling in India and the group decided to go and see a Bollywood movie. There was always going to be a major stumbling block with this as I don't speak Hindi and obviously no subtitles. It was certainly an experience going to a Bollywood movie as the audience cheer when each of the well known actors make their first appearance.\n\nAs for the movie it was pretty easy to follow. There were a lot of song and dance routines and I found it quite entertaining throughout. Lots of action scenes with very far fetched stunt scenes. There were a couple of people in the group who were fans of Bollywood and they found it a little bit disappointing."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "ovhirup",
        "review_rating": "9",
        "review_title": "A new genre of Comedy with sprinkles of old wine",
        "review_detailed_main": "As they say keep your brains at home and watch with no expectations. I will not say so. Its a movie full with punchlines and \"super\" funny scenes and situation comedy.Rib tickling scenes and feel good songs add to the experience.Feel the movie with a group of friends or your family. Its a Roller coaster drive of comedy with smart punchlines everywhere.Did you like Obelix in your childhood? Or Chacha chowdhury? If not , opt out. For the rest leave all your extra baggage from your cynical mind and watch for a smile in face of you and your loved one.No movie can be perfect And that is the only reason why I give this movie a 9. Love it ,hate it but you can not ignore it. Khiladi Rocks!! again :D"
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "GrandMasterrrr",
        "review_rating": "10",
        "review_title": "watch it for only akshay kumar",
        "review_detailed_main": "Khiladi 786 directed by Ashish R Mohan it is not as thrilling as previous Khiladi series.\n\nThe movie has a weak has a simple story and it has it's moments of entertainment.\n\nThe only best parts of this movie is the action scenes by akki is far better than Rowdy Rathore, and what I liked about it's action scene is it combined akki's martial arts with numerous different kicks, and punches into OTT, where he would use all his trademark moves and will blow away goons with superpower force. Akki's performance in action scenes is far superior to that of salman in Dabangg or Ajay in Singham, as akki performs his own stunts, and his fighting skills is used as more powerful effect on goons. Can't imagine salman or Ajay doing those high kicks, crescent kicks, round kicks, ground kicks, slide kicks, punches with so much technique and naturally as him. You get to all akki's trade fight moves as seen in previous khiladi but with some OTT combined, like in Kungfu Hustle where walls break but with martial arts moves.\n\niii)The performances of Mithun Chakraborty, was brilliant. Akshay Kumar was the amazing and he is expression in his dialogue delivery. horrible."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "rabiashehzadi-74754",
        "review_rating": "10",
        "review_title": "Family movie# Best movie to watch.",
        "review_detailed_main": "Here you can see a great movie of all time it's best movie and make you laugh."
    },
    {
        "movie_id": "tt2166214",
        "movie_name": "Khiladi 786",
        "movie_rating": "4.4",
        "review_username": "varun-76528",
        "review_rating": "8",
        "review_title": "Leave your brain and watch the movie",
        "review_detailed_main": "Amazing movie with loads of comedy moments. Akshay kumar as always has proved his comic timings. Supporting cast has also done good job except for Himesh Reshammiya who is not an actor. But still would like to comment on the story he has written.\n\nIts purely a premise which belongs to 80s and 90s era, known as masala entertainer with foot tapping dance numbers (Himesh's music is another highlight of the movie). People looking to get entertained will surely love this movie whenever it is played on television. Movie strongly connects to masses and classes would also smile for the movie, if not they laugh."
    }
]