[
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "aslv12",
        "review_rating": "8",
        "review_title": "Hindi Film Industry needs more movie like this..",
        "review_detailed_main": "Beautiful movie. The director ventures into a plot that is seldom touched in India: The plight of Indian Businessmen, the prejudice that the general public has towards them, the disgust with which they are seen. The directions and scrrenplay is very close to some great Hollywood biographies/life-stories like Aviator and Wolf of Wall Street. The director covers a lot of ground in 2.30 hrs and nowhere it feels that the story is getting ahead of itself. And last but not the least, Abhishek Bachchan is exceptional in the movie, from his expressions to his dialogue delivery to his body language he looks like he is in reality Gurukant Desai. I really wish that other directors take a cue from this movie and bring to forefront such stories in breathtaking fashion."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "brp8487",
        "review_rating": "8",
        "review_title": "Great movie by Mani Ratnam; but, Abhsihek steals the show",
        "review_detailed_main": "This movie is all about the vision of a person \u0096 Gurukanth Desai (Abhishek Bachchan) & his efforts to realize the dream, fighting against all odds. Some people say it is based on the life of Dhirubhai Ambani. I can see why they say so. But, this is actually a movie about a simple guy trying to make it big in this world. It can easily relate to just about any successful entrepreneur who has been able to achieve his vision.\n\nThis movie follows Guru's journey, starting from his teenage days; his first work in the petrol industry in Turkey. As he matures in age as well as in riches, he decides to start working for himself & begins his \"bijjness\"- His foundation stone & his first business takeover being his marriage with Sujatha (Aishwarya Rai). He steps into Bombay and bids to cut out his own route in textile trading, through the weed-infested fields of the trading unions. His entry into trading, is greatly influenced by the works of a news editor with great principles, Manikdas Gupta (Mithun Chakraborthy). The relationship between these two, then, goes on to progress to a father-son standard. Flanked by his innovative ideas & his sole will of realizing his dreams, he dares to foray into other areas, manufacturing polyester, producing chemicals etc.\n\nBut, as we near intermission, an important incident occurs, which makes Mithunda to take notice of the ways & means of Guru's success. To investigate Guru's work, he appoints a young reporter, Shyam Saxena (R Madhavan). This is where the story really starts developing its many twists & turns; involving many intricate plots bearing great emotion, building up wonderfully to a Grand Finale worth the huge expectations from this film.\n\nMani Ratnam as the Director does a commendable job of realizing his screenplay dreams. His attention to detail in every aspect of the movie is commendable, be it the evolution in the type of clothing which the characters wear or the concept of using different shades of colors for different decades in the movie, there is typical Mani Ratnam uniqueness written all over it. High points in the movie are the sequences between Mithunda & Guru, the simple chemistry between Aishwarya & Abhishek & of course, the Finale. The cinematography by Rajiv Menon is very nice, capturing the essence of the India of the bygone days. The editing though good for the most parts, was a little too flashy for my liking towards the end.\n\nThe music by AR Rahman is another huge point going in favor of the movie. The soulful song & tune of \"Jaage Hain\" & the ravishing song \"Tera Bina\" are pieces of musical brilliance. \"Barso Re\" is a melodious number, shot very beautifully with nice choreography. ARR plays his charm though his innovative & fresh music.\n\nComing to the performances, the beauty queen \u0096 Aishwarya Rai has given a wonderful performance, suiting her strong character in the movie. This is one of the few occasions, where her acting has done the talking & not only the looks. Madhavan does justice to the role of the sincere journalist. Vidya Balan runs her charm in the brief, but, important role she plays; portraying her unrelenting love for her quarreling caretakers. Mithun Chakraborthy's comeback role is the best that I've seen coming from this Disco dancer of yesteryears. He is involved in a few quite memorable scenes in the movie, adding his charm. Mallika Sherawath fans would be disappointed to find out that she doesn't have any role in the movie at all, except for a song.\n\nBut, this movie belongs to Abhishek Bachchan & none other. This is the once-in-a-lifetime opportunity to play such an important role & he has grabbed it with both hands. This is not a typical hero's role, which he portrays. There is the interesting addition of grayish shades to his character. His choice of role means that he probably wont have too many of his female fans swooning over him during the movie; but, it is his acting which steals the show here. He graces almost every frame with his presence. His dialogue delivery is immaculate, his energy & confidence in the movie is truly breathtaking, towering over all the other good performances in the movie."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "volvox18",
        "review_rating": "7",
        "review_title": "Not a Legend, still worth your time...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "shivams",
        "review_rating": "10",
        "review_title": "The story of anomalies in the pre-liberalization Indian business situation.... through the story of Guru Kant Desai, an ordinary entrepreneur.",
        "review_detailed_main": "Mani Ratnam does it again ... outstanding!! With his vivid dramatization of the Indian business situation of the 1950s-1980s (pre-liberalization period), through the story of an ordinary entrepreneur, he surely aims at igniting the educated Indian minds towards entrepreneurship. Yes! The movie is not for everyone, but a focused audience !! The movie is not one of the eye-candy commercial movies .... but a typical Mani Ratnam product.\n\nBut, more than anyone else, the one who turns the heat on is.... Abhishek Bachchan. \"Role-of-a-lifetime\", as they call it, could not have been better portrayed. And Abhishek Bachchan fits the role, body and soul. The conviction is evident in his dialog delivery at each and every stage of the story.\n\nAishwarya Rai plays the role of the strong wife who would stand with her husband in all times. This is one of the times when she has proved more than her body. A strong role played with equal strength.\n\nThe movie compactly binds the story of a successful entrepreneur and his simple love life. The soul of the movie lies in the final minutes, in a court hearing scene ... the 4 min 30 sec speech by Guru (Abhishek Bachchan). In his speech, Guru summarizes the anomalies of the pre-liberalization Indian business situation...how \"Licence Raj\", Market Imperfections, Corruption, Excise duties, Import-Export regulations troubled the businessmen and hindered the growth of the economy and nation as a whole.\n\nA feast for Indian intellectuals !!! Salutes to Mani Ratnam, Abhishek Bachchan and Aishwarya Rai !!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "rdig1-1",
        "review_rating": "10",
        "review_title": "A perfect example of gripping storytelling and impeccable characterisation",
        "review_detailed_main": "Just returned from the theatres, now that I am home I feel genuinely very happy that Guru Kanth Desai is still going strong. I am also completely confident he will make Shakthi Corporation the biggest company in the world...by now you must be wondering what I am talking about, this is how many viewers would feel after coming out of watching Maniratnam's Guru.\n\nFirst of all let me start by mentioning Abhishek Bachan's role, as this is the role that Guru is built upon. If there ever was a movie where one actor dominated so completely I would only compare Kamal Hassan in Nayakudu/Nayakan. Abhishek should be very proud of what he has accomplished in Guru, it is something that some actors haven't or will not achieve in a life time. He is impeccable for the hardest of critic to comment. His histrionics are brilliant and the way he lost and gained weight during different parts of the movie demonstrate how serious Maniratnam and Abhishek were in making this movie. Keep the awards ready please...Abhishek Bachan has his name stamped on them.\n\nThe story is quite simple; it is the narration and the characterisation that makes this movie so unique and interesting. it's about a common mans journey to build India's largest company with the help of its share holders by whatever means possible. In Guru, Guru Kanth Desai is not portrayed as an invincible man rather he is played as a very good business man who can talk and do right things at the right time. The narration of the story is so tight you never flinch. (This applies only to serious movie watchers, not the ones who cannot do without masala and comedy in a film) Maniratnam is one the best story tellers in our country if not the best, and he does that perfectly again. This will rate as one of the best works of Maniratnam; I would take the liberty of putting this Under Nayakudu/Nayakan which rates first on my list of Maniratnam movies.\n\nThe music is by A R Rahman, we all know what happens when Maniratnam and A R Rahman team up. Pure magic is created. More than the songs of Guru, the background score impressed me. It is the music in every important scene that brings the scene to life. Rahman is amazing and like Rang De Basanti the songs just blend into the movie. Not to mention Mayya Mayya and Barso re Megha in the first 20 minutes of the movie brighten up the whole theatre.\n\nA word of mention...\n\nAishwarya Rai has a very strong role in Guru; strong roles are very scarce in Bollywood these days...especially for female artists. Aishwarya stays with Guru throughout the movie and stays on the top of Bollywood by doing that brilliantly.\n\nMithun & Madhavan are the adamant characters that fight for the right, when I say adamant they really are in the movie and you feel their willingness to stay on the right side of things all through the movie. All the other supporting roles including Vidhya Balan are brilliantly enacted. There is no character that was underplayed or wasn't justified.\n\nWhere does this leave us...? Maniratnam has made a wonderful movie full of strong characters, great screen play, brilliant music and marvellous photography by Rajiv Menon. He needs to be commended for this effort. It is no wonder he takes two years to make out one movie, Guru was worth waiting for...so here I am already waiting for his next"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "kingrav",
        "review_rating": "",
        "review_title": "***** (5 out of 5 starts) GURU is a MUST-SEE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "anupama_07",
        "review_rating": "6",
        "review_title": "Is Guru good or Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "ridhima-suri",
        "review_rating": "10",
        "review_title": "Want inspiration...watch Guru....it is overwhelmingly energetic!!!!!",
        "review_detailed_main": "We went to watch the late night show of Guru on Sunday evening and I must admit, in recent times, it was one of the most wonderful experiences of my life. There was not one moment which i regretted while watching this wonderful movie with the best in all departments. Full marks to Mani Ratnam and the whole cast. It is difficult to come out of a movie happy, yet charmed and to feel so proud of astute vision (also,to be an Indian if you are overseas!) Before I start raving about Abhishek and Aishwarya..have a couple of important things to do. Even the smallest roles (Abhishek's father, his mother,Aishwarya's father, her mother,the committee head and so many others) were done sincerely by actors who are very good at what they do but are unsung heroes in Indian Cinema..I mean i do see them in good, intense roles but because there is no glamor attached, I cannot recall their names.\n\nA friend of mine suggested that I should give a balanced review by adding some bads of the movie too....huh!!was initially tough for me, since I was so overwhelmed;On serious thoughts, I thought let me do the worst job and then start the raves and praises!!!!!but come to think of it....here are some of my objections....there were too many songs;initially back-to-back (with my husband groaning..\"oh no, not another song!!!!\");I kept asking what happened to Jhignis (Aishwarya's brother) because he just disappeared;when Aishwarya and Abhishek broke up, the scene shook me, but I did not understand why it broke into my most favourite song...\"Aye Hairathe\"!!!; And last but not the least, Mithun da deserved more screen time, given his powerful performance!!\n\nNonetheless, this media called cinema has matchless power to shape and influence minds. The analogy drawn with Dhirubhai Ambani was just too good! I mean I know about his milestone work in industry, trade and commerce, but never would have wanted to read a biography on him. Now I am really curious and am inclined to dig the net.Let me clarify, not to come out and mock on how he made it big by breaking/making/kicking/obeying rules. But to know more about VISIONARY and ENTREPRENEURIAL thinking!! One of the most touching statements to prove this point were made by Abhishek Bachan (Gurubhai)when he justified his stand. He said to the tune of \"I saluted when asked to salute;I kicked when asked to kick, now why ask why did you kick so much and salute so much??\") reflected how bureaucracy, heavy entry barriers and closed doors policy in India stiffled business growth in that era. A typical 'rags to riches' story (I am stealing my husband's expression:D) but done so well with 'into the character' acting by everybody. How Abhishek managed to get all the Gujju expression (just part of his character) to portray his larger than life vision in life speaks volumes about his homework for this film. Being born and brought up in that region myself(Western India), I am totally familiar with local talk-walk!! He looked so ordinary, yet he did such extra-ordinary things!! In fact, in this context, the actor-character line looked so bleak. I did not know whom to reckon with more, with Abhishek for being Abhishek Bachan the son of Amitabh Bachan or with the so obvious Dhirubhai reference!! Aiswarya Rai was so down-to-earth, identifiable in this movie. I really liked her work and also appreciated how she chose to dance a little awkwardly in 'Barso Re Megha Megha' (despite the fact that she is a perfect dancer) just to portray that rusty, village belly gal!! I love to listen and listen to some of the songs, especially 'Aye Hairathe' which is so soulful, so meaningful, so heart rending!! Mithun Chakravarty played Nanaji so effortlessly; Have to agree that everybody was so right in their own shoes in this movie whether it was to promote the virtue of honesty, simplicity, clear vision or simple regard and respect for spouses, elders etc; that it was difficult to point out who was right and who was wrong. Mithun did not come out as a villain neither did Madhavan. Even I knew that Guru had paved his path with dirt smeared here and there, he did not seem to wrong at all.\n\nIt was a true work which is really inspiring and totally keeps you thinking!! Wonder if Abhishek Bachan will get the National Award of not....hope he does...:) From my side, everybody on the crew deserves one!!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "prayagnarula",
        "review_rating": "7",
        "review_title": "When son becomes the father......",
        "review_detailed_main": "This movie celebrates Abhishek Bachachan, his father's son. When you are the son of one of the best actors of the world of all times, you have the pressure to step into the shoes of your father. It doesn't happen often that a son matches up to his father in stature.\n\nIn this film Abhishek Bahcachan does just that. He gives a performance his old man would've been proud of. Abhishek proves his pedigree. This is a difficult role. Not only because he has to portray a wide range in his character but also because his character has some of the cheesiest lines. But he makes you forget that the lines are out of place here and there. He goes flat out on this one, and gives a performance which is probably the best of this year. Probably matching up to Amitabh's in Black.\n\nAbout the film. Its a Mani Ratnam film, which raises the expectations immensely and nearly lives up to it. Its a well written story and direction is up to the mark. There is a slight problem with screenplay and the songs and dance sequences break the flow of story telling. A good film nonetheless and a great viewing.\n\nThough Abhishek steals the show; other actors are pretty good too. Mithun proves again why he is 2 times National Award winner. He is a legendary actor who has been wasting his time and talent in crappy movies for a long time now. Hope he would get better roles after this. Ash is good in the second half but her choreography is not up to the mark and she looks bland and unsophisticated while dancing. Vidya Balan is wasted and R Madhvan is good in a small role.\n\nA word about cinematography is necessary. This is one of the best shot movies of last year, with breathtaking views and the last scene with Guru giving his speech to a stadium full of people looks more real than reality itself.\n\nOver all a good movie, best since Munna Bhai 2."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "khobor2002",
        "review_rating": "10",
        "review_title": "Even Dhirubhai couldn't have written a better autobiography",
        "review_detailed_main": "Well, Maniratnam has proved his worth as a director. To be able to make a hero out of somebody like Dhirubhai requires great skills. Not to mention that he made an excellent movie even with Ms Rai in it. (why did he cast her in that movie - did he lose a bet or was that a contractual thing for casting Mr. Bachan? Or was Tabu unavailable?) At the end of the movie the audience are most likely to come to the following conclusions: 1. Guru is a courageous, in-your-face, kind of entrepreneurial genius. 2. People such as Guru are the key to the success of our country and to the elimination of poverty 3. Guru is a hero of the poor people fighting for them against the club going, golf playing, influenced by the west, rich clique who prevented others from coming into their group with the help of the license raj, 4. People who stand up against corruption are honest, good people but really who are we kidding, do we really need these jokers? and 5. a small side issue is that the role of good women is at the side of their genius husbands even when they are treated as start-up capital. However, these are my questions: 1. If the poor are poor is it really because they are either lazy, or scared, or simply idiots. I wonder what would Mohd. Yunus of Grameen Bank have to say about this? 2. According to the movie people like Guru benefited 30 million people. In a country of 1 billion is 30million that much? It is just 0.3%. Not to mention these \"poor people\" had to be people who were at least of middle class status and living in cities. 3. Yes, it is true that the license raj did fetter the rise of dynamic capitalists - but will somebody ever talk about those toiling masses of this country who work until death to make this country run and people like Guru trilionaires? 4. And will someone ever say anything against making heroes of not only persons who are geniuses at exploiting others but also those who take dowry? what happened to all that social conscience of ours? It makes me very sad when talented film makers such as Maniratnam make such movies. Miracles can happen and may be Maniratnam will find his conscience....someday...."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "nirmalstheone",
        "review_rating": "7",
        "review_title": "Context overwhelms Content",
        "review_detailed_main": "Guru starts by dazzling with its starcast, its brilliant director-music director combo and amazing cinematography not necessarily in that order. But retrospect doesn't treat the movie that kindly.\n\nPersonally,the high point of the movie was Menon's handling of the camera. Every frame of the movie is desktop-wallpaper friendly. And though that might not be good for every kind of movie, Guru with its semi-period film setting and scope of locations deserved Menon's touch.\n\nManiratnam as usual handles his subject and his actors with consummate ease though the pace of scenes where he builds his characters too fast or truncated. A.R. Rahman is brilliant by the non-intrusiveness of his music. The Guru chant that follows Gurukant Desai around might be very Bollywoodish but hey! this IS Bollywood.\n\nAbhishek and Mithun Chakraborty deliver the best performances in the movie. If Mithun had been given any more screen space than he was, he could've easily overshadowed Abhishek. Manikdas Gupta has... well...more character than Gurukant Desai.\n\nAishwarya as usual is a huge letdown and a liability throughout the movie but her saving grace is her reasonable performance during the Trial scene. She manages to put herself in the center of every frame and refuses to look old at 50. When will she realise that acting doesn't mean that every frame needs to look like an Aishwarya Poster or desktop wallpaper? Madhavan and Balan are obviously wasted as characters with Madhavan delivering a sterling performance but summarily dismissed during the movie.\n\nAs for the message, the less said the better. There are a few jarring moments when Maniratnam goes over the top trying to project Guru who is obviously a marketplace villain as a person who deserves what he wants. Whoever from India will believe that a Taxi-Driver is so knowledgeable about personal finance that he invests enough to marry off three daughters with \"Shakti\" shares? Indians who invest in shares (especially during the time the trial is set in) can hardly be the \"Aam Aadmi\" that Guru claims to love and serve. And on the contrary, IAS/IPS officers who Guru accuses as the self-serving elite are usually the ones who're from middle-class \"Aam Aadmi\" families.\n\nOn the whole an enjoyable movie especially the spine-tingling scenes where Guru triumphs. The movie is all the more enjoyable if you're familiar with the real life story( Irrespective of his claims Guru is definitely based on the tycoon). You go home thinking you'll need to think about the movie but you don't. The movie doesn't deserve THAT much."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "VirginiaK_NYC",
        "review_rating": "8",
        "review_title": "Failed by family, system - how do you fight?",
        "review_detailed_main": "The beautiful photography of India, superb acting, and realistically told modern historical story make Guru a good choice as an eye-opener for someone who doesn't know Bollywood so well. And though the music is extraordinary, there is also somewhat less of it than sometimes.\n\nGuru is the story of the rise of a man from a village to become the owner of maybe the most successful business in India (a textiles manufacturer), which also benefited its mass of middle-class shareholders in an unprecedented way. It spans 30 years. The film is said to be based closely on the story of a real person. It seems intended to inspire Indians to overcome the obstacles presented by corrupt practices, and it raises the question as to what is the appropriate response to a closed and corrupt system that forecloses legitimate opportunity.\n\nIt is a joy to find oneself in the hands of a master like Mani Ratnam.  I'd wondered if I'd find this movie at all dull or slow: I did not.  It moves along - there's a lot of plot going on all the time.  I would guess that we get from Guru's village origins to his years working in Turkey to his arrival in Bombay as an adult ready to go into business in less than 20 minutes.\n\nAbhishek Bachchan gave a lovely performance as the son of a village schoolteacher who isn't much of a student, to his father's dismay. He declares his intention to have his own business, and disregards his harsh father's negative predictions about his prospects.  The character, Gurukant Desai, has a wonderful spirit - doesn't take no for an answer, also can laugh off irritants and obstacles, and the laugh is charming, at once boyish and manly.  He's \"big\" as a personality, and Abhishek is emotionally and physically up to it - you feel his great reserves of self-regard in the various ways he meets opposition, whether from family or business-world characters.\n\nOne of my primary responses to seeing the film today was gratitude to be able to see it on a big screen.  The movie occurs in city and countryside, the 50s through the 80s. Every visual image, and the whole field of the movie - scenes, sets, costumes, ambiance, acting style, music - worked together to tell an appealing story with a strong appreciation for India, as well as a potential inspiration and warning. \n\nI think a good test of a bio-pic, or pseudo-bio-pic, is whether or not somebody who doesn't know much of anything about the putative subject, which is me (in this case, the reference subject is a super-businessman named Ambani), experiences the story as having integrity, and for me this entirely passes that test.\n\nAnd it's nice to see a Hindi movie in which parental disapproval is met with a \"cut your losses\" response rather than the sometimes maudlin kind of pining or carrying on about an \"incomplete\" life we often run into.  Moreover, this dynamic is not at all irrelevant to other levels of meaning in a story about a man in India who take on large defeatist cultural expectations to achieve success.  How should we respond to Father or principles or rules that are truly not serving our interests? It is also not irrelevant to how he plays his hand in relation to the corruption and cronyism he meets when he goes to Bombay to make his way.\n\nAishwarya is fine in a wife-from-the-village role who is a partner all the way, and I love her dancing. She also shows a definitely womanly aspect as the movie goes on. I am glad to see her in a role that does not confine her to the vulnerable-verging-on-breakable girl she is sometimes stuck in.\n\nMithun Chakravorty (of Disco Dancer fame) was  nothing but perfect as a newspaper owner who was a father figure to Gurukant and also significantly opposed some of his decisions.  The presentation of that complex relationship is a giant strength of the movie.  I don't recall running into this before, a scenario where an older generation figure is out to bring down a \"son\" and the love between them is dramatized as going on nonetheless.  I found it emotionally powerful, and insofar as there is a background allegory about India, excellent, about opposing and maintaining ties.\n\nIn a subplot that I couldn't find the rationale for, Vidya Balan as a lame girl and Madhavan as a journalist with high ideals and non-idealistic practices were appealing and romantic."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "prashants17",
        "review_rating": "6",
        "review_title": "Just Average",
        "review_detailed_main": "Much hype about what??, its just an average flick, far behind much less hyped but better made flicks like Main Aur Meri Biwi, Khosla ka Ghosla.\n\nThe performance were OK I would say Abhishek was good but nothing great about it, Mithun after a long time got a good role fitting for his enormously mostly wasted talent, Ash was good, the support cast has done a very good job, the music and cinematography are nice, but the story does not have the gravity and feel of a classic, Mani Ratnam has worked hard tough and you can easily tell that, its based on Dhirubhai Ambani's life, and is overall a average flick.\n\nMay watch on DVD."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "xbsd",
        "review_rating": "5",
        "review_title": "Inspiring movie with some flawed messages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "jawahar4",
        "review_rating": "8",
        "review_title": "A perfect wedding gift",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "suri504",
        "review_rating": "8",
        "review_title": "A Masterpiece! What else u expect from 'Mani' ?",
        "review_detailed_main": "First forget that its based on whom and what? thats not needed to see this movie. It has every thing a good movie needs to have. Casting, music ,cinematography, above all a great subject, that is still relevant.\n\nIts a story you may or may not think is great. But its a story that was told in great way. Don't try to judge, you can't judge something practical with something that is theory.\n\nIf you want a movie that can project life-spectrum in another angle, here it is.\n\nWhat I can say is DON'T MISS IT."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "doesn't meet expectations but it's an okay one-time watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "fairyjo",
        "review_rating": "7",
        "review_title": "Missing the subtitles",
        "review_detailed_main": "I saw this movie while I was in India last week. It is a good movie altogether, all in Hindi - which of course I don't understand - and it lasts for 3 hours - which is very long for a European viewer. Anyway, the story is good and complicated unlike some other Bollywood movies but it is worth to see the most of the characters lives to understand and appreciate it. The actors are excellent and will keep you interested in the movie from the beginning to its end. I only wish Bollywood would add English subtitles, that would bring more viewers in the Indian cinema theaters, and more interest from the entire cinema world to the Bollywood movies. This genre deserves some recognition worldwide."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "paul-2914",
        "review_rating": "8",
        "review_title": "Was I lucky to find this...",
        "review_detailed_main": "Visiting my local cinema in Brussels, there was only one movie with tickets available showing in Original Version and not French language/dubbed. I had never heard of Guru and it never occurred to me that the Original Language was Hindi!\n\nAfter 2 minutes of shock. I loved every minute: the way the director shamelessly grabbed your emotions by the hair and shook them around; the confidence not to show you everything that happened but to make you think during the film; the fact that almost every character was drawn in grays, not black and white; the way that you loved Guru, even when you neither liked nor respected him; most of all the mesmerising performance of the lead actor.\n\nAnd as I think back on an apparently simplistic plot, I am always drawn back to the complexity of the central relationships between father & son.\n\n3 hours of my life that I definitely don't want back :-)"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "singh-amrit",
        "review_rating": "6",
        "review_title": "Dream of a villager fulfilled, Dream of cine goer shattered.",
        "review_detailed_main": "Let's start with the good things. The concept of the film to start with, is excellent which has a tremendous potential for a great movie. A dream star cast only adds to the potential of the film. And when it's Mani Ratnam, you can be rest assured of good direction and acting. So you enter the theater with sky high expectations. But alas\u0085!! You find that most (if not all) of your expectations start falling straight on the face one after another. And by the time it ends you realize that the concept was the only thing remained good till that time.\n\nThe story, which should have been the story of struggle, set backs and standing again, realizing dreams at all cost, manipulations needed for success and then maintaining success is trimmed to fit in two love stories and some entirely unnecessary songs. You cannot stop wondering what exactly Vidya Balan is doing in the film. And when a mature looking Abhishek Bachchan stands a delivers a emotional cum strong speech to none other than the chief magistrate of the inquiry commission, the attempt to copy Amitabh is very clear. You expect a better job from Abhishek now. Aishwarya is decent in her role. Mithun Da leaves a mark. Cinematography is A grade. But music, always a high point of Mani Ratanam's film is a let down this time. None of the songs would leave you humming the tunes. Its time to pull up the socks for A R Rehman.\n\nOverall a very average film. Its more disappointing since you go with hell lot of expectations. Don't expect too much and watch it, it definitely a one time affair."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "kooleshwar",
        "review_rating": "8",
        "review_title": "Great Attempt but only good execution....",
        "review_detailed_main": "Let me be frank I had no intention of watching this movie, the only reason I watched this movie was because my family dragged me to it. I am very apprehensive about watching dramas and ever since Mani Ratnam denied that this movie is based on Dhirubhai Ambani and named the character Guru I was sure I wasn't going to watch this film.\n\nThe movie starts out OK enough, 15 mins into the movie you that Mani was lying and this movie is in fact completely based on Dhirubhai's life.\n\nThe movie shows early signs of trying to be a formula flick though, WTF is an item-number doing in this film. Nevermind that, to add to itwe have the signature Mani Ratnam entry for the heroine with the song and dance (think Roja) and that to within 5-10 mins of the item-number what the hell.\n\nStill the first half entertains certain parts of his life have been whitewashed and modified to avoid lawsuits. For example Dhirubhai by his own admission made his fortune in Aden, Yemen not in the spice market but by smuggling Yemeni coins that contained silver at that time, he claims he made lakhs but came back to India with only 15,000 (did he use that money to bribe or blew it up god knows).\n\nAnyway the movie moves at a fast pace and even though you know the eventual outcome you want Guru to succeed and thats the biggest victory for the movie in the first half.\n\nYou are willing to forget the songs,and the whitewashed storyline (maybe he did it because there was probably no way he could have used Dhiru's real name and shown anything but Superman, hence the change of minor details).\n\nYou give him the benefit of the doubt and instead go with the flow of the movie, wishing from your heart that Guru wins.\n\nBut the second half is a different ballgame. You are suddenly distracted by a Love Story involving the side characters (as if the extra-sweet and obviously fictitious scenes between Abhishek and Ash weren't enough).\n\nSo here we have a man struggling with morality, on war with his godfather and in the middle of it we have two minor characters kissing in the rain .\n\nAnd how is this scene important to the movie??\n\nTo add to that you have couple of more songs, by the end of it, the supposedly most stirring scene of the movie,towards the end, ends up nothing more than a damp squib.\n\nYou can literally feel the pulse of the audience dip after every song in the second half(which are far from good anyway what happened Mr. Rahman). A lot of the good done in the first half is washed away by the end of the movie.\n\nThe acting of the movie is great throughout.Abhishek Bachan as expected steals the show and this is completely his movie and probably the first time he has carried an entire movie on his shoulders, hats of to him.\n\nOn the other hand Ash did an ordinary job somehow she is not able to strike a chord with the audience,maybe be the fantastic acting all around her had something to do with it.\n\nMithun was also brilliant giving a stellar performance as the powerful,idealistic yet humble publisher. Its great that he has decided to return to A-list films, we need other great actors of yesteryear's to come forward do roles that suit their age.\n\nTechnically the film was nothing special(wasn't required anyway) yet the direction, cinematography etc met the standards of an A-list film.\n\nAnother glaring flaw of the movie was that even though we spent 3 hours with the character we were still shown only a whitewashed uni-dimensional character, the fact that Guru was ruthless and corrupt and often put portrayed that he was doing things for the public good but instead did it mainly for his own (anyone who's owned a reliance will know what I'm talking about he-he).\n\nHis corrupt practices we mentioned but in a passing manner inter-spread with the hyper-annoying love story. I mean we love the guy and we're not going to stop loving him just because you show us his other side, no ones perfect, it didn't make sense to only mention his malpractices and then not show us that element of his character.\n\nHowever the most enduring fact about the movie is that At least ITS FULLY ORIGINAL, no rehash of dozen English and Hindi movies here. Indian Cinema is at a loss for ideas and any movie with this amount of originality gets great bonus points for attempt I may not appreciate biopics in general but I really appreciated the originality.\n\nIn all a good ORIGINAL movie that looses out in the second half but is worth watching if your looking for some family entertainment. Not the kind of movie you want to see with your friends (if you don't like such movies/Hindi movies etc allow yourself to be forced for this one, use the credit to get yourself out of watching movies like Ankahee).\n\n-s uni-dimensional portrayal, boring second half, distracting and ordinary songs (at best), unnecessary side love story (atleast no songs).\n\n+/-s Ash (i feel shes better of getting married and claiming she left on top),Abisheks good but round the clock publicity and announcement of marriage etc I've already overdosed.MOVIE Doesn't TAKE A STAND.\n\n+s super acting all around, Abhishek B, FINALLY AN ORIGINAL FILM, meets industry standards (techinically), many moments mainly in the first half that connect you to the movie.\n\ntotal 7+1/10 (the one is for the original attempt in absolute terms this movie is more of seven, this movie will be better remembered for the marriage announcement and the fact that Abhishek proved his mettle, than for the movie itself)."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "satan15",
        "review_rating": "7",
        "review_title": "Good effort but not of really high quality.",
        "review_detailed_main": "It is not a well-made movie. I would like to point out some glaring mistakes in the film. Though Mani Ratnam is a very respected movie maker but in this film I didn't see him living up to his reputation.\n\nFor one the setting of the movie is the dry and arid Chorwad area of Gujarat. Any one who has ever set foot on Gujarati soil knows how dry it is. There is not a source of water for miles around and women often walk hours to fill their pots every day. There is not a single big river in the entire region.\n\nBut the whole movie seems to have been shot is some doaba area of Deccan. The temples, the topography, the rivers and the village tanks all seem to shout out loud that it is shot is South India and not Gujarat.\n\nThis shows that the movie makers are not ready to find beauty in the locales where their movie is based but rather would go for their old tried and tested locations that they are comfortable shooting in.\n\nThese kinds of attitudes seem to be unprofessional on the part of the movie makers. No wonder our movies fail to make a mark on international arenas. It is simply because even our best filmmakers are not prepared to venture beyond their comfort zones.\n\nOther than that there are frequent omissions and mistakes. For example when the hearing of Gurubhai is going on and the photographers are shown shooting the proceedings in a frantic manner. On of the photographer has a camera that does not even have a Lense. Many of the photographers are handling the cameras in a way that seems to suggest that they have never done so in the past. These small things are highly visible and they tend to give a negative feeling about the levels of professionalism of the film crew in general and lower the quality of the final output.\n\nThe disclaimer issued at the start of the movie doesn't really let off the movie makers of the responsibility of making the movie as factually correct as possible. For in spite of the disclaimer almost everyone knows who is being referred to in the movie."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "jain-ank",
        "review_rating": "9",
        "review_title": "Yet another well done movie from the Mani Ratnam stables",
        "review_detailed_main": "There are 2 levels of this movie: when you consider it only as a movie, and take all the performances for face value. The second level is where you draw analogies to Dhirubhai Ambani's life and try to dwell deep there.\n\nAt the Movie Level: Abhishek Bachchan stands out. If anyone had any doubts about his acting prowess (I never did, after his initial couple of movies) - they should surely be answered now. His dialogues are simple in words, but profound in effect. Of course, Mani Ratnam's screenplay helps bring out the best in him - but this has to be Bachchan Junior's finest performance till date. From schoolboy grins to young dreams to putting his detractors in their place, he does it all very well.The beauty of this movie is that characters have been in and out of the movie to highlight Guru\"Bhai\"Kant Desai's life and times. Aishwarya Rai is the only constant feature - and delivers a better performance than her recent misadventures in Dhoom 2 and Umrao Jaan. Other actors - Mithun Da (in a worthwhile role after God knows how long), Madhavan, Vidya Balan etc deliver their little cameos effectively and fade out. The beginning is powerful, the middle enchanting and the end inspiring. The only thing which feels a bit out of place are the dance sequences - which do not gel that well with the flow of the movie. Mind you, Rahman's music is as soothing as ever - though this is not one of the \"to be remembered forever\" scores from him.\n\nAt the next level, you are trying to draw parallels to the great Dhirubhai Ambani's life - you would find ample common there. The facts shown in the movie (15000 bucks to start, paralysis of the right hand, the first Merc - the same model was shown in the movie) are right out of reality. There are small variations to the plot, most notable being that the movie shows him having 2 daughters - leaving out his 2 \"illustrious\" sons (and leaving out the possibility of a sequel as well!).\n\nMy take - go and watch it, and when the DVD comes out, add it to your collection. This is one movie you would want to watch once every few years - just maybe to realize that indeed dreams can become reality."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Buddy-51",
        "review_rating": "6",
        "review_title": "a mixed bag",
        "review_detailed_main": "Despite its exotic setting and occasionally flashy technique, \"Guru\" is really just the oldie about the rube from the provinces who ventures to the Big Bad City in search of fame and fortune, only to fall under the spell of greed and corruption in his ruthless climb to the top. The twist here, though, is that the film is also a nationalistic David-and-Goliath tale of a man from the lower classes who takes on the entrenched corporate interests who use their collective power to keep men like him from sharing in the wealth. This leads to the rather bizarre, ethically dubious contention that it's okay to engage in corruption just as long as the people you are ripping off are demonstrably more corrupt than you are.\n\nAmbitious in theme and epic in scope, the story spans a thirty year period, beginning in 1951 when Gurubhai Desai (Abhishek Bachchan) leaves his village to make a success of himself in the outside world, and ending in 1980 when he and his company are facing prosecution for fraud, tax evasion and a whole host of other unscrupulous business practices that are threatening to bring Desai's corporate empire crashing down around him.\n\nDespite their undeniable virtues in other areas, Indian films are not generally noted for either their brevity or their emotional subtlety - and \"Guru\" is no exception in this regard. It suffers from an exhausting 155-minute running time as well as from a tendency to overstate its major plot and character points ad absurdum. When the people in the film are happy, they must be shown to be deliriously happy, dancing in the streets and throwing each other into the air to demonstrate their joy; when they are sad, angry, conniving or morally righteous, they behave in similarly emphatic and underlined ways, with A.R. Rahman's pumped-up, ear-pounding musical score wringing every remaining drop of subtlety and restraint out of the picture.\n\nStill, I suppose this is all part of the Bollywood appeal, and there are certainly some notable virtues that make the film worth recommending. First of all, the film is visually stunning, with one beautifully framed image after another unfolding in multi-colored, kaleidoscopic splendor before us. Second, there is a certain old-fashioned freshness to the utterly unabashed and shameless way in which the movie traffics in purple prose melodrama, wearing its emotions so transparently on its sleeves that it purges the story of all possible archness or coyness. (Think of it as a Douglas Sirk production with saris). Finally, as with virtually all commercial Indian films, \"Guru\" is decked out with a generous helping of lively, though admittedly quite corny, song-and-dance numbers that wind up \"stopping the show\" in both the best and worst senses of that phrase. For fun as these musical sequences are to watch, they do lead one to wonder if all the money that Indian producers so generously lavish on choreographers might not, in fact, be more wisely spent on a few judicious editors instead."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "rajeshk",
        "review_rating": "5",
        "review_title": "Why Guru didn't work for me ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "akashsingla",
        "review_rating": "",
        "review_title": "Overall a good movie, very good performance by abhishek bachan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "bandara_jaya",
        "review_rating": "10",
        "review_title": "Realistic",
        "review_detailed_main": "India, Sri Lanka kind third world countries has a big problem. They never give a middle class man to become the richer or bigger business man. The government or the public is burning with the jealousy. That's why we been as developing countries for centuries. The last message of the movie was fantastic. Loved the movie and worth of watching."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "yuhgyalwitme",
        "review_rating": "10",
        "review_title": "Abhishek Bachchan Cements His Legacy In Bollywood",
        "review_detailed_main": "Abhishek had his haters when he entered the industry, though by 2004 they were all wiped out some still stuck around but this movie silences his hardest critic. He gives the best performance of the year, and is just so incredibly talented in this role and he absolutely kills it. This rivals some of the best of bollywood's finest performances and he should be proud for what he is able to accomplish. The entire the cast performed well as well especially Aishwarya, this film ranks among Mani's top work and is just a really great movie. Though some plot lines don't get wrapped up, it was an amazing roller coaster and is uplifting. It is amazing how Abhishek gained and lost weight for different sections of the movie, and the camera work reflects that. 100% Recommend."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "nitishkumarmohanta",
        "review_rating": "7",
        "review_title": "Quite Impressive movie",
        "review_detailed_main": "It's late but finally I watched this movie, by taking inspirations from real life-story of Great Dhirubhai Ambani's journey towards became no.1 company of India (According to the Market Capitalization) from lots of YouTube videos. I'm impressed with the Acting of Abhishek Bacchan, he had done some spectacular job in this movie which is definitely deserves big applause for sure.The heart-touching songs are my nostalgia memories of childhood when I was about to enter into my teenages, so loads of memories with these song tracks (IYNWIM😉). The Direction, Screenplay and Background Scores are definitely well balanced despite of it's long duration. Everyone should definitely go for this movie. Definitely deserves 7 Stars from my side."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "rajesh-scorpi",
        "review_rating": "9",
        "review_title": "Terrific Film from the Master himself !!",
        "review_detailed_main": "Well, as soon as Manirathnam started to shoot for Guru, various theories started to flow among movie goers (like, it's the Ambani story kinda stuff).. And some controversies as well (like the Ambanis staking their claim to see it first)... So, this flick has aroused a lot of public interest even many months ago and with this as a background, it's been released.\n\nBefore starting my comments on the movie, lemme say something. . I've seen a lotta movies in English, Tamil, Hindi etc.. Out of all those movies, there are some directors who can handle their movies with such ease that the film stands as a visual treat, not only to the eyes but for the mind also. Now, Manirathnam is the emperor of such directors, in India, according to me. I'd put both my hands up in the air and shout aloud that he's one of the greatest directors ever to have walked our country. His movies stand as the perfect examples of how well a film can be taken, in their respective subjects. He presents his movies visually, so that one can take in the scenes in to his mind, rather than to be guided by mere dialogues.\n\nHere, he combines hands with his team again (Rajiv Menon, Rahman, Gulzar, Sreekar Prasad to name a few good men...). The end result, a fantabulous experience named 'Guru'!! If I say this is the role of a life time for Abhishek, it's an understatement. He has presented such a subtle and quality acting that as soon as he gets introduced as the young Gurukant Desai, slowly he disappears and it's GuruBhai who steals the show!! Such a great acting this is and he excellently personifies the character of Guru in a terrific sense!! The way innocent Guru slowly rises in life and his gradual majestic magnanimity has been portrayed by Abhishek in a mind blasting manner.\n\nAishwarya too has given a decent performance throughout. She supports her husband and provides him with the encouragement he needs. Mithunda has given an excellent piece of acting (the way 'excellent' has been used\u0085 many more 'excellent's to follow) . Madhavan and Vidya Balan complete the wonderful acting circle of Guru.\n\nCinematography is great, to say the least. People who know Rajiv Menon will agree wholeheartedly that this is one of his wonderful works. He shares that chemistry with Manirathnam which boosts the film up, from other normal movies. The Music!! It's done by one of the most talented geniuses, Rahman!! When he combines hands with Manirathnam, we get to hear (and see, as well) some fantastic songs and background scores, and here too it holds. I personally liked very much 'Ey Hairathen' and the way it's been filmed. The other songs also are great! It's an unmistakable truth that in Manirathnam films, he portrays romance in such a way that it stays in our heart, long after the movie's gone. In Guru also, the romantic scenes have been excellently (there goes... another excellent!!) made.\n\nAs a whole, this is definitely a must watch for all and especially for Manirathnam fans, it's again a treat which has to be gobbled up again and again!! Go see it people, and get inspired!! PS:- today morning (20/01/2007), me and my best buddy Balu saw this movie in Tamil. Know what ? Today night, we both are going to see it again in Hindi !! (and, this is his idea !!).\n\nManirathnam. . . . . . . . . We salute you!!!!!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "HeadleyLamarr",
        "review_rating": "6",
        "review_title": "Opportunities lost....",
        "review_detailed_main": "Guru is Mani Ratnam's latest venture after Yuva, a film I loved much more than the somewhat muddled Rang De Basanti. Expectations are high with any film from Mani and this is an unacknowledged biography of one of the country's giants, Dhirubhai Ambani. I am forced to ask several questions: 1. Is Mani becoming cynical due to the lack of commercial success for his films? 2. Is the route to success to stack up the stars, and employ the conventional masala? 3. Where is the objectivity one expects from Mani? We saw him take no sides in the conflict shown in Dil se but here he is not sitting on the fence at all, making this an \"official\" biography.\n\nWhy was Abhishek Bachchan chosen to play the role of Gurukant Desai? Did he match the physicality of Ambani? There are a very few moments when Abhishek does shine but mostly he leaves one uninvolved and uninterested. He caricatures the role, channels his dad in the angry moments and is a little too youthful in experience to get into the meat of this role. I would rather see him do another Yuva where I think he was probably the best he has ever been. Aishwarya is OK as Shanti, she is a sidelined character, the hand-holding wife. Her simplicity works in the film to keep her deglamorized. But why is she still reed slim after having two babies while Abhishek puts on more and more weight? And her dancing - can someone please tell her that swaying about in a reptilian fashion is not very attractive? The lead pair have zero chemistry - it is fine on his side, he did marry her for money, but there is not much at the other end either. Madhavan is much more real as the tenacious reporter, this young man has ample charm and talent. Vidya has nothing to do and does it while still looking very cute and managing to steal into our hearts. Her disease progresses in an alarming and unbelievable fashion - can someone tell the Hindi film industry to seek medical advice before concocting ailments? Roshan Seth is laughable as the panel head - like the old courtroom judges of the 70s. That brings me to the one reason to watch Guru. Watch Guru to see Mithun turn out an amazing performance - nuanced, powerful and towering above the rest of the cast. Maybe Mani should have cast Mithun as Gurubhai! Mallika in the Maiyya Maiyya number was sizzling - the character was clearly an item girl but of course Mani cannot stoop to such low class selling tactics so she had 30 more seconds after her dance.\n\nNow let us get to the music. One always expects an outstanding musical score in a Mani film - it is hard to forget the scores of Roja, Bombay, Yuva and above all of Dil se. But here the Mani and A R Rehman combo is unable to weave much magic. Ai Hairathe is beautiful, I like Maiyya Maiyya for its unusual sounds and the lines - Tu Dheere Dheere Khena Dariya Na Chalke, but the rest is most pedestrian. I hated Barso re in the film, Ek lo Ek Muft was laughable, and there was nothing else of note other than the fact that the music did not integrate well into the film. By the way - Abhishek danced like he was being periodically prodded by a cattle prod.\n\nBut by putting all these elements together Mani did get a hit film - so I guess he made the right call. Done that - now can someone please ask him to go back to making movies with soul like Bombay and heart like Dil se?"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "apoorv_784",
        "review_rating": "10",
        "review_title": "Abhishek's best performance till date. Ash also rocked!",
        "review_detailed_main": "Very inspirational movie I would recommend to everyone.\n\nPositives: 1. Stunning acting by Abhishek. All the actors performed well. 2. Aishwarya deserves a special mention. After a disappointing performance in dhoom 2 she has given a very good performance. Looked beautiful and the role fits her. 3. Good story and movie depicts realism. 4. Inspirational movie for all youngsters.\n\nNegatives; 1. Some songs were not required or were misplaced. 2. Second half lost some pace. 3. Vidya Balan acted well but her role was not required. It was probably used to raise the emotional quotient of the movie but it didn't work."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "shekhar-d",
        "review_rating": "6",
        "review_title": "Fascinating subject, disappointing movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "scorpion83",
        "review_rating": "8",
        "review_title": "Stunning performances makes GURU worth watching ! Thumbs' up for Mani !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sameermirji",
        "review_rating": "7",
        "review_title": "it would have been better if the ending was a fare one..",
        "review_detailed_main": "it didn't reach the expectations.. but must see movie. i don't know why Mani sir gave that kind of climax. except the climax everything seems to be just great. maniratnam didn't make abhishek to act in the climax. it clearly shows that he didn't have the faith in him. but some of the locations were superb. cinematography is eye catching. mithun chakravarty suited the role perfectly. at the end abhishek justifies that he has done all the illegal things for the sake of the people. but he never did it for them. some where the director failed to deliver. the story never convince you that why GURU bhai has been letoff in the end."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Ezekiel-Cheever",
        "review_rating": "1",
        "review_title": "The end justifies the means??",
        "review_detailed_main": "Awful movie, one of the worst Hindi movies I have seen to date...\n\nDon't understand the logic of this movie: You can bribe and break the law but as long as you are successful and a big entrepreneur in the eye of the world it's all fine? A dubious patriotic movie without depth and intellectual stimulation and with an ill-construed storyline and irritating male-female role portrayal. Purely appealing to a currently prevalent \"We are/can become the greatest\" instinct. Nothing else. What good is the main character doing? Except for egotistical capitalism.\n\nAnd doesn't it become boring to always have those flat stereotypical hero male roles and those flat stereotypical supportive, homely female roles? If you liked Rang de Basanti, you may like this one too. It has a similar strange \"the end justifies the means\" morale, although Rang de Basanti is still better."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "dr_faizaalvi",
        "review_rating": "10",
        "review_title": "solid performances and gripping story after long....",
        "review_detailed_main": "Before watching this movie...i simply had a not-so-good opinion about the latest last yr bollywood releases n on top of it viewers weired choices regarding favorite movies...oh come on guys movies like krish..if u remove the latest technology from that movie whats left...( priyanka's OUCH sense of dressing, typical love story with a garnish of an alien ..oh please ??)) agree or not, stories close to real life events always hav an impact on mind...make u feel as if u r part of it while u watch it...n this what makes a movie memorable when u actually flow with it...n GURU was truly that type...it s actually a story of this world...people rising from nothing to everything...n if u hav an understanding life partner then there is no turning back...\n\nwonderful flawless performance by Abhishek n Aish...admit it guys she can act n dance...and two thumbs up for Mani Ratnaam for good direction...Rahmaan Sahib u did it again ... lite classic songs...unique lyrics...add a lot to the movie...\n\nabove all its a lovely effort .. a family movie ( yes bolly wood can make family movies....but Mani Ratnaam had to add something to make sure that people watch it so Malika Sherawat was there to make sure of it...an accessory item just like always...i don't know how people digest her presence on the screen) anyway worth watching...i gv it 10/10 for a clear cut close to real life story n award winning performances,direction,music..."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "nikejaveri",
        "review_rating": "9",
        "review_title": "A solid start to 2007!!",
        "review_detailed_main": "In short, it is an outstanding movie. A very good start to 2007.\n\nJust saw this movie in the theatre and I seriously do feel this is one of the rare movies in which Abhishek has given a rock solid performance. Not only him but all the other actors are also very good.\n\nThe story begins very slow but is very well dealt with to the 2nd half of the movie. Just kept everyone waiting for what will come up next. Story base is quite common of a small villager with big dreams gets a job in Istanbul. He does do it with full commitment and gets promoted but he refuses to continue with the job as he feels that he may open his own business. A bit obsessed with money and dreams of doing something big enters into a world of corruption and bribe. This movie potrayes how he deals with all of this to become the ultimate businessman.\n\nIn my opinion, this movie should be given 8.5/10"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "priteshdg",
        "review_rating": "7",
        "review_title": "Not Fictional at all- Reel2Real",
        "review_detailed_main": "Saw this movie tonight .Well for sure can say it's not a fictional movie but almost 80% based on Dhirubhai Reliance industries.\n\nHere are the names of the reel2Real.\n\n1) Gurubhai = Dhirubhai. 2) Sujatabhen = Kokilabhen. 3) Manick Dasgupta = Ramnath Goenka. 4) Shyam Saxena = Arun shourie. 5)The independent = Indian Express. 6)Shakti industries = Reliance. 7)The Contractor Family =The Wadia Family of Bombay Dyeing.\n\nIts overall a nice movie. the events mentioned in the movie are more or less accurate with a little bit of fiction. for eg. the following section picked up from wikipedia.\n\n\"Dhirajlal Hirachand Ambani was born on 28 December 1932, at Chorwad, Junagadh in the state of Gujarat, India, into a Modh family of very moderate means. He was the third son of a school teacher. When he was 16 years old, he moved to Aden,Yemen.Ten years later, Dhirubai returned to India and started a business Reliance Commercial Corporation with a capital of Rs. 15000.00 (US$ 375). The primary business of Reliance Commercial Corporation was import polyester yarn and export spices.\n\nThe business was setup in partnership with Chambaklal Damani, his second cousin who was also there with him in Aden, Yemen. The first office of Reliance Commercial Corporation was set up at Narsinathan Street at Masjid Bunder. It was a 350 Sq. Ft. room with a telephone, one table and three chairs. Initially they had two assistants to help them in their business. In 1965 Chambaklal Damani and Dhirubhai Ambani ended their partnership and Dhirubhai started on his own. It is believed that both had different tempermants and a different take on business, while Mr. Damani was a cautious trader and did not believe in building Yarn inventories, dhirubhai was a known risk taker and he considered that buliding inventories with anticipating a price rise and making some profit is good for growth. [3]\n\nDuring this period Dhirubhai and his family used to stay in an one bedroom apartment in Jaihind Estate in Bhuleshwar. In 1968 he moved from the chawl to an upmarket apartment at Altamount Road in South Mumbai. Mumbai[4] His first car was Premier Padmini, the Indian version of Fiat 1100, later he bought a Mercedez-Benz Car. In 1970s he bought a white Cadillac Car.\""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "aishwaryalifegr8",
        "review_rating": "10",
        "review_title": "now thats soulful",
        "review_detailed_main": "you get to see a beautiful movie only once in a blue moon....and thats precisely what guru is....well written,well made,well enacted & very well a superb movie.....guru had been the cynosure of all movie buffs in the last few days(who were expecting lots) and has truly lived up to that expectation...\n\nso we have Mr. 'no nonsense' Abhishek Bachchan playing the lead Gurukant Desai...a man who struggles hard to fulfil his dream ...hats off to Aby baby...he has indeed proved his acting skills and done enough to keep the critics quiet.....\n\nand there is the beauty goddess Aishwarya Rai playing 'sujatha'- a 'villager' who didn't want to get marry so seen....ash!you have done a marvelous job...her song 'barso re' indeed is breathtaking.... there are so many other elements in the movie to keep you hooked on...we have a plethora of talent--madhavan,vidya balan,mithun da(yeah his comeback done for good') among others....not too forget the tantalizing mallika sherawat swinging to the Arabic-Persian combo-'may ya may ya'....\n\nall in all the movie is one heck of a superb movie.....gotta watch it out you people..."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "rajdoctor",
        "review_rating": "7",
        "review_title": "Guru -",
        "review_detailed_main": "Mani Ratnam's Guru.\n\nI had liked the performance of Abhishek Bachchan in Yuva \u0096 and that was Mani Ratnam's movie. That was the first movie when Abhishek \u0096 for the first time had acted well. But from the trailers of Guru and knowing that the movie is inspired from Dhirubhai Ambani \u0096 the biggest industrialist, I was not sure whether Mani would be able to do justice to this story with Abhishek as lead. With this doubt I had gone to see the movie.\n\nI am a Gujarati \u0096 and the character is from Gujarat, which made a basic connection with me. The movie tells the story of Guru (from Dhiru) a small village boy who is not able to pass his school exams and goes for a job to Turkey. In a short time he gets salary hike and promotion \u0096 and it is then when he decides to come back to India; telling himself and others that \"If his work is good why he should work for someone else and why not for him own business\". With all challenges surrounding him to stop him to become a business \u0096 but with his zeal, energy and self belief Guru goes ahead to become a small trader in Bombay and accomplishes becoming one of the biggest company in India. Through this journey he is accompanied by \u0096 in supporting or challenging him \u0096 his friends, family and wife; and in a special role Gandhian editor \u0096 Mithun Chakrawarty.\n\nAll credit to Mani Ratnam and Abhishek Bachchan to bring the role alive on screen. Abhishek brings the required energy, poise, body language and expression to suit each stage of his life's journey. Ashwarya as Abhishek's wife performs suiting the role \u0096 my only comment is she has become like a skeleton (what has she been doing with her body \u0096 starving to death?). Except the first couple of scenes where Mithun does not fit properly with the get-up; after that he has performed brilliantly. A good break for him after a long time! Madhavan as the upright reporter on a vengeance to expose the corrupt rise of Abhishek has perform well.\n\nThe movie is fast paced till the interval, but slows down in the second half. Mani Ratnam unnecessary tries to give some extra footage to Madhavan and his love story with Vidhya Balan. A totally waste of time and lost of pace! Also he could had made the editor do a better job in the second half, with some extra punching sequences of Abhishek's fight back from paralysis. I would like to make a special mention of Mallika Sherawat who looks gorgeous in the Turkish item number and Roshan Sheth as the Head of Commission prosecuting Abhishek. Roshan Sheth leaves his mark on a role tailor made for him.\n\nAll the songs in the movie are good. A.R.Rahman's music is brilliant as usual.\n\nMani Ratnam should get away with his proto-type heroine entry song \u0096 that reminisces of Roja song. Also the back drop of Gujarat is visibly shot in South India. The movie is perceived at the right timing during India's emergence as growing economy.\n\nOverall good movie. (7 Stars)"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "ridi-arahan",
        "review_rating": "9",
        "review_title": "One predictor of success is the foundation that we have about the relationship",
        "review_detailed_main": "What worked: Even after years of its release, the movie is fresh, engaging and enjoyable watch. What makes this movie a great movie is a right balance of film making process; direction, editing, score, screenplay and acting. Personally, one of the best Ratnam movies. The music and score blends very well with the narrative, and hats off to the screenplay and direction. Abhishek is phenomenal in his role. I think the movie deserves all the praise and appreciation. What did not work: Not that the songs are not good, they are great but I would have taken out or crisp the first two songs of the movie. I can not think of any weakness in the movie. Final verdict: highly recommended."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "mohitishar",
        "review_rating": "7",
        "review_title": "Guru - A well-handled saga of a well-known industrialist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "tonytharakan",
        "review_rating": "8",
        "review_title": "The 'Guru' of all tales",
        "review_detailed_main": "Mani Ratnam's latest is no classic and yet it's great how he manages to make a biopic so interesting (Yes, I would certainly classify it as a biopic - the similarities to Dhirubhai Ambani's life are far too many to be just coincidental).\n\nAnd so what if the protagonist succeeds using not-so-honest means. Today's audience is not naive enough to believe that a Gandhian approach will take people places in this day and age.\n\nAbhishek Bachchan excels as Gurukant Desai - a role tailormade for him. But the surprise package of 'Guru' is Arya Babbar. The otherwise flop actor puts in an understated performance as Gurukant's righteous bro-in-law. Wish there had been more of him in the second half. But Arya disappears after a row with Gurukant and the director doesn't take the trouble of tying up this loose end.\n\nThere are several other good performances - Mithun Chakroborty, Aishwarya Rai, Madhavan, Vidya Balan. But the real winner is the script which is taut and never allows audience interest to flag.\n\nAnother plus is the music. People say A R Rahman's music in Guru didn't quite touch the heights of Dil Se or Rangeela. But when you watch the film, the songs just seem to blend in and help take the story forward. Even Mallika Sherawat's hummable cabaret number."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "rockvishnu-68301",
        "review_rating": "7",
        "review_title": "One Of The Best Biography In India",
        "review_detailed_main": "Gurubai desai(Deerubai ambani) best biography in india. Abhishek Bachchan received almost unanimous praise for his performance. One of the best acting in abishek bachan movie career. The actor in this film who truly blew my mind, is Aishwarya Rai. There is a silent grace, quiet nobility to her performance,which I have to admit I've never seen before. Of course the film belongs to Abhishek Bachchan, the protagonist, Guru himself. And in all honesty, Abhishek rises to the challenge like never before. The beauty of Mani Ratnam's cinema is truly in its unpredictability. Ar Rehman music and bgm very unpredictable. Keep watch it."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "mokono",
        "review_rating": "3",
        "review_title": "Stereotypical and superficial but still pretty.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "ram_dhanush",
        "review_rating": "8",
        "review_title": "Mani Ratnam is 'Guru'....read this few unexplained facts",
        "review_detailed_main": "Ever since 'Nayakan' and 'Thalapathy', Mani has had something extra about him while making films, he told what goes comes around in 'Nayakan' and 'Thalapathy', and 'Crime does pay', but not everyone took that fact in those movies. Everybody have had their reviews, I don't want to get excited about Guru or be an idiot to find faults. Shyam Saxena was after Gurukant's blood for such a long, long time, and only after he earned the proofs through Ghanshyam Bhai, he managed to drag Guru to the court. Remember,Shyam has not managed to get enough proofs to convict Guru all time. Only when Ghanshyam Bhai revealed about the spinning lines and so on, he earned the proofs. Gurukant kept saying this to Shyam; \"can you prove all these?'...That's the point, Shyam threw the accusations, but was unable to prove all of them, that's why only 2 out of the 29 convictions were proved. The commission did not go easy on him bcoz he compared himself to Gandhi, but its rather due to this fact. Sorry, but many see it the other way. I think Mani's moves in this movie is well-justified. Some say Vidya's character is useless, but her character shows that Guru is not a selfish, hard-hearted businessman, it shows that he has equal affection to the people he care for. He cares for Meenu, and that's why the character was there, as a bridge between the businessman Guru and the human Guru. Affection towards wife and kids are normal, but affection towards Meenu is what makes Guru a good human being, not so bad. Maybe her caharecter could be expanded, but still the necessity is there. Watch Mani sir movies repeatedly, and you'll find a lot of things you did not recognize the first time. Most Indian movies are good the first time watching, and slowly, the flaws surface, but Guru is not such case. I have watched it five times, and as a film-making student, not only me, but my friends (who have hardly watched Indian cinema before, they are all from Indonesia, Chinese peoples etc.) have found the movie worth its ticket. And I did learn a thing or two from the movie (from a film-making perspective that's it), and as an audience, I say it big time (sapana dekh)...dream all you want..you can achieve it, and the movie does have its cult impact on me...until my friends have started calling me 'Guru'. Good, only idiots would say its no nice, and those people don't deserve to intellectually play critique roles in IMDb. But my gratitude to those who tell its not as good as expected, you are pretty true. I enjoyed Yuva more than this. But still, its special, and one cant ignore it."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "upen7",
        "review_rating": "9",
        "review_title": "Spirit of New India",
        "review_detailed_main": "Movie released on same day sen-sex fought back to 14k very much like the story line and sleek direction. Though I don't trade on the markets myself but I am sure our broker brothers either saw it before release or are going to be touched when they see it. I will keep it short and simple 1> AR Rehman: Amazing Background score 2> Abhishek Bacchan: Dad's genes or his own struggle but here he has proved he has all it takes 3> Mani Ratnam: Very good direction, sweet story telling but you don't say in the press \"it may be him (Ambani) or anyone else\". He is not telling a fictional story here, u will know when you see the movie... its the aura Dhirubhai left that makes Gurubhai so real And no one is really mentioning this but amazing sets, they have almost recreated a old south mumbai, mangaldas market!!!, turkey shots are good Inspiring movie though many might say not the right kind of inspiration but you surely leave the movie hall thinking bout it"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "yogeshkgoyal",
        "review_rating": "7",
        "review_title": "Guru movie shows how to get hold in market",
        "review_detailed_main": "I watched 'Guru' many times and I like it very much.\n\nHere writer has given good script for the new person who wants to take stand in market without any support.\n\nAbhishek justified the character as a new comer in business. He was in full masti since beginning till end.\n\nHe used good marwadi business tricks to fight with competitors who were well settled.\n\nAishwarya Rai also played good role and giving him the moral support.\n\nWonderful Music by A.R Rehman\n\nWell directed by Mani Ratnam\n\nIt was actually a good package."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "charit013",
        "review_rating": "8",
        "review_title": "great movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "movie_freak_dubai",
        "review_rating": "7",
        "review_title": "****** Intelligent movie with great Abhishek performance ****",
        "review_detailed_main": "Guru is a movie that is definitely worth a watch. Mani ratnam has scripted a movie that is very different from the usual bollywood movies and while the movie has numerous flaws and holes, i personally feel that it was a worthy effort.\n\nThe movie is held together by a towering central performance by Abhishek Bachan who has in my opinion finally put to rest his critics. It was a performance with many nuances, excellent dialogue delivery and all delivered with confidence and conviction. Ash was surprisingly likable, and was not as irritating as usual. These two performances just proves that if you give actors good material to work with they are capable of great things. The unrealistic dialogues and typical bollywood melodrama are not visible in this movie. AS for the supporting cast (mithun, Madhavan , Vidya Balan), they all did well. although certain aspects of Madhavan and Vidya Balan's relationship was not required.\n\nFor me the disappointing aspect was the music... this movie did not need any songs. A.R. Rahman was a tad disappointing plus i thought the lyrics were not that great either.In fact if the music was integrated in to the background then i personally feel that Mani ratnam could have had the opportunity and time to fill in the gaps and holes in the script and make it a tighter movie.... that too all well within the right time. Mainly more scenes in Turkey showing the making of the man Guru and more on the growth of Shakti corporation.\n\nMani ratnam needs to be applauded for his efforts and while this movie could have been brilliant it does fall short of expectations. All said i would still love to see other directors attempting to make a movie as novel as this and would always make time to see a Guru in the cinema."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "ohitz-s",
        "review_rating": "10",
        "review_title": "A worthy tribute to India's Best",
        "review_detailed_main": "Mani Ratnam! What can I say? He is a genius of a man. This has to rank among the best of his movies, and one of the best of all time! Screw all those who say he weakened in the climax or made a movie that was not mani ratnam like.. This is a tribute to a man that rose from a village and changed India's economic setup .. kicked the license raj.. changed things arnd .. and freed us from the shackles of closed economy .. this is a tribute to Dhirubhai Ambani, and for anyone to deliver a movie that justifiably paid a tribute to him .. they had to change their style .. move away from convention and break out of the box of even their own .. this is a movie that happens once .. in my eyes it was one of the best ever .. the performance this man has extracted out of Abhishek Bachchan is mind blowing! you start to realize that Bachchan is his name after all .. the genes are kicking in! and I might be going 2 far as to say this .. but really i am starting to feel as if he has reached his father's level in this movie! .. One of the best performances i've ever seen .. absolutely stunning. Amazing Picturization by Menon .. World Class! Well directed .. the emotional scenes .. are just wow! Climax is amazing .. thats right Gurubhai doesn't promote the wrong values .. he swims against the tide yes .. he decides to break the law but that is because hes a man who had different ideals .. and afterall a businessman does need this kinda attitude! Abhishek's speech is amazing in the end .. one of the most powerful points of the movie .. and also when he is lying the hospital after the stroke .. and the kids are singing to him Jaage hain .. I feel as if the background music was the backbone of the movie .. AR RAHMAN once again UR GOD! .. Abhishek Bachchan .. this is his movie .. absolutely .. Mani Ratnam .. this is surely one of ur best! its a masterpiece .. Go catch Dhirubhai .. I mean Gurubhai if you haven't watched it yet .. I have watched it twice in the theatres already .. absolutely amazing .. I can say so much more go on and on .. Madhavan delivered a great performance .. and Mithun Da's back! .. lol .. Aishwarya also shared an amazing chemistry with her reel and real life beau Abhishek! .. oh yes and as much as Mani wants to deny it .. those of us who know .. Dhirubhai's story .. know that its based on him .. India's greatest tycoon!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Zentaurion",
        "review_rating": "7",
        "review_title": "A glimpse instead of a meaningful study into the life of a visionary",
        "review_detailed_main": "I'll get straight to what I didn't like about the movie. The background score and the pacing. They are very inter-linked and both let down the overall experience. Every time in the latter half of the movie when Guru says just about anything the gung-ho \"Guru Bhai\" theme kicks in. This just pulls the focus away from the character and into his \"cause\". Instead of delving into the personal aspects of the character, his possible self-doubts, motivation, etc. it immediately becomes about a man fighting for the cause of the underdog in society. The poor pacing goes hand in hand with the music, with an entire song that seemed unnecessary.\n\nThere is almost no development into the titular Guru, instead letting the characters play of that character while their characters are developed and more rounded out.\n\nThe first half is an absolute joy, but after that it just wallows in mediocrity. Abshishek Bachchan keeps the character alive throughout it though. Aishwarya turns in a fair performance. Vidya Balan deserves more credit for her role despite it being weakly tacked onto the story. Madhavan does a good job of a character integral to the story.\n\nMithun shows why he is the one with the most experience though. It's a shame he didn't have more scenes as his character was the heart of the movie and it really would have helped to see more interplay between his and that of Guru throughout it all.\n\nA missed opportunity that really should have been better."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "bschandramohan",
        "review_rating": "9",
        "review_title": "Worthwhile movie. Excellent direction and acting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "nikhil-kaushik",
        "review_rating": "7",
        "review_title": "A Good Film!",
        "review_detailed_main": "A good film is one in which the viewer does not look at his/her watch. The film succeeds in this. Undoubtedly Guru will be watched by millions. The strength of the film is the character 'Guru Kant Desai'. Everyone of us has a little Guru inside us and the film allows the viewer to resonate with the Guru on the screen. The distractions of dance/exposures were unnecessary, yet they did not offend. Overall the film stands out as a good film because Abhishek Bachchan has done justice to his opportunities, that this character would have offered any actor. One only hopes that Abhishek plays such roles in future too, representing the Character rather than become a screen presence like Mr Amitabh Bachchan or indeed several other Bollywood actors have become."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "girishankar-g",
        "review_rating": "4",
        "review_title": "The Man who has seen tomorrow",
        "review_detailed_main": "A Maniratam movie, mostly shot in day light? Was it because Aishwarya and Abhishek had other business after sunset? A confident village bloke, Guru, quickly becomes a famous textile businessman before its time for intermission. The rest of the movie is a upsurge to Guru's grand yet powerless argument in the courtroom. Good costumes for Abhishek especially while he is at Turkey. His hit formula is definitely to imitate senior as much as possible by trying a Paan Banaras Waala type song and also by being biased to his left hand. With Aishwarya, if you removed the background from any song sequence, it is hard to tell which movie she is dancing for. Continuing the same 'see-my-hip-can-go-over-my-belly-button' step from Jeans to Hum Dil De Chuke Sanam to Guru, she has conveniently let Mallika's dance to slip up to the best dance in the movie. After Alzheimers in Black and several on Schizophrenia, it was time to introduce the Indian audience to another neurological disease in the form of Multiple Sclerosis (MS). While MS dawns during the 20s, Vidya Balan seems be limping from the age of 10. It is interesting how she predicts her d-day to be 420 days while the course of this disease is considered highly unpredictable with most people living a full life sans quality. I guess the attempt was to pull a Zameer (from Munna Bhai) for the sake of drama. Apart from such technical blemish, i think it is a good attempt towards awareness. In summary, one has the option of taking their extended family to a nearby theater to watch Guru, or use that money saved to buy some shares in Reliance. Eitherways, you will see Udhyan Mukharjee commend your decision."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "chinaegg",
        "review_rating": "10",
        "review_title": "Journey of Guru Kant Desai.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Vedan786",
        "review_rating": "10",
        "review_title": "A Delightful experience to watch!!",
        "review_detailed_main": "A really well crafted movie. All the actors have done what was expected of them in true professional manner. the Director of the film has been able to draw the maximum potential from the stars at this stage of their career. After watching DHOOM 2, surely everyone minds have have started to boggle. I had no doubt then that Abhishek Bachchan has a lot more to offer to the current generation. He does show style, vigour and mastery. In a recent press, his father commended this film and you can see how pleased he was. This is the first time Amitabh Bachchan has acknowledged his son's talent.\n\nAshwarya and Abhishek's chemistry in this film worked very well indeed although I must say personally they looked hot in their two previous films which were not appreciated by the masses.\n\nI do hope that Abhishek is in contention for the Best Actor award for this film. He carried this fully on his own shoulder! Well Done!!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "A good biopic but could be a bit better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Sherazade",
        "review_rating": "10",
        "review_title": "A spectacular masterpiece that will definitely be an accolade magnet!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sudhakaranakhilan",
        "review_rating": "7",
        "review_title": "From real to reel",
        "review_detailed_main": "\"The country has lost iconic proof of what an ordinary Indian fired by the spirit of enterprise and driven by determination can achieve his own lifetime\", these are the words from the former Prime Minister of India, Atal Bihari Vajpayee in his condolence speech on the demise of the great entrepreneur and businessman Dhirubhai Ambani. Mani Ratnam's Guru is loosely based on the life of this business tycoon. In the film, Dhirubhai changed to Gurubhai and some things got their fictional deviation from exact events. Reliance changed to Shakti, Chorwad change to Idhar like many more. But the basic idea of the movie lies in the life and the business path of the veteran entrepreneur. It is a classy film where the film talks about the post-independence era and the neglect of the country's choice of 'White' symbols. Guru is similar to this because he wants to establish his own business here. He always says that I am going to work for the country. He was always been taught about the reliance on his own country and wants to uplift the name of the country across the world. At the final moment of the film, Guru exhibits his ideas behind this development of establishing the business empire with money or something like shares from the common people. He often says he belongs to the common section of society. He arranged his general body meeting on a cricket ground because the number of shareholders is numerous in his business firm and he states that they are the owners of this firm. This is actually the public platform for the people to engage in business and that's why people stood along with him when the authorities finds irregularities in his business deals. Mani Ratnam just copied some of the real-life moments of Ambani and arranged them in a smoother and believable way. Apart from the romance portion, the film completely stood along with the real 'Guru Bhai aka 'Dhiru Bhai."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "vaibhav_bhandeo",
        "review_rating": "8",
        "review_title": "Guru....Rocks",
        "review_detailed_main": "Story telling is an art and Mani Ratnam knows it very well. Standing against the odds and coming up always as a winner is what Guru is all about. Movie depicts the chronological growth of a Guru and how he deals with the roadblocks coming in the way of success. A person who start from zero and becomes the biggest entrepreneur of the country; this is what Guru is all about.\n\nThe main character Guru very well played by Abhishek but still on some place I see a copy of Amitabh especially in the courtroom scene which in undoubtedly the best part of the movie. Movie stretches to almost three hours and in the second half bit slow;I found first half amazing. Asihwarya played a brilliant role; I would say her best performance after Hum Dil De Chuke Saman. She looked gorgeous through out the movie; pity that she is so glamorous that even after lot of effort done by the makeup she still didn't look old. Mithun was superb in his role as a Satyawadi reporter so did Madhvan. Vidya Balan in a small role was just good. The supporting cast also justified their role as per the requirement. Cinematography is eye catching and so as the music by A R Rehman. All in all this is a good movie to be watched. Highly recommended.\n\n-Vaibhav"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "7",
        "review_title": "Guru is the story of an ambitious, middle-class man who has big dreams.",
        "review_detailed_main": "Guru is the story of a man who believed not only in personal growth and personal success, but in empowering the very people who contributed to his success. A man who understood that the growth of an enterprise, a company, a corporation must reflect not only in its owner's personal growth and success, but in the growth and success of its every shareholder. You see, the similarities to Ambani's life are far too many to be simply dismissed as coincidences. And yet Mani Ratnam insists Guru is no biopic of Dhirubhai Ambani. Then again, poor Mani Ratnam is probably just protecting himself and his film.Remember what happened years ago when word spread that a character in his film Bombay was inspired by Bal Thackeray?As is the case with most Mani Ratnam films that are centred around seemingly larger themes - Roja, Bombay, Dil Se, Kannathil Mutthamital, Alaiypayuthe - Guru too, is on one level a love story. And here, in the case of Gurubhai Desai and his unflinchingly supportive wife Sujata, played by Abhishek Bachchan and Aishwarya Rai respectively, it's a beautiful, intimate, playful, passionate love story. I mean, think about it, who else but Mani Ratnam could film a bedroom scene playfully? A grown couple in bed, husband gets frisky, next thing you know they're smacking each other mischievously, and what a moment it makes for.Now I know I'm stating the obvious when I say that nobody shoots songs the way Mani Ratnam does, but really it's once again true in Guru. Whether its Mallika Sherawat's item song set in Turkey, or Aishwarya's introduction number, every song is part of the narrative and is used specifically to continue the story. But if there's one song that sticks out like a sore thumb, then it's that celebration number in the second half, right after the couple have become parents. It's a song that doesn't fit into the narrative and only slackens the film's pace because it's so purposeless.The beauty of Mani Ratnam's cinema is truly in its unpredictability. How he infuses humour or just creates wonderful moments out of the most ordinary situations. Look at that confrontation scene right before intermission. The one between Guru and his mentor, newspaper magnate Maneck Dasgupta, played by Mithun Chakraborty - it's a scene, which in a film by any other director, would have been treated as a loud, screaming match, but here Mani Ratnam treats it gently, and yet he doesn't lose the gravity of the moment. My favourite scene in this film is the one in which Guru visits the home of the journalist who's hell-bent on bringing him down. Once there, he discovers that the reporter, played by R Madhavan is married to his very dear friend, one who has a very special place in Guru's heart. It's an awkward moment between the three of them, and no doubt it's now a complex relationship he shares with this journalist. But you have to see the simplicity and the beauty with which the director treats this scene. It's moments like these that hold together the film and your interest in it, even when the screenplay begins to drag. The film's second half moves at a sluggish pace, but I'm not sure how much Mani Ratnam can be blamed for that. You have to understand two things here: One, passage of time is always difficult to show on film. And two, it is after all the story of a man's life, you can't expect high-drama at every corner.The sign of any good film - remember this always - is when all departments blend together seamlessly and no one department stands out from among the others. How many times have you felt that a film hasn't worked for you, but the camera-work really impressed you? Or the music stood out? The thing about Guru and about most films by Mani Ratnam is the consistency in its technical quality. Having said that, I'm still going to point out that Rajiv Menon's cinematography is imaginative and also remarkable in the manner in which it effortlessly alternates depending on the mood - from eye-watering splendor in Aishwarya's rain song, to dramatic swish-pans in the court scenes, to the lavish, epic-scale trolley movements each time a train pulls into a station. As for the music, what can one say about A R Rahman's score that hasn't been said before, except that he seems to reserve his most versatile best for Mani Ratnam. Of the film's cast, Mithun Chakraborty playing the Gandhian newspaper baron, deserves mention for the dignity which he brings to the part, one that's clearly inspired by Indian Express founder Ramnath Goenka. The actor in this film who truly blew my mind, is Aishwarya Rai. There is a silent grace, quiet nobility to her performance, which I have to admit I've never seen before. I think it can be safely said here that she's truly a director's actress. It's very evident that Mani Ratnam is neither overwhelmed by her beauty, not intimidated by her star power and perhaps that's why he treats her character so regularly. Of course the film belongs to Abhishek Bachchan, the protagonist, Guru himself. And in all honesty, Abhishek rises to the challenge like never before. With varied expressions, with a change of gait, with studied body language, Abhishek plays both the younger Guru and the older man so impressively that you cannot help admit this is the best he's been, in years. Now if you want me to nit-pick, then I'll admit the film as a whole, isn't free of flaws. The climax, in my opinion, is a tad weak, and there are enough indulgences that could have been avoided. But still, Guru is an experience you must enjoy. Few filmmakers can translate their personal vision onto screen the way Mani Ratnam can. So that's two thumbs up for Guru - it's a must-watch for all."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sharmavipul",
        "review_rating": "8",
        "review_title": "Must Watch to appreciate a sincere effort",
        "review_detailed_main": "Guru is a kind of a movie that would reinforce one's belief in the sincerity of bollywood. It not only provided a good start for 2007 but also was able to wipe off the memories of last few bad months of 2006 (especially after Dhoom 2 disaster).\n\nThis movie is a story of a common man who fights all the odd against him and all the social pressure to become a rich man. The movie portrays how a strongly committed person can achieve his goals and very graciously also shows all the bitterness that surrounds the sweetness of the success. Guru is a very real world cinema. It does not tries to pose itself as a ideal world movie. One can feel that issues like dowry and corruption are promoted in this movie. But then we have to realize that this movie shows the time of 1950s and even today we are no where close to the eradication of dowry or corruption. At the end movie was able to send audiences home happy by forgiving all the misdeeds of Guru Bhai.\n\nThis movie is a showcase of excellent performances. AB can be rated as near flawless. It is especially very hard for him to satisfy critics since its a natural tendency for anyone to compare him with BIG B. But he was able to prove his own strengths in this movie and this will surely put him in the race for a national award this year. Though Aishwarya has given one of the best performances of her career, I would have to say that there was not much for her in this movie. But however small her screen time may be, she played it with utmost grace. Now comes the best part of describing the performances; this movie is a treat for ardent Mithun da's fan. This movie again proves what kind of perfomer Mithun is and what he can do in a movie when he puts his best effort. Some other strong performances includes Roshan Seth (as always), Madhavan, Vidya Balan etc etc.\n\nMani Ratnam is at his usual best. Screenplay is beautiful though he mixed a lot of south Indian touch with Gujrat. The villages and the backgrounds looked more like from Andhra than from Gujrat. A R Rehman was again excellent though I felt that Guljar was unable to do a complete justice with the lyrics. Story is well intact and will not allow viewers to take their minds away from it. Choreography is very ordinary but mix very well with the theme of the movie. I wont give full points to the costume designers as they gave a south India touch in a Gujrati theme.\n\nSome minor flaws: some parts of movie was redundant and unnecessary. The scene where Guru bhai goes to the minister for the approval of his petro chemical plant was not necessary. I think Director tried to show his enterprising skills but was redundant with other scenes through out the movie like golf scene, persuading IAS officer to open the trade etc. Sometimes it feels that movie is going very fast. But again I might be too picky.\n\nOverall its a must watch movie to appreciate a life time performance from AB and catch the glimpse of Mithun da's power"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "infinityToHeaven",
        "review_rating": "5",
        "review_title": "Very clichéd Movie Making from veteran Mani, it pales in style and fills with heroism, absolutely banal ....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "vishal_wall",
        "review_rating": "9",
        "review_title": "Finally a decent film by Mani Ratnam",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "harsh-nayak",
        "review_rating": "10",
        "review_title": "A must watch movie",
        "review_detailed_main": "This movie is definitely one of the finest movies Hindi cinema has produced ever. The casting by Maniratnam is very good. He has done justification to each character. Abhishek Bacchan is awesome as Gurukant Desai who resembles the character of Dhirubhai Ambani, one of the biggest businessmen of India. Gurukant Desai, a villager whose father was a headmaster in a school and failed in doing business advises him not to do the business because of his experience. But Gurukant Desai had other ideas in his mind. He went to Mumbai for doing business and gets success too. Eventually he goes on to become one of the biggest and most influential industrialist of India. It's a must watch movie for not only Hindi viewers, but also overseas viewers."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "gajjar-rushi-a",
        "review_rating": "8",
        "review_title": "Excellent, Brilliant, Realistic and Technically very sound movie",
        "review_detailed_main": "After watching Guru I would like to comment that such movies are rare and I don't know why but in between watching movie and after watching it completely I compared it partially with Mani Ratnam's own movie Nayakan with Kamal Hassan only by way of PERFORMANCE. Mani knows how to explore a character deeply and serious movie watcher understands it well. Hats off to Abhishek as its HIS THE BEST MOVIE till date. Another man in the movie is Mithun Chakravarty as I've seen him after a very very long time in a totally different and unimaginable shade and character. His role is tailor made. Above all movie could be some better but whatever it is... ITS BEST in present movies."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "soumyalal2",
        "review_rating": "8",
        "review_title": "GURU: Best Of Junior Bachhan",
        "review_detailed_main": "Performance of Abhishek and Aish is the Strong point of the movie. Both of them had shown their best caliber. AR Rahman's music does magic in the background. Dhirubhai Ambani's biopic had to be grand and this is grand for sure."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "hXz0r3",
        "review_rating": "10",
        "review_title": "Noone in Bollywood could have done better.",
        "review_detailed_main": "Hats off to last 15 minutes of \"Abhishek Bachchan\". I rated him lowest for few films, but this one is outstanding.\n\nYet another inspirational movie."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "vijayanand-raju",
        "review_rating": "5",
        "review_title": "Sad...",
        "review_detailed_main": "Just came back from the theater after seeing \"Guru\"... Neither Abhishek Bachan, nor Maniratnam have done Justice to Guru or to Dhirubhai (Since this is supposed to be a take on him)... why does Abhishek have to ape Dhirubjasi's mannerism's to the core, when you can clearly see he is not able to do it... Marlon Brando aped Frank Castello (Mob boss) in Godfather, but Mario puzo (write or godfather) did not mention in his book that veto was like Frank Castello... Marlon Brando got his own style,a nd thats what clicked...\n\nManiratnam should go a bit easy on the direction and do it realistically, songs out of sync and I don't know why his heroines enter thro songs (roja, bombay, guru)... sets are immaculate, needs to be realistic... watch michael mann, sam Peckinpah movies...\n\noverall, needs improvement... considering Dhrubhai was very private person..."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "felix-spacibo",
        "review_rating": "8",
        "review_title": "Excellent.. Mani tries to re create the old magic..",
        "review_detailed_main": "The more u see Guru.. It appears inspiring, highlighting a true visionary.. People who made the difference in those days.. Mani has sculpted each scene which is evident.. But it reminds me of old movies.. The 'Godfather' image was very much evident.. And his all time great 'Nayagan'(Tamil) which itself was inspired from 'Godfather'. But Mani 's class stands on his way of portraying 'Guru'.. who is more subtle, cool, more outspoken than the other two.. But in last scene Mani shows 'Guru' is the 'Godfather' of business and he means business.. Big B should be proud of his son.. Ash is apt and the chemistry between them is good(obvious).. To me this movie is \"new wine in old bottle\".. tastes good.. looks familiar.."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Harshithnagraj",
        "review_rating": "8",
        "review_title": "Nice watch",
        "review_detailed_main": "Cinema was nice and story line was gripping and Abhishek steals the show and a salute to maniratnam and the negative I think is climax it can be concluded in different way. Overall a nice movie."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "agefreak_1000",
        "review_rating": "9",
        "review_title": "a good movie with power packed performances",
        "review_detailed_main": "OH well this movie has everything to offer one can imagine.....good acting, good songs, choreography etc.\n\nThis movie is about guru who wants to become a big business tycoon.... he marries ash and goes to mumbai to ful fil his dreams.....he becomes a big industrialist from a poor villager .......... he earns the favour of the people but this does not last too long and is soon declared as corrupted all because of the newspaper runned by mr chakarboty who points his needle against him for spreading corruption.....\n\nthere he realise the hardships that one has to face but finally with his effort starts up his own industry of textiles and faces a lots of hardships in future as everybody stands against him considering him corrupted....... This film has everything to offer especially the performances.... HAts off to the actors who threw mighty performances in this flick...... this was his best ever logical performance especially his power packed speech in the end which makes everyone clap........... ash also for the first time threw an impressed performance and gives a sign in improvement of her acting... the songs are also beautifully composed in optimistic backgrounds... overall this film is a GOODIE!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "reachrajdream",
        "review_rating": "8",
        "review_title": "A movie about dream.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "tariquebittu",
        "review_rating": "5",
        "review_title": "don't know what directos's thought",
        "review_detailed_main": "Nothing is shown properly how he set up his business how corrupted he was Abhishek don't deserve good movies like a election speech he can chenge verdict wasted my time"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "MuviFan73",
        "review_rating": "9",
        "review_title": "Inspiring story, of a successful businessman.",
        "review_detailed_main": "'Guru' is a movie which holds its inspiration from Hollywood movie 'The Aviator'. It is however based on life of Indian Business Tycoon, Dhirubhai Ambani. I would say it to be as a better movie, as compared to Hollywood version which was based on life of Howard Hughes.\n\nDirection, Screenplay, Cinematography: Merchant trading place, village scenarios, blooming romance, beauty of Ash, relations worth keeping, etcetera, everything has been captured well (4/5).\n\nTone: A man decides that now he will not work for anyone but establish his own business. He does that, he goes through many obstacles, finally succeeds which captures the tone nicely (4.5/5).\n\nMusic: Music is good (3.5/5).\n\nActing: Acting is very good (4/5).\n\nFinal Verdict: It is worth adding to tour DVD collection [(4/5) (9/10)]."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "shashankpatel-37369",
        "review_rating": "10",
        "review_title": "Super fantabulous",
        "review_detailed_main": "Maniratnam, mithun, aishwarya, abhishek, vidya balan, r madhvan. All industry toppers comes under one hood, showing the development of india's biggest business and its owner. One of the best."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "santhosh-10290",
        "review_rating": "10",
        "review_title": "Guru (Tamil)",
        "review_detailed_main": "The movie was so good. Abhishek Bachchan acted good in the movie. The story was also good in the movie. Songs were not good but BGM was good in the movie. Suriya's voice for Abhishek Bachchan was excellent sync."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "karthik-globalsoul",
        "review_rating": "9",
        "review_title": "The tirade of the bhais",
        "review_detailed_main": "(Karthik Narayan) The bhais have invaded Bollywood \u0096\"mum-bhai\", then \"Aslam Bhai\" and later, Munnabhai. Now, Gurubhai. While Munnabhai moved the nation with his silly humor and good natured bhai-dom, Gurubhai places India on the world trade map.\n\nIn 'Guru' Abishek Bachchan manages to consolidate his career, after the success of Dhoom 1 and 2.\n\nGuru is that rare movie where a businessman's success is related positively to the success of a nation.\n\nThis is the rags-to-riches story of a man who dares to take on the system. The road to success is not smooth and the protagonist overcomes obstacles by by-passing the system. Naturally, he gets into trouble \u0096 how he overcomes that forms the rest of this story. He struggles to lead a decent family life in the midst of busy schedules and chaotic stress. Friction with his mentors and relatives leads to distortion of relationships. \"Gurubhai\" has only Paisa, profit or munafa in mind while doing his polyester business and much later, with new lines of businesses like petroleum.\n\nSuccess comes with a price \u0096 the honesty and straightforwardness disappear and Gurubhai takes on another avatar, closely watched by Nanaji (Mithun Chakraborthy) and his pet reporter Shyam Saxena (a chocolate faced Madhavan plays this cameo to perfection).\n\nMadhavan meeting \"gurubhai\" for the first time & taking on the challenge of exposing Guru's corrupt practices to the world is good cinema. Ash looks gorgeous. The music by AR Rehman is pleasant - one stand-out song is the \"barso re megha\" song by Shreya Ghoshal. The sweetness and melody fuse to give sheer magic.\n\nGurubhai leaves you with a distinct taste of victory achieved after chasing it mercilessly.\n\nThe Bhais are definitely here to stay."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "venkat1926",
        "review_rating": "8",
        "review_title": "GURU- a biopic on an upstart trader building a commercial empire through hook or crook, mostly by crook. (does this remind you of somebody).",
        "review_detailed_main": "Versions-Hindi, Tamil and Telugu . IN DVDs subtitles may be available Actors: Abhishek Bachan, Iswarya Rai, Madhavan, Vidya Balan and Mithun Chakrvarthy.\n\nDirection: Maniratnam.\n\nManiratanam is always fascinated by morally ambiguous characters and such morally ambiguous characters are the main protagonists in some of his films. His Thalapathi is of a mafia pair. Nayakan is on Bombay slum don. Guru is on robber baron. The screen play is excellent and the production values are of international standard. The photography is a delight to see and the music by Rahman was as usual full of rhythm. The first song “Nannari” by the female protagonist is much better than “Jodi” song later. Iswarya Rai – herself and her dancing are feasts to the eye. Bachan runs through the role competently. The cameo roles of Madhavan, vidya Balan and Mithun chkravarthy are powerful.\n\n----SPOILERS HERE I have a quarrel with the denouement. Guru was hauled up before a commission based on the exposure by the newspaper baron (Mithun) and his journalist (Madhavan). Guru gives a reply to the inquiry in spite of his stroke; what you can derogatorily call “Bashan”. He starts “another man broke the law years back but I am not a Mahatma”. He has the audacity to compare himself with Gandhi. Gandhi broke the laws which he perceived unjust to the Indians not surreptitiously but openly giving notice to the government, Gandhi did not use either strong arm or soft arm tactics on the officers to get his way. Guru also gives a populist reason that earlier in his life getting rich has been only for rich people and the establishment is jealous that an ordinary middle class man tries to become rich. He also spouts the highly populist view of third world corporations beating the first world corporations. At the beginning of the inquiry Guru’s wife who speaks for Guru requests the commission chairman to talk in Tamil (I saw the Tamil version of the film) as she and her husband are village people and do not know much English. What hypocrisy? Ultimately the inquiry commission sets him free with a fine of only 63 lakhs. In the final scene Guru claims that his empire belongs to the shareholders who also became rich in the process and his business has become the top in India and will also become a top class organization in the World.\n\nThis is all usual libertarian crap from the mouth of a corrupt businessman. This film gives wrong message to the youth. It is OK to break the laws as long as you are successful. At least in Nayakan there is a suspicion of some remorse. At the end of the film Nayakan, his grandchild asks him “are you a good man or a bad man”. Nayakan replies “I do not know”. Guru succeeded during the environment of License Raj. Then the government (read high level officers) had hand in all matters and it is therefore necessary and easier to corrupt morally weak officers. Because of this also Guru did not face any competition. . But once liberalization started and competition increased I don’t think if Guru has now started his business with his morally ambiguous views, he would have survived. It is during this liberal period great organizations like Infosys, TCS, Wipro, Satyam Bajaj Auto, TVS etc came up fast with perhaps minimum shenanigans.\n\nGURU is an excellent film with a wrong pernicious message.\n\n----spoilers end"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "dashing-samson",
        "review_rating": "5",
        "review_title": "Maniratnam turns Businessman from Director",
        "review_detailed_main": "Madras Talkies- What an image this brand had! 'Roja', 'Bombay', 'Dil Se' are one of the finest piece of art from it which, received a tremendous response from both Critics and Box office. I understand that Critical Acclaim and Box office success seldom go hand in hand (Dil Se being one example).\n\n'Guru' clearly gives an impression as if its sole aim was to raise stacks of cash at Box office. Cleverly chosen star cast includes actors from each geographical zone: East- Mithun Chakravarty. Hindi Speaking (North, Center, West)- Abhishek Bacchan. South- Aishwarya Rai, Madhavan.\n\nAbhishek looks tired; Aishwarya looks too beautiful to fit in this role. The director fails to build convincing characters so such a wonderful cast appears ineffective.\n\nThe story starts with the ambitions of a guy and ends with his justifications of taking a devious course to achieve his goals. What message does it give to society? The final scene Court Room drama was totally meaningless. How can over 50 legal claims reduced to 2 just by one supposedly impressive speech by Guru Bhai?\n\nThe music is ordinary and stands nowhere in from of the music of Roja, Bombay and Dil Se. Rahman is so complacent by the fact that whatever he makes is admired by Bollywood.\n\nGuru is a wonderful example of what happens when a great filmmaker curbs his instincts to come up with a money spinning effort possibly to support his crumbling production house. There are people (viz. Gulzaar, Shyam Benegal) who have always given priority to critical acclaim over Box office success. I used to count Mani in that class but not anymore.\n\nYou come out of the Cinema Hall and curse yourself for watching this flick. Request to Maniratnam fans- Please avoid this or you'll lose respect fro Mani's earlier works as well.\n\nAnyway the meaningless film is a big hit along with its ineffective music. It bagged quite a lot of awards as well. But I strongly believe that people who have understanding of art would agree with my point of view."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "jemzz",
        "review_rating": "8",
        "review_title": "Great viewing, a must see!",
        "review_detailed_main": "Well I think this was a great movie, unpredictable to some extent and contained great performances from each and every character. Abhishek was almost flawless, Aishwarya Rai was also good and played her part well but I felt her character didn't have much to do which is why most people are not appreciating her performance, but all credit to her - and I think the pairing of the two has been the best in this movie so good for them! I would like to give a special mention to Vidya Balan and R Madhavan for their performances... short that they were, but they made an impact.\n\nI didn't want to include an spoilers hence I am not speaking much about the movie, but I will finish by saying that it's a great watch, funny, emotional and inspirational for those who are aspiring and have dreams they wish to fulfil! A R Rahman has also composed some great music and the Tere Bina song blends in beautifully! And Mallika S dances very well in her song appearance.\n\nJUST GO WATCH IT! :)"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "vigneshvelusamy-88765",
        "review_rating": "10",
        "review_title": "Master Mani sir!!",
        "review_detailed_main": "One of the best movie. It inspires me every time when I started feeling low. Mani sir did it very well and Rahman gives the soul by his sound. Orae kana song is a lifetime best song I heard. Both shows their magic together and really thankful to make us know about the story of a great buisness man dhurubai ambani. Which need to be watched by every single buisness man in India. Really happy to write this review in 2024. And I'm very grateful to do this. One again a big thanks to the master's of indian cinema industry real Guru's of cinema lovers. Mani ratnam & Rahman.. one of the underrated movie.."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "apant",
        "review_rating": "8",
        "review_title": "Guru - Inpriring and Powerful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "rounock",
        "review_rating": "9",
        "review_title": "Chota becomes bada",
        "review_detailed_main": "Aaj tum chote ho kal bade ho jaoge. Chota kaise interact karta hai bade wale se, yahi hai Guru ki kahaani.\n\nTranslate: Today you are small, tomorrow you will be big. How does a small person interact with a big person? This is the story of Guru.\n\n-- Gibberish text below to meet word limit.\n\n-- Bolo! Ajj we putputtin' like mini moja, kal we gonna be boombox bada boom! Samey samey samey, round and round we go. But puzzler this: When mini moja days, big shakers were scary whozzers? How to chat with whozzers? Guru's jumble just that! Big shakers and mini mojas, how they jingly-jangly together? Guru reminds us, everything criss-cross!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "kushal2091",
        "review_rating": "10",
        "review_title": "Brilliant 1!",
        "review_detailed_main": "Good Story Brilliant directing, Brilliant performance of actors made this movie too good to watch! What i think about this movie is i can watch it twice or thrice an year not a entertaining one but certainly u must watch it at least once in an year! Abhishek rocked, Ash was on song in 2007 so no comments on her! Masterpiece from mani ratnam but.......... the only concern is you can't watch it more than once in a month director failed to stick to the story for a while in few minutes of second half and same problem of bollywood songs in between film but........... you'll forget those negatives when you start watching the film!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "virindra",
        "review_rating": "2",
        "review_title": "What a waste of time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "viewing_audience",
        "review_rating": "8",
        "review_title": "Full Review - Guru",
        "review_detailed_main": "Clearly inspired by the life of controversial Indian entrepreneur Dhirubhai Ambani, Tamil filmmaker Mani Ratnam's politically inflected Hindi melodrama examines three decades in the life of Gurukant \"Guru\" Desai (Abhishek Bachchan, son of Bollywood legend Amitabh Bachchan), who rises from his modest rural origins to the top of the business world. Idhar Village, Gujarat, 1951: Young Guru bitterly disappoints his father, headmaster of the local school, by failing his exams. But Guru is less interested in academics than business, and takes the opportunity to move to Istanbul, where an uncle teaches him the basics of trading. Though Guru's knack for it lands him a promising job offer from a British petroleum company, he doesn't want to live in Turkey and work for Europeans. So he returns to Idhar, where he and his childhood best friend, Jignesh Patel, decide to go into business together: The only thing stopping them is money \u0097 though Jignesh's father used to be a moneylender, he's keeping all his spare funds as a dowry for his headstrong daughter, Sujatha (Aishwarya Rai). So Guru marries Sujatha, and the three of them move to Bombay, only to find that a web of trade associations and government quotas conspire to keep newcomers from establishing themselves.\n\nA fortuitous meeting with newspaper publisher Manikdas Gupta (Mithun Chakraborty) gives Guru the break he needs; Gupta, who's impressed by Guru's drive and energy, exposes favoritism within a local union, and Guru steps into the resulting breach. He becomes a successful yarn trader, then expands into fabric import and export. He sees an opportunity in polyester and opens a textile factory, later diversifying his interests to include chemical manufacturing. Guru's financial success erodes his integrity and he alienates old friends and supporters, including Gupta, who assigns hotshot reporter Shyam Saxena (Madhavan) to cover irregularities in Guru's Shakhti family of companies.\n\nGuru embodies a number of trends that have emerged in post colonial India, and when he's called before a government commission, he delivers an impassioned speech that emphasizes national pride \u0097 he and Sujatha even request that the proceedings be conducted in Hindi rather than in English \u0097 and the need for India to establish herself as a respected member of the international business community. Unlike most mainstream filmmakers, Ratnam doesn't try to include something for everyone, but he does deliver several handsome production numbers."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "ikaatar",
        "review_rating": "10",
        "review_title": "a story of greatness achieved",
        "review_detailed_main": "Guru is a story of a great man in the corporate world of India! His ups and downs in his life span! It was clearly acted by bollywood finest cast actors: Abhishek Bachan, Aishwarya Rai, Mithun, Vidya Balan and Madhavan. A fantastic film! Great material from India in a long time now!\n\nWhen it comes to the actors, Abhishek play the role of his lifetime, to describe in one word: BRILLIANT! He has really matured in his acting skills! Aishwarya Rai plays the supporting wife! Her performance is actually effortless! She suited well playing an ambitious simple village girl (it didn't hurt that she was damn gorgeous!).Other actors who impressed me were Mithun and Vidya balan, good in there own right. Mani ratman who is a great director didn't disappoint this time by extracting great performances and making a memorable movie with great tracks too from A.Rahman. Mine personal favorite was tere bina, which is centralized on one of the most celebrated couples in India. A great movie with great performances! A must see by all!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "BiswajitSince2005",
        "review_rating": "10",
        "review_title": "If You Can't run, walk, If you can't walk, crawl, but keep moving..... towards your goal.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sanjaybakariya",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Jordar. Nice movie. Jordar acting.\n\nAwesome Jara hatke."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "AnnieCian",
        "review_rating": "9",
        "review_title": "A Bollywood Gem",
        "review_detailed_main": "Guru is one of the best movies that came out of Bollywood in the recent years. The acting is superb and Abishek excels all his previous performances with his sensitive portrayal of Gurukant Desai, proving that he is indeed a talented and a versatile actor. Aishwarya's stellar performance completes the picture as Guru's devoted and loving wife, enriching the plot. It's a classic rag to riches story, intelligently done and true to real life. It's a must see for Bollywood fans.\n\nHowever, there is a major problem with the DVD Release. Although it states that it's \"all regions\" on the cover, including \"NTSC\", it does not work on regular DVD players. Only the second disk with \"Special Features\" works. Unless you have a free range, code free DVD Player you're out of luck. I had to invest into one, following the advice of the DVD seller, but to no avail. Picture quality left a lot to be desired and sound was disappointing at best. Which is a shame for it's a great movie and it should be seen at its best."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "springsunnywinter",
        "review_rating": "1",
        "review_title": "Soooooooooo boring",
        "review_detailed_main": "The story was not very interesting but the film itself was so slow and dull that I felt like I could complete a world tour and still be left with incomplete Guru. I rented the movie on a 3 day hire and I couldn't watch all of it at once. I've seen 1 hour on the first day, the second hour on the second day and the final half an hour on the third day so basically it took me 3 days to watch an 2 and a half hour movie phew! It should have been cut down to 30 minutes but it still would have been long. Personally I don't mind how long a film is, as long if it's watch able e.g. Salaam-e-Ishq was 3.5 hours and I seen the whole movie in one go and I really liked it. I just don't know how the audience managed to watch all of it in the cinema hall and it is the filmmaker's luck that Guru is a hit. The only good scene is Mallika Sherawat's cameo and the songs are also good but they didn't make the film any better so my advice would be to watch up to the song Maya Maya. Overall I think that Guru is specifically made for old people and youngsters should avoid it."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sai-vineet",
        "review_rating": "10",
        "review_title": "Mani Ratnam's Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "kkonakan",
        "review_rating": "9",
        "review_title": "Inspirational movie for entrepreneurs",
        "review_detailed_main": "Just watch it again and again till you like it. Come back and rate it :)"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "Geeta352",
        "review_rating": "10",
        "review_title": "Watch This Movie...",
        "review_detailed_main": "It is excellent in every way. Great Performances by all, great movie! Love the message conveyed."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "brajeswarchandra",
        "review_rating": "9",
        "review_title": "Nice one but with some minor loopholes.",
        "review_detailed_main": "Firstly great journey with superb acting by great actors. Flaws lie in some scenes as they didn't show any details about them. This also lies in characters, as too many characters so not so much information about them."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "saravanan-sp",
        "review_rating": "9",
        "review_title": "This film is Life time achievement to bollywood",
        "review_detailed_main": "Are u a business man.pls watch this film .U will get 95% profit from 50Rs through this film.This film is like reading a good book.It can change our life style,target and achievement.His previous film yuva is the concept of bringing the Indian youths to politics.This is the concept of bringing peoples in to business.Have u believe this is the biography of a business man.Is it possible to tell a story of business man in this interesting way.Its all magic in Maniratnams hand.I won't tell this is best of maniratnam .(compare with Kannathil Muthammittal-Tamil).As usual dialogues in this film also very excellent and sharp.Abishek is become one of the best actor in bollywood.AR.Rahman music is good but nothing special in songs.He did the Background music as well as Hollywood films.But this songs are not compare with his masterpieces.Some where we con't understand what is going on(eg:What gurukant was saying to petroleum minister).Finally if you are thinking of close your business pls watch this film before close down your business.U con't."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "sudeepmodak",
        "review_rating": "5",
        "review_title": "Gurukant Desai is a bad guy who promotes all the wrong values.",
        "review_detailed_main": "The review of Guru.- 2 ½*(two and a half)\n\nOne gets into the theater with huge expectations yearning for a good movie after Lage Raho Munnabhai . there's everything here what a moviegoer wants for him to be dragged into to the theater. There's Mani Ratnam making a Hindi movie after almost more then two years, there's Abhishek Bacchan in a speculated role of his life, there's Aishwarya in the lead with Abhishek amids their of screen chemistry at its peak , there's a.r. Rahmans magic which is already into the hearts and ipods of many. so every one is excited to go on a journey through the life of Gurukant Desai.\n\nThe first half catches pace after a while and intrigues the viewer with certain scenes . also the slow and steady growth of Abhishek Bacchan from a small time village boy to a business tycoon is interesting. Though at times the transition from the personal to professional life does confuse people as ultimately everything is left half baked. But the first half is the entire film. There did not seem to be a second half as the story just did not move. The director simply tries to complete certain unneeded tracks in the second half(like the Vidya Balan-r.Madhvan track) which really leaves the viewer completely bored.\n\nWhat is the major flaw of the movie is that the central character of the movie is not a good guy.the character that has been etched out is an unethical character. Right from the beginning he appears to be an extremely selfish man which never appeals to the viewer and moreover it does not leave any level of identification or will to imitate guru s life because everyone including the director knows that he is wrong. That's what gets the director into a fix as he tries to justify guru since he is his central character and the hero. but there is absolutely no justification to his actions. Thus the films basic ideology falls flat and fails to have any impact what so ever. Conclusion- just don't be like guru or else you will be screwed.\n\nWhat makes the film worth a watch is the music and the performances. The music really completes the film in the true sense as it actually adds color to the canvas. It almost seems to be a part of the screenplay since more then the dialogs or direction , music brings out the meaning of many scenes. Rehman truly makes one feel that they are visiting the life of a legend and an inspiration- Gurukant Desai which is suppose to be the intention of the filmmaker.hats off to him. Yes, the songs also seem to be misplaced but their hummable quality helps sustain them. For the performances Abhisek Bacchan undoubtedly gives the performance of his life but only if the screenplay would have been better. His travel through the various age groups, physical presence, and dialog delivery are truly commendable. He surely has evolved as an actor. Aishwarya is decent. But worth a special mention are Madhvan and Mithunda. Madhvan actually helps us know what subtle and real actually means and Mithunda proves that it is not for nothing that he is a two time national award winner and that he could really have earned a better and more respectable living without acting in those b-grade films. All in all as a film , Guru does disappoint us and is recommended just for the performances and the music."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "namashi_1",
        "review_rating": "9",
        "review_title": "Guru, A winner all the way!",
        "review_detailed_main": "Mani Ratnam's 2007 super-hit 'Guru' is easily one of the best films of all-time. The Veteran filmmaker makes a biopic on the late millionaire Dhirubhai Ambani in the most interesting, gripping manner. I loved 'Guru' from start to end. A fantastic watch!\n\nPerformances: Mithun Chakraborty is fantastic. He's truly a Legend. Abhishek Bachchan is excellent. His careers finest work. Aishwarya Rai is very good. Vidya Balan is good, ditto for R.Madhavan. Arya Babbar excels in a brief role. Manoj Joshi is efficient. Sachin Khedekar and Darshan Jariwala are note-worthy. Arjan Bhajwa is okay. Malika sizzles in her song.\n\n'Guru' is an excellent film. Two Thumbs Up!"
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "nik-naren",
        "review_rating": "4",
        "review_title": "disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "nravidas",
        "review_rating": "4",
        "review_title": "The Teacher fails to teach...",
        "review_detailed_main": "I went to watch the film with the only thought that it must be a good film, being directed by the great Maniratnam. The premise of the film \"Villager-Visionary-Winner\" seemed very encouraging. The opening scenes of the village, and the opening credits that wove through the dance sequence were very unique, one of a kind. The breathtaking sceneries (kudos to Rajiv Menon), colorful costumes, the opening dance and song were the exact ingredients for a magnificent film. It made me feel proud on how Indian films had developed over the decades.\n\nHowever, all these feel-good moments crumbled as the story unfolded with about 80% of the film's weight falling on the shoulders of the able Abhishek Bachchan. Somehow, despite how well he acted in this rather demanding role, it made me feel how hard he was acting to flesh-out the character. I suppose actors with greater experience would have made the lead character more believable, in the likes of Anil Kapoor, Vikram, Kamal Hassan, Jackie Shroff to name a few.\n\nA lot of the songs were not really necessary in a biopic kind of film, and were just adding length. Within one hour into the film I inadvertently looked at my watch thinking that the film was ending...nope, I had to sit for another hour or so for the finale. Some of the songs were great in the film, but somehow, not memorable or catchy.\n\nAishwarya's acting abilities were not fully utilized. More could have been done to give her role more prominence. Even her first dance sequence (reminiscent of Madhubala in Roja, who was way better and more natural) was no where near the dance performance of the cameo actress.\n\nMadhavan's role was short but irritating. The ravishing Vidya Balan's character was not even necessary.\n\nThe saving grace for the film was good old Mithun Chakraborthy and Roshan Seth. It was a pleasure to see such maestros on the screen. They gave the movie the worth it was lacking.\n\nOverall, I was rather disappointed with what could have been a good film. Films like Nayagan and Thalapathi by the same director will always be his flagships. In those films, one could go back and watch them over and over, and still enjoy and learn something new from them.\n\nWith Guru, somehow, this film fails to \"educate\" the viewers."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "anandsiga",
        "review_rating": "4",
        "review_title": "Not a great film",
        "review_detailed_main": "Maniratnam is considered one of the top directors in India. His films are money spinners. He is a clever manipulator. None of his films have originality. He cleverly adopts the story lines, scenes, even lighting and shot angles from numerous hits outside India. He may be the big box office hit giver to the film Industry in India. But he lacks honesty in film making. Guru is a pathetic attempt to palgarise the Hollywood film Aviator. It reminds you of even Citzen Kane or .. the list goes on. Through Guru's protogonist Maniratnam tries to insist that ends justify the means. The film can be seen for the excellent cinematography of Rajiv Menon. Otherwise it is a film as always with Maniratnam's other films ,pretends to deal with social and intellectual issues and fails. Maniratnam is a clever technician but not a maker of good, original cinema."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "viswas-tk",
        "review_rating": "4",
        "review_title": "Guru - Lacking Lame Loser",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "jpsgdoc",
        "review_rating": "5",
        "review_title": "watchable",
        "review_detailed_main": "I will say that this movie is definitely watchable but nothing to go gaga about. Perhaps when it is compared to other Indian movies it is much better then them and that is where it scores. It is a story about a man who was focused on his success. The story is told. We are shown about the difficulties people face when they set out for their dreams. But somehow it is not clear whether this story is being told to inspire those who watch it or to tell that what difficulties may come to those who dare. The theme is not clear. That is why to me this does not seem to be a great movie. And why so many irrelevant songs in the movie? As for acting Abhishek Bachchan is definitely good but I will say Madhavan was more into his character. Abhishek does not seem to have gotten into his character. At times there is a spark of a man who will not stop at anything to achieve success but most of the times he just seems to be acting. And that goes against the whole notion of being an actor. The viewer should not feel that the actor is just reciting. Maybe I am harsh on him. But I felt that Madhavan was better then him in getting into the character. Anyway to the question whether to watch it or not, I will say yes. But weather it is to be added to your home collection, I am doubtful about that. I am not going to buy it."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "yashasher-1",
        "review_rating": "4",
        "review_title": "4/10...Opportunity Lost!",
        "review_detailed_main": "I would like to like to state at the very beginning, I am not a fan of Hindi movies, & am definitely not a fan of Mani Ratnam movies. The only reason I would want to watch Guru was because of the rumors that it was to be based on the life of Dhirubhai Ambani. After watching the movie, I have no doubt that it clearly is.\n\nAs far as the movie goes, it fell woefully short of expectations. But, when a director attempts to make a movie on such an eminent personality, one expects a little bit more in terms of insight into the life.\n\nThis story line can at best be described as the romanticized perspective of a largely uninformed & unintelligent 3rd person. The story is poor at tapping the mind of a genius, and focuses on some of the controversial aspects of his life. The most controversial aspects, have been conveniently ignored.\n\nThe characters too follow the pattern of the poor definition of the story. After watching the movie, you will leave with a feeling of indifference towards most of the characters, while you would be frustrated with the shallowness & stupidity of others. Most characters appear a murky gray, rather than richly immersed in their passions or rich in their lack of.\n\nAdmittedly it is very difficult to make a movie of the life of an eminent personality like Dhirubhai. The fact that Dhirubhai's life is still so strongly etched in the memory of all does not help either. But, I would like to think there was more to the life of a great man than an unnatural ability to convince the characters in the movie of his views, while having little or no impact on everyone else.\n\nThis movie is a very small step forward in Indian cinema, where the life of a contemporary, controversial but great figure was tackled. But alas, fails to make the most of a movie making opportunity. Sprinkled with the masala recipe that makes all Indian movies, just like Udipi Restaurants in Mumbai make south Indian food. The same at every other corner, a far cry from the original. At no point talking a risk of being different, bold or even honest\u0085with unhealthy fats added for taste. The ringing of the cash register is always more important than the quality of the product try to make something to the lowest common denominator. Not hated but any, liked by a few."
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "amitgarg_pta",
        "review_rating": "1",
        "review_title": "It is respect over return in value over regret in solid liquid wax like public collection in fund off regret.it is movie.it is time.it is interval.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "IndianNeo",
        "review_rating": "",
        "review_title": "Meet India's most powerful man",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0499375",
        "movie_name": "Guru",
        "movie_rating": "7.7",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Biopic of Dhirubhai Ambani, well acted",
        "review_detailed_main": ""
    }
]