[
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "iantrader",
        "review_rating": "5",
        "review_title": "Worth watching but not as good as it thinks it is",
        "review_detailed_main": "I'll start with my usual writer/director moan although this isn't as bad as most, and Vaughn Stein almost pulls it off.\n\nIt's visually stunning, has some superb actors - Margot Robbie in particular - but the convoluted story-telling style and, indeed, the plot, make it less than it should have been. You'll have to keep your eyes and ears open and resist the temptation to walk out or switch off 20-30 mins into the movie. The stopy lines do come together, if slightly haphazardly.\n\nThere are some nice twists. One or two you'll probably have an inkling of. One you won't as there's no foreshadowing at all, and although it ties everything (mostly) together, you may well feel cheated as the writer(*/director) swaggers about thinking what a clever writer I am!\n\nStill, immerse yourself in a comic/noir-ish nightmare and see what you think."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Frame-By-Frame",
        "review_rating": "5",
        "review_title": "stylish but mediocre",
        "review_detailed_main": "Despite some excellent acting performances this film didn't do much for me. I felt like it was trying too hard to be too many things. Using a mixture of various film makers styles it just didn't seem to provide anything fresh. The story telling method used too many twists to work successfully. If stylish visuals and multi layered stories are your main thing then give it a go. Otherwise you may find some of the negative comments and low scores this film has attracted to be justified.\n\nMy rating 5/10"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "journeyousglory",
        "review_rating": "6",
        "review_title": "style over substance",
        "review_detailed_main": "Loaded with Alice references and quotes - but the only similarities in common with the classic tale is the theme of madness, which in this case was taken and ran with. This movie is decibel lit more style than substance, and curiosity will keep you moving through it despite the badly drawn plot. Characters did their best with what they were given.. Style over substance. It was just my style, really, if only there was more, anything more, to go on."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "joshteggert",
        "review_rating": "2",
        "review_title": "In his attempt to voguishly blend themes from Alice in Wonderland together with Sin City and Blade Runner, Stein has instead created a monstrously inconsistent mess.",
        "review_detailed_main": "Vaughn Stein has worked for years in the film industry, largely as second or third assistant director in projects ranging from 2013 blockbuster World War Z to award-winning indie flick Pride. Now, he finally releases his first feature-length film, Terminal, to UK cinemas - a project that he's had a rough cut of since 2016, which screened at Toronto International Film Festival that year.\n\nThis noir-thriller set in an eerie, unnamed city, follows the lives of the inquisitive waitress Annie (Margot Robbie) who leads a mysterious double life, a suicidal teacher (Simon Pegg), two hitmen (Dexter Fletcher & Max Irons), and a strange janitor (Mike Myers) as their stories intertwine through the works of a mastermind criminal.\n\nThis all sounds like it would make for an enticing picture, yet in his attempt to voguishly blend themes from Alice in Wonderland together with Sin City and Blade Runner, Stein has instead created a monstrously inconsistent mess that fails to realise any of its hinted potential.\n\nFrom the clunky cut-scenes to the categorically cringeworthy dialogue, Terminal is a pain to sit through. Frankly, the only thing more confusing than the desperately shoehorned third-act plot twists is how the likes of Robbie and Pegg got attached to the project in the first place. The script is agonisingly forced, the narrative terribly structured, and ultimately neither of these stars manage to elevate the film to something that is comfortably watchable.\n\nThe story is... well, there's practically no story at all. The narrative shifts between several time periods, leaving the viewer in a complete daze as to who's where and what's what. It is extremely difficult to associate with any of the characters, despite Stein - who wrote the screenplay too - sliding in background stories in a way that tries (but fails) to emulate Edgar Wright's unique flair seen in the Cornetto Trilogy.\n\nYet after all this criticism, a strange sense of guilt arises with it. Upon reflection, Stein's vision for the finished film becomes clear, but unfortunately so does the realisation of the wasted potential that Terminal is. Perhaps with a more cultivated director at the helm and a script rewrite or two Terminal could have been an intensely thrilling experience. Christopher Ross' cinematography harks back to Roger Deakin's fantastic Oscar-winning work on Blade Runner 2049, so the look of the film is impressive, but this only adds to the sad comprehension that this project was such a missed opportunity.\n\nThe overall picture presented here leaves behind an immense feeling of dissatisfaction. Not only is it a strain to recall the last time a 90-minute feature has felt so mind-numbingly long, but the plain ridiculousness of the plot twists alone (after an hour-or-so of build-up) are enough to switch the viewer's attention off. It really is eye-rolling stuff."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "meliz",
        "review_rating": "7",
        "review_title": "I really enjoyed this movie - try for yourself!",
        "review_detailed_main": "One should more or less never listen to others when it comes to movies. For me, I have barely heard about this movie so I decided giving it a go (not knowing what I ventured into).\n\nThe movie is all kind of weird, the neon signs, the whole dark atmosphere..but I really enjoyed it overall. It has a good soundtrack as well, which is something you should not disregard!\n\nOverall acting/casting was good.\n\nFor some reason it reminded me a bit of The Grand Budapest Hotel (do not ask me why)...\n\nAnd stay with it to the end!!!! I think you will get yourself a nice suprise by watching this seemingly \"simple and quiet\" movie:)"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "badly written",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "TriggerPullerUSMC",
        "review_rating": "7",
        "review_title": "I REALLY Liked This Movie",
        "review_detailed_main": "My movie needs are simple. I want to be entertained. that is it. I don't need any fancy references or nods to previous movies or directors etc. I don't need to be informed or moved or left speechless.\n\nThe best part of this movie is it makes it very easy to suspend belief. So you don't have to watch it and suddenly think oh man that wouldn't happen or gee that was wrong. It is highly stylized, the dialogue is great and there is a definite rhythm to it. The acting is great some of the back and forth between actors is actually very witty and very solid. It has twists and turns- none of them earth shattering but great nonetheless.\n\nI think every actor in it was great- I cannot for the life of me figure out why everyone hates it so much. My best guess is that pretentious people either thought it was going to be one thing and it wasn't so they are upset or pretentious people expected it to be more artsy like some of those noir type films can be.\n\nReading the reviews before I watch it I sort of knew it would be good. I think at a certain point people who I disagree with made it clear they didn't like it so in a sort of the enemy of my enemy thing- The bad reviews seemed like folks who expect too much of a simple small movie or tried to take this movie way too seriously and those who liked it seemed to simply take it as a piece of entertainment.\n\nMy wife and I watched it on a Sunday night after dinner curled up on the couch and felt like it sounded good, so we'll ignore the bad reviews and buy it on Xbox 1. I am really glad we did. The movie isn't going to change your life, it isn't going to be one of those life altering movies This movie was great and it did the one thing we wanted on a lazy Sunday night... It entertained us.\n\nMy God the people who hated this movie are the same type of people who loved La La Land and Mother- I will almost always enjoy a movie they hate- I watched two movies this past week- Black Panther and Terminal. Black Panther was applauded as being incredible- I thought it was just ok and I just can't get anymore involved with it than saying it was just ok.\n\nSo if you are looking for something a bit different than what has come out the last few years and can enjoy something for what it is- simple entertainment the give it a shot you'll probably also really like it.\n\nIn short, only people that hate fluffy puppies- don't like this movie."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "iamianiman",
        "review_rating": "5",
        "review_title": "Terminal is the Movie that Lets You Wait at the Station for Hours...",
        "review_detailed_main": "Unknown, bewildered and mysterious. Those are the words that appear across your mind as this tarted-up noir feelings cartoon shows itself with flamboyant colors spread around the hollow space of the ominous underground of terminal.\n\nThis dark tale focuses on a few key characters and their conversations and meet-ups with a deranged waitress played by none other than the charming with talents, Margot Robbie. The Terminal opens with Ms. Robbie as Annie who meets with a priest that will lead to a number of assassinations and overly complicated double crosses which is unbeknownst to the audience before the story uncovers itself layer by layer.\n\nThe plot is hazy and foggy for the first ride of 20 minutes but it does take shape beyond that that gives the thinking of alerting the audience to stop daydreaming and start paying attention as the story begins to properly revolve and complete its messy puzzles.\n\nMost of the plot and character developments here willingly to take in the form of twists. There are three major twists deliver within this movie and two of them are quite unexpected but stay to its relevancy of the unnecessary draggy and hard-boiled dialogues.\n\nEncountering the frequent odd happenings and disjointing scenes, time doesn't always move in a linear fashion here. The reason here is because Terminal is mainly relegated to two separate narratives that never quite intersect as a whole. It touches briefly upon another and moves on again with their story back and forth. What is even worse is those two separate entities entitle to slow down the front gear with the misdirection of irrelevant talkings however, they later on become somewhat important for the twists at the end gear that the audience could never see beforehand.\n\nRobbie serves as the personification of what we imagine a femme fatale would be, she delivers her character deep into dark territories as her face morphs into an evil-smiling mad scientist and scary-looking enchantress, hoping that the people watching may madly falling in love with her overly done character, or so you thought. Of course, Robbie does well with her performance as usual but the servings of the substances for the movie lacks the foundation of a truly good movie even far from being a masterpiece artistry of work.\n\nWhile the recent trailers and neon-lighted posters let on that this is a revenge story, well not so much. It's more of having a porn-fashioned movie with mesmerizing colors and sparkling environments igniting the dark empty world of crime.\n\nVerdict: 49/100. Hands down, I can guarantee it is one of 2018's best looking visuals, the visually stunning colors and dazzling cinematography mimics Suicide Squad, another movie with the presence of Robbie of a different genre that holds the identity of the true definition of 'style over substance'. Robbie may save this movie, cracking the judgments on two sides of which she may or may not. If you love Margot Robbie, then give it a try. Her performance here is the solid proof for her to get that Harley Quinn spin-off film made, already."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "bostonct",
        "review_rating": "7",
        "review_title": "This is a lot better than the ratings",
        "review_detailed_main": "Cleaver dialogue from all the characters, a bit of crazy gruesome, plus a few twists and you have an entertaining movie. If you liked Snatch, Sherlock Holmes or Lock, Stock and 2 Smoking Barrels, you'll find this enjoyable enough. Not Guy Richie good, but entertaining enough."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "torrascotia",
        "review_rating": "1",
        "review_title": "Yes, its as bad as they say it is.",
        "review_detailed_main": "I watched this based on the great cast and the trailer. I wish I had read a few more of the reviews before committing to watching however. This is an odd movie, in that it takes place in a strange environment lit with neon and hardly anyone else apart from the main protagonists, so its almost a kind of fantasy movie. The one star is awarded purely on the fact this movie looks pretty good, but this wears thin fairly quickly. The problem with the people as they are portrayed is that their is no one that you latch onto, everyone seems to be some type of horrible person or a psycho so you don't really care what happens to anyone. The story has a number of twists and apart from one the rest are guessable, the fact is that if there are only so many players in the game, its not hard to guess who the \"hidden\" person is, or that they may have met in the past etc. I was quite surprised to discover it was possible to have so much acting talent on screen and , albeit mostly B movie grade, and still not feel engaged with the story. The ending was particularly poor, p.s. that isn't how that procedure was carried out and it wouldn't have had the effect portrayed in the movie. It also seemed to out of step with the rest of the tone of the film, it seemed more extreme than the rest of the violence. It was also oddly unsatisfactory as an ending, like I said, if you aren't rooting for the main character or anyone then its hard to feel contentment if they find a resolution. If you liked Only God Forgives you may like this, it has a similar neon style over substance emptiness to it which will polarise an audience with a majority disliking it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "markybbop",
        "review_rating": "8",
        "review_title": "Good film. Very underated",
        "review_detailed_main": "I thought it was an Excellent film. Noir style with a twist ending. Actors were excellent. Music was quality. Recommended"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Propagandist",
        "review_rating": "7",
        "review_title": "The artistic mystery is not dead",
        "review_detailed_main": "Yes, this movie is probably not everyone's cup of tea. I very much liked the chamber play like reduction of characters, scenes and places, and the gaudy but dark colouring (no oxymoron here). However, I can understand if this strikes some viewers as exaggerated or arty. The same is probably true for its plethora of cultural references and slow pace. Apart from that, Terminal is a solid mystery thriller with some nice twist, for which enough hints are delivered to anticipate them, but still enough doubt is being spread to keep you guessing. What I liked most is that more or less all characters are introduced as likeable, even if some of them are not. For better viewing pleasure, I would recommend not to learn too much about the film in advance. I was lucky enough to know only a few details and would have preferred not to know that revenge is part of the plot. The writing was great, it featured enough humour to let the drama get close to you, eventually. The cast was at least convincing but mostly excellent. By the way, if you wonder about the headline: go see Terminal."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Sam667",
        "review_rating": "2",
        "review_title": "\"A load of f**king nonsense\"",
        "review_detailed_main": "A whole lot of colored neon lights instead of an interesting movie. It's boring, tedious, redundant and predictable. It wants to be cool and hip, but only succeeds in straining my patience, I had to fast forward to the end."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "DodsworthMcgillicutty",
        "review_rating": "1",
        "review_title": "Non-demand streaming - talent wasted",
        "review_detailed_main": "Sounded exciting. No reason to be. Yes this positively is a Tarantino wannabe, with garish imitation Blade Runner lighting. Specifically it's like countless wannabe post Pulp Fiction hip crime thriller imitations that followed Pulp throughout the 90's. Thing is I LIKE Noir, some Neo Noir, Simon Pegg, Mike Meyers, and Margot Robbie when she's restrained. Her overacting here will leave you speechless considering her recent past accomplishments. This is not even stylish satiric overacting, just the embarrassing kind. Because what is she satirizing or paying homage to? It's never clear. If that's what this performance was? 1st time 90s film student type filmmaking on a budget, that is dated 2 days after release. Hard to even finish watching. How can this happen?"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "CANpatbuck3664",
        "review_rating": "6",
        "review_title": "An Unbelievable Ending Makes Terminal Worth Checking Out",
        "review_detailed_main": "Terminal was ripped to shreds by critics, I see why but I don't think they gave it enough credit. There's a lot of futuristic noir flourishes, the movie is bathing in neon light and seedy environments. This isn't new, its Blade Runner-esque but the cinematography is admittedly gorgeous in this. Just because it has been done before (lately with Altered Carbon and Mute) doesn't make it any less impressive. It was a nice touch and it deserves to be mentioned, even if it doesn't quite save the movie.\n\nThe plot of Terminal is very reminiscent of Guy Ritchie's movies. There's some Snatch or Lock, Stock and Two Smoking Barrels moments but the whole movie doesn't operate as well overall. We get introduced to a bunch of seedy characters with dubious morals. They all come in and out of this train station in the middle of the night and the common thread between them is the character of Annie (Margot Robbie). She's an assassin who works part-time as a waitress and stripper. Through her comings and goings, we meet a terminally ill teacher Bill (Simon Pegg), a pair of mismatched hitmen Vince (Dexter Fletcher) and Alfred (Max Irons) and an odd janitor Clinton (Mike Myers). How these interactions play into the larger plot is a mystery to us until the final turn. The setup isn't bad, we've seen it before and although there are plot holes, none of them were bad enough to completely derail the movie. It was enough to keep me interested but I did find my attention drifting in and out because of the lack of cohesion. As a story, its very middle of the road for the genre.\n\nAny heat for this movie was likely due to Margot Robbie's involvement as the main character. She keeps climbing the ladder and its deserved, she's great and I consider myself a fan of hers. She's good in Terminal, she's surprisingly committed, and she carries the movie capably. I do agree with some of the other reviewers in that she comes off as British Harley Quinn, but she didn't phone it in. Pegg is his typical charming self, he's very low-key in this but he works well with Robbie and I particularly enjoyed the montage that they share near the tail-end of the movie. Fletcher and Irons were odd, neither of them were terrible but Fletcher was over doing it and Irons was a little stiff. It was nice to see Mike Myers again and I think he did about as well as he could have with the material. Its a big distance from where his character starts to where he ends up and it makes his performance a little awkward by the end.\n\nI was down the middle on Terminal for most of its run time for all the reasons listed above. It was never stellar, but it had its moments. I was more than ready to just let it float the rest of the way to whatever normal twist ending it had up its sleeve and call it a day. But when the confrontation comes between Annie and Bill, the movie doesn't just dip its toes into a pool of nonsense/crazy, it cannonballs into it. I wasn't just snickering, I was laughing when Terminal ended. Its not that the twist it takes is new, its handled in such a rough and implausible manner that I was shocked. But it didn't derail the movie for me, it actually improved it. It made Terminal memorable and while I would never say that this movie is good, its going to hold a place in my memory for insane plot twists.\n\nI feel a little guilty for giving Terminal as high of a rating as I have. I liked the style of the movie and some of the performances (notably Robbie, Pegg and some of Myers) were solid. But it never reached high enough for something great and in any other movie, that twist ending would have knocked it down to a 3 or a 4/10. But that ending pushed the movie from mediocre to so bad its good territory for me. I can't call Terminal excellent but if you enjoy campy cinema, this is something you should see. I'm giving Terminal a 6/10 and I feel like I'm being generous."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "1",
        "review_title": "An embarrassment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "compugor",
        "review_rating": "7",
        "review_title": "A Visual Treat with Exceptional Denouement",
        "review_detailed_main": "Not sure about the acting diversity of Ms. Robbie (The Suicide Squad) but she's got the crazy hot thing down pat, and she is alluringly attractive enough to carry the whole movie, which she does. Not that Pegg and Meyers don't give respectable supporting performances. The screenplay is quite stunning visually, with a futuristic neon tinge to everything that is darkly mysterious and gorgeous at the same time. The seedy story unfolds in such a disjointed way that it sucks for a while, but just when you're about to be bored to death, it explodes with a series of reveals that explain everything by narrated flashbacks, which go above & beyond anything you could have expected. Thumbs down for the tedious buildup, especially all the f-word dialog and hateful coarseness by one of the assassins (played by Fletcher), but bravo for the ending, which is not for the squeamish."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "arriva",
        "review_rating": "1",
        "review_title": "The Void",
        "review_detailed_main": "I'd love to review this movie but there's just nothing to review.\n\nI tortured myself for almost 50 minutes waiting for something thrilling to happen, thinking that my attention would be finally rewarded but no, nothing was there.\n\nI don't care how it finished for I couldn't tolerate this excruciatingly slow paced meaningless tripe.\n\nAvoid at all costs. Life could be spent so much better."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "watyasaiyan",
        "review_rating": "7",
        "review_title": "Enjoyable flick",
        "review_detailed_main": "Definitely worth watching, it's actually pretty refreshing in the world of recycled trash that Hollywood usually spits out.\n\n-Well acted by a great cast and as usual, Margot Robbie is a stand-out.\n\n-Story had my interest from beginning to end."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jmbwithcats",
        "review_rating": "5",
        "review_title": "More style than substance",
        "review_detailed_main": "Vaughn Stein, influenced by James Bond, McGhee's Alice, and Dark City, brings us \"Terminal.\"\n\nA great script leads you through a movie and avoids exhibition by monologues in the final chapter. A lousy film leads you to a senseless act, then explains why the action matters."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "cesnovar-andrej",
        "review_rating": "8",
        "review_title": "Why the hate?",
        "review_detailed_main": "I don't usually post reviews on IMDb - other people have already done it, and often better than I could - and most of the time, I find the ratings more or less on par with my own impressions of movies.\n\nHowever, sometimes, I can't help but wonder \"How in God's name has this movie gotten this rating?\" Terminal is one of those movies.\n\nThe abysmally low rating, coupled with the very few (and most of them, poor) reviews, made me want to give my two cents and try to set the record straight. Or, at least, set it straight-er.\n\nFor me, Terminal was a thoroughly enjoyable movie - it has a great cast, witty and dark humor, interesting enough plot (not too cliche or too predictable) and, being around one and a half hours long, it does not overstay it's welcome. If you're into labeling things, you could call it neo-noir or something other, but the fact is that Terminal is very much its own thing, visually and plotwise. Personally, it reminded me of a theater play.\n\nThe ending could have been executed differently or better - the plot unraveling was overly (and unnecessary) convoluted and the ending itself was a little unimaginative and disappointing. But that's just my personal view.\n\nOverall, Terminal is a good enough movie - and that is good enough for me. And even though it wouldn't make it to any of my \"top 10 movie lists\", it is still a pretty solid movie, that deserves at least a 7. Which is why I gave it an 8."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mashulya-43638",
        "review_rating": "7",
        "review_title": "Feel free to bet 7/10",
        "review_detailed_main": "Margot Robbie is such an exquisite version of her own Harley Quinn from Suicide Squad, even the outfits, don't consider it a spoiler, match in some places. And others are exaggerated heroes, repeating and parodying themselves in other roles. A stylish illustration is nothing more than an anecdote, which would fit into a short film without loss, but which, which is rare, thanks to the professionalism of the director, the faithful cast and visual effects, it turns out to stretch by a full meter."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mohammedkashmoola",
        "review_rating": "1",
        "review_title": "Disappointed Movie",
        "review_detailed_main": "Actually i was disappointed alot ,, scenario is very poor as well as the location.. the director have no imagination and the whole movie was annoying.. 1 and half hour wasted in this movie"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sebi_indru",
        "review_rating": "1",
        "review_title": "Ignore all the positive rubbish reviews, this is a waste of time",
        "review_detailed_main": "Can't believe this has such a high score, the movie is full of cliches, boring and stale. Also predictable outside of a few turnarounds at the end (but basically you know from the start the pretty girl(s) will survive and kill all the bad-guys, long boring dialogues, the action is stale for long periods. Outside being very predictable and boring the movie is also full of political correctness trying to justify the main characters actions. Margot Robbie's acting saves the movie a bit but it's too little, she does the best with her character but acting as a stripper / hitman with a proper cause and moral grounds is hard to play without making smart audience laugh. Don't be fooled by the positive reviews, those were probably of people who can't appreciate a truly good movie and are too shallow or not very tasteful or able to watch an intelectually challenging movie (to say the least)."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Red-Barracuda",
        "review_rating": "6",
        "review_title": "A visually resplendant modern noir, which is lacking in the story department",
        "review_detailed_main": "A crime-lord, two gangsters, a dying school-teacher, a waitress and a janitor are the characters who operate in and around a train terminal in the dead of night. Their stories inter-connect in unexpected ways.\n\nI guess I was a little bit disappointed with this one in truth, as I expected quite a lot from it. The set-up was very minimalistic and the story was told in a fairly unengaging manner, with the characters not drawing us in as much as I would have wished. It doesn't have a bad cast in fairness. Margot Robbie is always great and she is once again good value as a femme fatale and looks fantastic (of course). While Simon Pegg is another actor I like and he does the best he can with what he is given. Mike Myers is also notable here too in an odd role. But, overall, the story wasn't the strong point here at all and ultimately let the film down somewhat. But what it does have in spades is great visual style. The lighting and colour schemes were quite beautiful and certainly make up for the deficiencies in other areas, at least to some extent. It is an example of a neo-noir, with characters and settings which fit the bill. Without a doubt, this is an example of style over content, which is not something I have a problem with and do enjoy the pure cinema elements of this one. I just wish that the story had been a bit more engaging though."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "False_Nostalgia_Reviews",
        "review_rating": "4",
        "review_title": "Saw the twist a mile away",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "fmkhan213",
        "review_rating": "7",
        "review_title": "What an absolute delight! Do not go for the low ratings",
        "review_detailed_main": "I saw Terminal being mentioned by some YouTuber for it's brilliance of the use of colors in any given scene. I expected a low budget stylistic adventure with plothole full of story. I'm glad I was completely wrong. The movie keeps the viewer hooked right from the start. You know there is something wrong. You know who is doing what and still you are not sure why. The why part of the story is well executed. The story itself that we see is non-linear, which makes the suspense a tad bit more interesting. I loved the dialogues, one of the most sassiest bold and witty I have seen since long. You have to have a taste in the language to enjoy the conversation between the characters. What a joy it was. Margot Robbie gave a stellar performance so did Simon Pegg. One aspect that absolutely is the clear winner is the cinematographer. Beautiful sets with minimalist neons. The whole neo-noir feel makes the whole movie a delight for the eyes. The climax is unpredictable and rather enjoyable. Please don't fall for the lack of ratings. Enjoy this brilliant movie!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sidneygchambers",
        "review_rating": "1",
        "review_title": "Noir in colour",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jonnakutygirish",
        "review_rating": "7",
        "review_title": "This Movie Is Lot Better Than The Ratings....Give It A Try",
        "review_detailed_main": "Interesting,Different,Dark,Classy Revenge Thriller. Terminal Is A Film With Never A Dull Moment.Margot Robbie Just Nailed It,She Lived In her Role.This is Her Best Performance Till Date.A Must Watch Movie For Margot Robbie Lovers."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "tajlarson",
        "review_rating": "3",
        "review_title": "Style over substance",
        "review_detailed_main": "This movie could have been so much more had it actually built itself up to the twists it shoves down your throat in the final act. It pretentiously acts clever as it pours style over it's bare-bones plot to create the facade that it's edgy and clever. Worse yet, it explains the twists in such a ham-fisted manner that it insults the dream-like style and ethereal atmosphere it built up to satisfy the lowest common denominator. Finally, with regard to the \"TWIST\" ending, it's about as well thought out and memorable as a bad Shamalan film, nearly The Happening level of ridiculous. I'm astonished they got the stars and funding to put together such a mess.\n\nWhile I won't spoil the film here, I'd suggest wiki'ing the film and saving the time. There are much better films that are just as stylistic, if not more, with much better plots and understanding how to plot out proper mysteries."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "butterfliesinautumn",
        "review_rating": "9",
        "review_title": "Deliciously Wicked",
        "review_detailed_main": "My man and I watched this movie by sheer happenstance. We were movie surfing on a quiet night and saw that Simon Pegg is in this movie. We decided, as we always do with a potential viewing, to give it 15 minutes. We were snatched in within a few minutes. The story, the cinematography and the plunge into the darker depths of neo noir....and Simon Pegg? Totally irresistible.\n\nDoes the movie become self absorbed at times, absolutely, but we didn't care. We both agree that we need to tell all of our twisted friends to indulge in this treat.\n\nWhy this movie has such a low score is really beyond me. Maybe I'm a sucker for indulgent naughty dialogue, obvious cloak and dagger, and movies that borrow too much from Lewis Carrol....\n\nFollow the white rabbit. It's a fun little sleeper of a tale and tail."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "WJr92",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "The movie is kind of weird, the whole dark atmosphere... I really did enjoy this film You Gotta Watch it!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "msghall",
        "review_rating": "3",
        "review_title": "Soulless and vapid, this visual feast has no meat on its bones.",
        "review_detailed_main": "Give director Stein credit, the visuals here are top notch. Everything else, though, is paper thin, without the human touch needed to involve viewers. The quick edits, once popular maybe ten, twenty years ago, project a disjointed, often disorienting spin that keeps you from being swept up in the action. The actors, while adequately doing their jobs, are marginalized without any attempt to explore motivations etc. There's a mechanical feel to the characters instead of a human one. They are too often depicted in conversation with only one actor in the frame, without seeing the characters together on the screen, so you rarely get the feeling of actual people communicating the way humans do. Which is a pity, because technically, the filmmakers have the chops to make a decent flick. They just seem to care more about flash than story, script or the actors."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Stylish but tries too hard",
        "review_detailed_main": "Featuring a lot of stylish material as bright neon lights and quick camera cuts, Terminal is a British neo-noir film in resemblance of seemingly trying to be like other greater films of directors as Tarantino (Pulp Fiction), Robert Rodriguez (Sin City) and Guy Ritchie.\n\nHowever this film feels all too stylish and lacking of real substance. It just has the sense that it is trying to be something greater than it actually is. The dialogue consists of every character being wise and witty and it comes across as forced.\n\nMajor concern comes from the writing. The characters besides Margot Robbie aren't as appealing as we don't necessarily care for them. The ending twist was also poorly executed and by the time it occurs, we don't necessarily care any more.\n\nAt times this film felt confusing and that it was dragging on. Besides the previous mentioned films, Terminal reminded somewhat of Lucky Number Slevin (2006), and Seven Psychopaths (2012) but those films were undoubtedly better.\n\nThere is a reason as to why Terminal was panned by critics and why it didn't make much money. Ultimately a very forgotten film."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "rockman182",
        "review_rating": "6",
        "review_title": "Terminal (2018)",
        "review_detailed_main": "I was admittedly not a fan of Margot Robbie when she first starting making waves. I didn't go crazy for her in early films or her portrayal as Harley Quinn. What did make me a fan of her was her portrayal of Tonya Harding in I, Tonya. She was really tremendous in that film. When i saw the trailer for Terminal I thought it was something I could love. It looked like a female driven, cult classic, that had a lot of style. Was also surprised that virtually no theaters were showing this (thank god for video on demand).\n\nThis film is about two men who have a mission they have to perform to get a large payday. They encounter a woman who becomes a key part of completing the mission. This woman actually seems to be everywhere. Shes in church, working as a waitress and a stripper, and seems to encounter all characters in the film. There is a deeper level of connection that she has with all that s going on, but that's something that would be a spoiler if I went into it. The film stars a fairly odd cast of Simon Pegg and Mike Myers (where has he been lately?)\n\nWhile I had no problems with Margot Robbie in this film, I can see her being typecast as the crazy, unhinged sexy blonde type role. About halfway through the film, I felt like I hated it. The film uses a bunch of plot twists and shock reveals later on. I don't know how effective they are but I think it sort of made me feel better of what I was watching. The film is purely reliant on its style and use of neon colors. Its very nice to look at, but the plot seems like its all over the place and is really messy.\n\nI feel like the filmmaker was trying to include a bunch of ideas and a mix of character dialogue to deliver his point, but it does not always work. Its an oddball film which is okay at a few moments but is a very confused effort. I can see why the producers didn't bother with a theatrical release as I feel like this is something that people would slate. I"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ooepicsoldieroo",
        "review_rating": "1",
        "review_title": "Wow, this was a waste...",
        "review_detailed_main": "Terminal blends tropes from several sorts of crime flicks into a sound stagey affair that's more brittle than hard-boiled."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "yellowmarlin",
        "review_rating": "7",
        "review_title": "Curiouser and curiouser",
        "review_detailed_main": "I can't recommend this film to anyone; there's no way to know whether you'll love it or hate it until you watch it and find out for yourself. And it's very definitely a love/hate type of film. Me? I loved it. The film is loaded with quotes from and references to Lewis Carroll's Alice in Wonderland. It's not the first film to do so, far from it, but it's the film that's come closest to capturing the surreal, trippy feeling of falling down a rabbit hole. The deliberately complex first half of the movie heightens the feeling of confusion, and this will alienate a lot of viewers, but it kept me hooked until it all became clear. The performances, particularly from Margot Robbie, the photography, the lighting and the Budapest locations are all excellent. It's a movie that I will enjoy watching again."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "scutariuid",
        "review_rating": "5",
        "review_title": "Disappointment",
        "review_detailed_main": "The movie attempts to recreate a Guy Ritchie universe where you would find interesting twists and very smart dialogues. The problem is that it lacks Guy Ritchie and any kind of smarts..."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mainhfactor",
        "review_rating": "7",
        "review_title": "Genuinely enjoyable",
        "review_detailed_main": "The cast is great, the mood/atmosphere are perfect, and the story is fun despite being done many times before. The enjoyment comes not from the plot so much as it comes from the tale that's told through each character. The acting was thorough and consistent which makes the characters more believable. I don't get all the low scores on here. What did people expect? I suppose expectations are the problem when seeing any movie, but I digress. This film isn't something I'd watch over and over, but that doesn't mean it isn't a solid piece of work. Margot is incredible, as usual, but I feel like we get more of her Harley Quinn in this film than in Suicide Squad. But let's not get into that disaster film. She definitely played my kind of crazy. All in all it's worth a watch."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "dussaultjulien",
        "review_rating": "1",
        "review_title": "Horrible. All the hype is in the trailer, it's not there in the movie itself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "swoonedd",
        "review_rating": "8",
        "review_title": "Great execution",
        "review_detailed_main": "The story isn't new, but to see comics make a noir film is really interesting. And how they ha e done it really good.\n\nIt isn't mainstream, but does it need to be?\n\nLove the colour range, the neon, the quasi-Bond music. And Margot Robbie! Wow. She might be attractive, OK, but what right execution of her character. She can act! Very impressive.\n\nWhy would people give this a low rating? I think they miss the art of how the story is told. Not fandango, but still: Robbie, the music, the colour cast ...\n\nWarren Beatty did Dick Tracy in 6 colours. This reminds me of that film.\n\nThe best films are like music in pictures. This is one of them. :)"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "rjfromtoronto",
        "review_rating": "7",
        "review_title": "As a 40s/50s Noir fan this is a nice addition to the genre",
        "review_detailed_main": "Watching the opening scene and the first few mins, I thought this was going to be a London Fields/Sin City/The Crow type movie, it kind of is cinematically, which is good for that unknown location and time feeling in the movie. It has the classic feel of a noir with the dark undertones and use of shadows and switches it up with neon like the 80s, reminded me off Neon Blonde a bit except not a spy movie with a definitive date, the cast is great as is the femme fatale, nice textures and hues, and like a true 40s classic it draws you in and takes you to a conclusion you won't guess in a million years. I would have liked to see it in B/W as an option just for fun, but it was good as is, witty, honest and a nice revenge scene like I've never seen before, except maybe Session 9 in a way, except no wandering around a psyche hospital basement at night looking for coins and gold teeth."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "realintheory",
        "review_rating": "1",
        "review_title": "rabbit rabbit rabbit",
        "review_detailed_main": "Loads of it (it's cockernee for natter, banter, gift of the gab) but f all else chummie\n\ner.. sorry... it's just a terrible film.. miss robbie is awfully easy on the eye.. but.. that doesn't redeem this 90s rehashed, 'stylish', 'thriller' with a twist that's as easy to spot as myers in prosthetics\n\nnot half as 'weird' as it thinks it is but twice as lifeless"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mherrin-43253",
        "review_rating": "2",
        "review_title": "Terminal-Pretty but boring",
        "review_detailed_main": "Terminal: Written and directed by Vaughn Stein\n\nHere is this wacky, stylish neon lit cartoon revenge noir where there are double crosses and triple crosses and long talks in an empty train terminal along with mystery and late night cafes and wild production design a million times over.\n\nThe very first thing you notice immediately about this movie is hyper stylized production design. It has rich shadows and bold colors like a paint set splashed across each scene. It reminded me a lot of Punisher War Zone or Batman Forever. It worked with this movie way more than it did with those. However it seems more like they're trying to take your attention away from the rather lackluster story.\n\nThis is a run of the mill revenge story. It drags its feet taking the time for you to get to know these characters but they're dull. Margot Robbie and Mike Myers play the cartoons they're meant to be while the other characters glide in and out of the story.\n\nThis was fairly boring. After a few scenes the production design becomes normalized and it doesn't dazzle anymore. The mystery inherit in the narrative can be guessed very quickly and you're left waiting for the characters to catch up to you.\n\nNow I did enjoy some of the against type casting. It was interesting to see Mike Myers and Simon Pegg in this as their parts are vastly different than what they normally do. Margot Robbie can easily hold the screen in this type of part. They're all good actors but that story man yikes.\n\nWith all that laid out there, I would skip this one. It's forgettable and nothing good will come of you watching it. I give it a D."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mv90067",
        "review_rating": "7",
        "review_title": "Loved it",
        "review_detailed_main": "Extremely stylish. Pays homage to Tarantino and noir films. I agree with other viewers that the plot is a bit messy, but I personally feel that, if not taken too seriously, Terminal is a really enjoyable film. I loved it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "LionJamiro",
        "review_rating": "4",
        "review_title": "One of the most unintentional hilarious movies!",
        "review_detailed_main": "Terminal stars Margot Robbie and is about 2 hitman that are hired by someone named Franklin to kill a unknown person who stands by a random window. One of the hitman falls head over heals for Margot Robbie's character 'Annie' who works at a night cafe. At that cafe she talks how Simon Peggs character can kill himself because he is very sick.\n\nI want to start of with the performances, Margot Robbie who I normally love is not good in the movie, she is way to obnoxious and not subtle in any way. But she is probably the best in the movie, and that says a lot. When I write how unintentionally funny it is I don't mean the humor in it is good, because there are jokes in the movie, but none of them are funny. This movie doesn't see how ridiculous and stupid it is and tries to go for that Tarantino dialogue, the only problem with that is that it wasn't writen by Tarantino so it just sounds dumb.\n\nI would not suggest you watch this movie because it isn't good at all. Even the cinematography began to feel obnoxious after 15 minutes. But I must say, I was definitely enjoying myself in terms of how much I was laughing. Also there are a lot of 'twists' in the movie and I called every single one of them so they are not suprising and the ending is just dumb. If you wanna laugh at how bad it is I would suggest you see it, but if you want to see something worth your time, stay as far away from this movie as you can."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "glynisp-42596",
        "review_rating": "7",
        "review_title": "Enjoyable and different. It kept my interest.",
        "review_detailed_main": "A little bit Sin City, a little bit Pulp Fiction and a bit of modern film Noir. Visually arresting in a dark dystopian way. Interesting actors and quite good dialogue. I found it more interesting than 9/10 Hollywood movies these days. I admit, not for everyone, but if it captures your interest in the first 15 minutes, you will probably like it. If it does not, then save yourself the time. There is a scene almost at the end where we see Margo Robbie without the bottle blond hair and over the top make-up, and boy is she beautiful like that."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jcsheffieldlv",
        "review_rating": "1",
        "review_title": "Miserable",
        "review_detailed_main": "Nothing like a movie that gives you no reason to care about any of its characters until the very end-simply because it has to protect the big reveal (which half of said reveal was a given)..."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "kelvin_bakker",
        "review_rating": "7",
        "review_title": "It's quite good if you like Film noir/artsy films",
        "review_detailed_main": "It's a movie in a very artistic film noir style, if you don't like that, it will not be worth watching. If you dont mind it, it's alot better than the current 5,4 it has. Decent story, good acting and well written. The film is pretty much exactly what it should be, unfortunately alot of people don't really like these kinds of movies. It might not be the best movie ever, but its worth the try if you like a film thats a little different."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mrdadmitchell",
        "review_rating": "2",
        "review_title": "terminal viewing",
        "review_detailed_main": "A terrible movie, at 30 minutes it was truly terminal, and we couldn't watch anymore."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "I_should_be_reading_a_book",
        "review_rating": "8",
        "review_title": "Painfully slow start but very watchable",
        "review_detailed_main": "I don't get the low ratings.\n\nPerhaps people that were expecting a Marvel picture, Mission Impossible or Austin Powers.\n\nIt is, however, confusing and extremely slow on the uptake but puzzle pieces start falling in place after the first half hour and the plot is built.\n\nSettings are very \"camp\" but suit the mood extremely well.\n\nKudos to the director, writer and the crew. Actors/actresses deliver a solid piece, no exception. The end is completely unexpected and (for me at least --I must not be very bright) far from predictable. I recommend it to people wanting something fresh in cinema, a bit in the style of David Lynch.\n\nMillenials, abstain."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "abhisingh02",
        "review_rating": "7",
        "review_title": "IGNORE THE NEGATIVE REVIEWS - Margot is PERFECT & NAUGHTY",
        "review_detailed_main": "Kindly ignore the negative reviews and watch this flick! Starting is steady n slow but once you lean in the flow you will find it more dramatically suspense movie.\n\nMargot Robbie should won Oscar now, it's high time, She just nailed the character, she is charming, beautiful, wild, I mean if we have female joker who can give some fight to The Dark Knight then she would be the only choice we have.\n\nWatch it at any cost."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "nora-ayda",
        "review_rating": "1",
        "review_title": "Nah...",
        "review_detailed_main": "Not that I do not appreciate this kind of movies. I love the neon lights, mysterious unknown city and dark scenes.\n\nIt's just that...I don't enjoy it. Major boring. Wasted my hours."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "gazbobk-28956",
        "review_rating": "3",
        "review_title": "Sucker punched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "juancampurbe",
        "review_rating": "6",
        "review_title": "Great movie",
        "review_detailed_main": "The movie starts a little confusing annd slow with many doubts and questions in mine but how the film goes forward becomes more and more interesting until the thriller final that gives a 360 degrees turn arround tonthe story i give ir a 6.2 and i Will watch it again, margot Robbie and her way of being psichodelic kind of Harley Quinn males the story interesting"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "petercarlsson-92297",
        "review_rating": "1",
        "review_title": "Boring and uninteresting",
        "review_detailed_main": "So... The tobacco company had some money to spare. The film company wanted that money. They got it. So... now they needed a script, a story arc, and some dialogue. They didn't. But they got Margot Robbie. And the tobacco scenes. So let's make the movie without at story and dialogue, they thought. And... this is the result."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sgmi-53579",
        "review_rating": "6",
        "review_title": "Fun little noir",
        "review_detailed_main": "I liked the performance from the leads, the set design, and the direction. The plot fell a little flat for me, bit a tidy, slick tale of the dark. Worth viewing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ivobg",
        "review_rating": "2",
        "review_title": "Bore \"Sin City\" wannabe.",
        "review_detailed_main": "Watching it premiered on local cable tonight, and dutlring the commercial break I am wondering: What the hell is this?!?\n\nI can't believe this production went through casting with such an empty script.\n\n36 minutes into the movie, I feel bored and annoyed. Poor acting, bad camera work, pointless dialogues and nothing interesting so far. I don't think I'll continue watching this bore neo-noir piece of garbage after the break.\n\nAvoid it, if you consider yourself as an intelligent person.\n\nMy rating: 2/10."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "adrianjgomez-11883",
        "review_rating": "6",
        "review_title": "Not a terrible movie and with awesome twist.",
        "review_detailed_main": "It is a little convoluted and parts were not entirely clear, but it was entertaining and there is a twist that I didn't see coming. The pacing at times is a little un-even and you will find some plot holes along the way."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "anil-kulkarni-108-85663",
        "review_rating": "5",
        "review_title": "Femme fatale",
        "review_detailed_main": "Passably good crime thriller, the kind where you wait till the closing scenes to get closure. There's a mystery in there but slightly over plotted. Decent payoff of you're willing to wait it out."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "r4nd0",
        "review_rating": "8",
        "review_title": "Entertaining and darkish",
        "review_detailed_main": "I rarely write a review, but this one deserves it.\n\nAll acting is top notch and I mean ALL the acting, every single one of them. Margot Robbie is just stunning as always, idk where Mike Myers was hiding but he's back and boy he's good. Simon Pegg fooled me completely and Dexter Fletcher is awesome, even Max Irons is phenomenal imho.\n\nDirecting is good to great, the plot is entertaining with a little bit of extra violence, but I think it was needed to deliver the right kind of atmosphere.\n\nThe only thing I thing it can be better is the soundtrack, but I think this may be just my thing, overall I recommend to check it out yourself."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "classiccarrepair",
        "review_rating": "7",
        "review_title": "Wow! Great but ended too fast.",
        "review_detailed_main": "I think the movie and screenplay had a superb noir, almost good enough for black and white, but color neon signs above ground, and underground filming in Hungary subway terminals and underground municipalities made the film really cool. It allows your senses to adjust to the core plot without allowing other background stuff to distract attention away from the auditioner's focus. Having said that, the screenplay was freaking awesome, the shots, the cuts, the long shots...reminded me of old 40's films, and to newer watchers, Pulp Fiction. Even the clothing was euro-vintage a bit. Euro accents for the star cast of actors was straight up. I was hooked after the intro of actors and their roles, but it took 30 minutes to really solidify everything and dive in and forget your surroundings of audition environment. After that, the plot hook is on and we are moving fast enough to stay interested.\n\nIn the end, the last 15 minutes, we learn alot about the plot, and I think it should have been played more, vignettes of the main characters would have been better, but I commend the Highland Studios for an overall very fun and enjoyable time! On a side note, these filming locations that require very little CGI really is cool and makes for a better product."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "DalaiNylon",
        "review_rating": "5",
        "review_title": "Great performance from Margot Robbie",
        "review_detailed_main": "I feel that more than anything else, this is an exploitation film and a rather good one as well. I realise that this might come up as an unpopular opinion so I'll attempt to explain. The writing wasn't much to my taste. Quick-paced, punchline-after-punchline, full of 'cool' references, yes it succeeds in being edgy but it has a great deal of pretentious in it too. As such, it fails to give substantial depth to the dialogue and the characters. Along with an interesting neo-noir (or is it neon-noir?) photography and some really cool soundtrack, it sketches an outline of the statement it wants to draw. Even the twist and the double twist are not hard to expect if you keep your eyes on the screen. Enough with the writing. Margot Robbie's performance makes the movie. As I said before, this is an exploitation film. It talks about the evil of men against women. Man is not to be perceived as nothing else than a monster; The hero beautiful, righteous, vengeful and badass. Perfect in short. That's the writing. MR and her emotive performance add a grey area in all this black and white ridiculousness. Her acting is full of hate, she overgrows Annie's 'perfect' persona and she turns the saying-nothing-hero to a saying-something-anti-hero. I could see this film growing to have a cult following in the years. But then again it could get forgotten really easily too."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Tweetienator",
        "review_rating": "5",
        "review_title": "Ups and Downs",
        "review_detailed_main": "Terminal reminds me a lot of movies like Pulp Fiction, Sin City, and neo-noir pieces like Only Good Forgives (Ryan Gosling) and Bad Times at the El Royale and the like. The production and cast, even the story and the \"revealing\" of the whole at the end are solid but, and that's a great but, whereas in movies like Pulp Fiction I liked the dialogues a lot, the many talking scenes in Terminal are rather boring, tiresome: they are not witty, not dark, not interesting enough. And as there is rather a lot of talking, this drags the movie a lot down for me. Anyway, I won't recommend Terminal but also will not warn against giving this one a try. This review I close with a \"watch it and make up your own mind\" note - if the story and the cast sound interesting to you."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jimcheva",
        "review_rating": "7",
        "review_title": "Stylized noir, amusing, clever, not quite satisfying",
        "review_detailed_main": "This is in the wide family of \"Diva\", Tarantino, other films which pay quirky stylized homage to the noir tradition - not to mention a bit of \"Batman\". Enough implied menace to make the actual violence surprising. Robbie stunning as always, probably some hints of Harley Quinn here though I haven't seen that. Very specific and intriguing characters. The story is neatly woven, but ultimately not deeply satisfying. It's more an exercise in style than a human story. But engaging enough."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "hourstoneoasismondays",
        "review_rating": "4",
        "review_title": "From a Simon Pegg fan who really gave it a chance...",
        "review_detailed_main": "This movie is very visually pleasing but as far as the plot goes it is very predictable and it feels much longer and drawn out than it is. Simon Pegg was underused in this film and many of the other characters seemed a little flat. This film suffers from trying to be too many different things at once and when it reaches it's climax it becomes too sloppy in it's attempt to wrap everything up. The best this film has to offer is the visuals and the performance that Simon Pegg does provide (which is a step away from his normal comedic roles)."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "roopesh-chandra-bose",
        "review_rating": "6",
        "review_title": "An Interesting Movie",
        "review_detailed_main": "Was an interesting watch. The only gripe I have is that it could have been more evenly paced. The middle part had a rather slow buildup. The ending has a nice twist."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Viking131313",
        "review_rating": "3",
        "review_title": "This was a movie",
        "review_detailed_main": "I don't know why anyone would call this movie a waste of time. I found it motivated me to better use my time. It was so slow and boring it motivated me to get off the couch, do two loads of laundry and make dinner, all while listening to this movie in the background.\n\nI am certain the writer/director thought he was being so very clever, creating a movie with a bunch of disjointed stories in the fashion of Quinten Tarantino. Problem he is not Tarantino, and his skills are considerably less honed. In a Tarantino film the disjointed stories are compelling and complete on their own, whereas the stories in this film are plodding, uninteresting, time fillers. Tarantino created individual stories which didn't require the ending to give them meaning, it was just a bonus for the viewer. This movie however, didn't have a single compelling story in it, including the ending which was supposed to tie it all together for the viewer, but unless you are brain dead, you will have seen this ending coming from miles away, and didn't need the droning narrative at the end.\n\nAnd here's a twist, the twists in the film are not twists but a straight line down a formulaic path, which is used all too often in Hollywood. Oh wait, that was no more of a twist than what this script contained.\n\nThe acting was fine, they all very convincingly portrayed their characters. The photography, locations and set decorations were also quite good. In the end I guess I have to thank the producers for financing this loser film, which so motivated me to get up from in front of the TV and accomplish mundane tasks around the house."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Weirdling_Wolf",
        "review_rating": "7",
        "review_title": "'This hard-boiled, hyperreal hit man hoe down a wickedly watchable affair!",
        "review_detailed_main": "The deliriously playful, visually sumptuous, super-stylised, Neon-Noir thriller 'Terminal' unexpectedly provided some tantalizingly off-beat B-Movie treats! Generously bejewelled with dazzling performances, combined with vividly realised art direction, and amusingly bellicose banter make this hard-boiled, hyperreal hit man hoe down a wickedly watchable affair! It must also be said, the wonderfully charismatic actors Dexter Fletcher and Simon Pegg were both on especially engaging form here. And while it might be strongly argued that 'Terminal' is demonstratively more snazzy, eye-popping style than substance, perhaps, in this specific instance that just might be the very point, being undeniably cinematic and more than just a little bit naughty, mayte! The luxuriously photogenic Margot Robbie's mercurial murder mistress was a dangerously dazzling damsel of dispassionately delivered death, her morbidly mesmerizing Annie sinuously stalking this gaudy, shadow-slaked Sin City like some sinisterly sublime, stilleto-savvy, single-mindedly vengeful vixen! And while the twist proved elementary, 'Terminal' is still groovier fare than Watson telly, mayte!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "dazzlingseem",
        "review_rating": "3",
        "review_title": "Nothing but cast and cinematography should have been a Harlequin movie",
        "review_detailed_main": "It should have been made a Harlequin movie as Margot Robie's character was all the same as she played in DC's Suicide Squad the same menace and psychopathic behaviour plus add a few more names in the cast and there you have it. The plot is very flat predictable and centred around Robie's character. Acting is so so... it's only watchable because the cat and the dark ambiance created, the last mentioned was the only thing done well here."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "alex-83910",
        "review_rating": "9",
        "review_title": "Intriguing, different and brilliant",
        "review_detailed_main": "I don't usually leave reviews but find the current 5/10* overall rating a total nonsense. This film is different and so much more interesting than the same old recycled content we get fed at the cinema. It's a visual feast with a storyline that keeps you guessing right up until the end - and what an ending. I predicted what I believed to be the main twist relatively early on but was surprised and thrilled to discover there was much more to follow after that reveal. Bravo to the writer and director. Margot Robbie gives an electrifyingly crazy performance with some great dialogue that keeps you captivated - in fact thinking about it there isn't a bad performance in there. It really is a brilliant film with so much to offer and I bet this will be one to look back on in a few years and reevaluate. From an amateur filmmaker, thank you to all involved for making this."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Aktham_Tashtush",
        "review_rating": "7",
        "review_title": "Is it weird to say i loved the soundtracks more than the movie !!",
        "review_detailed_main": "So the movie is nice ,, it's not pulp fiction level as the trailer would seem but still it has an original mysterious plot and a surprising turn of events which makes it all look good.\n\naside from that, the soundtracks and songs just made it all look so appealing ,, like in Suicide Squad where the movie was Meh, but these songs of AC/DC to twenty one pilots: Heathens just made it all looks wow.\n\nI think the directing/producing played a key role in here and was much more noticeable than the writing , but still gotta admit the plot was beyond expectations.\n\nThe cast ,, well,, It's Margot Robbie , full stop ... love tha gal , he English accent is quite good ,, Simon Pegg is my favorite wished his character would've been more \"Hot fuzz\" and not the evil perv .. Mike Myers and Dexter Fletcher they are an A listed Actors in the UK ,, so i'd say the movie is no where near an average budget movie .\n\nso overall, , the movie is nice the plot is strong and the soundtracks are stronger ,, recommended."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "lavatch",
        "review_rating": "1",
        "review_title": "Atmospheric Thriller Has No Thrills",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Scot_Rutherford",
        "review_rating": "3",
        "review_title": "Tripe",
        "review_detailed_main": "Outside of this film I think Margot Robbie is fabulous as an actress and the perfect foil. Simon Pegg is funny but overrated. Neither one did much for this and Robbie couldn't save it. The script was a disaster and low society British criminals are so overdone they just bore, people. By the time the only vaguely unpredictable surprise occurred I just wanted it to end. Thouroughly disapointing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "deloudelouvain",
        "review_rating": "6",
        "review_title": "A bit weird but worth a watch.",
        "review_detailed_main": "There are good and bad things about Terminal. The good things are the style of the movie, very flamboyant, playing with dark and flashy lightning, and for that the directing was very good, and the acting of Margot Robbie in particular. She plays her character like she played Harley Quinn from Suicide Squad, a bit crazy but also very glamorous, she's definitely candy for the eye. The rest of the cast wasn't bad either even though the star of Terminal is definitely Margot Robbie. The major bad thing was the plot, at least that's my opinion. It's the weak spot of this movie, that could have been much better with a better story. But it's still worth a watch if you like it a bit weird."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "filmtravel101",
        "review_rating": "5",
        "review_title": "Boring Trite Story yet Great Directing/DP work - better luck next time",
        "review_detailed_main": "A great ensemble of actors and fantastic directing yet the story is so bloody trite and boring that the beautifully shot film ends up putting one almost to sleep for 1.4 hours before finally at the end you find out.... voila.. it all ties together in a not so pretty knot and you yawn .. wanting your money and time back = at least it is wonderfully shot like a music video.\n\nA real shame as it could have been so much better if shorter script and less diatribe. Surely next film for this director will be a masterpiece.\n\nA 5 for the acting and dp/directing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "timothycrugnale",
        "review_rating": "7",
        "review_title": "Strong 7.",
        "review_detailed_main": "If it as possible to rate it 7.5 that'd be the prefect rating. It was a good 6 till about the last 20 minutes. Good twist at end. 7.5 is my rating. Enjoy this movie because it's thoroughly enjoyable. And this is coming from someone who hates Simon Pegg."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sleemice",
        "review_rating": "3",
        "review_title": "Boring, confusing, waste of time",
        "review_detailed_main": "This movie has some big names that I love such as Simon Pegg, Margot Robbie and Mike Myers. That's the only good thing I have to say about this movie. I honestly don't know what they where trying to achieve when they made this movie but it was a total failure as far as I'm concerned. It feels like you 're watching a combination of Inception, Punisher, with Harley Quinn in her first movie role. And for some reason all the main actors where/ looked like old men and I'm not sure if that was intentional but the end result didn't make the movie any more appealing or desirable."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "I_Ailurophile",
        "review_rating": "7",
        "review_title": "Slick, stylish, a bit overbearing - but entertaining",
        "review_detailed_main": "'Terminal' is nothing if not full of style.\n\nShots emphasize a singular point of focus, with one aspect invariably drawing our attention. That may be particular vivid color, notable lighting, a specific object, or some other arresting visual. This is true throughout the entire length of the movie; to be fair, it's certainly eye-catching.\n\nThe dialogue is full of wit and cleverness, immediately reminding one of the repartee we get from Guy Ritchie, or Quentin Tarantino. Whether writer-director Vaughn Stein's script matches such acclaimed company is up to any given viewer to decide for themselves, but it's decidedly entertaining, one way or another. It's worth noting that the bulk of that choice discourse is reserved for scenes between Margot Robbie and Simon Pegg; skilled actors that they are, I'm hard-pressed to think of scene partners more perfect for one another.\n\nThe plot progresses ever so slowly, with either the visuals and or the conversation being the real draw for most of the duration. It's only within the last half hour that one really feels the movement of the narrative - and yet, like the mystery laid out for the characters, this is all by design, and it's certainly been unfolding all along.\n\nSo it is, too, with the characterizations Stein has written. Robbie and co-star Mike Myers chew a lot of scenery - especially since there's a lot of it to chew - but it is 100% deliberate and built into the screenplay. These are portrayals that in other films might elicit derisive chortles, but purposeful as it is, and coming from performers of this caliber, it's entrancing. It is a gift that Margot Robbie, above all, is the chief star here - she has a great intensity to her gaze, her expressions, her delivery, that is impossibly alluring.\n\n'Terminal' seems a little bit self-indulgent - very wrapped up in its own cleverness and style, while feeling a bit lacking in substance. Even so, it's sufficiently entertaining, and not a bad way to spend 95 minutes.\n\nRecommended especially for fans of its stars; less recommended if you're looking for a deep narrative to get invested in."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "resumejoshc",
        "review_rating": "2",
        "review_title": "Amazing actors .. REALLY Average movie",
        "review_detailed_main": "It looks fantastic set wise and all the characters but its sooo damn boring.. Your just waiting for people to start killing other people just so the movie would be over.. A sub part final plot/twist does not make up for 120minutes of boring."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "timwinter",
        "review_rating": "9",
        "review_title": "Misunderstood British visual delight",
        "review_detailed_main": "Genuinely different, but with echos of sin city and The Cook The Thief, His wife and Her Lover; this visual feast, with a twisting plot and fantastic acting from all, has clearly been misunderstood and under appreciated. Well worth watching."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "d.rust",
        "review_rating": "",
        "review_title": "Dystopian Mind-grinder",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Glenn_K9",
        "review_rating": "7",
        "review_title": "Visually Spectacular",
        "review_detailed_main": "Margot Robbie disappeared in a role off her beaten path but in one that had to have been made with her in mind. There is a slight aroma of Harley Quinn though which sadly takes away from her poor choice of designing this new character. The performances in this film are captivating and it is not until the end where the entire puzzle falls together. Thankfully that was done in an hour and half. Well written, great plot, visually spectacular (my 7) a shy bit short on pace. I am glad I watched the end which put the whole perspective of the movie in place. Cinematography is duly the award winning scale tipper for this great film noir."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "wihry",
        "review_rating": "2",
        "review_title": "So disappointing",
        "review_detailed_main": "Two hitmen, one with whiskers, the other one named Vince, carrying around a black briefcase... rings a bell, but the sound is thin and flat. The imagery is visually pleasing at times, but that's about all. The characters - papier-mâché and not at all engaging, the plot - jumpy, convoluted... anything but logical, the dialogs - crappy, inexplicable. I really tried to reach the end, but after 45 minutes the movie should offer at least SOME fun."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sellranger",
        "review_rating": "4",
        "review_title": "Only Style on Display",
        "review_detailed_main": "Filmmakers wanted to show how stylishly they could light shots and how cleverly they could film scenes. And they did a good job with that. When they wanted to show how stylishly they could define a near future world or tell a compelling story, not so much. Candy for the eyes, stale cream of wheat for the brain. Kind of a waste of some excellent actors doing good work."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "13SecondFilmReviews",
        "review_rating": "",
        "review_title": "Margot Robbie and Simon Pegg; what could possibly go wrong?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "patriciogl10",
        "review_rating": "6",
        "review_title": "Fails to be unique.",
        "review_detailed_main": "Terminal is a film that tries too hard to be different. The visual style, the aesthetics, the plot twists and the story overall are somewhat interesting but it all falls flat during its own course. Twists, clever or predictable, don't guarantee whether a film is good or not, or whether it has a good ending or not. I believe that the movie uses those resources to look and seem \"cool\" but it ends up being completely average, in my opinion. Don't get me wrong, it's a decent effort, but far from impressive. Still, I was mildly entertained, so maybe if all those ingredients this film has to offer are appealing to you, then Terminal could be right up your alley. Me, I doubt I'll watch it again."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ilikeweirdstuffs",
        "review_rating": "3",
        "review_title": "Absolute garbage",
        "review_detailed_main": "I can appreciate some darkness in movies. But having every single last one of the characters detestable with no redeeming qualities, while at the same time dragging things out with self fellating artsy nonsense taken from better movies, to the point that the entire movie essentially lacks a plot and instead only has singular cardboard cutout events and characters and a ton of talking.... that is pushing it too far.\n\nI really wish directors who think that disturbing the audience is a valid replacement for creating actual excitement, fear, and suspense would get booted out of mainstream hollywood already. Along with all the critics who will gush all over any movie with praise as long as it does a few lighting tricks, and weird cuts for dat sweet artsy cred.\n\nDon't get me wrong the movie is absolutely beautifully shot, and the acting is nice, but the singular motivation throughout remains the one from the trailer: revenge.... And while that motivation is understandable in some of its incarnations, it's not so much in others.\n\nAlso everything ABOUT the variations of revenge is so hollow and grim and evil in every line and action that one comes away feeling dirty just having observed these characters for a while, as well as a sense of having been attacked. The only things it accomplishes are to make one feel really disturbed by a too creepy and sad portrayal of psychopathic insanity. So if that and a sea of artsy stuff is all you need to like a movie you'll love this one.\n\nGlorifying revenge is bad.\n\nGlorifying murder is evil.\n\nThis movie attempts to do both.\n\nThe only reason it might not succeed is because all the characters are actually detestable despite their cool demeanor. Plus sympathetic characters are revealed to be monsters. Which is thoroughly uncomfortable. But this means that if it isn't damaging because it glorifies revenge, it's damaging for being incredibly depressing. Seriously, even Tarantino movies are less depressing to watch.\n\nAlthough maybe this could actually be a meta cautionary tale against how hollow people become when consumed by revenge. Though with how low brow the artsy stuff in the movie is i wouldn't bet on it.\n\nIn either case a movie needs to have some characters the audience at least isn't creeped out by. This one doesn't. Its awful to watch awful people do awful things, so 3 stars."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "pabstcanrocketship",
        "review_rating": "6",
        "review_title": "A largely successful experiment",
        "review_detailed_main": "The way I see it, this film is an attempt to combine the icy cool bravado and mistique of a classic Film Noir with the understated dark humor the likes of which the Brits often enjoy. These are two very incongruous elements - traditionally noir might take some light-hearted or blasé turns, but it's not trying for laughs. It's not funny at all, really.\n\nBut this film IS funny. Not laugh-a-minute hilarious, but darkly funny and occasionally viciously playful. I understand why many responded poorly to it. I don't blame them, in the end. But I enjoyed it quite a bit. It's worth a try, if you're already considering it. But it's not for everyone.\n\nIt reminded me of Femme Fatale. One thing wearing another thing's skin."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "arnaldo_dutra",
        "review_rating": "1",
        "review_title": "A pure lost of time",
        "review_detailed_main": "Simply Awful; Do not reccomend. I do not know how Margot accepted to perform in a film like this. Bad fim for her filmography."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Yngwie_Wittevrongel",
        "review_rating": "6",
        "review_title": "A love letter to film noir.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "self-username",
        "review_rating": "1",
        "review_title": "Alternate name - Migraine",
        "review_detailed_main": "They just discovered another trigger for migraine - this movie. Uff, everything from the pathetic story to the plastic smile stuck on Margot robbie's overused face to the pretentious lighting and setup here combines wonderfully for a single purpose - to give you a migraine.\n\nDid they think this stupid pretentious piece of trash would make them money? Or did they believe this was artistic by any stretch of the mind?"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "anastaciajamfrey",
        "review_rating": "9",
        "review_title": "Surprisingly good compared to the reviews!",
        "review_detailed_main": "I was reluctant to watch this as saw the low ratings for it but I actually really enjoyed it! Some great twists and turns that weren't anticipated at all for once"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "shadow_blade-89459",
        "review_rating": "7",
        "review_title": "Attentive Viewers Required",
        "review_detailed_main": "\"Terminal\" (2018) is a twisting crime drama about a waitress named Annie, played by Margot Robbie, as she pioneers a take over from the concealed crime boss, Mr. Franklin. Through her escapades she encounters two assassins, Vince played by Dexter Fletcher and Alfred played by Max Irons, a terminally ill school teacher, Bill played by Simon Pegg, and an eccentric janitor, Clinton played by Mike Meyers. The film is chalked full of foreshadowing, which is a good thing since things become very confusing after the opening scene. There were times in the film where I was lost and wasn't sure what was going on, but the end makes it all worth it. There is a lot of mystery in this film that keeps viewers' attention as to not miss the little details that pay large dividends at the conclusion.\n\nVaughn Stein wrote and directed this film in a manner that is intended to keep the audience guessing. Even though the viewer may figure one thing out, there are so many other layers left to understand. The acting, though slightly anger inducing at times, was incredible for this story. For example, the way Vince treated Alfred would never be accepted in modern times, even as assassins. I think one of the main reasons this may not be considered a top-notch movie is that through all the attempts to conceal the finale, much of the film just seemed to be very jumbled. This can be a complicated watch if you are a viewer that doesn't give a film your full attention. However, I feel that if you can, this film is well worth a view."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "kaptenvideo-89875",
        "review_rating": "5",
        "review_title": "Harley Quinn movie doesn't need to be done, because Margot Robbie has already given her best!",
        "review_detailed_main": "Two assassins with a sinister mission, a fatally ill teacher, an enigmatic janitor and a waitress with a double life...\n\nMurderous consequences unravel as their paths meet at the hands of a criminal mastermind seeking revenge. Starring Margot Robbie, Simon Pegg, Max Irons, Dexter Fletcher, Mike Myers.\n\nIf you are a movie fan, and wished for something cool and sexy during this summer season, then \"Terminal\" looks like an answer to all of your prayers.\n\nSadly, all this coolness and sexiness can't compensate for uninspired writing - resulting in presentable but soulless story where there's not enough exciting stuff happening.\n\n\"Terminal\" is definitely intriguing in small doses but the quality of its individual aspects such as performances or atmosphere do not mesh into one satisfying whole. The crucial part gluing it all together - a strong story - is just missing.\n\nThe debuting screenwriter-director Vaughn Stein has tried to renew the noir genre - the classic American crime story -, adding modern touches such as dazzling visual side, Quentin Tarantino-style dialogue (the characters are cool and talk a lot), and bagful of nods to other works, including early Guy Ritchie works, superhero and modern spy movies, \"Alice in Wonderland\" and \"The Usual Suspects\".\n\nFreshening a classic genre with personal touch is nice in theory, but of course everybody is not Tarantino who can somehow pull this kind of thing off just about every time.\n\nThe movie mostly consists of writing for writing's sake, lacking inspiration or meaningful content. And it can be theatrical in a bad way: more interested in how the dialogue sounds and how the actors look like delivering it (a lot of close-up shots!), rather than having interesting things to say.\n\nNot judging by the whole but its individual aspects, \"Terminal\" has enough goods to earn a recommendation, at least for crime comedy fans. Stein has achieved admirable things in general, deserving kudos for that.\n\nWhat one probably notices first is the overall visual side. The atmosphere is just delicious: the noir's classic moody, shadowy aesthetics meet with glossy surfaces and screamingly strong and bright colors straight out of the most flamboyant of superhero movies.\n\nSecondly, the dialogue does have a distinctive feel - a kind of sensuality to it - which makes it captivating to follow, just like Tarantino's. Sadly, there's so much of it that at one point, one begins to wish for something interesting to happen instead.\n\nThe main actors listed above do admirable job also, although revealing much about the characters would end with spoiling the story, so I'm not gonna.\n\nThe biggest surpriser is veteran comedian Mike Myers of \"Wayne's World\", \"Austin Powers\" and \"Shrek\" fame, who gives an intriguing and enjoyable creepy performance, and demonstrates surprisingly strong acting chops.\n\nHe takes a paper-thin character and truly makes it his own. The walk, the talk, the facial tics... after all these years, the 50+ man looks like a great actor all of a sudden.\n\nUnusually cool-looking Pegg is also solid as a supporting character but he's almost always better supporting. As a leading man, he usually suffers from typical star comedian disease: a talent in need of decent movie. Max \"the son of Jeremy\" Irons is attractive as a young hit man too.\n\nBut the star of the show is undoubtedly Margot Robbie as the mysterious femme fatale. \"Terminal\" is basically the showcase of best of Robbie, taking everything good about this versatile and talented actress, pressing it into one juicy entertainment grenade.\n\nThe character feels much inspired by her turn as Harley Quinn in the superhero movie \"Suicide Squad\", and will probably be better than the whole of her future independent Harley Quinn project.\n\nRobbie is just phenomenal here, so confident and sensual that her carefully measured performance commands the screen every second she appears on it. A true star power!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "TheInfiniteFormula",
        "review_rating": "3",
        "review_title": "Don't believe the positive reviews",
        "review_detailed_main": "This movie is utter rubbish. Tries to be kind of heavy but fails at every corner. I struggled to watch it in one sequence. Had to stop it and watched it later to the end coz it bored me to death."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "tabuno",
        "review_rating": "7",
        "review_title": "Colorful But Slow And Missing The Tight, Sustained Intensity",
        "review_detailed_main": "Not be confused with the Tom Hank's The Terminal (2004) this film noirish film involves a mysterious woman played by Margo Robbie (I, Tonya and Bombshell) who is supposed to kill several people in return for exclusive rights to work for dark, sinister character who works behind the scenes. Margo offers up a decent, alluring as well as charmingly aloof character. Yet, she is let down by the uneven tone and slow pacing of the script. The movie doesn't have the expected witty charm of the wry, dark-humor of the captivating female assassin in Miss Meadows (2014) or the Jodie Comer's seriocomic psycho-assassin thrills found in Killing Eve (2018). Terminal instead has more of the style and pacing of the espionage thriller The Tailor of Panama (2001) but adds a darker more colorful garish motif. But it is the script that lets the audience down with its much plodding pacing that fails to sustain a compelling engagement with the audience like John Cusack character gets to survive through in the delicious seedy, mystery thriller The Bagman (2014). One curiously distracting casting distraction is Dexter Fletcher as the not so nice Vince. Maybe nobody else would notice how coincidentally the deliciously delightful Tom Hank's Dr. Henry Goose character in sweeping sci fi epic Cloud Atlas (2012) would have brought an amazing contribution of creepy vitality to the movie. Finally, Terminal just lacks that tight intensity for its climax in comparison to the nicely edited, well-crafted delivery with its powerful reveal in the mystery thriller Lucky Number Slevin (2006) or the intensely fun assassin thriller with its number creative twists and turns in 2 Days In The Valley (1996). Audiences would to better to consider: The nicely crafted mystery thriller of Bad Times at the El Royale (2018), assassin comedy of The Matador (2005), crime comedy of Confessions of a Dangerous Mind (2002), the riveting crime cult classic The Usual Suspects (1995). Of course there is always the David Lynch off-beat mystery thriller classic Mulholland Dr. (2001)."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "namstonk",
        "review_rating": "5",
        "review_title": "Hmmmm, far better than the original reviews",
        "review_detailed_main": "I've stayed away from this movie for a while based on reviews, however finally got around to watch and was pleasantly surprised. The director has skill and clearly has the scope to go further as a director, his visuals are excellent, not so much with script/dialogue though, too much waffle. The actors are well cast, even Pegg pulls his lazy ass around as opposed to the usual I'm in love with myself scenario. Some would call this a film noir but with a modern twist, it's not, the ending will prove that and will truly annoy after such potential, in the end you just wanna say, \"oh shut up\"."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "filmtogo",
        "review_rating": "6",
        "review_title": "Margot Robbie is Mad-as-a-Hatter.",
        "review_detailed_main": "Another dive into the magical world of \"Alice in Wonderland\". Margot Robbie is an Alice, a Mad-Hatter or is she something else entirely? She definitely has fun exploring different kind of layers of her character who is somehow involved with a lot of guys...like Simon Pegg or Mike Myers, both acting wonderfully in and out of their standard roles. Visually Terminal fits into the world of Blade Runner and Sin City and you wanna stay a little bit longer in the \"End of the Line\"-Café, this shabby little café in which most of the story takes place. Director Vaughn Stein delivers a beautiful first film. Not so beautiful is the writing (also by Stein). Despite the last 10 minutes the movie has a massive lack of tension. Why should we care about any of those characters? Who are they? What does the film wanna tell? Well. We don't get the answers for a very long time."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "pirzadaj",
        "review_rating": "5",
        "review_title": "Interesting",
        "review_detailed_main": "The story was interesting and it was a good cast, but I can't say it was SO awesome and I was SO entertained. Margot Robbie was good and nice to look at and I liked the film noir style. If you like the cast then you'll probably be entertained. It just won't be a movie you remember forever."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "pupluv592",
        "review_rating": "7",
        "review_title": "Cinematography makes it worth it.",
        "review_detailed_main": "It's a little slow but the cinematography keeps you in it and the end is pretty awesome. A treat for anyone who finishes it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Hotepsekhemwy",
        "review_rating": "5",
        "review_title": "Plodding",
        "review_detailed_main": "I enjoyed the ending. The first 45 minutes of the movie is slow. The movie was more like a puzzle. The dialogue between The characters did not have any substance. The movie start to make since in last 45 minutes. But, If you like the movie unusual suspects (Kevin S) and Secret Window (Johnny D). You will probably enjoy this movie."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "nlpirolo",
        "review_rating": "8",
        "review_title": "Margot is such a beautiful creature",
        "review_detailed_main": "Margot is such a beautiful creature. Good actress..."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "adamgill-45012",
        "review_rating": "7",
        "review_title": "Ignore the Accent - Enjoy the Movie!",
        "review_detailed_main": "OK - I'm British, so I was bound to cringe at Margot's \"London-ish\" accent which was - at best, twisted - at worst, strangled. I picked the title because - well, the cast of Margot Robbie and Simon Pegg intrigued me. I also saw Mike Myers on the cast list and sucked my teeth a little but, still - in for a penny... in for a pound!\n\nWith Sin City-esque (2005) film noir undertones, the story line focuses - in the main - on one night in very close quarters around a (London?) city train station. The attention to some detail was novel - the old money and dress styles placed the film somewhere between 1974 and 1990 - my guess is early 80's from the location shots other scenes - but that is purely incidentals, and I digress...\n\nAs the movie progresses, sufficient back story fills in some of the gaps - but you can't help yourself from trying to guess the plot as it unfolds. And that plot stutters at first, as you try to orientate yourself to the presentation style - which is very much comic-book. You can almost imagine moving from pane to pane across a page. The shadowy, nighttime contrasting darks and lights drew me to compare the cinematography to Dick Tracy (1990) - which is not a bad thing.\n\nThe story line itself is clever, if not a little strained. You'll need to suspend disbelief that all of the \"required\" characters can be brought together for a climactic period which has been allegedly plotted and schemed out over a protracted period of time. The weaving back and forth gets dizzying as the plot progresses into the final quarter, making you wish you'd paid more attention throughout!\n\nThe acting was - again, for the most part - very good. Notably bad was the dumbing-down of what I assume was intended to be an \"East End\" gangland script, ably supplemented and portrayed by Dexter Fletcher - sadly destroyed (ironically, since he is actually Camden-born) by the wooden-ness of Max Iron's delivery. To be fair to Max - he clearly spoke the script as provided - so I'll have to put the blame on the screen writer. Margot Robbie's part to play gets a 6 out of 10 (sorry - the accent wobbling all over the place was way too distracing!), Simon Pegg gets an 8 for a solid performance, with Mike Myers coming in around an 8, too (bearing in mind we know Mike has roots in the UK, so it's all good!)\n\nI enjoyed this film as a quirky piece which has some stand out moments. The all-too-sudden lapse into gore was a little disappointing and, as others have commented, that finale tied all of the lose ends together but, ultimately, lacked \"closure\". I gave it a 7 - it could've been an 8 if I wasn't so distracted by Margot's accent which, if you're not British, won't bother you in the slightest!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Mac_McFly",
        "review_rating": "3",
        "review_title": "Cheap femme fatale",
        "review_detailed_main": "The first hour and a quarter of the movie I was wondering what in the hell was it about, but the remaining fifteen minutes everything makes sense, though it doesn't mean an improvement.\n\nThere is a twist, well more than one actually, but as many can be predictible, there is one that took me by surprise.\n\nMargot Robbie try so hard but I just don't believe her femme fatale, she feels so Harley Quinn, speaking of which, the film is like a lame attempt of style from Guy Ritchie films with some Suicide Squad on top , with a bad use of neonish photography.\n\nThere is no ovation for any actor or actress in this one, much less the messy direction from Vaughn Stein, which I think was way too ambitious on his directional debut.\n\nNevertheless, Terminal is not an unwatchable film, there might be a slight chance to be liked by a few because is not so pointless after all, just maybe too overcooked."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ahmed_elhijri",
        "review_rating": "1",
        "review_title": "Heart attack",
        "review_detailed_main": "Like seriously.. i'm planning to suicide after watching this movie!\n\nReally really disappointed."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "RosanaBotafogo",
        "review_rating": "6",
        "review_title": "Only the final 10 minutes were perfect...",
        "review_detailed_main": "Two killers on a sinister mission, a terminally ill teacher, an enigmatic janitor and a waitress with a double life. Their lives intersect and their fate will be decided by a criminal mastermind who expects revenge. It follows the trajectory of several characters: two assassins with a sinister mission, a professor with a fatal illness, an enigmatic janitor and a waitress with a double life.\n\nTrying to like it, trying to follow along, trying to connect, but it's not being so easy and fun... It's not bad, the plot is slow, very slow, the second half takes a breath with the unfolding of the facts and the function and past of each characters , I like dark humor and cold irony, but they are not enough to make us fall in love, a light pastime, it just passes... Only the final 10 minutes were perfect..."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Ashleymyers",
        "review_rating": "1",
        "review_title": "Harley Quin Again",
        "review_detailed_main": "Basically Margot Robbie is annoying AF in this show. Couldn't stand more than one episode"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "kanenasanonas",
        "review_rating": "6",
        "review_title": "Well acted, beautifully shot but thats all.",
        "review_detailed_main": "The film hardly gets 6/10.\n\nActing was good to superb by almost every cast member. Most scenes where beautifully shot (superb lighting by the way) but thats it.\n\nStyle over substance with a script containing plot holes the size of manhattan. Actually the entire film could have been a music video clip. There are films that style matters (remember Sin City?), they actually had a solid story too.\n\nBlame the writer(s) for this one."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "fabian-ruf",
        "review_rating": "4",
        "review_title": "very annoying movie",
        "review_detailed_main": "The storytelling of this movie couldn't be worse. Characters are just there, no context given and most of the time (before I turned it off after about one hour) I was wondering whats going on. just dialogs seemingly going nowhere... in the beginning it got me curious, but after half an hour I got annoyed, gave it another while and turned it off happily.\n\nThe style was way over the top, the colouring and lighting just way too much. should have put the effort into the character development."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "emmanuel-m",
        "review_rating": "7",
        "review_title": "Exotic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "tommagnenorbom",
        "review_rating": "1",
        "review_title": "A terminal bore",
        "review_detailed_main": "Thr movie is supposed to be a neo noir but comes across as an unfunny comedy. It's neither intelligent nor exciting and it feels about twice as long as it really is. My advice is:Avoid."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "feev",
        "review_rating": "9",
        "review_title": "Awesome... Different... Cool",
        "review_detailed_main": "Super enjoyable.... Very clever and fill of surprises ... Hope this director gets his due AND continues making great movies like THIS 👍👍👍"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mrsinemax",
        "review_rating": "7",
        "review_title": "Cinematography, just cinematography.",
        "review_detailed_main": "One of the worst, meaningless scenario that I've ever seen. But when you try to look from a different perspective, an angle for criticizing only cinematography and pure acting, I think that's is the secret sauce of this film. Trying to change the components and breaking the barriers of the movie structure. Showing, tend to tell the interactions by odd dialogues and wieldy colors. This quotient of the film is seductive and that is the reason why I gave 3.5 out of 5."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jo_men_visst",
        "review_rating": "2",
        "review_title": "Reminds me of Black Mirror... In that I just want it to end.",
        "review_detailed_main": "I loved John Wick 1 & 2. I greatly enjoyed Atomic Blonde. I love Tarantino flicks and I am excited as Guy Ritchie releases each new outing. Hell, I even greatly enjoy stories inspired by Alice in Wonerland. I've loved to watch Simon Pegg since Spaced. Mike Myers needs a comeback. And Margot Robbie makes for a stunning femme fatale.\n\nWhy do I bring this up? Well... Because, simply. This film had all the right elements. And a great cinematographer who I hope gets great gigs from this. The only thing it doesn't have... Is a script worthy of the pieces it's built around. It wants to be a clever noir filled with chocking twists and turns. But after 30 minutes all twists were severely telegraphed and by the hour mark all threads were effectively over and done with. But this director decides to wave the script in my face and prance around with endless montages of stuff we've already figured out just to show me how clever he is and... because he had to pad it out to a contractually obligated 90 minutes.\n\nIn that way it reminds me of Black Mirror. A lot of effort put into an uninspired mess. And after half of the story ImI groaning at the screen JUST BLOODY END ALREADY!\n\nSimon Pegg was a delight as always though."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "eddiecatone",
        "review_rating": "4",
        "review_title": "35 minutes into the film and...",
        "review_detailed_main": "....and nothing happens. It looked promising, we get the whole \"Sin City package \" of neon lights, dark hallways, guns and briefcases and lap dancers, Margot Robbie looking cool in different outfits and Simone Pegg dodging awkward situations... yet nothing really happens and instead we get quick cuts and flashbacks and main characters meeting up exchanging supposedly witty and clever dialogues, that are not that witty nor clever. So I decided to quit. Who knows maybe the rest of the film is a Masterpiece, and maybe the beginning is crucial for the plot...judge for yourselves. I gave up."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "merpman-94402",
        "review_rating": "7",
        "review_title": "Margot is very talented, but this movie not so much",
        "review_detailed_main": "I have been waiting for Margot to find that role that allows her to exude her full ability as an actress. I thought that Harley Quinn would be it, and it should have been, but they didnt let her loose and the script was lame. This movie was similar, it suggested alot, promised much, tried to deliver, but not quite. Being a brit though, i was surprised how well down she had the accent. Not just the voice either, the way she speaks, moves her mouth, had me convinced.\n\nMovie is better than its current IMDB rating for sure, but its trying to be something and not quite coming together, lacks a punch."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Kittycat63",
        "review_rating": "1",
        "review_title": "Words Fail Me 😵",
        "review_detailed_main": "I watched this randomly on Amazon Prime because I was searching for a Jack Nicholson film and, predictably, other films came up in the results too, including this one and it was the last day it was on Prime. So, I took a chance and, despite widely varying reviews, decided to give it a go. MISTAKE ! ! My god .. What a stinker of a movie. It's atrocious. 😝 The storyline is crap, the settings are murky and annoying, Margot Robbie's attempt at a British accent was laughable and it was all over the place, the Alice in Wonderland references are repetitive and boring and ...well, need I go on?! Just AWFUL. I only suffered my way through it in the hope that, somehow, it would get better along the way. IT DIDN'T!! Ironically, about 5 minutes from the end my laptop froze and I had to go back to the internet when it unfroze, by which time the film had run out on Amazon Prime (to see it for free) so I then would have had to pay to see the ending! Because I'd almost given up the will to live at that point as the film had bored me almost to death I couldn't have given a damn about those last few minutes and was just glad to get it off my laptop screen!\n\nNot in a million years could I recommend such a sh** movie!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "cswfq",
        "review_rating": "6",
        "review_title": "Too scary",
        "review_detailed_main": "I definitely will have bad dream tonight.its is a good criminal film but it's dark basic color will be too scary"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "christopherlake-87252",
        "review_rating": "4",
        "review_title": "Seems familiar...",
        "review_detailed_main": "Blatant Tarantino rip-off. I was hopeful with the combination of actors but was more disappointed as the movie went on. The hand gestures, the dialogue, the scene structure, the reverse chronology, the overall atmosphere are all just low-rate imitation. I love Tarantino, so I suppose that's why I gave this film 4 stars. I understand that people are influenced by others' work, and QT himself does a lot of things similar to some his film idols, but this is ridiculous. It's like they chopped up a few of his films and made an awful plagiaristic collage. I feel like even the actors knew deep down, and the performances suffered because of it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "linamorenog",
        "review_rating": "6",
        "review_title": "The Usual Suspects, The Prestige, Pulp Fiction and Nighthawks haphazardly quilted into one movie",
        "review_detailed_main": "Visually beautiful, entertaining, lacking depth, cohesion and originality.\n\nThis film is a constant tip of the hat to Edward Hopper and his \"Nighthawks\", Christopher McQuarrie's Keyser Söze, Luc Besson's Matilda or Nikkita, Tarantino's \"Pulp Fiction\", Lewis Carroll's \"Alice in Wonderland, and Jonathan Nolan's and Christopher Nolan's \"The Prestige\".\n\nUnfortunately by minute 7 of the film, the poor choice of casting of a heavily made-up Mike Myers, immediately gives away the \"first\" climax of the movie (don't worry, the makeup is so plastic that I'm confident I'm not giving anything away here). I stayed because of the lovely Hopperesque photography, for the beautiful custom designs and for my affinity with the writer's/director's taste in movies and artworks.\n\nBut regrettably, Mr. Vaughn Stein's script feels more like a handful of beautiful fragments of dialogue written on the back of envelopes and napkins over the years and haphazardly quilted into the above-mentioned movies; which results in a visually beautiful noir half baked idea, with good performances by Margot Robbie and Simon Pegg, that plagiarizes the storylines and characters of the works above mentioned, more than it pays hommage to them."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Iloveparis660",
        "review_rating": "3",
        "review_title": "Script was so bad",
        "review_detailed_main": "Script was so bad, it made everything hard to watch. Plot made no sense, even from an artistic standpoint. Visually amazing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "andygd-42063",
        "review_rating": "8",
        "review_title": "Doesn't deserve such a low score",
        "review_detailed_main": "Not the greatest movie but it doesn't deserve the low IMBD score or the poor reviews. It's entertaining and visually stunning if a tad slow paced. The acting is spot on and it has just enough twists to be interesting."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "xxsnakexx-39768",
        "review_rating": "7",
        "review_title": "Barely pleased",
        "review_detailed_main": "Terminal tells us an abstract and mysterious story that doesn´t take form until the last minutes in which, despite the few messages it manages to scatter haphazardly throughout itself, the attempt to twist the end as much as possible feels like a last-minute try to make sense of an ultimately aimless plot. This film catches you from beginning to end, with incredible performances, mesmerizing soundtrack and perfectly carried out stylistic elements. However, the lack of an actual story to tell makes us uncertain of what we've watched, by the end of it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "andrewinet",
        "review_rating": "2",
        "review_title": "In-terminably terrible.",
        "review_detailed_main": "'Terminal' looks really good at first but the neon and overused shadow soon becomes tedious. Like the director is trying to dazzle you with flashy lights while hiding the total lack of substance in the mostly dark screen.\n\nEditing and pacing are similarly ham-fisted but worst of all is the script: badly structured, ideas underdeveloped or overextended, dialogue mostly dreadful, and the denouements either stupidly obvious or stupidly far-fetched. It really is bad.\n\nMargot Robbie is wonderfully watchable as always and Simon Pegg (cast against type) does well too, but they're working with material like a fifth former's fan fiction. Max Irons and Dexter Fletcher try hard and fail, though with even more dismal dialogue and, er, \"plotline\" it's really not their fault - unless you count them agreeing to be part of this in the first place.\n\nWorst of all, however, is Mike Myers. Totally miscast, his presence creates even greater imbalance and telegraphs at least two of the twists. Nor has he the acting chops for a rather dark role; indeed his famous face and comedy CV suggests someone thought this was sort of blackly humorous piece.\n\nIt's not. Nor is it dramatic, or thrilling, or clever, or groundbreaking, or even a good homage to its embarrassingly obvious influences (Blade Runner, Sin City, etc). Nor does throwing in references to Lewis Carroll p4 Shakespeare quotes add intellectual heft.\n\nNo, all this amounts to is a monumental waste of money, talent and time."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "artera-27398",
        "review_rating": "1",
        "review_title": "I did not like anything, boring and predictable.",
        "review_detailed_main": "It seems to me a movie without a soul, it is a movie that shows off the beauty of its protagonist, if you don't like it, don't watch it, it's a waste of time.\n\nOf course, the protagonist is a true beauty."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "constantin-andronic-270-622019",
        "review_rating": "6",
        "review_title": "so so",
        "review_detailed_main": "Not to bad not to good and bit boring till the end..."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mike-73962",
        "review_rating": "3",
        "review_title": "Swing and a miss",
        "review_detailed_main": "So looks like the director is trying and failing to be like Guy Ritchie.. this movie is no where near paced nor as good as anything Ritchie has done. As far as entertaining, its not terrible. I only watched this for Simon Pegg. Margot Robbie is (IMO) not good in this."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "govetter",
        "review_rating": "7",
        "review_title": "Lovely!",
        "review_detailed_main": "This thang was keeping me entranced ALL the WAY!\n\nI have always admired Dexter Fletcher. And with Margot Robbie as that 'bottle-blonde'! The cinematography was excellent! She is amazing with Simon Pegg! Another amazing writer/actor! I have loved his 'world' since my first exposure of Shaun Of The Dead! Even his work in the Star Trek production was mega Impressive! Terminal has a Drama about it that is odd to me... I AM convinced that the Soundtrack Music makes this movie float! (I always pronounce 'Robie' as 'Rowbee' it sounds better to say ' Margow Rowbee'! What an AMAZING aussie! That OST is EPIC!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "cgraves04",
        "review_rating": "4",
        "review_title": "Interesting idea, mediocre execution",
        "review_detailed_main": "This was a decent idea for a film, but it was just disappointing to watch. I won't repeat what other reviewers have said. I'll just say that the film dragged on for so long that it took all of the oomph out of the twists, especially because the twists were lazily developed to begin with. They were easy to guess not because the movie is full of clever clues that subtly point you to them but because they're the only logical explanation for some events and/or the set up is so blatant that it's hard not to see them coming. I really love being surprised by a good twist, but nothing in this movie surprised me. The script was a tortured parody of a Guy Ritchie film peppered with heavy-handed references to Alice In Wonderland, and half the time I just wanted the characters to shut up. I kind of liked the stylized design, but there was nothing unique about it. It just kept making me think of Sin City or Brazil.\n\nIt was worth the watch if only for Margot Robbie and Simon Pegg, whom I thought both delivered nice performances and whose scenes together were by far the most compelling. Tbh, you could've just plucked them out and made an excellent movie with just the two of them alone--although I like the idea of overlapping, semi-related stories taking place and coming together to provide a background for why everything is happening. I also like that it isn't obvious who exactly this film is about until the very end. But overall, I think it's too middle of the road, so it comes across as either trying too hard or not trying hard enough. I wish they had either a) kept it simple and forgone the overwrought script and most of the goofy atmospheric stuff in favor of something a tad bit more realistic or b) pushed it to the extreme and made it ten times more campy and crazy."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "guilhermerpedrollo",
        "review_rating": "6",
        "review_title": "Amazing photography, but disappointing ending script",
        "review_detailed_main": "The photography and the style of this movie is amazing, perfecly executed. The acting is very good. The narrative, acting and photography style catches the attention, because they are in sync. The story is intringuing and ellaborated, but at the end it is quite disappointing The movie makes you expect more of the characters. There are three plot twists (all three hinted, but one still surprising). At the end there was one major plot flaw and a few disappointing expectations."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "iquine",
        "review_rating": "4",
        "review_title": "Like Eating a Bunch of Sparkling and Colorful Skittles",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "waywardroute",
        "review_rating": "8",
        "review_title": "Don't let the poor reviews fool you",
        "review_detailed_main": "This is one hell of a surprise. It's a stylised colour noir that breaths fun and happiness of filmmaking. Let's get this straight, noir is a specific genre, and a specific convention. If you expect a real, gritty, naturalistic approach you won't get it. So no point in watching this just so you can complain about. This is a fantasy story. It's graphic, and flamboyant. The acting is spot on, the cinematography is impeccable, the director has all narrative threads evolve and come together, nothing is forgotten and neglected.\n\nThe characters are typologies, are bigger than life, are in your face and so enjoyable constructed. Assassins, murders, crimes, light and shadow, guessing, always going forward; Grab a bag of popcorn, and enjoy some good ol' filmmaking"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "hjboon",
        "review_rating": "6",
        "review_title": "Too dark, not funny",
        "review_detailed_main": "Very fine story, very fine actors. Too dark, too twisted, too strange. So, very much not my cup of tea.\n\nBut because of the excellent actors I'll rate this a 6."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "El_Critic",
        "review_rating": "3",
        "review_title": "Movie suffers from terminal boredom",
        "review_detailed_main": "I waited, and waited for this movie to get to me. But even after I'd finished it, I had to consult the internet to better understand the plot.\n\nThe acting is good, especially from Margot. But good acting couldn't even save this slow-paced movie.\n\nI understand that some movies work well with slow build-ups, but at least make the finale worth the wait."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "bryan-930-337366",
        "review_rating": "4",
        "review_title": "Too much talk, too little substance",
        "review_detailed_main": "The characters seem to love to talk and hear themselves talk but the result is a slow paced, drawn out story with not much happening much of the time and occasional violence for shock value. Could have been much better with a better script. Good cast wasted."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "bemyfriend-40184",
        "review_rating": "2",
        "review_title": "Boring Pretentious Fluff",
        "review_detailed_main": "Whoever made this neo neon retro movie, was impressed by Pulp Fiction. The tongue-in-cheek attempts at cheeky humor are annoying. Tries to be surreal, but seems more contrived. Seen on Tubi, the free streaming site; which now has live TV."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "o-jaroudi",
        "review_rating": "6",
        "review_title": "A thriller that simply failed to materialize",
        "review_detailed_main": "What started off as an entertaining and witty dialogue between Bill (Simon Pegg) and Annie (Margot Robbie) with a promising plot, broke down to what can be described as a corny film with a lousy and shallow plot twist that doesn't leave the viewer with any sense of awe. As a matter of fact, all I felt by the last 30 minutes or so was utter disappointment. It was as if the writers had rushed to wrap up the script in order to meet a deadline. The rich and original performances of Pegg and Robbie, as well as the imaginative presentation of a neo-noir world (which can be credited to director Vaughn Stein and cinematographer Christopher Ross), were overshadowed by a dull twist of events. There were countless ways to go, but it seems everyone involved in the creative process of writing the script wanted to take the easy way out, and that just won't cut it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Hiair",
        "review_rating": "2",
        "review_title": "Good casting.",
        "review_detailed_main": "Never saw such an immature, annoying, unoriginal and unengaging screenplay/direction since my days of film school back in 2008. All the recent reviews defending the movie are obviously posted by the director's circle of friends, if not himself."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ib011f9545i",
        "review_rating": "6",
        "review_title": "there was a reason why it was cheaper.",
        "review_detailed_main": "I had heard nothing about this film,don't remember any reviews. I saw it in a dvd shop for 4 pounds less than other new dvds and bought it. There was a reason why it was cheaper,it is not very good. the good things about it are that it looks great. Fantastic neo noir neon lit sets. Margot Robbie is just beautiful in this and her acting is pretty good. But I did not enjoy the film much,it is a lot less clever and original than it thinks it is."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "pambosk",
        "review_rating": "2",
        "review_title": "Terminal pain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "wwvierg",
        "review_rating": "10",
        "review_title": "i'm laughing at all the pissy reviews; this flick was awesome!",
        "review_detailed_main": "Dark?, yes. visual?, yes. good cast?, fantastic. surprise ending?, indeed. soundtrack?, great. do yourself a favor and ignore all the negative reviews and give this a roll ... you won't regret it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "brokemenace",
        "review_rating": "6",
        "review_title": "An entertaining film but not as good as it could have been.",
        "review_detailed_main": "Just watched the film and it was okay. It's not terrible. One could say it has a personality, even if it's a little weird.\n\nThe set design, costume design and visuals of the movie are very good in their simplicity. They're the best thing in this movie along with the cinematography. The cast were all brilliant in their roles. The soundtrack is also really good. All these people did a great job.\n\nNow, the dialogue was a bit pretentious and full of references, good at times but just awkward in others, in the end, it didn't blend well with the rest of the work. the editing was good and in others it made no sense, it could have been much better. the twists didn't really surprise me, there were hints over the whole movie that were easy to pick up on so i guess they failed in that too.\n\nOverall, the movie clearly had a vision but it just feels dry and boring, it lacks that factor that pulls you in completely. But i still finished the whole thing so, they did an okay job. As a thriller it did what it had to do, thrill me. I just wish it did it better.\n\nMaybe I'll change my mind next time I watch it but right now, this film is forgettable."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "3",
        "review_title": "Messy, misjudged and, in the end, just quite boring.",
        "review_detailed_main": "'Terminal (2018)' is just so messy and misjudged, relying on a bizarre and occasionally 'trailer-like' structure that often results in irreverently irrelevant plot-strands and a floaty feel that sees most moments slip by with an almost utter non-urgency. This leads to an experience that isn't engaging, often isn't pleasant and certainly isn't as clever as it clearly thinks it is. I'd cottoned on to its two biggest twists incredibly early on, while most of its other reveals come out of nowhere and don't really matter to the point they could be considered tangential at best and immaterial at worst, though certainly not surprising. On top of the generally abrasive characters and the lack of a proper driving force, there are some real problems with perspective. The picture often feels unsure as to whom it wants you to root for. When it finally makes up its mind about that, it seems confused as to why you ought to do so; really, it doesn't convey any compelling reasons for you to be engaged with anyone on screen. This leads to some bizarre and strangely unsettling sequences in which we're suddenly asked to change allegiances and excuse the cruel, almost sadistic behaviour of another character simply because we now know of their real motives, which doesn't do anything other than further distance us from the flick's core players and prove that the filmmakers don't really understand their own material - or, rather, the effect it will have on its audience. This is especially relevant as it pertains to who is the 'hero' and who is the 'villain', the indistinguishable nature of which would be a nice theme if it were explored properly and not cast aside for a last-minute revenge plot that asks us to root for, ostensibly, a text-book bad-guy just because the person they're hurting has done some bad things in the past. Let's not forget, however, that everyone in this dingy little piece has done terrible things on or off-screen at one point or another and that our 'protagonist' does stuff to rival most of it, no matter what their motivation is (I'm sure all the characters have had rough lives, by the way, it's no excuse). Overall, there are some interesting ideas and moments that have potential, but nothing ever comes to fruition and there's never any proper entertainment to be had. There aren't any genuine characters to invest in, things don't really pay off in a satisfying way and, when it comes down to it, it's not really all that enjoyable. In the end, it's just quite boring. 3/10"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "brianmaxwellcom",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Please don't watch this you will waste an hour and a half of your life"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ebeeselaar",
        "review_rating": "6",
        "review_title": "Just okay",
        "review_detailed_main": "Expectations was way to high before watching. The movie had good actors and twists here and there. But overall it was just okay"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "rossr-35845",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever seen",
        "review_detailed_main": "About halfway through \"Terminal,\" my wife turned to me and said \"We can turn this off if you don't like it.\"\n\n\"No, let's keep going,\" I said. \"If we stop now, I'm just going to wonder if we gave up just as it was about to get better.\"\n\nReader, it did not get better; in fact, it somehow managed to get worse. The story is confusing from the outset, though I initially assumed (too generously, it turns out) it was intentional: non-linear storytelling is a useful-if a bit overused-way to advance a story while slowly revealing everyone's roles within it. When it's done right, you get \"Pulp Fiction\"; even when it doesn't quite work, there's still some fun to be had in seeing how the writer pulls together all these disparate story arcs into one final act (\"Lucky Number Slevin\" comes to mind). With these labyrinthine plots, viewers will endure pretty much any amount of setup, as long as you make it worth their while in the end.\n\nTrusting that it would be worth my while in the end, I sat through scene after scene of Margot Robbie trying to exude a perfect blend of mystery, danger and sex appeal. She does manage to strike that balance, in that she fails equally miserably at all three. With the notable exception of Bill (Simon Pegg in a customarily entertaining performance), the few breaks we do get from Robbie are no better: Vincent (Dexter Fletcher)'s irascibility is entertaining for the first few minutes, but quickly grows stale. His partner Alfred (Max Irons) serves little purpose beyond as a way to move the story on to the next scene. One minute he's human velvet, a suave, assured ladies' man; the next, he's salivating over strippers like he's never seen a (clothed) breast before. Even a good actor-say, for example, Max's father Jeremy-would struggle with a character this poorly-written. Max doesn't stand a chance. Mike Myers turns in a solid enough performance as Clinton, the night supervisor, though it's soured by some truly uninspired acting during the big reveal at the end.\n\nI held out hope that my patience during the interminable middle acts would eventually be rewarded. It was in vain. Not only does \"Terminal\" fail to justify its plodding, self-indulgent existence, it almost does the opposite. About 3/4 of the way through, with practically zero warning, one character's horrific true nature is jarringly revealed; we barely have a chance to digest that information before *poof!* they're gone. At that point, the wheels truly come off, including a scene in which one character essentially admits to the viewer that an entire subplot of the film serves no purpose.\n\nIt all culminates in a \"twist\" ending that viewers will mostly see coming a mile off. There are a few elements of the climax that are truly surprising, but only because they're so unnecessary and, frankly, idiotic that it's genuinely astonishing that they ever made it past the first draft of the script, let alone into the final cut of the movie.\n\nAnd then, mercifully, it ends. I only wish I'd throw in the towel when there was still something left of my night to salvage."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "BogotaBoy",
        "review_rating": "7",
        "review_title": "great cloudy mystery until the end",
        "review_detailed_main": "I was intrigued by the convoluted characters and weird actions and Robbie is central and eye candy. All the cast are well selected and do a great job. The setting is very much other worldly adding to the mystique and very much unclear in the beginning where the story is or where it is going. It took till over halfway thru that the action picked up in clearer direction but still not on target until the later part of the story fit all the pieces together and went well beyond early conceptions for a surprise ending. No need to listen to the bad comments -- I found it very enjoyable and well done. I rarely write reviews in IMBD but felt compelled here."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "bowmanblue",
        "review_rating": "5",
        "review_title": "Style over substance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "burlesonjesse5",
        "review_rating": "4",
        "review_title": "VIEWS ON FILM review of Terminal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "T_ana",
        "review_rating": "10",
        "review_title": "Better than I had expected!",
        "review_detailed_main": "First I will say that this movie was not at all what I was expecting!\n\nI saw this at the shops and thought of buying it, but decided to first look up and was convinced not to, as it didn't have the best rating (though I didn't read the reviews), though there are many movies that have low ratings, but I quite enjoy. I then saw it on Google Play Movies and, because there was a Black Friday special, decided to give it a go.\n\nI was disappointed that I hadn't trusted my gut at the shops, but glad that I had rented it, as it sure didn't disappoint! Also, it has Mike Myers. What better actor?!\n\nIt was cast well and the visual effects... well, they were good. The plot was really good, though simple, but it could have been improved. The casting, though, was superb! I did find the accent that Margot Robbie put on a bit... it wasn't satisfying and a bit ditzy in the trailer, but I didn't mind it as the movie went on. The story was a little all over the place, but tied itself up quite nicely in the end with some twists, though, some of it was predictable.\n\nAll in all, I wasn't expecting much from this movie, but got a pleasant surprise with the final result! Would I recommend this? Yes, I sure would!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "furianogameplays",
        "review_rating": "4",
        "review_title": "Oh my.",
        "review_detailed_main": "This movie is strange to say the least. If you like weird experiences, go for it. But beware. The ending may cause you confusion, vomit or the urge to punch the screen."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "soundoflight",
        "review_rating": "5",
        "review_title": "Missed the Train",
        "review_detailed_main": "If one wants to create a clever, intriguing film, the general way to go about it is to write an exceptionally clever and intriguing plot. What \"Terminal\" has taught me is that there is a second way: take a typical and cliché story, put it into a blender, and dribble the story out in random, incoherent bits and pieces. That way, the audience is left guessing until the end as to what the heck is actually going on. Except that it appears many of us still figured it out by about 1/3 in.\n\n\"Terminal\" has some interesting style and Simon Pegg and Margot Robbie are always highly watchable actors, so that (barely) got me through it. Unfortunately it was all wasted on a dull story."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Colonelpotts",
        "review_rating": "1",
        "review_title": "BLADE CHASSEE (that's generous maybe \"Blade Crawl\")",
        "review_detailed_main": "What a fly infested bucket waste of the enormous talents of Robbie, Pegg and Fletcher. What were they thinking? (Of the finca farmhouse it bought them in Ibiza probs). DystopIan Beal nonsense garbage, supported by a frail 80 year old smoker walking home from Spoons strength plot of unintelligible, twerpish scenes and unoriginal transatlantic dirgealogue. After half an hour the build up of debris between my toes became more fascinating."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "apostoles-65519",
        "review_rating": "5",
        "review_title": "Just to pass your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "TheTruthofItIs",
        "review_rating": "4",
        "review_title": "Watchable, but barely",
        "review_detailed_main": "Terminal's strength is in its familiar elements: its dark, neon environment recalls \"Blade Runner\" and it plays like \"Pulp Fiction\". So if you like derivative films then you'll like, otherwise you'll criticize like most others here. The movie is unrated but I didn't see anything more than PG-13, and that's a further disappointment since Margot Robbie played a pole dancer at night and showed nothing, plus she's in short-order waitress wear most of the time, so further disappointment. The story itself is a double-cross revenger so no new ground broken there. Don't waste your \"movie night\" on this one, it's more one to play in the background while you're tablet-surfing or cleaning the living room."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "bigjonrowe",
        "review_rating": "8",
        "review_title": "Blond bombshell",
        "review_detailed_main": "No way this is a less than 6/10 movie just watched it and was expecting 7.5/10 at least on here?? Very strange!! I gave it 8/10 a bit different from your cgi super human x man, avenger type BS I suppose."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "JoeytheBrit",
        "review_rating": "5",
        "review_title": "Terminal review",
        "review_detailed_main": "Dark, self-consciously quirky tale set in an anonymous city that succeeds in standing out from the crowd, but not always in a good way. Luscious femme-fatale Margot Robbie weaves a web around a bunch of hapless males, but the plot grows increasingly ludicrous, and seems to take forever to reach its conclusion."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mattjames1973",
        "review_rating": "4",
        "review_title": "Written like a somewhat talented school student's drama project on noir",
        "review_detailed_main": "For a while, Terminal threatens to become a properly interesting and highly stylised psycho noir movie, but rapid disintegrates under the weight of cliche, unnecessary devices and simply awful writing. The dialogue and plot development feel like the cut scenes in a video game c2004. Most of the character reveals are entirely predicatable, the one that isn't is so silly and unnecessary as to be doubly irritating.\n\nI admire directors and actors willing to take a risk and do something different, and I did genuinely like this up to a point, but in the end I'm simply amazed that such an ensemble of actors with plenty of opportunities to make better and/or better paying movies would sign on for this. OK, Dexter Fetcher and MIke Myers do exactly what they always do, but what on earth was Margot Robbie thinking?"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "braquecubism",
        "review_rating": "2",
        "review_title": "Really hard to say what I think- form over substance saying nothing.",
        "review_detailed_main": "The visuals are really stunning, colorful neon. Original? more Blade Runner vamped up to Neon fantasy, All form, no substance. there is no narrative, or little there that makes no sense. So dialogue that says nothing, scenes that make no sense. The end is disjointed. It is all meant to create an effect with nothing behind it. Rather than feel it is inventive or experimental, it seem to have an agenda to \"surprise\" and astound\"'.\n\nI have to think that the actors, like Simon and Mike, did their scenes without having an overall view, trusting that the film maker had a real vision (that worked). Some reviewers said there was a surprise ending with a twist- At the end I don't know what I was watching, it made no sense. It seemed the whole thing had no purpose, and nothing to say. so while it was trying to create an effect, definitely a fantasy, it was much ado about nothing. there seemed to be gratuitous violence (bloody) not even tied to a plot point. the end was supposed to some kind of reveal; it wasn't. \"Revenge\", I guess so.\n\nin a weird way, it remembered me of \"Last Year at Marienbad\" the iconic French film by Renais. Because it was visually stunning, Last Year in black & white, without a narrative. Scenes that were evocative, but left you, the viewer uncertain. I got Renais' explanation after I watched it 3 times; he wanted to make a movie of pure emotion. Suddenly, it made sense. Like Abstract Motion Expressionist, Pollock, Frankenthaler, or totally non-objective. Kandinski.\n\nTerminal fits the bill- but without the success. the 2 stars are for the stunning visual."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "alexis-21-81191",
        "review_rating": "5",
        "review_title": "Tries too hard and fails harder",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mnemic-33873",
        "review_rating": "2",
        "review_title": "Pretty obvious",
        "review_detailed_main": "I like the actor/actress choices cast for the movie but this was pretty terrible. If anything surprises you, then I envy your never seeing a \"thriller\" before."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "kellylynn8982",
        "review_rating": "8",
        "review_title": "Negative Reviews are Rubbish!",
        "review_detailed_main": "I thought I'd be dissatisfied by looking at the reviews but post watching this combo of actors I was left satisfied. Don't believe the negativity. I won't talk about movie I itself to not spoil it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Hughmanity",
        "review_rating": "5",
        "review_title": "Fake reviews",
        "review_detailed_main": "This movie looks cool and has an all-star and very talented cast (with the unfortunate exception of Mike Meyers who is still acting like he's in an Austin Powers sequel) and it all goes to waste with a plot that rarely surprises. There is much dialogue that thinks it's clever because it references worthy works of literature, tries to be pithy and uses British accents, but is mostly just boring and repetitive. Even Margot Robbie's beauty and considerable acting skills aren't enough for me to want her to keep talking about various ways to die.\n\nThe stylized noir look (read: lots of neon signs and the least daylight since 'Dark City') is cool for a while but by the end feels overused and makes it difficult to suspend disbelief. I felt like I was watching a continually hosed down set with a neon sign Snapchat filter as opposed to being taken into some cool fantasy world.\n\nThe plot is very straightforward and not original: hit men trying to kill each other. Emphasis on men being the idiots and doing the dying because it's PC to have a clever woman pulling the strings on dumb, good for nothing men being killed. What's annoying is that the story gets unnecessarily complicated not in service to the plot, but in service to its relentless pursuit of stylistic scenes with English Lit 101 quotations.\n\nMaybe some people really did like this movie. Maybe style > substance or they were so smitten with Margot that they didn't care about the actual words coming out of her mouth. I'm not going to say don't watch this movie because maybe you will be one of the smitten and that's fine. For me it just wasn't all that compelling after I got over the eye candy treatment at about the 10 minute mark."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "chris_robbo_23",
        "review_rating": "2",
        "review_title": "Quite disappointing.",
        "review_detailed_main": "After watching Margot Robbie in I Tonya I added a bunch of her upcoming movies to my watchlist including this one. It's starts well with a hint of intrigue and then gets quite predictable and sloppy.\n\nIt is filmed and acted a little bit like a colourful Sin City. Margot acts pretty well but the script isn't really up to it. The villains are weak and it has a twist at the end that I saw coming from 10 minutes in.\n\nI'm afraid you should give this movie a pass, there are many more better movies than this out there to kill 90 minutes."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "SubhanBakhtiyarov",
        "review_rating": "5",
        "review_title": "British Harley Quinn, Tarantino's Pulp Fiction and Blade Runner.",
        "review_detailed_main": "I really hope that this film will remain Vaughn Stein's last film writing experience.\n\nHonestly, I suppose that they decided to start making the film like this: + Hey guys, you know Harley Quinn's tremendous fame after Suicide Squad, Why don't we shoot a solo film for her? But this time let's do something different.\nWhat about making something like Pulp Fiction?\n+ Yeah! Exactly.\nPlus, I really love Blade Runner, let's add loads of neon-lighted scenes (I mean really loads)\n+ Wait a minute, What about a screenplay?\n\n\nI know it is too absurd but let's admit that it is absurd as much as the film. The first time I saw the trailer I thought that finally, we would see an amazing action film in 2018. Unfortunately, that didn't happen. The storytelling style and, indeed, the plot literally ruined the film. The film uses a lot of plot twists and shock reveals and I think the only reason made me watched the film to the end is that. To be honest, I am not a fan of Margot but I have to admit that she perfectly delivers her character and as always her evil smile is amazing.\n\nLet me summarize. For the first 20 minutes, you say \"it will be amazing\" Between 20 and 60, you say \"What the h**k did you do, Vaughn Stein? Okay, maybe I am overreacting, let's see what will happen at the end\". Finally, at the end of the film, you say \"Vaughn Stein, Look, buddy, just don't do it. Okay? Please, don't do this.\n\nIn the end, if you have enough time to watch lots of films, watch it. However, if you have little time. It will get your nerves at the end."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "Terminal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "chrischurilla",
        "review_rating": "5",
        "review_title": "Hot Mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "filipmarlou",
        "review_rating": "8",
        "review_title": "A Diabolical approach to \"Through the Looking-Glass, and What Alice Found There\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "cinebev",
        "review_rating": "1",
        "review_title": "Alice in Blunderland",
        "review_detailed_main": "The prophetically titled \"Terminal\" is one of the worst movies in existence. It exemplifies everything wrong with post-nineties cinema. It is flashy, hollow, pretentious, vapid, meandering, obnoxious, smug, boring, stupid, and utterly pointless, which is not to suggest that the story isn't worth telling because there is no story. Literally. It's ninety-nine percent borrowed style and one percent Mike Myers, who embodies the worst casting decision since Mickey Rooney as Mr. Yunioshi. As for the rest of the cast, they are less a cast than three confused Englishmen who radiate a collective longing for the iconic, if merely competent, dialogue and direction of Guy Ritchie whilst a since matured Margot Robbie tries just a little too hard to steal their scenes. Scenes that ultimately amount to an inadvertent parody of the rapidly depreciating noire and cyberpunk sub-genres, and leaves you feeling simultaneously lobotomized and hit by a train."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "au-30182",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "I thought this is best movie but this is one of the flop movie ever . I don't advise you to watch this movie. Dont watch this movie 🍿🎥 and waste your time. The movie was an utter disappointment. Its plot felt scattered, lacking cohesion, leaving gaping holes that made it hard to follow. The characters were one-dimensional, failing to evoke any emotional investment. The acting felt forced, devoid of authenticity. Additionally, the cinematography was uninspiring, offering nothing visually stimulating. Overall, a forgettable experience that fell far short of expectations.one of the folp movie ever."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "fatimahbatool-01443",
        "review_rating": "5",
        "review_title": "5",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "umimelectric",
        "review_rating": "5",
        "review_title": "Stylish, but a messy story",
        "review_detailed_main": "Eye-pleasing cinematography, stylish design, and a charming performance by the lovely Margot Robbie are all high points for Terminal, though I'm afraid these positives are still not enough to save it from its narrative mediocrity. Much of the film is an attractive, convoluted mess; the final bit at least pulls it all together in a way that helps it make a lot more sense, but its reasoning still feels like a reach. I'm sort of left wondering why...what was the point of this film's creation? If it exists only to flex its superb style and colors, then I suppose they deserve a 5.5/10; if it's attempting something more, then I'd rate it something less. I'll assume the former."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "tasha-05814",
        "review_rating": "8",
        "review_title": "Interesting",
        "review_detailed_main": "I enjoyed this movie. It was kind of confusing in the beginning as I was not sure what was happening. This is the kind of movies I like. Mysterious and unpredictable. I was extremely happy with the ending. I like unexpected endings."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "chmstewart",
        "review_rating": "5",
        "review_title": "A 3 dressed up as a 9",
        "review_detailed_main": "I really enjoyed this film at the get go, but was left feeling betrayed by a predictable conclusion. There was some clever dialogue and wit through the first half of the movie. Margot Robbie really is a remarkable actress especially when playing emotional unstable characters and Simon Pegg puts in a terrificly solemn performance as a dying school teacher.\n\nUnfortunately the moment of discovery is rushed and poorly done. The plot twist is so thinly veiled that I had hoped for some other more clever back story that might save it, but there was none. What had the promises of a clever and well acted movie flamed out all too abruptly.\n\nOverall a letdown."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "grahammceneaney",
        "review_rating": "5",
        "review_title": "Different widescreen format?",
        "review_detailed_main": "If this movie was filmed in a 2:35:1 widescreen, then why would they put out a 1:85:1 widescreen version when they released the DVD?"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "toph-phillips",
        "review_rating": "4",
        "review_title": "Margot is great as usual",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "shortsnum",
        "review_rating": "1",
        "review_title": "Bad experience.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "funtasticfour",
        "review_rating": "5",
        "review_title": "Boring with a few bright spots...",
        "review_detailed_main": "I love Simon Pegg and Margot Robbie...but this is far from their best work. Not that they were the bad part, it just wasn't interesting. I could tell what they were going for, but it just wasn't exciting or visually interesting. I almost stopped at half way but it picked up a tiny bit."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "varantaz",
        "review_rating": "9",
        "review_title": "Simon Pegg",
        "review_detailed_main": "Simone pegg was xxxxx brilliant in this movie. What a superstar"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "bradinhanson",
        "review_rating": "9",
        "review_title": "Are people starting to have preconceived notion prior to watching a film these days?",
        "review_detailed_main": "Everyone is beginning to expect too much. Yes holleywood has raised the bar with lots of movies recently and boy has it been a treat. But I fear our expectations are outgrowing our imagination and our love for simply being entertained. This movie for me does just that. It is highly entertaining. Noir films for me are especially special treat due to my dark sense of humor. I originally gave this film an 8. But after reading the reviews and seeing all the negativity and all the 1's. (Which reminds me how does any movie deserve a 1? There's always some redeemable quality in a movie that should at least give it an automatic 2 or above, unless it's sharknado!) I decided to turn my vote into a 10. It's unbelievable how many haters there are. Stop watching CNN!!!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jamesanthonyosborn",
        "review_rating": "9",
        "review_title": "3 levels of messages. Stylistically crisp. Needs a few viewings to actually get to the bottom of this.",
        "review_detailed_main": "So much more here than you originally know. Enjoyable on several levels."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "robertemerald",
        "review_rating": "8",
        "review_title": "Cockney neon noir is a stunning visual confection",
        "review_detailed_main": "You have to be patient with the first half of this movie. And if if British cockney banter is not your cup of tea you will struggle. Simon Pegg adds formidable balance to that aspect, but you'll still need to be patient. Luckily in the competent hands of a really good script and some very able actors that shouldn't be a problem, particularly if you are admiring the perfect moody late night lighting, which moves from city vista to echoing spooky corridors, to platforms, and to dead end rooms that nod to the 1950s. I wasn't kidding when I described this as neon noir. A splendour worth beholding (they use really good cameras). And.... if you happen to be a literary fan of Alice In Wonderland, the cockney prose will probably tickle as well (I'm not such a fan, but that didn't seem to hurt my enjoyment, in fact, such references seemed to be a perfect spice). I liked the camera angles and frames, and the way at odd times they tried something different. Good editing I thought. The characterisations are excellent, but not groundbreakingly original, save the Mike Meyers character. They are at least perfectly cast. You'll probably guess what is going on but that probably won't spoil your movie. It's the sort of movie where they give so many clues away anyway that I think they allow for that, and it shouldn't spoil anything (you probably won't get it entirely). For me, Terminal needed something truely brutal to open the proceedings, and could have done with some beginning narration. Given the Alice references that seemed to me to be something that would have worked, but that's me. Certainly Terminal is an accomplished piece of modern noir artistry, and is well worth a look."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jrneptune",
        "review_rating": "8",
        "review_title": "Some might say it started with a slow burn but it has a dynamite ending",
        "review_detailed_main": "It started off a bit slow for me. I did enjoy the cinematography and the music, very well done. The script was interesting and witty.\n\nIt did seem like it was a bit disjointed the first hour but the last 30 minutes and the ending are a blast and I don't want to give away how it brings together what you saw previously.\n\nIt reminds me of 'The Usual Suspects' (1995) a favorite of mine but done in its own unique way."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "anhaveit",
        "review_rating": "10",
        "review_title": "I can not believe this negative useless reviews",
        "review_detailed_main": "The film has some great actors in this. The plot is dark Has many twist to it.And may bewilder a simple mind ! Margot Robbie was excellent in this as the string puller .Highly recommend"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "maryhaase",
        "review_rating": "8",
        "review_title": "Excellent to watch",
        "review_detailed_main": "I seldom write reviews, however the poor ratings make me stop and pause. The banter between characters was witty and added a nuance to the story. I thought the use of the light and neon highly stylized the point of the movie. It reminded me of Sin City or Snatch. Very enjoyable and my kind noir."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "nyreeadennis",
        "review_rating": "10",
        "review_title": "Whoa",
        "review_detailed_main": "I don't even see why this movie has negative reviews. This movie was brilliant"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "gideon_remmerswaal",
        "review_rating": "8",
        "review_title": "The most people do not understand what movie is about, this movie is great.",
        "review_detailed_main": "If you don't like this movie, I can understand its not everyones cup of tea.\n\nIf you give professional movie critics and gave this movie a 6 or below you don't have any knowledge about movies.\n\nGET ANOTHER JOB!\n\nA good movie doesn't always have to be an over-acted drama.\n\nI'm really annoyed by those professional critics."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "xmaxlutz",
        "review_rating": "8",
        "review_title": "Didn´t know what to expect...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "gremlin1990",
        "review_rating": "10",
        "review_title": "Incredible film noir for our time",
        "review_detailed_main": "What a film! Visually so stunning you can't look away. Margot Robbie is enthralling as Annie and the whole cast give incredibly accomplished performances. Vaughn Stein's direction is intelligent and interesting. The twists were unexpected. Would highly recommend. A new classic film noir."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "PalmTreeCloud",
        "review_rating": "9",
        "review_title": "Go beyond the usual...",
        "review_detailed_main": "Sleeper. Intriguing. Visually appealing. Slow burn but worth it. I enjoyed the cinematography and use of color. Dialogue reminiscent of stories from a good book. Likely not for everyone."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "comuro",
        "review_rating": "10",
        "review_title": "Ignore the bad reviews",
        "review_detailed_main": "People putting bad reviews are the corrupted ones raised with next gen CGI and who expect movies to be all the same (Marvel's anyone?). I don't even understand why people would expect this to be a sci-fi movie, and badly review it for not being like star wars... If you like the movie and think it doesn't deserve a 5 or less, review it with a ten to counter the hate toward the non carbon copy of the movie the kids were expecting to see before reviewing it. The story is great if you do not have the attention span of a goldfish, and even if it could have been better in some aspect it is still great. Don't hate, watch it, enjoy it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ginocox-206-336968",
        "review_rating": "9",
        "review_title": "An abundance of style, substance and talent",
        "review_detailed_main": "Terminal (2018) is a very stylish and stylized film with a talented cast, a very intelligent script, a Byzantine plot, numerous allusions to works by Quentin Tarantino and Lewis Carroll, and a surprise ending. The cinematography is great, with a lot of texture and vibrant colors that pop out of the murky shadows and a refreshing paucity of jiggly-cam shots. The film is minimalist, with five main characters and three primary locations for most of the action. It is not without its faults. It definitely doesn't start with a bang, but builds to a simmer that can test the patience. The plot is a bit contrived. Between the plot contrivances and the highly-stylized imagery, it is difficult to suspend disbelief. The violence isn't far removed from what might pass for primetime network fare and the sex is 99 44/100ths percent suggestion, with nothing steamier than a few passionate kisses and a visit to that strip club in the land of mid-American television fantasy, where the dancers are nice girls who don't remove their clothes. It is a bit like There Shape of Water (2017), which I confess, I haven't actually managed to finish viewing. It's very beautiful and an impressive achievement, but the style is more accessible than the substance.\n\nHowever, the performances are quite good. I found myself engaged with each of the five main characters. There are enough subtle elements, that one will want to view the film again to appreciate the allusions that may have escaped notice on the first viewing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "marcfraser-90960",
        "review_rating": "9",
        "review_title": "A Real Find",
        "review_detailed_main": "I loved this movie. I don't tend to read reviews (although sometimes the star rating on Amazon tends to influence my decision to watch). The movie came up as a recommendation on my Amazon Prime/Video page so I gave it a go and was very glad I did. It is very surreal, very 'noir' and has many twists and turns in the plot. It also has a cracking cast! It feels a lot like a cinematic adaptation of a stage play too - maybe one day we'll see it on stage...? who knows! Anyway, big thumbs up from me."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "berabi",
        "review_rating": "10",
        "review_title": "Not the usual Hollywood toot",
        "review_detailed_main": "Worth a watch; particularly for a British audience or those bored of the standard, predictable Hollywood guff being mercilessly turfed out and peddled as if it's new or brilliant. This actually has a developing storyline with some epic twists and a violence throughout which is justified. The New York Times et Al. don't have the intellect to understand it but if you're looking for something genuinely different, exciting and twisting; definitely give it a go."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "gabriel78",
        "review_rating": "9",
        "review_title": "Brilliant.",
        "review_detailed_main": "A very well done movie. Alfred Hitchcock like. Twist after twist. Definitely recommended."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "KikyNez",
        "review_rating": "9",
        "review_title": "Who said mystery is a lost art?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "pscot-36687",
        "review_rating": "10",
        "review_title": "Underrated, Great Movie!",
        "review_detailed_main": "This was a great movie! I completely disagree with the critics. I made an IMDB account just to leave a review for this movie. I thought it was engaging, interesting and definetly worth an hour and a half of my time. If you like clockwork orange or pulp fiction I think you will like this too. Though they are very different I would say it has the same feel at points throughout the movie."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mlwright-75842",
        "review_rating": "9",
        "review_title": "Cult classic",
        "review_detailed_main": "Good cult classic. If you're a fan of assassin films or Alice in wonderland or film noire films chances are you'll enjoy.\n\nEasily going to be a marmite film.\n\nGood plot twists - some more obvious than others. Most easily guessed - either myself or my husband figured all out (with disagreements on some here or there)\n\nMargot Robbie and Simon Peggy build a great standing point and while it does give Harley vibes - any insanity / violent Margot Robbie film know is going to and it isn't an exact Harley feel. And she plays it well.\n\nGood British films will typical British accents which always work out well.\n\nSin city vs malice in wonderland vibes only missing Danny dyer."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "kimcoxmonm",
        "review_rating": "9",
        "review_title": "Very darkly entertaining.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Woodyanders",
        "review_rating": "8",
        "review_title": "Down the rabbit hole to noir nirvana",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Cinemafan11",
        "review_rating": "8",
        "review_title": "Margot Said That This Is Unique..And yeah..she said the truth..",
        "review_detailed_main": "It is a thrilling mystery fullfilled with crime..a great story..you need to concentrate so you never miss a detail..it's a 'small details matter' type of film..and Margot is just Amazing..she did a great job..You Gotta Watch it!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "aarongallagher1-547-697122",
        "review_rating": "10",
        "review_title": "8/10 really but wanted to bolster the unfair rating",
        "review_detailed_main": "Interesting, well acted, different, classy, dark, shall I go on? It's not a master piece but 90 minutes we'll spent. All 4 main characters are interesting and extremely well played. How anyone could score it 1/10 is beyond me"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "minty100",
        "review_rating": "8",
        "review_title": "More for the intellect?",
        "review_detailed_main": "All the negativity I've read nearly put me off. I'm glad I don't always believe what I read. I really did enjoy this film, maybe my humour is equally as dark. Giggled instead of yawning."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "dazw",
        "review_rating": "9",
        "review_title": "Much better than i thought....",
        "review_detailed_main": "The first thing that you notice is how visually stunning this film is, the whole cast is fantastic and there really wasn't one bad performance. Margot robbie took up the whole screen in every scene she was in, not just a pretty face, her acting is mesmerizing. Why the \"critics\" panned this is beyond me, maybe we need different critics whose job statement just doesn't require them to harshly critique a film just to appear more intelligent....."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "foulianna",
        "review_rating": "10",
        "review_title": "This is the British Quentin Tarantino, you idiots!",
        "review_detailed_main": "Brilliant! Colorful! Clever! A piece of ART!!! I highly recommend it to all of you who have many years to see a good movie! (I can't believe the negative reviews, many shallow critiques by people who clearly know nothing about movie making and film art!)"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "pedenjas",
        "review_rating": "8",
        "review_title": "Watch it for yourself!",
        "review_detailed_main": "This is a classic double cross, shady, cheeky, \"naughty\" kind of movie. Cracking Sunday night movie or time filler. Don't understand why it's been given such a low rating. Try it for yourself"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "gothabillybiker",
        "review_rating": "10",
        "review_title": "Dont go by bad ratings....",
        "review_detailed_main": "Great movie. Dont listen to idiots who think they know how a neo noir movie should go. Maybe these reviews are American. Give it a go. Plot twists, beautiful lighting and Margot looking epic."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "hja-40674",
        "review_rating": "10",
        "review_title": "....darkness and depravity",
        "review_detailed_main": "And with that one line, I was sold on a movie. Darkness, depravity, the blackest of humour and Margot Robbie in snake-seamed stockings."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "chris_rocks",
        "review_rating": "8",
        "review_title": "More than expected!",
        "review_detailed_main": "Well knowing nothing more than the short summary over Netflix I skipped over it quite a bit. I just had a feeling it could be great but wouldn't be... turns out it was pretty damn good. I'd say just watch it, it wasn't until after I watched it that I saw these terrible reviews but I must say it was a great story and visually stunning."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "iangordonmiller",
        "review_rating": "10",
        "review_title": "Clever story. Beautifully shot. Great movie",
        "review_detailed_main": "Cinematography is superb. Clever twisty tale. Wonderful cast ensemble. If you like smart movies, you'll get this. The neg reviews represent the reviewers incapacity to view an art form objectively and interpret the concept as not how they would have done it. I suppose I have done the same."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "romulopierotti",
        "review_rating": "10",
        "review_title": "Why such negative reviews?",
        "review_detailed_main": "Although I understand that the majority of reviews are based on personal perceptions, I dind't understood the hate.\n\nSolid actings in an awesome dystopic \"neon\" world; oustanding visuals and photograph;, striking locations; mesmerizing OST and a good script well executed.\n\nWhat is there not to love about it?"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "djkaine",
        "review_rating": "10",
        "review_title": "Giving it a 10",
        "review_detailed_main": "I'm giving this a 10, because the bad reviews need to be balanced out. It's a solid 7 at heart, people on here love the smell of their own farts and really like to hear themselves talk. Give it a watch, it does give nods to a lot of different films and was entertaining enough for a single watch maybe a second one, nothing that will blow your mind. Margot does it the justice as she always does."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "paul_martin_rogers",
        "review_rating": "10",
        "review_title": "Brilliant film, brilliant acting",
        "review_detailed_main": "How can films such as Chef (0/10) receive 7.3 and this 5.3? This is a truly interesting film with a great plot and fantastic acting."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Ross_A_Hall",
        "review_rating": "9",
        "review_title": "A quirky, original treat",
        "review_detailed_main": "This is a really strange film. I'd not heard anything about it until it popped up on Amazon Prime, so went into it with no expectations or any of the critics' mallings.\n\nThe plot is a fairly convention cross-and-double cross thriller. Dispensing with action sequences, it's driven by dialogue and some quite compelling performances. Everything is stripped back to focus on just a handful of characters and simple sets.\n\nThere are quirky shots, a thread that becomes more apparent as the story progresses and Margot Robbie gives it her all. The scenes between her and Simon Pegg as they discuss life and suicide are fascinating.\n\nIt's not perfect - the end is a little hurried - but it's worth watching. Particularly if you enjoy quirky dialogue and characters."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "majds-33938",
        "review_rating": "8",
        "review_title": "Boring at first but full of incredible plot twists at the end",
        "review_detailed_main": "Gotta say I got a little bored by the middle of the movie and almost stopped watching it but it just switched in a second into this insanely mystery and plot twists which were incredible"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "jcrush-28-445782",
        "review_rating": "10",
        "review_title": "Great revenge movie",
        "review_detailed_main": "I love the way she takes control back over her life. Great girl power movie."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sashalinn",
        "review_rating": "10",
        "review_title": "Artistic modern noir film",
        "review_detailed_main": "This film has many layers to it. It's not for those who want mindless films. It's beautiful and the costumes are great. The acting is also wonderful."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "darrenlloyd",
        "review_rating": "10",
        "review_title": "Just brilliant",
        "review_detailed_main": "I was weary of some of the poor reviews but thought the cast and premise looked too good for it to be that bad. What a wonderful surprise that this film was such a delight. It builds slowly with some long scenes but they are gripping as the dialogue and characters are so interesting. As the plot builds and then things really take off in the second half, it just gets better and better. Margot Robbie, Dexter Fletcher and Simon Pegg are standout performers in this but the way that the story develops and comes to a climax just when you are ready for it makes this a very rare 10/10 for me. Add to that a great but dark soundtrack by Newton Faulkner and this is a future classic."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ljordan27",
        "review_rating": "10",
        "review_title": "Great!",
        "review_detailed_main": "No idea WHY this has a ~5 rating!! This was a very well done movie with a plot twist which I absolutely love! Maybe I am biased because I am a total Margo Robbie fan girl, but I personally don't think so. I love a good psychological thriller and this was awesome - I wish I could say it was a cross between movie A, B and C but right now I can't think of the proper movies to compare. If you like plot twist movies, you should like this - especially if you like any of the actors in this movie which is why I watched it! I was NOT disappointed! 😍"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "lamfcherry",
        "review_rating": "8",
        "review_title": "90's are back!",
        "review_detailed_main": "If you love Tarantino, Guy Ritchie, and the ninenties experimental films you will be fine with Terminal, great acting, scenarios, even the script its good, its dark, funny, eyecandy. Not a masterpiece but an enjoyable \"a la Sin City \" style film...definitely a cult movie!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "undagclaire",
        "review_rating": "8",
        "review_title": "I give it an 8/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "webhead-97553",
        "review_rating": "8",
        "review_title": "a very colorfull film-noir",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "layscar",
        "review_rating": "10",
        "review_title": "THE PLOT TWIST/ DC VIBE WAS EVERYTHING",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "atmobilemail",
        "review_rating": "10",
        "review_title": "An incredible film",
        "review_detailed_main": "I can understand why some people didn't like this movie; they expected to see Lost in Space or something to that effect. Terminal is a dark (literally), off-the-wall, eccentric, European movie that plays on mood and ambience. The colours are strong and vivid. The actors are superb - especially Margot Robbie. While I was never a Mike Myers fan, his role here was an eye-opener. An excellently paced and shot movie that I'll watch many times over."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "eleamalia-31365",
        "review_rating": "10",
        "review_title": "Very good",
        "review_detailed_main": "A very good movie ! I was impressed . The dialogue is excelent and the actors are the best ! I really liked it . I don't understand is this movie so low rated"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "maurodc",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "This is a film that is too well done, inventive and thrilling for it to have such awful ratings. I really can't understand it. I swear that I've seen a lot of movies and I can easily recognize a crappy one. The remake of Fantastic 4 is one of them, the overrated \"thriller\" film called The Dinner is also one of them, as well as Baywatch, The Mummy (another remake), Dead Silence, Batman V Superman...those are crappy movies. But not this one.\n\nWhen you watch the trailer of 'Terminal', the first thing you think it's that the movie is a complete mess with no logic, story or sense. And when I went to see it at the cinema, I was already prepared for that possiblility and with only one reason for watching it: Margot Robbie.\n\nBut turns out that I was completely wrong. It is an excellent thriller with a great visual neon-like style, very good acting from everyone (Robbie was magnificent and her character gets more scary as the film progresses), excellent script with tones of black humor (my favorite), shocking plot twists and a final act that leaves you with the open mouth.\n\nEnjoy!\n\n10/10"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "alkocakdoruk",
        "review_rating": "9",
        "review_title": "Really entertaining",
        "review_detailed_main": "This film is one of the best films ive watched this year. The interesting story really lures you in. I agree the final scene was unnecessarily long but other than that and some minor issues is great."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "iGlad",
        "review_rating": "9",
        "review_title": "A great little film with a great part by Dexter Fletcher",
        "review_detailed_main": "It's one of those films that should get a cult status had we still used DVD's but alas this will get lost in the rush. I enjoyed this as it kept you guesses you didn't quite know what was going on. There were sone clues thoughout and I must admit Mike Myers was great.\n\nDexter Fletcher played an exceptional nasty character and they used him to throw you off track a bit. Very good acting all round imho. It's worthy of an 8 but I gave it 9 for the many plot twists."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "tmed-81353",
        "review_rating": "9",
        "review_title": "I don't understand the dislike for this stellar movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "burgif",
        "review_rating": "9",
        "review_title": "Artistic approach",
        "review_detailed_main": "Beautifully done, filled with metaphors, artistic and literature references, this movie is for anyone but not everyone"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "westsideschl",
        "review_rating": "9",
        "review_title": "Gravity or Gravitas",
        "review_detailed_main": "Reviews mostly are either 1, 2, or 3 stars or 8, 9, 10 stars so you either love it or hate it. Curiouser & curiouser cries Alice, and like the script of Terminal which had some references to Alice in Wonderland it too was filled w/double entendres (figuratively & literally similar to the excellent series Orphan Black), metaphor, foreshadowing, allusion, situational irony. Dialogue where \"pathetic fallacy\" is presented (that is rare) as in this situational dilemma \"emotional turmoil is reflected in tangible surrounds\". Which then proceeds to the choice of \"gravity or gravitas\". Lighting and settings that reminded me of the original Blade Runner. Script had elements of classical film noir. Lighting, camera angles, props, clothing, makeup, sound effects all creatively presented unlike the mass produced formula robotic look-alike films being fast food produced. Endings, yes there were more than one - most all unexpected. Summing up - basically an intelligent sensory experience."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "ratari",
        "review_rating": "10",
        "review_title": "This goes on my list of \"Special\" films that I would keep a copy of.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "8",
        "review_title": "I like loyalty I can buy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "albrechtcm",
        "review_rating": "8",
        "review_title": "Something different but well worth your time.",
        "review_detailed_main": "From the Neon of some unknown city brightly lights up not only store signs, but all sorts of unusually attractive signs, including actors ad time shifts, to the empty café back somewhere in the subway station. this film keeps you on edge, trying to figure out just what's going on. But not to worry, it will come to you and the characters interact in swift-change scenes that you don't see coming. One viewer with me thought it boring and almost left, but I'm glad we stayed because it only got better as it moved along. While it's true that you'll probably guess the importance of some characters who normally wouldn't be important, you won't be disappointed and like any good presentation, they saved the best till last. 'Nuff said. Just pick up a DVD. If you're disappointed, sue me!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "davenash-97039",
        "review_rating": "9",
        "review_title": "Better quality than most",
        "review_detailed_main": "Great character development and twisting plot. The initially boring setting is transformed, and i wonder where and when it is based - the movie is timeless and juxtaposed with a well interleaved and understandable plot. This film contains the sort of writing most films don't quite have, I'd like to see more."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Mikeelliott58",
        "review_rating": "9",
        "review_title": "Old time film noir",
        "review_detailed_main": "Cast was excellent . Mike Myers playing a rare character and was a pleasing dramatic stretch for him.\n\nPay attention because a lot is going on..\n\nI took one star off for the use of rimless ammunition in a revolver with no clips.."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "motanupizdos",
        "review_rating": "10",
        "review_title": "Gave it a 10, to balance the.... It's an 8.5",
        "review_detailed_main": "I think, it's my second or third review, that i'm writing. It's not beacuse i do not love movies, or i do not understand english. IT'S JUST BECAUSE I'M VERY BAD AT TYPING AND EVEN worst at writeing. I don't get it: Why all the so called SF fans, tend to associate SF with SW or Marvel Universe only.I've seen so many BS reviews here, about this movie, that i feel obliged to tell you this: It's a beautiful movie, great story telling, amazing cinematography, great acting and directing, but for those who don't get it, it dosen't mean you have to trash it out. If this is not enough CGI or SF for you, or you do not empathayze with thr characters or story, please go back to the last Star Treck's franchise. I would not bully you. But please stop bulling, or low-rating movies like this one, (the budget does not matter), or movies like Arrivall, What hapennd to Monday, Annihilation, TAU,2036 Origin Unknown...(the list is so long....), just because you don' get it, ot hte CGI sucks in your opinnion. SF it;s not about the CGI that they can or not make it. IT'S only about you if you can imagime it. Wondr why, even the Nolans couln't make te Aas imov 's Foundation yet!? It is not because of them, it's brcause of you"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "iamosborn",
        "review_rating": "10",
        "review_title": "My kind of movie.",
        "review_detailed_main": "I loved the entire dark, clever theme and plot to this movie. It gave me some \"snatch\", \"lock stock and two smoking barrels\" nostalgia. Great work and great actors. Highly reccomend!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "kirbylee70-599-526179",
        "review_rating": "8",
        "review_title": "NEON NOIR",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Ive_Gorris",
        "review_rating": "9",
        "review_title": "Masterpiece !",
        "review_detailed_main": "What a movie with Margot Robbie !! Absolutely Brilliant !!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "rrh3-728-892657",
        "review_rating": "10",
        "review_title": "Better than I thought!",
        "review_detailed_main": "Well written and acted. Interesting throughout- stop the movie if you need to get up for anything."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "MadMischief",
        "review_rating": "9",
        "review_title": "In my top favorite movies list!",
        "review_detailed_main": "Upon watching this the first time, I'd purely started it to entangle myself in Margot Robbies excellent films and become more familiar with her acting.\n\nHowever, the neon aesthetic and run down, criminalized set up of the world they build left me breath taken.\n\nThe storyline is one of those that leave you asking questions halfway through, but then take all those stray strings and tie them into one perfect knot.\n\nThe thrilling feeling of this perfect, masterful writing was enough to make me squirm in my seat! The set up, and the climax was incredibly appealing.\n\nNot just that, but the acting and the chemistry of all the actors feels perfectly natural. There are moments I find myself forgetting that most of them had probably not ever met before this film.\n\nThe only downside is that they present a fantastical dystopian world that they hardly explore. I think at the end of the movie, there's room for another film focusing on other alice n wonderland related characters to further build this crime based city.\n\nIgnore the reviews that tear down the directors writing ability. There really is beautiful storytelling in this film and I highly recommend it to anyone who enjoys movies that make you theorize. This movie is very similar to Quentin Tarantinos writing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "donaldricco",
        "review_rating": "8",
        "review_title": "Of shoes--and ships--and sealing-wax--Of cabbages--and kings",
        "review_detailed_main": "I really enjoyed this, though it was hard to follow at times! Margot Robbie is so beautiful, painfully so! And she does a good job acting too! Mike Myers also turns in a good performance, as does Simon Pegg! Lots of twists, lots of timeline shifts. Dark and colorful at the same time, making it a bit surreal. And many, many Alice in Wonderland references. Confusing and entertaining!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "billytroywheeler",
        "review_rating": "8",
        "review_title": "A very good film if your an intellectual",
        "review_detailed_main": "Minimul spoilers..\n\nNot your average thriller. Seems to be all these negative reviews are based on the premise of not understanding the plot because they want to indulge themselves in their phones and surroundings. This film has a constant reference to a novel that makes the foundation and is revealed in the last 20 minutes. Every actor gave a phenomenal performance in portraying their character. This is an ORIGINAL film... The film does have plot twists and has a slight resemblance to sin city in it's setting, but hey we live in 2018 and moving pictures have been developed for over a lifetime... The idea of any new film not showing resemblance to another is just obsurd and does not take from its originality."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "joiningjt",
        "review_rating": "9",
        "review_title": "Ignore the haters, great noir film, Underrated!!",
        "review_detailed_main": "First off I'm so sick and tired of so many reviews where they compare directors or say trying to be such and such. Here a lot of people say the director is trying to be the extremely OVERRATED Tarantino, first it doesn't have tons of swearing like Tarantino, doesn't have men gay sex like Tarantino, doesn't have unnecessary violence like Tarantino, is nothing like a Tarantino ots a film noir and it hits every note. Everyone puts in a great performance, especially Margot robie, pegg and Meyers. Decentvstory it's a little confusing but comes together in the end. Ignore that reviews that dont get it. If you like film noir movies with great cinematography and great acting. Here it is!!! Bravo!!!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "damianphelps",
        "review_rating": "9",
        "review_title": "Way Better Than The Ratings",
        "review_detailed_main": "This is a genuinely entertaining movie, with brilliant dialogue, moments of wonderful humour and a healthy dose of noir.\n\nI simply cannot understand why this has been awarded such mediocre ratings...what were viewers expecting?\n\nThis movie is absolute entertainment :)"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "abdoamador99",
        "review_rating": "10",
        "review_title": "Watch it!",
        "review_detailed_main": "This film makes you immerse yourself in it , and believe me if you like Margot Robbie films you will love it, her performance in this thriller was phenomenal and maybe could be boring for some people but it worth watch it also the cinematography is so good."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "croonen",
        "review_rating": "9",
        "review_title": "A masterpiece",
        "review_detailed_main": "Lighting is beautyfull masterpiece. Every scene is a piece of art. Storyline is refreshing."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "craig_janeway",
        "review_rating": "8",
        "review_title": "More there than there...",
        "review_detailed_main": "Beautiful looking film and great acting with amazing talent, but falls a bit short with what feels like a made for tv movie. However, I gave it an 8 for the actors and film crew that did a great job. I think the director is really a director of photography and the actors carried the film all on their own? Had the film had a stronger director not the same person that wrote the movie, perhaps we would have seen some things we would expect in what could have been a very good film given the chance. It's not bad, just not great like it could have been. Better that the English played the big role in making it, or it really would stink if done by Hollywood imho."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "sempermotu",
        "review_rating": "8",
        "review_title": "Great cast and filming",
        "review_detailed_main": "Margo - on of the best in roles of crazy people. Great cast and filming"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "Cheryl-12-190273",
        "review_rating": "10",
        "review_title": "This movie BLEW MY MIND..........",
        "review_detailed_main": "It's like Film Noir combined with Japanese Horror flick with a Hitchcock script!\n\nTwists and turns and surprises that caused much snargling.....and I have to admit, I did have to totally cover eyes and ears and make a lot of noise to try to prevent the nightmares that I know that I am going to have.\n\nTreat this movie like an Agatha Christie movie..........watch the whole thing and pay attention........and do NOT walk away before the credits run. Trust me.....\n\nYou will not be disappointed. Kudos to the makers of this movie for giving such a great NEW idea. I love a movie that surprises me and this delivers big time!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "hyde_grrl",
        "review_rating": "8",
        "review_title": "Well worth a watch!",
        "review_detailed_main": "I was entertained from beginning to end. I loved the writing, the look and the plot twists. I guess you either \"get it\" or you don't."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "dleary69",
        "review_rating": "8",
        "review_title": "I just wanted to take a look to see if I wanted to watch it.",
        "review_detailed_main": "By the time I decided I was going to watch the film the twins were leaving the terminal and they were rolling the credits. I was just going to give it a peak to see if it was worth watching. I couldn't take my eyes away once I started watching because the story, seemingly obscure and a bit all over the place, was compelling and works in this situation. It's like watching a Frank Miller film like Sin City, with ever changing surroundings and plot twists that invariably take you through the full gamut of intertwined lives and stories, to it's inevitable conclusion. At the end, the entire film made sense and I was left amazed how fluid this confusing story actually was. The jumping around is deliberate and without it this film would have been boring, to say the least. I, for one, really enjoyed this film and without Margo Robbie as the titular psychopath with her expressive face that rolls easily from demure to psychotic, without missing a beat. Many people said they didn't like the film, and with some this is a kind way of saying how much they hated it. As a viewer, not a critic with my head in a dark place praising my cinematic knowledge, I enjoyed this film and I think it got a bad rep from people that set the bar way too high for this film noir. This film doesn't leave any loose ends, and leaves you satisfied that there were no secrets that the director left out, or added, that made no sense, like so many quick cut and run movies out today. I hope this film, not movie, makes some money in after theater sales, it deserves it."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "eduardomaxteel",
        "review_rating": "10",
        "review_title": "Mike Miyers,Simón Pegg Y Margot Robbie My Favorites.",
        "review_detailed_main": "Is different The story is deslineal but it makes it interesting, the performances of the actors who already mentioned I liked a little more Robbie his gestures and that, and the rest of the scenes and atmosphere seemed good. If you want to see something Different Terminal is the Option."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "athies",
        "review_rating": "10",
        "review_title": "Ugh! Those teeth!",
        "review_detailed_main": "Lovely mugging scene.\n\nHis limb is due to all those keys.\n\nOne more twist?\n\nLovely.\n\nI wish for more like this, but that would ruin them."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "wdxpbyjzz",
        "review_rating": "8",
        "review_title": "Haters couldn't find the light for the dark",
        "review_detailed_main": "Loved it all. Not going to go into the movie plot itself but this is a soundtrack that should be out there. Where can I get Newton Faulkner 'Down the Rabbit Hole' ?"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "goodbadbunny",
        "review_rating": "10",
        "review_title": "For intellectuals",
        "review_detailed_main": "This was a lovely twist of psychedelic delicacy! From the story line to the acting to the decor... Bravo!"
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "aab874",
        "review_rating": "10",
        "review_title": "Annie (Margot Robbie) and Bonnie (Margot Robbie)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "mjw2305",
        "review_rating": "8",
        "review_title": "A slow burner that's well worth the ride!",
        "review_detailed_main": "I watched this film, mainly as a Simon Pegg fan. I didn't really know what to expect and, to be fair, given the low score on here; I expected very little.\n\nThankfully I found a gem. Margot Robbie is deliciously dark and mysterious, Simon Pegg is subtlety brilliant and Mike Myers is perfectly nuts. The entire cast is perfect actually!\n\nThe terminal has a very dark comedic feel and is very stylish from start to finish. It reminded me of Guy Ritchie's direction at times and it took me a good while before the pieces of the story started to fall into place properly. But when everything did fall into place is was so satisfying, although maybe not completely surprising on all counts.\n\nDon't miss this one because of the low score. Terminal is well worth your time and turns out to be a solid 8/10 movie for me."
    },
    {
        "movie_id": "tt4463816",
        "movie_name": "Terminal",
        "movie_rating": "5.4",
        "review_username": "rubenblaedel",
        "review_rating": "8",
        "review_title": "I really enjoyed that movie",
        "review_detailed_main": ""
    }
]